{"aggregateRating": {"reviewCount": 58, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-10", "description": "Kotti Berliner Doner Kebab is one of my favorite spots at DeKalb Market, and I was happy to see on my most recent visit to the food hall that they had a weekday lunch special with discounted prices on the doner kebab, durum wrap, and salad. The lunch special wasn't exactly inexpensive, as the cheapest of the specials was $10.50, but most things in DeKalb Market are on the more expensive side.\n\nI opted for the $12 salad special instead of the doner kebab this time (although the focaccia-like bread that one comes with is great). The salad came with layers of salad mix, lettuce, onions, tomato and cucumber salad, cabbage, feta cheese, a yogurt-based white sauce, a harissa-based red sauce, and lots of chicken. I was impressed by the amount of chicken that was in the bowl, and it made the price tag a little easier to swallow. The chicken was excellent, very tender and marinated in lots of spices, the vegetables were fresh, and the whole salad worked well mixed together. I liked it so much that I might consider making the salad with an add-on of bread my regular order.", "author": "Marissa L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-05-20", "description": "I have a couple of issues with this place. First- they were SO SLOW. The guys working at the counter were looking at me like I was crazy while waiting for them to make my Doner. \nSecond- it is way to pricy for what it is. I know de kalb market is generally pricey but Doner is a street food- $12-$14 is too expensive in my opinion. And they charge extra for sauce, seriously? Toppings I can understand but not sauce. Ridiculous! \nThe end result was good, food was fresh but definitely not worth the price or anything to write home about.", "author": "Ally M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-29", "description": "The menu is small. There are only a few options, and they are essentially all the same dish: juicy, delicious, spit-roasted chicken with all sorts of colorful and tasty toppings. \n\nNow, you can get a wrap, and it'll be easy to eat, and a good time. You can also get a salad if you really don't like being completely satisfied with a meal, but still want the nice flavors.\n\nBut the Döner Kebab is #1 on the menu, and #1 in my heart. \n\nIt's the name of the stand for Pete's sake. It's their specialty, and wrapping up all the tasty items (just get everything) they have back there in Turkish pide...a crisp flatbread not too far off of focaccia...that's the move. It's the way this meal was meant to be eaten, and it also happens to taste the best. \n\nThis has become one of my favorite options in Dekalb Market Hall, and I'll be getting it again shortly.", "author": "Peter D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-19", "description": "Love this place. If your downtown Bk shopping or simply just looking for new places to try this is it. I have been there twice with the expectation that the second time wouldn't be as great as the first cause that's usually how it goes but NOPE it was just as good. I had the Kotti Berliner Döner Kebab which was on sesame crusted bread. Check them out!", "author": "Adrienne H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-01-24", "description": "Impressively quick.  Had the chicken wrap -- it tasted fresh and had an interesting taste.  I definitely enjoyed it and see myself returning soon.  My only gripe is the cost - over $13 for an average sized grilled chicken wrap seems a bit steep for me, even by NYC standards.", "author": "Marissa S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-06", "description": "I love Kebab but never tried Berlin style before and I was surprised how good it tastes!\nThere are multiple selections from the menu, you can do a burger, wrap or bowl. The white sauce is extremely creamy, the original flavor is not spicy at all so if you are a spicy person you may need to request special sauce.\nBesides the sauce I also love their grilled chicken! The skin is slightly burned so adding that crunchy feeling to the meal. \nCan't really find anything bad about this place!", "author": "Andrea L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-11", "description": "Probably our #1 spot in Dekalb. Get a lot of food for reasonable price $11ish for large. The Döner meat always taste good and the veggie ingredients are fresh and refreshing. And they have beer! Salad option if you're trying to be low carb.", "author": "Robby A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-11-05", "description": "Get the sandwich in the sesame bread! It's so soft and fluffy and delicious. \n\nThese guys are in Dekalb market near the south escalator. They pile on the toppings. While it's kind of expensive (because they all are in Dekalb market) it's worth it because it's a full meal. I've grabbed it on my way from the subway to home a bunch of times. \n\nFresh ingredients are a major plus.", "author": "Mary A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-15", "description": "Bread is authentic to what I remember what pita should be. At least from Greece standards. Close enough to Turkey. \n\nIt's a bit saucy. Tahini and their chili paste sauce covers everything if that's your thing. They kinda skimp on the chicken. But the bread is their saving grace. It's crisp on the outside and flaky with moist air pockets on the inside. \n\n$10.50 for the lunch special otherwise it's about $13 and change. Not bad.", "author": "Brian L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-13", "description": "It's a decent option for a food court, that's for sure. For us, the wrap was better than the signature sandwich. But both were tasty, albeit pricey for what they are.\n\nNot a bad option if you find yourself in downtown Brooklyn at this food court.", "author": "Art C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-12-27", "description": "The kebab was delicious, but for the price you'd think there's a decent amount of protein in it . That was not the case with my order of 2 Döner cones this afternoon. It was packed with very little meat, and you were left with just mostly the red cabbage and onion mix.  I ended up having more of everything else besides the chicken and because of that I'm giving it 2 stars.", "author": "George B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-30", "description": "Excellent food and Service...Nice portions", "author": "Denise L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-11-04", "description": "Food: 8/10\nService: 7/10\nAtmosphere: 4/10\n\nDoner Kebab is located just off to the side of the main escalator entrance to the Dekalb Market Hall, and serves up Turkish and German foods.  The biggest issue with this place is just its location - it's noisy, has lots of foot traffic, and can be awkward to wait for an order while crowds bump you around due to the close confines.  Logistic issues aside, the food is consistently very good, albeit a tad messy.  The portions are good for the price and service is always polite and friendly.  Doner Kebab is a solid choice if you're in the area and have a craving for something with a little Turkish flare.", "author": "Ryan S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-12-03", "description": "Kotti cone \n- not easy to eat, requires a fork\n- make sure you have napkins! all of the juices flood the bottom of the cone and can leak through the paper cone \n- the cone is made in the shape of its final form so everything is layered (i.e. all of the meat is on the bottom, all of the pickled veggies in the middle, cheese and dressing on top)\n- flavor is nothing remarkable", "author": "Ariel C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-30", "description": "Delicious and the only Turkish Doner specialty brought from Europe. People might say similar to Borrito or Shawarma -   This is way better! Try it yourself. \nTastes amazing \u0026 very healthy. \nVery friendly stuff members and the owner making the food tastier. Recommend!", "author": "Sasha G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-09", "description": "Definitely one of the better things in the Dekalb Market food hall. I passed by and noticed the lunch special menu. The workers were super nice and informative. I spent a little over $11 for a HUGE döner sandwich on the lunch special menu. It was delicious!! I loved the feta crumbles and the veggies they loaded it up with. Very flavorful and worth the price. My friend said the döner cones aren't bad either. I'll definitely come back.", "author": "Alice X."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-07", "description": "Very good and tastes fresh. The bread on the doner kebab is delicious. I also really love that they aren't skimpy on the toppings - I feel like I actually get a full meal here!\n\nMy only wish is that they would venture into more meat selection, such as lamb/beef.", "author": "Kathryn S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-26", "description": "I ate the salad option from here for lunch on February 26, 2018. It was so good! I wish that it was bigger- not that it was small- but it was just that good I could have done with more (also because of the cost). The chicken was well seasoned and tasted very fresh. I was excited to see that all of their chicken is free of hormones which was the the selling point that made me decide to give them a try.  I would caution you that this is a not a cheap lunch at all. The salad was $13 and that is the lunch special price. So if you want a tasty salad with hormone free chicken this is the way to go- but be prepared to pay for the healthiness! The people that work here are very nice too! That always helps when you're shelling out top dollar for a salad.", "author": "Kia A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-24", "description": "Happy to see in the Dekalb Market since I haven't made it to the sunset park location I bookmarked. \nDelicious wrap, lighter than I would have expected. Clean flavor, fresh veggies nice and crisp. \nDownside is still the lack of seating ( but \"more seating soon\" signs everywhere) and the persistent cellular dead zone/lack of wifi if you're at lunch but still need to be reachable for work", "author": "Laura P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-19", "description": "We found this place at their stand in Bryant Park's Christmas market and left happy. My boyfriend is from Hamburg and has family in Berlin so it's safe to say I had a good judge with me.. I found it delicious but it was his call to decide the authenticity. 9/10! More sauce on top would have been nice and the bread was a bit different but the red cabbage and the meat was perfect. I enjoyed it and it was great to see how happy he was with his taste of home in this beautiful city!", "author": "Nathalie C."}], "servesCuisine": "Kebab", "priceRange": "$11-30", "name": "Kotti Berliner Döner Kebab", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "445 Albee Square W", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/m4Co8doRXB1dc06liO9Htw/ls.jpg", "@type": "Restaurant", "telephone": "+13476141779"}