{"aggregateRating": {"reviewCount": 58, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-28", "description": "Bomb ass chicken and lamb. So juicy and flavorful. Not too heavy either. Great choice for a healthy / tasty meal on the go", "author": "Loucy R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-01-31", "description": "They've gone downhill fast.\n\nThey used to be good until they started charging for every little thing.  They took the roasted veggies off the salad and charge you extra to put them on now :/ they also charge you if you want extra sauce now. It's not worth it to come here anymore, $20 for a salad nickle and diming...", "author": "JJ K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-29", "description": "I was wandering through the Dekalb Market Hall a bit overwhelmed by the choices for lunch. Kotti Berliner Doner Kebab is situated all the way in the back in a very inconspicuous stand, but clean and modern. \n\nI know that kebabs and middle eastern food are a big \"fast food\" thing in Germany, but I'd never had it directly in Germany. I'm on a special \"diet\" for the month, so it eliminated a lot of choices for me in the market hall. The Doner salad sounded perfect for me. \n\nIt looked really good, but I was shocked at how absolutely scrumptious this meal was. The salad had loads of fresh veggies (cabbage, onions, cucumbers), greens, and their super tender well-seasoned chicken shawarma, drizzled with their special yogurt sauce and harissa. It wasn't just amazingly tasty but actually filling and satisfying. I'm sure to drop by here again! Highly recommended! My husband had gotten something else and was disappointed. He agreed my salad was extra delicious.", "author": "R. H. J. S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-19", "description": "The restaurant has three locations, and all of the locations provides one of the best tasting foods in New York City. I would recommends for anyone that, love the food scenes of the city to give one of the three locations a try and they will not regret it. The prices are affordable and the quality of the ingredients are above the standards. The owner of the restaurants believes in providing, his costumers with the best quality of food and which is why he only serves, GMO free poultry and vegetables.", "author": "Meli W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-27", "description": "Had the Doner Kebab in salad form. It was towards the end of the night admittedly so maybe I got the last of it, but the meat was pretty tough. Salad ingredients were fresh though. If there is a next time, I will order with sauce on the side as it turned into a big mess towards the end.", "author": "Katie C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-08-19", "description": "Great quality. Absolutely overpriced. \nYou can sense technique applied to your chicken and freshness from the tomatoes cucumber salad lightly drizzled with dill or the red onions. Not worth the $14. It's a sandwich. Actually half the size of a sandwich.", "author": "Alex M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-06-25", "description": "Good food/döner but very slow and disorganized service. Employees seem more eager to go on a break rather than to serve you.", "author": "Daniel S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-25", "description": "Wonderful food, fast service. I tried the veggie sandwich it was out of this world!!!! My husband the chicken sandwich and was fresh and tasty with many vegetables. Great fusion combos, fresh ingredients, beautifully presented. Nice and clean, will definitely go back again.", "author": "Rita V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-21", "description": "My God... This is THE spot in Dekalb Market, if not all of Brooklyn. I was blown away with the Döner here. The chicken was tender, juicy, and flavorful. The veggies were cool and fresh, the bread was crisp and soft at the same time, but DAT SAUCE... RIDICULOUS. They have a red and white sauce that combines together to be heavenly. Super friendly staff, great food, must try!", "author": "Mitch S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-07", "description": "This place is great! Anthony and Joey made us feel at home and the food Döner Kebab was amazing. By far the best döner I've had outside of Germany.", "author": "Amelia G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-30", "description": "I've been hoping to find a döner spot in NY since I was in Berlin last year. This is definitely as close as you're going to get to Hasir (my favorite döner place in Berlin, though even the \"bad\" ones I had in Kreuzberg were pretty great :) ). As other reviewers have said it is a little bit pricey, but I'm sure people in the area can afford it and you can tell this isn't your average, sweaty, amorphous cylinder meat. I would probably go every day or every other day if there was an option between $5-$7 (like a lower quality meat option? Idk), and if they had Spezi/Mezzo Mix/Schwip Schwap I would come through just to get a bottle", "author": "Benjamin S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-04", "description": "The kotti salad with extra chicken is absolutely delicious. It's a perfect sized, healthyish meal.  The only downsides are the price and quantity of food. The amount of chicken they give for a regular portion is scarce. For $14, you'd expect a healthy portion.", "author": "Brent R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-13", "description": "I am from Germany and I have been looking for a legit Doener for years. Now I can say I have found it finally. Anybody who has not yet tried a Doener, you are in for a treat!", "author": "Alexander K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-02-03", "description": "I am from Germany and was really excited when I heard this place opened in NYC. Unfortunately, I was very disappointed. That has nothing to do with a Döner at all. The meat is completely different and they don't even make their bread on their own. The Döner and also Dürum was a bit cold. Normally you get the meat fresh and hot from the spit. Here they will cut it and grill it I guess to reheat it. You won't get Döner here just a way overpriced chicken sandwich! It is sad they call theirselves Kotti Döner.", "author": "Julia A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-09", "description": "They have a really good food i go there every day one of the best restaurants in nyc try it you wont regret it", "author": "Anwr Q."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-27", "description": "Especially notable for the flavorful, fluffy bread and super fresh veggies. Often overlooked keys to perfect doner.\n\n(:: Mutters through mouthful::) Bashic'ly thish ish fantashtigh.", "author": "Cara T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-22", "description": "As a long-time Döner lover from my days in Germany, I've happily chowed down on the Döner here at DMH about ten times now despite the inflated price. I was curious and interested today to try the new rice bowl. All I can say is that they really need to work on their quality control. All of the chicken in the bowl was very dry. Even worse, almost half of the chicken was literally burnt so crusty and black that it was inedible. If I hadn't already taken it home to eat it, I would have returned it. I know they can do better than this because the chicken has been much better every other time.", "author": "R C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-08-01", "description": "They want to charge you $13.50 for a kebab sandwich !!! Turkish-German street food !!\nWhen you grew up in Western Europe on that food you know overseas it costs between €3.50 and €5.50\nBut 13.50 come on... that picture of the brooklyn bridge and à Berlin U-Bahn pulling off at kottbuser torr says it all: kottbuser torr is in Berlin-Kreuzberg, originally a Turkish area that has been colonized and gentrified by the same type of people who colonized north brooklyn so I guess that \"restaurant\" only caters to the rich hipsters and yuppies who miss kebabs from their latest trip to Berlin.\nAnyway it should be three times as less price wise, and in south brooklyn and even on 14th street in Manhattan there are some cheap tasty Ones.\n\nPS: I assume in a few days yelp will tell me that my comment was inappropriate and they had to delete it upon the \"community\"'s request (democracy)", "author": "Ludovic A."}], "servesCuisine": "Kebab", "priceRange": "$11-30", "name": "Kotti Berliner Döner Kebab", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "445 Albee Square W", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/m4Co8doRXB1dc06liO9Htw/ls.jpg", "@type": "Restaurant", "telephone": "+13476141779"}