{"aggregateRating": {"reviewCount": 58, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-11-01", "description": "Sadly, this place has gone down hill fast since opening. This was my second time eating here and will be my last. \n\nThe first time my husband and I tried this place we were impressed by the balanced, rich flavors and quality of the food. We had a craving for a salad tonight so ordered it again and were beyond disappointed.\n\nAfter we ordered it we noticed that the vertical grills were shut down and instead they were grilling chicken breasts on their regular grill but we weren't concerned (perhaps their vertical grill was broken?)\n\nWhen we got home we quickly realized that not only was there almost no chicken in our salads but the few pieces that we had were dried out to the point of being jerky. A few pieces were so tough that we couldn't even chew through them. I've attached a photo of the chicken that was in our salads (this is about 1/3 of what we were given) so you can see what it looks like. The salads are 13.75 each.\n\nIf they keep this up I assume they will be out of business soon as there are so many other great options at Dekalb Market.", "author": "Lizz H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-11-19", "description": "I lived in Germany for 1.5 years. This is not what you would get from a doner in Germany. Looks like it, doesn't taste like it. I didn't like the flavor of it enough to come back.", "author": "John S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-12-17", "description": "A tad pricey even for NY, but freaking Excellent and great service! Got the doner sandwich. The servers handling the food wear gloves, it's a clean space and the food is fresh. Hit the spot. Very delicious!", "author": "Sam T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-30", "description": "Doner Kebob offers delicious chicken doner prepared in a variety of ways. You can get it as a wrap, cone, salad, or traditional Kotti doner (openface sandwich style) and no matter how you get it you cannot go wrong! The chicken is spit roasted like the classic gyro and sliced to order. The chicken is moist and spiced to perfection - perfectly salty with a dry spice rub that imparts a lot of flavor.\n\nI got the chicken doner wrap and my friend got the cone (basically, a thinner wrapper and smaller portion size). I thought my serving size was perfect as I have a big appetite but if you have a smaller appetite go for the cone (price difference is $15 for wrap vs $10 for cone). The chicken doner comes with roasted veggies (carrots, onions, potatoes, eggplant) as well as raw onion, lettuce, tomato, feta cheese, and yogurt sauce (you can choose which additions you do/do not want). I thought the roasted veggies added a lot of texture and flavor to the dish so I was pretty happy. This food stand is located in Dekalb market, so you can also get dessert after (try Ample Hill or cake pops!) and do your weekly shopping at Trader Joe's. The only constructive criticism I have to give was I wish the cone came in a container as you have to hold the cone the entire time to eat it. Overall, a great place for lunch or dinner!", "author": "Sam E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-14", "description": "I have loved this place since I first tried it at Smorgasburg! The wrap is filled with chicken and vegetables that have a great flavor! The ingredients taste fresh. The chicken has a really good seasoning on it and is not dry. Their white sauce is a great addition to the whole wrap.I love that they warm up the tortilla before filling it with all the chicken and vegetables. My only complaint about Kotti Doner is that it is a bit pricey, which is a reason why I make my visits far and few between.", "author": "Leslie S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-02", "description": "I'm German and basically lived off Döner during my high school years. Kotti's Döners are the best copy of a real \"German\" Döner I've found in the States so far. The meat is slightly different, chicken rather than lamb/beef, but it's nicely charged on the outside and juicy inside. The harissa sauce is a non-traditional twist, but tastes great. Ask just for yoghurt sauce if you want a more authentic version.", "author": "Julia K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-17", "description": "Having lived in Berlin for a year and been totally obsessed with finding the perfect kebab during our stay, I can say from authority that this is indeed, the real deal. The bread is perfect, the salad and sauces perfect, the chicken delicious.  I do wish they would offer a lamb version, and some of that crazy reddish-pink garlic sauce that all of the Berliner Kebab places seemed to offer, but barring that, I can simply say that if you'd like to have a solid Berliner style Kebab here in NY, this place nails it.\n\nNext time, we'll ask for extra sauce. Do consider expanding your menu! It would be great if you did.", "author": "Julie B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-17", "description": "Got the signature döner kabab sandwich for lunch at the dekalb market hall. The sandwich comes on a toasted sesame seed bread, which I thought was slightly over toasted making it difficult to bite into without scratching up my mouth. The meat inside the sandwich, however, was very tasty and tender, I just wish there was more of it because it was so good. The two sauces, a chili sauce and garlic sauce, added great flavor without being overpowering. \n\nOverall, I would definitely eat here again, but maybe try a different type of sandwich offered on their menu.", "author": "Carlo K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-10", "description": "Ever been to flavor town? Wait that sounds cheesy and a little creepy (sorry Guy Feiri)... Forgive me for that poor opener. Let me start by saying DELICIOUS! I had their \"Kotti Döner\" sandwich and their chicken in this dish was soft, moist and seasoned through and through. They've topped it with some fresh greens and through two different types of sauces on there and I don't even know their names. But this place grab my heart, massage it, and made me feel complete. \"Kotti Berliner Döner Kebab\" you .... complete..... me.", "author": "Brandon H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-25", "description": "Vast improvement over last time. Doner kebabs were very good and management stepped up to address prior issues. Will definitely return.", "author": "Andrew G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-18", "description": "I dont know how peaple can call their chicken sandwich as berlin style turkish döner. As a turkish and a fun of Berliner döner, it was a terrible terrible experience, time and money consuming for me. Berliner döner is stuffed in fresh pita bread and served with special kebab sauce. And it is absolutely not made from chicken!!!", "author": "Zeynep Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-12", "description": "My favorite place to eat at DeKalb market! If you've never tried Döner before, I'd highly recommend giving this place a go. The portion is huge and usually, I can hardly finish everything on my plate! Never knew you could fine Döner that tasted to good in the US.", "author": "Autumn M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-19", "description": "This place is fantastic. The Döner kebab is absolutely awesome. I've tried it five diff occasions and their product is consistently wonderful. Many flavors complementing each other making a mouth watering delight. This is truly a Turkish delight!!", "author": "Anissa K."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-07-26", "description": "I was really excited about this place. Haven't had a proper Döner since moving back to the US from Berlin. A Döner in Germany is street food and Berlin is one of the cheapest places to find it. It usually costs $3-4. These guys are trying to sell it for $13-15.", "author": "Kara H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-28", "description": "This busy stand within Dekalb Market is a must try. Towards the back of the hall it has a couple selection of Doner Kebab ways in a bowl, in a wrap, in a pocket by way of Berlin. I choose the original way in a pocket. There is an assorted of side condiments such as pickled cabbage, cucumbers and two type of sauces. I picked the harissa chili one. While I didn't find it 'spicy' it did add a slight heat which I liked. The bread was warm, the meat tender and flavorful. I certainly would come back again.", "author": "David N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-04", "description": "Went to Kotti For the first time at the Dekalb market in Brooklyn. I was a little afraid of menu cause I couldn't understand it lol it was in German . The employee Lisa seen me hesitant as I was gonna walk away lol she stopped me and explained to me that the chicken and rice bowl was really good so I decided why not . She helped me choose my toppings and also ones she recommended . I ate the every bite of my food it was so good. Thank you Lisa!  for helping me out because I would of just walked right pass this place !", "author": "Ciera M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-24", "description": "Loooooved this place. I went to Berlin a couple of years ago and noted how unique and delicious the bread was for their doner kebabs. This place absolutely nails everything about the experience. Bread, chicken, sauce were all great. I don't remember feta being on the kebab but it was a nice touch. Certainly way more expensive than Berlin but it's in the trendy new food hall so ¯\\_(ツ)_/¯ all I can hope is that the they do well and more of these spots open up in Manhattan so I don't have to travel for 45 minutes to get a good Berlin style doner kebab \n\nPs - the art behind the register had the name of the traffic circle my friend and I stayed at in kreuzberg so that was a cool touch that brought back some good memories", "author": "Karl W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-04-03", "description": "I ordered lunch around 1pm and never received the delivery. At 3:42pm my bank informed me that my funds were refunded. Absolutely unacceptable!", "author": "Dino B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-09", "description": "Excellent spot! I grew up in Germany and am very happy to see that this place exists. I had the Döner Wrap and it did not disappoint. It looked well prepared and tasted quite fresh. I will surely return to try the more traditional Turkish bread version (which is the style I always had growing up). \n\n(Although a lamb option would be quite welcome, I have no complaints about the chicken. It was delicious. You won't regret it.)\n\nIs it as cheap as we might be accustomed to at our favorite Döner spot back in Germany? No, probably not (though I can't speak for Berlin as I am not from there). But, when keeping in mind that the ingredients seem (to me at least) a cut above the average Döner location, as well as the fact that renting real estate in this kind of location can't be all that cheap, well, then I can't say it's unreasonable. \n\nBesides, where else are you going to go? The Turkish-German style of Döner is unique and in my opinion, well captured by Kotti Berliner. You're not going to find anything like this at your regular Halal cart. \n\nAlso, it was nice to have a quick chat with the owner in German who was hard at work personally manning the register and directing the whole operation. The whole experience for me was a nice reminder of home. I hope they keep up the great work!", "author": "Brian C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-15", "description": "Haven't had a Döner kebab since I lived in Germany, so I was excited to see this as an option at the DeKalb Market. The owner, who hails from Berlin, was very friendly and happy to walk me through the menu. I ordered the Kebab and thought the flavors, spices, and bread were very reminiscent of what you can find in Germany. Filling and satisfying-- would definitely eat there again whenever I'm hungry and nostalgic for something German/Turkish! Vielen Dank!", "author": "Simone S."}], "servesCuisine": "Kebab", "priceRange": "$11-30", "name": "Kotti Berliner Döner Kebab", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "445 Albee Square W", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/m4Co8doRXB1dc06liO9Htw/ls.jpg", "@type": "Restaurant", "telephone": "+13476141779"}