{"aggregateRating": {"reviewCount": 191, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-26", "description": "Delicious! Delicioso! Amaze Balls! What a tasty breakfast bagel/sandwich spot!  This place cannot be beat if you would like to get some delicious bagels and coffee!  While visiting some friends over the weekend in Brooklyn, I decided to stop by Montague Street Bagels for breakfast. I've heard so many great things about this place so I decided to see what the hype was all about.  I'm glad to say that my experience exceeded my expectation!! \nThe breakfast bagel was soooo delicious that I decided to go back the next day for lunch. Everything was so fresh from the bagels to the ingredients that I chose for my bagel. The bagels were so soft and chewy and the scallion cream cheese is to DIE FOR! I love how this place isn't skimpy on the cream cheese!! The bagels are far more delicious than a local chain known for bagels.\nNot only was the food good but the staff was very friendly and fast. I highly recommend stopping by for a satisfying meal.\nGreat food, great service, great prices and small business owned - Check it out!", "author": "Chris H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-08-23", "description": "I went with a groupon, $10 for $20.\nBought a reuben for 8.25, and chicken caesar salad for $7, a knish, a brownie, and a crumb cake.\nthe reuben came with 5-7 thin slices of (packaged) pastrami on tiny slices of rye, making Katz look like an absolute bargain . I was in a rush and they took 30 mins to prepare my food, READ: 30 MINUTES. For a deli this is quite poor. The salad was the last thing prepared and they told me they dont have croutons at the end but I was too much in a rush at that point to change my order. The workers didnt know the menu and were confused which greens go on it... really? All in all it was a few leaves of lettuce with microwaved chicken with packaged dressing. The knish was confusingly rubbery, dont know how that happens, and the desserts were inedible: days old. Not one or two days, it was so hard it was obviously there for at least several.\n\nOther than the sweets, the food was edible, I mean you cant really mess up packaged caesars dressing but I was baffled by this place. How is a seemingly average deli so overpriced and underwhelming. Its like they rely on the well-off brooklyn heights customers to not know what they are doing. I ended up paying 13 dollars after the groupon (including groupon price). Honestly, Its too expensive even with the groupon.\n\nThis place makes subways look like a viable option, and thats just not cool.", "author": "gary m."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-06-13", "description": "DO NOT ORDER DELIVERY\n\nEverything you read is true.  I have been waiting 2 hours already and nothing.  When you call you get a useless person on the phone who just tells you the delivery guy is on the way.  This place has gone down hill over the past few months.  The people that work at the place all look like high school dropouts and act like it too.  Who knows what they do to your food.  No thank you.", "author": "Stacey G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-08-30", "description": "Crappy hole in the wall, place seems dirty, I don't know how they stay in business. Nothing really seems fresh, seems like its all been sitting around for days. \nThe only plus is that its open 24 hours but I guess thats not a plus when you get no business.", "author": "David L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-07-21", "description": "For the public good of Brooklyn, I want to warn anyone who walks into this establishment. Twice I've come into this bagel shop late-night around 11:30 PM. \n\n1st visit - I saw one of the cooks (a bald, heavy set man) in the back kitchen drop a freshly boiled bagel on the ground while taking the bagels out of the boiling vat. He proceeded to pick the bagel up with the bagel rake and drop it back into the boiling vat; I immediately left the shop. Disgusting......... unfortunately I forgot to post a complaint on yelp after the incident occurred.\n\n2nd visit - A few months later, my girlfriend and I flew in late from California on a Monday night and visited the bagel shop for a late night snack.The same bald man was working behind the counter and was giving us a really negative attitude. After we ordered a grilled chicken sandwich with grilled vegetables with another chef, the bald man proceeded to be very rude and argumentative about us not specifying what kind of vegetables we wanted when 'grilled vegetables' are CLEARLY specified on the back-wall menu. The lack of professionalism at a food-services establishment like this bagel shop is outrageous. I don't appreciate the treatment from this employee and we will never be going back. I only post this because I do not want anyone else experiencing such horrible service.", "author": "Marc L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-22", "description": "We come to Montague st bagels a few times per week for breakfast and have never been let down.  New York is known for great bagels, however most places order bagels from other bakeries.  Montague Street bakes their own bagels on site, and often you will get one right out of the oven.\n\nHad a few guests from out of town request \"The best NYC bagel.\" We brought them to Montague this morning and all got freshly baked bagels.  They agreed that this is the best bagel, other than Bodos in Charlottesville VA, that they had ever tasted.", "author": "Johnny G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-01-07", "description": "My dude grew up here at this bagel joint, from swinging by at 9am or swinging by 4am, their bagels are always Hard on appearance but always soft in the inside. I prefer my bagels microwaved so i don't care if it's all hard knocks. Cream cheese selects are fabulous. Reliable if and when you go there. Plus, while you wait for them to prepare your order, they got a scratch off vending machine. Ooooooooooooooooooooooo. Glory to the eyes.\n\nThis is a five star review, minus two stars for the fact that they have an option of DELIVERY. Take the delivery option away. They do not deliver, no, not really.\nI do not know how they deliver. The owner probably runs out once every time a new delivery order comes in as he tries to hire somebody on the spot. I've glanced at some other reviews and no joke,my friends. they absolutely take more than TWO hours accompanied with some lame ass excuses with a lady who is super nice on the phone but doesn't know nothing, a nice cover up to divert the anger on our end.\n\nIf you wanna risk the time wait or a NO DELIVERY option,order through grubhub. I love grubhub. Montague confirmed the order within 5 minutes of placing it. Two hours later- I called Grubhub and had them cancel it and refund it. Two hours and 1/2 later, it came....and I sent him back. I asked the delivery boy, \"I'll tip you for coming if you tell me when you left the shop to deliver to me\". And he said \"ten minutes ago lady\". Dun Dun Dun.  And it's really never...the delivery persons fault. \n\nOh yea, so  back to the point...........\n\nDear Montague Street Bagels,\n \nIf you remove the delivery option, I\"ll reimburse you the two stars I took away from you.\n\nLove,\nBagel Lover.", "author": "Davina L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-08-23", "description": "Never order delivery from these people. Absolutely horrible. Takes well over an hour, staff are rude and unhelpful. Decent food, but the worst customer service.", "author": "Chase S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-01-24", "description": "What can i say about this place the bagels are good but everything else isn't. I've ordered from them a few times and its never come on time and most recent it took them 1 hour and 45 minutes to make me a sandwich. Not to mention that after 45 minutes after placing the order they called me to say that half my order was no longer available and that i had to choose something else. Then when my order finally does arrive the other half was also wrong, this place is terrible.  I will never order from them again.", "author": "Bobby B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-07-21", "description": "Worst customer service experience ever. Sandwich took forever to make and on top of that, was given attitude for our order. Nice one! You just lost two customers!", "author": "Diana C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-17", "description": "Great service! Great bagels!\n\nThe mushroom and onion bagel with egg is awesome. IT comes in a wrap and of course we wanted bagels.  The staff was more than happy to customize anything we want. \n\nThe bagels tasted great so if I were in NY again, then I would definitely stop here for a bite.", "author": "Joanne L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-11", "description": "The bagels here are very good, but not quite the best you'll find in NYC. However, as previously stated, the bagels are VERY good, the store is open 24 hours (the yelp website is incorrect on this) and the people working working here are fantastic. My friend and I had a long chat with one of the employees last time we were at Montague Street Bagels and it was a lot of fun. He even gave us recommendations for what bagels to get and what was fresh. I highly recommend this place and only gave it 4 stars simply because NYC is tough ground for bagel competition.", "author": "JordLar K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-11-01", "description": "I usually don't write bad reviews, but wow this place really compelled me to.  I ordered delivery and it's been 2 hours and I still have not gotten anything yet!  Even worse, when I called to check on my order over an hour ago they had said it was already on the way.  Not to mention that the person that answers the phone has a crazy bad attitude, and their only excuse for a 2 hour order delay is that \"they are really backed up.\"  Terrible.  Will never order from them again and I encourage others not to until they get their act together.\n\nUpdate: 2.5 hours AND STILL NOTHING.", "author": "Gordon S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-28", "description": "This place is a blessing,...love the lox and cream cheese and a great cup of coffee...and the sandwiches are delicious, I just ask the help for their favorite and go with it. You guys ROCK!", "author": "Bruce M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-09-21", "description": "WHY.... do they have to have the best bagels, cream cheese. and deli sandwiches.... bc they are incapable of delivering bagels in less than 2 hours or following easy directions. I've ordered here about 40 times (I have the seamless account info to prove it.) But will never do it again.... fool me once, shame on you- fool me 40 times.... i'm an ass", "author": "Bethany W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-17", "description": "This is my local bagel spot of choice. Always delicious and great service. (I've never ordered delivery.) Last time I went in, they were out of Everything bagels. He made one for me on the spot. Open late and now no minimum on credit card! Enjoy on a bagel from MSB.", "author": "Benjamin C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-02", "description": "HOT BAGELS aka Montague Street Bagels is my JAM.\n\nI lived in Brooklyn Heights 7 years ago (William H. Macy, I'm old) while attending college.   It was the perfect place to stumble into at 430am bombed out of your mind.  (No judgements: I said I was in college!)  They were also perfect for a bagel during sober hours as well.  It's the only place I ever went for bagels.  For those of you that think it's a shithole now, you should have seen it back then.  I was visiting a week ago and actually took some photos to send to my best friend, who also frequented Hot Bagels while in college with the caption, \"holy shit! hot bagels is movin' on up!\" \n\nOnce I moved out of the area and up to Spanish Harlem, I would make the ridiculous subway trip out there and stop before going on a Target trip.  If I had visitors, I would bring them all the way out to BK Heights for the best bagel of their lives.  It always started the same, \"why are we taking an hour subway ride for a bagel?\"  I'd respond with, \"shut up; you'll see.\"\n\nMy favorite combo is either sun dried tomato, toasted, scooped out with lite scallion cream cheese or a pumpernickel, toasted, scooped out with lite scallion cream cheese.  They have a pretty good selection of bagel choices and cream cheese options.  I haven't gotten any sort of sandwich or wrap since leaving college so I can't comment on that.\n\nAnyway, I'd bring the visitor there for the bagel and then we'd walk to the promenade.  We'd sit on a bench looking at the best city in the world while enjoying the best bagel in the world.  Now, when I tell you I've brought several people here, I mean several.  And every single one of them (I swear!) agreed that the trip was totally worth it.\n\nAny time I visit the city (aka my heart), no matter where I'm staying or who I'm staying with, I will make the trek from anywhere to get one bagel to enjoy at the promenade and one for the road.\n\nHOT BAGELS, I LOVE YOU.", "author": "Mel D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-03-30", "description": "Worst bagel I have ever had!!! Got a bacon egg and cheese on a bagel the bagel was at least a day or two old it was stale and hard to bit into to. The eggs were not cooked well bacon really undercooked and barely any cheese. It also took them almost ten minutes to cook my sandwich. I will never go to this place again!!", "author": "Elissa M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-08", "description": "Awesome bagels! They are doughy and exactly what you want from a New York bagel. Egg salad was delicious. Knish was weak-- maybe because they're microwaved. Either way, bringing bagels back home to DC! Staff was really friendly :) great neighborhood bagel shop!", "author": "Arielle S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-05-11", "description": "I wasn't too impressed with salmon shmear. It wasn't as creamy as other places and the salmon flavor was a bit muted. I did appreciate that it was free though due to a special as a yelp check-in and the cashier was nice enough to allow the lox schmear even though the deal was only for regular cram cheese.", "author": "Arthur K."}], "servesCuisine": "Salad", "priceRange": "Under $10", "name": "Montague Street Bagels", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "108 Montague St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/3kZ63PlW270NqHq1KFdn_w/ls.jpg", "@type": "Restaurant", "telephone": "+17182372512"}