{"aggregateRating": {"reviewCount": 191, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-06-20", "description": "This place has fallen flat on it's face since the new ownership took over.\n\nThe bagels used to be very fresh every time you walked in.  Service was quick and there was rarely a wait even with a mass of people inside.\n\nNow?  There's a wait even if you're the only person in there.  You stand by the bagels, waiting for someone to come to you.  When you order, make sure you speak slowly because they don't pay attention.  Just today I had to tell the guy \"9 grain bagel with cream cheese\" at least 3 times and I was the only person ordering.\n\nThen when it was time to pay, I had to wait for the girl to get off the phone while she was taking a massive order for the jurors down the street.  Why couldn't the guy who made the bagel ring it up for me?  I asked him to and he said he couldn't.  So I stood waiting for 10 minutes.\n\nWhen I got outside to eat the bagel, it was rock hard and had cream cheese on only one side.\n\nIt's a real shame this place has fallen so hard.  I'm never going back and I suggest you don't step foot in the joint either.", "author": "Steve C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-07-08", "description": "This is where it's at.....New York City's finest bagels.\n\nMy Order:\nLunch, Brown Bag Special\n-Everything bagel with peppercorn turkey and swiss cheese, lettuce, tomato, and russian dressing. Comes with a bag of chips and a can soda.......all for about $6\n\nWhat more do  you want out of life???", "author": "Robert I."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-12", "description": "Good bagels fresh ones start coming out 4:30am or so daily. Open 24hrs. Mostly quick service.", "author": "Mike S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2008-04-26", "description": "Sorry I had high expectations due to these dang yelp reviews. The bagel wasn't bad, but it wasn't hot like I'd hoped (I was in around 11am, btw). In general, the rule of thumb in NY I hear is not to toast your bagels, so I didn't.. but I probably should have.\n\nAs a plus, the scallion cream cheese was delicious and the bagels are cheap. Hopefully I'll get a chance to give them a second chance before I leave Brooklyn.", "author": "Amuse B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-11-21", "description": "THESE ARE THE GREATEST BAGELS IN THE WHOLE WORLD. End of sentence. And yes, I have tried bagels all over the world.  So don't fight me on this one.\n\n24 hours, hand rolled.  Nice and hot in the early morning.  But scrumptious any time of the day.  Any bagel there is great, but my faves are the salt and egg.  The cream cheeses are standard but when pared with a Montague Hot Bagel, it rocks.  Their egg sandwiches (on kaiser rolls!!) are great - but make sure you ask for it buttered because that makes them killer.\n\nI'm crying now....I miss my bagels....", "author": "Heidi M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-10-08", "description": "When I first met my girlfriend, she was living in Brooklyn Heights and each weekend we would celebrate our new -found love with Bagels from Montague Street.  But, just so you don't think I'm looking at these Bagels with rose-colored glasses, 5 years later I still stop there (sometimes for no reason, sometimes when I'm in trouble).  But, if I go here just for me, I keep that secret between me and Montague Street.\n\nBagels are nice and big.  They are always doughy and warm.  These bagels also make a great breakfast sandwich with say...2 eggs, bacon and mozzarella.", "author": "Chris C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-26", "description": "place is great, the food guys are really good and welcoming, they remember regulars, the price kind of high but the food is great, they honored a free bagel with cream cheese for the yelp check in offer, no question asked just made it and handed to me. great place", "author": "Frankie A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-04-08", "description": "The sandwiches here are decent but inconsistent.  The sizes and ingredients vary from day to day (or sometimes hour by hour) but the prices always stay the same.  Seriously, one day the sandwiches are enormous, getting a great bang for your buck, and the next day it's about a quarter of the size.  Do not go here unless you are looking for overpriced, meatless sandwiches.  The management here needs to address this ASAP.  Will not be back.", "author": "George C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-27", "description": "I go to Montague Street Bagels every Sunday for my breakfast.  Mike is a pleasure and always has a smile for me :)  The food is always fresh and the bagels are fantastic.  The selection is great - I placed a large order for my book club and although I called them last minute, they came through for me!  Go here if you want a great meal and a pleasant experience.", "author": "Marie L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-07-03", "description": "Steer clear. I get pretty nervous about eating here after reading all the comments about the poor health rating etc, and sure enough, the place is awful. I'm not sure how difficult it is to confuse butter with cream cheese, but this place never seems to fail.", "author": "Emily G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-02-20", "description": "I ordered 2 eggs fried over hard, sausage and cheese, a ruben, and chicken cutlet on a roll via delivery.com.  The delivery took 1 hour and 22 minutes.  My food arrived luke warm.  The eggs were runny, even though I specifically requested them cooked well.  I called to add a drink to my order and was told that the order was already out; however, it took another 35 minutes for the delivery.\n\nI would not order from this place again.  Food is mediocre.  Service is terrible.", "author": "Chris B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-06-11", "description": "This place used to be great until the new owners took over.  I had to wait for 20 minutes just for a simple order numerous times.  It is clear that the new owner should not have fired all of his previous staff, because it is so slow now.  Sad.", "author": "Dexter M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-10-20", "description": "Someone please explain to me why it takes over two hours to make a turkey sandwich and deliver it less than a half mile away?? Food was sloppy and thrown together. This place is HORRIBLE! Do not order from here.", "author": "Dom C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-08-24", "description": "Hot damn Hot Bagels!  This place is awesome!  I am about to make a very earth shattering and bold statement, but I honest to God think that this place has the best bagels in New York! Which obviously means that yes, this place has the best damn bagels in the entire universe!\n\nEverything bagel toasted with cream cheese. Heaven in your mouth. \n\nDid I mention? Such a good deal! I had juice, coffee and bagel for $5.  And to think I'd pay $40 for that bagel.\n\nDisclaimer: Customers of Montague Street Bagels have been known to experience life shattering euphoria at the first bite of one of their hand rolled bagels.", "author": "Alixandria F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-07", "description": "so far i've only eaten two things from montague street bagels: a pumpernickle bagel and a reuben.\n\nthe bagel: i loved it...but then again, i just moved here from the west coast and haven't had a decent bagel in years...so perhaps i'm not a good judge of a quality bagel yet.\n\nthe reuben: a bit dry for my tastes...i really like my reubens dripping in fixings...but an ok sandwich...not sure i'd order it again as there are TONS of other sandwich options on the menu that i'd like to try.\n\nthis place is also open 24 hours which is great...and the staff has always been very friendly to me.", "author": "Allison P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-07-13", "description": "I gave up on going here. It has fallen in quality. It seems like every bagel I pick up here as of late is dry and stale. I used to love coming here and picking up something for breakfast but now its just plain bad.", "author": "Jonathan H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2010-09-06", "description": "The people at the counter are incompetent and mean. The bagels are really sub-par and the place is dirty. We thought the first time was a fluke so we gave it two more shots and every time it was actually worse! The last time the guy behind the counter told us the guys cooking forgot our order (we waited 20 minutes!!) and then proceeded to tell my wife that he was more mad at having to work with them then we were for being forgotten about?! NEVER AGAIN! Terrible costumer service. Bagels nothing special at all. Certainly not worth being treated like that.", "author": "Adam K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-09", "description": "Always does the trick. Go here whenever I need a bagel and lox to rejuvenate me after a long night.", "author": "Anna S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-12-07", "description": "My wife is pissed at me that I still go here...\n\nI love their bagels, but this place seriously has the worst service I have ever experienced.  Their cashiers are rude.  Most of the time they get my order wrong.  The waits are way out of line for a bagel shop.\n\nBut my last straw was having to listen to what I assume was a manager yell at her staff behind the counter while I was trying to order and then fight with the cashier from right next to me as I was trying to pay.  Everyone was on edge and she was oblivious to how inappropriate she was being.\n\nAnd guess what!  They screwed up my order.\n\nThey will never get another dime from me.", "author": "matt m."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-05-02", "description": "GREAT bagels, made fresh all day and night! The hero sandwiches are decent too although I probably wouldn't order anything too complicated. The guys will definitely ask you to tell them the toppings twice, maybe three times. Service generally sucks except for the women that run the register, but hey, it's open 24 hours people. In Brooklyn Heights, that's pretty hard to find. Wish they would bring back the industrial coffee pots/dispensers though, instead of using the little ones up front - the coffee sits out and gets cold.", "author": "Laura Z."}], "servesCuisine": "Salad", "priceRange": "Under $10", "name": "Montague Street Bagels", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "108 Montague St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/3kZ63PlW270NqHq1KFdn_w/ls.jpg", "@type": "Restaurant", "telephone": "+17182372512"}