{"aggregateRating": {"reviewCount": 191, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-04-21", "description": "Seriously, I don't know how they manage to get their bagels JUST right every single time, but they do. Even if you drop in at 4 a.m...a time when most other bagels are stale and hard, they're heavenly. My personal favorite is the Whole Wheat and Sesame bagel with butter.\nThey also make AMAZING sandwiches and salads. Try the buffalo chicken with lettuce and tomato on a sesame seed bagel..SO good.\n\nThe wait can be annoying on a weekday during lunchtime or on a Sunday afternoon, but it's worth it.", "author": "Nicole M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-17", "description": "Great bagels.  That is the most important part of a bagel place for me.  The service is average but friendly, and they make some good sandwiches.  I am glad this place is in the neighborhood.", "author": "Michael M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-09-12", "description": "I don't like this place. I ordered from here a few weeks (months?) ago for the first time, and it was OK. I liked that I could order breakfast food for delivery on the weekend so, I went back. The food wasn't BAD the first time (or the second), but the service was terrible.\n\n1) I waited about an hour for the delivery order to arrive, and when it didn't I called. No big deal, just checking up. Then, the woman who answered the phone started yelling at me, yes yelling, that they called THREE times and left a message! I told her I didn't have any missed calls, so that's odd but anyway, not a big deal, they had me on the phone now, so what was going on with my order? Then she told me that they had been out of knishes (I had ordered two), and they didn't know if I still wanted to rest of my order, but now they had knishes, but since it had been so long did I want my order at all? I said it sounds like the problem was solved, and yes, I would still like my food delivered.\n\n2) The order arrived with one knish. It was cold. Like arctic. So I signed for the food, and included a note that the order arrived with one COLD knish, when it should have had two.\n\n3) They returned with the second knish. Also cold. Am I crazy? Aren't knishes meant to be served warm??\n\nIn a fit of rage I swore never to order from them again. But then I caved, and ordered from them again recently. What occurred to me is that they are the only restaurant on Seamless Web that offers breakfast, so they don't seem to feel like they owe their customers quality service (or food). Again, it took the food an hour to arrive, some things were cold that should have been warm, and the food is OK at best.\n\nLesson learned: I will just put on my sneakers next Saturday morning and pick up breakfast from somewhere. Sorry, guys, I really wanted to like you.", "author": "Jenny H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-05-22", "description": "mmmmmm\nbagels\nmmmmmm\nbagel breakfast sandwiches\nmmmmmm\nbagel proper sandwiches\nmmmmmm\nhoney mustard chicken salad\non a bagel\ni used to be a regular here\ni miss you guys!!", "author": "kiki b."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-11-30", "description": "I just love this place. Best bagels in Brooklyn and amazing selections. I love the whole wheat everything with smoked salmon- the egg cheese with turkey bacon is a winner as well. Check it out!", "author": "J C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-12-26", "description": "This place used to have some of the best bagels in Brooklyn.  New owners took over at some point in 2010 and it's not as good. The bagels seem dry and the staff has NO IDEA WHAT THEY ARE DOING.", "author": "Optimist O."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-05-15", "description": "Solid bagels but they lack the crispy outside that a true five-star bagel possesses. A little more doughy and a little more fluffy than your standard NYC fare. Still.. a great bagel. I had the everything bagel with veggie cream cheese and it didn't suck.", "author": "Aaron V."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-03-25", "description": "Had an everything bagel on a Monday morning. It was stale. Asked for it open faced, got a sandwich style. Never coming back again. How does a crap bagel place like this survive in NY?", "author": "George S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-12-06", "description": "Soooooo amaaaaaaaazing!!!!! Came here after a coughcough long night in Brooklyn.  Absolute perfection.  Everyone there is also an aboslute joy, which really helps especially if you're having a uh, spot of a headache.  It's everything you need all in one.  Mmmm", "author": "Gabby D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-02-22", "description": "The bagels are OK - hence 1 star, the minimum required by Yelp. I've been coming here for 10 years, lacking any nearby alternative. The shop's latest iteration is its worst. If a competitor with even minimal service opened next door, this shop would go out of business instantly. Recent experiences:\n#1\nBuyer to server: \"one plain bagel, please, nothing on it.\"\nServer: \"how many?\"  Buyer: \"one\" Server: \"anything on it?\" Buyer: \"no\"\nCashier to Buyer: \"what have you got?\" Buyer: \"one plain bagel\"\nCashier: \"anything on it? Buyer: \"No\" \nThis is the way the conversation always goes.\n#2\nBuyer stands at counter to place order in a nearly empty shop. Two employees stand behind, avoiding eye contact, performing other duties. No service. Buyer approaches cashier and orders from him: \"one plain bagel, please.\" Cashier selects the bagel himself, glaring and sullen. Buyer pays and opens bag at home. Pumpernickel. Payback, of course. Buyer immediately returns to shop and requests replacement. Cashier: \"you should have ordered at the counter ... you should have opened the bag before leaving.\"\nThere's no arguing with this logic. This place is a disgrace and doesn't deserve to be in business.", "author": "Richard E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-09", "description": "Great fresh bagels.  They even sell blueberry bagels.", "author": "Felicia M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-07-23", "description": "oh, wow.\n\nthis place was my introduction to new york bagels and I honestly can't imagine anything more sublime. not to mention that it's 24 HOURS. incredibly dangerous -- yes, I have made cabs stop at 3 am before taking me home -- but so, so right.", "author": "Caroline N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-12-30", "description": "My mainstay when I lived in Brooklyn.    The bagels never dissapoint.   Will never invest any of my efforts in finding an ultimate bagel place in South Florida because there is none....", "author": "Chris A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-06-01", "description": "Yeahhh hot bagels is the shit.  The best thing about this place is that they are open 24/7 and make all their hot sandwiches too.  They've got like 50 different options to chose from which is like heaven when you're coming back from a night out and have a case of the munchies or just feel like a nice snack.  The outdoor patio tables are the best place to just kick back with your buddies and chow down late at night.  The late night staff usually ranges in attitude from slightly below neutral to amused but accepting.  Prices are pretty standard from what I remember.", "author": "Rob K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-18", "description": "One of the few places that makes real bagels. I'm a little bit of a bagel snob and if you aren't making water bagels, you shouldn't be allowed to call them bagels in my opinion. This place is not on par with H\u0026H or Essabagel, but they are the best in the neighborhood. I like getting bagels here, coffee from Connecticut Muffin across the street, and going to sit on the promenade. They make a decent sandwich too.", "author": "M M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-02-28", "description": "they have fed me many times on my return from 4am drunken nights out in the city.\n\nplain bagel, toasted with butter for 4am.  and lunchbox special for lunch for 6 bucks with cracked pepper turkey bagel and soda and chips. mmmm.\n\nif you're lucky enough, you might even catch bk heights a-lister paul giamatti wolfing one down.", "author": "Victor S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-05-19", "description": "I ordered delivery from there and they messed up my order. No cheese on my breakfast  sandwich and no dressing with my salad. Wrong stuff in my salad and half the lettuce was gross I had to throw it away. Do not eat from that place it is bad.", "author": "Chelsea M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-09-15", "description": "This is my favorite bagel in NYC. They are big, the outside is not too soft, not too hard. The inside is super soft and sweet. When I come back to NYC, this is something my mother has already picked up for me and is sitting in the house. The well done poppy-seed bagel is the best. It is depressing that so few places outside of NY serve poppy bagels. It is my neighborhood place, and so connected to my memories, but whatever it is, I always leave NY with at least a few of their bagels tucked into my suitcase.", "author": "Kaitlin F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-18", "description": "Stopped in here after a walk along the promenade, so it was in the afternoon.  Got a bagel with tuna salad.  The bagel was still pretty fresh and the tuna was not old looking like most places have it after a while.  It was all a great meal on the go and I was happy.  The end.", "author": "Are M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-20", "description": "it was worth the walk at 4am. \n\ngetting a whole wheat everything bagel toasted with butter hit the spot. \n\nit was fresh too b/c ya know they were getting ready for sunday morning.", "author": "Kristen G."}], "servesCuisine": "Salad", "priceRange": "Under $10", "name": "Montague Street Bagels", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "108 Montague St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/3kZ63PlW270NqHq1KFdn_w/ls.jpg", "@type": "Restaurant", "telephone": "+17182372512"}