{"aggregateRating": {"reviewCount": 191, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-08-15", "description": "Go here for a bagel and cream cheese. Stay away from the sandwich board! \n\nTheir bagels are good, as most bagels in NYC are, but their sandwiches are majorly hit-or-miss. I've been here at least 6 times and have learned that your experience will depend on who is making your order. Some of the guys behind the counter don't know how to make proper sandwiches - not enough meat, too much mustard, fucked up proportions, etc.\n\nTheir menu offers 40+ varieties of bagel sandwiches, but they're all pretty much variations of one another. Be prepared to wait longer than you want as they slowly (but surely?) create the sandwich of your choice.", "author": "Scott G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-08-13", "description": "I only grabbed some eggs before work.\nI just started working in the neighborhood so being a foodie I am trying everything out. \n\nOnce i try the bagels i will update.\n\nThey were scrambled eggs so not much to say. People were nice inside. Typical bagel shop.\nExpensive though. I ordered the same thing down the street at Edens Garden and it was legit half the price ( and it was egg whites which are usually more)\n\nthe one thing i liked about it which is why i went there in the first place, was the little tables outside to eat.", "author": "Nikki N."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-05-21", "description": "I have come to this place 4 or 5 times and each time, I have been disappointed with one thing or another. If there was another bagel place on Montague St., I'd go there instead. \nThe bagels are sub-par by Brooklyn standards and the person taking your order and preparing your bagels consistently forgets your order or messes it up somehow.\nThe prices they charge are average and the place is usually clean and presentable. \nIf you're in the mood for a great bagel and customer service, look elsewhere.", "author": "Thomas C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-10-30", "description": "The business was sold a few years ago - possibly once again...staff is fluctuating and eh! ok... The food/bagels are bleh...\nCaveat Emptor!!", "author": "VioletL P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-10-08", "description": "The bagels are the best in the neighborhood. BUT I'm surprised when they get my order correct.\n\nSometimes they toast when I ask them specifically not to. I just went in this morning and asked for a whole wheat sesame bagel, and got a regular sesame bagel instead. And this was from the owner of the place, who was very polite to the woman in front of me, but gave me zero niceties. Tip: If you don't like customer service, don't run a business based on service and then work behind the counter.  \n\nThe guy working in the early evening takes his sweet time making orders. I asked for onions and did not get any on my sandwich. \n\nThe only people who work here and do their job efficiently are the woman working the register during the day, and the man who makes the bagels at night. I went in late a couple of weeks ago for a sandwich, and the baker managed to take a few rounds of bagels out of the oven and make me an amazing sandwich in no time at all. The owner should hire more people like them instead of being rude and inefficient behind the counter himself.\n\nYou might get an amazing bagel and exactly what you ordered, or you may not. Luck of the draw with this place.", "author": "Sally S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-01-16", "description": "After waiting in line 15 minutes and making it to the register, I was told I never placed my order and would need to get back in line? 3 or 4 people looked at me and never asked. I said you just lost a customer and the rude cashier just turned to another customer and started gossiping? Just altogether awful experience. And how hard is it to make bagels?", "author": "Eliot S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-12-04", "description": "I've been coming here for a little while as I used to live across the street. The bagels are generally fresh and they're made in the back room daily. Spreads are also usually fresh, I'm a fan of the smoked salmon and whitefish salad. They'r open late so it's a great place to grab some food when coming back from the bar. Tons of different cream cheese to choose from if you're in to that. They have had issues with the health inspector in the past but they've gotten their grade up recently.", "author": "Matthew R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-04-03", "description": "HORRIBLE customer service...I ordered breakfast for delivery.. We ordered three bagels with cream cheese and one had lox, we also ordered The Fat Tony sandwich..the delivery was supposed to come in 40 minutes..when they did show 90 minutes later we called and was told the person already left..20 minutes later they still did not show so we called again and they said the person just left... Finally after some time our food arrived... Everything was cold and everyone agreed their cream cheese tastes weird.. Also the bagel that was supposed to have lox didn't have any lox... The Fat Tony sandwich was nothing more than a thin piece of meat..nothing fat about that..never ordering from there again... Waited forever for food that wasn't even satisfying.", "author": "Hannah K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-02", "description": "Still a neighborhood staple. But I just found out they're no longer open 24 hours which kinda sucks, though maybe I'm just nostalgic for my youth. It has to be said they get my order wrong roughly 1/3 of the time. I'll still be coming here regularly though.", "author": "Diana B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-09", "description": "This place is 3 blocks from house, open 24 hours, and has awesome customer service...what more can I ask for? I hate that they run out of everything bagels so often, but I get it cuz it's so many people's favorite (definitely mine!). Otherwise, they are always pleasant and the hazelnut coffee there makes my heart smile :-)\n\nLove them!", "author": "Garynn N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-31", "description": "You always hear about how amazing New York bagels are... Montague Bagels (aka Hot Bagel) upholds this reputation! Absolutely massive bagels for less then $5 open 24/7; you can't beat it! The owner's also the coolest, chilliest guy of all time. 100% recommended!!!", "author": "Bryce M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-06", "description": "Great food. So far, I've always noticed fresh and quality ingredients for sandwiches. Nice staff too. \nThe downside is that they don't read the whole order when ordering online. Just ordered some coffee with sugar on the side. No sugar is to be found and coffee is undrinkable. Kind of ruining my breakfast. Sucks! :(", "author": "lena p."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-01-01", "description": "I have been ordering from them for a long time on Grub Hub, but they will never get another penny from me. There service has been declining over the past few months its to a point now where its unacceptable. Our most recent order was never delivered, every time we called, they just said the same thing, we are really busy today because other restaurants are closed (Its new years day), but that is simply not true, most food places are open today.. \n\nAnyway, if you like really crappy customer service, and untruthful management, this place is for you. I would AVOID!", "author": "Paul D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-13", "description": "WONDERFUL, FANTASTIC, IMPRESSIVE, GREAT - these words to do even begin to express how I feel about Montague Street Bagels.  I live in the mid-west and wanted to provide my family in New York with a meal.  After reaching out to several places that could not accommodate my needs, I made one last attempt and called Montague Street Bagels.  Upon speaking with Albert, I knew I hit \"the jackpot!\" He could not have been more helpful, professional and eager to please - if he tried.  Albert guided me through my options, made perfect recommendations and followed up with me several times to ensure my satisfaction.  Both Montague Street Bagels and Albert far, far exceeded my expectations and hopes for getting this meal sent to my family.  They delivered - literally and figuratively. Every one of my very specific requests were met - on time and as I had hoped.  I heard from my family this morning after the food was delivered.  They were most appreciative of this gesture I made on their behalf.  It was kind of funny - they thanked me for my thoughtfulness but needed to be brief.  They said the food was so good that they had to get back to it and would talk to me later.  I'd say - Mission Accomplished.  I can't thank the staff at Montague Street Bagels enough for their efforts, kindness and unbelievable commitment to customer satisfaction.  There is no question about it, next time I am in New York, I plan to go to Montague Street Bagels.  If my experience was this good hundreds of miles away, I can't even begin to think how much I'll enjoy being there in person!  A huge, huge note of thanks to Albert and all the staff members of Montague Street Bagels - you are an extremely wonderful group of people making others happy with your delicious food and  excellent customer service!", "author": "Jack H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-06", "description": "Just walk in for the freshly made bagels baked on site... THAT'S IT.\n\nCheap prices, friendly service and amazing bagels to boot. I honestly think these are my favorite bagels in Brooklyn (so far). \n\nClass whole wheat is the bomb... I just wish they had more cream cheese options.", "author": "Leslie D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-02-28", "description": "I'm so tired of this place scrimping on cream cheese. My last bagel barely had anything on it. Service is generally scattered and forgetful.", "author": "Sara G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-18", "description": "Bagels, bagels, and then yes, lots of bagels! They had about a dozen choices and multiple types of everything bagels. I got 15 and ordered one of everything. Just make sure to eat them within 3 days, else they start to go stale. \n\nThe staff is very friendly, don't seem too busy the three times I've been and make a decent lox on bagel (they even had capers). Don't forget Wednesdays when they have a deal on a dozen (+3) bagels. Got a dog? Tie them up on the patio, order and come on out and dine with them. I'm sure they'll be happy to help you munch down on one or two. I know mine was.\n\nFYI, They typically have a groupon deal out there, so check it out. The place is a bit on the smaller side, so don't plan to come with your whole crew to chow down.", "author": "David A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-10-19", "description": "I'm finding myself less eager to return after my most recent visits, where the price of my usual order has varied so widely that I'm now unsure about whether I'm being under- or overcharged. My regular bagel with tofu cream cheese has always wavered somewhere between $2.25 to $2.75, depending on when I visited and who was serving me, but on my most recent visit this morning, I was charged $3.81, which was more than a dollar since my last drop-in three days ago. Because I was surprised that the price had jumped so much and so suddenly, I remarked, \"Wow, you guys charge a lot more now.\" The guy shrugged as he took my money, offering no explanation. Not that I needed one, but it's also become a somewhat more cost-prohibitive breakfast, especially when there are so many other bagel shops in the area that offer the same breakfast for less. True, it not the most expensive meal but as a regular customer, it'd be nice to not get sticker shock like that on random visits. \n\nI'm sad that I've lost my new to-go place, but I still stand behind the taste and quality for those that don't mind perhaps shelling out a little more for their bagel. \n\nMe, I'm taking my scant wallet and searching elsewhere.", "author": "Jane I."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-07-28", "description": "Are all of the reviews for this place fake? The majority of the suggested reviews I am seeing are from folks with 1 review (just for this place) and I only see 1 Yelp Elite review...\n\nThe manager and staff were very friendly.  The store has a lot of options.  But, they also messed up two of the three orders my friends and I placed.  When you are hungover and banking on the bagel sandwich to pull you out of the rut, a messed up order is about 10 times worse.  Oh, and another customer (one of the manager's friends it seemed) felt the need to chime in on our conversation when my friend was told she couldn't purchase a Gatorade because it was under the $5 credit card limit.  This is after they had messed up her order (which was over $5) and she had to wait for them to fix it.  Understandably, she was frustrated ... and this person reminded us it's because the restaurant gets charged a fee when people use credit cards.  We are aware of that, random stranger.  My friends and I had all worked in the food services industry.  But this store had messed up our orders and we still had to pay for it...so they should have made an exception to the rule to make their customer happy....which they ended up doing because they realized they were in the wrong.\n\nUgh! Just writing this all out reminded me how frustrating this experience was.  Plus, our food wasn't even good once it was all said and done.  The bagels were just bread blobs - not your typical *delicious* NYC bagels.  I had originally given this spot 3 stars, but I am bumping down to 2 because \n- the other reviews are seemingly fake. i don't want anyone making the same mistake we did of coming here because the reviews looked good.\n- the service was poor, though the employees were nice\n- the food itself was mediocre", "author": "Maria M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-09-18", "description": "Ever since this spot has been under new management has been a total miss. If the owners make your sandwich be prepared to receive 1/2 of the meat that should be on the sandwich and be over charged. I complained to owners they claimed industry standard but seriously far from the standard. I am a fair person but at times its crazy they run a business like this. If one of the employees make your sandwich its very different than when the owners do. Also, plan to wait incredibly long time as they are unorganized and slow. Prices have gotten out of hand as well, and for what? its pretty sad when a deli in prime area in midtown is cheaper than brooklyn.\n\nSo I go in today order a sandwich and only person in store. Wait 15 minutes and the guy comes to the register with a sandwich with no turkey which I ordered. Really? There is no one in the store. So then I continue and ask for a bakery item, a piece of crumb cake and the guy tries to charge me $5.00. This is really a joke. The average price in area is between $2-3. $5.00 are you insane? On top of it seamless list the price as $2.50 but in store its $5.00. So I walked out there empty handed no sandwich nothing as there was no way I was paying $5 for that item.\n\nSo to the owners think it would be better to charge customers the correct price rather than rip them off. Your ripping me off just wasted product and money. Laugh is on you!!!!", "author": "L J."}], "servesCuisine": "Salad", "priceRange": "Under $10", "name": "Montague Street Bagels", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "108 Montague St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/3kZ63PlW270NqHq1KFdn_w/ls.jpg", "@type": "Restaurant", "telephone": "+17182372512"}