{"aggregateRating": {"reviewCount": 191, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-16", "description": "Open 24 hours but close the grill sometimes. So when you go late at night, say 1am, you have to wait 20-30 minutes for food. But if you're open 24 hours, why are you closing the grill? You can keep it on all day even if you aren't busy...", "author": "Mia Rose L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-15", "description": "Their bagels are awesome. The staff are friendly. They have no CC minimum. Open til late. A couple of tables outside should you want to devour your bagel right away. What more do you want?", "author": "Julia B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-25", "description": "Great NY bagels. I got smoked salmon, scallion cream cheese, cucumbers, onion, tomato, and capers on an everything bagel. Delicious!!", "author": "Dale P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-05-22", "description": "I have been to this place a few times for bagels and breakfast sandwiches. Every time the service has been consistently slow. Waiting for 10 minutes in line when there are only 2 people ahead of you? That's ridiculous. \n\nThe food is ok, but if you want good service this is not the place for you.", "author": "Jonathan F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-08-11", "description": "Were you to measure the average wait time for a bagel in NYC bagel shops, this place would be near the bottom of the list. Their employees just aren't in a hurry, and are fairly disorganized. \n\nThe bagels are good though, and it's one of the few 24 hour establishments on Montague.", "author": "Kevin E."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-12-24", "description": "Crap bagels, crap service. Really reminds you how so many bagel shops in NY have gone way downhill.", "author": "Matthew C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-07-11", "description": "I purchased a groupon and the guy at the front counter/cash register looked at me like I was crazy. He told me to show him the groupon again, read it, and told me to redeem it in front of him, almost making me feel like I did something wrong or was totally annoying him. He threw my order together, didn't even ask me if I wanted any particular cream cheese (instead just shoved some plain one in the bag) and I was on my way. --this all I can deal with. The bagels were great and the cream cheese was fresh. What REALLY bothered me? Within the 2 minutes I waited on my order, he was soooooo unbelievably rude to the other employees that were working in the back. Yelling at them, condescending and just not pleasant to watch. They just remained quiet and looked almost afraid of him. For this, I give 3 stars. I was really uncomfortable and it did not leave me with a warm fuzzy feeling to return.", "author": "Ivey P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-06-14", "description": "The bagel I had gets four stars, but the service resulted in a loss of a star. The guy at the register wasn't exactly mean, but he wasn't exactly nice either. His attitude didn't really make me want to give him my money. I'll probably be back, but I hope I don't see that guy again.", "author": "Christina C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-04-25", "description": "Good solid and large bagels. I love that they have whole wheat varieties available in multiple  flavors like whole wheat everything and whole wheat sesame. Nice selection of cream cheeses as well. I generally like to opt for plain or tofu but they also have fruity and funky flavors (like a bacon cheddar cream cheese) available. Super fast service and nice location if you are in downtown brooklyn. Only downside is their coffee is not very good.", "author": "Jessica S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-02-03", "description": "This place used to be a frequent but now it sucks it has gone up in prices and down in quality. When they charged my friend 8 dollars for a cold cut sandwich I thought they where joking ( there old price was 5$) when they finally brought it to him and charged the money I was disgusted also the quality has gone downhill. I miss the old owners", "author": "Atticus K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-10-29", "description": "There's a reason why these people offer groupons \u0026 free bagels.. In the beginning of the year they had the biggest rat problem \u0026 got shutdown ! A lot of people didn't return.. I never will. It's disgusting.", "author": "Aisha M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-19", "description": "The bagels are the best and the sandwiches are too good. Tried both and I'm satisfied!", "author": "Rohan U."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-08-02", "description": "I used to love this place, having eaten there since they opened and frequenting it multiple times a week. I really dug the fresh baked bagels, delicious spreads, over-sized sandwiches, and in particular, the late-night staff who were friendly and engaging even at 4-5AM... Well, sadly that was all ruined by the new owners who fired all the great people who worked there and replaced them with rude and inept workers.\n\nThis is now a must-avoid joint, unless you desire slow service, stale bagels, your order screwed up (three times in a row was enough for me to give up), and possibly contaminated food.*\n\n* Take a look at the details of their Health Department inspection where they received a C rating.", "author": "Lee G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-07-26", "description": "Every hood has their bagel shop and this is mine. \n\nEven though it's not on my way to work I finally had to make a stop here because I had avoided it for far too long. As luck would have it, it was customer appreciation day and I got two for the price of one! \n\nI loved the doughiness of my wheat bagel. The accompaning strawberry cream cheese had real pieces of strawberries and was the perfect consistency. For my second bagel, I snagged a sticky and sweet french toast bagel that was the biggest bagel I have ever had! It was equally tasty though and I would definitely opt to get that again when I go back. \n\nThis place is cheap, easy, and close. What more good a neighborhood need?", "author": "Cassie P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-03", "description": "What a bagel should be. Boiled first and then baked. No fake Panera-type bread bagels here.", "author": "Robert H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-29", "description": "Great variety of sandwiches and cream cheeses! Ambience isn't great, but the food and reasonable prices make up for it.", "author": "Aidan B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-01", "description": "Pauls Way Sandwich, you are simply a delightful start to my day! I left my husband early just for you!", "author": "JoAnn N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-28", "description": "Montague Street Bagels has the BEST bagels in all of NYC, hands down. They are made fresh everyday and have such a wide variety. I highly recommend eating here if you need something filling to grab and go, or want delivery (free before 6 pm). My favorite thing to get is the toasted sesame seed bagel with low fat cream cheese! :)", "author": "Robyn S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-10-19", "description": "Over the past few weeks, they seem to be turning things around.  Orders have been consistently correct with good ingredients and pleasant service.  They have also added several interesting bagel flavors. I hope the positive direction continues...because I do love my breakfast sandwiches.", "author": "Geralt R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-16", "description": "This place is wonderful not only are the bagels great but the service is even better. One day a week or so ago, I was house bound, snow was in the forecast so I asked my husband to please get me 2 Everything bagels that night so I would have them in the morning. He did, so we thought. The next day, I opened the bagels at lunch time and found plain ones. I called my spouse who swore he had asked for Everything. I was so very disappointed to find plain bagels and I was very frustrated because I was not able to go there myself and exchange them that I called and asked for the manager. Explaining my situation, he not only had 2 Everything Bagels delivered at once, but also included 2 containers of cream cheese, one scallion and one lox. And a card to apologize. It was the nicest thing ever!", "author": "Martha F."}], "servesCuisine": "Salad", "priceRange": "Under $10", "name": "Montague Street Bagels", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "108 Montague St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/3kZ63PlW270NqHq1KFdn_w/ls.jpg", "@type": "Restaurant", "telephone": "+17182372512"}