{"aggregateRating": {"reviewCount": 191, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-06", "description": "I've been coming here for a year now and absolutely love everything about it. The bagels and sandwiches are outrageously good. My favorites are the sausage, egg and cheese sandwich and the veggie or scallion cream cheeses (they even offer low-fat cream cheese options). Definitely try the whole wheat everything bagels or the sun-dried tomato ones! The staff (especially Chris) are attentive, friendly, and welcoming. They remember names and orders. Whenever I'm in the area, it's my first stop. I love this place and look forward to coming here for a long time.", "author": "Ashley S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-02", "description": "Best bagels in bk heights. Would be five stars, but their DOH rating sketches me out a little... but not enough to stop going.", "author": "Tom P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-02-26", "description": "Nice Place to get Hot Bagels in the morning.\n\nI didn't got the sandwiches yet.", "author": "Jose C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-12-15", "description": "Placed a delivery order for 2 bagels when the store opened and the guy that took my order said there would be NO WAIT. They are located less than a 10 minute walk from where I live. An hour later I called and they said it would be 5 minutes more. 15 minutes later I call, they don't know where the delivery guy is, said they knew they said there would be no wait but made some ridiculous excuse about me being far away and the guy got lost, could find the keys to the bike, tons of other deliveries. Only then did they offer to call the delivery guy to see where he is. Still haven't heard back. Don't order delivery from this place.", "author": "Jade D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-16", "description": "I would say I love this place for the bagels lol just come for the bagels, my friend also had one of their specialty sandwiches but I mean if you just come here for a fresh chewy toasted bagel of deliciousness you'll leave happy. Plus it's only 2 dollars for a fresh fantastic bagel with cream cheese! Can't beat that!", "author": "Nicole S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-03-25", "description": "This review is based on the place's inability to get delivery orders correct from Seamless Web.  Seriously guys, it's written down.  It's not like you could have misunderstood what I said.  Who wants plastic-y cheese, melted over a sausage patty served cold with eggs?  Not what I ordered.  If you want to eat here, go in person.  Do not use their delivery service.  They don't take direction well apparently.", "author": "Vicky L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-07-04", "description": "Bought a Groupon which clearly does not register with the staff as a way to attract new customers...order was thrown together...would not go back", "author": "Peter M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-06-03", "description": "I was already turned off by the price of their individual bagels (99cents), ironically i recently saw groupon type offer that finally made the price seem reasonable. I decided to try the breakfast bagel sandwiches today - price that rang up didnt seem right - when i mentioned that she had mischarged me - i was informed \"oh, the prices changed recently, the ones on the board are not correct\"....and, the coffee was enh.\n\nI tried to access their website to contact the manager, and the website doesnt appear to be working at all (montaguestreetbagels.com), then stumbled upon another one montaguebagels.com - where guess what, the prices were even lower than on the board at the store...and, no way to contact them with questions/comments.\n\noh vey - I will not be going back.", "author": "Christopher v."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-19", "description": "The bagels are good, but if you are a true New Yorker these can not be the best bagels you have ever had.  What brings it all together here is all the options you have for bagels and sandwiches of any and all kinds, it makes the thought of the complete bagel experience better.  The issue for me with the bagels is that they are very doughy and a little too large, but they taste great.  I just can't stamp these as the best bagels in NY, but I will go here all the time.\n\nIt is a small place and when you walk in you will see the line coming at you to pay.  You stay to the left and go straight to the back to order.  After seeing the 1,000 sandwich options you make your order and immediately move into the line to pay.  They will deliver your grub to the register where you will pay.  Follow the system and don't try to disrupt it.\n\nThey have all schmear options for bagels and a number of interesting named sandwiches, as well as homemade cookies and treats, all crammed into a pretty tiny space.  The bagel artists are totally friendly and take all requests, including my dreaded nightmare: \"Can you scoop out the bagel?\"  Illegal!  This should be illegal.  Stop asking to scoop the inside of the bagel out, this is sacrilege.\n\nGo here, enjoy a good bagel, follow the system and you will be fine.", "author": "Jonathan G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-10-18", "description": "This place almost always has a Groupon, Daily Deal, etc. My review is based on the fact that I received a free bagel with a Groupon. Without the bagel being free, I would give this place 2 stars. For my \"sample\" I tried an everything, toasted with cream cheese. The bagel was bland, tough/chewy and the cream cheese was cold and \"blobby.\" I prefer my bagels to be done to perfection. Crispy and savory on the outside and soft/warm on the inside. If you have a Groupon for a free bagel, I wouldn't pass it up. But that the only reason to visit.", "author": "Mike M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-07-10", "description": "This place is getting better now that it has new owners but they are still slow and still messing up orders. I now preorder on seamless web instead of waiting on line forever. I wish this place could get it together and I would come here more often.", "author": "Aimee M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-07", "description": "great little place with amazing bagels right near the Marriott at Brooklyn Bridge (less than a mile).  Will go back next time in Brooklyn", "author": "Chelsea F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-29", "description": "What a gem in Brooklyn Heights! My family and I had fresh bagels and pastries and beverages for breakfast all for under $16.", "author": "Laurie M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-01-04", "description": "Service is terrible (new owners and new layout didn't change anything). Staff is rude and regularly screws up orders.\n\nBagels are good but not great.", "author": "Ron M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-11-01", "description": "Pure bagel awesomeness - though I still think that Absolute's may be better.  But this was a fantastic introduction for my wife to the wonders of the New York Bagel (as a Canadian who had never previously ventured to the Mid-Atlantic, she had only previously experienced Montreal and Montreal-style bagels).\n\nThe bagels are fluffy and doughy, but not quite as dense as other New York Bagels.  And unlike the faux New York bagel chains on the West Coast of the U.S., they actually boil and then bake the bagels.\n\nThey offer about 15 bagel varieties, none of which would be considered sacreligious, plus a variety of schmears.  And they very nicely served a plain bagel with peanut butter for my wife (her preferred bagel eating method).\n\nIn addition to the schmears and peanut butter, they also serve up a number of different sandwich options (all of which cost about $7).", "author": "Matthew L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-05-23", "description": "One of the sole reasons I miss living in Brooklyn Heights is the Montague Street Bagels. The staff knew me by name as I'd stroll in all hours of the day: drunk, hung over, blacked out, and at very rare moments sober. \n\nGreat variety of sandwiches and wraps, and the sun-dried tomato bagels with cream cheese are to die for....I am tempted to jump on a Brooklyn bound train now!", "author": "Anthony C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2007-10-22", "description": "The best bagels in all of NY...my college experience probably wouldn't have been half as good without this place!\n\nThe perfect combination...the Amanda Special if you will...is the cinnamon raisin bagel, toasted with butter and an Arizona Green Tea to be consumed only between the hours of 1am and 7am. Absolute heaven!\n\nThere is always a line outside this place on saturday and sunday morning...all of bklyn heights come out to enjoy the yummy breakfast sandwiches, spreads and bagels, mmmm!!\n\nIt's open 24/7 and the people that work there are awesome!", "author": "Amanda M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-29", "description": "As I go here only for the excellent bagels it would be hard to complain about anything else...It 's better if you should be there when your favorite bagel (Everything) is fresh out of the oven...Don't go there if you're expecting a full deli...You still will not find any fresh bagel store around the heights or near...Now don't expect quick service, especially lunch hours, and the staff is very friendly and polite....5 stars for the staff.", "author": "Jerry V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-02-05", "description": "The first time I ate a Montague Street bagel, my expectations were low. The line stretched out the door, and as I waited to order in the tiny space, I watched as a toddler took his tongue and licked (that's right -- LICKED) the chrome (from top to bottom, mind you) on the shop's glass display case. Said toddler's mother, amazingly, was oblivious; I was horrified; and my stomach did flips that I was sure even a well-toasted everything bagel couldn't cure.\n\nFive minutes later, though, I'd long forgotten about Brooklyn's most germ-ridden kid. The Montague Street bagels are hearty (meaning: HUGE) and fresh, with a just-tough-enough outer crust and a chewy middle that pairs perfectly with a schmear or three of cream cheese.\n\nMy suggestion? Go with pumpernickel. Order lox. Buy a cinnamon raisin for an afternoon snack. Don't worry about the wait -- It's worth it. \n\nOh, and please, keep your tongue to yourself.", "author": "Krissy G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-07-06", "description": "Something bad has happened here. The last two times I've been there, the tuna tasted very Off and the counter person was unpleasant. Just saw today that they received a C grade from the Health Department and that assures that I will never return. Ugh.", "author": "Lola F."}], "servesCuisine": "Salad", "priceRange": "Under $10", "name": "Montague Street Bagels", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "108 Montague St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/3kZ63PlW270NqHq1KFdn_w/ls.jpg", "@type": "Restaurant", "telephone": "+17182372512"}