{"aggregateRating": {"reviewCount": 191, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-04-03", "description": "I've been going to this bagel place for 3+ years and until lately, I was a SUPER dedicated customer and lover of Montague St Bagels. I even went on Thanksgiving night when the turkey didn't quite cut it. UNFORTUNATELY, around that time ownership changed and the service and quality has gone down tremendously. The bagels are never fresh anymore, the service is lackluster, and the efforts of running that place have gone into renovations and adding silly foods like hot lunches. So, I am changing my five star review to a two star--I would have given it one single star, but they are open 24/7. BRING BACK THE OLD OWNERS (and the little man that used to work late nights)!!!!!", "author": "kendra s."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-11-16", "description": "Not fancy.  Don't get your expectations up.  It's dirt cheap, 24 hours, great bagels.  If you want em hot out the oven try them on the way home from the bars in the (not so) wee hours.  Or, if you're old, get up early.  Plus, the egg bagel?  Oh yeah.", "author": "Kate T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-12", "description": "I got the regular NY breakfast here.  The only reason it didn't get 5 stars is because I had to make my own coffee and it was kind of weak.  Other than that, great customer service and food. Enjoy!", "author": "K. R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-11-02", "description": "1 star is generous. This bagel shop, affectionately known by locals and St. Ann's students as \"Hot Bagels\" because of the neon sign above the storefront window, used to be the go-to breakfast, lunch, dinner and late-night spot in Brooklyn Heights. It used to have amazing sandwiches and bagels, friendly and efficient staff, and diverse offerings of baked goods and pastries. I can't even begin to describe how far a downhill plunge this place has taken. It changed ownership about 2 years ago, and is now the most mis-managed abomination of a bagel shop that I have ever come across. The staff is clueless and the food is consequently ill-prepared. I ordered my standby a few weeks ago, an everything toasted with lox and cream cheese. I took it home around the corner to my apartment to eat it. It was a PLAIN bagel, without cream cheese, with just lox. Unbelievably simple order that this worker screwed up. No one here is trained on how to make the old standby-sandwiches. Smokin' Joes come out cold with no cheese. \n\nOdd things happen here now. I call in the morning for a delivery and I'm told to call back later. Right now, as I write this I sit at home waiting for my delivery. I ordered two bagels with cream cheese and lox. I live DIRECTLY around the corner. A 30 second walk. It has, thus far, been 47 minutes since I placed my order. Things are forgotten from orders, food is prepared wrongly. This is the most depressingly awful change of ownership I have ever witnessed in a eating establishment. I used to be proud to bring newcomers and out-of-town visitors to Hot Bagels, it was the pinnacle of great Brooklyn deli. Now it is a shameful sinkhole of quality. Utterly embarrassing. It has a stranglehold on Brooklyn Heights eating because there aren't any other bagel shops or 24 hour delis--hang on---food just got here. 50  minutes--Oh and my father just brought to my attention that neither of our bagels are toasted--realtime reviewing here--this place SUCKS now. It SUCKS, and I want the old owners to come back.", "author": "Brian C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-15", "description": "Good Bagels! i love coming here on Sundays and getting an everything bagel with scallion tofu spread and tomato or an everything flagel with butter.", "author": "Michael N."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-05-24", "description": "I've lived near this place for four years and I can't believe how much the service has gone down under the new owner. I used to be a regular because the bagels were amazing and the staff was super friendly, but this is just BAD. It takes them anywhere from 10 - 20 sometimes to make my sandwich... WHEN NO OTHER CUSTOMERS ARE AROUND. This is not a one-time thing. It's the standard. This used to be my go-to place and now I avoid it.", "author": "Angelina F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-03-25", "description": "excellent bagels LOVE THE STAFF AWESOME PEOPLES AND FOOD IS GREAT !!!!!!!", "author": "Nicholas C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-07-13", "description": "aka Hot Bag (because their neon sign tends to be blown out in amusing ways) must be one of the best bagel places in NYC.  You basically can't go wrong, but one of my best experiences with them was when friends and I stopped in for a post partying snack early one fall morning.  I got a pumpernickel bagel, toasted, with butter.", "author": "Rachel L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-11-11", "description": "If you wanna a fresh delicious New York Bagel, this is the place to go!", "author": "Elan K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2010-12-05", "description": "This used to be our absolute favorite bagel shop in the area. The food, the service, the people - everything was great. We often said how lucky we were to have this place so close by. Then it all changed this summer/fall. The owner sold it and a new owner took over. She is driving this place into the ground. It's so sad, and actually a little depressing. The employees are all new (I think the previous ones knew enough to get out when she came), and the service and selection have declined completely. We keep giving it a new try, hoping in vain for it to bounce back to what it was. The simplest orders they can't make right. At first there were lines out the door... because the new employees and the whole flow of the place were so screwed up!! And now on Saturday mornings there's hardly anyone there. I went there one recent Saturday morning at 9:30 (prime bagel business time!!!) and they had FOUR bagel options for me - and none of them were plain bagels. I was shocked. All I wanted was a plain bagel w/egg. It was pathetic. The owner yells at all her employees and sounds like a nightmare to work for. My husband overheard her interviewing someone for a cook position (right in earshot of the customers!), and she was saying how she's going to turn this business around and make it something great. That's absolutely laughable because she HAS turned it around - right into the ground! It WAS something great - modest yet delicious, friendly, and professional. Now it is sadly none of those things. We are mourning what Montague Bagels used to be. It will never be the same. All we can hope is this place closes quickly and something decent takes its place.", "author": "Lisa F."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-03-06", "description": "I'm really surprised to see all the positive reviews about this place.  I mean, the bagels are passable, but this is New York, people.  The bagels are supposed to be great.  And Montague Bagels just isn't.  And that's saying nothing about the fact that the spreads and salads look like they were prepared two months ago, and the people working behind the counter are, shall I say, less-than-on-top-of-things.  I guess if I were younger and cooler and I would appreciate that it's open 24 hours.  But I'm not.", "author": "David B."}], "servesCuisine": "Salad", "priceRange": "Under $10", "name": "Montague Street Bagels", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "108 Montague St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/3kZ63PlW270NqHq1KFdn_w/ls.jpg", "@type": "Restaurant", "telephone": "+17182372512"}