{"aggregateRating": {"reviewCount": 191, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-12-16", "description": "Since new ownership has taken over... this location has been on a steady decline.  All of the prices have gone up, while portion size and inventory has been reduced. I would not be upset about this and would understand this if both the quality of the food and the service had gotten better, but they haven't.  \n\nOrders are rarely correct, the staff is under trained, and the presentation of the food is mediocre.  \n\nLast evening, I walked in and placed an order for a toasted bagel with turkey and cheddar.  Seems like a simple order.  I got home and opened my bagel and it was bologna.  How does somebody working at a deli mistake BOLOGNA for TURKEY?!?!\n\nA week ago stopped by for lunch and ordered a turkey sandwich with bacon and cheddar. Seems like a simple order.  When I got home and opened the sandwich, there was no turkey.  They had FORGOTTEN THE TURKEY!!\n\nThis used to be a great neighborhood spot that had personality. These days, nothing about the place feels like it belongs in the neighborhood anymore.  In fact, I asked about the two strips of wallpaper on the wall.  They're scenes from Paris and LA.  Because the owners are from Paris and LA.  It just seems confusing that in a place called \"Montague Street Bagel\" that there are pictures of Paris and LA on the wall.  \n\nHard to endorse a place I used to love when its clear that ownership is trying reduce costs and increase margins at the sacrifice of customer satisfaction... and when the owner works the register and proudly charges more for food that has less ingredients than it did before he took over, and his undertrained staff is serving sub-par food... it makes folks who have lived in the neighborhood for years very upset that they're being ripped off.n", "author": "Pablo D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-11-25", "description": "Montague Street Bagels offer decent bagels- nothing poor, nothing special- at a reasonable price. It's the kind of place I'd hit up late at night for a quick bite and when only diners might be open. The service has always been professional and up to par.", "author": "George S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-25", "description": "Excellent pumpernickel! Crunchy on the outside chewy in the middle like any proper bagel should be.", "author": "Hyong L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-03", "description": "Best bagels I've ever had, easily will keep you full for few hours.", "author": "Jedrzej N."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-11-05", "description": "This place is a disaster. They get your order wrong every time and if you order through Seamless, you will never get your food.", "author": "Christopher L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-13", "description": "This place is an absolute gem :), I ordered a lox and scallion cheese bagel, was pleasantly surprised at how much salmon they put on the bagel!! because being in NYC everything is overpriced and you don't get much for your money. They have a great selection of tea's/soda's. If you only have a sweet tooth they also have pastries\u0026donuts. The staff are so nice and chatty, they also speak french or Spanish if you don't speak English!! \n\nDefinitely value for money and I like that it's a local owned business its important we support the local businesses!! Thank you Montague Bagels I will be back again :) keep up the great work.", "author": "Siobhan B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-27", "description": "These people were remarkably slow. I have never waited that long for 2 bagel sandwiches in my life. And they were tasteless.", "author": "Marissa P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-03-16", "description": "Food is decent and the staff seems friendly enough, but this morning was slightly disturbing.  I'm waiting in line along with others and when it's time to swipe my card, I was the only person she asked to sign the receipt.  Every other person in front of me paying with a card was not asked.  Felt slightly racially profiled.", "author": "Tracey L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-29", "description": "This review is just for the bagels, which I really like. They are not the old-time traditional New York bagels, but are a bit softer and bigger, and I really like them for sandwiches. And a special call-out to MD behind the counter, who is always very friendly and super-efficient with my orders. \n\nOne thing, though - I do wish they baked them more than once a day, like the former owners did, as if I come in during the afternoon I can't be sure they will still be really fresh. So I always try to come before about 2pm!", "author": "Rick E."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-02-25", "description": "Come somewhat infrequently and usually just get a bagel or two to take home. They aren't great but fine enough. But recent two experiences not even just fine. Last time I ended up with two that were already a bit dry and stale tasting. This time I ordered one buttered. Briefly considered asking them to go light on the butter but figured I could remove some if there was too much. Took quite a while. There were a few other people waiting. Woman waiting at the cash register clearly looked frustrated and though she had been waiting long. Another woman they came back to and asked her to repeat her order (she had already been waiting and was there even before I came in). Had I known it would take a while i probably would have not gotten anything on it.  So it was particularly ironic when I took it out and saw there was practically nothing even it it. Not sure what exactly was being done while I waited but it sure wasn't the time to spread butter on it.", "author": "Jen K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-05-11", "description": "My review went from two starts to 0. My sister came in to this bagel establishment during her lunch break. She chose to purchase a bottle of water from here, and eat a slice of pizza from an outside source. No one else was in the bagel store, so she chose to sit down. She was going to sit outside but it was 25 degrees, and wet from the snow. Two gentlemen watched my sister eat the entire pizza without saying a word, and told my sister to take her pizza box out of the garbage can (very shy female that's polite). It was terrible and rude. Not to mention, she tipped $5. He said, \"you spent only $1\". He should have said something from the beginning.\n\nShe left traumatized, and said,\"if someone would have said something to me, I wouldn't have eaten it here.\" And they told her to take her garbage out of the garbage can. ::raised eyebrow:: \n\nI have ordered bagels here for my office and NEVER AGAIN. They are losing my business, and business from friends of mine through work. I should have remembered the mediocre bagels I bought there from a groupon while in college.", "author": "Alexia G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-01-21", "description": "Tried going back there again, after sampling other bagel options in the neighborhood.  The bagels themselves are still delicious, but at this point it's just easier to buy the bagel and cook your own bacon and eggs at home.  Prices have gone up, and today, the bacon was inedible, served undercooked!  Sad.", "author": "Jen A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-29", "description": "I've been going to this place for over 10 years.  Consistently great Bagels and Sandwiches at a reasonable price.  Not like all the other pretentious, overpriced and under whelming Eateries on Montague Street.", "author": "Jumpin J."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-11-05", "description": "These people are so rude!  I waited 20 minutes for food that wasn't even being prepared. I asked the status after 10 minutes of waiting.  The guy at the counter treated me like crap. Refunded my money with no apologies what so ever. \n Never again.", "author": "Joe B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-15", "description": "Just wanted to say- I stopped in to grab a late lunch today- Sun 10/15, 3pm- and my experience was great, top to bottom. Service was very friendly- and my order was delicious. (Plain bagel with lox spread, capers, tomatoes on the side) Everything was very fresh and tasty. Thank you!!!", "author": "Megan H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-12", "description": "This is my favorite bagel shop in the city. They have all the options of your typical NYC bagel jaunt. They have by far the best smoked salmon in their lox spread I've found. Also recommend getting your bagels and then walking the two blocks down montague to eat them on the Promenade. Only not giving 5 stars because the service is usually rather slow", "author": "Micah M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-08-06", "description": "I wish I could add a picture of the vegetable cream cheese on a Flagel that actually lacked the vegetable cream cheese even though I asked for extra. Every Time I order something, they always mess up the order. It's not worth the hassle, time and money.", "author": "Evelyn A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-26", "description": "I've always liked this place and since they are under new management, they've only gotten better. Carlos and Herve the new owners is very attentive, such a gentlemen, and really cares about the business' success. The menu boards are more updated and clear. The interior looks more kept up and inviting. There are quite a few more baked good choices (hello Montague!) but they've retained the charm of the original place. Best bagel spot in Brooklyn Heights neighborhood! Bagels are kind of like pizza in my mind - best in New York - insert something about the water here. Montague's bagels though are at the top of my list of bagels in Brooklyn. They make them fresh every morning, and have a relatively large variety of tasty flavors for how small a shop they run. \n\n\nI'm from Brookline Ma. And we know our bagels! Not a huge fan of New York Bagels but, no worries....these are amazing!!\n\nThe Lox/Cream cheese bagel is to die for!\n\nThis place rocks my bagel world!! If you haven't tried this place, you need to!", "author": "Bory T."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-04-30", "description": "I really wanted to like this spot since I just moved to the neighborhood. The bagels here are a joke. I ordered everything with scallion cream cheese. The bagel has maybe 5 sesame seeds on it, a sprinkle of salt, no poppys or onions to be found. The cream cheese portion was comical. This is not an authentic New York bagel - it's not even close. Cherry on the sundae was the $5 price tag. I know this is New York, but $5 for a neighborhood POS bagel? Give me a break. \n\nAn insult to the New York breakfast staple.", "author": "Melissa G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-12-01", "description": "Used a Groupon of $10 for $20.\n\nI got a Orange-Mango Naked Smoothie drink - $4. Better to get this at a supermarket for a lower price.\n\nMuffin - $3 - I got a cheese chocolate muffin which was rich in chocolate. \n\nPhilly Cheese Steak Most Popular - $7.35 - \"Grilled steak, sauteed onions, American cheese, overstuffed on hero\".\nThere was just a slice of cheese with alot of beef and green peppers. \nThis was a bit oily.\n\n\nTuna Salad Wrap $6.75 - Romaine lettuce and tomato. This was my favorite. No complaints.", "author": "Ilene E."}], "servesCuisine": "Salad", "priceRange": "Under $10", "name": "Montague Street Bagels", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "108 Montague St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/3kZ63PlW270NqHq1KFdn_w/ls.jpg", "@type": "Restaurant", "telephone": "+17182372512"}