{"aggregateRating": {"reviewCount": 191, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-12-26", "description": "I have not tried any of the food at Montague Bagels but I was treated horribly by the owner earlier tonight and while there are many wonderful businesses on Montague, this is not one of them. \n\nMy dog chewed on something on the street today and started choking. I was outside this bagel place and walked inside and asked for one of those tiny plastic cups of water (the mini clear ones intended for free water). The woman behind the counter was very nice and said of course. She filled a cup for me at which point the owner, who was standing by the counter, informed me that I would have to pay for it. \n\nI thought he was joking at first because it's waterfor a choking animal (and even if it wasn't an emergency, I have NEVER been given a hard time when I've asked establishments to fill up my water bottle at the sink, etc.). When I realized he looked serious-- in fact, he looked rather angry and aggressive, I clarified: you want me to pay? I didn't have my wallet on me because I live a block away and also it's WATER. He asked me if I knew how much the cup cost and I said I didn't know. He then asked me if I thought water was free to which I said yes. He asked if I'd like him to go into the back and get his water bill so he could show me it wasn't free. At that point, I was concerned about my dog and about this man's sanity/humanity so I left. \n\nNeedless to say, I will never be going back here and my friends from the neighborhood who I met later for dinner were all equally horrified and will never patronize this place either. \n\nThe owner clearly is on some sick power trip and I wish I had gone across the street to Connecticut Muffin in the first place where they filled a tiny cup of water at the sink and were gracious about it.", "author": "Alex M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-07-10", "description": "Bagels are amazing but what I love even more are their sandwiches!  I highly recommend the pope of montague which is turkey and cheese with gravy.   They have a bunch of excellent combination with cool names posted at the counter. You can order custom sandwiches, my favorite being chicken cutlet with lettuce, tomato, onions and bagels on a toasted roll.\n\nI do recall eating a very divine sandwich here last year around 3 am so this place is really great for anytime of the day.", "author": "Cynthia L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-03-31", "description": "My wife wanted to buy bagels tonight for a school event tomorrow morning. I called this place and asked what their hours were. The guy on the phone said \"24 hours\" I couldn't believe it! I had no idea. So my wife went down there and guess what! There was a guy inside at the register but the door was locked. She pulled at the door a few times and the guy inside just stood there looking at her like she was crazy. He didn't move a muscle or acknowledge her besides staring at her. I don't care if they have good bagels or what but that nonsense is not cool. Won't be back due to stupid service.\n\nRATING CHANGE TO REFLECT FOOD QUALITY RATHER THAN ONE BAD EXPERIENCE.", "author": "Luis F."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-07-31", "description": "Not good + C health rating = 2 stars. \n\nSandwich meat was dry, toasted bread without asking (I'm thinking it was stale) and lettuce was turning brown.  Eww.", "author": "Mike P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-02-19", "description": "Although people working there seem friendly they never seem to get the order right. More often than not I would receive something different from what I would order, even when I place my order slowly and clearly. Also, your 30 min lunch break may not be long enough for them to prepare a sandwich or salad.", "author": "Marius H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-26", "description": "Great Deli.\nI only get the hungry man or a bagel.  They have real strawberry cream cheese... not the pink manufactured past from dd, but cream cheese with strawberries in it. Great spot for breakfast or lunch... theres only one place to sit inside and like two tables out side so buy and go is the standard but my friends and i have always gotten a seat.\n\nGreat sandwiches\nAwesome bagel\n\nOnly four stars because the coffee was not that good... just go to the Starbucks a few doors down for coffee but get your food here.", "author": "Carlos H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-12-13", "description": "Nothing to write home about. Staff clowns around a little too much for me and the bagels are decent at best...C rating turn off.\n\nOpen all night which helps.", "author": "Michael L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-10-21", "description": "Mediocre at best. Came here because we stayed nearby and having seen the mixed yelp reviews we decided to take a chance. The place was not the cleanest establishment we've ever seen but that was fine, it's the bagels that really fell short of our standards. Dry, not flavorful, similar to store bought ones. Next time we're in the area we'll try our luck elsewhere.", "author": "Katya B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-07-04", "description": "Okay.  Before today, I would've given this place three stars, but after this morning, I have no choice.  I just moved back to the neighborhood and decided to order bagels.  For some reason, I also decided to order a rice ball.  I'm not upset that the delivery took over an hour, even though they're about 4 blocks away.  I'm not upset that one of the sandwiches we ordered asked specifically for no lettuce, and of course, it had lettuce.  I'm upset because when I went to open the rice ball, it was frozen solid.  Not room temp.  Not cool.  Not cold.  Frozen to it's core.  How can you send that out?!?!  Totally unacceptable.", "author": "Craig L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-09", "description": "When my parents come to visit New York City there are certain things they are interested in, good food, bagels, museums, walking, bagels and umm, did I say bagels? They live in a certain very cool city on the West Coast, which has a lot on New York...but no really great bagels. I went with them to try Montague Street bagels, which I always thought was called \"Hot Bagels\" and was pleasantly surprised. The bagels are big, soft, chewy and quite tasty. The staff, though seemingly distracted, served everything up pretty quickly with a smile.", "author": "Shira R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-08-15", "description": "This place makes a good wrap \u0026 a good bagel. I had an eggplant wrap and a plain bagel with cream cheese and both were good. The workers are nice, a little slow, but nice. It wasn't crowded both times I went, so no worries on a wait. Prices are low and when you check in, you get a free bagel :) gotta love it!", "author": "Giovanna A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-09-04", "description": "Very dirty....\n\nHandling bagels while handling cell phones and other items that are filled with germs...", "author": "Chip B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-05-13", "description": "Thank you Yelp for my free bagel with cream cheese! With my check-in I was able to get any type of bagel but only plain cream cheese. I got it lightly toasted and even though the bagel was huge and the cream cheese was generous, the flavor was just okay. It seemed a bit crumbly and dry in texture, not the chewy bite to it that I usually love in a bagel. Service was friendly enough, but I don't think this will be my go-to spot for bagels in the neighborhood.", "author": "Cynthia M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-02", "description": "I had tried various flavors of bagels and cream cheeses there, all very good. The bagels are huge and soft. I always get my morning coffee / bagel there. I also had eaten their salmon, chicken, and honey mustard salards. All very tasty. The place is open 24 hours. The employees on all shifts are super friendly. They let you try the various cream cheeses and salards before buying.", "author": "Thomas S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-09-06", "description": "Wow ok these people sent out a delivery guy that DOES NOT SPEAK ENGLISH. Haha why would you do that because he gave us the completely wrong orders. So stupid", "author": "Maggie B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-22", "description": "My first neighborhood bagel stop while visiting family, just a few blocks away. I've had the egg sandwich which is decent. Bagels are always fresh in the morning and satisfies my NYC bagel craving. Check-in for a free bagel!", "author": "Cindy A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-01-01", "description": "I have been waiting over 2.5 hours for a small delivery. Every time I call I am told it \"just went out\". Awful experience.", "author": "Kristin M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-06", "description": "Solid place to get a bagel sammich and a coffee.  I  go in 2-3 times a week for at least a coffee and have never witnessed the UBERCHAOS that some people describe while ordering (hello, this is a brooklyn bagel shop... they're not notorious for being organized.) If you've ever eaten at basically any bagel shop ever you'll be able to figure this out.\nI work up the block and many of my coworkers have been eating here consistantly for a while.  The prices are on-point for bfast and the service is reasonably fast.  Sometimes I'll catch them when the bagels are hot and fresh which is awesome. Decent amount of spreads which they dont completely smother the bagel with (bonus points there.)  \n They get me in and out with my egg+cheese+hotsauce on a bagel and large coffee in an avg 4 minutes, so no complaints here.", "author": "Cristina R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-05", "description": "Honestly, they had the best Brooklyn boiled bagel I've ever had!! thanks again to the staff! The customer service was GREAT.", "author": "April D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-06-20", "description": "If I could give this place 0 stars I would!  I have used this bagel place since I started working in Brooklyn Heights almost 4 years ago.  I buy the occasional bagel for myself for breakfast and every few weeks I buy the office staff in my building bagels (usually a dozen + butter and bream cheese).  We also (the staff in my building) frequently buy the lunchtime special.  This morning I went in with my daughter.  She wanted a bagel with bacon and I ordered half a dozen bagels.  I went to the counter where I ordered my daughters food with a guy who was on the phone at the same time as taking my order - he walked away and I was not sure if he took my order so when the other guy (a short fat, dirty scruffy looking dude) came to the counter I asked him for the half dozen bagels then said I wanted the bagel for my daughter and the bacon - well done.  This is where he flipped hid lid, started criticizing me for doubling up on the bagel order, fired the bagels on the counter and then ignored me while I was trying to pay and served someone else.  Of course the bagel and bacon where not given to us the way we wanted and I stupidly purchased almost $20 worth of goods anyway - it will be the last time I EVER set foot in this place.  I should have known not to since it has already been shut down by the health dept and judging by how the obnoxious/ignorant server looked this morning it is no wonder.  I will be making sure none of my colleagues buy from there again either!  We were both so upset and almost in tears over this moron.  No bagel is worth this horrendous lack of customer service.  Hope he feels like a big man - he sure doesn't act like one!", "author": "Louise F."}], "servesCuisine": "Salad", "priceRange": "Under $10", "name": "Montague Street Bagels", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "108 Montague St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/3kZ63PlW270NqHq1KFdn_w/ls.jpg", "@type": "Restaurant", "telephone": "+17182372512"}