{"aggregateRating": {"reviewCount": 191, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2019-05-11", "description": "Montague Street Bagels is an unassuming basement storefront that doesn't even have a sign with the name of the business anywhere, unless you count the \"HOT BAGELS \u0026 DELI\" which easily gets overlooked. However, this non-nonsense, basic attitude is what I respect so much about this neighborhood gem. The drab and grey interior belies the delicious, warm, fluffy bagels made in-house (you can take a peek behind the doors!) throughout the day. A bagel with veggie cream cheese, made of sweet bell peppers, carrots, radishes and cucumbers, comes out to $4.50.", "author": "Michelle C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-05-21", "description": "One of the worst meals me and my colleagues have had in a long time. The sandwiches were horrible, the ingredients just weren't fresh. I had an omelette today and the eggs were hard, dry, and tasteless. You'd expect eggs to have some fluff and moisture to it, but no. You know something is wrong when you put the fork into the omelette, lift, and the entire omelette goes up with it. The chorizo was dry. Ordered bacon which wasn't included in the omelette. The home fries were mushy like mashed potatoes. I tried to drown everything in ketchup to make it bearable to eat, but they only gave me 4 packets for an order with 3 dishes. So... It went in the trash.", "author": "Mike C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-01", "description": "Forever my favorite deli. I was introduced to this place when I first move to Brooklyn 6 years ago and I have been loyal to this place ever since. Their bagel will satisfy any bagel aficionado. Their staff is always sweet and they always perfect my order no matter how complex it is. I wish this place much success!l", "author": "Marley M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-11-23", "description": "Ordered through seamless and found mold on the carrot cake as I was finishing up the meal. Both seamless and Montague Street Bagels refused refund for full order (coffee, bagel, carrot cake.) So gross and unacceptable. We all make mistakes, but zero recovery and they wouldn't take responsibility.", "author": "Jennifer G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-01-27", "description": "After a brief attempt to be healthier, we quickly changed our minds and went to Montague Street Bagels. This was not our first time here, and it probably will not be our last, but most of that stems from convenience and not quality. Today, the everything bagels were well-made and fresh, with a crisp exterior and adequate seasoning (including salt). Other days, the bagels have been more disappointing, with a stale tinge and funky cream cheese (not the dancing kind). They have lox-scallion cream cheese, a great combination that I would not be surprised to see take off soon in the wider bagel world--but their execution is a bit lacking and their schmear far too generous. The coffee is good.", "author": "Ben B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-09-03", "description": "They seem to be trying....\n\nAs others have noted, the service at Montague Street Bagels has often been poor and inaccurate.... I am happy to say that the past few times I have visited the service has improved, but the accuracy and speed is still an issue. \n\nAs for the Bagels -- They are better when you get them early in the morning. Again, the quality of the Bagel is better than previous experiences but is far from where this place used to be in terms taste and value. \n\nAll in all -- I will continue to go here and hope that this recent uptick in service and quality is a trend in the right direction.", "author": "Thomas M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-25", "description": "Freaking AWESOME!!! I was dog-sitting for my brother and sister-in-law and came here to get a hefty breakfast before I went back to Manhattan to continue the moving process. I got the whole wheat everything bagel, egg whites, peppers, spinach, mushrooms, onions, and scallion tofu cream cheese. I never had tofu cream cheese before, but it is delicious. They were sweet and let me taste test the two different scallion cream cheese. \n\nThey're fast, cheap, and delicious!! A neighborhood gem :)", "author": "Paige H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-12-19", "description": "Haven't gotten the chance to taste the food. This is only a review of their online ordering and delivering. I placed order at 10:30. Said food will be delivered by 11:00. I called 11:10 and asked them status of my order and they said they didn't even make it yet, that it'll take another 10 minutes to make. Based on that alone, I will never be ordering from them again. They completely wasted my lunch hour", "author": "Anthony L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-12-05", "description": "The food is actually fine. But DO NOT UNDER ANY CIRCUMSTANCES ORDER ONLINE FOR DELIVERY!!!! It is no exaggeration to say that 9 times out of 10 it will take almost two hours for the food to arrive. And half the time the order is wrong. So, the food is guaranteed to be cold, and you are guarantee to be annoyed. And then when you call, you get the stock answer of, \"It left a while ago\". So, I'm not sure if their delivery guys just don't know there way around town...but I live only 10 minutes from the shop.", "author": "Matthew K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-31", "description": "By far the best bagels in Brooklyn heights. They make their bagels in-house, if you come in at the right time, you'll find fresh warm batches of different flavored bagels ready to eat, as well as a wide selection of flavored spreads. The staff is incredible. They are very friendly and if you come here often, they'll memorize your go to order. They have a huge lunch menu and fair breakfast specials. This is one of those places where you can come in everyday and never get tired of the food.", "author": "Shirley R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-27", "description": "I ordered from this place way too much when I lived nearby. Their lunch sandwiches, bagels and pastries are all top notch. Bagels are always soft and fresh and the order/processing time is quick. Note: Not much seating.", "author": "Kris P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-10", "description": "i came here about a year ago and was disappointed.  the bagels weren't hot and service was slow.  i was walking by the other day and noticed the baker pulling a fresh batch of bagels out of the oven and decided to go in.  WOW!  things are different.  the bagel was probably the best i had in a while.  reminded me of old school brooklyn bagels... a nice crust on the outside with a doughy, pulley inside.\n\ni also ordered the bacon, egg and cheese on a bagel.  they definitely did not skimp out on the sandwich.  while most places only use just one egg and two slices of bacon, Montague definitely used 2 eggs and tons of bacon.  i could only eat half and had to save the rest for later.\n\napparently, one of the workers told me that a new owner took over about a couple of months back and is a serious foodie.  i haven't met him / her yet, but definitely will be coming back.\n\nMontague Bagels, congrats!  keep up the good work and i'll definitely be coming back.", "author": "Jay Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-23", "description": "This store needed a major change, and it got one.  \nFinally a business owner who knows how to run a bagel store.  Seek out Albert next time you're in here. \nThe bagels are better than ever, the coffee is the best on the block, and the staff seems to have a new upbeat happiness about them.  \nI'll be back as a weekly regular.  \nThank God for the resurrection of Montague Bagels!", "author": "Jonathan P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-17", "description": "We come to this place every weekend to grab a bagel and they never disappoint. Good customer service and awesome bagels. I'm a fan of their bagel with Lox, my husband of the sausage, egg, and cheese bagel. Portions are generous.", "author": "Alexis W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-18", "description": "ok updating this because the bagels are bomb i got the jalapeno cheddar cream cheese on half and bacon scallion cream on the other half of an egg bagel. it was heavenly", "author": "Danielle G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-26", "description": "Great location. We took our bagel sandwiches to go and ate them on the Brooklyn Promenade looking across to Manhattan. Priceless.", "author": "Gemma H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-25", "description": "My first experience eating NY bagel in NY, and I was absolutely blown away!\n\nI ordered the sausage-egg-cheese on an everything bagel. It was not only massive but also just $5! We had the bagels at the promenade, which is only 2 blocks away, and I was such bad company as I inhaled my bagel. The salty and substantial sausage was lovingly wrapped in creamy egg and cheese. The everything bagel tasted so fresh with a chewy interior and a crackly crust that also provided a kick.\n\nIf you are going to carb load, do it properly and eat here so you can get a mouth-smacking delicious experience to satiate your guilt (if any) after!", "author": "Jenny P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-02-17", "description": "Inconsistent and bagels are sometimes doughy. I've seen it is under new management but in the past they have had issues with food heath ratings.", "author": "Jessi B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-17", "description": "Came here for a late morning breakfast. Service was quick and attentive. Our group had everything bagels with lox and cream cheese, and they were so good! Cinnamon raisin bagel was hot off the oven. The seating area is pretty small so you may need to take it to go, but it's worth it!", "author": "Brandon K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-12-18", "description": "I came here the other day because of all the great reviews.  I ordered the Wheat Sesame bagel with sun dried tomato cream cheese.   I've never seen the wheat sesame bagel anywhere before so I wanted to try it.  The bagel is good but the cream cheese was dry and not so creamy. \n\nThe coffee is self serve and its in a huge container like 7/11.  Also I realized after I left that the price of the bagel with flavored cream cheese is 2.75 but I was charged 3.85.  Don't tell me Tax is 1.05 cents.  \n\nLastly the management was arguing with a rude employee in front of the customers. Take that ish to the back room. I want to have a bagel in peace. \n\nIt was an OKAY experience and if you don't get jipped the prices are reasonable.  I might come back again if I were in the neighborhood but I won't go out my way to come here.", "author": "Ahmed M."}], "servesCuisine": "Salad", "priceRange": "Under $10", "name": "Montague Street Bagels", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "108 Montague St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/3kZ63PlW270NqHq1KFdn_w/ls.jpg", "@type": "Restaurant", "telephone": "+17182372512"}