{"aggregateRating": {"reviewCount": 154, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-29", "description": "They're always super busy in the morning, but despite that service is fast and accurate. Staff is friendly and efficient, and prices are very reasonable. One of my favorite bagels in Brooklyn!", "author": "Grace S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-05-07", "description": "Had to walk back there twice after they got the order wrong. Got back to my apartment after going there twice, only to find that the order was still incorrect. \n\nI wouldn't be this upset if the people behind the counter weren't so blatantly rude and uncourteous. I honestly wouldn't go here if you could avoid it. Aside from today, they've screwed up a toasted everything bagel scooped with cream cheese and onions request on three different occasions.", "author": "Jon F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-31", "description": "A very good bagel. Friendly staff. We got eggs and cheese on a bagel. They have deli meats and will make all kinds of sandwiches. Good standard new york deli coffee. Nice breakfast (or lunch) for a day in NYC.", "author": "Ben E."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-05-05", "description": "It's kind of pricey but the wait is not long. They are well organized with taking orders even it's busy. This is my all my breakfast spots are closed place to go to.", "author": "Nick S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-04", "description": "Best bagels around!! This place has been around for as long as I can remember and I can always count on a delicious bagel. Be prepared to wait because the line can be long, but worth it.", "author": "Carly G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-11-10", "description": "Love the bagels here--pretty big sized bagels...\nThey have variety of sandwiches but I usually go for breakfast. I got the pumpernickel bagel toasted with olive cream cheese and tomato...they have variety of cream cheeses also.\nVeggie omelet wasn't bad, a bit flattened but still good.", "author": "Lynie H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-13", "description": "Sad I can't give this place zero stars. This is the fourth or fifth time I go and there and as always they screw up my order and give me attitude. \n\nI understand there are customers waiting but if the staff cannot be fast and accurate then don't even try. Today I came for a simple eggs over easy, turkey bacon, and toast. This of course after a previous fiasco which lead me not to go back for over 6 months. \n\nI normally don't check my orders but with their track record. I decided to make sure my order was correct. I did say out load \"what the hell is this shit\" they gave me scrambled eggs, after I repeated my order twice to the guy and he repeated it back to me. Then when the correct order came the girls at the registered pretty much just placed it on the counter like it was trash and it annoyed her to have to rebag the order. She gave attitude from the moment I complained about my order being wrong. \n\nI should have gone to IHOP like I had planned but since my back was hurting I didn't want to walk so far. Just got to make sure I remind myself the walk to IHOP will be worth it I have yet to have an issue with them but with La Bagel Delight there is always an issue.", "author": "Hilda C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-06-04", "description": "It always baffles me when a place doesn't treat every customer with friendliness, quick service and like they actually care about your business, because every single person that comes through those doors has the potential to be a lifelong and/or daily customer in NYC. I felt as if my business was unappreciated and as if the other customers, likely regulars, were much more important.\n\nEven after putting in my order and standing directly in front of the cash register, the lady ringing everyone up proceeds to ring up three people that came in after me. Just slightly annoying. After waiting about five minutes I *almost* walked out, but decided to wait it out. I was finally rung up ($6.30 for an everything bagel with Scallion cream cheese and a Sprite) and see what I thought was my bagel being brought out (looking burnt but I only got a quick glance). I get home to eat it and it's literally burnt. Besides it being burnt, it's quite possibly the worst looking everything bagel I've maybe ever seen. \n\nI'll leave it at that, but I'm definitely not ever coming back here. Plenty of other good bagel shops in the area (I'm thinking of you Court Street Bagels!) that actually care about my business and won't give me burnt bagels.", "author": "Kaley R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-12-26", "description": "I paid $9.99 plus tax for a lox spectacular and was given 3 short slices of lox. NOT WORTH THE MONEY! Either up the quantity on the lox or lower the price. \n\nThe turkey sandwich's are great. Not happy with the quantity of lox on the bagel. The quantity is usually good on the cold cut sandwich's. Why is it different on the lox spectacular???", "author": "Tamika S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-01-20", "description": "BEWARE:  VERY EXPENSIVE!  3 butter rolls cost $6.53  -  I suggest walking around the neighborhood, there's another bagel please.  Across the street is Paris Baguette Cafe and much cheaper.", "author": "Rickie V."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-03-29", "description": "The staff acts like they're doing you a favor waiting on you and have attitude galore. It would be nice if they carefully listened to what you want but as you talk they are immediately hitting the buttons on the register, as if they're in a race. But when THEY screw up YOUR order suffers. It's very aggravating to get back to work with something OTHER than what you wanted. The other place across the street (Paris something)  has better service, better bagels and cheaper prices. Guess where I go now.", "author": "Ed C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-15", "description": "Got a whole wheat everything with egg and cheese at 2pm. Bagel was very fresh. Cost less than $5. The dual counter situation is a little weird but not a huge deal. No seating here. Small standing area where you can eat.", "author": "Anup R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-12", "description": "Just ordered this for delivery from UberEATS. My crew and I were way too lazy after a night out to leave the apartment to grab food, so we figured this would be a convenient option. The navigation on the site was very confusing, but other than that no complaints for the ordering and delivery aspect of the meal. It was delivered very quickly. \n\nWe all got breakfast sandwiches: bacon egg and cheese, porkroll egg and cheese, \u0026 sausage egg and cheese.  Not the best breakfast sandwich I've ever had, but still good. I wish they toasted the bagels...next time I'll make sure I ask them to. The bread to egg ratio was overwhelming on the bread side. But other than that it the spot. \n\nWe will definitely be ordering from here again! \n\n***future tips: ask to toast the bagel and add more egg***", "author": "Stephanie L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-21", "description": "I've only ever ordered bagels here, specifically toasted and with cream cheese. And I've always been satisfied - they don't skimp on the smear!\nIt can get busy in the morning or during lunch hours but they service everyone pretty quickly. My go-to spot for bagels in Brooklyn Heights.", "author": "Teresa S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-07-28", "description": "fkn expensive for no reason. get the same BEC from the cart across the street for less.\n\n\noh.. also,\nWhats up with the attitude?", "author": "Yayaa L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-10-29", "description": "Be sure to double check your orders, for some reason they forget to toast bagels when you request it.... Plus do we really need a soundtrack of offensive uncensored lyrics playing while the customers (mostly families) wait for their orders on a Sunday morning? \n\nI'm not going back.", "author": "John C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-13", "description": "I think this place is really a hit or miss. I've had some great bagels here and decent breakfast sandwiches, but my most recent visit left me wanting a refund. Please check to see if the fruit in your flavored cream cheeses is going bad. It's a really unpleasant experience to get home with your to go order, then bite into a bagel and immediately know something has spoiled.", "author": "Raa C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-27", "description": "Their seasonal  cinnamon hazelnut coffee is worth dealing with the attitude. Bagels are made in house and are okay for New York Bagels  but I prefer their flavored coffees.", "author": "Kris P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-23", "description": "Great bagel, first half of my bagel/cream cheese sandwich was phenomenal, I was really looking forward to crushing the second half. Unfortunately soon after taking a bite I realized I was biting into a plastic glove that had been left in my sandwich. Really disappointing", "author": "Laura H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-11-22", "description": "Have been coming to this place for years. Sadly, the quality and service has taken a turn for the worse. Today, I ordered a bacon egg and cheese on an everything. I received the complete wrong order--something with egg whites on it, which is most definitely not what I ordered. I paid for the more expensive item, though. Further, the staff appeared indifferent and customers had to wait quite a while to be served. I work in the neighborhood, and will not be returning based on my recent experiences. It's a shame, because it used to be quite a reputable place.", "author": "Jimmy G."}], "servesCuisine": "Salad", "priceRange": "Under $10", "name": "La Bagel Delight at Court St", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "90 Court St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/0i_2GvpnFba68P0hnSgVvA/ls.jpg", "@type": "Restaurant", "telephone": "+17185220520"}