{"aggregateRating": {"reviewCount": 154, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-12-29", "description": "My favorite bagel in NYC. Which implicitly means the best bagel in the world, and that is a pretty high honor. \n\nI regularly pick up a Bacon \u0026 Egg \"everything\" bagel for breakfast from La Bagel, and occasionally a blueberry muffin if I'm feeling ravenous. Somehow everything that comes out of this shop just tastes fresh and crisp, never too dense (the mistake of so many other bakeries.)\n\nFor lunch, I often get the roast beef and salad on a crisp onion bagel. Did I mention their plain old coffee is good too? Everything that comes out of here is delicious.", "author": "Andrew M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-03-07", "description": "I was totally disappointed in this place, after reading all the positive reviews. My bagel had a weird moldy aftertaste, even though they were somewhat fresh from the oven. \n\nThat said, the bialys are fantastic, so it balances out.", "author": "Becky S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-16", "description": "This place made me realize how much I really love a good bagel and cream cheese.  I don't think I've had a good bagel in years, and I'm so happy La Bagel Delight ended that dry spell.  I can't pinpoint why it was so good, but it just was.  I just got a plain bagel and plain cream cheese, but it was perfect.  And the price was good too!", "author": "Jamie B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2006-12-23", "description": "La Bagel Delight,\n\nYou were my first authentic New York bagel (I'm sorry I didn't tell you before -- I just didn't know how to tell you!  I thought you'd think I was some silly, naive, little country girl and turn me away!)  \n\nI had butterflies in my stomach when I stepped into your store to meet you for the first time.  You made me blush with excitement and anticipation.  You made it so easy for me to fall in love and fall hard -- so warm \u0026 inviting on the inside.  I never knew it could be like this. Each chewy bite of you bought me closer to ecstasy.  How could anyone refuse you?  \n\nYou were so different from the others; Both Noah \u0026 Lee could not stand to compare.  Not now.  Not ever again.  I can't go back.  You've changed me and my outlook on life.  Why didn't you come into my life earlier?  Why didn't I meet you before?\n\nI know I just left you, but my stomach aches for you already.  I miss you.  Your smell, the texture of your skin, your creamy goodness.  Thank you so much for showing me the true meaning of love.  I will never forget you.\n\nxoxo,\nMelissa", "author": "Melissa S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-31", "description": "Ordered a roast beef sandwich here and it was ENORMOUS. All fresh ingredients as well. Haven't tried the bagels yet but everyone seems to enjoy them. A little pricey over but well worth it.", "author": "Mike B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-01-08", "description": "Oh god, don't you love those local delicious bagel spots?  La Bagel on Court St. is completely wonderful.  Not only are the bagels warm, fluffy, and delicious, but the other options - the sandwiches, pastries, cold cuts, spreads - are all great.  \n\nMy particular favorite?  The tofu veggie cream cheese.  I swear by this stuff.  Not only is it healthier, but it tastes better than regular cream cheese.  I've brought this to bagel breakfasts and taken the label off and it is always the first to go.  Also, my vegan brother has said, \"Thank you for the cream cheese; it is the best thing that has happened to me all year.\"\n\nThe staff is efficient, no-nonsense, but very friendly.   Once, I realized I didn't have any cash on me.  I owed them $1.50, and so I sheepishly handed over a credit card.  The boss-guy recognized me, waved me off and said, \"Don't worry about it.  Get us next time.\"   It was astounding.  ;)\n\nEdit:  They're open later on weekdays now!  I think... 9 or 10 pm (used to be 6).", "author": "Kyu K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-15", "description": "never been here but had the hamburger lunch special while in court one day. it was so good after being couped up in the building all day long to enjoy some freshly  made food. the serving is large enough to split into a meal and a half. i'd def come back here for fresh cuts or burgers if i'm in the area", "author": "Sasha C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2007-05-17", "description": "Famous first lines...\n\n\"I say, I say, I say ... hello super yummy double egg and bacon on poppy seed bagel!\"\n\n\"It was like making love to a bagel.\"\n\n\"I left my heart in La Bagel Delight.\"\n\n\"You had me at $2.95.\"\n\nI heart La Bagel Delight. Thanks Albie for introducing me to the world of bageliciousness.", "author": "Annie T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-02", "description": "I am a Long Island native, and so I have very heightened bagel standards. If you are from Long Island or have had bagels there, you know what I mean. (Holler if you love Bagel Boss! Wut up!!) My idea of a good bagel is a bagel that is dense and compact, rather than fluffy. Maybe that's just me. \n\nAnyway, the bagels from LBD are delightfully tasty.  have one criticism, however, and that is that I wish they put just a *little* more salt on their everything bagels. Regardless, this is the closest thing I have had to a great hometown bagel.", "author": "Marianne S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-05-16", "description": "Ordered a bacon, egg and cheese on a plain bagel as well as a sesame bagel.\n\nEven after repeating the order 3 times, they got it wrong.  The bacon egg and cheese tasted like it was heated up in the microwave.  The guy was handling the money and bagels without changing his gloves.  Bagels themselves were ok, but I prefer the place on montague.", "author": "Michael L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-01-30", "description": "Great bagels. One of the best pumpernickel bagels I've ever had. \n\nScene of one of my last meat meals (September of 2006). Had the delicious Mr. Bagel (grilled bagel w/ ham, bacon, eggs, cheese). The best breakfast sandwich I've ever had.", "author": "Todd S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-04-12", "description": "Good bagel a little heavy on the cream cheese", "author": "Joe C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-08-20", "description": "My first time here since my business is 5 minutes away figured the place would be great because every time I pass by its always crowded.  I ordered Tuna salad on plain bagel with lettuce and tomato.  The worst I ever had!  Bagel was so stale and old and tuna fish looked weird.  It was disgusting and after the first 2 bites I had a stomach ache and went to the bathroom.  I was so angry to give them a call to complain and the girl that served me picked up the phone and when I told her the bagels were disgustingly stale she sounded happy to say to me \"no, they are fresh, ok goodbye\" like she was laughing.  I will never eat here again.  Food is dirty!", "author": "Spud K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-10-09", "description": "Such a solid deli.  I came here for elevensies the other week and ordered a spinach, egg white, feta scramble on a whole wheat wrap.  It was amazing.  I'm not really one for breakfast wraps since I find eggs in tortillas generally tastes pretty bad, but I took a chance on this one and was rewarded with a fluffy, gooey and not-soggy snack.  I can't wait to go back and try their sandwiches/bagels.", "author": "Maeve C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-05-23", "description": "I love la bagel.  \n\nI have found no substitute for fresh, warm everything bagels from La Bagel on cold winter mornings.  During a huge blizzard a couple of years ago, I walked to La Bagel in knee deep snow early in the morning, and even though the cabs weren't driving, the guys at La Bagel were there with hot fresh bagels and a freshly shoveled sidewalk.  That's dedication! \n\nWhenever I go home to California, I bring a whole carry-on bag full of a La Bagel assortment of bagels for my family.  I can't come home without them now without getting an earful.  \n\nIf you're at all health-conscious, ask them to go easy on the cream cheese!", "author": "Allison S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2006-10-09", "description": "I get a sausage and egg on a bagel here every blessed day. They put two eggs on it and it's only $2.95. They have the best bagels I've tried. But I'm sure there are others out there as I've only been to a dozen or so bagel joints in the city and there must be trillions of them in this city. \n\nOh, and their cold sandwiches are huge and some of the best in the city.\n\naddendum: their prices are up - new cash register guy charges 3.50 for my beloved bagel sandwich. i'm taking off a star and going to bagel world more.", "author": "Albie L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-03-24", "description": "I am a non-religious JEW and I have had many, many, bagels in my life.  I really care about a good bagel, and this is the BEST, most consistently AWESOME, bagel shop that I have ever been too.   \n\nWhy are the bagels so good???    \n\n1)  They make the bagels the right way.... boiling the bread first and then baking them\n\n2)  They make them big and fresh.... all the time\n\n3)  Yes, their spreads and fixings are good... but really... it's the bagel that is the bomb\n\n4) Moving from Park Slope, Brooklyn, to Los Angeles has been a nightmare because I can't find a good bagel anymore.   I could cry and might have to move home.  \n\n5)  If you read this.... please eat one for me.\n\nThanks,\nDave", "author": "Dave D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-13", "description": "The bagels are soft and tasty, and there are enough to choose from. I'm partial to the whole wheat everything. The cream cheese leaves something to be desired, but I've had two sandwiches there: lox with cream cheese and chicken salad. The lox was fair and relatively fresh tasting. The chicken salad was subtle yet satisfying. The sandwiches at most are $6.50, and the bagels $2-4. It's a good breakfast and lunch option for Dumbo.", "author": "Ian M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2007-12-06", "description": "Even if the bagels here aren't fantastic, they are fresh and yummy! \n\nThe real clincher is the service. These guys are amazing! They know us on sight, and treat everyone great.\n\nIs this an authentic NY bagel? I'm not sure...I really like a denser, chewier, less cake like bagel with a bit of sweetness. Think Montreal.", "author": "Eric J. R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-10-23", "description": "These guys are great! Super friendly, and the bagels are wonderful and fresh. I was there the other morning, and some grumpy woman who hadn't had her morning coffee yet was making a fuss when they ran out of soy milk- but the friendly guys who work there somehow managed to put a smile on even her face! They also gave me a free refill of my iced coffee while I was waiting for my order. Very nice. \n\nThe prices are a little high, but pretty comparable for the area. I don't mind paying a little extra if the service is so good and the money goes to good people.", "author": "Jazmyne C."}], "servesCuisine": "Salad", "priceRange": "Under $10", "name": "La Bagel Delight at Court St", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "90 Court St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/0i_2GvpnFba68P0hnSgVvA/ls.jpg", "@type": "Restaurant", "telephone": "+17185220520"}