{"aggregateRating": {"reviewCount": 154, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-02-11", "description": "For those of us who are up at six in the morning in this area, there are scant options for breakfast besides the McDonald's on the next block. If you respect your body too much to feed it a Mc-something, La Bagel Delight is a ready option. They open promptly at six and open pretty late into the night for a place that names itself after a breakfast item. Even at the start of the day, there are always a few other people waiting, so clearly this place is popular. The folks behind the counter may not necessarily be the friendliest in the world, but they are efficient. \n\nThey have all of the common varieties of bagels and cream cheese, including tofu (both plain and veggie) for the lactose-intolerant or vegans/vegetarians. I usually get mine with cream cheese, but you can order them as a sandwich. Some brave soul in front of me one morning ordered one with sausage, egg, cheese, AND cream cheese, so apparently that's an option too, though I wonder about the taste. My own order of a bagel with plain tofu cream cheese runs me a fair $2.45. \n\nI love this place for being open so early in the morning and for the speed with which they prepare my order. I even love them for the amount of cream cheese they use, which is a nice medium between a \"schmear\" and the gobs of spread I might get elsewhere. What I don't always enjoy is the inconsistency. I work three minutes away from here, and sometimes, my freshly toasted bagel is already soft and mushy by the time I sit down to eat at my desk. Worse yet, the taste is sometimes off - some of my bagels will have a strange, metallic aftertaste. Other times, the tofu cream cheese tastes a little plasticky (think prepared Tofutti cream cheese, if you've ever had that). \n\nIt's not so egregiously off-putting that I'd make wild vows about never returning (in fact, I'm here a few times a week). The texture of these bagels is actually quite right - dense, chewy, and toothsome. However, I personally contend with those who claim that these are the 'best bagels ever'. Better can be had elsewhere.", "author": "Jane I."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-17", "description": "I live across the street from this bagel place and I go all the time to pick up breakfast. Today I went in, in a rush on the way to work, ordered my food. Waited. And then was told that there was a new $5 minimum credit card requirement. My food was $4.50. I said \"I'm sorry. I come in all the time and no one has ever told me that. I always pay by card and I don't have any cash on me.\" And they responded by saying \"well I don't know what you want me to do about that.\"  And stared at me rolling their eyes. They refused to sell me my food. Despite only being $.50 short of the minimum. I ran out of time to go someplace else to get breakfast. Very very rude. I won't be back.", "author": "Merry C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-09-28", "description": "The bagels are good.  Priced fair at $1.  My only issue is what I was charged to have peanut butter added, which was an extra $1.99.   That's a lot just for a slab of Skippy.  Their price list does not show a bagel with peanut butter for $2.99.  It's listed for less than $2.  \n\nMake sure you ask for the actual price of what you want before ordering.", "author": "Daryl H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-01", "description": "This lovely joint was near where we stayed in Brooklyn. Great place to get a real taste of a New York bagel. We ordered egg special on everything bagel. There is not really places to sit so we posted up by the window  and enjoyed the people watching. Lots of interesting locals! I really enjoyed people ordering bagels with a \"schmeer\" of cream cheese. Being from Kentucky we don't hear that often. We came back again over the weekend for a pastry. Awesome !", "author": "Becca R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-25", "description": "If you're in New York, you have to have bagels.  About one of the few local things that are left in the town...  Knishes are nowhere to be found and most younger New Yorkers don't even know what an eggcream is anymore...\n\nLa Bagel is a great place, cheap, good, hearty and fast.  If you're not from New York, you have to be forewarned.  If you ask for a bagel and cream cheese, expect the equivalent of an entire container of Philadelphia Cream Cheese.  I had the lox, which was genuinely New York and it reminded me of my childhood.  Yummy place.  Period...", "author": "Louis B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-03-17", "description": "My biggest complaint is the price. This place has to one of the most expensive places on Court Street. It seems that on certain items the prices fluctuate. You'll pay 6 dollars for a bacon egg and cheese, you'll pay almost 5 dollars for a 2 liter soda. One day I'm paying 2 dollars for a 1 liter soda next it's 3 dollars. The food is good but not worth the prices and as a mom and pop shop they try to get the most money out of you. It's sad that we're business neighbors to them and we get no discounts. That's the last time I buy from there basically I got a bacon egg and cheese and a 2 liter for 11 dollars.", "author": "Justin J."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-08-30", "description": "So not here for them this morning... I always order a tuna on toasted wheat bread with lettuce, tomato, and avocado and it comes up to $12-and some cents. I always thought that was a lot for a sandwich and today i know why.... Tuna about $6 bucks plus tax.. Tomato $1 plus tax.. Lettuce $1 plus tax and avocado $2 plus tax...  So u charge me for each item and add tax each time.. AND THEN.... They didnt even toast my wheat bread... And the avocado was two thin thin slices and had black spots on it...  If ur gonna charge so much at least make my food right.... Nope never again", "author": "Sapphire B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-08-19", "description": "Ducked in from the torrential downpour last weekend. Paid around $5 for a bagel with lox spread on it....blah! There was hardly any salmon or salmon taste to it. Worse, I think my bagel was dipped in plastic. Really bad. Rock hard exterior, stale interior, whatever. Rude service, and pretty slow considering I was the only one in there. \n\nNo AC inside, or at least wasn't working.", "author": "Julia F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-06", "description": "After consuming about 2 bagels per week for the past who knows how many years (5?...ok 7....), I can safely call myself a bagel connoisseur. \n\nThe bagels at La Bagel Delight are some of the best in the area, and I'm not just saying that because it's the closest bagel shop to my apartment. I have walked up and down Smith and Court many a times in search of the best bagel experience (which takes into account the ordering process and wait in line) and La Bagel Delight is definitely up there.\n\nHere's how I would rank the bagel spots in the hood:\n\n1. La Bagel Delight - consistently good bagels and spreads and good fast moving lines (newbies often don't realize there are two lines)\n2. Mocha Bagels - a close second to La Bagel Delight but loses points for constantly being over crowded and having slow moving lines\n3. Court Street Bagels - Over rated, bagels aren't the best, ridiculous lines, and cash only\n4. Bagels by the Park - this Smith and President street bagel shop is by far the worst of the bunch. It's slow, the bagels aren't great, the service is eh and I believe they've been shut down by the health department for some violations (they're over a train station so I'd imagine they can't help but have a rat problem)\n\nTherefore, stick to La Bagel Delight if you want a decent bagel. Unless you want the most amazing bagel ever, then you should go to the Park Slope location.  Those bagels are pure delicious fluff.", "author": "Lana V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-15", "description": "One of the best bagels I've ever had (and I've had thousands). Everything Bagel with cream cheese and lox. The lox was uncommonly fresh and not the least bit gristly; it was like good sashimi. The bagel was big and had a great crust. No seats or stools here, and just a little counter space for standing, so plan on takeout.", "author": "Ranjit D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-17", "description": "I really liked the everything bagel. Unlike any store bought bagel I've had, there was a little bit of salt on the outside of the bagel, which really gave the bagel itself more flavor. The cream cheese was average, but certainly not bad. Prices were really good as well.", "author": "Nathan K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-02-21", "description": "I was riiiiiiiiiight about to start a low carb diet.  No, seriously, I was.  Then I made the mistake of running a lunchtime errand and walking past La Bagel Delight.  In the interest of full disclosure I should state that I love sandwiches.  Few things bring me more joy than identifying a neighborhood's best sandwich shop.  As a result, I was disappointed that I had been working at MetroTech for almost a year and had yet to find a dependable sandwich spot.  In comes La Bagel Delight.\n\nThe first thing that caught my attention, and brought me into the shop, was the sheer variety of sandwiches at LBD.  Not only were there were a variety of sandwiches, but extremely important for me, a number of those sandwich options came with bacon.  I decided then and there that I would put my diet on hold for a bit to try one sandwich per day for about a week.  3 sandwiches later (Chicken Fantastic, The Texas Melt, Turkey Melt) I have a couple general observations. \n\nFirst, the sandwiches are enormous.  Most of the sandwiches run around $9-10 and you will get more than enough food.  Realistically, each sandwich is big enough for 2 meals.  Don't try asking for half a sandwich either because you will get half the sandwich, but only about $1 off of the final price.  Second, while filled to the brim, the sandwiches aren't particularly flavorful.  I would go so far as to say the sandwiches can be dry and a chore to eat.  If you're asked if you would like mayo or any sort of condiment, I would suggest you say yes.  So, if you are in Downtown Brooklyn at lunch time, starving, and on a budget, La Bagel Delight is worth a try.  If budget and extreme hunger are not concerns, LBD might not be as compelling an option.", "author": "Fabian M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-19", "description": "Great bagels, good prices, very quick service. \n\nTry the Cinnamon Raisin bagel with Walnut Raisin cream cheese and jelly! OMG\n\nNo seats though.", "author": "Nicole G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-28", "description": "These are good bagels. \n\nIf you've ever been to any of the other locations of LBD*, you're getting the same thing here: quality bagels, quality cream cheese, and it's also a full-service deli counter, with Boar's Head sandwiches and cold cuts available by the pound. It's actually one of the better spots in the immediate area to get a sandwich.\n\nAs an added bonus, they are running a special right now; if you buy $10 of cold cuts, you get a dozen bagels, free. You can't beat that with...whatever it is you beat your children with. And if you don't beat your children, you probably should.** \n\nDamn brats. \n__________\n\n*I refuse to spell the name out. Once again, why is the \"La\" there? It is completely awkward to say, and it's absolutely unnecessary. Wouldn't \"Bagel Delight\" be perfectly acceptable? Are these French bagels? No, those are called \"croissants.\"\n**I don't really mean that. Unless, of course, if they are the little bastards who are always running all over my lawn, ruining my grass. :: shakes veiny, liver-spotted fist ::", "author": "Peter D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-01", "description": "I usually stop here when I am craving a fresh bagel. It gets really packed in the mornings so be prepared to wait. The employees are nice and try to attend to everyone. I love the fresh spreads. I go for my usual everything  bagel with strawberry cream cheese and iced coffee. Their wraps are not bad either. Good portions and very filling.", "author": "Ivette G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-30", "description": "Amazing bagel stuffed with about a  pound of lox\n\nGreg's veggie cream cheese has huge chunks of veggies in the cream cheese.\n\nNo seating or atmosphere whatsoever", "author": "Chris C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-28", "description": "Not sure why this place has so many mediocre reviews. The bagels are fresh and tasty, their sandwiches are huge, prices are fair. My office often orders bagels from here, and they are always good.", "author": "Nancy A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-08-16", "description": "It was a really gross bagel. I could not finish it, even after paying 10$ for an onion bagel with lox cream cheeses and onions. \n\nThe bagel was STALE and unpleasantly hard, there was WAY to much cream cheese like 1.5 inches worth. Lox was ok. It wasn't mediocre it was plain bad. \n\nNo surprise why I was the only person there.", "author": "Sparkle B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-03-17", "description": "Great bagels and sandwiches....aside from that, good luck.\nI literally order from here every week, and order the SAME thing. Every single time the price is different. A Turkey Egg-whtie and Cheese and an Iced Coffee. And almost EVERY single time the order is wrong. No cheese, no egg whites, wrong bagel. For the price and them getting it wrong EVERY time, even after telling the girl on the phone, its not worth it anymore.", "author": "Bob S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-08-08", "description": "Ordered a bacon, egg and cheese on a wrap with a tropicana oj. The total was 9.50!!! Customers beware the food is way too expensive in this place. Funny thing was, there is a special posted with more items for 6.50. When i asked why it was so much, I was told \"that's our prices\"!?. This was your last shot as I have visited many times and the quality in this place is like a roller coaster.", "author": "Brian B."}], "servesCuisine": "Salad", "priceRange": "Under $10", "name": "La Bagel Delight at Court St", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "90 Court St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/0i_2GvpnFba68P0hnSgVvA/ls.jpg", "@type": "Restaurant", "telephone": "+17185220520"}