{"aggregateRating": {"reviewCount": 154, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-02", "description": "Pricey, but good bagels.\n\nhad lox with scallion on everything- very good\n\nhad la bagel on everything, also very good", "author": "Paul W."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-11-17", "description": "I like this place because of it's convenient location and the bagels are good, but they always mess up my order.  It could be solved by simply having a ticketing system but instead the cashiers scream out the order, a runner tells the cook, etc... what a game of telephone.  I always have to repeat my order twice and even when I do they still get it wrong... I don't understand.  And it seems like I'm not the only person who's had this issue here.  The place wasn't even busy.  Apparently toasted means cold and over easy means scrambled:  and bacon means no bacon.  Please just write down my order in shorthand like every other restaurant.  They don't offer a receipt probably because they know the order is wrong.  This place needs be whipped into shape, it's totally chaotic. Will be going elsewhere from now on.", "author": "Matt G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-21", "description": "I am D O N E with this place and the rude manager Melissa. She/ He has been rude to my colleagues and I one too many times. Tio Pio will be seeing us every day now!", "author": "Lola C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-21", "description": "Large selection of bagels and cream cheeses. Awesome environment with music and free wifi.\n\nFriendly environment and staff greeted us with a smile even on morning rush.", "author": "Fernando R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-04-10", "description": "After waiting on line for more than 10 minutes trying to order, the register girl decides she's closing her register and tells me to go to the other register which had 10 people on it. When I explained to her how long i waited and that the other line was packed, she just refused to take my order. Nice going :)", "author": "Jonathan M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-20", "description": "These cats know what they're doing, and do it well. \n\nI tend to get my bagels from here before a big race, and even occasionally get one with an egg or veggie cream cheese or something. They are always so good. What makes the bagels on point, of course, is the freshness.  The affordable price makes a difference too, but they can be pricy when you're ordering it with a topping.\n\nWhile the Ft. Greene location may have more selections of other foods, no one beats Court St's bagels. Must be something about being the flagship (well, I consider it the flagship) location. I like the staff too...from the guy with the thin mustache who usually takes my order, to the hard working cashier woman who juggles so much in a short amount of time. \n\nI am in awe of how they run things here.  It's quite fantastic.", "author": "Curtis J."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-09-03", "description": "Bagels anyone? I am a huge bagel person, I can eat one at anytime of the day. On average I would say I eat about 5 per week. (Everything bagels are my personal favorite, moving right along...back to the review)\n\nWith that being said, I would say I have pretty good judgment on whether a bagel is good or crappy. La Bagel Delight has good quality bagels, they are warm, fresh and made in abundance. The store is relatively small, but they manage to have two sides filled with bagels with a decent array of choices. They have soup (Chicken Noodle and Beef Barley, both pretty good, too)\n\nNow, I guess it is time for me to be the cynical reviewer and state the negatives of this place. As previously stated, I'm a huge bagel person and have been to many bagel places typically the front counter person is very personable and friendly, but not here. They are not rude, but they surely are not the friendliest either. I guess it depends on the day and who is at the front counter. \n\nMore importantly, as to my issues with them, they are over priced. In my opinion, $1.80 for a bagel with butter is excessive, especially when I can pay .50 or .30 cents less in Midtown Manhattan. Secondly, along with bagels I usually get their cold cuts along with bagels... they seem to charge a different amount each time I am there.\n\nTwo weeks ago, I went there twice, the first time they charged me $2.90 for a quarter pound of Swiss cheese, two days later they charged me $2.65. Today I was charged $3.50, but when I get back to my job I notice the label says $2.50 so I was overcharged a buck! On another occasion, the employee told me he couldn't read the scale properly and it would be $9.00, I told him that's obviously wrong and he just told me that's what the meter said. \n\nC'mon La Bagel Delight, get the pricing right!", "author": "Jason R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-17", "description": "La Bagel Delight\nNY Brooklyn Heights\n11am Bagelsunday 17th May 2015\nFour Stars\n\n\nThe owner was spectacularly nice and made sure we were taken of. I got a toasted everything bagel with bacon, egg, and cheese. The bagel was big and pretty tasty. The everything seasoning was worse and didn't have salt in the mix. The bacon was crispy. The eggs were fresh. The cheese was melted and oozy everywhere.", "author": "Leonard L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-01", "description": "Great bagel spot - but they NEED gluten free bagels!! They would fit in perfectly in Brooklyn and definitely get much more business if they had gluten free options (bread and bagels). They don't even need to make the bagels, they could buy Udi's bagels or bread and make sandwiches with them. Give gluten free options!!!", "author": "Maddie G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-11-25", "description": "The bagels here are fresh, pretty tasty, and affordable- a good spot for a quick, cheap lunch or breakfast. The cream cheese spreads are average- not poor but also nothing to rave about. The service is hit-or-miss. You'll be served up some of that fresh, impatient NYC sass. It's not malicious, but it's also not hospitable for an out-of-stater or first-time visitor, and you'll feel more like a rushed sale and less like a valued customer.", "author": "George S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-14", "description": "This place is ridiculously expensive six dollars for an egg sandwich with cheese and was just all right nothing spectacular if you want to get overcharged go there. Will never go there again.", "author": "George K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-02", "description": "I stopped by this bagel shop early one morning after observing a steady flow of people to this place. \nI ordered a toasted everything bagel with cream cheese after a long wait in line. The wait for it to be prepared was pretty long as well. But I can definitely say the wait was well worth it. The bagel was was the best part soft on the inside and toasty on the outside. However, the amount of cream cheese that they put on my bagel could have generously filled about 3-4 more bagels! I had to scrape of some of the cream cheese off because for one it was so thick it felt as if I was eating a double decker sandwich. \nThe service is slow but worth it. I would definitely return.", "author": "Celeste B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-08-16", "description": "Delicious sandwiches. Only problem is the price and service. They've always been overpriced but what I really can't stand is when I call to place an order in the morning. This happened to me a few times and is why I'm writing this review. You call, they answer and they put you on hold and LEAVE you on hold for more than 5 minutes. After 5 minutes I hang up and call back, sometimes they answer and sometimes the phone just gives the busy signal. Very frustrating. Don't care how their sandwiches taste, their customer service is horrific", "author": "Anthony L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-17", "description": "I'm working in the area, so I came here because it was in quick walking distance. I got egg and cheese on a toasted egg bagel. The egg bagel is delicious.... super soft and fresh and very tasty. I wish I didn't get the egg and cheese on it because they actually take away from the taste of the bagel. \n\nI got the sandwich, a small coffee, and an orange juice for $8.88. I don't know if that's common pricing for the area, but do with that what you will. \n\nThey accept credit card which pleasantly surprised me, because most delis don't, and there is no minimum. \n\nGet here early, because there was a line even at 6am. \n\nThey also make lunch sandwiches, which I haven't tried yet. \n\nThe only complaint I have is that their website says they open at 5:30, but they don't open until 6am, so I was waiting outside for 30 min.", "author": "Ashleigh L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-08-27", "description": "Not sure what the hype on the other reviews was all about. I ordered an egg and cheese on an everything bagel toasted with a little bit of ketchup. That breakfast sandwich plus a small Tropicana orange juice came to a total of $7.13. My sandwich tasted salty and had lots of ketchup on it. Also they over toasted the bagel. In addition, this is in the downtown Brooklyn area so the parking really sucks. All in all its not some place I would go out of my way for.", "author": "Hanane D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-11-15", "description": "I won't trash the bagels, they're good. But this is New York right? Good bagels are essentially a dime a dozen. Here however, you will fork over many dimes several times over as they make sure to charge you extra for every tomato or slice of lettuce you ask for. And god help you if you ask for anything that could be construed as a special order: you know like Swiss cheese instead of American; or maybe you want your eggs scrambled soft or just want egg whites. Anything you order that doesn't match the cookie cutter items in their minds will go in one ear and rapidly out the other. \nOverpriced. Orders are a crapshoot. Any questions?", "author": "vladimir r."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-07-20", "description": "Just another bagel shop. \n\nYou hand them money, and they hand you a bagel. End of transaction.", "author": "Emily M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-09", "description": "Good bagels, lox and creamcheese\nSmall counter to eat at so be prepared to take it to go.", "author": "Larry R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-06", "description": "Great for catering!! Ordered sandwiches and wraps with an array of salads. Everyone went for seconds it was so good. Also, a very helpful staff made the ordering easy.", "author": "Mary T."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-02-06", "description": "I visited La Bagel Delight twice and ordered a simple sausage, egg, and cheese both times. I waited about half an hour before I decided to ask about my order only because I wanted to give them the benefit of the doubt; maybe they were backed up on orders. It turns out they forgot my order. I was a bit upset that the whole time I was standing there the cashier didn't ask to see what I was waiting on or check up on my order to see if it was being made. The second time I went, I placed my order and again I had to wait nearly 45 mins before I got my order. The cashier paid no mind to me, no smile, no hello, just gave me a sort of annoyed look. When other customers who seemed to be regulars came in, they were greeted with smiles and all got their orders before me (six or seven other customers came in after me). I encourage management to re-train their staff and improve customer service. I don't think I will be returning here again.", "author": "Matthew H."}], "servesCuisine": "Salad", "priceRange": "Under $10", "name": "La Bagel Delight at Court St", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "90 Court St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/0i_2GvpnFba68P0hnSgVvA/ls.jpg", "@type": "Restaurant", "telephone": "+17185220520"}