{"aggregateRating": {"reviewCount": 154, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-07-15", "description": "Scott! (posted on the 15th)\nYou are not crazy!!!  My wife and I  bought a dozen bagels this past Friday, under the allure of a \"buy $10 worth of Boarshead and get a dozen bagels free!\"\nWe were like, Awesome! What a deal!\n.... until we actually tasted few of these funky bagels...\nThe flavor is so strange and unsettling - we were't able to put our finger on it right away. But we feel like it might be connected to the water they boiled them in?? They have a strong metallic/mildew flavor. Really. Really off-putting. You take a bite, and your body is like, \" I am NOT suppose to be eating this.\" \nWhat I once thought was a GREAT deal to get rid of afternoon bagels - I now see as completely dishonest. There is something seriously wrong with these bagels. They should have thrown them out - not tricked us into buying meat in order to pawn these  mildew flavored bagels off on us.", "author": "Ryan J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-20", "description": "Small bagel chains seem to be branching out more and more. No problem with that if they can keep a consistently good product. Not sure what the \"La\" is for in the not-completely-translated namesake but  who cares? This is one good bagel.\n\nThis location out of 5 is not that far from most of the courthouses in downtown Brooklyn if you are up for a little bit of a walk. The tiny place was bustling with activity with two separate lines forming at opposite ends of each other. I went for an everything bagel with cheddar \u0026 jalapeno cream cheese. The bagel was fresh, warm, and soft but could have used a bit more toppings. They really plopped on the cream cheese and it was pretty tasty despite being a bit overwhelming. They had a large variety of cream cheeses like all good bagel places should have. All in all, it made for a very decent bagel. They have other hot foods and sandwiches here but they are a bit sparse with the seating I noticed. Not sure if they had a bathroom. I've been to the one not too far away on Lafayette in Fort Greene and that seemed to offer more frills, if I'm not mistaken.\n\nThis place is worth the trip if you are in the area and are looking for your standard NYC bagel without too many complaints. What would NYC be without any complainers? I guess we would only have acceptable and barely passable bagels. Not here though.", "author": "Evan M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-08", "description": "Many later visits have confirmed my original review.\n\nProtip: Ask for what's warm.  The difference between a bagel 2 hours out of the oven and one 20 minutes out of the even is totally remarkable at this place.  Neither bagel is Ess-A-Bagel, but the former is much less worth eating than the latter.", "author": "Raffi M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-10", "description": "I may lose my NY cred for this if I have any left, but Bagel Delight has some of thebest bagels in the city, 2nd only to Essa IMHO. \n\nThe bagels have the perfect blend of chewiness and mass, and the everything bagel is like a party in my mouth and then some. The veggie cream cheese is delicious, and the staff is very efficient and friendly. I'm never left standing around scratching myself waiting for my order. \n\nThe coffee is mediocre and inconsistent, which makes the store lose a star. \n\nAll in all great though.", "author": "Jamie M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-05-19", "description": "What is it with brooklyn restaurants recently and the horrible service? Ever hear of the customer (especially returning customer) is always right??I've been going to this place since moving here a year ago and no complaints, bagels have always been decent, prices are average. I occasionally swing by for a sandwich on days where I am working from home. Ordered a standard turkey + cheese wrap and went to pay for that + drink + chips. Order came out to almost $20! I told them, there must be something wrong no way is this $20. The airhead working the register looked at the guy who made my wrap like I was speaking some foreign language. He proceeds to print out the receipt and i notice 4 items on the bill. I tell him i just got the 3 (wrap, drink, chips)..He asks me if i got turkey with cheese, i say yes. Finally figures out that he put some other shmucks turkey + cheese sandwich and my wrap in the same bag. Wouldnt have been a problem if they didnt give me an attitude and act like I screwed up. Asked for a receipt and suddenly their machine doesnt work and they cant provide me one. \n\nSorry la bagel, our relationship is done. Ill go to one of a million other places that has the same food without the lousy attitude.", "author": "Greg L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-20", "description": "I've been here about a dozen times while visiting my sister in law in the city and they never fail. This is my go to place for cheap, delicious morning eats. \n\nI'm a lox snob so I hesitated to try it here, but I'm glad that I did. It had a great smokey, meaty flavor. Try it with scallion or plain spread on a toasted onion bagel. So good!\n\nThe lox spread is also top notch - big pieces of lox and not goopy or made from old scraps. \n\nThe bagels are also very good, maybe not the best I've had in my life, but they still hit all of the high points for good bagels: flavorful and chewy with a good crunch when you bite through.", "author": "Andrew G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-08-14", "description": "I ordered a lox special and my friend got an everything bagel. We went to go eat them and both were too salty to eat. I got a refund and a plain bagel so I appreciated the sincerity of their service.", "author": "Teddy R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-09-12", "description": "Might be some of the worst bagels I got in Brooklyn. Just hard and doesn't taste good. Thankfully there are other bagel shops close by that have better bagels and are cheaper.", "author": "Allen A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-12", "description": "This place was fun. Bagels, bagels everywhere, It was lined up to the door but it moved fast. You have to be ready to yell your order out (no problem) . Lots of choice and the bagels were pretty good (I had a sesame bagel with butter), as was the coffee. There is nothing spectacular about this place but they do simple stuff well, which seems increasingly hard for some businesses these days. Friendly staff to which is nice, especially in a chaotic environment like this shop.", "author": "Lauren H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-10-01", "description": "Wow. What a bad experience. The bagel was not toasted as I had asked and the jalapeño cream cheese left a lot to be desired. Avoid at all costs unless you're desperate for any form of sustenance.", "author": "Kantha K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-10-08", "description": "Always fresh.\nAmazing options, a huge assortment of cream cheeses and specialty ingredients for sandwiches.\nService is great, one of the guys is a little hard to understand but it makes the experience that much more ridiculous.\nEvery time I'm in Brooklyn this is a must stop for breakfast.\nI love a lot of cream cheese on my bagels, if you don't, make sure and tell them.  They load it up.\n\nTheir vegetable cream cheese is awesome.\nTry getting a runny egg on your breakfast sandwich, its unreal.", "author": "Alex L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-01-29", "description": "Slow and lacking service, assumed I would carry a large bottle of water in my hand, watery, too-sweet coffee, over-toasted bagel that took 10minutes to make. I'm not sure of the quality of the bagels BC mine was so toasted, but it seems like this business is not up to par with other bagel shops in brooklyn.", "author": "Sandra W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-14", "description": "I love the lox spread. And the bagels are fantastic and fresh. The service is always speedy as well.\n\nI noticed that they have a great deal for buying bagels and gets Boarshead as a bonus, I have not tried this offer as I do not live in the area and only come when I'm at school.", "author": "Diana K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-12", "description": "Ah. This place is super busy during lunch time but its def worth the wait. \n\nA coworker recommended this place due to a sandwich called the godfather.  The godfather had ham, Genoa salami, pepperoni, provolone, lettuce, tomato, roasted pepper, oil and vinegar. I didn't enjoy the sandwich as much as I thought I would, but gave la bagel a second shot.\n\nThe second time around I went and got a turkey melt. It was delicious! It had turkey, bacon, melt cheddar cheese with Russian dressing on a hero. I shared my hero with my friend and it was def good enough for two people. Highly recommend this place for those who work in the downtown brooklyn area!", "author": "Amanda L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-26", "description": "Here are the two things I liked about this place:\n\n1. I was standing in one of the two lines when the second line disappeared so I hesitantly came up to the guy at the counter and asked him the difference between the two lines.  His reply was, \"Ours is faster.\" Touche.\n\n2. Bacon, chive and seasonings cream cheese.\n\nNeed I say more?", "author": "Anna K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-01", "description": "Remember that thing you learned about real estate? Yeah, the folks who established this LBD* have that figured that out in spades because this place is making a killing -- it's the only bagel store near the burgeoning DoBro neighborhood (containing the Brooklyner, Avalon and a ton of new condos). It's not \"close\" but it's the closest.\n\nThe bagels are good, and yes I found it impossible to walk back the 8-10 minutes to the apartment without eating one on my way. Fresh bagels are like crack in that way.\n\nThat said, if you've been to one LBD, this one won't surprise you -- it's consistently good with solid cream cheese choices (including a plethora of little smiley faces on each of the cream cheese tags) as well as a full-service sandwich line. They'll even cook you eggs, sausage, bacon, etc. to put on your bagel in the morning.\n\nIt's packed in the morning due to its' proximity to the courthouse, but they move through the line pretty quickly.\n\n* - I'm with peter d. on the whole naming thing -- why do we need the La there? It's extraneous talking.", "author": "Danny P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-02-16", "description": "Place is solid. I was in the neighborhood and needed lunch so I just stumbled in here.  My bagel egg \u0026 cheese was about $3.50ish and was pretty tasty.\n\nNo seats but there is a small counter to stand at.", "author": "Leslie B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-06-14", "description": "I was so excited to have a decent bagel somewhere near my place of work. I listened to you Yelp and somehow I was let down...\n\nWent with two egg whites and turkey on an onion bagel. The whole thing lacked the flavor that was expected. I know what you're thinking ... \"If you want flavor get a whole egg, you bum!\" But when you get two egg whites with TURKEY on a ONION BAGEL you expect flavor to shine through regardless if the egg whites are a bit bland. The bagel itself left something to be desired. I just wasn't a fan at all. \n\nThe service was very good and my food came out quick despite it being pretty busy in there. \n\nSo my search continues. Bergen's Bagels next.\n\n---\n\n*CASH ONLY! (There's a Chase next door and they have an ATM on the premises.)", "author": "Heather S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-10-03", "description": "It kills me to give a not great review, butttt I have been ordering from La Bagel for about 7 years and always loved it, but over the past 6+ months it has not been as good. My main complaint is the seeding - I have been getting everything bagels and they barely have any seeds on them - I feel like I'm eating a plain! Come on La Bagel - step up your game...or I'll be switching to a new bagel place :(\n(Also - work on your toasting...a toasted bagel is supposed to be TOASTED and warm, not soft and cold)", "author": "Debra L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-26", "description": "The joy in the voice of the manager after he peeks into the tinfoil pouch containing my breakfast sandwich and yells out \"Mr. Bagel!\" is matched only by my excitement as I dive into the glorious, ginormous grilled everything bagel with ham, bacon, egg, and cheese. \n\nLa Bagel Delight may not be in the upper stratosphere with Absolute Bagels, Terrace Bagels, and Bagel Doctor, but LBD blows the Montague Street shops away. LBD is a no-brainer for a Brooklyn Heights resident.", "author": "Steve M."}], "servesCuisine": "Salad", "priceRange": "Under $10", "name": "La Bagel Delight at Court St", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "90 Court St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/0i_2GvpnFba68P0hnSgVvA/ls.jpg", "@type": "Restaurant", "telephone": "+17185220520"}