{"aggregateRating": {"reviewCount": 154, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-14", "description": "Straight to the point type of deli. The lines can get long in the morning but once you order the service is fast. I normally order a toasted garlic bagel with a side of butter or cream cheese and it always comes out fresh. They also have two separate lines and cashiers which helps when they are crowded. Clean with no frills - hence I have no complaints. 4 stars.", "author": "Nneka M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-24", "description": "Love this place. You can see the bagels cooking in the back, baked daily. The bread is always soft and delicious on the inside. The bagels are served with more than a healthy serving of the cream cheese, which looks to be homemade. The veggie kind has big chunks of pepper, carrot, and onion in it. Yum! \n\nLines can be a little long on the weekends, but move quickly. The place is small, so grab your bagel and walk to the promenade (just a few blocks away) to eat on one of the benches there.", "author": "Danielle S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-09-28", "description": "Bagels are decent but their pricing is always shady. Never pay the same thing twice for the same item. Breakfast special for $3 egg sandwich, but if you add cheese suddenly becomes full price ($6)?? Would love to come here more but hate the inconsistent pricing. Just post the prices and be done with it.", "author": "Bill B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-25", "description": "This place is definitely my favorite bagel place in Brooklyn. The bagels here are quite large--the perfect amount for my early morning carb cravings. My go-to bagel is the poppy seed bagel with lowfat cream cheese. I'm excited to try different combos here. I would recommend this place to anyone in the area. Just keep in mind that mornings are busy but worth it.", "author": "Ashley S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-26", "description": "Fresh bagels, nothing like it! \n\nQuick \u0026 friendly service. Bagels weren't too hard, weren't too soft either. \n\nThat jalapeño cream cheese...wow, spicy \u0026 delicious! \n\nPrices are inexpensive.", "author": "Angie P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-10", "description": "This place is super efficient and precise - they never mess up my order even when they are crazy busy. I'm lactose intolerant and they have great tofu cream cheeses, including flavors like scallion.", "author": "Amanda F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-15", "description": "A crappy, oddly shaped room, but they've got the goods and they deliver them.\n\nAll kinds of bagels, whatever you need on them. Very New York, meaning they're going to get you in and out of there fast. And that's fine, because this isn't really some place you want to linger, and if you're here, you're probably on your way to work (and late again) anyway.", "author": "John S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-05-17", "description": "Today me and my husband went to a early movie but the theater was still closed so we decided hey let's try this bagel place out . So we ordered a turkey bacon and egg sesame bagel and a plain bagel with bacon and egg n ketchup . The service was great but it all changed from there . \n\nSo we get our food and sit outside the movie theater , my husbands bagel didn't have bacon like we ordered it only had egg n ketchup , so they messed up the order . Then my bagel was just weird , it had a really strange taste to it . It tasted kind of moldy and metallic just like someone els has wrote on here . It was weird cause I couldn't pin point it but really felt like throwing up . Needless to say it was a waist of money . The bagels suck at this place . Would never eat here or ever recommend it to anyone . My first and my last visit to this place . Yuck :0 The one star is just for the service .", "author": "Jessica V."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-01-27", "description": "I came to LA Bagel Delight on Sunday specifically on the strength of the Yelp reviews. I bought bagels for my son and his roommates thinking they'd be thrilled to have free food. They were not. My son said, \"Dad, that's the place where I just spit the bagel out and threw it away. We'll go eat breakfast somewhere else.\"\n\nI thought he must be exaggerating,. He was not. I took one of the bagels to munch on my way back to our hotel. The bagels had a very unpleasant taste to them which I could not readily identify. Metallic? Sorta, but not quite. Moldy? Yes, but not exactly. I then read somebody else's review and they said \"metallic and moldy\" to which I responded, \"There you go, it's both metallic and moldy.\" I belched that gross metallic, moldy flavor the rest of the day. Yuck.\n\nEither there's something in the water affecting Brooklynites powers of discrimination or it must be hit-or-miss on the bagels. How else to explain the discrepancy between reviews gushing \"best bagels on the face of the planet\" and those lamenting \"gross metallic moldy taste; I threw it in the trash?\"\n\nSo, roll the dice. You'll either have a great experience, as some people seem to, or you'll be burping up moldy bagel for hours. As for me, I'll never go back here.\n---\nAugust 2016 Update\nWe had friends visiting from North Carolina. They stayed in our apartment in BH for a week. i said \"You can get great bagels anywhere in New York, but avoid La Bagel Delight, they're gross.\" \n\nSo friends are enjoying New York, posting pictures on FB, when one of their NC friends commented \"How are the bagels? Aren't NYC bagels are the best?\" The response came back \"Meh.\"\n\n\"What do you mean NYC bagels are 'meh?'\" I asked. Turns out they went to La Bagel Delight. Didn't I tell you this was the one place to avoid? We had to take them to a proper bagel place (cough...Montague...cough...Street) so they didn't leave thinking NYC was the land of \"meh\" bagels.", "author": "Tim R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-10-16", "description": "I love coming here for bagels! Great bagels, fast, even just getting a hot bagel without it being toasted is delicious. The coffee is yummy! And the cream cheese selection is great! \n\nToday I decided to venture outside of the norm and ordered a chicken philly because the normal one is made with roast beef. The chicken was touch and hard (I think it must've been microwaved due to the texture).  The bread was also hard in places and tough.  \n\nOverall, it was just horrible. I only ate about half of a half, and felt sick so I didn't finish eating.\n\nI will stick to bagels from now on, after my stomach recovers.", "author": "Erica C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-02-02", "description": "- service is average \n- manager is a good person helps a lot but when he's not around the staff isn't reliable \n- bagels are bad \n- fresh motzarella is terrible\n- tuna salad so so\n- egg white omelettes are good  \n-ice coffee is good", "author": "Fico P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-06", "description": "I live down the street and this place has me eating more bagels than I'm comfortable admitting...\n\nBAGELS: While not mind-blowing, they are consistently good. The cinnamon raisin wasn't as cinnamony as I was hoping it would be. The Everything is my go to, especially the MINI-BAGEL version... YES, they have MINI-BAGELS if you are susceptible to carb-guilt like I am. LOVE IT!\n\nSPREADS: The olive pimiento is my favorite - very flavorful! But beware, they will place an entire tub of spread on your bagel. Even if you ask for \"just a little.\" I scraped a golf ball size of spread off of my bagel and I still had a mouthful in every bite. If you're into cream cheese with a side of bagel for breakfast, then this is definitely your place.\n\nSTAFF: Yes, they are brusk, but very efficient and helpful. \n\n$5 minimum for cards. The bagels are less than $3 after toasting and topping, so make sure you have cash unless you want to have to buy an orange juice or bottled drink to be able to charge.", "author": "K I."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-14", "description": "Oh hi La Bagel Delight.  \nYou make a mean deliciouso bagel to be sure.  \nYou have lots of spreads, cold cuts and salads.\nYour service is quick and somewhat brusque,\nBut one bite will make up for it!", "author": "Jenny M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-12-19", "description": "I've got a million places that I have yet to review about but I made sure to write about this place.\n\nI got two breakfast sandwiches and while the taste of the sandwich wasn't the problem, the hair that was cooked into my egg was a huge f*cking problem. Now I give some places the benefit of the doubt, maybe it was my hair but really.. unless I was in the back of the kitchen and put a strand of my hair to get cooked inside the egg, that's not even a possibility. It was just so mortifying when I found a strand of hair literally lodged inside the egg, please let me make that clear, it did not just fall into my sandwich, it was clearly cooked inside the egg. I love my breakfast, and the fact that this place absolutely ruined my day because of it was a huge let down.\n\nI didn't want to be rash, so I called the place and asked if I could talk to management about what I found in my sandwich. The lady who picked up told me to call back at 2:00PM because they were going through a lunch rush. I didn't know that 11:00 A.M. was a lunch rush. I decided at that point it isn't worth it and that the least I could do for this joint ruining my day and ignoring my request to talk to management is to make sure that the people of Yelp have a clear indication as to why exactly no one in the downtown Metrotech area of Brooklyn should EVER have the unfortunate experience I went through.\n\nSo check this out.. this place has had previous violations for personal hygiene among vermin, and food safety violations. Not really a surprise but before you go here, I hope you know what you may be getting yourself into.\n\nhttp://www.city-data.com/ny-restaurants/LA-BAGEL-DELIGHT.html\nhttp://www.nychealthratings.com/nycrestapp/restaurantlanding/3/Brooklyn%20Heights/20208/", "author": "Eugene K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-05", "description": "I'd heard good things about this place for quite some time but had never stopped in b/c of its location and it's appearance-- this place is smack dab in the middle of downtown Brooklyn on the always-crowded Court Street... and looking inside the windows of the joint, it didn't appear to offer much in the way of ambience. Well, I'll be the first to tell you that looks can be deceiving when it comes to La Bagel Delight because the food is as good as everyone on Yelp! touts it to be. On this visit, I ordred a bagel sandwich, and it was first rate! I had the pastrami on an everything bagel w/ cheddar, lettuce, tomato, jalapeños, and deli mustard, and it was quite tasty. The bagel was plump and delicious, and the meat and veggies were all fresh. Note that La Bagel Delight doesn't have table seating, so be prepared to get your food to go.", "author": "Scott B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-18", "description": "I live a block away, so I've gotten some bagels here several times and a sandwich once.\n\nThe sandwich was pastrami and it was gigantic with a price tag to match. A good sammich it was, and there was enough for left overs.\n\nThe first time I got a bagel here, I went for the \"Lox Spectacular\". It has pretty much what I order on a bagel anyhow- lox, capers, onions, tomato and cream cheese.\n\nI have not strayed from that order since.\n\nThe cream cheese they use comes off very mild and that's perfect for me, because cloying cream cheese makes me gag. The schmear holds all the toppings together nicely and this is a meal all by itself.\n\nAt $8, it ain't cheap, but it's more than you'd get at a chain bagel joint and it's better.\n\nThings move fast here, so be ready to order when you get the eye from behind the counter, and don't forget to tell 'em which kind of bagel you want!\n\nCa$h only.", "author": "Jason V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-23", "description": "Bagels are are fresh and delicious. The sandwiches are plentiful and equally yummy. They have a vast selection of beverages. The service is great. They really take care and pay attention to how you want your food.", "author": "Alyssa J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-22", "description": "I loved La Bagel Delight. \n\nFriend and I were killing some time in Brooklyn before brunch back in the LES and given that the wait was about 2-3 hours (which we planned for) we knew we were gonna need a little snack.\n\nCue: La Bagel. While I wasn't necessarily looking for a chain-y kinda place, La Bagel was literally around the corner from the NYC Transit Museum (our killing time destination) and it had four stars.\n\nI was so pleased! It was around 11 am on a Sunday, there was no wait, and we got our food reasonably fast. \n\nA couple things though: \n1. The counter girls were constantly just yelling \"Next! Next on line!\" in a really not nice get-your-ass-over-here-or-get-the-f-out kind of way. There wasn't even anyone to get INTO line! I don't know if that's just the Brooklyn in them, or if that's just the La Bagel way, or if they're just robotically calling for the next customer as a habit (because I'm sure it gets busy enough in there that the yelling is at times necessary). Who knows, but honestly, minus a star because it was just abrasive.\n\n2. They gave me the wrong cream cheese on my bagel. However! The counter girl was extremely sweet, apologized and got my corrected order out pronto. She even offered to me to keep the wrong one, too, but I really didn't need it. So they redeemed themselves for a portion of the abrasiveness here. Very pleased with the service.\n\nThe bagel and coffee BLEW MY MIND. I don't know why it was so damn good! I WAS hungry, I AM pregnant, but seriously, it was just delightful. Maybe that's where the name comes from? I would go back a hundred times over. Now I'm no aficionado to either, but I said it was the best bagel with cream cheese and iced coffee I've ever had.\n\nRecommended!", "author": "April M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-19", "description": "The bagels here are probably the best bagels around in this area.  Had a tuna melt here today on a toasted onion bagel.   Definitely recommended.\n\nOnly downside is there is no seating in the place but it is a great place to get something on the go.", "author": "Zachary D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-07-30", "description": "Update. Just ordered a sandwich with mustard (I specified that twice including one time when the sales clerk asked me again) and I got back to my office to see that I got mayonnaise instead! This place is getting sloppy and it seems that there is a lot of turnover on the staff.  Little or no quality control. I have to downgrade my review because getting ingredients right on a food order, whether it be caffeine, sugar or mayo, is critical - especially for people with medical conditions/allergies.", "author": "Carl E."}], "servesCuisine": "Salad", "priceRange": "Under $10", "name": "La Bagel Delight at Court St", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "90 Court St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/0i_2GvpnFba68P0hnSgVvA/ls.jpg", "@type": "Restaurant", "telephone": "+17185220520"}