{"aggregateRating": {"reviewCount": 154, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-10-06", "description": "When i lived in brooklyn, i was so lucky to have la bagel in the vicinity. whether it was getting a sausage egg/cheese or the dieter's delight (egg whites and turkey) for breakfast or getting an overstuffed turkey sandwich for lunch, the bagels were consistently tasty and not dense, the service friendly, and the prices affordable. unlike most bagel places in manhattan that are so overhyped, la bagel's bagels are underrated little treasures. don't move to manhttan la bagel.", "author": "Eric K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-03", "description": "We stumbled in here not knowing what to expect. Lucky stumble on our part! The place was crowded. Even some NYC cops stopped in for lunch. I hear that's when you know it's good. The lox spectacular is...spectacular. Get it on the everything bagel. It's not fancy and there's only a small counter to stand at but it really doesn't matter when you're stuffing your face with the best bagel you ever had. Satisfied my New York bagel craving for sure.", "author": "Lauren C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-12-29", "description": "I live nearby and have tried this place many times. Unfortunately, the bagels have this dishwater aftertaste - I've seen others phrase it here as a mildew flavor, which I would also agree with. It's not every time, but it's frequent enough that I'd prefer not to play roulette when there are a couple other good option around. Try Court St bagels or the new place on Clinton \u0026 Atlantic instead (now goes by Bagel Cafe). I hope they fix whatever the problem is as this place is mighty convenient - seems just cleaner water for boiling would take care of the weird taste.", "author": "Rebecca F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-06", "description": "I was in New York for a week and this place was a couple of blocks away from where I was staying. I was hook for 3 days with their sesame seed bagel. Bagel was huge and best ice coffe I've ever hard. Also reasonable price.", "author": "Roxana M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-02-20", "description": "A regular stop for all of the courthouse and office folks in the morning - the best bagels around, freshly made and generous with the cream cheese.  (Seriously - a good half inch thick; bring your napkins).  Worth the walk from the subway, even if it's in the wrong direction.", "author": "Lucien V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-06-12", "description": "MY FAVORITE BAGELS EVER! Whenever I go anywhere else for bagels, I regret it. Every single person who works at La Bagel is SO NICE, even though it is hot as balls during the summer and very busy. Once when I forgot my wallet, they let me have the bagel for free (I later paid them back). They are very efficient and they pay attention to your order. I can't speak to the sandwiches, but the coffee is pretty good and I love the brand of muffins they have (http://www.morrisonspastry.com/). They make the bagels themselves, but not the muffins, and probably none of the other baked goods either. But whatever, I'm going there for bagels, not baked goods. They take credit cards, but they recently imposed a $5 minimum for using them, which is slightly annoying because I never carry cash. Everything considered, this is a top notch bagel place.", "author": "Kelly A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-06-01", "description": "This place is pretty good.  Friendly people behind the counter.  Even when its busy in the mornings I dont remember ever having to wait more than around 10 minutes to get my food.  Sandwiches and bagels are good and reasonably priced especially for Brooklyn heights.  They pay attention to your order usually, for example don't put globs of cream cheese on when you tell them to take it light on the stuff.", "author": "Rob K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-12-27", "description": "It's super busy here, understandably, cos the bagels are warm, fresh, and yummy.", "author": "Amy F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-15", "description": "their whole wheat everything bagels are amazing. I would recommend the lox cream cheese on toasted ww. I always go out of my way for a la bagel!", "author": "Liza M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-03-27", "description": "Best bagel I've had in the city so far. Better than Ess A Bagel, Murray's, and H\u0026H. Nice big chewy bagels with a crunchy outside, and they're generous with the cream cheese. Great, fast service, and the coffee's pretty good, too.", "author": "Jess B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-14", "description": "So sad I don't live close to this place anymore.  They have, in my opinion, the best everything bagels in the neighborhood.  The bagels are always warm and soft-- and they always give you tons of cream cheese.  Their egg sandwiches are also delicious.  Only downside is that there is usually a long line on weekends--so you might have to wait a while before you can order.", "author": "TJ C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-03", "description": "Big, tasty bagels. That's pretty much how I would define La Bagel Delight. They have fast service, and the place always smells great. The guys who work there are also really friendly and helpful. I've had bagels with butter and bagels as a sandwich. I am not really a fan of the over stuffed sandwich thing, so I would definitely recommend asking for them to go light on the middle if you want to get your mouth around it (although I know a lot of people like that). The only reason why I am giving 4 stars instead of 5 is because I've gotten spoiled by all of the flat bagels around town. Tal Bagels still wins my heart with the flat everything bagel.", "author": "S H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-12-11", "description": "A little bit pricey for a bagel place, and a little bit slow, but the guys in there are friendly and everything tastes good. Most important: they never give me so much as a funny look when I pay for my buttered bagel with plastic.", "author": "David L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-05-05", "description": "i love love this place! the bagels are so fresh and the service is great. however, it is kind of hectic at times but its all good and worth the wait. the pastries are delicious and there are also cold cuts and sandwiches sold here. they would basically cater to your cravings. and its so cheap! love it", "author": "linna c."}], "servesCuisine": "Salad", "priceRange": "Under $10", "name": "La Bagel Delight at Court St", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "90 Court St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/0i_2GvpnFba68P0hnSgVvA/ls.jpg", "@type": "Restaurant", "telephone": "+17185220520"}