{"aggregateRating": {"reviewCount": 111, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-07-03", "description": "Not only do you have to ask for the chili sauce, you have to ask for chopsticks.  If, like me, you are a total food snob, this fact will have told you everything you need to know.\n\nFor American Chinese food, it's not half bland.  A little on the bland side, sure, and a little on the sweet side, and a little on the gloppy side - but you know what you're getting.  The vegetables are cooked the right amount; no flaccid, unhappy broccoli here.\n\nAnd it's cheap.  Appetizers (including the too-sweet sesame noodles that remind me of my childhood, and quite decent dumplings and scallion pancakes) run $2-$4 each, and main dishes are all well under $10.\n\nI wouldn't go out of my way for it, but for a neighborhood joint, it's not half bad.", "author": "Jena B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-05", "description": "Unpretentious old school style Chinese food, fresh and tasty...reasonably priced, not fancy but good spot when you get the urge for an egg roll and wonton soup", "author": "bill l."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-01", "description": "Quite possibly the best Chinese in BK Heights.  Easy take-out process and reasonably priced.", "author": "Lex R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2006-07-11", "description": "Stepping into Fortune House is like being transported back in time to the late 70's early 80's, since that's when it looks like they last redecorated. If you get there in the early evening, retirees from the highrises across the street will be leaving, having started dining at 5. \r\n\r\nI don't advocate making a special trip to go to this place, but if you live or work in Brooklyn Heights, DUMBO, or Vinegar Hill and you don't feel like schlepping to Chinatown, by all means try it. The food is nothing spectacular, just good Chinese comfort food. This place is a Brooklyn Heights version of Suzies on Bleecker. Standouts for me are the sauteed fresh asparagus, ginger chicken, and beef szechuan style. The eggrolls are also suprisingly good.", "author": "Neilson A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-03-31", "description": "I think this is the best Chinese I've had in a while. I live down the block and order here a few times a week. Never had a bad experience, 95% of the time the food is excellent, I've had a few times where the chicken was a little over-fried, but it happens. The lunch specials are awesome, and if you dine in they give you wonton crisps and tea with your meal. I've tried about 10 dishes there and it's all good. I think it deserves 4 stars but I gave it 5 to offset the random 1 star reviews.", "author": "Jesse O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-09-26", "description": "I have been eating here for 11 years.    My bedroom window used to be adjacent to their kitchen window when I first moved to NYC and I would smell Chinese food all day long.   With any other restaurant I would probably have been sick, but their food is amazing and their kitchen is clean.  The best entree:  Triple Delight    The two best soups:  Hot and Sour and Wonton.     This place is truly amazing and I often travel back to Brooklyn Heights from Manhattan to eat here and take my friends here.   Free Hot Tea, Fried Wontons, Amazing Hot Mustard Sauce and lots of Chinese Smiles!  Thank you Fortune House!!!!", "author": "Timothy M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-11-13", "description": "I've been coming here for years but lately their food has taken a turn for the worst. Their shrimp dumplings were dry, the sauce for them was bitter, BBQ spare ribs were unseasoned and greasy and finally the white rice was hard. My stomach still hurts from the greasy ribs. Such a shame they have changed their style. I could get better from fast food Chinese.", "author": "Brenda F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-01-21", "description": "I haven't been disappointed. Good food, good prices, quick delivery. Steamed dumplings are the best. Good lunch deals too.", "author": "Jenna R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-08", "description": "I was in Brooklyn Heights and stumbled upon this restaurant on a cold snow drifty day. I had no idea what to expect. I ordered the shrimp and broccoli and a miso soup. The shrimp was SO tasty. Savory. Not bland. I ate everything. Delicious. This is an old fashioned chinese restaurant with the crinkles and duck sauce and hot mustard, tea in the kettle at the table and a fortune cookie after. They don't make them like this anymore. Decor is kind of drab... but in a way that's part of the charm of an old school Chinese restaurant. It doesn't matter because the vibe is divine. Everyone very busy trying to give you good service bustling around. I sense it's been around a long time. I miss places like this. I only wish there were more shrimp but it left me wanting more and that's a good thing. An unexpected treat. I hope it's around for a long long time.Excellent food. Excellent service.Great location. Fun.", "author": "Sally S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-10", "description": "While I would not describe it as \"gracious dining\", this restaurant, which has been in operation for as long as I can remember, is a family favorite. The food is fresh, tasty and inexpensive.\n\nThe staff is more than pleasant and they redecorate from time to time to keep the place looking up-to-date and reasonably attractive. Neither the decor or the food is particularly fancy, but it's more than adequate in quality.", "author": "Amy B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-04-22", "description": "Oh, Fortune House! A local resource that one returns to again and again, even if the food is sub-par. Is its fundamental attraction the tank of koi, which seem to grow fatter as one watches?\n\nThe recent rehab has done wonders for the physical space, and the service--especially by the lightening-fast, ultra-efficient Sharon--is tops.\n\nNow we come to the food. I can only say that if one orders carefully, VERY carefully, one can get decent Chinese-American food that does the job when one can't bear to cook for oneself.\n\nOrdering carefully means avoiding, for the most part, \"made\" saucy dishes--which is to say, those that involve multiple ingredients cooked together with, yes, a sauce. That leaves chicken wings, ribs, scallion pancakes, dumplings, and the like. \n\nAn exception to my rule: the various full-dish soups. \n\nPrices are very reasonable, a major plus. Now if the owner could just emerge from her cocoon of done-this-a-thousand-times-too-often boredom.....\n\nPS, I never eat on the premises, always go there and pick up food.", "author": "Arthur B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-12-16", "description": "I have ordered lunch specials from Fortune House for many years and recently their portions have gotten much smaller.  I ordered chicken and broccoli and the container was 3/4 full of rice.   The flavor was not there either.\n\nIt may be cheap but Im now looking for a better local Chinese lunch place.", "author": "Brit R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-10-09", "description": "Fortune House closed for vacation and then remained closed for a long time last year. It finally reopened. It must be under new management. It is definitely not the same. We went over on a Wednesday evening, and while in the past, it is usually fairly well patronized by locals, it was completely empty at dinnertime. A few people came in while we were there. It took an hour and a half to serve 3 dishes to us, one of which was listed as an entree and served as an appetizer. Food was brought out one dish at a time, even though we had  ordered one entree per person. When we asked about when the rest of our food was coming, we were assured it was on its way, then another dish would come, still leaving one of us without food. This in an empty restaurant. And it wasn't like the phone was ringing off the hook or there were a bunch of folks picking up takeout. This used to be one of my favorite order-in sources; I am definitely looking for a new Chinese restaurant to order from. Sad. end of an era.", "author": "Jane S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-05", "description": "What's with all the bad reviews on this place? Every time I have eaten here the food has been reliably fresh and well prepared.  And the drink prices, that's the clincher.  The beers and liquors are straight up cheap.", "author": "Ryan P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-08-10", "description": "I was very disappointed with my take-out tonight.  The shrimp in the young chow fried rice tasted like iodine and the beef in the happy family was reheated.  Ironically, I had the same take out last week prior to my vacation with family and they loved the leftovers I brought with me as did I.   The food here is sometimes very good and sometimes not.  That's why I'm giving it 3 stars.", "author": "Vincent T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-04", "description": "My fav neighborhood chinese restaurant! The food is consistently good, and the delivery is FAST! I love that they do a special for lunch, cheaper and you get either soup or soda.. And they deliver lunch time too. They even make all the chicken dishes with white meat, if you request it for an extra $1,00.  For me the portions are big enough ..", "author": "Mindy S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-09-13", "description": "Nothing special.  RELATIVELY inexpensive.  Nothing to run back to, but I'm starting to be afraid that it's the best Chinese option in the area.", "author": "Mike P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-03-19", "description": "It has definitely gone down hill under the new management. I gave the faux Viet chicken in lemon grass to the dog. The shrimp in watercress came in a flour and water paste you could post flyers to a post with. I have eaten there for decades but I have to say it has gone to the dogs (both literally and figuratively).", "author": "Peter M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-05-02", "description": "Just ordered delivery from there last night and it was pretty good. The General Tso's was flavorful and still pretty crispy, which is tough with delivery. My daughter enjoyed the chicken lo mein, which I thought was kind-of bland, and we both liked the veggie wonton soup. We ordered off-menu (chicken \u0026 broccoli w garlic sauce) which I thought would be spicy but it wasn't. The broccoli was crunchy though, so maybe next time I'll ask to make it spicier. The prices are great and the delivery is fast. Definitely the closest thing to decent, traditional americanized chinese food in the area. Will order from there again.", "author": "Lola F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-30", "description": "I wasn't expecting much. I'm not a big fan of Chinese delivery. However, myself and a group of people ordered this when we were working late in Dumbo. I got the General Tso's chicken combo. It was on the sweet side, but the sauce was really good and the chicken was cooked perfectly. Fantastic texture. The fried rice has fresh tasting vegetables, very nice. Everyone really liked it, much better than your standard NYC Chinese delivery. It's not the cheapest by any means, but you can tell they care about the ingredients and preparation. I'll definitely be ordering again.", "author": "ross m."}], "servesCuisine": "Chinese", "priceRange": "$11-30", "name": "Fortune House", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "82 Henry St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/m0r4l-pnn9IP7fm8e7ijNQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188557055"}