{"aggregateRating": {"reviewCount": 111, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-09", "description": "As a chinese person, it's sometime looked down on to eat \"Chinese take-out\" food. For those who've been living under a rock, \"Chinese\" take-out\" is sort of the tacky, dumbed-down style of actual Chinese food -- made to cater to White People. So it may come to a surprise, that I, a chinese person, find Chinese take-out food to sometimes be a guilty pleasure. \n\nEnter: Fortune House\n\nI had the Singapore Rice Noodle which was served with such delicate textures. Make no mistake, this restaurant serves \"Take-Out\" dishes, but the quality is excellent.", "author": "Henry L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-29", "description": "I actually always thought I hated Thai food until I ate here. The customer service is nice, and the food was pretty good. Nice place for lunch or business meeting.", "author": "Jeroslyn J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-01", "description": "Pretty much consistently good food at decent prices.  Food and restaurant here is much better than you standard \"Chinese take out\".  Would recommend this place.", "author": "Hula B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-06-27", "description": "Nothing actively wrong with the food, but consistently underwhelming, especially for the price.", "author": "Devon Julian V."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-01-11", "description": "The first time I went I had pork fried dumplings and pork fried rice and it was okay. Today I went back for the lunch special and bought an egg roll, chicken wings, sea sesame (it had no sesame on it, okay fine)chicken with rice. The chicken wings were extremely oily, the oil they fried it in was clearly old. The egg roll was dripping oil in the bag it was packaged in. Again the oil they used is clearly old. I wanted to dip my egg roll into the duck sauce and when I did....It was probably one of the nastiest sauces to hit my tongue. It clearly was past it's prime or made with some gross ingredient. I'll never go back! Although the people are very friendly the food isn't good enough for me to waste my money for oily overly fried foods.", "author": "Asari D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-26", "description": "I like the freshness of their food, and the friendliness of all the staff, from the managers to the waiters and waitresses.  I have eaten here for many years of living in Brooklyn Heights and that is a recommendation in itself.  It is also quiet, with tasteful background music, so always possible to chat with a friend while having a delicious meal.", "author": "Michael B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-22", "description": "Good lunch specials, the lomein in was very tasty the noodles weren't overcooked. Not pricy 6.50 each plate with soup or soda.  I had pork steamed noodles, those were good, but not the best I've had before, but for 6 for $4.00 it's a good deal. The spicy shrimp with peanuts was very good although they add lots of celery other than that very good. They offer hot tea and crispy noodles with a spicy and sweet dipping sauce, I recommend the sweet one.  Good ambience, service was good and quick. Had a very good lunch experience, I recommend it if your in the neighborhood.", "author": "Zahel E."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-04-29", "description": "All I had was an eggroll (I had a craving). No less than an ounce of oil dripped out of this heavy little treat. There was actually a pool of oil on my plate when I was done.\n\nCould barely taste the crust or filling through the layer of grease on my tongue.", "author": "Craving Cholent X."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-03", "description": "Nice portions from Fortune House at reasonable prices. \n\nDelivery was speedy. \n\nThe wonton soup was delicious; the broth tasted (and looked) homemade. \n\nYou get all kinds of fried noodles with each main dish you order.\n\nAnd a tea bag and some fortune cookies.", "author": "Steve M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-07", "description": "Finally, a great Chinese restaurant in Brooklyn!!  Great lunch special and actually nice atmosphere.  It is great to order Chinese and NOT get a greasy, overly salted mess. The garlic sauce is amazing and the wonton soup is the best I have had in a while.  Very fresh.  I will absolutely be returning!", "author": "Jenna J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-02", "description": "Sadly this neighborhood institution has closed down, with no future reopening in sight. A big loss for the area as it was really the only proper sit-down Chinese joint, with solid food and a really nice staff.\n\n*** Good news update: It looks as though FH is set to re-open, and their \"closed for renovations\" sign was legit. ***", "author": "Lee G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-05-22", "description": "How on Earth is this place surviving with the meanie up at the counter? Seriously?  I almost thumped her on the neck. Here I am being all polite and asking questions (no one was behind me waiting) and she is about to have a fit because I have interupted her soy-covered daydreams.  Whateva. Anyways,  I asked if there was MSG in the food and she looked annoyed and shook her head no. Really? All of sudden you cant talk? I didn't believe her but I ordered chicken wings (5 drummets) for 4 dollars and change. And let me tell you- the MSG was live and in affect. It made the roof of my mouth itchy, gave me a slight eye ache and a weird after taste. Yeah, no thanks.", "author": "Shanora S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-12-08", "description": "Please let me say that I have been to the Fortune House before and enjoyed the food.  This was the reason why I decided to get a takeout order of spare ribs ($11.65) from them instead of from the Chinese restaurants in my neighborhood (6+ miles away).  This is what I got:  A bag of ribs that were \"doctored up  with sauce\" and  consisted of three pieces from the rib ends, three somewhat smaller dried out ribs and two narrow burnt bones with little or no meat on it.  They were not a fresh cut of ribs as I could tell by the way the sides looked. I believe the ribs were the scraps that were left that could not be served to the in-house customers.  (I dare not think they were leftovers from customers' plates - God forbid).  Be leery when ordering takeout from this place.  I don't trust them and will never go back again. Lastly, click on Fortune House and look at pictures of the ribs that I thought I would be getting.", "author": "Correne B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-19", "description": "While the restaurant isn't much to look at (outside or inside), Fortune House is my go-to destination for Chinese Take Out in Brooklyn Heights.  They have the BEST Chicken Lo Mein I've ever had, and I also greatly enjoy their Fried Pork Dumplings and Shrimp Fried Rice.  The staff are fast and friendly, and the prices are \"right.\"", "author": "Krista J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-10", "description": "Best Chinese in Brooklyn Heights - I would never go anywhere else. \n\nThe staff is always really friendly and take out orders are super fast. They are always willing to alter options which the picky eaters in our house appreciate. We generally do take-out so o can't say much about dine-in service, but they're very friendly when we come in for pick up. We appreciate that the food isn't too greasy.\n\nChicken \u0026 vegetables in garlic sauce are awesome.  Try the vegetarian egg roll. The only rival in Brooklyn is No Pork Halal on 4th Ave.", "author": "Lynn B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-04-18", "description": "I'll never go again. the only thing good was the free pineapples i got. Hell maybe i just ordered the wrong thing.. But sesame chicken should be universally Good.. at least now i know not here. and maybe its a New York thing.. but they egg rolls had some type of pinkish meat in it..I don't know.. but i am not used to egg rolls like that. My friend is a Vegan and she Loved her Food.. I guess you can't F\u0026#$ up veggies but you can mess up fried food.. I think I broke a tooth or sliced my Jaw ..ewww never again except for the free pineapple and Tea..lol", "author": "Deprina G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-05-13", "description": "I was so hungry last week and my friend and I stumbled upon this gem on Henry Street.  Everything we had here was really flavorful and fresh.  The steamed pork dumplings tasted as if they were made that day in contrast to the frozen one you will sometimes get at other restaurants.  Whenever I go to a restaurant I always look to the specialties and I ordered the orange flavored beef which really was a hit with just the right combination of spiciness and sweetness. The roast duck noodle soup was also really good especially if you like ramen!! I'll definitley be back or order delivery from here.", "author": "Andrew D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-08", "description": "Ordered in for family dinner. We loved the beef chow fun and chicken chow mien. Ma Po Tofu tastes like it should, however, I am a fan of the thicker sauce. Broccoli beef was tender and easy to go down. The veggie fried rice had too much soy sauce. Otherwise, great prep time and service.", "author": "Michael S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-12-16", "description": "Went there to get a quick late lunch for take-out. Pretty empty around 3:30 p.m., but it's not like the staff was particularly friendly. Very business-like. Got the Hunan Beef with egg-friend rice and hot and sour soup. Altogether, was $6.35, which is a little more than I expected to pay for a lunch dish and small soup. In any case, the Hunan Beef portion was ridiculously outbalanced by the rice. Just a few thinly sliced pieces, and the rest of the fairly large plastic container was ALL RICE. They should change the name of the dish to \"Egg-fried (or whatever rice you choose) Rice and A few small slices of beef.\" Not the way to bring customers back. By the way, the soup was okay.", "author": "Qing S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-08-30", "description": "520 =  Ten years of living in Brooklyn, once a week at Fortune House.  That's at least how many times I ordered my dinner from this Fabulous chinese food haven.  \n\nIs it to die for chinese cuisine from another planet? No.  Is it totally consistent every time - yes. Is it fresh vegetables, tender meats, delicious sauces (but not tooo much sauce) and fresh moist rice every time?  you betcha.\n\nNow, to the poor delivery guys who had to go out more than once to the same address on Hicks street, because I had ordered my Chicken Fried Rice and my roommate decided that she has to have it now that it smells so good and you had to come out again, even in the snow on your little bike - Sorry:-)  But it's so darn good!!!", "author": "Heidi M."}], "servesCuisine": "Chinese", "priceRange": "$11-30", "name": "Fortune House", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "82 Henry St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/m0r4l-pnn9IP7fm8e7ijNQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188557055"}