{"aggregateRating": {"reviewCount": 111, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-17", "description": "Solid Chinese staple in the neighborhood. Prices are very reasonable (especially the lunch specials which are very well priced). Excelllent for delivery and take out but also pretty reasonable for eating in (the temperature in the summer can be a little challenging though). Overall, this place is definitely a recommendation.", "author": "Vaibhav S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-04", "description": "I grew up in Greenpoint and always went to a restaurant called Shanghai Lee on Manhattan Avenue. It closed about 10 years ago and I have been looking for a comparable replacement ever since. Fortune House isn't exactly the same, but it's the closest I have found in NYC. This place is old school and they serve you the crunchy noodles with sweet and sour sauce. If you want classic Chinese American food like beef and broccoli, this place is fantastic. And they serve hot tea like all good old school nyc chinese restaurants.", "author": "Rebecca D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-05-04", "description": "This place sent us the wrong order and when I called back to tell them, they accused me of being wrong....SO RUDE on the phone, said it was far for them to come for just one dish.\nWhen they finally agreed, they said they didn't know how long it would take.....they also asked for the wrong dish back.......OH just the thought of what they were going to do with it was upsetting!!  Will never order from them again.   Should have listened to others who had complaints about them!", "author": "Deborah M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-05", "description": "I love this place. There aren't many places you can get quality AND quantity. I work in the area so I often order lunch from here. My go to is spicy chicken and broccoli. Had dinner service tonight and the food was just as amazing. Food was made as ordered and came out hot, delicious and fast. Will keep coming here for years to come.", "author": "N C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-05-01", "description": "They have great lunch specials. I have frequented this place for more than 20 years.\nBut whatever you do, don't get take out. It is horrible. As long as you eat in, you will enjoy your food.", "author": "Jacqueline E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-19", "description": "Love this place, food is consistent and fresh. The people are also very nice. On a nice quiet street in brooklyn Heights", "author": "Tiffany C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-09-02", "description": "Born and raised in BK, why would anyone go here for Chinese food. Local restaurants are way better, don't waste your time and money here.  I ordered chicken wings and pork fried rice.  The fried rice wasn't bad but the chicken wings were terrible, not the seasoning best for chicken wings. I also ordered the steak fillet with black pepper sauce, what a mistake! The steak was fried so hard I could barely taste anything, it didn't taste like steak at all! Please save your money and go to a local Chinese place. The place was clean and the service was good but not good enough for me to go back. It's all about the food!", "author": "Christopher L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-08-16", "description": "I use to go here a lot and the food was pretty good! I went the other night and the food was good but the portions were a lot smaller than they use to be. Then to add insult to injury, I over heard the lady at the desk on the phone with a person who received the wrong takeout order from a delivery person; She told the person not to touch it and the delivery person will bring their correct order and pick up the incorrect order. WHAT??? The person had to open the food to see that it wasn't what they ordered. That means that it should have been deemed unsafe to re deliver to the correct person. I wont be back!", "author": "Jonn B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-05", "description": "the service was good and they serve complimentary chips. cant complain about the food! the flavor and spice was on point", "author": "Jason W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-13", "description": "Gotta love Fortune house. I order in from here a couple times a month. The food is yummy, and pork buns and scallion pancakes are especially​ good. Though, I do think it is overpriced​ for the quality.. oh well", "author": "Amber P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-05", "description": "Chicken wings with fried rice is good, the wings are golden and crisped just right.  The fried rice was okay, plain fried rice with a bit of egg. Very convenient and quick delivery.", "author": "Alex C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-11-16", "description": "Didn't try much but their lo Mein can be described in one word: bland. I can't speak to the rest of the menu but getting such a simple dish wrong doesn't tell me good things. Many better dining options in Brooklyn Heights, wouldn't go again.", "author": "Jordan B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-05", "description": "From a holistic standpoint, Fortune House is a very dependable source of food be it lunch or dinner. Their lunch combo is extremely cheap at 7 bucks and you get not only a filling meal but also a soup and some fried chips that Americans call lo mein. I live down the street and I can go pick up food I ordered on the phone within 10 minutes.\n\nFrom an authenticity standpoint, only the most critical of Chinese foodies would be offended. There are plenty of not-far-off options such as the Shredded Pork w. Dry Bean Curd \u0026 Pickled Cabbage, Chinese Eggplant in Garlic Sauce, and Teriyaki Salmon.\n\nDownsides are there are not enough special Chinese dishes and desserts for Chinese foodies.", "author": "Elbert W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-05-08", "description": "Middle of the road Chinese restaurant.  Went there for lunch, very affordable sit down at $6.25 per combo.  Portions small then normal which meant they weren't huge very appropriate.  Fried rice was good and so was the general tsos but the sweet and sour chicken was lacking.", "author": "Matt R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-05-02", "description": "The food wasn't the worst Chinese food I've ever had, but it was meh. Portions are small when you order to go. $6.25 + tax gets you rice, a greasy entree, and a soup or salad. I ordered the wonton soup, which was ok and came with two wontons. The entree box was 80% rice, however, so while the $7 price is good, you're not getting much for it! But seriously. You're mostly getting rice. Also I'm preeeetty sure there is MSG in the food... I definitely had a strange after taste and huge headache afterward.", "author": "Stef S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-08-07", "description": "I recently had lunch there. I was being treated by my mother in law, as she was buying. She asked me to pay previously, and she gave me 2 50's to cover it. The food was so so. The service on the other hand was rushed. \n\nAt the end of the meal, I had a dilemma. The meal came out to $53.60. It was my mother in law's money, so I didn't want to break her second 50. I had $8.00 in my pockets, and kind of meekly gave $58 for the check. I am normally a 20% tipper, but since my disability a few years ago, being able to do 20% tips is kind of difficult these days.  \n\nWhat happened next astonished me. As we engage in some conversation at the table (It was not crowded at all), the waitress approaches me and says \"Sir, you make a mistake. You not give enough tip. Four forty not fifteen percent.\"  WHAT??!! REALLY?? Seriously?\n\nI've dined in this country literally from coast to coast.  In more than 48 years of dining, I have NEVER encountered this.  No where is it posted, either on the menu, or anywhere in the restaurant that an obligatory 15% tip for five people was expected or required.  Prior to exiting the restaurant, I looked high and low for such a notice. Nada, nothing, zilch. That was the only decent explanation why a server would do this. \n\nBut nooooooo, this waitress took it upon herself to embarrass me in front of my friends demanding more money for herself. If it were my money I was using, I would have said too bad. Since it was my mother in law's money, she volunteered to pony up $4.00 more. \n\nWhat if it were my money? What if it was all I had?  Would she refuse to service disabled people on a fixed income because they couldn't give more than they had? \n\nI have a lot of respect for servers My daughter served her way through a master's degree. I've seen her financial struggles getting by on tips. . Yet she NEVER asked a customer for more tip money.  \n\nSo...... Fortune House will not get a dirty penny more from me.", "author": "Carmelo P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-06", "description": "I ordered delivery from Fortune House today and it arrived in about 30 minutes, even though I'm out of their immediate delivery area at about a half mile away (requires a higher minimum). The food (filet of fish in garlic sauce and orange flavored chicken) arrived hot and flavorful, with a nice bit of heat in each. The vegetables are fresh and pleasingly firm. And the portions are decent, especially considering some Brooklyn Heights restaurants. I've been ordering from Fortune House for many years, and I'll admit that every once in a while the food isn't quite as good as today, but for the most part the things I've tried have been at least good, and sometimes, like today, very good. I can't guarantee that every single thing will knock your socks off, but worth a try.", "author": "Ronnie A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-01-19", "description": "This place is great for eat in, but not so great for delivery.  I always enjoy the scallion pancakes and baby bok choy dishes, but when delivered, everything comes out watery and a little bland.  I think it's from the steam in the packages - not sure how that can be avoided.  \n\nWhen I eat in, however, I must say it has never been anything but good.  The decor is pleasant, very clean, fast friendly service and the food is certainly above average with plenty of healthy choices, not the typical fried fried FRIED stuff you find in the majority of Chinatown.  This is a really great option for a quick dinner before a movie at Brooklyn Heights Cinema down the block.\n\nLastly, the price is reasonable for what you get - if you want a lot of crappy Chinese \"fast\" food for cheap, try Great Wall down the street instead.", "author": "Rachelle R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-04", "description": "I've ordered from here many times and thought it was good, but I recently ate in the restaurant and found it to be much better dining in. I definitely recommend going in to eat if you live in the area or for the lunch specials.", "author": "Laura O."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-11-29", "description": "I've had their lunch special a few times. Their only good soup is their wonton. All of their entree's seem to be pretty average or a tad below, nothing inedible. Lunch special is super cheap, 6.25 plus tax. So it's pretty hard to lose. But there are way better options that may be a bit more expensive but are way, way more satisfying.", "author": "Adam L."}], "servesCuisine": "Chinese", "priceRange": "$11-30", "name": "Fortune House", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "82 Henry St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/m0r4l-pnn9IP7fm8e7ijNQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188557055"}