{"aggregateRating": {"reviewCount": 111, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-03-09", "description": "I had to give this place a star but DO NOT order from them, the guy is rude, the people that work there are not personable at all. The food wasn't good either so all together bad experience.", "author": "Thameera R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-30", "description": "The waitress was clearly having a day. Whatever the issue was, it didn't take away from the quality. The fried rice was some of the best we've ever had.", "author": "Suzy P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-02-20", "description": "Bad customer service.  Came from far to eat here and all we got was what they felt like giving us.  I asked for vegetable fried rice and they give me fried rice with eggs and then the server has the nerve to tell me the vegetables are in the rice.  I also asked for chicken wings well done and I get chicken wings cooked well on the outside and raw on the inside.  I will never come back here again and I suggest no one to go there to eat.  I gave them a one star but it wasn't because they deserve that much it's because I can not continue if I don't rate it.", "author": "Josephine V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-03", "description": "For Brooklyn heights, this place is good. It is what Chinese food should be and what I remember growing up eating.", "author": "April Y."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-14", "description": "Food tasted fresh and delicious. For an appetizer we had shrimp shumai which was very good. Not too  salty. \nMy main course was the famous Gen. Tso chicken which I throughly enjoyed. The chicken had a slight crispiness to it but was still very tender. In NY it's hard to find an authentic \"sit down\" Chinese  food restaurant. Most Chinese  food rest places here are take- out orders. But at the Fortune house you get that old school  feel. Also,  The waitress we had was very friendly. We'll be back for sure.", "author": "Darryl S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-16", "description": "Really good food! I can say it's the best Chinese food I've had. Very fast service too.", "author": "Ve K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-23", "description": "There was one night with friend when we just wanted to have a good meal and have fun in a good environment. We were lucky enough to find this place. Food is excellent I loved the sesame chicken! Is delightful! \n\nGood place! \nWe were from Venezuela, Italy, Germany, Japan and Korea and we all loved it!", "author": "Andrea P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-05-09", "description": "LOL - I have been ordering delivery from here since 2002. Suddenly they want to charge $1.00 extra for any sauce on the side. Already the food has been on the decline and now this? They need to go out of business if they feel they can't keep the family business going - not nickel and dime us to death and cut corners on quality to try to turn a profit. Do yourself a favor and order from Lichee Nut over on Montague Steeet. Nicer fami.y and better food anyway...", "author": "Optimist O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-20", "description": "Great Chinese food from a wonderful staff.\n\nThey use traditional ingredients such as lotus root and Chinese squash. If you're looking for a great lunch and superb service, look no further. \n\nIt's been a while since I've had their seafood, but they always had really fresh seafood and I always looked forward to the crab that they served. It was cooked with garlic and scallions and was battered and fried perfectly in a soy, ginger sauce. The way the Chinese do crab and lobster are very different than the average American eatery where they just steam it or boil it; so if you've never had it, get out of your comfort zone and try it! \n\nI remember the steamed fish was always great too, the soy sauce with the oil drizzled on top of white race and eating the soft fillets of white fish were always a good treat.\n\nAlways nice to see a legit hole in the wall keeping up good traditions.", "author": "Arthur H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-03", "description": "this is one of,  if not, the only REAL original\nChinese reataurants left.  the food is always on point and it is the original vibe that these restaurants used to have. the servers arent the nicest people but the food is good\nthe wonton and egg rolls are always good and those things are a perfect way to know how a Chinese restaurant is as many in the world today are hit or miss", "author": "John D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-06-26", "description": "I'm fairly forgiving with inexpensive restaurants, but this place is awful. The squid was spoiled, the broth in the wanton soup was nasty (how do you mess up wonton soup?), and the General Tsao's chicken was over-cooked and weird. \n\nI strongly recommend you skip this place. Instead, for dine-in go to Lichee Nut on Montague (it's totally middle-America Chinese food, but it's okay). Great Wall is fantastic for take out.", "author": "Nick B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-12-24", "description": "We live in the neighborhood so we are happy to be able to walk here.\nHowever we have stopped eating here in the last few months because the food is tasteless. We could only figure out that they must have changed chefs. I have spoken to a few people about the restaurant and they agree\nthe food has changed. We are hoping they improve, we would be really happy \nto return instead of going elsewhere to eat.", "author": "Lynn H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-02-16", "description": "Very basic neighborhood Chinese restaurant. Service was prompt but slightly overbearing, asking us three times within 10 minutes if we were ready to order (while semi empty). Luke warm and diluted green tea, few shrimp in my chicken and shrimp entree, and had to pay a $1 extra for sauce (although still very reasonable for the price- well, BK heights prices). Would come back for the wonton soup and lazy days when going around the corner is all I have energy for, but definitely not a culinary destination.", "author": "Emily F."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-09-10", "description": "The food is \"hit or miss\".  It was better a few years ago and I've noticed it's more of a \"miss\" than a \"hit\" now.   In addition to the inconsistency in flavor, there is an inconsistency in the amount of food. Sometimes you get more chicken...sometimes you need to search among the vegetables...  Because of the convenience - and limited take-out food choices in the area - I sometimes order from them and hope for the best.  Because of their rudeness at the counter, and over the phone -  I won't be taking my chances on a \"hit or miss\" meal anymore.  The woman at the counter has no patience, no manners, and is flat-out insulting...  How this place still exists is beyond me.", "author": "Frankie F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-25", "description": "Much better than I expected! And much cheaper than those chi restaurants in Manhattan!", "author": "Sabrina M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-12-12", "description": "Not much thing to say. Almost worst Chinese restaurant in NY. \n\nReason is that the waitress and the hostess are really b i t c h. Asking for tips and everything.", "author": "Quintus Q."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-31", "description": "Definitely above average as far as NYC Chinese food goes. So not disappointing, pretty good overall.", "author": "Ashley D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-03-16", "description": "This is probably the worst Chinese food I've had in a long long time. It's even crappier than the place down the street (Great wall). \n\nThe food is too oily or too bland. The chicken doesn't taste right and the vegetables are never cooked properly. I've had multiple different dishes here and every time I'm done, I legitimately feel like I ate oil. The chicken with broccoli, the beef noodle soup...I could go on, they just don't taste very good.\n\nPlease avoid this place...it's not Chinese food, it's a bastardization of Chinese-American food.", "author": "Dawei L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-10-20", "description": "Came here for the 2nd time and i will not be back.  The first time i came here i ordered plain lo mein and wasn't 100% happy with it so when i came back i asked the lady if they could put sauce on the noodles and she wouldn't do it for me. Her only reasoning was that it already had flavor, which it didn't. I didn't think adding a little sauce to my food a big issue but apparently it is so i will bring my business else where where they know how to accommodate the customer.", "author": "Jenna B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-10-20", "description": "This was only my 2nd time going there and after today, MY LAST.  Just had lunch today and the experience alone will have me telling my co-workers to never return.  I ordered an appetizer which came after I had eaten 1/2 of my entrée.  When finished, the waitress asked did I want the appetizer wrapped up and I asked could it be sent back since I no longer wanted it.  She acted as though she didn't understand English and proceeded to wrap it up for me.  When she handed me the bill, my co-worker and I gave her 2 debit cards.  She said the minimum charge was $10 for a card.  Since it was only at $19 bill, we told her to add another $1.  She stood there for a moment confused.  When she finally understood our request, she took the cards and the bill.  When she returned, we each signed our bill and returned them to her.  Already disgusted with our experience, this particular waitress had the audacity to return to the table with my bill and inform me in English (which now she amazingly understands) that the gratuity was not included.  Was she serious?  I should've left her the appetizer I no longer wanted as opposed to the $1 tip she desperately begged for.\n\nNever again..........Now I have to tell all of my co-workers NEVER TO RETURN and trust me, they will miss the business.  We work in the Brooklyn Heights section and there are various other establishments which would love our business.", "author": "Tracey L."}], "servesCuisine": "Chinese", "priceRange": "$11-30", "name": "Fortune House", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "82 Henry St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/m0r4l-pnn9IP7fm8e7ijNQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188557055"}