{"aggregateRating": {"reviewCount": 111, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-23", "description": "wow, this is the place to eat!!! our food was phenomenal. a day in d.u.m.b.o we stopped to have lunch here, the service excellent! , the food as mentioned phenomenal, the bill at the end of eating awesome!!\n\ni will totally come back here, and would highly recommend it!!!", "author": "Lani C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-12-20", "description": "Want the worst customer service? Worst delivery time and 7 phone calls after explaining that waiting over 95 minutes for our food wasn't the restaurants fault?? ..Thennnnn Fortune House is for you!! \n\nTruly such a joke, I mean this place doesn't look like anything special but once you click order, it's all sh*t from there.", "author": "Lucy R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-01-22", "description": "Be prepared to get an f-ton of white rice when you order any lunch special, maybe like 80% white rice. See attached pic, and yes, all the veggies you see there are the only veggies. Unfortunately, they're not buried under the mountain of rice. Better meal/rice ratio please!", "author": "Aris M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-03-23", "description": "I have been ordering here for many, many years. While I feel it has been better in the past, it is still decent Chinese food and I have always found the delivery to be quick. What bothers me is their $25 minimum delivery fee. If you are one person, you'd often have to order more food than you want to meet the minimum. So I tried Panda Delight on Smith Street which does not have this type of minimum and the food is pretty good. Although farther away from me, Panda Delight did not keep me waiting long. Silly Fortune House. Why would you want to lose customers?", "author": "Keith K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-05-12", "description": "The food is standard, nothing-special Chinese and IMO overpriced based on the portion size of many of the dishes. But because I live nearby, in a pinch I will pick up something to go. I've only had take-out so I can't comment on service, but in terms of take-out they're really quick.", "author": "Pandora B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-11-29", "description": "Good value for the money. Don't expect miracles. Food is good, restrooms are clean. Portions are really big. Staff OK. If you feel like Chinese food and live in the neighborhood, good choice", "author": "Vratislav E."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-01-24", "description": "I've ordered from here a few times, and usually the food is fine, considering it's Chinese take-out in Brooklyn Heights. However, I was totally put off by my recent order of tofu and eggplant casserole. There was a piece of cellophane plastic and a small piece of paper mixed in/disguised in the gravy. This made me question the food handling and prep in the kitchen to have been able to miss that as the veggies are being washed (or possibly not washed), and then cooked. This is a deal breaker for me from ordering here again.", "author": "Heidi C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-21", "description": "I'm so bummed. They were delivering to my neighborhood (+ work) for quite some time, and now we're suddenly \"out of range\". This was the ONE place I could order congee from, when I'm under the weather or randomly craving it. Their pork buns also had the right meat to bun ratio, which is tough to find outside of Chinatown, let alone in a delivery service situation.\n\nTip: Stick to the items that are popular on the delivery service recommendation site, and you won't go wrong.", "author": "Shu Jin S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-04-21", "description": "I'll keep it short... The food was good, however while paying for our check, something kind of surprising happened. The check was split in two between my friend and I, and we left what we felt was a reasonable/decent/appropriate tip. The waitress did not seem to agree with this and she returned to our table and told us we tipped her wrong. She then asked us for more money, and even suggested we include 2 or 3 dollars more. WTF? Never in my life have I experienced this. It's unfortunate this happened, because I would have left a good review otherwise. \n\nThe food was good, but this was not cool... \n\nIt was a very awkward, uncomfortable, and unnecessary end to what should have been a nice dining experience. \n\nMy advice to this establishment and their staff is to just appreciate any type of tip, no matter the amount, that they receive. This kind of behavior will continue to prevent people from returning.", "author": "Andrea M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-02-27", "description": "My favorite Chinese restaurant in brooklyn heights, really fun and old school NY vibe inside and fast/delicious delivery.", "author": "Rose F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-11-17", "description": "Totally incredibly quick delivery. Very efficient. The staff is incredibly nice. Food is very adequate.", "author": "Joseph D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-11-12", "description": "Ok. Let me just start by saying this place is sketch as fuck! First of all, the food, not great. But the real issue is the employees/owners. I came here with a friend and she paid with a credit card for both of our meals since there is a card minimum. As we left, my friend checked her checking account and saw that they had charged her twice, so double what she was supposed to. Then my friend's dad called to complain and they knew exactly who he was talking about when he said they charged us twice for our meal but did nothing about it. I had another friend who came here and said they hovered over her as she was writing in the tip and TOLD HER SHE HAD TO TIP MORE. WTF. do not trust them with your credit card.", "author": "Abby C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-27", "description": "I never imagined I would get horrible Chinese food in New York...or even Brooklyn. This place proved me wrong. I suspect people go here because it is convenient or maybe they just don't know any better. The food is flavorless and overpriced. Although this flavorless food is a poor value at any price. I tried it twice just to be sure. Never again. Zero Stars.", "author": "Antonio B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-12-24", "description": "Everytime I order from here I am completely unsatisfied. One time I ordered lo mein and received boiled noodles. This time i ordered an eggroll and it was filled with shrimp (which i am allergic to) and I ordered sesame chicken and it barely has any chicken in it. I included a photo of my meal.", "author": "Tonianne Q."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-21", "description": "This place is my go to Chinese restaurant and has been ever since I moved to the neighborhood 4 years ago. I'm not sure why it has such bad reviews. The service is fast, food is good, and is inexpensive (although they are often releasing new menus due to price increases). I rarely eat in the restaurant as I prefer to order my food for pickup and eat it at home. When I go to pick up my food it is always ready and waiting for me. No complaints!", "author": "Steph F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-08", "description": "Surprisingly good Chinese food from this otherwise outdated little Brooklyn Heights stalwart. I mean, it's not a destination by any means, but if you're not looking for something too adventurous, Fortune House executes the classics pretty well. Dry chow fun noodles with beef were just what you'd expect. Sautéed string beans were very fresh and flavorful.", "author": "Quaker W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-18", "description": "Ugh. Don't go.unfourtunatley Brooklyn heights dosen't have very many great Chinese restaurants.", "author": "greg j."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-12-23", "description": "This physically close to Chinatown, you would expect slightly better Asian fare, yet Fortune House is simple adequate. The decor reminds you of the ending to A Christmas Story, which the food is pretty standard modern Chinese takeout.\n\nThe quality seems to vary as some items are very low on the MSG (see salt) while others seem to be drowning in it. Overall, the staff are friendly and the food is fast. \n\nIf you are craving no frills, standard Chinese, stop by. Otherwise, take the 4 train to Canal Street.", "author": "Nick M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-31", "description": "Fortune House is a neighborhood institution.  The food is variable from dish to dish, it's the kind of place where you'll be happier if you've tried much of the menu and stick to what you like.  The scallion pancakes, congee, sautéed string beans and home-style Tofu are very yummy.  I've heard rumors of a sometimes offered, never printed legit Asian menu but have never been able to confirm if this is reality even for those who know what to ask for. Their lunch special is a very good deal.  The owners are very involved and nice.  There is superior Asian food in tourist Manhattan Chinatown, Flushing and Sunset Park but sometimes you don't want to travel.  Overall a solid, mostly Americanized local Chinese restaurant : )", "author": "Jennifer B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-18", "description": "Quick and tasty. I came here on a snowy day and ordered takeout: Sesame Chicken and General Tso's chicken. My food came out within 10 minutes and I was out in a flash! This place is perfect for some classic Chinese food. Savory and hot, just what I was craving. Bonus points for the staff! Everyone there is very sweet and eager to take care of you.", "author": "Jenny L."}], "servesCuisine": "Chinese", "priceRange": "$11-30", "name": "Fortune House", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "82 Henry St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/m0r4l-pnn9IP7fm8e7ijNQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188557055"}