{"aggregateRating": {"reviewCount": 111, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-11", "description": "I have read some of the negative reviews and don't know what these reviewers are talking about. I have been eating here for years and Fortune House is the best Chinese restaurant in Brooklyn Heights and Dumbo. A new  menu includes new healthy as well as steamed  dishes with lots of fresh vegetables  in addition to traditional and unique dishes. The soups, food and sauces are delicious, fresh and well prepared and not oily at all. The service is good and you can linger and not be rushed. A major recent change is the addition of a new special  Dim Sum menu in addition to the regular lunch menu on Saturday and Sunday until 4:00PM, which is delicious and is not available at any other area Chinese restaurant. The restaurant is nicely decorated and is a bargain at liunchtime and fairly priced at dinner Wine and beer is available. Delivery is quick, and the food comes steaming hot. Lots of Asians eat here and I think that indicates that the food is good. I am a fan of good Chinese food and think that this meets my expectations.", "author": "robert s."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2008-07-08", "description": "I was in the area recently and we decided to stop in here for a meal.  Pretty typical decor with pink tableclothes and a fish tank.  I had the sesame beef, and the food was tasty enough.  The service was nothing special.  But I must admit I think it was the smallest portions I've ever seen at a chinese restaurant.  The only way I would come back is if I was dragged.", "author": "diana m."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-06-01", "description": "I like the decor, particularly the large fish tank in the entrance.  The food on the other hand is pretty mediocre, lousy even.  The sesame chicken was basically chicken mcnuggets in a sweet sauce and the dumplings were terrible as well.  If you're in Brooklyn Heights and really must have Chinese food, go a block further down Henry St. to Great Wall.", "author": "Joe B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-03-11", "description": "I definitely don't recommend this place. I've been two times for takeout and both times they tried to rip me off $10 when giving me my change back. When I confronted them about the change they knew exactly how much to give me back so it wasn't a simple mistake. Not only do they try to scan customers but the chinese food was some of the worst I've ever had. I don't recommend anyone to go to this place and if you do be sure to count your change.", "author": "E K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-15", "description": "This is my NYC chinese food home. Not really because it's the best, but because its good, cheap, and three blocks away from my NYC apartment. I have lived for years off of the chicken chow fun, and it has become just about my favorite thing in the world, especially since it is so hard to find out where I am now.", "author": "Kaitlin F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-05-31", "description": "I had the shrimp lo mein and egg drop soup, both of which I thought were perfectly fine. I suppose the lo mein came in a smaller portion than other restaurants, but it was good enough for my lunch and it only cost $6, so I thought it was the bee's knees. Will return.", "author": "Hao L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-10-06", "description": "So I was a bit worried to order from Fortune House, based on the reviews I read here, but I've gotta say, my meal was awesome. I got take-out here in my continuing search to find good vegetarian Chinese food around the Heights (which is harder than you'd think it would be). I know it depends on what you order, so maybe if you want meat you should be wary, but the tofu is cooked well (not just cubed and slid into sauce), and the vegetarian egg rolls are delicious, and huge! Unless I unexpectedly find an even better place, or have some miserable experience in the future, I will definitely be a regular at Fortune House.", "author": "Eric F."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-10-22", "description": "We ordered delivery, and the food was almost inedible.  And it made me feel sick within less than an hour.  Not good.  We ordered wontons, general tsao's tofu, and chicken with peanuts.  None of it was good, but probably that last dish was the worst.", "author": "Rebecca T."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-09-26", "description": "This is now owned and operated by a new family, same name, some new decor - but the food isn't as good...hopefully they can turn this around soon as they have only operated it for a week or so...", "author": "Nancy S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-02-16", "description": "This place is a go-to delivery option for me. Pretty decent, consistent Chinese food. Nothing to write home about but for the inexpensive prices, I'll take it!", "author": "Geri C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2006-09-30", "description": "ick.  ok i'm not a huge chinese food fan to begin with but it was not good.  it's like two steps below good.  the wonton soup broth is watery and the rest of the food was so blah.  you want good wonton soup go to sea asian around the corner.  i'm sure they have things that aren't bad but my overall impression was just blah.", "author": "Paula M."}], "servesCuisine": "Chinese", "priceRange": "$11-30", "name": "Fortune House", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "82 Henry St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/m0r4l-pnn9IP7fm8e7ijNQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188557055"}