{"aggregateRating": {"reviewCount": 49, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-23", "description": "Super cute neighborhood coffee shop with plenty of seating, big selection of toasts/sandwiches, and even gelato. Love working here", "author": "Vivian W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-03-03", "description": "Love the interior decor of this place. Very comfy and homely seeming which makes it a great place to sit and get work done. They have tobys estate and Stumptown coffees on offer. Also a selection of sandwiches and juices which I have not yet tried. I particularly like the breve and swing by here every once in a while to have it.\n\nMy biggest turn off from this spot and what keeps me from visiting more frequently is that the staff has always been frosty and indifferent. Not even a half smile ever. It makes you feel rather unwelcome and as if you are imposing. Its a really cool spot and has the potential to have such a great vibe but sadly, it doesn't.", "author": "Varun D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-10-05", "description": "Ordered a Ginger Shot and found 5 fruit flies inside the cup! Check your beverages folks!", "author": "Stephanie C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-04", "description": "Got the cold brew here while waiting for the Brooklyn Cat Cafe nearby. The cold brew tasted really good/high quality. The matcha latte was also something that sounded tasty, but really needed a caffeine boost so went with the cold brew. \n\nIt is a really cute spot and seems great for studying. It was really quiet in the cafe and it seemed like most people were reading or studying. There's a lot of seating, lighting is good and the music wasn't too loud. There's also free WiFi. Might be good to pick up a coffee here and bring it to the cat cafe next door. \n\nWould definitely recommend if in the area looking for a cute coffee shop or a place to wind down and study.", "author": "Sarah X."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-05-31", "description": "This place was so. Mediocre. Sad, because I was hoping to find another coffee shop to add into my weekend caffeine rotation. Their branding seemed kind of half assed, there was nothing special about the coffee or service, and they have a sign that says 25c to combine stamp cards. That kind of action seems a bit like nickel and dining in my opinion... combined with the lackluster-ness of the aforementioned points... there are just too many other coffee shops that take precedence!", "author": "Bonnie C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-02", "description": "Off the beaten path. Good place to study. Many outlets, Wifi, nice ambiance and ample seating. (Side note: How pretentious is the word \"ambiance?\") \n\nThey have a nice selection of teas, coffees, pastries, and even fresh juices. Matcha latte was very good (ask for it unsweetened if you don't want honey). They also have a food menu which is in an interesting location (behind you when you are standing facing the register). Dodo birds like me wouldn't notice it at first so I'm saving you the embarrassment of asking about it. (You're welcome.)\n\nNot a lot of vegan food options unless you are hip enough to fux wit avocado toast. But it's cool...I am happy with wifi and a good matcha. They have a good selection of non dairy milks cause ain't nobody got time for lactose intoleration.", "author": "Anya N."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-02-10", "description": "I stopped in to get an Americano. The espresso was weak \u0026 for $3.50, it was disappointing. The service was lacking, and here's why. I asked for a small Americano in a medium cup, \u0026 the girl filled the cup all the way to the top with water, so my drink was watered down. That's fine. I asked for another shot \u0026 paid $1.63. But when the girl at the counter seemed annoyed \u0026 bothered as if I made a mistake, it got my attention.\n\n            So she dumps out half my drink \u0026 adds the extra shot now, \u0026 now my Americano is too strong. Mistakes happen but when you have an attitude \u0026 you're paying over priced amounts, it's a turn off. Won't be back there again, as there's plenty of coffee places with better espresso. Some advice for the girl at the counter with the attitude; you're not doing anyone a favor, you're just serving coffees, so maybe in a world of trolls you might be cool, but in this world you're just another person serving coffee. Not that there's anything wrong with serving coffee. \n#countergirlswithbadattitudes", "author": "Tom M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-02", "description": "This place is your friendly, neighborhood coffee shop. It's a comfy and cozy spot to relax, do some work while grabbing a good cup of joe. Have kids? No problem, this place is very family friendly and even have a selection of books for the little ones.\n\nThey serve up Tobys Estate, which is roasted in Williamsburg, and Dough Doughnuts' pastries. The espresso tonic is my favorite off their menu. My regular go to cortado also doesn't disappoint! Their list of sandwich offerings is also great. A great snack for when your crunching away on the computer or for a pre-workout meal. \n\nAlan and his team are always happy and enthusiastic to meet anyone that walks through the door, and take great care in putting your order together. They really give a down to earth, kind, original New York friendliness and hospitality. You always feel welcomed. He's been here less then an a year but he seems to know everyone by name, truly becoming a member of the community. Great addition to the area!", "author": "Arthur L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-02-06", "description": "I stopped in to grab an espresso to end my lunch break and I was glad I did.  It was a pretty good espresso, the service was fast and attentive, and I was in and out.  Although I enjoyed it the espresso did seem a bit weak to me.  I would absolutely give this place a look again if I were in the area, but I wouldn't travel there specifically to go here.", "author": "Joe B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-22", "description": "This is my favorite neighborhood coffee shop. Their cold brew coffees and hot espresso drinks are perfectly crafted everytime. I've had several of their lunch sandwiches and breakfast toasts, and each one hits the spot. The huge added bonus is that they are very kid friendly - they have chairs  for use, a great selection of muffins/snacks for children, and a small table with kids books and toys. Other coffee shops should take notice -- excellent coffee, thoughtful food, and friendly service go a long way to create an inviting atmosphere. You guys rock!", "author": "Nish M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-04", "description": "I have absolutely no problem with their coffee. There food is excellent. I had the best tuna salad I've ever had in my life here.", "author": "TJ V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-08", "description": "We had the kale tonic and Nutella latte. Both absolutely delicious!!! The only thing is that the kale tonic was pretty pricey. Overall great though!!", "author": "Bailey A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-22", "description": "Nutella latte. So simple yet so brilliant. Delicious! This cafe carries delicious pastry from Dough, saves me the trip so yay! Interior is very crisp and clean, bright lighting good for doing work. Ample seating.\n\nWhat's not to love?!", "author": "Maggie L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-12", "description": "Really cozy coffee spot right off Exit 27 on the BQE and also nearby the Brooklyn Pier where I shoot hoops. I usually have my coffee black; the flavor was rich and smooth.\n\nPlus: If you need to get some studying or work done, there are tables and seats by the entrance and in the back with wall outlets and free WiFi.", "author": "Kevin H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-13", "description": "The americano is smooth but manages to have some boldness to it. The atmosphere is supremely tranquil and that goes well with the steady sips of caffeine.", "author": "Dominik D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-06-07", "description": "Mediocre cafe. It's a good place if you want to get work here done. Prices for food and espresso overpriced especially for the quality but what can you expect when you're in this neighborhood. ‍ \nWould I come here again? Sure, if I needed a place to do some work.", "author": "Michelle N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-29", "description": "Tried their cold press coffee and it was delicious. It's in my neighborhood so found a great spot to grab a quick coffee. I saw people on laptops(surprise) so I assume they have free Wi-Fi for the busy bees that must work and drink at the same time. Check em out!", "author": "Mike S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-29", "description": "I came to get some work done last Sunday and ordered an iced latte. The coffee was wonderful, smooth, and very well done, with the right amount of bitterness and cream. I was very surprised considering how small the place was but instantly wanted to go back whenever I wanted to get something done on a weekend. The place wasn't crowded and I was able to find a table as soon as I walked in. There were multiple outlets around and the wifi was stable and quick. Next time I'd love to try  the other lattes as well as their creative-named sandwiches. A great getaway in Cobble Hill!", "author": "Chanoot S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-16", "description": "Been going here since it's opened. Easily the best coffee in Brooklyn Heights / Cobble Hill. Friendly staff that take great pride in everything they serve. Coffee and food made to order and with care.\n\nCouldn't recommend any local business more than I do Expresso Me! Keep it up.", "author": "Raj P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-16", "description": "Great little cafe on the end of Atlantic (a short walk from Brooklyn Bridge Park).  The space is a mix of cozy and cute.  It was pretty full in the early afternoon.\n\nThe barista was incredibly nice with my off menu probably order.  The drink was pretty good, I tend to like my chai to be a slight bit spicy- but that is a personal preference. \n\nI would recommend the spot for a great spot to meet up and catch up with a friend.  It was very nice to go to a coffee shop where people are chatting and happy, instead of everyone on their laptops.", "author": "Marjorie W."}], "servesCuisine": "Sandwiches", "priceRange": "Under $10", "name": "Espresso Me", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "88 Atlantic Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/K7v6ji3V8FOPnzd4ktB-cg/ls.jpg", "@type": "Restaurant", "telephone": ""}