{"aggregateRating": {"reviewCount": 49, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-26", "description": "Espresso Me is now my favorite coffee shop in town. Their Nutella Chai along with their ice cream rolls are a must try! I love the presence this shop brings to the neighborhood and I have to stop by here for a double espresso before work as it is conveniently located off exit 4 on the BQE.", "author": "Jia C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-13", "description": "My new favorite place for lunch. I was here the other day with a friend of mine, that lives in the neighborhood.  She knows all the hot spots. The staff seems very pleasant and welcoming. Of course I had to try their hand rolled ice cream the other day. The best ever!!!! I'll be a regular for sure.!!!", "author": "Anthony F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-20", "description": "Really nice and relaxing spot that goes overlooked. I can always get a seat here and post up with a couple cups of coffee and get some work done. So many coffeeshops in the area get overcrowded that having this as an option as well is great.", "author": "Luis G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-01", "description": "Best coffee in the neighborhood hands down with a friendly staff as well. Had the matcha latte in my first visit and have been back for several more.", "author": "Hunter M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-20", "description": "A nice, comfortable café and a great addition to the Cobble Hill/ Brooklyn Heights area. The coffee is really good, free wifi, and the space is airy and sunny and a fabulous place to sit and read or meet a friend over coffee.", "author": "Amy C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-01", "description": "My new favorite coffee spot. The matcha latte is wonderful, the sandwiches are delicious, the prices are reasonable, the barista is friendly.", "author": "jonathan c."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-23", "description": "Great little coffee shop with good wifi, baked goods, Dough doughnuts and some simple toasts/sandwiches. Not crowded probably because it's a little off the beaten path - and it's relatively new. Definitely recommend!", "author": "Heather B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-10-17", "description": "cozy space, nice staff, but $3.27 for a small coffee is BONKERS. great cup of coffee but I won't be stopping by regularly.", "author": "amy w."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-29", "description": "Before I came here I was pretty much in a monogamous relationship with caffé mochas, but I am happy to say that I've seen the light and surrendered to the majesty of the Nutella latte. It's like candy in coffee form! So happy this place opened down the block from where I live - I love the warm lighting, relaxing music, fast wifi, and modern feel. And really....Nutella latte. What more do you need?", "author": "Dee F."}], "servesCuisine": "Sandwiches", "priceRange": "Under $10", "name": "Espresso Me", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "88 Atlantic Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/K7v6ji3V8FOPnzd4ktB-cg/ls.jpg", "@type": "Restaurant", "telephone": ""}