{"aggregateRating": {"reviewCount": 49, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-12", "description": "I used to buy coffee beans from a different shop near by but after getting a shitty service decided to look somewhere else. This place is great! Not pretentious, clean and their staff is friendly. Oh and you can get a really good cup of coffee.", "author": "Hanna K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-26", "description": "Very quiet, roomy space. They serve Toby's Estate. My latte was made well...they also have matcha on the menu. Service was prompt. Wifi and plenty of outlets available. I kinda wonder what was in this space previously...a hint of pet store/pet food is in the air (but I could be wrong.) This is a good option on your way to BK Bridge Park.", "author": "Adria C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-06", "description": "This is definitely the best coffee shop in the neighborhood. The baristas are super chill and the food is great. They recently started selling fresh juice which is a plus in my book!", "author": "San L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-21", "description": "I'm not necessarily a coffee connoisseur-- it's all usually good to me-- but I am obsessed with their iced Nutella lattes. May be too sugary or indulgent for some coffee purists but I find myself craving them all the time now. So happy I stumbled upon this place. Already been back a few times. (Bonus for their nugget ice cubes.)", "author": "Matt P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-22", "description": "Toby's Estate coffee, doughnuts and pastries from Dough, good light, clean and spacious with fast WiFi and reasonable prices. What more do you need? \n\nVery happy to see a new shop serving the southwestern edge of Brooklyn Heights, we were in sore need of closer options!", "author": "Ramesh D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-26", "description": "This is a really cool new place on Atlantic to get a coffee, beer, a sandwich... they have everything. Very kid friendly with great seating and some cool children's books to read while you relax or get work done. All around great place. Super friendly staff makes it all the better. Thanks guys and girls", "author": "Thejudge S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-19", "description": "Friendly barista. Delicious Toby Estate Coffee. Fast, free wifi. Comfortable seats. Donuts. Bagels. Good lighting.\n\nThis place ticks all the boxes!", "author": "Taylor P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-27", "description": "I love coming here on the weekends to drink coffee, write a bit, or read. This place serves great coffee and the staff is super nice.", "author": "Darren S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-29", "description": "Great place to study or grab coffee with a friend. Its conveniently located, spacious, and serves delicious coffee. The staff is extremely nice as well!", "author": "Pearl S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-16", "description": "Good coffee, fast WiFi and a friendly staff. My favorite place to get a little weekend work done", "author": "John C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-02-16", "description": "Don't try and go in the morning.\n\nThey claim to open at 7:00am, but usually aren't. They're also often not open at 7:15am, and sometimes not even at 7:30am. \n\nI keep trying because I do really like this place otherwise, but going by today well at nearly 8am and seeing the place completely closed was the last straw.", "author": "Michael W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-09", "description": "Such a cozy unassuming coffee shop. They have the best coffee and staff there. A little off the beaten path but definitely a great addition to the area. Unlike some of the more pretentious coffee shops in the area, it just has a really calming feeling. Oh, and free wifi too!", "author": "M F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-05", "description": "I really like this place; everyone is super friendly and the drinks are great. My only issue is time. If you come in and order a sandwich, there's only one barista so they have to go in the back to make it, and then the line starts forming and it takes forever. Might I suggest two baristas always in the shop during the day? It might help with that issue. Otherwise it's a great little spot.", "author": "Katie G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-09", "description": "Expresso me have everything you can ask for in a coffee shop. They have a large variety of drinks, pastry, sandwiches and even dessert which is some other cafe in the area lack. I recommend checking out this cafe which is not a far walk from the Brooklyn bridge and right of Atlantic Ave exit off BQE if your driving.", "author": "Gerrick T."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-11-05", "description": "Came here with my wife and daughter for lunch (eat in). Ordered, then 15 minutes later they come out with one sandwich in a to go box and say they don't have bread for the other two sandwich. Offer to refund the two other sandwiches. Seriously? First off no food came out between us ordering and them telling us they ran out of bread. Second, they made one sandwich and had to know there was no bread for the other two. Third, refund all three sandwiches and give us the third. We obviously have to go somewhere else to feed the rest of my family. I refused the third sandwich and they refunded just the three sandwiches - not the coffees - with an attitude. Maybe a fluke but simply unacceptable.", "author": "Eric W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-01", "description": "super chill jazz music. Excellent wifi and lots of yummy treats and drinks from Dough, Toby's Estate and T2. Great place to knock out the work, meet a client or chill with friends and colleagues", "author": "Ana P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-26", "description": "Had to get some work done and decided to check this place out. I got a cold brew coffee and the cobbler sandwich. Both were great. I sat in the back by some outlets and knocked out a good hour worth of work. The place was very clean and had a great vibe.", "author": "Matt N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-20", "description": "Espresso Me has the greatest avocado toast I've had so far! They have a selection of delicious pastries and Toby's estate coffee. I always come here to get work done and the wifi is always working well. My favorite drink is the Matcha Latte.", "author": "Amy T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-03", "description": "Great addition to the neighborhood. Lovely little coffee shop with delicious drinks - you must try the espresso tonic! I'm definitely going back for the Nutella Latte, sounds yummy. Love the table with children's books, perfect for our toddler. Friendly and fast service (especially for a one man show). The place had a steady pace of customers and every table was taken so the barista might need some extra help soon. Happy to have a new go-to spot in our hood.", "author": "Melissa T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-23", "description": "Love their doughnuts. Lattes are on point. Will be back when it's warmer for their Thai ice cream.", "author": "Ken M."}], "servesCuisine": "Sandwiches", "priceRange": "Under $10", "name": "Espresso Me", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "88 Atlantic Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/K7v6ji3V8FOPnzd4ktB-cg/ls.jpg", "@type": "Restaurant", "telephone": ""}