{"aggregateRating": {"reviewCount": 41, "@type": "AggregateRating", "ratingValue": 2.5}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-06-11", "description": "The food here tasted nasty, and was over priced at that. The old woman who works here was rude and impatient to me and the other customers. The only good thing about this place, was the Air conditioning, which kept me cool as I tried to force feed myself this garbage...", "author": "Lisa X."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-10-16", "description": "Tasteless slop. Soggy \"crispy tofu\", doughy dumplings, watery chicken noodle soup. Got the order wrong too. The dumplings were supposed to be spinach and the tofu was supposed to be spicy. As much as I mourn the severe downward curve of quality at Fortune House, my go to for many years, their new owners clearly have  cut corners and have been unconcerned with who they hire as chef. So I was willing to give Chu's a try after skimming the first few reviews. After rereading them this morning I should have known better that to pay more attention to the star ratings... Fives and Fours?! Had I read the reviews a bit more closely I would have picked up on a few clues...\n\n\"I recently moved to the DUMBO section of Brooklyn Heights from the Upper East [Snob]\"...Seriously? Five Stars? Both, equally hilarious had I paid attention... I wish we could rate reviews...\n\nMan, I'm grumpy today. I rarely use Yelp, but I had to speak up about Glu's reviews that lead me wrong!\n\n\nSo sad that lower Brooklyn is so close but so far from Chinatown...", "author": "Datan B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-07-14", "description": "Terrible ... the only reason I go there about once a month is that it is around the corner from my office.  They don't even give you a decent amount of napkins ... you have to fight to get a few of the tiniest thin napkins you will ever see. I usually feel sick after eating here (possibly MSG?), the employees are not very nice and the dining area seems dirty and often smells like cigarette smoke.  Other than that, it is \"Gourmet\" all the way!", "author": "Carl E."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-11-24", "description": "Totally a lunch takeout spot. I wanted something not deep fried, so I got the chicken with broccoli and a hot and sour soup. I think I may have gotten the ginger chicken instead, because I asked how that was prepared before ordering, but either way, it was pretty good. Not the most chicken I've ever gotten in an order, but it seemed like decent quality chicken. The hot and sour soup was, again, totally average and fine. I was in and out with my carry out very quickly.", "author": "Mira S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-06-18", "description": "We normally order from this place for delivery at work for lunch.  The food used to be pretty good up even though the prices had gone up a quarter more since the last time we've ordered.  We ordered our lunch there again after a month and realized that their portion has greatly downsized and I thought something was different.  A coworker of mine thought I was probably imaging it but I was 100% sure that I wasn't.  Ultimately, we did come to a conclusion that the order seriously gotten smaller.  For the price we have to pay and the size portion, we stopped ordering from here since we were not getting our monies worth.", "author": "Eva M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-12-24", "description": "Eurgh, just received our delivery, wrong items have been sent and the food we have received is tasteless salty yuck. Really dissapointed. The skirted beef was fatty and overly salty, no idea what the chicken dumplings taste like as we received some deep fried triangles filled with what smelt like fishy cream cheese. We didn't even get chopsticks despite asking for them! Chu's next time I'll Chu's somewhere else!", "author": "Melissa B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-01-26", "description": "I am dumbfounded as to how this place has an average rating of 3.5 stars. I can definitely appreciate greasy, so-bad-it's-good Chinese food as much as the next guy or gal, but this was inedible. My General Tso's chicken was dry and tasteless, my egg roll was more akin to a soggy toilet paper roll stuffed with nondescript \"food product\" shaved into cabbage. And they forgot my soda to boot. Do yourself a favor and order from any of the other dozen \"deliciously shitty\" Chinese food establishments in the area.", "author": "Rebecca N."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-06-28", "description": "Thank you for giving me the opportunity to say \"yes i had the worst chinese food ever... \"I ordered scallion pancake, spare ribs, and general T shrimp.  If you own Chinese food, you have to know general idea how to cook!!!! But instead, it taste like you looked it up in internet how to make chinese food for the first time.... How horrible it was, i ended up eating instant noodle... Sad.", "author": "Andy K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-05-07", "description": "DO NOT ORDER HERE! I've been ordering here for YEARS via GrubHub because it's quick and convenient and located in the area of my work place I was absolutely MORTIFIED when the associate that works in the front told me \"you always order these small orders and GrubHub charges us a two dollar fee every time you come, call us in and order\" how DARE she dictate to me how to place my order when I am a PAYING CUSTOMER. If she has a problem with GrubHub then she needs to cancel her service!! I have given so much money to this establishment and in turn was treated like absolute DIRT. I always wondered why this woman never greeted me anytime I came in she would just hand me my order since I've always ordered online. I am so disgusted, I've made a complaint to GrubHub and I will NEVER be ordering from this establishment again! I advise you to do the same because their customers are not valued or respected AT ALL!", "author": "Simone M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-04", "description": "This is 'American' Chinese food, but when my boyfriend and I are in the mood for that, we get it from Chu's. I have a pretty standard order - steamed pork buns, General Tso's chicken, and occasionally scallion pancakes. Boyfriend usually gets pork dumplings and beef and broccoli. The portions are big and everything is pretty cheap, so it usually ends up being two (or sometimes three) meals for both of us. The spice on the General Tso's is great, and I don't think I've ever been particularly disappointed by anything we've gotten from them. Best of all, it gets delivered super, super fast. I've had my food show up in (literally) 15 minutes. They're like delivery superheroes.", "author": "Peggy N."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-10-07", "description": "Am in the area often and have been eyeing Chu's for some time. Turns out it was exactly what I was expecting (decent, non-offensive, mediocre Americanized Chinese food) but not quite what I was hoping for (a gem masquerading as a local hole-in-the-wall). \n\nWould I go back? Maybe...I'd like to work my way through the menu to see if there are any outstanding wonders. What I tried (egg roll, chicken lo mien and roast pork egg foo you --yes, purposefully \"American') wasn't all that special. The lo mein was the best of the 3...well cooked but bland. The egg roll was disappointing (crispy but no real flavor and dry on the inside) and the egg foo young tasted of old oil...the gravy was decent, though.", "author": "Craving Cholent X."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-27", "description": "Pretty good fast food Chinese in Brooklyn. Second time here and this time I got the General Tso's Chicken, Lo Mein and Bourbon Chicken with a side of hot and sour soup. It's a lot of food and perfect if you are craving some guilty pleasure chinese food. The hot and sour soup was rich and tasty and nothing was super greasy like other fast food chinese spots. Ambiance and service aren't anything special but for take out all you need is good food at reasonable prices and you are good to go. It continues to be my go-to Chinese takeout spot in my work hood.", "author": "Cynthia M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-27", "description": "There are days when I want to eat something from anywhere but Montague Street, otherwise known as that strip of eateries so close to my office that it's my default.  Today was one of them.  I wanted some down and dirty Chinese takeout.  Enter Chu's Gourmet.  Not bad.  Definitely a takeout joint, rather than a gloried fake-Chinese food \"restaurant\" the likes of Andy's or Lichee Nut.  Unlike some holes in the wall, there's ample seating in the back.  The hot and sour soup, general tso's chicken, and lo mein were all solid.  The quantity is amazing, more than the aforementioned Montague spots.  The only minor con?  I kinda miss having the fortune cookie and crispy noodles.", "author": "Andrea L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-18", "description": "Love this place. It's right around the corner of court and having been there numerous times, they really start to recognize you and the service just keeps improving every time I go. I eat out a lot and this place offers comfort food from my own heritage. They have a separate menu of traditional Chinese food if you ask for it! \nTo my knowledge, I believe the restaurant is named after the owner. It's just like when I walk around bay ridge and I see nail salons named after someone, except being from an Asian culture, I think they stuck with their actual name which happens to be Chu. I don't think you should discriminate on the name. \nAs for the rice, one time I ordered from seamlessweb and I hadn't indicated that I wanted rice so they didn't put it in. It is my own fault in part. When I call they usually ask white or brown. If it's any help, my favorite dishes are walnut shrimp, tangerine beef, and they make amazing fried rice. HOWEVER, to each their own. \nGive it a try, maybe you'll like it too.", "author": "Samantha Z."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-05-04", "description": "I don't know any reason for the place to be named what it is. I had delivery from this place and the delivery experience was shoddy to say the least. In spite of a gratuitous tip, the delivery guy insisted on a greater tip. Also as soon as I got upstairs, I noticed that my full order did not have rice with it. NO RICE!! The place failed on the most basic of levels!\nThe food was utter crap. My friend paid 10 dollars for what was, at best, 4 ounces of chicken. I will never order from this place again and recommend the same for anyone who wants even decent Chinese food", "author": "Divya P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-31", "description": "This is such good ghetto wok. Disgusting American Chinese food that hits the spot without being overly greasy.", "author": "Yana B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-12-09", "description": "In New York, Jews have Chinese food on Christmas.  Well I have Chinese food when I'm *decorating* my Christmas tree. That's my tradition.  But since moving to Downtown Brooklyn, I've ordered some really, really bad Chinese food.  But last night, Chu's was surprisingly decent.  Nothing amazing, but the General Tso's Shrimp wasn't bad, and the broccoli was still a bit crunchy, not oversoggy with sauce.  Plus, it came SO fast.  And really, that's half of what you want when you're ordering Chinese, right?", "author": "Katie Z."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-01-27", "description": "I'd give this 2.5 if I could, but since I can't I'm rounding down. Food was incredibly bland and somewhat oily. Scallion pancakes were tasteless, and the sesame noodles were really dry. I had such high hopes too, because of all the positive reviews. But it looks like I'm destined to never eat decent Chinese while in this area of Brooklyn.", "author": "Becky S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-12-11", "description": "This is my children's favorite chinese restaurant. They love this place! The food is always super fresh, and my kids are very adventurous. They try and enjoy things my husband I would never thing of touching. The owners adore my children since they love to taste everything. My kids tend to make a mess, and we can stay awhile, and everyone is always nice to us. The prices are fair, but the food is really outstanding. I do recommend this restaurant. It really is excellent chinese food.", "author": "Susan M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-20", "description": "First time ordering delivery from here and it was very good. I got the moo shu shrimp and eggplant in garlic sauce and both were great.", "author": "Amanda D."}], "servesCuisine": "Chinese", "priceRange": "Under $10", "name": "Chu’s Gourmet", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "82 Livingston St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/gthe7y-8ETNNq4oaZEG1Ww/ls.jpg", "@type": "Restaurant", "telephone": "+17182608870"}