{"aggregateRating": {"reviewCount": 41, "@type": "AggregateRating", "ratingValue": 2.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2019-01-10", "description": "My family has been ordering from here ever since Andy's closed on Montague. I challenge you to find better Chinese in the neighborhood. If you do, let me know!", "author": "Jennifer B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-30", "description": "Been coming here for about 9 months on occasion. It was always above decent Chinese takeout. Now, I will never go back.  I ordered my food and luckily I checked it and pointed out it was wrong. She rolls her eyes, says something in Chinese to the cook and they re do it. For the record, they were dead. Nobody in there at all. Redoing a customers food that you messed up doesn't warrant what happened next.  I was very reluctant about the meal after this. I get home and open it up, had a few bites. I sift thru it carefully...and carefully I find a 1 inch black hair.  Keep sifting, another and another.  Nah, I'm good.  Good luck if you decide to gamble on chewing on some greasy Chinese cooks pubs.", "author": "Pat C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-28", "description": "A star rating. A must try. General Tso's chicken was so good. People very nice. Food was yummy. I will be back", "author": "Steven L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-15", "description": "I placed an order through seamless, for the 3rd time this year. Received a call from the restaurant a few minutes later to tell me they will not deliver to me because all of a sudden my address is out of their zone. The woman was incredibly rude about it and then told me I had to deal with getting my money back through seamless. They were not going to handle it. Screw them. Horrible customer service.", "author": "Rain S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-05-22", "description": "From my last review, I was satisfy enough to eat here. As I made several more trip to this place, my desire for food here dropped off exponentially. The noodles are just huge grease balls and the general tso's is mostly just breading. Some of the times, the chicken is over fried where it's a solid rock. I have also been very gassy after eating from this place. Sorry to say this, but I have to let you go from my life.", "author": "Jacky C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-03-15", "description": "Well let's get right to it. Decided I wanted Chinese for lunch since I hadn't had breakfast this morning. Order for a co worker \u0026 myself. Once my food had Arrived I instantly saw that they had forgotten the chicken that went with my steamed broccoli \u0026 garlic sauce. They delivered my wings 20 minutes later after that rude lady kept hanging up on me as I tried to explain that they had forgotten the chicken. 15 minutes after I dealt with my last customer it's time to indulge in what I'd assume great Chinese American cuisine. Nope ! That doesn't happen. As I open up the steamed box of chicken I enjoy a piece. As I lift for my second piece of chicken long behold there's a roach laying dead under the drum of El Pollo - The end! Will never order from here again.", "author": "Blair T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-08", "description": "Very underrated on here. Very good food, and a lot of variety. Very popular at lunch with nearby workers, so you know it's fresh and the prices are fair. These are some of my favorite roast pork buns in the city- whenever I'm in the area I get a bag full!", "author": "Cameron G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-03-14", "description": "Placed a delivery order. \n\nGourmet????  Ha. That's laughable!!\n\nThe food came about an hour later and it was cold.  My chicken and broccoli was disgusting. The brown sauce was thick and oily.  My rice was hard as if not thoroughly cooked. \n\n2 stars for my ice cold Coca-Cola and the packaging for the utensils and fortune cookies. \n\n1st \u0026 last time eating from here.", "author": "Cassie V."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-07-27", "description": "Ordered large chicken noodle soup with extra hot mustard.... No mustard to be found in the bag, but wait for it.... I did get an extra long hair in my noodle soup !", "author": "Lenise g."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-27", "description": "This review is for their insanely fast Seamless experience. They deliver consistently fast, steaming hot food. They gotten to Dumbo in under 15 minutes. It's amazing. The food is well packaged. \nMy faves: bourbon chicken, generals tsos (it's tender real chunks of chicken fried and seasoned well), green beans and beef. \nSkip: the dumplings are a little too doughy and don't taste handmade.", "author": "Larry L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-19", "description": "From the outside, you would assume this place to be the usual mom-and-pop Chinese take-out.  However, it's larger than most take-outs.  Actually, this place is more like a restaurant because they have lots of seats along with restrooms.  No waiter service, though.  \n\nAs for food, they offer the usual dishes with rice, noodles or soups.  The lunch crowd is huge, so don't be surprised if you have to wait a few minutes to order.  They have a decent lunch and dinner menu with very reasonable pricing.  My recommendations would be the beef chow fun, wonton soup and fried chicken with rice.", "author": "John S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-05", "description": "Beware the dumplings. \n\nNot because they are bad, I actually found them to be quite delicious.* But I bit into one and shot porky juices across the room onto my girlfriend's belongings. She was irate and repeatedly accused me of biting with my mouth open** right up until the point when she did the same thing.\n\nSo I think the dumplings are packed a bit too tight.\n\nOther than that, Chu's Gourmet is exactly what I expected. It's Americanized Chinese, and they deliver hot and quick. The sort of spot that serves better than decent General Tso's Chicken, and Sesame Chicken that is exactly the same dish with a few sesame seeds sprinkled on top. \n\nIt's cheap ($6.50 all day for a dish with rice), and it satisfies a craving.\n_______________\n\n*About as good as they get outside the little dumpling houses that specialize. The skin could be a bit thinner and less doughy. \n**Please explain to me how to bite with your mouth closed.", "author": "Peter D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-04", "description": "Order the salt and pepper poke chop, kind of salty. There is alot ppl waiting when i get in. Take them like 20 minutes, to get out the store with the food i order. Will come back and try other.", "author": "John C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-03-05", "description": "Ordered small, yet they gave and charged for large items. Delivery guy had a horrible attitude, I called the restaurant, they didn't even listen and hung up.\n\nNever coming back here again. Food is greasy, americanized, garbage.", "author": "Jonathan J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-20", "description": "I've eaten in a decent amount of Chinese places, and I'm poor so I specifically look for the hole-on-the-ball variety. I've had some very fine food in my life as well so, my standards for decent food aren't skewed because I'm poor.\n\nI read another review that said it wasn't very inviting inside, and I disagree- its actually very spacious inside, its quiet and there is no tv playing, which pleases me personally very much and is something I really take note of. It seems a lot of people get take out here, and I'm not surprised because this is Brooklyn heights, so I have the whole place to myself.\n\nThe food was prepared very quickly, so much so that I was at first skeptical of its quality, but digging in, its really alright, I've had much worse and would be very pleased to have a place like this in my area. I got the kung par chicken, which I get often, and its definitely on and above the acceptable range. The nuts taste cooked, or something, which is really the characterizing feature of the dish, I think. Good portion as well.\n\nThey seems to speak English fine as well.", "author": "Max F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-27", "description": "This is the one thing I really miss about living in the UES? Having multiple options for good, quality Chinese food delivered right to my doorstop. Now that I live in Downtown Brooklyn, my choices are slim and this is the ONLY acceptable Chinese food delivery on Seamlessweb.com. \n\nThe roast pork buns are very good, I'm addicted to their Moo Shu Roast Pork and my husband is a fan of their sesame chicken.\n\nThank goodness for Chu's gourmet!", "author": "Shu Jin S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-05-14", "description": "I made an order and asked that no bean sprouts or other vegetables be added besides the broccoli that comes with the beef broccoli. When the food gets here the food has the very things I DID NOT ASK FOR. I call them back and the lady tells me \"it was a special order. Sorry.\" And hangs up. I came to the restaurant personally and brought the food with me to show them and tell them I found it disrespectful what they did.. Now the tell me being that it was a special order I had to pay them $2.00 for vegetables I didn't want added. None of that was stated on the menu nor the site. Then they proceed to make me feel like I don't matter by telling me the will remake it but in future not to order there again???? It is safe to say I will not order again. I have no care for their rude behavior and overall handling of what they did.", "author": "Bowser F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-12-11", "description": "I had jury duty nearby and this was the closest Chinese restaurant to the courthouse on Adams Street. I waited patiently on line for a few minutes, placed my order (vegetable fried rice with chicken and broccoli), and stepped to the side. Ten minutes passed and my meal wasn't prepared. The employee forgot and did not realize that I wasn't taken care of until she saw me still standing there. My meal came to a grand total of $6.80 and at least included a can of soda since the lunch specials start at $6.25. The food was pretty okay with me. The place was clean and busy during lunch time because of its proximity to the courthouses in downtown Brooklyn. I think the customer service could use a little improvement. In fact, there was a verbal disagreement between a customer who had the same experience and an employee. Overall, I had no major issues.", "author": "Kristia B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-07", "description": "Thank God for Chu's! After living on the UES for 3 years I was ready to commit myself. I was tired of the noise, the crowds, and the lousy food. When I'm depressed I like to lock myself inside put on sweats, watch bad movies and order Chinese. For this reason, Chinese food is important to my life. When I'm craving Orange Chicken, it needs to be authentic and scrumptious, and like the UES most things appear more authentic than they actually are. I literally have tried every Chinese food delivery on the Upper East Side, most of them were greasy, seriously lacking the sodium my PMS craved, and quite frankly, I usually felt like I was eating mystery meat. Ok, they weren't all this bad, but let's just say there were more bad than good.\n  \nWe finally moved to the DUMBO part of Brooklyn Heights and discovered Chu's. Food arrived within 10 mins. after I hung up the phone-no joke. The chef must've been throwing my order into the pan as they were taking my order b/c it came that fast!  As I bit into my Kung Pao, I could see the confetti being poured from the ceiling of my mind as the party in my mouth got started. Yes! I was this happy! Like a long lost dog being reunited with his bone-I was so happy to have great Cantonese back in my life. Hey, when you've had Authentic Americanized Chinese food in San Francisco, your palette too will become this spoiled. Eat at Chu's if you're in Brooklyn, if not, try Wa Jeal, on the PooES. I am now a devotee to Chu's. Are you there Chu? It's me, Erin, and you have changed my life.", "author": "Erin T."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-03-21", "description": "Gourmet? How misleading...the Chinese food here is such a perversion of my culture. I should have seen the red flags a.k.a. the cheap fortune cookies packed into my take-out bag. The taste is not authentic or gourmet, and it is not very good. It's cheap, Americanized Chinese food...in Brooklyn.", "author": "James W."}], "servesCuisine": "Chinese", "priceRange": "Under $10", "name": "Chu’s Gourmet", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "82 Livingston St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/gthe7y-8ETNNq4oaZEG1Ww/ls.jpg", "@type": "Restaurant", "telephone": "+17182608870"}