{"aggregateRating": {"reviewCount": 52, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2019-01-08", "description": "I was tired of ordering at Buffalo Wild Wings while in the area so I seen that Pelicana was a new spot in the area specializing in chicken. Okay I thought... finally something different and not out of my comfort zone. I placed my order by phone as the young lady was very nice and soft spoken. She told me it would be about 25 minutes before it was ready for pickup. I ordered two boxes of boneless chicken with spicy barbecue sauce and the other plain crispy with sauce on the side. I drove around a bit to kill some time. As soon as I arrived I was greeted right away and the inside had a welcoming chill vibe to it. Kinda like a very small calmer Buffalo Wild Wings but Asian style. Cool right. I paid for my food and asked to use the bathroom which by the way had a beautiful decor that was exceptionally clean. I then grabbed my food and left. As soon as I got to the car I really wanted to taste it to see how good it was. That is when things went left....\n\nSo, the chicken had dark meat and mostly batter. The so called spicy barbecue was not spicy at all it was sweet. Not good at all. I am convinced that it may not even be chicken. You can try it for yourself because maybe it was a late bad day when I went. I really had high hopes overall but I may give it another go one day...Maybe.", "author": "Serina J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-24", "description": "This was my first time ordering from and trying this restaurant out. My wife and I were very pleased with the service and the food. The chicken was moist and tender. The avocado salad was excellent. In all we will be ordering from them again.", "author": "Mel C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-04-14", "description": "We ordered the baked garlic wings and the baked  spicy bbq. They didn't taste baked at all. More like fried with no flour . The garlic wings were not good at all. Way to sweet. The spicy bbq was better but not by much. They both had to much sauce. It was like having sauce with wings not wings with sauce . We will go back but just not get the wings . Maybe the sandwich instead. I will give them one more chance.", "author": "Dia A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-11-19", "description": "Candelight can feel obnoxious when a place isn't that well-run. Among other things, I would have liked more clarity on the fact that one of the top-listed items, the half chicken, wasn't available. But even after I decided that Pelicana was a glammed-up BK bar in restaurant clothes, the wings quieted my angst. I got the sweet-and-spicy version, medium level.", "author": "Josh B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-01-18", "description": "Lovely, trendy spot. Good location. Great service. Great portion sizes. Will definitely come back with a group of friends.", "author": "Vanya M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-17", "description": "Very good atmosphere! I ordered the spicy chicken sandwich and a mojito it paired perfectly. Service was very attentive and helpful", "author": "Pajtim N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-10", "description": "So happy to finally have a korean chicken spot in brooklyn! Now I won't have to travel all the way to the city for my cravings! Everything was so good and super easy to share amongst group of friends. All the staff here were super attentive and friendly. I really appreciate that given that they were busy at times. (nothing ruins a good meal like a bad attitude)\nThey have multiple TV's with different games so it's perfect for the sports fanatic. If you're like me, who only watches sports cus of their boyfriend, they also play a great mix of music. \nGood food + drinks + great ambiance. Definitely will be back!", "author": "Mindy Y."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-11-01", "description": "When they say \"whole chicken\" versus \"boneless chicken,\" they must mean \"intact\" or \"bone-in\" rather than an entire chicken, because there's absolutely no way our $27 \"whole chicken\" platter was an entire chicken -- there were two small pieces of thigh which put side by side weren't even as big as one wing, and the four pieces of breast combined were barely the size of one whole breast let alone two whole breasts... The chicken, as moist and juicy as it is, is covered in so much batter, as light and flaky as it is, that our $27 \"whole chicken\" just wasn't filling, definitely not enough to satisfy two adults, or perhaps we were just expecting more food, what we received wasn't worth the price... To be fair, my expectations of portions \u0026 prices \u0026 quantity \u0026 quality are compared to my experiences with other Korean fried chicken ioints (KyoDong, KyoChon, BonChon, TurnTable, Unidentified Flying Chickens, etc) rather than KFC or Popeye's...", "author": "David L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-08", "description": "I've been searching and searching for Korean fried chicken as good as I had in Korea, and FINALLY I've found it.\n\nWings are cooked perfectly. Meaty and juicy.\n\nWe had crispy fried plain and crispy fried with the level 3 spicy sauce.\n\nFry batter is super crunchy and not to oily.\n\nSpicy sauce was radioactive. So hot I got the hiccups. So good though that I wound up killing the whole box...which killed my colon the next day. No regrets, though. Perfectly balanced sweet and heat and tangy. Next time, though, I'll do level 2...", "author": "Dustin G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-26", "description": "Had the spicy fried chicken combo and we loved it! \nSauces are great (I preferred the spicer one). \nAnd service was really point on: fast, responsive and friendly. \nI should have taken photos of the platter to share, but I am the type that just loves to eat the food and can't wait to dig in", "author": "Candice R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-02-15", "description": "The food and atmosphere in this place is great super chill the only bad thing I have to say is that today I was there ten minutes before opening time the door was open and the employees were sitting around so they had nothing to do but when I asked them if I could sit down they told me they open at 5. they made me wait for ten minutes outside and didn't even let me sit down and wait. I thought this was very rude because I was only ten minutes early and I am a paying customer so they should at least let me sit down while they fully open. They are not smart because if I was another person I would walk and they would lose revenue I hope they fix this problem in the future.", "author": "Jessie J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-03", "description": "Best wings in the area,  especially the spicy soy. Dont bother with anything but the chicken, but the wings are fire", "author": "Adam K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-11-10", "description": "They don't have WiFi and they HAVE to \n\nOther than that, the foods is very good and reasonably price. It's an awesome addition to the neighborhood. \n\nBut:\n\nWiFi \n\nWiFi\n\nWiFi\n\nWiFi\n\nWiFi", "author": "Thomas W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-04", "description": "I live a little further away from their delivery zone but I called anyways. They caught scent of how hungry I was and agreed to deliver- forever grateful for the hanger prevention. \n\nIt's honestly, the best fried chicken- if arrives hot \u0026 crispy. \nYOLO so order that chicken", "author": "Yena K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-03-02", "description": "Disappointing. \nIt took over 5 minutes after being seated to receive a menu and then a request to receive water.\n\nOnce the waiter was flagged over, I finally ordered. Parts of the order did not come. Although watching the servers bicker over delivery orders was a source of entertainment, I did not find it as amusing when it came to who would bring our food. To add, the corrected order was sent to the wrong patrons.\n\nNo one asked how the food was or if it was correct. \nIt was clear, service and hospitality was not the​ main concern. When trying to use the restroom, it was barricaded​ by an air-conditioner and high chairs. The server gave attitude.\n\nThe food was fine. I wouldn't call it premium Korean fried chicken. But it was fine. \n\nI would not usually give 1 star. It kind of pains me, but this was not a busy night. The servers were not concerned about the people in the establishment​. Everything was the problem, except for​ the food which was fine.", "author": "Meagan W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-16", "description": "Hidden gem in clinton hill. Love that they play music and are always showing the game. Been there twice and the staff is always friendly and welcoming. Went there tonight and tried the grilled bbq wings. They were amazing!!!", "author": "Corey F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-15", "description": "The best fried chicken in brooklyn!\nI got boneless fried chicken with honey garlic sauce", "author": "JB I."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-03-12", "description": "Service is trash. Waitress ignored me for 5 minutes when I walked in. There were 3 tables, it wasns't busy. She is rude when she takes my order and demands I pay before I get my food:?! WTF?! Hell no. It was like \"you buy or you get out blacky\" 1989 at the Korean deli. (the other  customers had to ask for their checks when they had finished eating) As the only black person in the restaurant it felt suspiciously racist. Then after I get my food, never to be seen again; tried unsuccessfully to get sauce she averted my gaze, I got up and left.", "author": "Kwame R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-01-19", "description": "I been here a few times and I like it a lot. The staff is so friendly and always greet customers warmly. The decor is simple but tasteful with big TVs behind the bar. This makes dining alone More entertaining. I only had the spicy chicken sandwich and it's delicious. The chicken is tender and the skin is crisp. I have heard that the fried chicken (Korean style) is very good but I have not had it yet. This place place is worth coming back to again.", "author": "Scott K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-11-03", "description": "This place has great food but could work a bit on Customer service . One server was extremely helpful and sweet while the one who took my order was very cold. I will come again because they do have very good Korean fried chicken! The place is a little loud at night as it has its own bar. Overall cool spot.", "author": "Johanne A."}], "servesCuisine": "Chicken Shop", "priceRange": "$11-30", "name": "Pelicana Chicken", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Greene Ave", "postalCode": "11238", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/IxRflTSgErWQi39UhA8asA/ls.jpg", "@type": "Restaurant", "telephone": "+17185676060"}