{"aggregateRating": {"reviewCount": 52, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2019-01-14", "description": "First time even hearing of this place . My son wanted chicken wings and our usual wing spot was crowded since the football game was on . We tried it and loved it ! The staff was very nice and fast . They had a large tv and 2 smaller tv's showing different games . The wings were cooked well and had a couple of sauces to choose from .  We had wings , fries and cheese sticks . Everything came out fresh and piping hot ! Everything tasted great ! Only downside was paying $2 for sauce", "author": "Tenisha C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-05", "description": "Chicken sandwich is worth 5 stars. Seems like they don't quite have all the details right - music and outside branding, but the food is great, price is right and live sports is awesome. I hope this place takes off.", "author": "Dre F."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-11-02", "description": "This place encapsulates everything that is wrong with the contemporary culinary culture characterized by price-gougers, swindlers and underwhelming overpriced mediocrity. They're moving basic, bland, average, ordinary and chinsy chicken sandwiches (no fries) for $10 a pop. And of course they adopt the obligatory scam of charging you extra for toppings. \n\nHalfway through eating their signature chicken patty on a bun, I was out of chicken. So essentially, I had a half chicken sandwich and then a half onion sandwich, which I had to buy the onion. I should've just purchased a whole pack of Perdue patties for a fraction of their exorbitant and unnecessary prices.", "author": "Joseph R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-01-10", "description": "We ordered soy and spicy soy chicken with a side of garlic sauce. The chicken was ok as I've had better. I felt the chicken was too fried to my liking. I usually prefer it crispy and not so fried that it sticks to the meat. \n\nWould have it again but wouldn't be my go to.", "author": "Tony L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-01", "description": "Whoa. I just stumbled across this new little gem in Ft. Greene .. I ordered the boneless half chicken with the honey garlic sauce.. nice crisp on the chicken and really good sauce. The bartender  David was really quick on hour requests.. and the best part is that they have multiple TV's to view the view the games after work. I'm definitely coming back for that chicken sandwich I've heard about.", "author": "Terrin P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-02-24", "description": "Overrated. Expensive \u0026 the meat has a lot of gristle and breading. Skip it \u0026 go to ufc in queens.", "author": "Z B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-27", "description": "This is my favorite Chicken place in town.\nFried chicken and french fries are really awesome:)\nNo need to explain.\nJust come and eat!\nI bet you will like it:)", "author": "Yong Wook C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-10", "description": "Great Korean chicken spot. Food was delicious and they also had giant screens, great for watching sports.", "author": "Ed C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-01", "description": "The food Was amazing. I ordered the half boneless chicken with sweet \u0026 spicy sauce and honey garlic on the side with soy dumplings. I was more than pleaseed. Dave the bartender was great. He makes the best Long Island Iced tea", "author": "Malcolm N."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-11-10", "description": "This is probably the worst fried Korean chicken I've ever had. The breading is awful. If people like this chicken they definitely don't know what good Korean fried chicken is. I will never visit this place again and it is literally only 1 block from my house. The service is good though. Nice folks. But the good is terrible.", "author": "Ingrid P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-25", "description": "I liked the restaurant, it's nice on the inside. The staff is incredible!! And the food is good!  They have a bar, table service and a big screen TV!", "author": "Alexa B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-04", "description": "Great food, chicken is tasty, unpretentious vibe, music is good. Come here and have a good time already.", "author": "Queenton L."}], "servesCuisine": "Chicken Shop", "priceRange": "$11-30", "name": "Pelicana Chicken", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Greene Ave", "postalCode": "11238", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/IxRflTSgErWQi39UhA8asA/ls.jpg", "@type": "Restaurant", "telephone": "+17185676060"}