{"aggregateRating": {"reviewCount": 52, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-14", "description": "When I tell you I've been legit dreaming about this chicken since I had it this past Saturday .....\n\nDon't read anymore reviews, just GO. I promise you won't be disappointed. I got the original wings with garlic sauce on the side + ranch. Seriously life changing.", "author": "Daneca R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-24", "description": "Great spot in fort Greene Brooklyn. The chicken wings are to die for! They are extremely crispy and juicy and are the perfect thing if you are craving wings and beer. \n\nI really loved how crispy and fresh everything tasted and the fries were super crispy and delicious. The staff was attentive and fast service.", "author": "Noelle M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-04-17", "description": "The place is suitable if you want to eat in or take out. It's nowhere to celebrate your birthday, instead you can grab a quick bite with a friend or sit alone at the bar...yea they have one, and it's cute lol. They are more than likely playing the latest rap and hip hop music, which I loved; and there's also some TVs plastered around the place so if there happens to be a game going on while you're there you can watch it. \n\nAs for the chicken I ordered the spicy crispy wings. It was exactly what I expect, which is a good thing. I also ordered some sauce, I don't remember the flavor (hint, hint) and I should have definitely passed on it especially at 2 WHOLE EXTRA DOLLARS. \n\nOverall, I will come back again to try the soy wings which my friend said was pretty good as well.", "author": "Arleene L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-01", "description": "This was my first time at this location usually\nGo to the one in the market place by koreatown. I must say I like this one much better. We ordered several items the garlic wings, soy wings, cheese fries, calamari, dumplings and onion rings. The food was delicious and very lightly fried so even after eating you don't have that heavy grease feeling. Will definitely be back", "author": "Andre O."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-02-15", "description": "Delicious KFC (Korean Fried Chicken) that's older than most things I've tried and yet somehow this is my first visit to a Pelicana. This is a Korean establishment that has started becoming worldwide. And certainly there is a reason for that since they make delicious fried things well.\n\nWe got crispy chicken wings with a side of the hot sauce. That sauce is def going to heat things up. You have the option of saucing it or having it on the side. I'd recommend you side sauce it and trial it. They do charge for that however. The chicken comes with corn salad (meh) and radish Daikon. There are Korean dishes available also.\n\nThe truffle fries are probably just fried in truffle oil but it works well. Not the most amazing truffle fries I've had but they're very crispy and the spicy mayo on the side is a good touch.\n\nThe ambiance in this particular pelicana makes the restaurant seem less like a casual fried chicken place and maybe more like a cozy bar.", "author": "Mary P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-12-20", "description": "I will go on record as saying Korean fried chicken is the best fried chicken available. Don't @ me.\n\nThis Pelicana Chicken is a fine space, with TVs and a projector. So great for sports if you want some Korean style wings instead (which again, are the best).\n\nI came here for lunch. They have pretty good lunch specials. I went with the crispy spicy chicken sandwich, which was $9. It comes with lettuce and pickles (you have to pay for additional toppings like tomatoes, onions, cheese, and eggs). You can also add $2 for a \"small\" fries. I use quotes because you get a crap ton of fries. And they're really good. Medium thickness and super crispy.\n\nOnly docking them a point because parts of my chicken were little gristly. The non-sandwich chicken is probably better, which I've had and enjoyed at one of their Queens locations, so I'll definitely be back for that.", "author": "Kenny C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-12-02", "description": "New spot in Fort Greene for korean style fried chicken! \nIt's a refreshing change to the lack of Asian food on this street. \n\nThey have a lot of different options you can choose from - whole fried chickens, fried chicken wings, grilled chicken wings, chicken sandwiches, and burgers.\nBasically all the bar food you'd want. They also have a bar area with TV's, so I'd imagine this place would be pretty busy on game days!\n\nWe were a little overwhelmed by the menu, but decided on the whole chicken, crispy/spicy with an added sauce ($2).\nWe also added the side of fries for $3\n\nIt was more than enough food for two of us, and we left pretty full! \nThe chicken comes with sides of radish, slaw, and corn.\nThe chicken was super crispy and delicious! but the breast parts were too dry for me.. There also seemed to be a lottt of breast pieces compared to thighs. \n\nA week later, we got delivery for our Christmas party and ordered 24 crispy spicy wings and 24 soy sauce wings. \nBoth were great! I'd get both if you've never tried. The sauced ones reminded me of the soy garlic from bonchon\n\nI'd definitely order the wings over the whole chicken. Just avoid the breast pieces altogether. \nTheir fries are really yummy too! Almost cajun style", "author": "Kimmy U."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-26", "description": "I passed here on my way to work last week so tonight my date and I tried it. The drinks were strong i had a mango mojito needed more mango flavor but strong, he had Titos on ice. Our chicken was fresh and tasty. He had the grilled wings garlic and signature flavor. I had the original sweet and spicy wings and fried calamari. Definitely a lot of food for me but worth it. We will be back again or I may bring my grown kids lol.", "author": "Dee B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-11-09", "description": "A fun offering of Korean fried chicken in the center of Ft. Greene.  The place offers a fun atmosphere and satiating , crispy fried chicken.  This spot provides a few options namely;  half/whole fried chicken, fried or grilled chicken wings.  \n\nI ordered a whole spicy crispy fried chicken.  The meat from the chicken was tender, salty and not overly greasy.  The crunch from the breading is what makes Korean Fried Chicken a true treat.  I added the spicy sauce, a $2 up charge, which was not as spicy as I was hoping for, and was definitely on the sweet side.  \n\nTreat yourself and order the fries with snowing cheese.  You will not be disappointed.\n\nI think this place is a great addition to the neighborhood!", "author": "Dan E."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-01-23", "description": "- I like the call button\n- chicken is kind of salty\n- did not like parmesan crusted fried\n- large salads (three people could eat from one order)\n- I did not like chicken:salad ratio on the grilled chicken salad\n- soy chicken was alright\n- chicken had good heat value\n- The original, crispy and spicy chickens were just alright as well\n- frozen mango beer was good and wort the try\n- open late\n- fun hangout for friends\n- funky K pop soundtack", "author": "renje g."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-31", "description": "Wings / fries were really good wish I was able to try more but I will be back everyone who worked there was friendly .", "author": "Brittanie M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-01", "description": "I love this place !! We came here on New Year's Eve since it was one of the only places that stay open late. And we were greeted with soju bombs and free drinks ! \n\nThe manager and workers were so friendly and kind we had so much fun with the rest of the people inside. It wasn't crowded and I will definitely come back just because of their amazing gesture. \n\nThey also gave us New Years props. Such as hats and necklaces, guys I honestly recommend this place! I've never been to a restaurant so inviting", "author": "Sally C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-01-13", "description": "I dined here once with a party of 8. The place is pretty pack considering the location. The rice cake was my favorite when I dined here since it was saucy and the rice cake had the right tendency but it came with a lot of fish cake. The original fried whole chicken were crispy outside and juicy inside but it looked like a small chicken. The soy sauce wings were on the dry side. It was over cooked. The chicken fried rice was decent. I also got take out one time. The sausage kimchi fried rice was delicious. It had just enough spice that made it enjoyable. The spicy chicken had a little kick. This time the rice cake was a disappointment. There were barely any sauce in the box but it was still good. I only wish it had more sauce. Also, call the restaurant to order since ordering on apps cost more!", "author": "Cristina L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-07", "description": "Delicious ass chicken. This place is right around the corner from the cigar bar. Perfect wings, shrimps and fries. I will definitely order from here again.", "author": "Genie M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-22", "description": "Great food!\nGet the chicken!\nGreat food!\nGet the chicken!\n\nGreat location\nThe sevice was great and quick. I've been to several locations and this by far is my fav.", "author": "Sarkazz V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-04-08", "description": "First time visiting Pelicana Chicken. I had crispy wings and spicy soy wings. The chicken wings were perfect , the crispy wings were delicious only thing missing was red devil hot sauce. Decided to take the rest of my wings home so I can enjoy with the condiments I have at home. I also had the fries , which were provided with ketchup and chipotle mayo. The chipotle mayo sauce was ok the jalapeños added overpowered the flavor. I was disappointed in the calamari, also wish plum sauce was an option for condiments. The waiter was attentive and the food arrived pretty quick. The corn slaw was pretty good as well. Will definitely revisit but next time bring my own hot sauce.", "author": "Maggie A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-02-11", "description": "The food was decent. I enjoyed the truffle fries \u0026 the spicy/crispy fried chicken. The chicken was seasoned well and cooked on the spot. Food was hot when served, which was a bonus. The small side of creamy corn was an added bonus. Order was more than enough to fill one person but, still filling. \nI will stop by again.", "author": "Sheyna L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-02-20", "description": "First AND LAST TIME buying 'food' from this place was last night. \n\nDear whoever answers the phone to take my order last night: you have no manner and made me feel like I owe you money (yeah wtf) then hung up abruptly - FYI I'm one of those customers that brought business to your job. This is sign number 1.\n\n25 minutes wait for 16 wings to be cooked while there was no customer at the restaurant. Do you only start defrosting the wings when an order is made? FACT: it takes less than 6 minutes for 16 small wings to be cooked in an industrial deep fryer. Hmmm sign number 2.\n\nTook the wings home:\n\n- Spicy soy flavor: SOAKED IN OIL. First bite oozed oil, the breading was as mushy as grandma's mashed potato. I ate 2 wings, THEN VOMITED. My body rejected it.  \n- Spicy crispy chicken: NO FLAVOR, breading was extremely dry and had this weird texture. Maybe the cook should at least add some salt? Popeyes's chicken is a million times better and cheaper as Pelicana charges $25 for 16 inedible wings. \n\nIf the owner doesn't clean up his/her business (staff, cooks, etc.) then this Pelicana location will fail miserably real quick with the rent of a corner store in front of a subway station.", "author": "Annie T."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-02-09", "description": "First experience is 5 star. The waitress was extremely good at her job, she asked all the right questions and provided impeccable service. She understood it was not our first time eating at the pelicana franchise and provided probably the best experience possible for one waitress in a ramping up afternoon.\n\nMy second experience was pretty poor. A different waitress was working (today). Today's waitress asked us if we wanted the sauce on the side for 24 pcs of wings, I figure that's a good idea in case we take the wings to go. They only gave enough sauce for 8 wings tossed or 12 wings dipped. When we asked for more sauce we were charged 2 dollars. The fuck kind of shit are you selling us? Do you even know what you're doing? If I order and paid for 24 wings and want the sauce on the side, give me enough sauce to toss all 24 wings if I choose to do so. Dont fucking cheap out on that shit and charge me more money for your business being cheap.\n\nNote to management, if you need help training your staff or running your restaurant I charge a reasonable fee for my time to explain to you why you can't sell 24 PC of wings and charge for the other half of the sauce needed to enjoy the wings.\n\nI will likely not return to this branch since it's a better experience to just drive out and deal with traffic to the New Jersey location than to pay extra for sauce to fulfill my original order. You fucking lost a repeat customer over 2 dollars. It's not the money, it's the principle and service.", "author": "Raymond C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-27", "description": "Cute vibe, great food and amazing staffs! This place is definitely worth my first yelp post. \n\nThe spicy beef burger was THE BOMB. It's so savory and juicy. I loved it. The burger as a whole was just so soft and tender, it all melted as soon as I took a bite. In a matter of few seconds, it was all gone! \n\nThe french fries with white snowing powder is so interesting. It's cheesy, yet sweet. It has its distinct flavor that I've never tasted before. Can't describe, you all just need to try it! It's definitely addicting, can't stop! \n\nOverall, it's such a cute place. The decors are on point.", "author": "Danbee H."}], "servesCuisine": "Chicken Shop", "priceRange": "$11-30", "name": "Pelicana Chicken", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Greene Ave", "postalCode": "11238", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/IxRflTSgErWQi39UhA8asA/ls.jpg", "@type": "Restaurant", "telephone": "+17185676060"}