{"aggregateRating": {"reviewCount": 4, "@type": "AggregateRating", "ratingValue": 2.0}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-04-24", "description": "What's with the decor? Are they kidding themselves? Houlihan's is supposed to be a pub-ish kind of chain without the charm, camaraderie, or uniqueness. This place was aiming for a chic, open kitchen-type restaurant complete with partitions and sleek booths made of poserosity. \n\nWe ate here because we were hungry, it was 3 in the afternoon, and we were just done with Target. Really done. God that place.\n\nAnywho, I had the chicken marsala. It was fine, I wasn't expecting much anyway. The menu was very plain and a bit expensive for the quality but whatever. The open kitchen was fine, but you could totally see one of those Hitler-esque managers walking around promptly telling the grill guys to clean up this and chop that and do this. Not that the grill guys looked like they enjoyed working there.\n\nThe oddest thing though was our waitress left. It was probably the midday shift. but she just left without a word. We couldn't even get anyone else's attention. We could have walked out right then and there, nobody said anything to us. But we asked the hostess, and after a few minutes of debating, she determined that the waitress left for the day and didn't tell anyone. So we paid the new waitress. Kinda weird.", "author": "Victor L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2007-03-23", "description": "Oh my lord.  Worst restaurant experience ever.  This Houlihans is in a mall right outside of Target.  The waitress had no idea what she was doing, had to ask our drink order 4 times.  She had four tables of no more than 3 people each and she couldn't handle it.  We had to wait forever for the bill and then it was at least 20  minutes before she came back to get it, even after being called a few times.  \n\nThe food was terrible.  I had a chicken panini and the combination of flavors was so gross that I couldn't finish it.  My friend had a margarita that she said was weird.  \n\n\nThere was no soap or towels in the bathroom and I saw a bug on the table while we were waiting for our check.\n\nI will never be going back here and I strongly advise against anyone else going either.  If I could give no stars, I would.", "author": "Meagan W."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2007-01-17", "description": "Let's face it: raising your prices and changing your decor won't make you upscale. While the food was decent, the service and the price wasn't. If I paid $14 for a burger, I would expect to sit at a table that's been wiped down, and be given silverware and napkins after asking the first time.", "author": "Lisa F."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2008-07-15", "description": "This place has finally closed and has been replaced by some place that was so tacky they didn't take down the Houlihan H's.  Needless to say I will not being going in.", "author": "diana m."}], "servesCuisine": "American (New)", "priceRange": "$11-30", "name": "Houlihan’s", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "139 Flatbush Ave", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": null, "@type": "Restaurant", "telephone": "+17183982232"}