{"aggregateRating": {"reviewCount": 7, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-01", "description": "This place is the bomb, came from the UK for a week stay, this deli could've made me stay for life. \n\nWas in here for breakfast nearly every morning, highly recommend a bacon egg and cheese bagel! \n\nFresh food and sound staff, what more could you ask for?", "author": "Harry D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-11", "description": "People from NY dont realize how special our delis are, while visitors don't realize its more than the food.  Anyone can slap meat on some bread and call it a hoagie, hero, sub, grinder, or whatever other noun you call it by.  People think its a sauce that makes it.  Even I don't know what it is. Maybe its the fact at 2:30 am on a monday that turned into Xmas eve I can get a delicious hero with onion rings for like 8 bucks?  Ive paid much more for chicken cutlets elsewhere, yet NY can pump em out with quality and regularity.  This place was great.  Service friendly.  I asked for hot sauce and the cashier didnt frugally drop 1 or 2 in.  He deviously laughed like a hell beast challenging me to use em all.  The amount of options and possibilities.  The way they will just turn that bread into delicious garlic bread. NY delis bring the glutany of vegas.  This is a dependable top deli!", "author": "Charles W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-25", "description": "I am from California and got hungry late at night. Found this Deli shop next to our hotel and dang these sandwiches are bomb and fresh! The cook was super friendly. I might go back tomorrow for another one.", "author": "Luis T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-02", "description": "We stayed at a hotel two blocks away and this is open 24hrs!!! Sandwiches are great and cheap. Workers are nice", "author": "Adonde S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-27", "description": "Food is delicious no exaggeration... very nice servers and employees best bacon cheeseburger in town very cheap prices yummy build ur own salads, fries are never soggy open 24 hours and fast delivery... need I say more", "author": "DeAsia B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-16", "description": "I ordered their phillycheese steak and their chopped cheese and i found each to be great!! Maybe a bit more cheese in both would have made both heros perfect! I ordered fries which tirned up a lil cold but what do you expect when u order fries delivered. Great place for sandwhiches!", "author": "Mel L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-26", "description": "I ordered delivery from here this morning because the listed delivery time was 30 - 45 minutes, which gave me enough time to eat before work. I waited well over an hour and they never came and they didn't answer their phone when I called. I wish they were honest about their delivery time because I would have made other breakfast plans rather than waiting around for nothing and then starving through my morning meetings.", "author": "Amy T."}], "servesCuisine": "Salad", "priceRange": null, "name": "Metro Finest Deli", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "233 Schermerhorn St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/797VCDF7gi0RNArMnquuPA/ls.jpg", "@type": "Restaurant", "telephone": "+13477213711"}