{"aggregateRating": {"reviewCount": 1049, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-14", "description": "This place was worth every cent my boyfriend and I paid. It was the most romantic and intimate dining experiences we have ever experienced - let alone the most expensive! We came here last night for a late anniversary/early Valentine's dinner and it was very packed.\n\nWe were greeted with ladies who coat checked our jackets and proceeded through double doors where the dining area was. Our table wasn't ready yet so we were told to grab a drink at the bar while we waited. Drink prices were on the higher side, as expected, but totally ok. Once our table was ready, the bartender told us to leave our drinks at the bar so it can be delivered to us by a server -- wow.\n\nFor appetizers we ordered salmon and crab; for entrees we got the steak and salmon; dessert was the chocolate bridge. We were also served with bread and some type of trout. Every bite was so savory and delicious. Seriously, so worth our money. \n\nAll the servers were so kind and considerate to us. But, Ricky was our main server, and he was AMAZING!! He was so personal and attentive to our needs. He truly made our first experience here so much better than we expected. Thank you Ricky for everything!!", "author": "Roxanne S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-06", "description": "Dear Yelpers!\n\nThe food, the view and the service!\n\nThis restaurant is absolutely divine. The food was effortless. We came here just to dine and we each made sure to order something different. The presentation of the different foods is what really wowed us the most! All of the food was prepared and cook perfectly to our liking. Make sure to order dessert it makes the dining experience complete!\n\nThe views were subpar, you need to make sure you ask for a table close to the water or you miss the views. There is a patio outside that you can go out and take photos but it is small and you might have to wait your turn. The actual restaurant is on a barge so if you stay really stilll you can feel it moving. It can get a little loud in the restaurant but you can take your dessert and have it in the seating area by the piano. He plays wonderfully! \n\nThe service is on point. We had Ricky and he was really tentative to our needs, which was a little shocking since the entire place was packed! There was no real room to walk and the tables were close together. We made reservations in advanced because we wanted to go on a Saturday so we don't know what walk ins would be like.\n\nOverall the 4 stars are for the food. They made it worth while!", "author": "Christian V."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-08-10", "description": "My friend and I have been coming to the River Café for about 12 years now, always for a special occasion... yesterday was the first time we came for breakfast. \n\nService and attention to detail has always been exceptional and the view is breathtaking, no matter the time of day or weather.  My experiences wirh dinner and brunch have been great, however, with all that said, the actual breakfast quality and portions were underwhelming and left much to be desired. As a foodie, vacation rental host, tour director and former corporate events planner, I would not recommend breakfast here if you are looking for an exceptional meal.  Everything else, absolutely. \n\nWe too, reserved a table by the window, and then were told that it wasn't available when we arrived... our host handled it well, and thank goodness that we had the time and great weather to wait for our table, and our waitress was gracious enough to present us with a small, yet much appreciated, birthday presentation... logistically, I recommend that the cafe share their policy on the phone at the time a guest places the reservation. Please don't wait for them to have denied expectations... that leads to disappointment... not cool nor good for business.  Your restaurant is, and should remain, as a place people come to celebrate special moments. Please keep that in mind... with every single guest. \n\nAs far as presentation and portions... please consider having a conversation with the chef.\n\nThank you.", "author": "Miriam P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-11", "description": "Thank you for a phenomenal wedding anniversary brunch. My husband and I were a bit late on dinner reservations, so we booked the next best thing which was brunch a few days later. The entire brunch experience was fantastic. The ambience at River Cafe is unbeatable and our seats were perfect. The last time we dined at The River Cafe dates back maybe ten years ago before we were married. We remember how exquisite the overall experience was and were sure to be pleased with our brunch. The pre-fixe brunch has a variety of options that fancy every craving. We had the pear salad and pork belly for starters and the branzino and lobster pasta for mains. Our BK bridge and pistachio crumble desserts were phenomenal and put a 5 star touch to the end of what was already a delightful meal. Thank you, we will definitely be back!", "author": "Camille M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-04", "description": "Had a great and memorable birthday dinner at the River Cafe. It is a restaurant that truly lives up to its name and reputation as one of NYC's best. Impeccable service, jaw dropping Manhattan skyline view, expertly crafted and presented fine cuisine, and a stellar wine list full of world-class labels. The service and hospitality provided from the valet to the maitre d and everybody in-between was as good as it gets. For such a spot the pricing is very reasonable. Next time I plan to do the 6-course chef's tasting menu with the wine pairing to get the full experience. Will definitely be back.", "author": "Marios C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-18", "description": "Visited for the views. It was romantic and fabulous. The food and service was also very fabulous. Highly recommend.", "author": "Jae Beom H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-12", "description": "What can I say except... exceptional, extraordinary, and amazing. Great views, Great Food.\nMy favorite is always the Branzino.", "author": "Bill G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-23", "description": "Service and ambiance was impeccable. Is the food worth the price well that depends on your pallet. I've had better for the same price if not a little less expensive. But can't beat the overall experience.  Would definitely come back again.", "author": "John C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-28", "description": "This place is lovely and elegant. The atmosphere make you feel special. The view is spectacular. Great night with a Brooklyn bridge in front of me. Food and wine is delicate Selected.", "author": "Diana M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-12-18", "description": "One of the most overrated places I have ever eaten at. Truly probably deserves 4 stars, but in relation to the expectations set is why I put a 2. When you come to a place categorized on this level, everything should be stellar, should be exquisite. I was expecting one of the best dining experiences of my life, and this did not even come close. Everything was above average. The filet mignon piece was clearly below average. We had the chef's tasting menu, which should be the best that they have to offer. Our immediate server was not very pleasant at all, but everyone else we came across was lovely. The sommelier was awesome, the short talk with him was our favorite part. And the view also. I'm still glad we went to experience it, but it does not even come close to living up to the expectations set for it. In a short 4 day trip, we had 4 other dining experiences that far exceeded this, and not even one of those were 1/3 of the price of this.", "author": "Andre A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-25", "description": "I'm going to keep this one short but sweet. This was the most incredible meal I have ever had. From the service, to the atmosphere and the food, everything was perfect. \n\nThe menu has a lot of options and it was difficult to chose but I had the rabbit starter, duck main and Brooklyn bridge dessert. Every single mouthful was a pure delight.\n\n\nThis is a really great place for a special occasion and I will definitely be back in the future.", "author": "Taylor A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-08", "description": "Attended a 80 person birthday dinner where they rented out the whole space. The view of the freedom tower and the east river is magnificent. \n\nThe food was spectacular and the same offerings as our wedding at the liberty warehouse; the same chef. The cod with basmati rice is my favorite. The Brooklyn Bride cake made of devils food cake with chocolate mouse is amazing. Their salted caramel chocolates were also perfection.  Great service as expected; unobtrusive and attentive.", "author": "Jenny K. L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-02", "description": "30 second review go!!!!!!!!@@@@@@@@@@@@@@\n\nexcellent everything. (some might say expensive, but u pay for what u get, or is it the other way around?)\n\nCome here to Eat with your partner.\n\ndon't come here with male friend if your a guy,\n\nthats gonna be hella awkward, (just saying)\n\nif you are kinda picky, skip the prefix menu and pick whatever you like.\n\nlunch will be easier to afford, (and has better very nice view on the water)\n\nand if you get a window seat,\n\nlife doesn't get much better than that.\n\nwill come again.", "author": "TT T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-28", "description": "A perfect dinner! We had 10pm reservations for our first anniversary dinner, and they sat us at a table near the window (but not quite).  When the couple next to us by the window moved not long after, the staff immediately offered to move us over so we could have the most incredible view.  We did the chef's tasting menu and wine pairing, and we were stuffed and more than a little tipsy (so much wine!).  Each dish was delicious, but the standouts were the giant shrimp and the foie gras (which I am loathe to admit was just ridiculously good).  The service was impeccable and we were never left wanting for more water, wine, bread, or more.  It was pricey, but absolutely worth it!", "author": "Sophie W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-28", "description": "The place is absolutely gorgeous and the food was very enjoyable (but way overpriced for what it is).  service was fine and the view was actually breathtaking.  But when we walked in someone, maybe the GM or something (dressed for service in a purple suit and matching ascot) was outrageously rude to my guests for having a water bottle in his hand! Its one thing to say \"sir can I take that from you, we don't allow outside drinks\" or whatever, but the man was so absolutely apoplectic over this situation he caused a scene.  Since I coincidentally arrived 15 seconds after the rest of my party I got to witness all of this without this man thinking I was part of that group.  After freaking out until he was red in the face I got to hear him berate the door staff (2 people to open the doors...) about how they should have caught it and how could they let such a tragedy unfold, blah blah.  He essentially terrified the staff so much they didn't open the door for me and I had to squeeze my way around him to enter the restaurant, because he was so worked up he was ranting in the middle of the walkway blocking the path, not even noticing me.  I've worked in the service industry for 15 years and have never seen such a display unfold behind the scenes or, Worse, in front of a guest! It was the antithesis of what the restaurant industry is all about; making sure your guests have a great time.  I don't know if he was just a fussy owner who's not involved in the day to day operations, or a manager who thinks that maintaining their elite and posh environment means treating people like trash.  but he sucks and i wont go back or let anyone I know go back.  but don't worry, they coat checked our plastic bottle and we were able to get it on the way out.", "author": "nessa c."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-03", "description": "If you're looking for an impressive spot to take a loved one, a date, family, etc... this is the spot!\n\nMy boyfriend lived a few blocks away from the restaurant, and we were curious as to the hidden gem tucked away out of sight. You see, you can't see the restaurant from the street nor from the nearby waterfront walkway. There are a number of lit-up trees burying the restaurant in its own little grove. Its curb appeal was enough for us to make a reservation.\n\nUpon entering on the night of our reservation, we learned that the curb appeal is just the start of it. The restaurant appears to be on a floating barge of some sort (you walk over what sounds and feels like a gangplank on your way to the dining room). Given that, the restaurant juts out over the river a bit, giving glorious views of the Brooklyn Bridge, the Manhattan Bridge, lower Manhattan, even the Statue of Liberty. We made an early reservation in order to better the chances we could be seated by the window, and were lucky. It was not crowded and we got prime seats as the sun set and the lights came on across the city. Stunning, and great for photos. You're largely paying for the view. \n\nI don't mean to disparage the food, though. Everything we ordered, from salad through our entrees, was more than fine. Neither of us had complaints and we both cleared our plates. We also ordered the Brooklyn Bridge dessert, which was a nice novelty.\n\nThe only even slightly negative comment I could make is that the place has a very formal feel to it. If that is what you are looking to experience, you are in the right spot. The ambience indicated a formal meal, the room was decorated regally (as regally as I've ever seen someone disguise a barge), and the waiters acted their part outstandingly. When my boyfriend left the table to use the restroom, they covered his dish with a plate serving cover. Napkins were refolded. There was a lot of bowing going on. It led to a very impressive overall experience, although someone at a nearby table noted that it seemed a bit \"stuffy.\"  If you feel anxious and uneasy navigating through all the silverware beside your plate, this may not be the place for you.", "author": "Lauren L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-23", "description": "The food, the ambience, the landmark, janes carousel... simply amazing.  It's quite a romantic place.  Went here with the love of my life and I'll never forget it.", "author": "Alias G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-09-11", "description": "We had dinner on September 2 at 6.30pm. The bill came out to $299. \n\nWe asked for it to be spilt on two cards - $137 on my card and the rest on the other.\n\nHowever, it shows up on our bank statement as $299 on my card and $162.41 on my friend's. \n\nI signed the receipt for $137 + 15% tip. Not $299!!!\n\nEmailed the restaurant afterwards, I still haven't heard back! And its September 11 (1pm est) now.", "author": "Ravisara L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-16", "description": "This was the first date I had with A since having baby A and it was perfect! We came to celebrate our wedding anniversary and were promptly seated in a nice two top near the window but not immediately next to it. I wished we were seated by the window but A preferred where we sat against the wall with cushioned seating on one side. This was really the most enjoyable experience we've ever had on a date at a nice place because we didn't feel rushed, enjoyed the food we had, and felt much more relaxed than we ever have before at a fancy restaurant. I most enjoyed the amuse bouche of duck croquette and the gnocchi appetizer and would skip the chicken next time. It was so sweet of them to acknowledge our wedding anniversary with a candle and special chocolate ok the desserts. Just keep in mind that the restaurant is literally right on the water, which A noticed right away while I had no idea because he has motion sickness and he was freaked out about it but it was fine after he got over it!", "author": "Brietta Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-03", "description": "Celebrating a big birthday! Great view, excellent presentation! The Portuguese octopus was so tender! The poached lobster was also very tender and flavorful.", "author": "Mary Ann J."}], "servesCuisine": "American (New)", "priceRange": "Above $61", "name": "The River Café", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Water St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/C_8aEbAvcCLhiqXn9QdWSw/ls.jpg", "@type": "Restaurant", "telephone": "+17185225200"}