{"aggregateRating": {"reviewCount": 1049, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-17", "description": "Took my mom and aunt here for brunch one weekend while they were visiting. They didn't want to go to Brooklyn but I promised that this meal would make up for it and boy, did it ever. The food is as fantastic as the food. Expensive but it's a great spot for a special event or special out of town visitors.", "author": "Cari W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-15", "description": "I can't get over how delicious the food was! The staff was attentive, and let's not forget about their incredible view; under the Brooklyn bridge, overlooking the city!", "author": "Melissa S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-02-20", "description": "This is an unfortunate review. I really wish that I could give The River Café a higher rating, but what transpired during my visit at this restaurant utterly ruined my entire evening.\n\nMy dining companion and I decided to make reservations at The River Café to indulge in an elegant meal, while at the same time surround ourselves by the magical views of the NYC cityscape that the restaurant boasts. The views are, indeed, breathtaking. I would imagine that there are only a handful of other establishments that may come close to offering the scenic vistas of the NYC skyline that are comparable to what you will encounter at The River Café. Absolutely, our choice to spend our last evening at this restaurant--before flying back to San Diego the following day--was seemingly a perfect idea.\n\nI was dressed in a suit, and my dining companion was dressed in a tasteful and sophisticated shirt, tie and slacks. Upon arrival, we were greated by two hostesses. To our dismay, one of the hostesses, a female brunette, rudely advised my companion that \"jackets are required and you will need to borrow one from us before being seated.\" We were unaware that there was a stringent jacket requirement. Notwithstanding, had the hostess been gracious and polite about it, there would have been no offense taken. Unfortunately, her pretentious, austere behavior and terse tone had the effect of not only making us feel unwanted, but it completely chilled our excitement for wanting to dine at The River Café.  In fact, after we were seated, we were both miserable and felt uncomfortable even being there. \n\nBoth of us are accomplished professionals. Fine dining is certainly not foreign to me. I've dined at some of the most elegant and highly regarded restaurants in San Diego. In all of my dining experience, I've never encountered such an offensive, ostentatious display as what we received at The River Café. It was truly shameful. \n\nAfter paying our bill ($100+ per person) and discussing what had transpired shortly after departing, I decided to call the restaurant and ask to speak to the manager. The individual that answered the phone advised me that the manager was unavailable but would call me back. I left her my name and phone number. To date, I haven't received the courtesy of a telephone call. Such woeful lack of follow up only further demonstrates that the poor customer service orientation that we experienced at the staff level is systemic and indicative of the persona of the management. I still remain mystified. \n\n+1 star for the delicious food \u0026 spectacular views.", "author": "Gary R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-20", "description": "The onlay reason I don't give this restaurant five stars is that for the money you'll pay for this meal, you should get more than an hour and a half out of it.  The view can't be beaten, I've been married 22 years and got engaged there, so it's been there quite a long time.  We returned for an anniversary and the food was ,of course, Devine, but it was a rather short lived experience over very quickly, and on to their next seating. The grounds are elegant, and even with the neighborhood gentrification and the crowded DUMBO nearby, it's still a quiet spot.", "author": "Dina I."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-02", "description": "What an experience!!! It would have to be the best meal experience.  Can you give 6 stars in a Yelp.  Totally worth every penny.  Came here for lunch and it was an inspired idea because the dinners tend to be pricier.  \n\nArrived at the ante room of the restaurant to be greeted by a jungle of flowers.  I gushed about it to the hostess who greeted us warmly and did her best to request the florist for an arrangement for me.  The florist was not able to but kudos for trying.\n\nWe were brought to our table, which faced the Manhattan skyline.  It was so beautiful and for that alone it was worth the price if the food was crappy.  But oh no.  Every detail of the food is orchestrated to look and taste good.  I was in the hands of greatness in food.  For amuse bouche we had little eggs with caviar and mini egg mousse of some sort.  Whatever it was it was heavenly and I could have eaten more of that.  We had corn ravioli and foie gras appetizers.  The corn ravioli was delectable sweet and velvety smooth encased in a yielding pasta and the foie gras was a study of contrasts with the sweet compote on the side and cute little brioche toasts the spread it on.  For mains we had the chicken and duck breast.  OMG best of both I have ever had in my life.  Cooked perfectly and deliciously hot...or cold by the time we finished our meal because the conversation rolled so beautifully with such a meal!  \n\nService was flawless albeit not super smiley.  The Captain of the servers ran a tight ship and even though we did not get to sit by the water immediately, by the time we had our desserts they offered to move us to a vacant table.  That is service executed at its finest.  The Brooklyn bridge dessert is as pretty as it is tasty.  Truly wonderful signature dessert, again a study in contrast with raspberry sorbet and wafers against the rich chocolate cake and ganache.  So wonderfully sweet.  The espresso my SO had was accompanied by petit fours, again compliments of the house.  Each on a delectable study of taste explosion, caramels, chocolate, and melt in your mouth like a cloud marshmallows.  Yes! Oh yes!  (That was my first Yelp foodgasm!)\n\n\n\nThis restaurant is so wonderful if I could have only one restaurant to eat at the end of my life it would be this place.  Everything culminated into wonderfulness.  \n\nI cannot talk any more about this restaurant because it is amazing.", "author": "Lara P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-06", "description": "As you walk in, you are greeted by beautiful flowers. Coming in you just have to feel happy (I love my flowers). We were seated and had a beautiful view of Manhattan (don't you wish the river was a nice blue so it would even be more enjoyable). \n\nWe came here for lunch and had their set menu. (I only uploaded a couple of pictures). Some dishes we had were...\nScallop Crudo (thumbs up)\nOysters\nTuna Tartar\nCrab Cake (very good)\nLobster and Lobster (I could do without the lobster grill cheese)\nBrooklyn Bridge Dessert\n\nFoodwise I will give it a 3.5 star, but eating in that environment I have to give it a 4 star.", "author": "Nhu T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-03", "description": "Business dinner no. 3 while in New York was at the River Cafe.  The view, the view, the view....WOW!  Dine with spectacular views overlooking New York Harbor and the Manhattan skyline.  About 40 of us had dinner in one of their private rooms with a wonderful terrace.  Our dinner party enjoyed the following:\n\n(1)  Cocktail Hour \u0026 Hors D'oeuvres:  \nChardonnay was my drink choice.  Some of the appetizers included chicken skewer w/ Thai peanut sauce, mushroom and edamame spring rolls, smoked prosciutto and teleggio crostini, crispy marinated salt \u0026 pepper shrimp.  Everything was delicious!  \n\n(2)  Lobster and Scallop Chowder:\nPoached lobster, sea scallops and yukon gold potatoes.  Flavorable and good to the last drop!\n\n(3) Fish Course Selection - Chilean Sea Bass Fillet\nMy sea bass w/ shaved fennel, Asian pear, ginger citrus vinaigrette was perfectly prepared!\n\n(4)  Meat \u0026 Poultry Course Selection  - Colorado Rack of Lamb\nMy lamb was served with cous cous with Merguez sausage, garden peas and ginger, lavender honey glaze.  The restaurant cooked my lamb as requested....medium well which was absolutely delicious!\n\n(5)  Dessert - Baked Alaska\nVanilla bean ice cream, chocolate devil's food cake topped with meringue foster sauce \u0026 sliced bananas.  The River Cafe's version of an old school dessert was wonderful!\n\nRiver Cafe offers a great dining experience with great food \u0026 service....the kicker is the fabulous view.  I'll be back!  5 Stars!", "author": "Maite H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-29", "description": "I had been to the River Cafe years ago and had a wonderful experience at dinner.  A decade later, it was even more lovely for brunch.  From our first encounter with the helpful and kind hostesses, to the delicious pancakes and mimosas, to the amazing gorgeous setting, it was a perfect way to re-visit Brooklyn.  We loved it!", "author": "Jane P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-26", "description": "Great even though the head waiter was a self important prick.\nWe started at the bar and had a lovely time.  At a great table along the glass all continued to be great even though bald guy in the suit was a stiff.  Given this was our anniversary celebration, I refused to let him dampen the mood.  Everything else about the evening was very nice.", "author": "Glenn H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-04-20", "description": "Came here for one of my anniversary dinners with my boyfriend at the time a few years ago. I strongly believe places like these are either a hit or miss. The ambiance and view was amazing but the food was just so-so. I'm not sure if it was because we looked young but the service wasn't up to par with the the price of the meal. The atmosphere is super intimidate and romantic. This is definitely a great spot for anniversaries, birthdays and special occasions.", "author": "Eileen J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-05", "description": "I have to say I don't understand how this place could get a bad review. My boyfriend and I went there for our anniversary right after they reopened. The place was booked so we left our name on a waiting list. They called us to let us know they had an opening and we snatched it right up. We arrived and were seated in the back which seams to be a complaint for a lot of people. We live in Dumbo so we have seen the view a lot, and I wasn't bothered by being in the back at all. I actually found our table much cozier since it had a couch like seat. It was romantic as well because we were seated next to each other.\n\nThe waiter came over and was extremely friendly. We asked for suggestions on the menu and he provided very good recommendations. I had the vegetarian mushroom wellington and it was amazing. I love beef wellington and was curious to see how it would turn out without the beef and it was phenomenal. Also, the chocolate souffle is to die for. When leaving the gentlemen at the door asked if he could buy us a round of drinks which was very high class. We were in a rush and declined. P.S. did I mention the live piano music. So romantic.\n\nWhen we visited the second time (several months later) for my birthday we were welcomed back before we could even tell them we had been there before. We were seated in the middle of the restaurant, however my boyfriend wanted to sit by the window. He asked and we were told it had been reserved by a regular. We took no offense and asked to be moved to our table from last time which was in the back (but again cozier). They accommodated us quickly. Again, we had amazing service. The same gentleman who offered us a round of drinks at the bar gave us his card and told him we could email him if we ever wanted a window table. I guess on your third time you get bumped to the front lol. The service was excellent both times, and it is now my favorite restaurant in NY.\n\nThank you River Cafe for two perfect evenings. We can't wait to go back.", "author": "Delia B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-28", "description": "My boyfriend brought me here after proposing to me. I was completely blown away by its amazing view of the Brooklyn bridge and Manhattan. \n\nAlthough the place has a strict dress code (guys have to wear suit and girls have to wear proper dinning dresses), the staff was both friendly and helpful. They have an unbeatable pre fixed menu that includes appetizer choices from foie gras to scallop, main course choices from steak to lobster, and deserts from sobets to brooklyn bridge make of chocalate (yes, you heard me right). \n\nMy favorite, besides the view, was the scallop, the steak (exactly how I wanted it) and the sobets.\n\nOverall I had enjoyed one of the most romatic dinner at the river cafe - one that I will never forget.", "author": "Angelina J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-01", "description": "I came here the night that I got engaged and it really started the evening off on the right foot.  The softly lit garden in front gives a romantic feel right before you enter and evertything else just falls into place. We had a seat by the window with my soon-to-be-fiance looking at the brooklyn bridge and because it was a clear night, my view was of the statue of liberty.\n\nThe service was fantastic, food was excellent, and if you're looking for a place for a special occasion I would recommend this place highly! \n\nNote: For Friday/Sat night dinners, I would recommend making a reservation at least 3 months if not more in advance (yes, they do fill up that early)", "author": "Mark T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-03", "description": "My favorite aspect of River Cafe was the scenery. If you can, try to plan your reservation to coincide with the sunset. It was lovely to see the NY lights become brighter and brighter throughout our dinner. \n\nMy boyfriend and I took public transportation, and it was a nice walk from the subway station to the restaurant (about 10 minutes). Approaching the restaurant, we really got to see the cobblestone roads and the history of the little area that River Cafe is nestled in. River Cafe itself is a lovely little restaurant. It's interesting to see the ginormous Brooklyn Bridge behind this quaint cottage of a restaurant. There's pottery all over the place. What are they used for? I should've asked. Lights strung in the branches of trees all over make it very romantic. \n\nAs soon as you walked through the doors, there was a huge arrangement of flowers. The smell is so nice. My boyfriend said, \"I imagine this is what President Snow smells like.\" Lol. It is quite floral. \n\nThe restaurant is small but cozy. My boyfriend and I were lucky enough to get a booth seating that allowed us to sit side by side, looking out the window at the NY night scenery. \n\nService was absolutely wonderful. They explained all the dishes and made great recommendations. They were polite and friendly, and not at all pretentious. I always worry about how employees at expensive restaurants will treat my boyfriend and me because we look so damn young, but River Cafe was wonderfully and respectfully polite. \n\nFood was good, but not impressively great. We ordered the Chef's Tasting Menu, which I think is a better deal than the pre fix menu. The pre fix menu is 3 courses for $100 and the Tasting Menu is 6 tasting courses for $125. The pre fix dish sizes were too big for me. I would've gotten sick of the dish halfway through. The tasting menu has perfectly sized dishes. Just the right amount, and you get to taste even more dishes. \n\n(1) Soft Shelled Crab Special Appetizer. Delicious! Lightly fried, stuffed with peeky toe crab. Our favorite dish. \n\n(2) Foie Gras. 2nd favorite. It was perfectly seared, atop french toast stuffed with cooked apples. Perfect flavor combinations. \n\n(3) Wild Rock Lobster. Possibly the best lobster I've ever had. Texture was awesome.\n\n(4) Colorado Rack of Lamb was cooked perfectly\n\n(5) Branzino Fillet (sea bass) was good. My least favorite though. \n\n(6) Caramelized Apple Almond Tart was okay. I wouldn't recommend this as a choice. \n\nMy boyfriend got the goat cheese cheesecake, which was better. They did a good job of incorporating the goat cheese flavor into the cheesecake. \n\nAll of the food was great, but nothing blew me away. I definitely recommend this restaurant though. Awesome scenery with good food and great service. Wonderful place to celebrate a special occasion. My boyfriend and I went for our anniversary, and they customized our desserts with a chocolate placard that said \"Happy Anniversary\" and our server even wished us personally a Happy Anniversary. \n\nIf you can, definitely try River Cafe.", "author": "Kira L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-20", "description": "Took my boyfriend here for his birthday and it did not disappoint. Views are phenomenal, food is well-prepared, and the waiters are quick and courteous. If you tell them you are gluten-free they give you gfree bread and prepare your meal accordingly.\n\nEvery other review has already covered the bases. Come here for a special dining experience.", "author": "Ro C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-10", "description": "The River Cafe is a comfortable yet sophisticated dining experience that has to be on anyone's \"must try\" list for New York City. It is located right next to the Brooklyn Bridge on the Brooklyn side, with a serene view of the East River and the gorgeous Downtown/Midtown Manhattan skyline.\n\nThe entrance to the restaurant hides behind a cozy courtyard with lights strewn about tree branches and small decorative garden pieces. Upon checking in your coats, you'll be escorted through a small walkway that sits above water and into the main dining area that is designed so that most patrons will have an unobstructed view of the river. Coupled with the soothing sounds of a live pianist, and you're on your way to the dining equivalent of a sensual full body massage.\n\nThe chef sent out a nice amuse-bouche of butternut squash cream and pumpkin seeds next to a delicious jerky laid on top of mixed fruits. For the appetizers, the girlfriend got a delectable steak tartare (probably the best steak tartare I've tasted in NYC) and I went with the foie gras \"two ways\" option. I may be biased since I hadn't had foie gras since a trip to Paris last year, but man do I miss that taste. I thought the foie gras at the River Cafe was served wonderfully. \n\nAs good as the opening of the meal is, the entrees blew our minds away. The girlfriend got the duck breast cooked to a perfect medium rare and served on a bed of pickled red cabbage and fried sweet potato bits. There are many restaurants in New York that pair some things with the proteins that will have you scratching your head, but this won't be one of them. The items on a plate complement the meats to perfection. One bite into that duck with a bit of red cabbage and sweet potato on your fork, and you'll know what I'm talking about.\n\nI loved my strip steak, which was also cooked to a perfect medium rare and retained the right amount of charred fat. It is coated with a bed of red wine mushroom marmalade, and once again it complements the flavors of the brilliantly-seasoned steak to perfection.\n\nDesserts are never my favorite part of a meal, but these desserts were underwhelming ONLY relative to the appetizers and entrees. They taste just fine, but were forgettable only because what came before it completely blew me out of the water.\n\nAs a final note, do stop by the bar beforehand if you are early for your reservation. Ask for a glass of scotch neat and you'll get what would normally be considered a double at most places. It's funny how the smallest things in life can sometimes make or break your day.", "author": "Pat P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-28", "description": "Go for lunch!! The food is amazing but less than half the price of the dinner. My husband and I had a fabulous experience here. The staff were friendly and knowledgeable. We thought that going in to such an upscale place we would feel uncomfortable or looked down upon but we didn't. Nice place to celebrate a special occasion and indulge in excellent cuisine.", "author": "Leslie M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-09", "description": "This was the highlight of our trip to New York. With breathtaking views of the Brooklyn Bridge and One World Trade Tower, we didn't want to leave. Dinner reservations at 6:30pm were perfect to catch afternoon traffic over the bridge - but we still managed to see the spectacular sunset and caught a glimpse of the lights turning on across the bridge. \n\nThere were so many people tending to our table that I had to take notes: Our Dinner was tended to by (in order of appearance) a greeter, a coat check, a maître d', dining captain, a water attendant, a sommelier, our waiter, a bread server, and 2 bussers.  All of which made repeat appearances throughout our evening.\n\nWe stated we were celebrating our anniversary on the reservation and in turn, each of the staff knew and wished us a \"happy anniversary\" when they greeted us. This made us feel really special, particularly when the signature Brooklyn Bridge desert was served with a chocolate wafer inscribed with a happy anniversary wish.\n\nThe Menu:\n3 Course Dining Pixe-Fixe - $150/ea\n\nReservations\nA Must - Weeks in advance\n\nTransportation\nTaxi - The Valet will arrange for a flat rate return to your hotel.", "author": "DJ M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-21", "description": "My husband and I just celebrated our wedding at The River Cafe just a couple of weeks ago.  We live in DC and love NYC so when we saw River Cafe we knew this was the place we had to have.  Needless to say, this place had EVERYTHING we could imagine for our special day.  The manager Luke and staff made us and our guests feel like queens and kings!  The food was beyond delicious along with the spectacular view.  Our reception was a very small and intimate seated dinner and cocktail hour and we couldn't have asked for a more romantic evening shared with family and friends.  We took advantage of their onsite florist Maureen for not only the wedding flowers but for the tables as well and she did an amazing job with the most beautiful arrangements.  We also had a few gluten free and non fish eaters and the staff was extremely accommodating to these special dietary requests by making some of the passed appetizers gluten free.  They also made all the chocolate brooklyn bridge desserts all Gluten free and you would have never known!\n\nThe price is definitely in line for the immaculate custom service, amazingly great food (which everyone still talks about) and the view.  For those looking for something on a budget, trust me, it will be worth the extra cost as it includes everything from open bar during cocktail hour and a 4 course meal with dessert to organized car service for your guests when they leave!\n\n5 stars just isn't enough!", "author": "Brandy I."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-01-30", "description": "I came here for the restaurant week lunch prix-fixe and I'd recommend coming here only for the RW. For $24.09, my experience was pretty decent, can't complain. The view of the Brooklyn Bridge and Manhattan is priceless, I give extra star for the location. It's definitely benefiting a lot from the great view, because otherwise I'd rate this place as 3 stars. I know Jim U. would probably disagree with me again but I actually liked the lobster bisque. Despite the fact that it contains very few scallops, I enjoyed the flavor of the bisque itself - rich, creamy, and decadently flavorful. For me it was the best appetizer I tried that day, it was better than smoked salmon and lamb meatballs. \n\nWhat was most disappointing was the main dish. Yeah I know it's just a discounted RW prix-fixe lunch, but if this is the normal standard then I don't think this place deserves Michelin 1 star. I'd much rather give the coveted Michelin star to Chef Willy of Degustation(IMHO he deserves 3 Michelin stars!! Marry me now!!), even though I'm unselfishly happy that it still remains relatively under the radar of the mainstream public. Although the crispy duck was definitely better than the swordfish which was too dry and tasted more like a grilled chicken, neither one of them lived up to my expectations. \n\nThen came the desserts! Wow, all three of them for me?? Cool!! The dessert trio presentation was a really nice pleasant surprise because I wasn't expecting such generosity. However, I completely agree with Jim U. on this one, the dessert quality was decent, but nothing spectacular. The coconut sorbet had a nice elegant taste, it was light and the coconut flavor was subtle enough for non-coconut lovers too. The chocolate ganache was OK but somehow it reminded me of Kozy Shack chocolate pudding, sorry! And lastly but not least, the banana creme brulee was so rich and dense that I couldn't help myself comparing it to mofongo! Don't get me wrong, it was still delicious but the texture kept reminding me of mofongo(Don't worry, it still tastes like a proper dessert).\n\nAmbiance:A\nService:A-\nFood:B/B+", "author": "Jewel Y."}], "servesCuisine": "American (New)", "priceRange": "Above $61", "name": "The River Café", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Water St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/C_8aEbAvcCLhiqXn9QdWSw/ls.jpg", "@type": "Restaurant", "telephone": "+17185225200"}