{"aggregateRating": {"reviewCount": 1049, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-20", "description": "I came to this restaurant with the beau after he made an reservation a week or so prior. We made reservations for 11:30 and came for lunch on a Saturday afternoon. We came in through the cute front garden that they had when you walk in. \n\nThe service is amazing here, you walk to a booth in the front where there is a host available in assisting you to your table. And what I really appreciated is that it wasn't packed when you walk in. It's maybe 50% full and the ambiance is perfect for that. The live pianist is also pretty clutch. They bring the choices that you have for lunch, two different prix fixe choices that you could choose from. I chose a set with an appetizer and entree--the pork belly and scallop and the branzino, which came with i think pumpkin puree and cucumber dish. I gotta say, the pork belly and scallop was onnnn point. Definitely recommend. Even though there is literally one piece of pork belly and one scallop, it was definitely worth it. The vinaigrette complimented the pork belly and scallop so well. And the branzino..I don't know how they did it, but there was a piece of like corn bread crust on top that went soooo well with it. The consistency of the bread with the fish, perfectly crispy (and not at all soggy). Very tasty. The one thing that I would have appreciated is if they used less butter. Everything in the branzino dish was drenched in a lot butter. \n\nWe also splurged and ordered dessert. And thankfully we did, because it was one of the best desserts that I've had. I ordered the pistachio cake that came with I think a lemon or orange sorbet. The pistachio cake had the perfect crust/cakey portion that wasn't crispy and pretty tasty. \n\nTHE PRESENTATION FOR EVERYTHING WAS SO PRETTY! Everything came out as a work of art. This place is definitely a recommendation for those who want a fancy meal with a nice view of manhattan on the water, or a special celebration. I actually recommend going during the day, the glass windows make for good lighting and in my opinion, the view might be slightly better.\n\n**tl; dr: highly recommend the pork belly and scallop app and branzino entree. great for a celebration or a fancy date. I like it better during the day so you can appreciate the glass windows and view of the manhattan skyline. Call ahead to make a reservation.", "author": "Jenni W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-04-14", "description": "It's said on the website that there's a dress code for dinner. We are touring in NY for the first time and of course we need comfortable cloths so we booked this restaurant for brunch. Well, despite the fact that there was plenty of available tables by the windows we couldn't get one because of our casual cloths. And people kept looking at us which made this a terrible experience. Result: 200 dollars bill and we left the restaurant very upset. I wouldn't come back, and don't recommend. The food was not worthy of the value of it also, the mushroom Wellington tasted like nothing...", "author": "Livia M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-17", "description": "What a perfect location for my fiancé's birthday dinner! The food was delicious and presented beautifully! Our favorites were the steak tartare, the steak, and the lobster dish. The deserts were great too, especially the Brooklyn Bridge dessert which they so nicely brought out with a candle. Service was superb, with lots of attention to detail. Never felt rushed, so it gave us lots of time to enjoy ourselves here.\n\nAs other reviews have noted, window seats are difficult to get. I booked our reservation 2 months in advance and requested window seats, but no luck. Not a big deal, because the way seating is laid out here, both parties at a table for 2 sit facing the windows so we both got to enjoy the view.", "author": "Biana G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-03", "description": "Simply,the best!!\nWe had reservation and we were there a little early.\nWe had had a drink at the bar and right after that,\nthe personnel led us to a window table.\nunforgettable night!!!!!!!", "author": "Io S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-01-23", "description": "Impeccable service, romantic, beautiful, dreamy.  The view is gorgeous and Dumbo (the area the restaurant is in) is one of my favorite areas in the city.  \nThe food unfortunately wasn't as amazing so that's the only reason I didn't give it 5 stars.", "author": "Chifaa B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-05-03", "description": "Considering The River Cafe as a wedding venue?  Please read before booking (my sister had her special day here - ceremony and reception):\n\nPros:\nView of Downtown NYC\nVenue is quaint and intimate \n\nCons:\nSuggested that no rehearsal/taste test needed.  \nCoordinator/Maitre D was absent. \n -Guests waited outside not knowing where to go\n -Ceremony had hiccups (misplacement of candles/microphone was low).\nDJ was HORRIBLE. He messed up THREE songs.  (He did not have a good command of the crowd).\nRestriction on areas. READ: it's a cafe.  Quaint. Small.  Restrictions still?\n\nMy sister was definitely disappointed.  I was heartbroken for her.  Venue puts itself on a pedestal because of its location.", "author": "Pam C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-06", "description": "I came here for brunch recently and believe this was my first true experience in fine dining. It is almost overwhelming how attentive the service is. If you so much as have a negative thought pass through your head someone will be over to fix it in a heartbeat. At certain times I just wanted to be like look: I'm a messy eater I'm gonna got crumbs everywhere and use the wrong utensils-Please leave me alone. But of course their intentions are pure and much appreciated. The east/west coast showdown of oysters was great. Beautiful to look at and delicate on the palate. The steak and whipped potatoes were excellent too. Presented beautifully and cooked perfectly. The view is spectacular, of course. A quality and romantic dining experience", "author": "Nate C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-05", "description": "Food and Service are amazing.   My daughter has a severe food allergy and they made everything fresh and were very careful with her food.   Love love love this place!", "author": "Mariella C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-06", "description": "This place is a bit hard to find. Look for the stairs leading up to a garden and the restaurant will be at the back. I thoroughly enjoyed my lunch here. Two courses doesn't sound like a lot but I was STUFFED afterward. The food had interesting flavors often pairing sweet and savory sauces together. Everything I tried was scrumptious. The decor is  quaint and the views are fantastic.", "author": "Lin R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-11-17", "description": "Definitely a must try! \nEven though it is expensive and set price, it is an experience! Incredible location right under the Brooklyn bridge with the Manhattan skyline and the river as the view. \nThe food is delicious, I got the rabbit as appetizer and it was ok, then got the duck as the main and it was incredible. It was tender and very yummy. For dessert, I got the soufflé which was so soft and fluffy. The atmosphere is very elegant and everyone looks so refined. I went for dinner,  but this place also looks great for brunch! Definitely make a reservation but be sure to get a drink at the bar while waiting on your table to be ready because the view is amazing. \nThe servers are all incredibly nice and everything was served with barely any wait at all. \nI am very pleased with my experience.", "author": "Christine S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-04-12", "description": "Heck of a great place to go for breakfast. Expensive but no more so than for some far less fancy places in the area. Will go again when staying in the area.", "author": "Daniel G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-05", "description": "The River Cafe: \n\nWhat can I say? Upon arrival, you are already amaze at the spectacular view of the river and bridge prior to going into the restaurant. To be able to sit closer to the window was what I had in mind initially. But I guess the majority of the guest came to the restaurant for special occasions and they couldn't accommodate everyone's request. A quick tip, have an early dinner so that you can be seated for a better view of the river and city. Gentlemen are required to wear a jacket. \n\n\nOnly two options you can choose from. Either the pre fixed menu at $130 per person, choose one appetizer, entree and dessert. Or the chef tasting menu which consist of six course at $160 per person. We figure that six course might be too much food for us so we opt for the pre fixed where we get to choose our pick. \n\nWe order the: \n\nRed wine x 2, you will need this pairing with your meats. \n\nFoie Gras Duet \u0026 Roasted Rabbit: I didn't imagine the Foie Gras to look like this. I had imagine it to come out like a seared liver. Maybe I didn't pay attention to the wording on the menu. Once I see Foie Gras, I had to choose it. I never tried rabbit before, it tasted like juicy white meat chicken. \n\nLamb \u0026 Steak: the lamb was tender and flavorful. One bite and it was out of this world. The steak was an ok cut. The mash potatoes inside the bone marrow was just breathless. It was so delicious. Love the combo here. \n\nChocolate Brooklyn Bridge \u0026 Pistachio Freddo: desert was mouthwatering. The Brooklyn Bridge cake was beautiful. They also added a note on the side and input a candle for our special occasion. \n\nService: great! Water was refill and we were asked if we wanted more bread. Waiter check up on us from time to time.", "author": "Carmen L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-02", "description": "On our last night in NY we had the pleasure of dining at the River Cafe. This made for a very memorable last night. \n\nThe gardens surrounding the River Cafe are stunning, it feels as though you stepped into a different city altogether. With lights strewn across the lush landscaping, it makes for a magical corner of Brooklyn. You are welcomed by the scent of fresh flowers as you walk through the door. As you are shown to your table you can't help but get distracted by the views. \n\nThe only part in which we did not care for, was our table which for the two of us was situated directly next to another 2-top table- close enough it felt like we were dining with our neighbors and it took away from our ability to enjoy the view as it made us look directly through their table which was awkward. \n\nThe staff is top notch, very, very attentive without being overbearing. The food needs no commentary as it was all simply amazing. The portion sizes of each course are perfect, you will not leave hungry. Every little ingredient is well thought out and the presentation is nothing short of art. It's so beautiful that you almost don't want to disturb anything on your plate. I won't go into detail on what we ordered as I am very confident every single menu item is sure to be outstanding. \n\nWell worth every penny for the experience, the view, the service and the ambiance.", "author": "Chelsi B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-04", "description": "This is an enjoyable place to celebrate a special occasion. I think if you come early enough (by 6:30) you can secure a table by the water. View is amazing and suitable for taking pictures. \n\nService is fine, and I don't have no complaint. Appetizers and entrees all taste very good and their portions are actually quite generous, compared to other Michelin starred restaurants. Desserts are a bit disappointing-in between too sweet and flavorless, maybe because they are gluten free?", "author": "Simon T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-23", "description": "Never been for brunch before and it was truly spectacular, especially the lobster and tamale dish. And the special truffle ricotta gnudi. The service is always attentive. And the buzz on Christmas Eve Eve was pitched perfectly with the pianist's seasonal tunes.", "author": "Jeff B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-04", "description": "It was our third time in The River,\nLove it\nCeasar, Alex and ERNESTO were ours waiters and the Service was Just Perfect.\nExtremely friendly and  welcoming staff,\nWe had  Branzino and crab-cake, both of which were fantastic. \nYou can enjoy spectacular view of Brooklyn Bridge. \nThe atmosphere in the restaurant so relaxed thanks  to piano player, he is brilliant! Would recommend for a special treat.... \n\nAt The End Of The lunch  We Had Great Desserts ,, Wow What A Great time we had!!", "author": "Alice A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-25", "description": "This place is classic New York City fine dining, and the way it should be. It's straight up class and elegance, but without pretension or any stuffiness. \n\nFrom the moment you walk up to the property, you know you are somewhere that's special. With the bridge above and river below, you'd think the scenery is built in, but there's more. There's a magical garden just completely filled with flowers and luscious plants, with strings of lights everywhere. It's a scene out of a movie... you know, the one where the guy in love pulls out all the strings to make the most romantic scene humanly possible? That's the the garden is at night. \n\nWhen you walk in, there is a doorman in a jacket at each of the multiple doors to open the door for you. The crowd here is old school New York foodies. It's an older crowd, with jackets required. The music isn't thumping dance music, it's a guy in a tuxedo playing the piano. The drink menu doesn't have fancy cocktails with artisanal spirits and funky ingredients. It's a wine list and a bar that will make you the classics. \n\nUpon entering the main dining room, I noticed something about the seating; not a single seat faces away from the river. A circular table that could seat four only seats two so that no one misses the view of the river. This is the case at every single table. It's comforting to see any establishment that would rather give all diners a fantastic experience, rather than pack as many seats as possible. \n\nThe menu consists of two choices: three courses of your house for $130 or six courses, not of your choice, for $160. We opted for the three courses simply because we preferred choices from the main menu not included in the six courses. The menu, like the rest of the restaurant experience here, is classic elegant dining. Nothing crazy in the ingredients or presentation; just old school fine dining. \n\nWe shared all of the following:\n\nSmoked Catfish - this dish was sent out to us courtesy of the kitchen. It's a play on traditional Jewish appetizing (whitefish salad specifically) with a mashed up, smoked catfish served with a rye crisp. If you like your smoked fish and bagels, you'll like this. \n\nRabbit - it's hard for me to resist rabbit when I see it on the menu. This dish is three nice thick slices of perfectly tender rabbit loin, prepared absolutely perfectly. The other piece of this dish is a 21 layer rabbit lasagna. It's lasagna that's on another level, though the rabbit itself does get a little lost in the rabbit bolognese. \n\nScallop and Pork Belly - one nice large sea scallop topped with a fruit salsa, and meaty, crispy Pork Belly. Both items prepared elegantly and with restraint. \n\nLobster - butter poached lobster served with squid ink pasta in a lobster marinara sauce, with a warm lobster salad on the side, served in a hollowed out claw. It's a classic combination executed perfectly. \n\nBranzino - this one jumped out at me as a non classic, mainly because the fish is crusted in shrimp and chorizo. How they did this, I have no idea. It's got a crispy crust on the fish that has an extremely subtle flavor of both shrimp and chorizo, which is impressive considering how strong of a flavor chorizo is. It's perfectly balanced and still light. \n\nKey Lime Soufflé - the soufflé is light and airy, slightly sweet, with that unmistakable key lime flavor. It's fanta\n\nBrooklyn Bridge Cake - this dessert reminds me a little bit of the Chocolate Stove at Le Cirque. You know, one of these desserts that's probably been served here for decades and is a signature dessert. \n\nThis place is a welcome break from all the modern, high end dining, and a true NYC classic. Top to bottom, one of the best all around dining experiences I've had in a long time.", "author": "Dave F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-03-07", "description": "Ok so my and my hubby came here last minute we were out celebrating his accomplishments in life. Called while we were outside of the place they checked the dining area and told us someone canceled their reservation so they were able to accept. Attire was formal, I was not dressed formal at all! My hubby wearing a suit, job requires him to and I was wearing jacket I would say was trench like and fancy sneakers. As soon  as we walked in the kid at the door which I think was valet insisted we need reservation and we told him ummm we have reservation relax dude! Anyways we walked in couple of gals greeted us and asked the same, told them I just called and y'all told us to come on down. So we walk in and we were sat in the back in of a booth kinda thingy,  me and the hubs sat side by side. So my hubby decided to take his jacket off....... the stares he got from the concierge kinda scared us it's like the Principal coming in to the classrooms to see if all the students are doing what they are told. The food was good so was the dessert we had the prefix menu which was like $175 a person I believe. Was it worth 400$ I would say not really food was very littttttttttle that's my biggest complaint. I would've loved variety but any who we loved the experience we sat and made jokes at how everyone was so serious. Ppl stay hours there we literally stayed 45min-60 minutes tops. I think they need to step up thief game the fresh flowers everywhere isn't cutting it anymore.", "author": "Sara A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-27", "description": "We loved our entire experience. We sat at the bar and enjoyed the views for about an hour before our 9:30 reservation. We were timely sat at a table overlooking the water. We had the 6 course chef tasting menu, multiple French 77s and various wines. The food was unbelievable. The combination of flavors and textures shows why this restaurant is so highly rated. \n\nService was also impeccable and the restaurant had a great atmosphere. We didn't mind the dress code because it just added to the ambiance. When you're spending over $500 for dinner, you don't want to see people in jeans.", "author": "Jen O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-04", "description": "We've been for drinks at night at the beautiful old bar. Most recently We sat for the three course lunch. It was a wonderfully indulgent experience. Each course was more special than the next. Drinks are mixed to perfection here too. Service is impeccable. So refined. The restaurant overlooks the NJ skyline and sits on a barge over the river. It's really cool and amazing for a special occasion. It's an expensive restaurant, but totally worth it given the quality of the dishes and the service.", "author": "Jennifer S."}], "servesCuisine": "American (New)", "priceRange": "Above $61", "name": "The River Café", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Water St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/C_8aEbAvcCLhiqXn9QdWSw/ls.jpg", "@type": "Restaurant", "telephone": "+17185225200"}