{"aggregateRating": {"reviewCount": 1049, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-11-11", "description": "The view was really nice, as well as the area in front of the restaurant. It had a very romantic vibe. However, I did feel it was rather expensive, and it gave me a stuck up feeling. The meal was good, but not outstanding enough to justify the cost.", "author": "Marisa A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-12", "description": "Beautiful setting, impeccable service and a fabulous meal. Best birthday meal ever. Steven was charming, knowledgeable and fun. Wonderful night out.", "author": "Cathy W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-23", "description": "Came for a wedding, so imagine decadence upon decadence. I won't be adding anything new as I believe everyone is aware of the excellent service, high caliber food, and unsurpassed view. That being said, the wedding party was small, intimate, and adults-only - I'm not sure if there were children present whether the ambiance would have been as elegant and refined. Also, the temperature could have been better regulated in the tent and dining area. I would come again in a heartbeat.", "author": "Angel C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-07", "description": "Chose The River Cafe to celebrate my Mother's 80th birthday.  She was overwhelmingly pleased with her evening.  We all enjoyed our meals with a bird's eye view of the world's greatest city (full disclosure - born and raised in Brooklyn - we are authentic New Yorkers).  The service was excellent.  This is fine dining.  If you are expecting \"a\"  portion size to be enough to feed a family of 8 - you might want to reconsider visiting this restaurant.  All others - book a reservation and experience fine dining with a fabulous view of our skyline.", "author": "Maggie G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-06-29", "description": "Came here and was expecting great food and service, boy did they deliver. The second we walked inside we were greeted by an array of flowers beautifully arranged and just smelled oh so good. An attractive hostess greeted us and sat us on the side of the dining room, I thought my wife and I would be sitting across from each other but instead side by side, like we were watching some show or something, kinda weird. \n   The Wagyu steak tartare was delicious, a mix of different spices and flavors mixed into raw beef top with egg yolk was just perfect. My entree; pan seered fish was well made, fresh and flavorful. \n   The wait staff was kind and attentive. Alot of em pretty down to earth. Prices are a little better than the city prices. I would def come back.", "author": "Dreyfus W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-01", "description": "I've eaten here a few times. The service is impeccable and the view is like none other. I've dined here for pre-fixe dinners. They switch up their menu from time to time. I've had raw oysters as an appetizer, also a grilled octopus dish which was presented beautifully and tasty! I've had the halibut entree and the fish was seasoned well and cooked properly. My boyfriend had the steak entree with bone marrow and potatoes - this was a larger portion size than expected and quite rich. The lobster entree was also delicious. Most recently, they had a seafood duo appetizer special - one sashimi-style crudo (?) and also a tartare -- several at my table ordered this and loved it. Their desserts are the best part. Though they are most famous for their chocolate bridge dessert (get this if you're a chocolate lover), I've also tried their s'more souffle which was delightful. I want to go back to try their pistachio dessert! The ambiance is lovely and it's a perfect place for a date or for a family dinner.", "author": "Kristina N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-25", "description": "Wow, this place is amazing!  I went here last with my finance for a special occasion and will definitely be back.  Everything was perfect! The outside is adorable - it feels like you are in Florida with beautiful cafe lighting and it very secluded.  Inside, the views of the city are amazing.  The food was delicious (we got the 6 course tasting menu and they threw in a couple extra courses).  I believe it was $145 per person.  There's also an option of a 2 course menu for $115 but we were glad we went with the tasting.  The service was amazing! I definitely recommend the River Cafe!", "author": "Kathleen S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-03-29", "description": "Went here for my birthday...Beautiful spot that can't be beat - right on the river, view of the bridge.\n\nIt's great if you are looking for a place that will definitely feel like a special occasion.  Come DRESSED UP and enjoy the formal, romantic scene.  Lovely views, live piano player, beautiful entrance, etc.  Limos pulling up with folks celebrating their anniversaries, etc etc.  \n\nThe reason I didn't give it 4 or 5 stars is because the meal is either $100 or $125 a plate.  It's just TOO MUCH money for what you're getting - even if it is the River Cafe.  \n\nI had the branzino - something I LOVE everywhere I order it - and to be perfectly honest, it was BLAND and I didn't like the cornmeal-ish breaded top they put on.  The flavors didn't all blend together.  The steak was great - but if I was going to get a steak, I'd probably prefer one at one of the many REAL STEAK JOINTS in Manhattan - even though those are expensive places, you can still get a perfect, top notch steak for $50, rather than $100!  Best thing we had was the ceviche appetizer.  The dessert was great too - I had whatever the chocolate dessert was that came with a \"bridge\".  Incredible presentation.  I wasn't a huge fan of the goat cheese cake though because I am more of a cheese cake purist....the goat flavors didn't really enhance it for me.  \n\nThe waiter was extremely pushy.  He was really peeved that we didnt' get the $125/person tasting menu and just wanted the $100/person meals.  He also gave me crap about not wanting to eat foie gras.  I have moral issues with foie gras - I don't need to be told that I'm missing out on the best thing in the menu and that I should have it anyway.  It was a little irritating.  He came back 3 times to see if we wanted more time to decide on getting the $125 meal.  Each time, we said, yeah, I think we'd really like to just get the $100/meal...and he'd be like, OH you're missing out... I'll give you more time to think about it.  It was pretty degrading.  When my husband and I spend $200 for dinner (2 appetizers, 2 entrees, 2 desserts) I don't want to feel like I'm going for the cheap, less exciting option.  I want to feel like I'm going out for a special night!  \n\nAll in All, it was a beautiful, romantic evening -  definitely felt like a special night, but was it worth the enormous bill?  I just don't know.", "author": "B P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-26", "description": "This is a bucket-list must do.  Table by the water view, steaks rare, glass of red wine and of course the Brooklyn Bridge dessert.  It's expensive but you are worth it (at least once)!", "author": "Josephine W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-07-18", "description": "This restaurant is located near the beginning of the Brooklyn Bridge and has beautiful views of lower manhattan. There is a lovely garden out front. The atmosphere is beautiful. \nI found the staff to be very pretentious and quite uptight. The food was delicious but the portions were small, even by fine dining standards. \nIt would be a nice place to take someone if you wanted to make a good impression.  I think for the cost the service should be better. The snobby service took away from the dining experience.", "author": "Kia N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-24", "description": "Love, love love this place!  Amazing ambiance - great to see the sun set.  Food is great and so is the service.", "author": "Ann S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-10-13", "description": "Came here with the perfect person on the perfect occasion. Overall, it was rather perfect. Couldn't have asked for a more perfect way to celebrate a wonderful year together. hehehe :)", "author": "Rainbowz R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-01-17", "description": "food is amazing, i tried rabbit. atmosphere is nothing special. pricy which isnt surprising. view from inside restaurant isnt magnificent. been there tried it but thats about it", "author": "Sasha H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-01", "description": "Love the setting of this romantic restaurant. Felt like you are on a fancy boat. Love the food and the wine selections. I've been to The River Cafe a couple of times and \nnever disappointed me.", "author": "Bbking K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-17", "description": "I loved this place. I use to stop off for dinner with my date before heading into the city. You pull up and the restaurant had all twinkling lights and the valet would help you out of your car. You would head in to a beautiful room that overlooked downtown Manhattan while sitting under the Brooklyn Bridge. The food was incredible. No matter what you ordered on the menu you would not be disappointed. It was also nice to be able to sit outside and have a drink before the night continued while take in the view of New York City. Sorry to hear that it was hit by Sandy.", "author": "Diana C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-07-10", "description": "We went her for a romantic anniversary dinner- like many others seem to do. The River Cafe has a good reputation for the amazing view and the ambience, and I suppose the food? Frankly for the price, I was not very impressed with the food. You are definitely paying for the view, and the place seems a bit overwrought with tourists. If you are not sitting at a table right by the water you are not getting much of a view either as the place is so crowded.  I didn't feel it was a romantic dining spot, but rather loud and a bit pretentious. I felt a bit disappointed given the hype.", "author": "Tara K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-06-03", "description": "Yes, it's bloody expensive ($90 for brunch, including a glass of champagne and a tip).\n\nYes,  it's a two day trek on a good horse to get there from the Upper West Side\n\nYes, they have the air conditioning set to stun\n\nBut THE VIEW, people, THE VIEW.\n\nAnd the food ain't bad either (but it should be at that price).  How adorable are their amuse bouche - little banana flans served in an eggshell? For my entree, I had the Branzino which was deliciousness incarnate - who know that fish went with toasted brioche?  My dining companions were equally thrilled with their meals - I had my eye on the eggs benedict..\n\nIt's the kind of place I would take out of town folk for the view of Manhattan, but I'm not sure it will be on my regular list of spots to dine.", "author": "Lisa M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-10-18", "description": "the is located just under the brooklyn bridge, it has valet parking, there is a greenway near by, the view here is just awesome and beautiful, this area is quietly becoming a tourist attraction. i was here x number of years ago for a special occassion and i can't see myself paying a lot of money for a small amount of food, is any food really worth that much, your bill can run up very high, i had some sort of three course meal and the food was okay, i've had better, the service is great and the atmosphere and setting is good, the food can use some work, was ok.  the price definitely does not match the quality.  For this amount of money, i can have multiple quality meals, but if you don't try it then you won't know.  at least i said i tried it.", "author": "Bakchun K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-12-29", "description": "This place is old-school formal dining at its best.  \n\nMy mom and I hit up the River Cafe before heading to the theatre last night after a friend recommended it to me.  I, of course, wanted a reason to indulge in a pricey meal with an amazing view and what better time to do it than in the holiday season - the perfect time of year to excuse overindulgence.  The River Cafe is pricey but worth every penny.  The service is impeccable and the food is wonderful.  For their dinner menu $98 gets you an appetizer, main course and a dessert.  Some items have wine pairings for an additional cost.  \n\nI had the foie gras two ways for my appetizer.  It was insanely amazing.  My mother had scallop ceviche which was refreshing and delicious.    For my entree, I had their lobster special.  Again, delicious.  My mom had an organic chicken breast with cornbread stuffing and it was, you guessed it, delicious.  We skipped out on dessert since we were pretty full - not disgustingly but pleasantly since all the food is pretty rich - but handmade chocolates were offered to us.  How could we pass up?  The sea salted caramel chocolate was orgasmic.\n\nI am planning on returning to the River Cafe for a special dinner in the future.\n\nAnd one note for the men - if you don't have a jacket they don't have any to offer.  I love that jackets are required for dinner.", "author": "Nicole D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-04-01", "description": "Ambiance? 5. Service? 5. Flavor? Ehh..\n\nThe appetizers were definitely the best part of the meal. I ordered the rabbit and dumplings: SIMPLY EXQUISITE! if you've never tried rabbit before, you should! \n\nFor the entree, I ordered the lobster, which was recommended by my server. When I received it, the lobster was much smaller than I had anticipated, it was a tad overcooked as the meat was a bit on the rubbery side, and both the citrus vinaigrette and taro puree were not strong enough of flavors to compliment the lobster. I did enjoy the bits of grapefruit, but overall, an over-cooked lobster totally ruined it for me. \n\nThe dessert was also sort of bland. The Brooklyn Bridge dessert is quite a piece of art, but my compliments stop there. The Caramelized Apple and Almond Tart was good, but not Yelp's $$$$ status good.\n\nThe ambiance and service alone made the trip unforgettable and something I do not regret, but the lobster was just too dissappointing.", "author": "Ronald T."}], "servesCuisine": "American (New)", "priceRange": "Above $61", "name": "The River Café", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Water St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/C_8aEbAvcCLhiqXn9QdWSw/ls.jpg", "@type": "Restaurant", "telephone": "+17185225200"}