{"aggregateRating": {"reviewCount": 1049, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-20", "description": "This restaurant is simply divine! Form the moment you arrive, you feel like you've stepped into another world. A beautiful world! I love the bar with the piano player and those incredible views and delicious cocktails!!! This was the first time I have been for brunch and everything was delicious, particularly the pork appetizer and the lobster with truffle risotto main course. The service is great and even the bathroom is pretty!", "author": "Lisa D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-24", "description": "Me and my girlfriend went here for our first anniversary the other day. This place is great, service was top notch. One of the gentleman had a table that opened by the window and we were able to get the beautiful view of the city. The plan was for me to open my gift inside...with the waitress assuming it was my birthday she asked and told her it was our anniversary. Later during our 3 course meal our desserts had special anniversary notes made of chocolate with candles a very nice touch on their part. At first when I located the area the place was near it was difficult to noticed the place cause the driveway they have changed to cobblestone and I thought it was a walk path but it was the entrance. It was a beautiful place next to the Brooklyn Bridge. Even though a little chilly outside we were ab I ever to get some great shots of us together. Won't ever forget this.", "author": "Anthony G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-22", "description": "Perfection at its finest. \nWent to River for a very special birthday celebration and could not have been happier. The environment was perfect the staff were extremely friendly and knowledgeable. Not to mention how we were made to feel as royalty. I highly recommend the tasting menu with the wine pairing. This way you can truly allow the chef to show his brilliant personality through his work of art. 5 stars indeed. Bravo!", "author": "Luke S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-19", "description": "Came here for an anniversary dinner with my husband and had a really nice time. The ambiance is beautiful- amazing views of the city. The service was on point. Started with cod as an amuse bouche, which I didn't love. The bread service as well was unimpressive- hard butter and not tasty bread. But I don't consider that very important\n\nFor apps, I ordered the snapper, which was incredible. My husband ordered the crab cake, and I can honestly say it was the best crab cake I have tasted ever. I was jealous of his choice. For my entree I had the branzino, which was paired with artichoke ravioli. The ravioli had a nice tanginess to it and the branzino was bathed in a very rich lobster butter sauce. My husband ordered the lamb and spent the evening raving about how delicious and tender it was. I tried a bite and it was flavorful and well cooked. \n\nFor dessert we both ordered the Chocolate Brooklyn Bridge- rich and tasty. They gave us some complimentary chocolates for our anniversary. The entire experience was lovely, the food and service were totally worth the price.", "author": "Sabina K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-20", "description": "We were be seated at great spot with front view of Hudson River. Tasting menu really worth the price and we were left with fully filled stomach.", "author": "Lida X."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-09", "description": "well well well!! a NYC gem for sure!! definitely a splurge of a night, our bill came out to $423 for 2 of us, with 3 cocktails and tip. BUT this establishment has by far the best cuisine we have had in a long time! besides the gorgeous view of the harbor.. we came for dinner, everything we ate was more delicious than the previous. we had the duck and steak as our entrees and they were absolutely perfect. my duck was so tender u didnt even need a knife, seriously. the steak had such a wonderful char on it, it was splendid. as apps my husband had the pork belly and scallop, once again so tender he was only using his fork to eat. and i had the goose liver as my app, i have gluten sensitivities and the chef subsidized ingredients for me, awesome. i added pictures, they speak for themselves.. \nthey gave us a lil sumthin to start that was on the house, and at the end a couple if chocolates and a mini macaroon \"compliments of the chef\"\nstaff was stupendous, amazing people. BUT\n YOU MUST BE DRESSED TO IMPRESS. for the ladies that means, heels and a conservative dress/skirt. men have to dressed in a full suit including the jacket and the shoes, they weren't pushy w the ties, my husband didn't wear a tie and they didnt give him a problem. \nthere is a parking lot and also valet is available. \nservice is by reservation only. \nwe will definitely be back, but maybe in a few years considering the bill almost gave us a heart attack lol but it is stated $136 per person 3 course meal.", "author": "Ann N."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-30", "description": "Would like to vote 0 if I can. Rude staff and Rude captain. not so nice view, even worse if you were arranged not beside Windows.. you can get the same view right outside the Pier just beside this Rude restaurant! Don't waste ur money!\n\nI don't know if they are focusing on their food and service or focusing on what guests wear, but I can say to this restaurant, Without the guests. you are nothing!\n\noh, by the way, heard sometimes you even have to give small money to the captain to get a seat by the window...can't believe that!", "author": "Peter L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-09", "description": "I recently took my husband here for his birthday. This is definitely a \"special occasion\" place. Prepare for prices in the stratosphere. Having said that...if your looking for amazing food, followed by amazing service in amazing atmosphere, you would be hard pressed to find a place of it's equal. You cannot put a price tag on the incredible ambiance of this place. If you're a \"foody\" or looking for something special River Cafe will not disappoint. The astounding views make this place a must go to during the holidays or on a summer night.", "author": "Michele L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-08", "description": "We just celebrated our 58th Anniversary at the River Cafe. I must say this is the best meal that we have eaten in any restaurant! We have eaten in Paris, other New York restaurants, the Broadmoor, several in  San Antonio and Santa Fe as well as London and they can not compare. The service is excellent. We thank Ricardo Granadon and his staff for that. The food is without exception the best we have ever eaten and the presentation is extra- ordinary. We will come again whenever we come to  New York! \nThanks, River Cafe, Dr. Patricia Wallisch", "author": "Patricia W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-24", "description": "I love this place and look forward to coming every year. WE had dinner here on Saturday the 21 and it was wonderful as always. The staff always remembers us and is so friendly and welcoming. The servers are friendly, attentive, and helpful. The view is always so beautiful and the atmosphere so sophisticated. We always love getting the tasting menu and we really appreciated the fact that they were able to accommodate our group of five with two pescatarian's and several meatatarians lol. They also do wonderful wine pairings and their food is just amazing. We had a great time as always.", "author": "Katie Y."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-12-19", "description": "The only thing great about this place is the view and the restaurant hostess/servers were nice. Came here few weeks ago from out of town for birthday celebration and made a reservation ... btw very complicated to make a reservation for a party of 5. Requested a window seat under the bridge when making my reservation and was told they don't reserve specific tables until we get there for our reservation. Okay so we arrive for our reservation, again asked if we can have a window table because I noticed there were plenty open. Then we were told window tables are reserved for party of 4 or less. Okay whatever! The breakfast was okay, I got pancakes and they really were nothing special for $24 pancakes. But the real issue we had with this place was we split the bill 2 separate ways... the server came back with TWO different receipts to sign ... \n\nCouple days later once we already left NYC, I noticed I was charged more than the amount of my personal bill. ($201 which wasn't even the grand total) !! Contacted the restaurant multiple times manager was never in to handle this issue. Finally got a call from manager (Scott) and tells me to wait for corporate to get back to them?? 3 weeks later I get a call back from Scott saying that because the person I split the bill with's card got declined, they went ahead and charged the full amount to my card and that in order for them to fix the issue they need that person's card Info??? \n\nWhy weren't we told right away that the other persons card wasn't working \u0026 second of all why were we given two different receipts to sign for the payment if only one card was accepted?? Makes absolutely no sense !! NO I will not give you guys another card information again ! \n\nWelp lesson learned always keep your receipts! \nDo yourselves a favor and listen to the other reviews - window seats for white people only !", "author": "Angelica T."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-12-18", "description": "Completely felt discriminated..came here early before they opened completely empty.\n4:50 ish \nOh were visiting from los angeles\nwe went to have some coffee couple businesses away \nReal nice place\nCompletely nice staff\nI told my wife\nHey babe\nSeems pretty expensive call in make sure we get a window seat.\nShe called in and staff told her\n\"Gentlemen need to wear a jacket\"\nWell i assumed a black coat?\nIdk\nThey didnt mention dress code.\nMy wife was turned off and didnt want to go in.\nI said well were here lets try it.\nWe walked in anyway\ni think i was dressed ok\nDress shoes\netc\nThey just looked at me and said completely full\n(Im hispanic)\nSo idk\nThey NEVER SAID dress code etc\nJust looked at me and said they where completely full.\nplace was completely empty.", "author": "michael g."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-11-27", "description": "Food was mediocre (chewy lobster, overly sweet risotto), although the amuse-bouche was a highlight.\n\nDecor and staff attire was outdated and borderline comical (Is this a 1982 Sigourney Weaver movie set?)\n\nFor the price, I'd expect perfection and meticulous attention to detail but both seemed to be significantly lacking.\n\nThe icing on the cake was hair in our food (see photo). I'd expect hair in a take out restaurant, but River Cafe? Very disheartening.", "author": "Daria K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-04", "description": "Absolutely amazing! \nCame in a few minutes earlier than reservation time and was immediately seated. Breakfast was absolutely amazing, from presentation to flavor. Definitely a great place to visit for special occasions, and/or visiting NY.", "author": "Jay S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-18", "description": "We had the prix fixe menu for dinner there. Food tastes great, the presentation looks pretty. Nothing too special or creative, but they all tastes good. The view was amazing and the service was good. It's a bit pricey, good for date or special occasions", "author": "Angela Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-24", "description": "I've been to the Rive Cafe many times and is only fair to write this review. \n\nGreat ambiance in the restaurant; fun place for friends, groups, or a date.\n\nService was on top of it!", "author": "Claire C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-08", "description": "Went here for the first time on our anniversary. \n\nExcellent service - All the staff members were extremely helpful and willing to give us the best experience possible, and available at any moment when we needed them. However, when the dinner service picked up it did seem a bit rushed at that time. \n\nFood - The branzino and scallops were exquisite, along with the pairings of appetizers that we had. The Brooklyn bridge dessert is exceptional as well!", "author": "Pete A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-16", "description": "I have not one negative thing to say about this place. I went there with my BF of our Anniversary. Soooooooooo gooooooddd!!! At first to be honest when I first looked up the place I was closed minded thinking that because of the portion size I would not be filled at all! But boy was I wrong. From the vale down to the servers everyone did an exceptional job! And compliments to the chef. Everything was delicious! It was so good that I started to do my little happy dance.  If I could I would go there everyday! Hopefully the next time I go back it will be for my engagement hahaha.", "author": "Lisa A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-07", "description": "This is probably my favorite fine dining experience to date in NYC. My husband brought me here for our one year anniversary, and the overall ambiance was so romantic and elegant. The service was top notch, and we felt so taken care of the entire time we were there. The food was also impeccable, and if you are a foodie like us River Cafe is definitely a must try!\n\nWe arrived half an hour early and sat by the bar for a cocktail prior to getting seated. Because they only offer tasting menus, tables are prepared and waited in waves. We got seated around 5:30pm it seemed like the next group of reservations started around 9:00pm.\n\nTip: make sure you ask for seating next to the windows. You'll be sure to enjoy the experience even more being right by the water looking over to Manhattan.", "author": "Kayla C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-16", "description": "My husband and I had an intimate dinner here on our honeymoon back in August. The view and ambiance were breathtaking. It was almost surreal. I felt like it was a scene from a movie. The staff was so accommodating and the food and drinks were phenomenal. We will be going back here to relive that special moment again in the very near future.", "author": "Charles P."}], "servesCuisine": "American (New)", "priceRange": "Above $61", "name": "The River Café", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Water St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/C_8aEbAvcCLhiqXn9QdWSw/ls.jpg", "@type": "Restaurant", "telephone": "+17185225200"}