{"aggregateRating": {"reviewCount": 1049, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-30", "description": "This is a very romantic setting for a wedding. There are beautiful flowers on the outdoor patio where the ceremony is held. Incredible views of the NYC skyline to enjoy during the cocktail hour. Move inside the glass pavilion for a delicious meal as the sun goes down. Fine atmosphere and first-class service all around. Would like to come back for dinner someday soon...", "author": "Alex S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-05-25", "description": "Save your money. First, let me say, I grew up less than four blocks from the River Café ,and remember when the mooring was used as Barge Music.  I have been to the restaurant several times over the years, and my experience has always been the restaurant is crowded, loud and very expensive.  I and my fiancé were visiting NYC and decided to go for a special meal. We were wedged at a very small table , away from the window, and basically ignored for most of the evening, while the wait staff attended to a very large table of 20 somethings who were consuming copious amounts of alcohol, and were very loud. At the end of the meal , I felt disappointed and ignored. Like a lot of NYC these days, it is a clear case of \"the Emperor's new clothes\".", "author": "George M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-01", "description": "The restaurant as a bit crammed but had a beautiful view of Manhattan, the Brooklyn Bridge and the East River. The food was great and you can have ask much bread as your heart desires. For my liking it was a little pricey but worth going to for special occasions. I'm sure it is more beautiful in the evening.", "author": "Yasmin P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-21", "description": "This place is adorable, albeit it was a cold night when we ventured in. Although it's a bit pricey, the staff seemed attentive and friendly; regardless it might seem like snooty joint. Only were able to grab drinks here, but I would pay for the pricey meal, just for the view and service alone. The view alone is worth it to me. On an autumn day or summer night, would be ideal sit on the patio and watch the passerby's.", "author": "Elle L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-23", "description": "Very beautiful restaurant. Everybody should go there at least once for the experience. Every plate has character and the atmosphere is breathe taking. Definitely a hidden gem in NYC.", "author": "Susen A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-19", "description": "A true 'Special Occasion' spot.  Yes its expensive, but this isn't a place (most) people come on a regular basis.  Can't beat the view, nice embiance, great service, and the food lived up to its Michelin star.  They were very accommodating of dietary restrictions.", "author": "Thomas M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-12", "description": "One word for it amazing. Food everything. Romantic the best place I ever been to. Very elegant and just incredible food. Only thing it's very expensive. But worth it.", "author": "Mario C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-29", "description": "I had our anniversary dinner here before hurricane Sandy.  This is a very high scale restaurant. The food is expensive but the quality and the service is top notch.\n\nGents are required to wear a jacket.  Don't even think of showing up in street clothes or beach attire.  This is not some hamburger joint.\n\nThe views of downtown Manhattan are amazing.", "author": "Scott H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-18", "description": "I had such an amazing night at the beautiful River Cafe. I still day dream about their steak. The servings were just right and the view was beautiful. I would definitely go back with my family for special occasions.", "author": "Jassiel M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-04-04", "description": "I've been wanting to go here for a while, and while I'm glad I did, I probably won't go back. The food is fine but for the price you can get much higher quality fine dining food and service at say Bouley. I guess you are paying for the view. Service felt rushed and a little ad hoc. We had to ask for a wine menu as well as bread (we had a late sitting and were starving!). We also seemed to have many different people serving us. Overall though the setting is lovely and given its history it's still worth a visit to make up your own mind.", "author": "Kylee D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-09", "description": "I loved the atmosphere here, it reminded me of old school hollywood with immaculately dressed waiters and a restaurant overflowing with fresh flowers that smelled amazing when we walked in the door. \n\nMake sure to get a window seat with a beautiful view, I was there after sunset but it was still very nice. \n\nWe were unable to do the tasting menu which I was somewhat disappointed about, but the meal was delicious nonetheless. \nThe only hiccup was when the amuse-bouche had shrimp in it, which I had told them I was allergic to. They replaced it with a \"salad\" of tomatoes and raw cauliflower which seemed very thrown together and uncreative. \n\nAppetizers: \nRabbit Crepinette and Tuna ~ Foie\nThe Tuna ~ Foie was my favorite thing I ate, I would come back her just to eat it again.  The rabbit was delicious as well. \n\nEntrees: \nMonkfish and Duck Breast\nThe monkfish bored me a bit, I was not super impressed. The duck was very flavorful but I was not a fan of the sides that were paired with it. \n\nDessert: \nYou have to order the chocolate Brooklyn bridge, not because its tasty but because its adorable. We also had the souffle which was very well done. \n\nOverall it was a lovely evening, I might come back to try the tasting menu some time.", "author": "Jess L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-01", "description": "This restaurant has it all: fantastic view, great ambiance, fastidious service and food that is out-of-this-world good. I also had the best cosmopolitan martini ever here. It can't even be described. But the food..the food!! Octopus appetizer cooked so that it was like butter; scallop and pork belly appetizer that made you never want to stop eating, and steak tartare with a presentation as fun as it was to eat. For our entrees we had Black Sea bass, strip steak, lamb and duck breast. Each dish was perfect, flavorful and heavenly. It really was one of the best meals I've ever had. The wait staff was attentive and knowledgeable, and really made the entire dining experience first rate. Can't say enough great things; if you have the cash for a special occasion or just an amazing night out, definitely go here!! (Cheap it is not!)", "author": "Janne P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-04-30", "description": "I've read great reviews for this place and decided to take my boyfriend for his birthday. Although beautiful I was very disappointed. Even though there were seats open by the window we were seated there; maybe because we're in our late twenties, younger than majority of the crowd. For $300 the food was mediocre at best. I wanted to love this place because it's beautiful but it was very disappointing. I would not recomend this place nor return.", "author": "Gina H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-31", "description": "I have been twice with my boyfriend, and had a lovely time. The first time we were seated right by the window, and the second time we were seated at the second closest table to the window. They have a prix fixé menu for $125, and the other for $150 if I remember correctly. The last time he ordered lobster, and I had the filét mignon, and both were scrumptious! I would definitely go back again. BTW, men must have a blazer. If you do not have one, I think they offer you one. I am not sure if it is for a fee or not.", "author": "Lucie-Anne V."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-06-17", "description": "Wow. Do I have to give this place a star at all. This place is completely atrocious. Staff is obnoxious for no reason. Manager was uber uber wanna be posh establishment someone that I would categorize as a man with \"petty power\". Decor looks like my grandmother decorated it. Turned off from the moment we walked in. We left.  I agree with the previous review don't go to this place if u are Asian or anything other than old and Caucasian.", "author": "Sarah C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-19", "description": "This place is just one of a kind. Old world charm. Piano player. Service is impeccable as well as the food. Not to mention how incredible the view is. Steps away from the East River ferry.  Highly recommend recommend this place.", "author": "ALisa R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2007-11-07", "description": "OK, so do you remember that scene in \"Terms of Endearment\" when Debra Winger - I mean Emma - is taken on a trip to New York by her best pal Patsy after she finds out she has cancer? They end up meeting Patsy's patronizing friends for lunch at a posh restaurant...\n\nPATSY:  Emma, this is Lizbeth.\nEMMA:  Hi, Elizabeth.\nLIZBETH:  Hi. It's Lizbeth.\nEMMA:  Isn't that what I said?\nLIZBETH:  You said \"Elizabeth\". It's Lizbeth.\nEMMA:  Oh, two names? Liz Beth?\nLIZBETH:  No, one. Lizbeth.\nEMMA:  Lizbeth?\nLIZBETH:  Never mind.\nPATSY:  And this is Jane.\nEMMA:  Thank heavens!\n\nWell, they met at the River Cafe, and ever since I saw Debra Winger talk about dealing with the tragedy of her cancer in front of the Twin Towers across the river (...a foreboding and somewhat ironic sight when you see it now), I had this hankering to come here...especially when I saw the strawberry shortcake Debra WInger was about to devour. I knew it was going to be a pricey place, so it would take the right occasion to justify the cost.\n\nSo Jamie W. and I took a trip to NYC together this past weekend to see \"Young Frankenstein\" (a present from him to me) and have a nice meal at the River Cafe (a present from me to him). A 2PM Saturday lunch was the only reservation I could get on short notice, but it turned out to be a comparatively good deal, a prix-fixe per person of $45, a full $40 less than dinner.\n\nIt's actually a modest place size-wise, a floating barge simply and tastefully decorated and surrounded by a garden that's past bloom this time of year. We were seated next to the window in order to take in the view of the Brooklyn Bridge (see photo). We were immediately served a complimentary appetizer, homemade granola in cream inserted in an eggshell cracked open and nestled in an egg holder (see photo). A tasty loaf of nutty cranberry bread was left for us to munch on while we perused the menu.\n\nFor our appetizers, Jamie went for the devastatingly good Crab and Shrimp \"Duet\", fresh Maine crabmeat wrapped in a cucumber and floating in a citrus-sesame dressing coupled with five crispy marinated shrimp with chili and ginger (see photo). I ordered the very fresh Ceviche of Taylor Bay Scallops, five modest scallops topped with sea beans, tomato and coriander sprouts presented on top of a silver tureen filled with crushed ice (see photo).\n\nThe entrees were even more impressive. Jamie had the Duck Steak and Egg, which consisted of a crispy duck breast topped with marinated red peppers and sauted pearl onions, a coddled duck egg embedded in a pastry shell, a wild mushroom 'chasseur' sauce and a grilled duck sausage (see photo). Wow. Mine was the equally grand Prime Sirloin and Short Rib, slices of charcoal-grilled sirloin on top of russet potato puree and a braised short rib shredded and mixed in a Pinot Noir sauce and topped with a poached egg with Hollandaise sauce (see photo). Decadently carnivorous.\n\nWe decided to share a dessert after all that, and we picked a winner with the Goat Cheese Cheesecake, which came with a passion fruit sauce and a refreshing peach sorbet (see photo). Throughout the meal, we shared a bottle of Italian Prosecco, a relative bargain for $35 and just as bubbly as a first-rank champagne. What a perfect afternoon...I guess we could forget about going to the Brooklyn Ice Cream Factory next door for a scoop, eh.\n\nFOOD - 5 stars...culinary delights keep coming with no disappointments with our selections\nAMBIANCE - 5 stars...low-key formal and sedate with a spectacular view even on a cloudy day\nSERVICE - 5 stars...impeccable\nTOTAL - 5 stars...likely my best luxury-level dining experience in New York", "author": "Ed U."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-27", "description": "Nice place. Ok food. Bit pricy. Mixed crowd. Gents this is not a park  would visit again", "author": "Giovanni R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-27", "description": "What a wonderful place! Great food, attentive staff, and awesome views.  As for people complaining about the \"conservative\" atmosphere, having to wear a jacket, price, etc.... hey then dine at any other of the 7,000 restaurants in NY and do us a favor, don't go.", "author": "Jackie L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-09", "description": "Great restaurant with drop-dead gorgeous views and frendly service. From the moment we entered the restaurant to when we left,all staff were courteous and very attentive.the river cafe' is an incredible landmark.its something that will always come to my mind when i think about brooklyn heights. I do not remember  times when it was not where but i do remember first time i came to the river cafe' to celebrate.", "author": "Mark P."}], "servesCuisine": "American (New)", "priceRange": "Above $61", "name": "The River Café", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Water St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/C_8aEbAvcCLhiqXn9QdWSw/ls.jpg", "@type": "Restaurant", "telephone": "+17185225200"}