{"aggregateRating": {"reviewCount": 1049, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-10", "description": "Had such a beautiful time at this breathtaking restaurant! Perfect for special events! Celebrated our one year at River Cafe and everything from the staff to the food was on point. If you are planning a special dinner do not hesitate and make the reservation. Although a bit expensive, the views the live piano will be worth everything! Love love love", "author": "Shazadi N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-23", "description": "My wife and I recently travelled to NYC from the UK for our wedding and, having celebrated our engagement at The River Cafe in 2015, knew that we absolutely had to go back after our wedding to celebrate once more.\n\nIt is, quite simply, the most incredible restaurant either of us have ever eaten in. The food, the setting, and the service and attention from the staff are all second to none. We were fortunate enough to be given a table by the window, and the views are incredible. Words don't really do it justice, it is just beautiful.\n\nThe rabbit and the gnocchi appetisers were delicious, the steak main course is incredible, and the pistachio dacquoise was a fantastic end to a lovely meal. The fun factor of the chocolate Brooklyn Bridge dessert should not be ignored if it is your first visit also.\n\nWe were made to feel really special by all of the staff, including with some complimentary champagne to help us celebrate, and the evening rounded off the best week of our lives perfectly.\n\nIf you are in NYC and are celebrating a birthday, an engagement, a wedding, an anniversary, or even just a good day, you should absolutely consider doing so at The River Cafe. It is worth every penny!", "author": "Ben L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-11", "description": "Excellent Restaurant, Top Notch Service, Food was delicious and wait staff were perfect. I went for brunch with  family of 10 and everyone left very happy.. The location is special under the Brooklyn Bridge in DUMBO.. great places to take pictures.. We were catered to the entire after-noon.. Everyone was super friendly, polite and helpful.. It was a memorable and special after-noon.. Thank you River Cafe!", "author": "Stacie B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-06-11", "description": "This would normally be a five star plus review..  the atmosphere, the food, the VIEW cannot be beat. I've been wanting  to get here for quite awhile. When I made the reservation, the woman reminded me that shorts and jeans were not permitted, I said, no worries but I assume since breakfast, we could dress a little casual, and indicated that dress was strictly \"semi formal\" ( her words) . I said, do men need jackets and ties? She said one or the other for breakfast. Ladies, dress for office at least. We did as we were instructed, but once there, felt incredibly awkward. A couple beside us had on tennis shorts, sneakers, the woman wore a tank top and white cut off shorts, the man, gym shorts. There was another woman with sneakers and stocking socks , and another couple with jeans and T-shirt's. They took my husband's small back pack at arrival, but then we noticed a woman with a canvas shopping bag was permitted, a sports duffle, and at least one other back pack. They permitted two different people around us to be FaceTiming about 1-2 feet from our table. I realize it is 2018, but that someone on staff didn't ask them to return to their own seats or to take their very loud video calls away from other customers, is really frustrating. We loved our meal, but left seriously confused.", "author": "Christine R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-18", "description": "High quality food in a beautiful atmosphere! The River Cafe is well worth every penny. Not just dinner, but a truly delicious dinning experience.", "author": "Emily P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-05", "description": "My husband and I were married in early June at the River Cafe's Event Space.   Although some feel this is \"old school\" dining, all our expectations were met or exceeded.  We wanted to give a \"shout out\" especially to  the Catering Manager, Luke Vosson, who was wonderful to work with and made wedding planning far more pleasurable and easier than expected.  The staff, especially Roger, were terrific during the evening; they were able to accommodate a number of dietary restrictions and our guests couldn't stop raving about the quality and presentation of the food.  \n\nIt's a beautiful spot, very romantic and quite special.   We couldn't have asked for a more spectacular setting or experience for us and our guests.", "author": "Rick C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-24", "description": "After wanting to go to the River Cafe for quite some time, my husband promised to take me for my birthday!\nThe beautiful display of flowers and lamps on our table were so elegant and added such a nice touch of charm to the already fancy and classy ambiance that River Cafe has. I felt like I was taken back to the days of Titanic where the world was a much more wholesome place. The views at River Cafe are breathtaking! From our table we could see panoramic views of lower Manhattan. \nEven the napkins were personalized with the River Cafe logo on them! This place did not cut any corners anywhere. Everything they displayed, everything they did, and everything they said was perfect in all the right ways. It was formal, but not stuffy. \nOne of the things that Ben did not love about the idea of coming to the River Cafe is that he was required to wear a sports jacket. We are a pretty casual couple (him more than me), but sometimes it is exciting to have an excuse to dress up and go all out! This place certainly felt special and I didn't mind the dress code because it made the experience that much more special! I would do it every night if I could afford it :)\nThe amuse bouche was simple, but so tasty! It was gazpacho accompanied by a melon medallion with shaved feta and mint on top. Since it was the end of May, this was a perfect summertime treat! It was refreshing and tangy as gazpacho should be. The feta was sprinkled lightly on the plate, and not really a main part of the amuse bouche, but definitely helped add come creaminess to the otherwise very refreshing flavors.\nThe Wild Shrimp appetizer was highly suggested by our waiter. It was served \"Oscar Style,\" which is topped with asparagus, crab, and Maltaise sauce. The shrimp were large and meaty and acted as a great base to soak up the extra citrusy Maltaise sauce. The crab meat added so much flavor to this dish and was an extra added bonus to a shrimp dish. The white asparagus was very unique to this dish, it was lighter in flavor than green asparagus and kept the dish very light and summery.\nThe Octopus appetizer was delicious! The octopus was char-grilled with the edges being nice and crispy, while the inside was meaty and tender. The octopus pieces were served atop Yukon potato slices with fresh radishes and a light chimichurri sauce. The octopus was so flavorful that it didn't need to be dipped into the chimichurri sauce, which was great because we got to save the sauce for all the vegetables on the plate! The vegetables went very well with the chimichurri sauce and added a delicious herbal tangy flavor to each bite.\nThe Lobster entree was to die for! This dish was the item on the menu I was most excited for. I think I may have died and gone to heaven when I took a bite of this dish. It was much for filling than it appeared in size, and it was so full of flavor that each bite was worth a million. It was served in the most unique way I have ever seen lobster served where the tail and the claw of the lobster were served in two very different preparations. The lobster tail was served over squid ink cavatelli pasta with lobster infused marinara, while the claw was cut up and prepared spinach gratin style and stuffed back inside part of the lobster shell. The lobster tail was so meaty and fresh, while the lobster claw was creamy and cheesy. I really enjoyed the top layer of the lobster spinach gratin because it was nice and crispy. The squid ink cavatelli pasta was homemade, most likely by hand, cooked perfectly and great for soaking up the lobster infused marinara, which had a nice slightly spicy but sweet and tangy flavor!\nThe Lamb entree was an equally as impressive dish. The portion of this dish was huge with 2 slices of lamb with 2 ribs each which were extra meaty and tender. The lamb was cooked to perfection with a beautiful pink center. It was oozing with flavor and was so moist. The lamb was served atop a portion of fondant potatoes, which were extra crispy on the edges and nice and soft in the center. The mint sauce on the dish was extra light and added a hint of freshness to the otherwise very savory dish.\nThe milk chocolate shuffle was extra gooey and creamy as can be! It was light and fluffy and reminded me of a s'more! The cream on the side was definitely whipped in-house! However, I wouldn't have minded if the dish was a touch more chocolatey, since it was milk chocolate vs. dark chocolate! Although, I can't complain, it was pretty amazing!\nThe Chocolate Brooklyn Bridge was the highlight of the desserts! It was beautiful, rich, and amazing! It was almost too beautiful to eat! This dessert was ultra chocolatey! I loved that there was ice cream, sorbet, and meringue to satisfy my sweet tooth, and also my need for textural interest, with there being creamy and crunchy textures! I also loved the sweet and tartness of the raspberry paired with the richness of the chocolate and the creaminess of the ice cream! \nI can't wait to go back to the River Cafe!", "author": "Carlen M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-08", "description": "Wow. You would never know that Sandy had wiped out the place. Been a few times over the years and they never fail with their excellent service and amazing food. They view is simply spectacular so they break the rule that a great view and great food don't go together. \n\nIt was an incredibly raining Monday that we visited. And the roads were just jammed. This place is easily accessible via the A though so we beat the traffic that way. It's a short walk to the water and the garden is as lovely as ever. We were lucky enough to book an early dinner and got a table by te windows. If u love storms and clouds there is nothing quite like watching the rain over lower Manhattan. \n\nThe food was incredible. It is a prix fix menu and the wagyu tartare was so tender and falvorful. The wild blue shrimp were perfectly cooked and fresh with a lovely white asparagus. The duck breast was perfectly cooked with a nice light spice. And the New York strip steak. (Appropriate here :-) was really a delight. Perfectly charred on outside and wonderful flavor. And the Nova Scotia lobster was wonderfully prepared. Flavorful and delicate. Wow!", "author": "Rich T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-02", "description": "I love this restaurant! I come every year for my birthday dinner, and it's such a treat!  This year I had the Gnocchi and the Lamb. Both were perfectly delicious. Normally I'm not big on desserts, but since they have a Prix Fixe menu, I chose the Chocolate Brooklyn Bridge since it's so fitting.  We also had the Pumpkin Cheesecake which was yumm. Definitely coming back again next year!", "author": "Charlotte R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-09", "description": "Best food, best service and best view since we arrived in NY. Can't miss for visitors!", "author": "Melia K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-30", "description": "One of my all-time favorite dining experiences. The ambiance cannot be beat. You're view is the Manhattan skyline across the river. Boats pass by at all times. The service was beyond professional and they did everything the right way. The tasting menu was unbelievable. One of the best restaurants in the world. Great for any special occasion.", "author": "Adam M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-10", "description": "I had a few questions going in.. So I'll attempt to tackle them in this review. \n\nWas pretty happy to land a reservation on a Saturday night the week before valentines day at a reasonable hour. Girls on the phone were great. Definitely don't be intimidated by the river cafe. It's a great experience in that they want you as much as you want them. Food/ service / maître d / valet parking, all phenomenal. Reasonably priced bottles of wine, check. View, obviously spectacular- Great views from any table in the restaurant but if you can snag a window table you are definitely winning.. My one small complaint - the dinner rolls were not very good. Just didn't seem fresh to me. Minor detail but you figure with a place like this that would more or less be a lay up for them? Anyhow, we all know nobody is there for the dinner rolls..\n \nPrix fixe @ 120$pp\n(1 app, each, 1 entree each, 1 dessert each)\n2 drinks at the bar , kettle sodas @ 20$ each. \n60$ bottle of ... Not sure \nTip and tax.. A little over 4 bills.\n\nAnd there you have it.", "author": "Christopher C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-11-20", "description": "Really wanted to like this place. The food was good but nothing really stood out besides the view. I expect more for spending $200 per person. Nothing special here, no experience. \n\nService was average making sure you have your glass full. What really got me is that they wanted to get to the table next too me and I had to scoot up every time. I was about to get up and move my table back. It is not like they can't make space, it was very disturbing. \n\nAfter the order they gave some some kind of appetizer. No idea what it was but made from squash. Waiter just put it in front of us and said compliments from the chef. \n\nFor the food. The streak tartar was great. And the rabbit had a lot of flavor. Had the ny strip streak for the main meal which was cooked ok but huge portion. The best was the bone marrow.", "author": "Joseph K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-13", "description": "Excellent service. They value your business and aim to please.  Absolutely no second guessing this restaurant. Always a great dining experience. Views, service, and decor is the best.", "author": "Patty Ann M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-02", "description": "The view is unbelievable. The staff is very friendly and hospitable. The food was delicious. Get ready to spend a lot of money. Jackets are required for men.", "author": "Matt U."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-08", "description": "This place was incredible. Not only is the setting romantic and stunning, but they bent over backwards to accommodate my seafood aversion when we decided to do the tasting menu, which has a few seafood items. The kitchen/staff graciously found substitutes for those particular items and delivered an incredible meal. Very much appreciated it.\n\nAttentive waiters, great service, beautiful views and delicious, fresh and flavorful food.", "author": "Peter A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-05-04", "description": "Man.... not sure this was that great. I'm a poor boy in a hoity toity world. Hamburgers and fries, that's my thing.", "author": "Abe L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-04", "description": "Made a reservation for my fiance's birthday dinner for two. Requested a table near the window and nice view hoping to catch the sunset but it was a cloudy day. They did fulfill my request. From beginning to end the dinner date was amazing..  Service was great and food was delicious. The servers were very attentive and professional...so here is the break down of our meal. For those who are not aware they have a prox fixe menu 3 course meal or a chefs choice 6 course meal option. We went with the 3 course prix fixe menu...for appetizers I had the Wild Shrimp (yummy ) and my fiance had the Crab which is a crab cake also great...entree I had the colorado rack of lamb and she had the lobster....again we were extremely satisfied..last but not least we ordered the Key lime souflee that came with graham cracker ice cream yes i know...graham cracker ice cream...um um ummmmm ssoooooo good. This place was well worth the drive and traffic encountered and definitely worth the price...i plan on returning for another occasion. Thank you to everyone of the employees that made the experience great. Keep up the top notch service.", "author": "Jessica A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-04-26", "description": "The River Cafe has been around forever with lovely views, attentive professional service, and actually very goid food. So why 3 stars? I came with colleagues for dinner  and from the moment you walk in you are hit with the pungent smell of Lillys- Actually the whole restaurant, is overstocked with flowers, plants etc.,  which not only gives off a a sickening smell (not great when ordering food) but between the flowers and the dated decor - reminded me of a funeral parlor.", "author": "Michele L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-09-21", "description": "We were here for a wedding and the venue was quaint and intimate.  We really liked the food BUT .. the staff was not very professional .. so if you are reading this review for a dinner experience, it's probably worth it if you are willing to splurge on the tasting menu.  However, if you are reading this for wedding venue review, make sure you are on top of it!!\n\nWhat we liked\n-  Both the angus beef and tuna tartar were delicious.  Wedding cake was also yummy\n-  Romantic ambiance with beautiful Manhattan skyline .. \n\nWhat we disliked\n-  The staff tossed out everyone's party favor while we were all on the dance floor.  The party favors were expensive whiskey bottles.  They were in a hurry to clean up the tables and rushed through the clean up.  Very unprofessional.  As a guest, we are extremely annoyed that the well prepared party favors were just tossed\n\nI would NOT recommend this place for a wedding .. unless you want to pay this type of fees in exchange for the sloppy service.", "author": "Leia K."}], "servesCuisine": "American (New)", "priceRange": "Above $61", "name": "The River Café", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Water St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/C_8aEbAvcCLhiqXn9QdWSw/ls.jpg", "@type": "Restaurant", "telephone": "+17185225200"}