{"aggregateRating": {"reviewCount": 1049, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-28", "description": "Amazing brunch experience. Service was excellent from the moment we walked in until we left. All the food was delicious. We had the steak tartare and pork belly as appetizers and the duck and salmon as main courses. If you're deciding between the two, we would definitely recommend the duck. Portions were just right, flavors blended very well. And on top of all this, the views of the river were spectacular. Overall ambience made this very memorable. Highly recommended for special occasions.", "author": "Jason P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-21", "description": "An absolutely extraordinary experience. Seated near the window, dining under the Brooklyn bridge, stormy weather, rough waves...so romantic! Celebrated my birthday here. The staff was excellent. From arrival at door to receiving the check. Exceptional service. Every course presented was appealing to the eyes and delicious in my tummy. You only live once, spend the money!", "author": "Dat S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-02", "description": "Not only does this restaurant have the most beautiful views of Manhattan they do a wonderful job. You feel pampered and appreciated from the moment you walk in. Beautifully decorated for the holidays. Then there is the food. Delicious!  Not inexpensive but definitely get what you pay for. If you can, GO!", "author": "C N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-23", "description": "Best view , delicious food, friendly atmosphere and its just a beautiful restaurant... love to be back", "author": "Ilaisa F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-20", "description": "For Valentine's Day my boyfriend surprised me and took me here. it was amazing. The food and dessert was excellent , the service was great and the view is breathtaking. I loved this place!", "author": "Sarah K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-05-10", "description": "INCREDIBLY RUDE STAFF MEMBER OVERSHADOWED THE BEAUTIFUL VENUE. I'LL BE GOING ELSEWHERE FOR MY RIVERSIDE DINING.\n\nThere's no denying this restaurant is beautiful -- the ambiance, the view is A+. For this reason, my family and I traveled from Long Island to take a look at the restaurant as a possible venue for my brother's upcoming wedding. I want to preface this review by saying the restaurant looked like it had JUST opened for dinner and was completely empty. We were also dressed quite nice (suit jackets, heels, etc.) since we just came from an event.\n\nWe were ushered in by the valet guy and told to park our car right in front of the restaurant (versus in the small parking lot). Though we found this strange, we did what he said knowing we'd only be there for maybe 25 mins tops. There were a few ladies at the hostess stand who were polite and leaded us into the dining room to view the space. As we were looking around and getting a feel for the venue, we heard the valet guy getting yelled at outside, followed by a man (wearing thick rimmed glasses) barging into the dining room and demanding we move our car. We were all taken aback and so my brother quickly explained we weren't staying long and were just taking a peak at the venue to consider it for his wedding. While my brother nicely explained the situation, this man didn't even stop to listen and kept booking it into the other room and yelled \"5 MINUTES\" at us without ever making eye contact. I personally was astounded that someone who worked at a restaurant of this caliber (possible manager?) had treated us (POTENTIAL CUSTOMERS) this way. \n\nNeedless to say, this guy missed out on $30K and we will be going elsewhere for the wedding. I also will be sure to check out the countless other restaurants in the area who have the same view with 10x the service and respect for their customers.", "author": "Devin N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-19", "description": "Had an amazing time at this restaurant. Really good dining experience. Everything on the menu tastes really good. The atmosphere here is really 5 stars and stands out from many of the other places in the city. There is a dress code, so be prepared for that. Is a bit costly, but worth it on ocassion.", "author": "Nate P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-12", "description": "I have a thing with trying Michelin Star rated restaurants and The River Cafe is by far one of my favorites. It has now been a Valentines Day tradition for my boyfriend and I to come here! The view is beautiful, the food is delectable, the service is on point, the decor is a little old school for me as it is \"boat house\" themed but it has its purpose. I loved that they provided me with a stool for my purse as well! It's the little things that make such a difference. \n\nI usually get the octopus as the appetizer since it is so delicious! I get octopus almost 100% of the time is it's on the menu and this is one of my favorites. The best I had though was at a restaurant in Greece! I had the lobster risotto which was to die for! It was Nova Scotia lobster, butter poached with sweet and sour butternut squash risotto,\nTrumpet Royal mushrooms, Brussels sprout leaves. My boyfriend got the steak which was HUGE! \n\nI finished off with a cheese cake which I believe was goat cheese and I was scraping the dish for every last bit.  Also, as a treat they gave us a small dish with additional sweets to try on the house! I never feel rushed at this restaurant regardless of how busy they are. They perfectly time the reservations to allow you to truly indulge your meal. Will always return here for more!", "author": "Jennifer C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-06", "description": "Pro: \nLocation is good. \nServing food is fast. \n\nCons:\n1. Food quality is Mediocre but price is high. $140 for total three dishes (1 appetizer, 1 entry, 1 dessert) \n\n2. Overall service is horrible : \n  1.male guests have to wear to formal suit/blazer. Otherwise you gonna be forced to wear their oversized dad's suit. \n  2. Too many servers inside, which are unnecessary,coz they never care about you. \n\nOverall, if you want to prepare some surprise event(like proposal). I strongly recommend avoid this restaurant, it will only makes you feel like eating in a jail...", "author": "Alan H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-21", "description": "So before coming to this place, I was skeptical because most places that get a lot of hype and attention aren't that great. Well, this place is. Came here for my grandmothers 90th birthday and we all have nothing but amazing things to say. Spectacular views, impeccable service, and delicious food. My meal, which includes 3 courses, was one of the best meals I have ever had. I HIGHLY recommend this place for any special occasion or date night.", "author": "Christopher R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-13", "description": "WOW, I recommend that no one goes to this restaurant. Lousy service, overrated food, and overpriced. I am baffled of how they got a Michelin star!!!! I've been to many other good Michelin star restaurants, but this is an embarrassment! UGH! \nThey treated us so poorly perhaps because we looked young and didn't open a fancy bottle of wine! We would rather pay $400 to a great place in NYC. The only reason this restaurant deservess 1 star is because of their location. \n\nDO NOT GO! Save yourself $$$ and just go enjoy the park if you want the view.", "author": "Balin K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-03-10", "description": "I have worked in the restaurant industry (to be more precise, fine dining) for quite a bit and I have to say this place has the least hospitable people at the door. \n\nI went to meet with some friends that were already there. The hostess in the front was the only nice person from this place. Both the manager (white tall male) and the second host (white male) were beyond rude and looking at me up and down as if I didn't notice it. They did not smile and when I would try to help him find my reservation he was extremely unmannered. The gentleman then kept saying he did not find the reservation which was strange because the other hostesses in the front had already confirmed that she had seen it. Overall the experience at the entrance was unwelcoming and for a place this beautiful and elegant you would expect a bit more civilized and polite staff.", "author": "Mich B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-03", "description": "Some places you must go to at least once in your lifetime, this is ONE. I loved the service, the view, the food everything about this place! We came here for anniversary, we had the 3 course prefix. For appetizers we got the Wague steak tartar which is a must have! And the chefs special soft shell crabs which was mouth watering. For entrees we had the steak and Bronzino, which were perfect choices. For dessert you have to get the Brooklyn bridge, it's just their top choice and it's design and taste are delicious! \nThis place is over priced but you are paying for the service, they have an experience server for everything, drinks, food, bread, etc...you are also paying for the view and the food and just the spectacular experience", "author": "Madonna H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-19", "description": "What can I say... this anniversary #9 but anniversary #2 here. \nThe decor is nice but the food unforgettable. I mean truly incredible. I was laughing and thought that after eating here, it takes my taste buds a month to recover, the food is that delicious.\nMake it a special place for a special day", "author": "Robert R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-11-19", "description": "Great views and cozy atmosphere. Top notch service.  We came for brunch. I had the blueberry pancakes -perfectly sized for me - with crispy bacon. Several in my group had the avocado toast (see photo). Everyone loved it and it was a beautiful presentation. The fresh OJ was a bit pricey at  $15 a glass but super tasty. Highly recommend. Will return.", "author": "D. B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-09", "description": "High expectations will be exceeded at The River Cafe.  Outstanding service - attentive and friendly, not stuff and overbearing.  A location with no equal - book a time that will have you experience both the sunset and the view of Manhattan at night.  Impeccable plates - from start through to desert everything was flawless.  All of this doesn't come cheap, but you wouldn't expect it to!  Men wear a suit jacket, come with someone special, walk the small garden after dinner and head home happy.", "author": "Neil F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-04", "description": "Absolutely the very best probably in all of NYC and especially THE best in Brooklyn.  Last night was a very special event - my daughter got engaged!  The table was smack on the water and what a view!  It is like walking into a fairyland when you enter the property and then when you walk into the restaurant you would think you died and went to Heaven there are so many flowers all over the place.  Staff and service are impeccable.  If you tried to find something wrong you could not!  Food is divine and presentation is something out of a magazine.  Everyone was well dressed and refined.  Men:  suit or sports coat and tie.  Ladies:  dress, heels or a lovely pantsuit.  Very expensive but worth every cent.  Unless it is corporate money/expense account this is only a place for a special occasion.  From beginning to end this restaurant did not disappoint in any way.  Happy, professional employees that love their job.  I will return to the River Cafe.\n\nLynn Harland", "author": "Lynn H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-01", "description": "Accidentally taste the Easter lunch here and the fixed price is $125. We are asked to pay 18% tips and the final price is $324 for two. I love the muffin accompanied by lemon butter and the dessert in the shape of Brooklyn bridge.", "author": "Mengjia Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-06", "description": "Went here for my birthday dinner on a Saturday night. Absolutely amazing. The view, food, drinks and service are all spectacular. We did the 6 course chef's testing which was delicious. The shrimp, foie gras, and steak were highlights of the meal but every dish was amazing. I highly recommend doing the chef's tasting so you get a little taste of everything. The menu is pretty expensive but definitely worth it!", "author": "P C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-06", "description": "This was one of the best dining experience. If you have some money to splurge for dinner this is the place. The service is extremely good. I ordered a crab cake for the appetizer and the steak for the entrée. Both dishes are fantastic. After the meal, they called an Uber for us to get us home. Overall, my experience was phenomenal.", "author": "Stanley Z."}], "servesCuisine": "American (New)", "priceRange": "Above $61", "name": "The River Café", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Water St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/C_8aEbAvcCLhiqXn9QdWSw/ls.jpg", "@type": "Restaurant", "telephone": "+17185225200"}