{"aggregateRating": {"reviewCount": 1049, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-18", "description": "Our first time here. We went for Sat lunch to check it out.  We've already decided to return and bring a bunch of the family with us the next time.  It's a beautiful, elegant place right on the water.  The service is impeccable.  And the food is outstanding.  Even the bread, which I always judge a restaurant by, was wonderful.  It was a fig and olive, a multigrain, and a sourdough.  Wife had the crab cake and it didn't disappoint.  All fresh crab prepared perfectly.  I had the oysters with lemon granita.  I asked for cocktail sauce and they brought out one that was homemade and amazing.  Main courses were halibut and steak. They were spectacular.  Dessert was semifreddo with fresh peaches and peach sorbet.  Wines were a French sparkling  Rose and then a California Sauvignon Cabernet.  The wines were great.  A memorable lunch.  Next time dinner.", "author": "Jerry F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-21", "description": "Excellent restaurant. Great food, great view and great service. They went out of their way to make you feel welcomed. The valet service was free and you go right up to the main entrance so very helpful. It is on the expensive side but worth it.", "author": "Maria T C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-16", "description": "Romantic to the max! If you ever want to impress your date, or celebrate anything, take them here!\n\nThe River Cafe is located right on the East River and by the Brooklyn Bridge. While its location and view are spectacular, it is not very close to  the subway station so I recommend taking a cab here.\n\nI've been to this place twice, once with my gf, once with my family, so I have basically tasted every single items on the menu. Their wine list... just WOW... you can find almost anything you want... even those that cost $10k per bottles... one day... one day...\n\nFor appetizer, foie gras duet and roasted rabbit are two dishes that stood out the most for me. And for entree, you won't be disappointed with either the strip steak (amazing bone marrow potato side), duck breast (one of the most tender piece of meat I've ever tasted), lamb (nicely charred, very juicy inside), or lobster (beautifully plated with very buttery meat). \n\nI feel that their dessert is a little weak compared to the rest of the meal. The chocolate Brooklyn bridge is a must if it's your first time to the restaurant, it just perfectly complemented the view out the window. But the rest of the items doesn't really make me say \"wow, this is a Michelin starred dish.\"\n\nOverall, a cozy romantic place and attentive service, I will be back!\n\nTips:\n+ jackets are required for men, if you don't have one, they can lend you one as well with advanced notice\n+ after dinner, take a stroll around the Brooklyn Bridge park, amazing view of the city, especially at night", "author": "Mike H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-18", "description": "Came here for breakfast on a Wednesday before work- it was empty, we were the only ones in here. I have always wanted to come here for dinner but just never made it. \n\nThe service was great, everyone was friendly and checked up on us just enough. \n\nI ordered the coffee, with plenty of refills. I had the omelette-- there were mushrooms on it and some in it with gruyere. I loved my dish. \n\nMy boss had the avocado toast he was a little disappointed, as he mentioned the toast and poached egg was cold. \n\nOverall, I would be back for the food and for the view.", "author": "Tahima B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-17", "description": "Amazing experience. My fiancé brought me here for our 100 month anniversary as a surprise and and the staffs here were wonderful, non judgmental and entertaining. For dinner it is a prefixed menu and make sure you reserve ahead of time. Amazing view of the river. We had reservations at 9:45pm however I would recommend 7-8pm to get the best view. The tuna tartar is sooooo good!!!! My fiancé got the steak for the entree (recommend) and I got the lobster. For dessert, we had the sorbet and the Brooklyn bridge cake. Would totally recommend!", "author": "My R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-19", "description": "This establishment deserves its Michelin rating. The food was superb, the staff was attentive and paid attention to details in service.  The ambiance was sheer elegance. It's location is magically breath taking. A most impressive experience indeed.", "author": "Myra I."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-09", "description": "The River Café was magical. It was everything \u0026 more that I could have imagined for my birthday. The venue is beyond beautiful and the view is breathtaking. Staff was extremely friendly \u0026 knowledgable about every item we asked about - whether it be on the prix fixe, dinner, or wine menu. My boyfriend is a sous chef \u0026 was extremely excited to let the executive chef surprise us with whatever he wanted on the prix fixe menu. We were delighted that for some courses we were given the same plates \u0026 for others, we had entirely different meals. It allowed us to really get a taste for the range of cuisine served at The River Café. We were so pleased with the chef \u0026 as a gesture of gratitude, he sent out extra courses free of charge. I had already felt so much love from my boyfriend, but also the entire staff that made it their mission for us to enjoy our romantic date together. I would return to this establishment a million times over.", "author": "Sade D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-10", "description": "This place has been on my bucket list since I saw it in a scene in Spike Lee's \"She's Gotta Have It.\" I stumbled upon it while searching for the Brooklyn Bridge and an amazing NYC view, and I was so pleasantly surprised!! My best friend and I were not dressed up formally so didn't know they would let us in, but we made it in just in time before the restaurant closed and the host let us go straight to the bar after the Maitre D said it was still open. The view from the bar was equally breathtaking and the bartenders were very knowledgeable and nice. They even had a great pianist playing some great tunes. This is an amazing date spot and great place to show off the beauty of NYC to friends and family as well. I shall return!", "author": "Myrna D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-30", "description": "I had my 1 year wedding anniversary in this amazing restaurant. The food the staff and the service deserve theirs nice reviews. Big shout out to the whole team espcially mike the sommelier. I will definitly come back soon", "author": "Fabio L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-09-08", "description": "Went there to celebrate a brithday, and we planned this pretty late, so we couldn't get the weekend we wanted to go. However we did get a table 3 weeks after we requested. So if you're planning on going, make your reservations early! \nThe view is amazing, however we were seated against the opposite end of the restaurant, and so couldn't enjoy the view too much. There is a set menu for a set price, so be prepared for that.\nThere aren't also that many fish/vegetarian options, so that was a downer, because when we called, we did tell them about or food restrictions, and were assured that we would get a selection. \nDefinitely go if you are in NYC and want dinner with a view, but be prepared for smaller portions, and paying for service/location. Food was alright.", "author": "Bilqees F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-02", "description": "Who doesn't enjoy a little fine dining for breakfast on a Tuesday! I got the wagyu pastrami that came with eggs, horseradish sauce, and russet/sweet potato hash! Needless to say, I cleaned my plate. My friend got the blueberry pancakes that came with maple syrup and bacon. as well.", "author": "Angela I."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-25", "description": "It's worth the money.  Incredible service and the food impressive.  Brunch was delightful!", "author": "Ana R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-20", "description": "Absolutely wonderful.  Delicious food.  The ambiance, the pianist serenading the night. Great view of the skyline. Everything is perfect. Highly recommend. * It is a pre fixe menu so it is one solid price for the dinner.  But well worth it. Would love to have an ala carte option but can't be picky now", "author": "Vinny M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-29", "description": "Came here to celebrate my anniversary with my boyfriend and we had a lovely time here. \nAmbience and atmosphere was incredible, and service was very attentive. \n\nWe originally sat at a round table in the middle of the dining room which was a little uncomfortable, but at my request the Maitre D was kind enough to move us to a nicer table once it was available. \nFor appetizers I ordered pork belly/ scallop which I enjoyed a lot more than my boyfriend did with his oysters. For our main course we ordered the lobster and the niman ranch strip steak, both were delicious! The entree also came with a side of mash potato baked inside a bone marrow which was very interesting although lacked in flavor.\nOne of the biggest highlight was the live piano playing throughout the night in the background and they were also very kind as to personalizing our desserts to help us celebrate our anniversary.  \n\nAlthough it is on the pricier side with a fixed price $130 (pre tax and tip) per person, it is definitely worth a visit and is a great spot to take your date or significant other on special occasions.", "author": "Jenny C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-19", "description": "The views are spectacular! The service is outstanding. And of course the food a culinary delight. Yes it is pricey,  but it is worth it.  We had lunch there recently,  shrimp crusted branzino and steak. They cooked the steak perfectly and the way I asked. And the fish...oh my goodness! next time I'll ask for the lobster gravey on the side.  Who knew you could ask for some modifications or substitutions.  The cute couple next to us did that and it was brilliant! Definitely worth your time especially if you are celebrating a special occasion or want an incredible meal.", "author": "Ro J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-02", "description": "Celebrated a proposal here on New Year's Day. Lucked into a table by the window with unbelievable views of downtown Manhattan. As a vegetarian, I was given a separate menu that was well thought out. The Mushroom Wellington was one of the best dishes I've had in some time. \n\nCasually, a member of staff asked if we were celebrating anything that evening, and we mentioned the proposal. They surprised us with candles on our desserts and a complimentary champagne toast. It was a lovely gesture, living up to their sterling reputation! The service was topnotch; the ambience was perfect. River Cafe is worth every penny!", "author": "Alec H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-07", "description": "Remembering a solo trip here for lunch long ago, I knew this was the spot I wanted to visit for my wife's birthday. \n\nIt didn't disappoint. From your entrance into this beautiful spot the service is impeccable. A drink at the bar to take in the view and get ready for this experience is a must. \n\nDinner and wine service can't be beat. It's an interesting menu with lots of choices. The chef decided to add a course for us just because. It was Hudson Valley foie gras with a small strawberry and onion crepe with strawberry gastrique. A small taste of Sauternes to complement was perfect. This was, by far, the best presentation and preparation of foie gras I've ever had!\n\nApps of Wagyu beef tartare and rabbit loin with rabbit Bolognese lasagne were incredible. Dinner was rack of lamb and duck - both perfectly cooked. \n\nCan't wait to return here. Haven't had an overall perfect experience in a restaurant in a very long time. This will not disappoint.", "author": "Jaime R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-15", "description": "I went here for my bday dinner. Loved the restaurant and the food and the service. Would definitely recommend this place if you want a romantic/celebratory fancy dinner.\n\nFood: I ordered the vegetarian menu, and the entree was way too good. For a change a restaurant and their chef had put some real effort in the vegetarian food. I would always go back for there mushroom entree.\n\nAmbience: You get views of the East river and the brooklyn bridge. Just too beautiful.\n\nService: Excellent service. They check back pretty often. They also did small bday special for me.\n\nWould definitely recommend this place if your wallet is a little on the heavier side.", "author": "Lovereen K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-04", "description": "This place is incredible. Came here for a weekend lunch at 1130am. When I stepped in, it was extremely quiet and the only thing I heard was the live piano playing in he background along with the beautiful river view to Manhattan. What a great first impression, and the rest of the experience didn't disappoint either. My favorite dish was the chicken entree that I got. The chicken was sous vide to perfection, the Jus and the corn raviolis were delicious as well. The pistachio dessert was to die for. \n\nOverall, I think it was a 5 star experience however I gave it a 4 stars because I think the cocktails are overpriced for $21, and the services were overall attentive by fall short when the place got packed later on. Also I got charge extra $15 for a drink that I didn't order. I told the server that I didn't order the drink and he was kindly enough to take it off without second guessing. If I didn't double check the bill, I would have paid extra though.\n\nCome here for lunch and order the optional dessert for the best price! Will come back again!", "author": "Byron W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-09", "description": "This place is unreal and the food is some of the best I have ever tasted! The views are absolutely New York Breathtaking! The view of the Brooklyn Bridge is GREAT! Definitely worth the money! I was seated by Javier who was absolutely outstanding and knows how to treat his customers! The picture explain my title of this review!! Try the drink the Morning Buzz - WOW!!!", "author": "Donnie W."}], "servesCuisine": "American (New)", "priceRange": "Above $61", "name": "The River Café", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Water St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/C_8aEbAvcCLhiqXn9QdWSw/ls.jpg", "@type": "Restaurant", "telephone": "+17185225200"}