{"aggregateRating": {"reviewCount": 1049, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-06", "description": "Beautiful magical space with stunning views under the Brooklyn Bridge, this place is a true treasure. We attended a 50th birthday party here and enjoyed a 5 course dinner. I especially enjoyed the handmade cavatelli pasta \u0026 poached lobster w/ tenderloin. The chocolate marquise bb desert was a show stopper \u0026 appropriate for the occasion. Drinks were classic as expected, excellent coffee. Service above \u0026 beyond. I loved that the entire restaurant was filled with gorgeous fresh flowers. Twinkling lights inside \u0026 out and of course the stunning views across the water of NYC, pure MAGIC!! Car service or valet recommend \u0026 if your wearing heels the walk way to the entrance is cobblestone. Totally worth the splurge, this place is an absolute beautiful venue for a party or special occasion.", "author": "Stacey M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-02-03", "description": "The river café is legendary! \nit's been around for over 40 years owned by Buzzy.\nThe desserts and the coffee are delicious. \n$$$$ For the food but with that you get a beautiful view, A live pianist and made to feel very special in a very high end pretentious restaurant.\nGentlemen are required to wear jackets so Please make sure you bring a jacket because if you have to borrow one of their jackets Don't expect to get to sit by the window, because it will never happen!\nRiver café has one of the most beautiful grounds in NY if not the country and every room you go into in River Café smells like heaven because everywhere is full of fresh flowers from their greenhouse.\nThe prices are high but remember you get what you pay for.\nIf you don't live in New York and you come to visit you must come to River Café on any given day almost every day a man will propose to his fiancé.\nIf you live in New York and you haven't been to River Café you're missing something incredibly special.\nVisually you're in paradise.\nI've had several of the vegetarian options and I personally don't care for the mushroom dish (and I love I am Obsessed with mushrooms!)\n it doesn't seem to be too popular.", "author": "Sunday P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-27", "description": "I was blown away and had an amazing dinner experience! The exterior \u0026 interior plus the view was mind blowing. The service was excellent and the food was to die for. I will definitely recommend this beautiful restaurant to everyone that I know. Thank you this amazing experience!", "author": "TeeTee C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-08", "description": "Once in life experience for sure, all the restaurant is unique, and the good taste is all over the place, the food, the service, the atmosphere, everything is so perfect. Ricky made this night a very special for us, thanks so much Ricky for my birthday dessert . I spend this experience with one of my best friends and both just have all complements for this experience. We'll return soon for sure.", "author": "Silvia Evelia M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-02", "description": "The River Cafe was my first ever Michelin-star dining experience, and undoubtedly one of the best meals of my life.\n\nThe dude and I made lunch reservations because we wanted to be fancy but aren't quite ballin' enough to pay a visit during dinner. Plus, then we could dress slightly more casual--I wore a sundress with sandals and he wore a short-sleeved collared shirt with jeans and nicer sneakers. We had no problem getting in, but definitely heard the hostesses making snarky comments about a teenage boy in shorts. \n\nThe lunch pre-fixe is $60/person so we figured that this could be our one big fancy meal in NYC; it was so much more than we ever expected. We weren't even by the window, but still had amazing views of the river. We were greeted immediately, and experienced top notch service the entire time. They even asked right away if there were any food allergies they needed to be aware of, which we really appreciated because the dude cannot have gluten (for realsies, not as part of the dumb gf trend).\n\nOur amuse-bouche was a banana custard with house granola and a splash of milk, served in a hollowed egg. I have weird texture issues with food so I don't usually love custards and such, but this was amazing. Very flavorful, but not sweet, and paired nicely with the crunch of the granola.\n\nFor our appetizers, he had the scallop ceviche and I had the soft shell crab (at the server's suggestion). Both were tremendous. I'd never seen scallops served on the half shell before, but it was like \"the perfect bite\" with each bite, which is basically my dream. The soft shell crab was absolutely incredible and the crunch of the crab paired perfectly with the watermelon. Added bonus: it was gluten-free, so the fella could have some too! \n\nOur server recommended the steak and the duck as his absolute favorites on the menu, so those are the two entrees we went with. No regrets at all. The steak was cooked to medium-rare perfection and was seared in the most incredible way. It had a spectacular steak flavor, not overwhelmed by any sort of seasoning or marinade like a lot of fancy places. It came with red-wine mushrooms and what can only be described as potato-flavored cool whip (but amazing, not disgusting). Seriously, the smoothest, creamiest whipped potatoes I've ever had in my life--and I'm a gal who lives and breathes for potatoes. The duck was also stellar, with its seared fat and cracked peppercorn coating. Medium-rare perfection as well, and unbelievably tasty.\n\nFor dessert, we had the chocolate Brooklyn bridge, which was phenomenal AND came with a little chocolate piece that said Happy Anniversary :) we also got gratis little mini desserts that were fab: a tiny macaron, some tiny chocolates, and a tiny jelly.\n\nService was incredible throughout our entire meal. Our water glasses never dipped below the half way point, and our completed dishes immediately bussed. All of the staff was incredibly friendly and helpful in answering any of our questions and making tremendous recommendations.\n\nI absolutely recommend The River Cafe if you're in search of a fancy, mind-blowing meal. It's 100% worth the required reservations and dress code, and definitely deserving of its Michelin Star.", "author": "Justie L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-28", "description": "Still perfect!\n\nThis was our third visit to The River Cafe and we were impressed once again. Everything was phenomenal! This time we tried:\n\nAppetizers:\nCaviar service\nScallop with pork belly \nShrimp with crab\n\nEntrees:\nDuck\nLobster with risotto \n\nDesert:\nSoufflé (only thing that wasn't mind blowing)\nCheesecake\n\nService was beyond excellent. We can't wait to go back.", "author": "Josh A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-05-15", "description": "Food poisoning. I think from the lobster. Still vomiting. My boyfriend felt sick a few hours after and mine started in the morning, still vomiting 12 hours later. What a way to spend $450 and celebrate an anniversary.", "author": "Sarom K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-21", "description": "This restaraunt has fantastic views at night.  This is a very expensive place just to be clear.  But if you want an impressive off the charts date night then this is the place.  They have an impressive wine list as you would expect from a location like this.  However, I was slightly underwhelmed by the cocktail options.  Service is outstanding.  Uber drivers seem to struggle with finding this location.  It's easy to spot once you cross the bridge, but the streets seem hard to navigate for some drivers.", "author": "David H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-18", "description": "Truly an incredible experience for dinner. Seeing the sunset behind the New York skyline while eating dinner here is a must. Had the scallops and pork belly for an appetizer which was delicious, the duck for the main course which was the best duck course I've had in my life, and then a somewhat forgettable dessert (I think it was a malquise?). Other than the dessert, everything was perfect and given the unique setting and ambience it's impossible not to give this place 5 stars. \n\n**if you really want to experience this place go for dinner** I'm sure brunch is lovely but seeing the views with the sun setting in this kind of restaurant is really something special", "author": "Adam C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-07", "description": "A rare 5 star rating for me. Had a fabulous evening and birthday dinner here. \n\nService does not miss a beat\nGreat dining room with one of the best views in the city\nFood was almost faultless\n\nWe started with a drink at the bar and took in the view, just stunning. \n\nWe started our meal with some caviar and champagne which were delicious. The corn pancakes are a surprisingly great accompaniment to the caviar.\n\nFor mains we have the foie and scallops and pork belly. The latter was perfect and we both enjoyed the foie as well.\n\nFor main we had the duck and branzino. The duck was the best I have ever had, it was cooked to perfection, rested well, had great flavor and I would order it again and again. Hubby loved his fish as well.\n\nWe were too stuffed for desert but they gave us some to take home which was a great touch.\n\nI will be back!", "author": "Pooline N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-16", "description": "If your are Asian, you can not have windows seats!!!\n100 % of good seat were for white ppl!\nI'm Asian and white mix tho lol", "author": "Mary D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-05", "description": "This is a true beauty! Had a wonderful dinner here at my good friends wedding! The main courses, drinks, and appetizers were professionally made!l and tasted wonderful! Everything from the Tuna to the filet mignon! This place is a must try in Brooklyn!", "author": "Kevin H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-04", "description": "What a beautiful restaurant. The service is attentive, while also not feeling rushed. The food is excellent- everything was impressive, delicious. Beautiful view of manhattan.  This is a must for my future trips to NY.", "author": "Justin D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-05-05", "description": "We were seated next to the window giving us a amazing view of Brooklyn Bridge all lit up. Both setting and style were beautiful. Staff very attentive and food tasted as good as it looked. I had the pate \u0026 then pancakes. Husband had calamari then lobster- totally amazing.", "author": "Charlotte P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-20", "description": "Great place for special occasion.\nOverlooking Brooklyn Bridge, Manhattan Skyline and all very impressive.\nWe were here for St Patrick's Day lunch.\nFood, plates and service all excellent.\nMost of all the view and huge flower bouquet at the entrance,\ngave me special feeling.", "author": "Jean Y."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-12", "description": "To be honest, somewhat underwhelming for a Michelin Star restaurant. I came here for a two-year anniversary and generally had a good time. It's charming, romantic, and features a beautiful view of the East River and Manhattan. But the food itself was pretty forgettable. Perhaps we ordered the wrong dishes? In any case, the prix fixe came out to over $150 per person with tax and tip. While all were well prepared and tasty, most of the dishes never really blew my mind nor left a lasting impression.\n\nThere's a beautiful garden outside illuminated with small lights on strings. We came on a Sunday evening and the place was pretty packed. It's an older crowd all dressed up (men are required to wear suit jackets after 5:00PM) and live pianist. Pretty loud inside actually. Sadly, we were seated at a booth far away from the windows, which is strange considering I made my reservation three months in advance. It's VERY dark inside - I had trouble seeing my food at times.\n\nWe started with the Wagyu Steak Tartare, which I enjoyed but my date found weird mixing with the raw quail egg. She found it a bit reminiscent of cat food, especially the way the meat was presented as a can-shaped cylinder. I thought it tasted good though. The oysters were a real delight, some of the best I've ever had. For the main course, she had the Organic Chicken while I had the Niman Ranch Strip Steak. Again, both decently tasty, just nothing incredibly special. \n\nThe desserts though were quite good! We ordered the Goat Cheese Cheesecake (which was super interesting and delicious) and the Chocolate Brooklyn Bridge (a classic). Both came adorned with \"Happy Anniversary\" chocolate placards, which was a nice touch.\n\nThere happened to be a fireworks show shooting from the Brooklyn side over the East River as we were waiting for our appetizers. That was pretty fun - we went out onto the deck/balcony and watched for while before eating. Probably not a typical experience, but it did add a bit of magic to this dinner. \n\nOverall, very nice ambience, view, and atmosphere, but a bit overpriced for the food. I did appreciate my time there though.", "author": "Kevin T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-02-16", "description": "We had a great time at this place. The staff was friendly and kind. We sat by the glass window near the water. It was romantic and calm. We enjoyed the food and the specially the dessert. Our waiter was friendly and attentive as well. Its kinda pricy so be aware.", "author": "JeSs O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-20", "description": "A once in a lifetime meal awaits you! The River Café is definitely a location for a special occasion dining experience. The view, the food, and the experience are certainly worth the cost, and as long as you're splurging, go ahead and order the Brooklyn Bridge chocolate dessert! It's absolutely unique and decadent beyond belief. The River Café is a New York staple that has stood the test of time, and there is no doubt it will continue to thrive for many years to come. I cannot wait to splurge again in September-Far from home but what a treat!", "author": "Kim S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-30", "description": "One of the best meals I've had in New York. The river cafe is in dumbo right across the Brooklyn bridge. The view is one of the best views I've seen of the city.\n\nHighlights of the meal:\n\nGnocchi - slightly crispy and perfectly cooked and sauteed. In theory, it is not an exciting appetizer to start with since The River Cafe offers various unique appetizers like rabbit pot pie, tartare, etc. However, this dish was simple and delicious. Would get again \n\nWagyu tartare - I'm a huge tartare fan. The present this beautifully. All the ingredients are separate and then the server mixes is all for you. It's paired with large sea salt on the side. Delicious. \n\nLobster pasta - You can never go wrong with lobster.. This restaurant does it well. \n\nBranzino - So, I am usually not a fan of cooked seafood but the branzino was crispy and full of flavor. The contrast between the crisp outside to the soft inside was amazing. If you want a wonderful but light entree, get the branzino.\n\nDessert - Brooklyn Bridge chocolate dessert. It's an overload of ice cream, mousse, cake! It's wonderful.\n\nThough I did eat a 3 course meal with wine, I was hungry in less than 2 hours of eating at The River Cafe. This is a great spot with an even better view for a nice date. If you're starving, go somewhere else.", "author": "Jieun L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-26", "description": "This was in my bucket list of places to go to. Beautiful seating by the window, a glass of wine, exquisite food and dangerously tempting deserts  Romantic and high class best describes this lovely place by the river", "author": "Jeff J."}], "servesCuisine": "American (New)", "priceRange": "Above $61", "name": "The River Café", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Water St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/C_8aEbAvcCLhiqXn9QdWSw/ls.jpg", "@type": "Restaurant", "telephone": "+17185225200"}