{"aggregateRating": {"reviewCount": 1049, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-04", "description": "It was beautiful watching the sunset after walking the Brooklyn Bridge and being lost trying to find this place. I love good food, but I find it so awkward to be in an expensive restaurant and be on your best behavior. :( The first thing that I thought when I sat down was, \"Shiet, I belong in Chinatown eating.\" But my dork boyfriend wanted to eat here because I'm leaving for dental school, so I gave in.\n\nIt was $98 prix fixe, which I was not happy about, but it's ok. I had the rabbit ravioli, Maine lobster special, and the coconut bavarian. My boyfriend had the oysters, rack of lamb, and sticky toffee cake. I think my favorite dish of the night was the first thing they served us when we sat down, which seem to be some kind of delicious chicken salad. I didn't really enjoy the rabbit ravioli or the lobster, but the coconut bavarian was good - a little too sweet though so I didn't finish it. My boyfriend loved his oysters, his rack of lamb was iffy and his sticky toffee cake was a bit iffy too and really sweet.\n\nThe service was amazing though. They refilled our water whenever we took a sip. The waiters were prompt and very professional. In the end, even I didn't feel particularly awkward like when I sat down.", "author": "Cheryl P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-03-04", "description": "When my parents were in town, I took them to this place so they can enjoy the food with an amazing view of manhattan. and I was so glad that I took my friend's recommendation to come here.\n\nFor appetizer, we had\nsmoked salmon\npear salad--by far, my favorite salad dish, it's fresh, fruity, different layers of flavor and just perfect\ntuna tartare--the chili oil and wasabi completes the dish\n\nfor entree,\ncrisp duck breast--recommend\nscottish salmon-- a little bit overcooked\nbranzino fillet -- a mix with fish, sausage, tomato and other vegitables, not loving it, but interesting to try.\n\nwe didn't have the time to try the desert, and this gives me one more reason to come back. The whole restaurant is like a flower green house over the water, and has a small garden in front of it. I can sooo imagine how even more beautiful this place could be in spring or summer. and I'm definitely coming back.\n\noh, plus, the waiters are super nice~", "author": "Claire L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-29", "description": "I just wanted to add my vote to the wonderful and romantic setting of The River Cafe in Brooklyn.  It is pricey but the food, presentation, and service are worth the $$$$$ check.  As soon as I read the menu and noted none of the dishes had a price tag, I realized a home equity loan was in order.  \n\nFortunately, my date and I do not drink alcoholic beverages, so the check was under $250.  That covered tax and tip for an appetizer, main entree, and dessert for each.  \n\nYou won't be disappopinted.", "author": "Anson D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-30", "description": "Stopped by for brunch yesterday.  It was a beautiful day, a beautiful restaurant with wonderful food.  The pate (two ways) was absolutely wonderful.  My companions had the lobster, also delicious.  Service was excellent and attentive.  A perfect place for a celebration or a seduction.", "author": "Richard T."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-08-04", "description": "Walked across the Brooklyn Bridge and all the way down to The River Cafe and the snooty girl looked us up and down, faked a call and said they weren't taking any more people for lunch.  Thanks Brooklyn B.", "author": "Leslie W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-07-14", "description": "The River Café easily ranks among the top 10 best meals I've had so far in New York City. Perhaps it was the local, perhaps the ambiance, or even perhaps the food. Either way, all three attributes easily laid the foundation for an extremely enjoyable experience.\n\n1) Local. Perched almost beneath the towering Brooklyn Bridge, River Café is awarded with incredible views of the Manhattan skyline. Watching the sun set and twinkle of office lights would bring any non-romantic to their knees.\n\n2) Ambiance. Match #1 with a window-side table and your date's panties* will already have hit the floor (but in this case, I was the one being taken out. And yes, the previous still held true...). The actual dining area itself seemed to occupy a ship/barge/boat, but without any of the rocking and sea sickness. The live piano music, which one could hear at any table in the dining room, and softly lit space set the tone just right.\n\n3) Food: It was fixed price at $98 per person, which included an appetizer, entrée and desert. For appetizers we had the Sautéed Hudson Valley Foie Gras and the Yellowfin Tuna. The foie gras actually came with a strawberry crepe! I mean, how can one not go about ordering that? The yellowfin tuna was equally amazing. The lightly seared tuna with a foie gras mousse stuffing was perfectly complimented by the slight crisp of Italian bacon. And the Burgundy black truffle vinaigrette that this was all floating in proved so tasty that I had to slop up the remainders with some French bread (faux pax, I know, but what can you do). For entrées we decided on the Main Lobster Special and New York Cut Sirloin. Understanding that River Café isn't a \"steak place,\" the sirloin was surprisingly good. The lobster was also very good, but I have to say that the awards go to the aforementioned appetizers AND the dessert... Oh the dessert. The Goat Cheese Cheesecake is what one my heart. Swirling among a passion fruit gelée, this was bliss. So much so that I purposefully made this the last thing to touch my taste buds for the evening, just so that my dreams that night would go untarnished.\n\nI will be going back to River Café, but only for special occasions as I don't want this experience to seem trite.\n\n*Is it me or does this word sound so dirty?", "author": "Mark S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-09-22", "description": "My husband suprised me and took me here for our 1yr wedding anniversary. It was spectacular!!! The view, service and food was just amazing. We went during the month of March so we weren't able to dine outside but we had a GREAT view of the city right from our seats. We vowed to make The River Cafe our annual anniversary dinner location. \n\n(Gentleman, make sure you wear a dinner jacket but if you happen to be without, no worries, they have jackets to  spare)", "author": "Tracy E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-04", "description": "We went for a Sunday brunch and it was wonderful.  I was just going to have only one mimosa, but with ambiance, good food, and the view, I ended up having three!  My husband had crab/coconut bisque, lobster special dish, while I had smoked salmon appetizer, lobster omelet, and toffee chocolate dessert.  It was perfect!  I wish we could go like once a week, but the price doesn't allow for that.....", "author": "Su S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-08-17", "description": "This place is reknowned for the most amazing views of Manhattan and the food is as good as the ambience.  It is certainly one of the most romantic places to take someone special but do not go there on Valentine's Day (or any other fine restaurant on V Day for that matter) because you'll pay 3 times what you'd normally pay on a prix-fixe dinner or chef sampler.  Obviously, I'm the sucker who did go for the V-Day special but it was for a good cause to celebrate with my wife but it's certainly a place to visit on a regular night.", "author": "Dennie C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-17", "description": "Amazing view of the city and Brooklyn Bridge, romantic, boat-like setting, and great service. We went around 5:30 in the summertime, so we got to watch the sun setting while we had dinner. Ask for a window seat when you make your reservation, but even if you don't get one near the window, the windows are very large and almost anywhere you sit you will have a view of the water and the city horizon. Great food, even better dessert! Order the Brooklyn Bridge dessert if you like chocolate mousse and raspberry. Remember to dress up a little and men, don't forget your blazer. A little pricey but for a special evening (like to celebrate an anniversary with someone you love) the experience is worth it, in my opinion!", "author": "RJ C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-04-28", "description": "The food is as excellent as the VU. Most places with VU's fall short on the food, but this place scores! However, I was off to a difficult start when I was trying to secure reservations for 6. Read the end for my only gripes. \n\nFirst of all, I'm a loser cuz I didn't have access to a FAX (and had no time to go to Kinko's to do it. For RES for 6, they required a fax of your credit card. The ding-a-ling on the fone sounded like a transplanted Valley Girl but in BKLYN. Anyway, she agreed to hold the reservation tentatively since I told her I'd be in NYC in a few days, and wud walk in w/my CC. \n\nThe reason why they want a fax is cuz they have a stiff $98.00 cancellation PER PERSON fee within 72hours of your RES. Plus they state a 20% gratuity for groups of 6 or more. So, I go in and sign the necessary forms and appreciate the view in daytime. \n\nThanks to the persistence of a friend while I was out of the country, my wait-list for a Sat. nite came through! All that aside now, I could discuss the food and service. \n\nIt says a lot about a restaurant when they serve artisanal bread - and this place had really high quality bread. A choice of three types no less! My water glass was always filled. While perusing the menu, an amuse-bouche was served (Guess they learned that trick to make the customer happy!) \n\nBetween the six of us, appetizers selected: salad, rabbit ravioli with pancetta, seared maguro on edamame puree, and the rock lobster. Entree choices were: rack of lamb, steak (charged an extra $7.00 supplement - which is tacky for an expensive restaurant), and monk fish. Everyone was pleased with their choices. One third of my maguro was a little overcooked but the rest was perfect.  The rack of lamb was superb. I can't remember being at a restaurant where the lamb is seared first, and then finished by roasting it. The steak could not have been better. Excellent, excellent, excellent. \n\nBig eaters (like me) beware, I had to have two dinner rolls to supplement the chichi serving size. \n\nDesserts were fabulous. I won't go into detail here, cuz you could go to their site and look at the menu. To personalize the birthday girl - they had a (complimentary) chocolate plaque (about 1\"x2\") that said Happy Birthday. The pianist even did a tasteful rendition of Happy Birthday for us - even though we would have opted to be more discreet. \n\nGripe One: At the end of dessert, they placed one plate with 3 additional desserts: a chocolate mousse napoleon of some sort, their signature BklynBridge mousse cake, and something else - forgot. No one asked for this, and I was surprised they put it on the table. Well, it turned out it was on the bill - about $16.00. Okay, we're in a classy place and paying $98.00pp prix fixe - so we're not going to squabble over $16.00. \n\nGripe Two: Uhhhhh not everyone could afford an $800.00 bottle of wine. We had to dig deep into the wine menu to find a $50.00bottle. \n\nGripe Three: ....of which I have no control: I hate it when you go into an elegant restaurant and see people who have no table manners. I don't get it - people who don't even know how to hold a fork properly. They grab it like they're going to stab someone, and then 90 degree the fork into the mouth. Go ahead call me a snob. \n\nIn any case, I can't wait for my next visit to River Cafe. It truly is a romantic, sophisticated place that's requires no membership.", "author": "Stuart P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-12-07", "description": "MY FAVORITE RESTAURANT in the COUNTRY! SERIOUSLY.\n\nMakes me proud to be a new yorker once again.\nGREAT VIEW, GREAT DRINKS, GREAT FOOD.", "author": "Angela J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-02-10", "description": "Absolutely love it! Definitely, this is the most romantic place for dates!  My boyfriend and I went to the River Cafe for our third date.  As you enter the restaurant, you are greeted by a friendly host who takes your coat and other stuff.  Walking down toward the restaurant area, you see a fancy grand piano on your side; music is played by a pianist.  Because we arrived there a bit early, we waited at a bar area and order two glasses of mojitos that are made perfectly. Looking outside, we saw lit up skyline of downtown at night, and the view is fantastic.\n\nNow onto our meal, we sat facing the window to experience the night life of downtown of manhattan.  Starting with a special dish from the chef, we tasted and ordered a glass of fine merlot and cabernet wine.  My boyfriend ordered rabbit and dumpling and I ordered lobster bisque for our appetizers.  For entree, he got medium rare lamb chops, and I got medium ny steak. \n\nThe presentation of the food is gorgeous to the point you don't want to mess it up. The food itself is cooked perfectly to your taste. It was one of the best steaks I ever had! Definitely a fine dining I would say. \n\nAfterwards comes the dessert: brooklyn bridge chocolate cake with vanilla ice cream for him and chocolate molten cake with pistachio ice cream for me.  Because the food is so filling, I could not dare to finish the dessert.  But this is not the end.  The chef complements the meal by giving you gourmet chocolate pieces. \n\nI 100% loved this place! I would go there again, except for the price of the dishes is expensive. I won't lie. Per person for a dinner meal was more than $100. But for special occasion, I would love to try the River Cafe again. I hope this helps!", "author": "Janice K."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-08-26", "description": "Took my wife here for her birthday.   We are not foodies or culinary snobs, but we were disappointed with the food in relation to our bill.\n\nYou're paying for the ambiance and views, not the food.  I have never spent as much on a dinner as I did at the River Cafe.  I knew what to expect and our bill didn't shock me; my gripes about this restaurant are not about that.  But when spending that much money, the conversation should go something like: \"Oh my god, you have to taste this\" rather than \"taste this and tell me what you think.\"\n\nThe sides that came with each of our dishes were awesome, but the main dishes were underwhelming; either being over flavored or lacking flavor.  Everything is presented nicely and the staff was great.  Don't get me wrong, nothing was gross, overcooked or undercooked, it was just OK food.\n\nI can name a few lesser known restaurants in Atlanta that have MUCH better food at 1/4 of the price tag than The River Cafe.  Go for the views and vibe, but leave your taste bud's expectations at the door.", "author": "James D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-08", "description": "Excellent   nice  romantic  place  if you are sitting  in fron of  the  window  because  the  view  is  amazing, plus  the  piano  bar  nice  touch  very  upscale , make sure  you have  reservations, is really  hard  to just walk in and get a window seat , ..... $$$$  always", "author": "Mila Z."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2007-10-10", "description": "Whenever I want to indulge in spectacular food, spectacular views and good service, I come here.  I've eaten at this restauarant a couple of times  and never had a negative experience.  \n\nWhich reminds me to make reservations in the future.", "author": "Jessica G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-11-20", "description": "i came here on saturday, July 5th when my boyfriend and I were vacationing in New York...i absolutely love this restaurant.\n\nThe view is just breathtaking... we had an early dinner but it made the experience even more amazing! We sat one table away from the window and enjoyed the amazing view as we ate our dinner. \n\nthe food was great and the service was just superb! the whole staff was very alert and helpful to our needs. \n\n\nmake sure you make reservations weeeks ahead because this restaurant gets booked quick!", "author": "Steph S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-09", "description": "Just an all around wonderful place to celebrate a special occasion. While there may be better food in NY, there is no better combination of food, ambiance, view and service. \nJackets required for men and children over 14. \nI found the food to be very good, and the service very attentive and accommodating. Not a place if your looking to be loud or overly celebratory, the perfect place for a quiet and beautiful night!", "author": "D R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-13", "description": "Spectacular view and food. The price seems justified to me by the outstanding quality of the service and everything else. I'll come back for special occasions!", "author": "Nicolas R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2007-10-23", "description": "We spotted this place a few weeks back when we took a boat tour.  We imagined it as a place similar to Boat Basin Cafe....boy were we wrong!  We stopped in for lunch yesterday and almost turned around cuz my guy felt a little underdressed in t-shirt and tennies.  But we stayed - and are so glad we did!\n\nThe view was amazing, the service was friendly and attentive but not too so,  and the food was amazing.\n\nWe started with the Terrine of French Foie Gras served with the most perfect crostini - it was delicious.\n\nMy husband had the Shellfish Trio, crabcake wih avacado, lobster ravioli (both of which he thought were under seasoned) and shrimp tempura with ponzu sauce.  \n\nI had the Branzino fillet  which was topped with a crispy 'stuffing\" of chorizo and shrimp  -it  was cooked perfectly and delightful.  \n\nGood spot to take visitors and the menu was great, it was difficult to choose what to order.", "author": "deaner b."}], "servesCuisine": "American (New)", "priceRange": "Above $61", "name": "The River Café", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Water St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/C_8aEbAvcCLhiqXn9QdWSw/ls.jpg", "@type": "Restaurant", "telephone": "+17185225200"}