{"aggregateRating": {"reviewCount": 1049, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-15", "description": "Best indoor view of the Brooklyn Bridge you'll get. It was raining the day we tried to walk the bridge and we gave up and came here instead. We didn't have a reservation, but were able to be seated at the bar. The irish coffees - literally the best I've ever had in my whole life. It takes almost 10 minutes to make one, but worth every minute. Didn't eat here, but the service was also spectacular.", "author": "Ashveen S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-04-25", "description": "Rude and arrogant maitre d cancels reservation and has birthday girl leave in tears.\n\nMy fiancé wanted to give me the most memorable evening he could on my 40th birthday,and, therefore, was thrilled to be able to procure a reservation here, which claims on the website to offer \"a magical experience.\"  He made the reservation, and though the website specifically states that there are no advance seating requests taken (all seating is at the discretion of the maître d upon your arrival), he still noted in the applicable section that it was my 40th birthday and that we would very much like to sit by the window. When the hostess or reservationist called to confirm the reservation, we reiterated our request.  She said that she had written it down in the notes for the maître d but, once again, that seating requests are solely at the discretion of the maître d.\n \nOur reservation was for 7 pm.  We arrived early so we could enjoy the bar area first. When we checked in at 6:20, the restaurant was, perhaps, only half full and there were a number of available tables by the windows.  Additionally, there were no parties behind us waiting to be seated.  The maitre d, Josh, asked if we would like to be seated early since there was so much availability. We agreed, feeling excited that given the situation, we would most certainly be able to be seated by the window. Instead, Josh told us that this was not to be; however, there were other options. My fiance explained that it was a very special occasion and that there must be something he could do -- after all, the tables were empty, but Josh's response was that it was \"impossible.\"   We could not fathom how this was an impossible request, since there are no advance seating requests honored as specifically stated on your site and by your employees and there were several available tables by the windows.\n \nWe specifically arrived early and were prepared to wait, if necessary, for a window table to be available.  We were well dressed for the occasion and we were there to celebrate a very special birthday.  Instead, Josh tilted his head, bent forward so that his face was close to mine and told me to leave, and that perhaps, I should come back at another time.  I was dumbstruck.  My fiancé was prepared to spend a significant amount of money so that we could enjoy the chef's tasting menu, wine tasting, champagne, etc.  Instead, although this will be one of the more memorable birthdays I ever celebrated, it certainly won't be the kind of \"memorable\" my fiancé and I had in mind.  I left in tears.  My birthday was ruined because one of their staff - obviously, a prominent part of their staff -- was so arrogant and unkind that he believed it acceptable and within the scope of his duties to send customers away, rudely dismissing them, erasing their reservations and ensuring that they will never come back.\n\nI could never get back what was so cruelly taken from me; and with all of the fabulous restaurants in New York, I do not have to spend my money in one that is so sure of itself as to place itself above common decency.", "author": "Atty F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-06", "description": "This is heaven. If I never try another, my dining life is complete. 5 man service. Attention to every detail. The food was the be all end all. Every bite was better than the last. The aperitif was exquisitely presented. The bread was perfection. French an olive were just as wonderful as the multigrain. Appetizers for our table included oysters, three shell delicacies and I enjoyed crab cake. My descriptions are not worthy of the culinary deliverables. Lamb, chicken and fish decorated our table. Normally I must have a standby tequila to rate an establishment 5 stars, but they suggested an Extra Anejo that was excitingly added to my top 3 all time list. (Siembra). Back to the service, I prefer my water sparkling with ice and a citrus slice. Yes, they kept the glass full and continued to add ice as needed. I love a venue that has a doorman and requires a suit and tie. It's just as it should be. Desert to follow...  I'll let you decide for yourself what you like best.  This establishment has exceeded all expectations. WOW!", "author": "David S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-21", "description": "this is definitely my favorite brunch place in Manhattan and Brooklyn. Perfect vibe, it is just under the Brooklyn bridge and by the river! Benedict is perfect and the French toast is yummy. There is only one thing I don't feel well: yesterday they would hold a private events at 1:pm, so my friend and I should leave before that time. Except that, everything is perfect.", "author": "Yan H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-17", "description": "Fine dining at its best!  The view of NYC is mind boggling and the service matches the ambience.  Located under the Brooklyn Bridge and across the river from World Trade Center, the River Cafe provides a truly memorable evening.  Service is incredible and beyond anything you would expect!  Never rushed, delicious food, great wine!  Not inexpensive but worth it!", "author": "Pat M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-17", "description": "Absolutely beautiful scenery overlooking Brooklyn bridge and all of Manhattan skyline. The choices on the pre-fixed three course menu were plentiful and all sounded pretty good! I highly recommend the beef tartare for appetizer. Would definitely recommend this place for romantic dates!", "author": "Christie W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-20", "description": "The interior really needs some renovation and the service was not as good as expected. The food tasted okay but not very delicate.", "author": "Catherine C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-26", "description": "Watch making a reservation here! You need to be aware that if you don't show up with a jacket or confirm to cancel (even immediately as we did), there's a $100+ cancellation fee per person and they are not flexible at all, unless you hustle with a manager. They're in for your money...", "author": "Enrique P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-27", "description": "If I could rate this with 6 stars I would. \n\nOkay let me start by saying that I am foodie to the fullest degree, and I have been blessed enough to eat at great restaurants all over the US. \n\nBottom Line is this - if you have a date and you really want to blow their socks off go to the River Cafe at night so you can enjoy the views and the service and the food. \n\nFood: It is a 3 course or 6 course option - we went with a party of four so we went with the 3 course options.  Everything was terrific and they have lots of options for Starter, Main and Dessert. \n\nWine:  They have the most fun wine sommelier I think I have ever had, not stuffy and he feeds off your energy, so if your in a good mood, he is in a good mood.  \n\nViews:  Insane!  From the moment you pull up in the circular drive that is surrounded by the most beautiful gardens and lighting it makes you feel like you in a romance movie, to when you are seated are amazing!  They also have a great bar area with amazing views for an after dinner drinks which we did and it was great!  \n\nThe whole place just fills you with romance and the Michelin Starred Food and Chef do not disappoint as well! \n\nThank you river cafe for giving us yet another one in a lifetime culinary experience!", "author": "David S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-09-24", "description": "Yes it's a dowdy old dowager. but the food is still excellent. OK the service is over the top and the yellow sun shades are 20 years past their prime, (as is most of the décor) But, the food is still tops and the view brilliant.\nOh yea....get a banquet bench along the back wall....the chairs are torture. it's a birthday/anniversary joint and it fills the bill.", "author": "Lawrence S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-25", "description": "Really great food in a spectacular atmosphere. The waiting staff were all pleasant and the perfect blend of attentive, and sociable, while it being over bearing.\n\nThe space has fantastic views of Manhattan and really is something to behold.\n\nThe food was incredible, I had the pork and scallops to start, and the lamb for mains, with the key lime soufflé for dessert.\n\nIf I'm honest the key lime soufflé wasn't much to write home about, but I'm the first to admit, I'm also not really a fan of dessert.  That being said It was cooked well and the flavor was good.\n\nThe starters and mains truly were delicious. Everything was cooked perfectly and packed flavor and texture with every bite.\n\nPrice wise, its $125 pp for 3 courses. For two of us the total bill came to $338 excl tip. We had 2 gin and tonics and a glass of prosecco, so pretty standard price for drinks in a nice setting.\n\nOverall, the River Cafe  is a really great restaurant, and definitely a great location for a special occasion!", "author": "Peter C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-08", "description": "Ambience: AMAZING. I was expecting it to be all uppity and snobby, but was pleasantly proven wrong. The crowd does tend to be older and dining room was fairly hush for a full restaurant on a Friday night. They have an elegant bar overlooking the river and beautiful live piano playing in the background. No matter where you get seated, you have a pretty solid view of the Brooklyn Bridge and gorgeous city lights. \n\nStaff: Very respectful and kind. They all work together very well to make this an elegant and romantic experience. Everyone from the doorman to the waitress/waiters to coatcheck staff were poised and informative if we had any questions at all about the restaurant or menu. \n\nFOOD: OKAY SO MY FAVORITE PART! The food was EXQUISITE! Everything was prepared with lots of attention and the unique flavors came together to have a party in my mouth. Super pleased. \nAppetizers: crab cake \u0026 avocado vs. buttered shrimp = hands down, the shrimp won! There were two jumbo shrimp glazed with a perfectly sweet and savory buttery cream. \nMain course: Lamb chops vs. salmon = ding ding ding - winner goes to lamb chops! They were perfectly moist and savory, full of flavor. The salmon was just eh-ok, although it was served with a delicious mushroom sauce and rice which made it worth it. \nDessert: S'mores chocolate mousse vs. Brooklyn Bridge raspberry and chocolate mousse = TIE. We really couldn't decide, I found myself digging at both my Brooklyn Bridge and the S'mores chocolate mousse. \n\nPrice: Okay, here's the big kicker. They have a pre-fixed menu of $120 and then extra for any drinks/wine/coffee. For the experience and well-cooked food, it's worth it and I definitely left feeling full :)\n\nWill I be back? YES! So much more on that delicious menu that is just waiting to be tried. ;)", "author": "Tahira R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-10", "description": "This is a super waterfront restaurant. From entering the premises, the service was warm and welcoming right throughout the evening! The food doesn't leave much to be desired and together with the ambience of the place, it makes a fantastic experience! Ernesto, our waiter, was great and as a result of the 'lingering cloud' of my cologne I learnt he was very much into fragrances, Prada Sport being his current favorite-:) I would certainly recommend this restaurant to anyone and be sure to ask for Ernesto! Cheers!", "author": "Arun G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-01", "description": "Omg I love this spot. This is one of my fav my man took me there for our 5th year anniversary and it was beautiful. Quiet and Very intimate and the ambiance (sigh) you won't regret. They are professional and extremely nice. Food is fresh. We sat by the water the view is just beautiful. We need to go back.", "author": "Fadjen B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-24", "description": "I can honestly say I've never been more insulted in my entire life. My boyfriend and I came here for our 3 year anniversary and being a young, modern couple i felt that we were not wanted in this establishment from the second we walked through the door.  My feelings of this were only confirmed too soon when we were asked to leave before we even had drinks. Knowing that this restaurant had a very strict dress policy we were dressed to the nine's, my boyfriend wearing a brand new 3 piece suit. Once we were seated however he went to use the rest room and took his jacket off to which the waiter told him he had to keep the jacket on the entire time he was inside. He told the waiter that he was just running to the bathroom and would absolutely put the jacket on once back at the table to which the waiter said that was fine however that was apparently not fine. \n\nThe most rude, condescending, pretentious man (maitre'd) I've ever met in my entire life cornered my boyfriend in the bathroom...while he was using the bathroom to tell him he was rude and we had to leave! Highly inappropriate! He then tells him to wait outside while he comes over to our table in front of the whole dining room to tell me that they will not be serving me dinner and i had to leave. None of the employees even had the nerve to look me in the eyes. They were treating me as though i was a peasant they were shooing out of a place fit for royalty. \n\nI cannot even believe an establishment like this is still even in existence in the Brooklyn that i love so much. It's absolutely appalling.  My recommendation to anyone that sees this is to stay far away! Judging by other reviews I've seen the food isn't even worth dealing with that sort of environment anyway and i'm actually surprised they haven't been sued for some of the treatment accusations I've come across. My suggestion, go down to Brooklyn Bridge Park as it is absolutely beautiful take in the sights and sounds and then take a short walk over to a restaurant called Henry's End. It may look like a little hole in the wall but the atmosphere is romantic and welcoming, the staff is excellent and super friendly and the food and wine is absolutely phenomenal! DON'T WASTE YOUR TIME OR MONEY AT THE RIVER CAFE!", "author": "CJ M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-26", "description": "There was a huge bug on the salt\u0026pepper grinders. I didn't want to touch the pepper any longer after the waitress replaced that with another set. She explained the bug may be coming off the flowers on the table. Ewwwwww\n\nFood was okay. Decor is beautiful, but they didn't give us a table by the window even most of the tables were available by the time we arrived. I reserved this spot three months ago and wrote down the request in the note.", "author": "Yueran L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-12-11", "description": "This review is not based on the food, this review is based on our entire experience. So I book a reservation through open table for today 12/11/16 for 7:30pm. I got the confirmation and then in the morning I get another email saying your \"reservation has been canceled by the restaurant\" it's our final night in NY so we wanted to have our final dinner at River Cafe. So I was pissed off I called the restaurant spoke to this guy named Josh (I think that was his name) and he said open table is the one that canceled your reservation, open table didn't cancel my reservation I have an email that clearly states my reservation was canceled by the restaurant. Josh gave me a stupid excuse my credit card was declined (first of all I have a $30k limit) there is no way that credit got declined I even called my credit card company and they said you didn't have any declines. \n\nAnd then Josh offers us a table for 10pm he said that's the best he can do. Puts me on hold to get my reservation reserved comes back 2 mins later and says I'm sorry we can't take you guys tonight I can put you on for another night (I've already told him tonight was our last night we are flying back tomorrow) \n\nAnyways this was a big joke. Horrible service and even more horrible personality wth a bunch of lies.", "author": "Garri T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-22", "description": "Spectacular Dinner with my sweetie. Good experience for whoever want to be \nHappy anniversary", "author": "Napat F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-15", "description": "The view of the manhattan skyline is unbelievable from the restaurant. My girlfriend had been wanting to eat here for a long time and when we finally got around to visiting NY together this was our first stop for dinner. We got the oysters and scallop ceviche to start as well as the wagyu tartare and Foie Gras, and it was all amazing. I ordered the branzino and my girlfriend got the lobster - absolutely incredible. We came back the next day for champagne and caviar and watched the sunset. Highly recommend!", "author": "Leigh A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-02-27", "description": "A very disappointing experience to say the least. Friends were from out of town and wanted to go to a restaurant with a view so per their request, I booked dinner at 6pm and specified a window view via OpenTable. When we got there, the hostess asks if we would like to check our coats and we say no but thank you but what was next was not only embarrassing but devastating. She then goes to my friend with short hair, \"Sir, we require men to wear a suit jacket\". Then I said, \"I'm sorry, she's a woman\". Of course, she apologizes and shows us the way inside the restaurant and then the manager there said, \"excuse me, we require men to wear a jacket\". Again, \"I had to say, I'm sorry, she's a female!\". Wow. Really? You would think if they made an embarrassing mistake like that, they would inform each other that they just said something so inappropriate. This already left a really bad taste in my mouth but I didn't want to make a scene since my friends wanted to eat here.\n\nThen they ask us to wait at the bar because our table wasn't ready and we got to our table, it wasn't even a window seat. The restaurant wasn't busy at all and only had two other tables. We also got there 10 mins early too. We ask if we can have the table at the end by the window since it's a table for 4 but the gentleman said why? This table is better. They gave us a table not by the window and it was a table for like 5. Really? Wow, talk about accommodating customers who made early dinner reservations with special request?\n\nSo we sat down and around 8pm, we saw the table we wanted got seated with 3 people. Now, how was that table not available to us when we were there before them and our dinner reservations was earlier? The restaurant was not even busy when we got there. I can understand if you seat that table with 2 or 4 guests but this table has the same number of party as we did, 3.\n\nAnd food was simply mediocre. You would think paying $130/pp, the food would be outstanding. And the gentleman who seems to be in charge of overseeing the table, came over twice to ask us, \"what was the occasion for dinner?\" And we said it was a simple get together for friends out of town. Why do you need to come by twice to ask us the same question? Why do we need to come to dinner for any special occasion?\n\nAs a foodie, I've been to many restaurants and this is one I would definitely NOT recommend or go back again. Horrible. Simply horrible. Thanks for making my friends feel like crap.", "author": "C C."}], "servesCuisine": "American (New)", "priceRange": "Above $61", "name": "The River Café", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Water St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/C_8aEbAvcCLhiqXn9QdWSw/ls.jpg", "@type": "Restaurant", "telephone": "+17185225200"}