{"aggregateRating": {"reviewCount": 1049, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-10", "description": "Beautiful, the lights surrounding the restaurant set the fairy tale mood... Would love to return for the view, this is one of those places where you eat with your eyes. Food is good, but it doesn't haunt you like the setting", "author": "Nana K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-10-04", "description": "This place seems to be built for tourists. Understandable... under the brooklyn bridge and all. but living in NY, we were not impressed by this place. We went for brunch. If you want to spend a bunch of money on a prix fixe menu, go to Gramercy Tavern. You'll get your buck's worth and more. The service here was worth 3 stars, and so was the food. The flavors were good, but nothing amazing. For a $55 brunch, we  at least expected bread on the table. They either forgot, or it was not included. Dessert was also not included. \nAs far as ambience is concerned, it was good, but the best seats are next to the window. Anything other than that, and you'll find yourself wishing you were next to the window. \nAll in all, I'd say that if you live in NY city, I'm sure you can come up with a better place to spend your money. If you don't live in NY, you'll probably be impressed.", "author": "Aruna R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-11-23", "description": "OVERRATED AND WAY OVERPRICED ARE THE TWO WORDS THAT COME TO ME! This place is a joke, they are so snobby in here and you have to beg them for a window seat even if it's empty! Never going back here!", "author": "Jimmy S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-15", "description": "Came here Saturday lunchtime. Have been here before and the food and ambience is always really good. Very unprepossessing exterior from the water; but once you get inside you realise why this place is such an institution. The men still have to wear a jacket for dinner; and I really like that! There are flowers and plants everywhere and there is a private room for weddings and other functions. There is a lovely garden outside and a terrace. The view of the East River and the Brooklyn Bridge from the restaurant is breathtaking, as it's literally situated just underneath the Brooklyn side of the bridge. We had the brined trout and the smoked salmon, followed by the skirt steak. Eveything was perfectly executed and presented beautifully. Then we had the Tarte tatin and the Brooklyn Bridge Marquise which was a bit rich for me, but I'm sure has many fans. Will definitely be back.", "author": "Punam D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-03", "description": "Top knotch restaurant. Service was flawless, ambience was amazing. Having the window seat was incredible.. What a view. The amuses were great, as well as the entire meal. I had the raibow trout, with belini And roe, And the rack of lamb. My girl got the crab And coconut tomato soup And the Lobster. And it was the First time i had goat cheese cheesecake... Awesome. Pricey, but on special ocassions is an A plus spot.", "author": "Ariel P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-10-01", "description": "A great place to celebrate a special occasion. The view, food, wine and company was fabulous.", "author": "Donna-marie G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-14", "description": "Delayed review but my wife and I really enjoyed an anniversary dinner here a while back. Great food and service, but the view is incredible.", "author": "Dave M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-15", "description": "Since this is the only deserving 5 star review (so far), I'll give a more detailed review.\nLe boyfriend took me here for our 2 year anniversary, and I was glad he did. Exactly what you would expect from a 5 star restaurant. Great food, amazing service, and a very upscale/romantic atmosphere. \nThe Food - Their steak was perfect, salmon was fresh, and the deserts were amazing. Everything was cooked to perfection and the champagne and deserts the waiter recommended were also amazing. The miniature chocolate version of the Brooklyn Bridge was cute.\nThe Service - Everyone was very pleasant and professional, from the valet to our waiter (who offered us a window table as soon as one became available, even without us asking, which we took). \nThe Atmosphere - Very classy, and has an amazing view at night. The live piano and violin were a nice touch. It's a good mix of romantic/high-end dining with an old-school feel. \n\nWould highly recommend, and would definitely return. Probably for Lunch next time so we can walk around their amazing garden.", "author": "Lily W."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2006-08-07", "description": "My parents did not buy me battery-powered toys when I was a kid. My brothers and I played with Lego and Lincoln Logs and saying \"I'm bored\" prompted the injunction to \"Go read a book.\" No surprise that when I had playdates at other kids' houses the only thing I wanted to do was play Hungry Hungry Hippos, Operation, or Sega. (No surprise either that I now make software for kids.)\r\n\r\nThe worst--and most common--response to my wanting to play these games was the friend saying, in a totally bored voice, \"Oh, the batteries are dead\" or \"We lost the body parts.\" That sort of disappointment is about what I felt while dining at the River Cafe. Granted, the view is amazing and you feel like you're on a big fancy boat, but in my opinion the hype about the food is complete misguided. \r\n\r\nWhat really gets me is that the pre-appetizer \"compliments of the chef,\" a doll-sized teacup of lobster bisque, was awesome. It made me think I was at the right restaurant, watching the sunset beyond the Manhattan skyline, peering at the Statue of Liberty in the distance, having a romantic dinner blah blah blah. The bread, too, was great--I had three fennel-raisin rolls; when the waiter came around the fourth time, I almost expected him to suggest that I cut down on carbs. All in all I guess we got off to a good start: my dirty martini was smooth and had the perfect amount of olive juice. \r\n\r\nMy boyfriend and I shared two appetizers, a tuna tartare and some foie gras plate. The latter was way too sweet  (think foie gras with Welch's grape jelly). And ever had raw tuna? Well yeah, then you've had this dish. Our main courses were some kind of duck--a little overcooked even though we asked for it underdone--and sea bass or one of those white fishes that are sometimes light and melty in your mouth and sometimes dry and cafeteria-like (you guess how this one was prepared).\r\n\r\nI am a fairly critical person, but I was dying to like this place--the waitstaff was friendly and the venue was beautiful and, let's face it, everyone wants to love restaurants in Brooklyn. But all the food we were actually paying for--and when I say paying I mean really racking up the airmiles on my credit card--was mediocre. Even the desserts! I mean, how hard is it to make chocolate into something delicious? I've had better desserts at McDonald's.\r\n\r\nThe point is, the River Cafe is a lovely place for a drink , especially if you can rope one of the waiters into giving you free bread. For dinner, though, you'd be better off packing a turkey sandwich and having a picnic on the Brooklyn Bridge.", "author": "Lise C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-09-24", "description": "Staff is stuffy to the point of rude! Very unpleasant experience.", "author": "Stephanie C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-09-28", "description": "The food here is really REALLY good.  I enjoyed every course that was in front of me.  The dessert was kind of unimpressive though, especially when compared to all the wonderful courses that came before it.  The restaurant also has a really spectacular river view.  I've eaten there twice and enjoyed it both times.  Service was just OK, not great, especially not compared to other restaurants that are of this quality.  Why 3 stars though?  I think it's really overpriced.  I am ok paying a lot of high quality, but I've had as nice meals at other highly rated restaurants in the city.  I like this place, but there are better places to spend that kind of money.", "author": "Brad K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-03-24", "description": "Find yourself not giving this restaurant a 4 or 5? Please message me and I will tell you where to buy good taste... \n\nThe minute you drive into this segregated restaurant surrounded by lights and trees and the valet takes your car... you feel the beauty... \n\nYou look up and see the bridge and directly in front of you.. the entire NYC skyline, as close as it gets without being there... You walk in to what seems as a gangway (it technically is on a barge) and you witness class at its finest. Guys, make sure you have a jacket for this place they're pretty strict and girls, dress to impress as always. Always make reservations and don't be hesitant to eat dinner late if that is the only time available, normally I would suggest making reservations as close to the date you want to go as possible because if it is raining, or cloudy, you will not get to experience the breathtaking aspect of it all. \n\nThe tables and booths are formed in a way so everyone is facing the city. I have yet to get a table right by the glass, but the tables I have sat at were in the back and still with a perfect unobstructed view of everything as if you are dining out in the water under the stars (minus the yucky smell). \n\nI had the chefs choice and it was the best selection I have ever made. The chef prepares 7 courses for the couple, feel free to tell him what your dislikes and likes are, and they will always modify the menu for you. We were served items I would never have considered ordering on my own, Pig filled ravioli, rabbit, black truffle cheese with potato mushroom gnocchi, lobster.. this list goes on and on... The food kept coming and they didn't spare anything.. it was as if they'd declare WAR on our taste buds... and clearly our white flag was up and we were done surrendering to their every dish.\n\nBring your credit cards kids, I believe the bill turned out to be 275 to 300 with the tip for two people.... yes although steep.. we did have 7 courses each of the finest food, dessert, and a tip for our waiter who spoiled us rotten.", "author": "Antonella B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2007-12-23", "description": "YES on River Cafe!\n\nI went here for a romantic birthday dinner.  My sig othe (short for significant other, a phase I loathe) was generous enough to treat me to a legit fancy meal.\n\nI got there a little on time, and my date was a little late, so I had time to appreciate the nautical theme (read: tiny bathroom) and the breathtaking view.   Sitting at the bar, I ordered a Manhattan, because I thought it sounded \"classy\"--then I realized, I've lived in Manhattan now for several years and the first time I order one is in Brooklyn? What a tool!  Glasses for Manhattans are hella tipsy, and some dude nearly spilled my whole glass.  Crisis averted though--I may be a klutz, but I'm pretty protective of my damn liquor.\n\nI not ashamed to admit that I loved how you sit next to each other in tables for two! So romantic!  It did make me feel a little like I was on a panel of judges.  Judging the skyline.\n\nThe food was really great!  We had lamb and venison, and quail eggs and all sorts of crap, it was all great.  The only thing that was a little lame was my ice-cream, which was in the shape of the Brooklyn bridge.  It looked cool though, and that counts for something.\n\nWe had a $75 gift certificate, and it didn't even cover the tip.  You better believe I licked that quail yoke off the plate.  It's glam though, so if you've got the cash, go for it!", "author": "Andrew B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-26", "description": "The view can't be beat. The service was attentive.  The food delicious. We went for lunch which is prix fixe. Lovely live piano music in the background. Interesting choices on the menu. Everything was all that I had hoped for.", "author": "Linda D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-01-13", "description": "Ah, the most common proposal spot in NYC.  \nThat's all. \n\nThe food is decent, but you will sacrifice the quality for the view. \n\nThe duck is decent, the salads are palatable and the desserts are standard fare.  I'd consider this place if you either want to propose to someone (perhaps at lunchtime? its cheaper) or.....you wanna spend extra money for a view you want to enjoy indoors...", "author": "Liz M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-06", "description": "Since trying foie gras here for the first time, I've been ordering it at whatever restaurant has it on their menu.  After 10-15 different variation of foie gras, I have to say that The River Cafe still has the best one...", "author": "Iana R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-07", "description": "Without a doubt, one of the finest places to eat in the New York area.\nYes, it's quite expensive, but for a special occassion, such as Christmas or an Anniversary, it is well worth it.\nWalking into the attractive reception on an evening it's clear this place is going to be good. The atmosphere is set by a musician at a grand piano and the lighting creates the most romantic setting. The food is very good and the wine choice is excellent. But its the jawdropping, unrivalled views of Manhattan which really make this restaurant.\nA four course set menu for Christmas Day is $125 per head, which isn't bad considering just how terrific this place is. It may not be somewhere you dine at every week, but as a one-off the River Cafe is a must.", "author": "Laura W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-07-05", "description": "Super disappointed. As a local to DUMBO, I stopped by over the weekend to enjoy a snack and cocktail on the patio. When we were sat, it was explained there was a $25 minimum per table, by the host. Once we received a check, our bill was a minimum of $50 as we then were told it was a $25 minimum per person. The waiter was even confused that we had not ordered more. That's fine. However, if you have minimums communicate them properly. We would have enjoyed more food or perhaps come another time when we were more hungry. I did discuss this with the hostess who just noted that it was policy and was not really willing to understand the miscommunication by her staff.", "author": "Lindsey S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2008-11-22", "description": "Everyone who has written positively about this restaurant has commented on the view. Umm, the Brooklyn Bridge and the Manhattan skyline are not owned by the River Cafe. You can get free views lots of other places!\nMy husband took me here to celebrate my birthday. My first impression: pretentious, stodgy, \"old,\" obnoxious, meant for conspicuous consumption but not an enjoyable time with good food.  The dining room was almost empty at 6PM, and so we were assaulted with 5 waiters who gaped at us the whole time from about 5 feet away. And it was so quiet I felt I was in a library. Yeah, there was Manhattan, which I see on the B/Q train everyday. They offer you \"complimentary\" appetizers, (basically which could fill a thimble), but obviously vegetarianism is not chic here, so they don't bother to ask whether you consume meat. \nWine list is extensive and expensive--the menu filled with interesting variations on executed cute animals (oh no, Bambi and Thumper)! \nall for the GDP of a small country. \nI felt uncomfortable the entire time. Because it is expensive didn't make the occasion \"special.\" I didn't take pleasure in dropping the name at my next social gathering. Rather, I left, and promptly visited my favorite Japanese restaurant for a vegetarian feast, all for under $20.", "author": "Colleen H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-31", "description": "My family comes here quite often and we've never been disappointed. You honestly can't go wrong with anything you order, my personal favorite are the crab soup and ny sirloin strip. For dessert the goat cheese cheesecake is fantastic, so is the apple tart. Great food, great view, amazing service!", "author": "Kemi O."}], "servesCuisine": "American (New)", "priceRange": "Above $61", "name": "The River Café", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Water St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/C_8aEbAvcCLhiqXn9QdWSw/ls.jpg", "@type": "Restaurant", "telephone": "+17185225200"}