{"aggregateRating": {"reviewCount": 1049, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-23", "description": "All in, the finest meal and service ever!    Visiting Manhattan from Houston, we cab'd it on a Sunday morning.  Brunch was a selection of two courses but with lots of accompaniments, like the granola served in quail eggs.  Food was outstanding and service was impeccable but not hovering.  I do suspect they check your pedigree and locals get the window seats, but that's business.  Will unequivocally book a return visit on next NYC trip.", "author": "Garner S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-22", "description": "High class restaurant with great service and excellent food. Servings were nice and big too, which is a rarity at high-end restaurants. Would definitely recommend for a special night out with a great view.", "author": "Jordan D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-10", "description": "You will be here because of the river view. This restaurant is built on a used boat. Sitting in restaurant you can see the east side of Manhattan coast and Brooklyn bridge. The music is also elegant, there is a live musician playing piano. It's a great place for family hanging out while enjoy the view. The food is also delicious. I had crab cake as appetizer and steak as main course. They are unique and beautiful, just like a piece of art. Desert I would recommend Brooklyn chocolate bridge. The only complain will be the AC is too cold. I got a cold the day after", "author": "Jordan Z."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-29", "description": "I really like this place because their environment is very eye-catching, and the enthusiasm, smile, and attitude of their waiters.", "author": "Jing C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-11", "description": "Came here for my birthday. We had the 7 course dinner. The food was amazing! The service is perfect! The view was incredible! The ambiance is quiet and relaxing. I would love to come again very soon!", "author": "Martha L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-29", "description": "I went here to celebrate my mother's birthday. The wait staff was very friendly and attentive. We also went late and even though they were closing they didn't rush us out of the restaurant. The food was delicious and full of flavor. The ambiance was nice and the restaurant is located near the water so it's a nice option for a romantic evening.", "author": "Kiki S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-31", "description": "My second time at The River Café and I'm as impressed as last time! First of all the location is absolutely lovely right under the Brooklyn Bridge next to the river. There's also a beautiful garden in front of the entrance.\nThe service at this restaurant is excellent just as it should be in a place like this. Also, the decorations fit the place perfectly. Very nice attention to detail that gives it a special atmosphere. The view of Manhattan is spectacular, definitely try to get a window table (you'll have to be a smaller party). \nWe came in on a Sunday for brunch. I had the foie gras followed by the lobster plate and then the Brooklyn Bridge cake for dessert. The presentation of the meals are very nice and they taste as good as they look. I'd say the Brooklyn Bridge is a must for dessert as it not only looks great but it tastes grate too! \nThis is an expensive place so be prepared. That being said it's worth every penny. This is a very unique place that I will most definitely come back to next time I'm in New York. \nLastly, you do need to dress up!", "author": "Bendik Johan W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-24", "description": "The boyfriend surprised me with a birthday dinner here in the summer. I was blown away by the décor upon walking in, a restaurant that sits amidst a garden with fairy lights and oversees the water with a view of the Brooklyn Bridge.\n\nThe boyfriend tried to ask for a table by the water but we got seated in the furthermost corner instead, which I was okay with. It was a cozy enough section with us sitting adjacent to each other. Of course it would have been even better to sit directly by the water, but we were able to take a stroll after dinner along River Cafe's outdoor deck and take plenty of pictures.\n\nIt was $125 fixed price per person for appetizer, main course, and dessert. For appetizers, I got the Sea Scallop and Foie Gras, which I enjoyed, but the Foie Gras got too heavy for me to finish entirely without the bf's help. He got the seasonal Crispy Tempura Soft Shell Crab which was served with a watermelon, pickled jicama and pineapple salad, which was refreshing. \n\nFor the main courses, I got the poached Nova Scotia Lobster served with squid ink cavatelli pasta and spinach gratin while he got the 16oz Niman Ranch Strip Steak which was served with a bone marrow Duchess potato. I really enjoyed my entree while the boyfriend stuffed himself silly with the massive meat and potatoes. \n\nWe ended off with the iconic Brooklyn Bridge dessert for me and the Pistachio Semifreddo for him. Honestly, of the entire dessert menu, the Brooklyn Bridge sounded the least appealing to me, but the bf insisted I should try the Bridge. And when it came on the plate, it was certainly something cute to take a photo of but I didn't really eat much of the chocolate pieces shaping the bridge and ultimately enjoyed the boyfriend's dessert more. We also received a few additional complimentary chocolates and macaron. \n\nThe only thing that really detracted from the experience was the service. It was perfunctory and sufficient, but not the most attentive. Perhaps we looked young and we didn't order any wine, but we felt largely ignored in the corner. We tried to get the attention of our waiter so he could help take a picture of the two of us ... to the point a kind lady sitting next to us took pity on us and offered to take it for us, stating she knows how it feels. \n\nThe waiter was also surprisingly not the most tactful. While taking our dessert orders, he asked bluntly if we were celebrating any event, birthday, anniversary, etc. so he can jot it down in his pad. Taken aback, we replied it was my birthday. We understand River Cafe is probably expected to be a place for mainly special occasions, but the way the staff handled that as if they were a factory churning out routine celebration desserts didn't seem to fit in with the high end etiquette the restaurant supposedly promoted. My boyfriend was disappointed, admitting to me he had even purposefully excused himself earlier in the meal to remind the staff that it was my birthday. This just made us feel like they didn't really take our table into much consideration.\n\nUltimately, it's worthwhile to experience the River Cafe at least once. Too bad the service was underwhelming compared to the food and ambiance. 3.5 stars.", "author": "Helen H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-20", "description": "All I can say is WOW! This is an above average, expensive breakfast cafe, but so worth the price! Located on the water with the NYC skyline across the river, it's a great view. The food is so fresh and absolutely to die for! Excellent service with a knowledgeable staff; I would def go back sometime soon!", "author": "Tiffany T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-01", "description": "Amazing - although we came on a cloudy day, the food was amazing \n\n-the beef tartare is amazing !\n-my husband loved the pear salad\n-the Branzino was amazing and so interesting\n-the steak was huge and perfectly cooked.\n-dessert was great especially the Brooklyn bridge", "author": "Melissa P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-26", "description": "I have mixed reviews about this place... The ambience is amazing the views are amazing it has views of the water right under the Brooklyn Bridge. This place is extremely fine dining. The staff was very into their job but so serious I almost felt like I couldn't talk to them because no one was smiling. The food was tasty but the portions are extremely small. Also I'm not really that into prefixed menu's and that is the only option here so if you don't like what's on the menu don't go they don't have many other alternatives for you. Overall it's a nice place with a beautiful view and a hefty price tag", "author": "Angela M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-12", "description": "One of the finest dining experiences in the city, NY that is.  Historic, celebrity chef, white glove service, unique dishes, rare and expensive ingredients, stunning sunset views, possible famous people sightings, and it's in a damn cool part of Brooklyn!", "author": "Brian K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-08", "description": "Great service and food. It might be competitive to get the best view, but overall it was a great deal.\nThey did a small surprise for our birthday celebration as well.", "author": "Iris G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-18", "description": "The River Café is officially the most romantic spot in all of New York.\n\nYou are first greeted by tons of lush greenery strung with the brightest fairy lights. You are greeted by the most polite hosts and you are whisked away into the restaurant literally on top of the river, with the most jaw dropping view of Manhattan!\n\nI came here for a celebration with my hubs, and his co-workers and had the best time! The service was impeccable and the food was divine. They only offer a dinner prix fixe, but had plenty of options! I had the special of the day - a truffle raviolo topped with mushrooms. SO delicious! I went with the lobster for my main course, which came with divine squid ink cavetelli. I finished off my meal with the most amazingly soft pumpkin soufflé! Food here is top quality and well worth the price :) \n\nHighly recommend The River Café for a romantic night out! Love this spot!", "author": "Valerie C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-03-09", "description": "My 10 yr old daughter and I were wondering around our neighborhood this lovely Saturday and thought about maybe having a nice lunch. We walked up to the River Cafe and opened the door but one step in The Maitre D walked over and asked if he could help in an undermining tone. I said we are considering having lunch can we see the menu. He said the menu is online and you must make a reservation! Uhm the restaurant was almost completely empty at 12:50pm! So rude and unaccomodating we said okay and left. We walked over to The Osprey at the 1 Hotel and were so flustered we told the host at the front what had just happened. He was upset for us so he showed us to a table right away and he brought us an extra entree -their famous chicken and waffles - free of charge! We had a lovely time at The Osprey and will definitely return. To The River Cafe we will NEVER Return and we will tell others our story.", "author": "carla t."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-05", "description": "If there is anyone who is looking for the perfect romantic night I would suggest coming to here. Be prepared to shell out some cash but totally worth it if you are celebrating a birthday, anniversary or special holiday. I came before they were closed for Sandy repairs and after they re-opened and they have maintained the same beautiful interior and exterior. The service is by far wonderful as they treat all guests kindly and promptly. The food is always delish and so are the drinks. I have always done the prefix menu and would recommend if you are looking to try some their staples.", "author": "Veda D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-02", "description": "Amazing place. We came here for my boyfriend's birthday and we loved it. The food was so good and each had its unique taste.", "author": "Anna A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-25", "description": "Such a beautiful place! Everything was great from the food to the service! Definitely give it a try, you won't regret it!", "author": "Linda R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-14", "description": "The quintessential New York dining experience. Extremely attentive service from start to finish. The sommelier, James know his stuff and made terrific wine recommendations. Ricky, our waiter was warm, seasoned, and extremely knowledgeable. The food is amazingly delicious and the presentation is beautiful. The setting is out of a movie, from the lovely garden to the inviting entrance, to the gorgeous flowers on each table. The restaurant offers stunning Manhattan views from every table, located just under the Brooklyn bridge. Bump this restaurant to the top of your list!", "author": "Brenda L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-22", "description": "My favorite restaurant!!! The perfect and most romantic restaurant to share an intimate dinner for a special occasion or date night. You cannot help but to feel happy and in love in this ambiance!\n\nEach table has a fresh bouquet of beautiful flowers and an amazing view of the manhattan skyline and bridge. While enjoying fabulous wine, fresh drinks and amazing food, there is also a live piano player to add to the amazing ambiance. The gardens outside of the restaurant are also beautiful filled with lights and flowers right under the bridge. \n\nThe service is amazing and very attentive, making you feel special all night long. They even bring you a stool for your purse to sit on! The food is always delicious. My favorite has always been the three shells appetizer. The oysters with the champagne mignonette burst of flavor in your mouth. I also love the branzino and sea bass ! There is truly not a bad dish at the river cafe. At the end of the night there is taxi or a car service available making it easy to get to and from this special special place. I cannot say enough good things about the classic river cafe!", "author": "Callie L."}], "servesCuisine": "American (New)", "priceRange": "Above $61", "name": "The River Café", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Water St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/C_8aEbAvcCLhiqXn9QdWSw/ls.jpg", "@type": "Restaurant", "telephone": "+17185225200"}