{"aggregateRating": {"reviewCount": 1049, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-09", "description": "Highlights:\nGorgeous view (but you probably already know that)\nImpeccable service\n\nThe food here was good, but nothing extraordinary. Ordered the tuna - foie, black snapper (they ran out of the sea bass), and apple \"crisp\" for dessert. The tuna was the highlight of the meal. The snapper was nothing extraordinary, and the apple \"crisp\" was alright.\n\nOverall, come here for special occasions for the view and ambiance. Service here is exceptional and they truly make you feel special.  \n\nNOTE: If forget to wear a formal jacket, they provide one for you", "author": "Jeanna S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-27", "description": "Had the most memorable birthday dinner here with BF on Friday night.. I loved the entrance with romantic garden lights. The view was breathtaking and the food was the most delicious-I had Sea Scallop and Foie Gras for appetizer, Lamb for entree and Chocolate Brooklyn Bridge for dessert. BF had Octopus for appetizer, Duck breast for entree and Apple Almond Pave for dessert.. It was the most perfect night!", "author": "Stella Y."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-06-15", "description": "I'm confused how everyone is giving great reviews, this place is not worth it at all. In fact this place ruined my birthday!!\n\nCame early to get a good sit. I was the second guest to arrive, asked if we can sit next to the window since i came mainly for the view. They offered me and my partner a table either next to the kitchen door or next to the wall. which didn't make any sense, i knew you can't reserve sitting so all the empty window sitting were available. \n\nThe whole time trying to get their attention was ridiculous!! the the caption would just keep ignore us to the point we almost wanted to leave. The food was seriously not worth the price, such small portions. \n\nNever again!", "author": "Kamrun N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-22", "description": "Proposed to my gf here on her b-day.\n\nFood-wise: lamb was better than steak. Foie gras was bad (not sure it's just supposed to taste bad). Everything else was great.\n\nService: i made a reservation 6 or 8 weeks in advance and wrote to them i'm proposing to my gf in the reservation note on opentable and tried to ask them for a good seat (near the river, windows seat) when i visited the restaurant a week before our reservation. But they declined saying windows seats are only for the loyal customers... Kind of disappointing that they do not honor people who make such an advance reservation...\n\nBut the overall atmosphere is amazing with the pianist actually playing the instrument and it feels good to be there.\n\nTips: order a half bottle of wine than a glass since it's likely you're there to celebrate something and you would want more than a glass. Their glass portion felt small. It's cheaper to get a half bottle.\n\nAlso, most guys were wearing shirt and jackets while no ties. I wore my tie and suit and felt over-dressed since not too many were wearing actual suits.\n\n It was my first time having dinner at michelin star restaurant and it does feel good to go out to a nice restaurant like river cafe and feel like you've made some achievements in life.", "author": "Jay K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-06", "description": "Perfection...\nA magical evening! Loved the entrance through the lovely garden, the smell of fresh flowers upon entering the restaurant and at each table, piano music, beautiful view of New York skyline \u0026 Brooklyn Bridge, superb service, the gorgeous presentation and excellent wait staff.  A birthday dinner with family to be cherished!", "author": "Kathryn K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-17", "description": "How romantic...(and expensive!). My bf took me to The River Cafe for our birthdays and it was super nice.  It was such an amazing surprise to be taken there. A little tricky to find, but well worth the drive around the block several times! It's magical with the lights and garden and flowers. When you enter you are greeted by lovely ladies and enter to what seems to feel like a boat. The views are so pretty - right next to the BK bridge. The cost is prix fixe per person of $129 without drinks. It's pretty expensive for a 3-course meal. We had the tuna tartare and shrimp appetizers. For main, we had the lobster dish and branzino. Both very good, but I would go with the lobster this for sure! And for dessert, the BK bridge and pistachio dessert. YUMMY - esp the pistachio one. All-in-all, it's worth visiting at least once for a special occasion, but be ready to spend at least $300 (without drinks)! *Guys - must wear jackets to go into the restaurant!*", "author": "G V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-30", "description": "Excellent service and food is delicious. Beautiful view of the city and brooklyn bridge . Great for special occasions.", "author": "Gabriel C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-22", "description": "The River Cafè was the best meal of my entire life. There were moments of pure deliciousness where I could do nothing more than close my eyes and just savor the complex artwork that was on my plate. After a whole week in New York, I can say with complete confidence that this was not only the best meal we had, but also the highlight of our entire trip. The atmosphere and the city view from the Hudson River are unparalleled. Since it was a fixed menu, we went all out with our choices. I had the Pear salad for my appetizer, the Organic Amish Chicken for my meal, and the pumpkin soufflé with cream cheese ice cream for dessert. Additionally, the chef generously provided us with a taste of polenta and duck sample before our meal as well as 4 chocolates that accompanied our dessert. All around it was Absolutely fantastic.", "author": "Grace B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-12-22", "description": "I had high hopes for this one due to all the glowing reviews but walked away disappointed. The food was solid but not memorable and the service was lacking.\n\nWe came here for our anniversary to try their tasting menu, spent in excess of $450, and felt we were ignored during our ~3+ hour dinner. It was exceedingly hard to get the staff's attention. I felt like I was in high school again with my constant hand raising trying to get someone to fill my water, request more scotch, or ask a question, among other complaints. \n\nThe duration between courses was also unpalatable to me. I do not eat fast but somehow we waited more 20 minutes at times to get our next meal. When I asked a waitstaff regarding when our dessert is coming, he replied with, \"I'm sure it's coming\" in an irritated tone and walked away. That was one thing that stuck out in my mind. \n\nI wasn't expecting this to be Jean George but did believe this highly rated establishment would be close behind - both in terms of food and service. It disappointed me in each respect.", "author": "Yu Hang L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-22", "description": "This restaurant never fails. Great date spot, great view, really good food. The staff is very attentive. I will say it's kind of pricey but you get what you pay for. Enjoy fellow yelpers", "author": "Greg A."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-06-16", "description": "I've got to say I am utterly baffled at the service we received here. Let me start of by saying we were on vacation in New York from California. We choose this place to celebrate my friends work anniversary. Everything was going well. The bill was given to us and our little experience came up to almost $800. Anyways my friend and I both put our cards down and the waiter took the bill. Shortly, he came to let me know my card didn't go through. That was odd to me because I knew I had money on my account so I even checked my online account to make sure and asked the waiter to run it again. The second time he came back his demeanor had changed, he was upset. I would have excpected him to say something like \"I'm sorry mam but there appears to be something wrong with your card\". He instead said in Spanish \"Aqui hay mucho problema\" meaning \"There are a lot of problems here\" and he roughly placed the bill on the table. I was embarrased not only because of the situation but at his loud tone of voice considering there were other tables around us with guests. I continued to apologize for the inconvenience. Later it clicked to me that I forgot to tell my bank about the trip and after the large  transaction outside of California my card probably got flagged. By this time at 11 pm it was impossible to call my Orange County based credit union to let the transaction go through. So we decided pay by using some cash and the rest on my friends card.To our surprise and great embarrassment  the card didnt go through either because it was flagged. By this time the waiter was mad and so was the waiter's manager (or who knows who he was, he was going around collecting the tips from each table). We continued to apologize for the inconvenience and asked where was the closest ATM so could take out money in smaller amounts.\n\nSo get this it went from everybody saluting you and opening the door for you and making way for you to none of that what so ever! I'm serious when I say this. When started our journey to the ATM that was located outside the retaurant, we passed by many waiters and the host and the manager and none of them reflected the same attitude they did when we first arrived and the 2 times we stood up to use the restroom. Not that it was important for me to get the door opened and get a smile from the personnel but it all seemed weird because of the sudden change. Why did everything change? For whatever reason it was, we were in awe at this revolutionary change. Long story short we knew we were obviously paying the full amount of the bill so that was never something we were worried about because we had the money but for some reason they didn't think so. Hence, their abrupt change in behavior.\n\nThe reason I gave it 2 stars instead of 1 is because I can't complain about the food it was good, a little overpriced, but overall good. The desserts not so much.\n\nI will definitely be back in New York but not to this place. I'd rather give my hard worked money to some other expensive restaurant.", "author": "Ve K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-06-14", "description": "Horrible service.. if you are Asian they treat you like second class citizens.. first they did not honor hsbc premier for lunch.. even though hsbc aside clearly for any dining experience.. we got shafted with service.. I was done with food.. waited 20 minutes to get my food taken away ridiculous... everyone was offered bread except us... I had to ask for the menu after sitting for 20 minutes... there definitely a discrepancy in service at this restaurant... even the captain and bus boys are stuck up....\n\nFood was overrated... lobster.. Luke lobster is so much better.. foie gra alright.. but duck was good\n\nBut honestly I wouldn't waste my time at a restaurant that does not treat everyone equally.. very disappointed", "author": "Jennifer G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-17", "description": "Most amazing meal I've ever had. Literally hands down the best!! I had the Shrimp Oscar for appetizer and the lobster for entree. Both were absolutely phenomenal. Service was great, atmosphere and view were amazing as well. Highly recommend for any occasion.", "author": "Abby L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-28", "description": "Went here recently with the family for an Xmas day dinner. The view of lower Manhattan is breathtaking and the atmosphere of the dining rooms is elegant without being too \"white table cloth\". The service was good without being pretentious or too stiff. The food was great but if you are going to be paying the extreme prices of this place you are probably better off trading the views for a better meal at a place like Le Bernardin, Per Se, or other multi michelin star restaurants in the city. But if amazing views are your thing this is absolutely a good place to get a memorable meal.", "author": "Ken M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-05", "description": "People come for the view, and as someone that works in the event industry (weddings, concerts, etc) I've been to a lot of river front places and no one keeps their windows as clean as The River Cafe. Food was excellent, dinning room is a tad dated, servers military-style of attentiveness was amusing to observe, and the outside garden is gorgeous. Came here with the love of my life for dinner and look forward to another anniversary date at The River Cafe.", "author": "Matthew C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-04-23", "description": "Booked for Valentine's Day. Spent over $500 for two people. For that money there are plenty of other restaurants that have better food,better environment and similar service. \n\nNot sure what the fuss is about.", "author": "Ad P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-10-14", "description": "Beautiful place. Saw the awesome lunch menu on the official website and made reso for 11AM, arrived then found out they only serve breakfast and dinner on weekdays. I wonder why there's a lunch menu on the website then because there's a brunch menu too and that's what being served on the weekends. Obviously I was quite disappointed with the false advertising as I was so looking forward to my sea scallops and foie gras listed on their lunch menu. Service is top notch here.. Servers are super polite. If only I could get my sea scallops and foie gras. Anyways, I had the omelette... To be honest the omelette was quite standard, the salad was good though.. Unfortunately, will not come back.", "author": "Cathy C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-02", "description": "This is one of my favorite restaurants in the New York area. It provides classic old world service, which is a dying art, along with fine cuisine and one of the best restaurant views available. I've been there for brunch and lunch multiple times. A lot of items on the brunch or lunch menu are the same items available for dinner, except the prices are much more reasonable. 2 courses for less than $60 is a great value given the view and the caliber of the food. I love the duck breast and the lobster for entree. But I've yet to find an appetizer that's truly memorable. Whether you are a local or a tourist, this is a restaurant you should try at least once.", "author": "Stephanie L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-11-02", "description": "This is  my review. My wife and I have been  patrons  of the river cafe for 20 years .We did a  lot  of traveling  around  the world  and we considered  this the best restaurant  we ever eaten  at . But after Sandy the restaurant  was destroyed  and built back .But the staff before are no longer there.The staff there now are the worst very none caring.  Now it's noting but a high price tourist  trap, The dishes  were poorly  presented  and had nothing  to remember  them for, 0 flavor  my romantic  spot is gone. P.s the only thing  that still great  is the Brooklyn Bridge  desert .NEVER TO RETURN !!!!", "author": "Michael M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-13", "description": "Hands down the best restaurant when it comes to ambience, service, food, and location. I took my wife here for her birthday and she was just in shock of how beautiful and well organized this place is. Pretty pricey but I must say it's worth every penny. I have gone to places and spent 1/10 of the money I spent here and I have felt robbed but as for the river cafe they are in a class of their own.", "author": "Thomas G."}], "servesCuisine": "American (New)", "priceRange": "Above $61", "name": "The River Café", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Water St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/C_8aEbAvcCLhiqXn9QdWSw/ls.jpg", "@type": "Restaurant", "telephone": "+17185225200"}