{"aggregateRating": {"reviewCount": 1049, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-18", "description": "On the water. Best views of the city. Expensive but good food. Go there for a special occasion!", "author": "Rabia L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-01-04", "description": "Old school. Formal. Elegant. Not too snobby. Amazing view. \n\nWe went for lunch so while it was pricey it was amazing. \n\nBeet salad=heaven.\nGoat cheese and potato terrine=amazing.\nBRanzino= like the best grilled cheese and yummy buttery delishness available\nDuck= looked good. The bf said amazing\nBBridge dessrt= really yummy\nbellinis- a must\nan Oregon Cab= amazing\n\nBest date ever.\n\nWas romantic, understated, wonderful service. Divine. Really a must go.", "author": "J T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-03-30", "description": "I'll admit. It pisses me off to go to a nice restaurant, and I raid my closet for something NICE to wear and when I get there, the guy next to me wears khaki shorts. *I* want to wear khaki shorts. \n\nANYWAY.\n\nThe view was beautiful for a lunch date. I'm pretty sure it would be more gorgeous for dinner. It was brooklyn restaurant week and we got the fixed price. The food was so-so for the price you were paying for. \n\nDont get me wrong. It was good food but not life changing. I guess the reason why people go here was for the view, ambiance and service. So this is a lesson learned: if you want food worth your money, go to grimaldi's. if you want ambiance worth your money, go here.\n\nBTW, they get extra points for giving WARM bread rolls. My friend loved them so much she had 3.", "author": "Candice A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-05-19", "description": "I gather that the River Cafe is a New York institution - it was pointed out on our boat trip. From the water, it doesn't look like much but from the proper entrance, you can understand why.\n\nThe River Cafe sits in the shadow of Brooklyn Bridge with the most amazing view of the skyscrapers of lower Manhattan across the east river. It has huge windows looking out over that view and every table in the restaurant can enjoy that view. It looks especially wonderful at sunset and at night when the lights come on.\n\nThe food is definitely fine dining in the evening and the quality of cooking matches its vaunted location. I enjoyed exemplary sauteed foie gras and prime aged sirloin steak. For dessert, I couldn't resist the kitsch chocolate Brooklyn Bridge!\n\nDefinitely a destination restaurant and at the risk of making it a cliche, an ideal place to propose.", "author": "Yee Gan O."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-25", "description": "For those of you wondering where to take your hunnies or handsome hunks this Valentines day...River Cafe should be on your shortlist. It has romance written all over it - from the beautifully lit promenade to the small cabin like interior with sweeping views of the Manhattan skyline and Brooklyn Bridge.\n\n\n This is a day not to forget your wallet with a fixed price menu that may leave you out of pocket for a few days. So save it for someone special. The food is adequate with a not so great choice for veggie diners but the atmosphere more than makes up for it.\n\n\n Make the most of the River Cafe's location by going for a stroll to the viewing area beside the restaurant. If she doesn't swoon over you after this date you have serious issues to deal with.", "author": "Kudge"}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-01-28", "description": "2 people for brunch\nto use a C-note gift card.\nstill wasn't enough", "author": "Will Z."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-12", "description": "This is a rather pleasant restaurant where you can dine while enjoying panoramic views of  Lower Manhattan from Brooklyn.  The service is courteous and the food tasty, fresh, and well prepared. The place is done in good taste and it is not unpleasant on the eyes; the clientele exudes the air of comfort.  This is a good place to attend before or after  a performance at Bargemusic.  We have been to this restaurant a few times and were pleasantly surprised every time. When making reservation make sure to request a seat by one of  the windows facing Manhattan.  They have a decent wine list.", "author": "Pritio M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-10-10", "description": "worst experience ever. very overpriced and they made you wear their stupid suit jacket!", "author": "Karim K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-02-04", "description": "Went here for our anniversary and got the tasting menu. Worth every penny. Every dish was perfect. Usually I'm not the biggest fan of wine pairings and find them disappointing but at River Cafe they hand select each wine based on your taste preference and the among of money you are willing to spend... Perfect... Complemented and enhanced each dish. Highlights: foie gras was superb.. All 3 versions. Pitched lobster perfectly done. BK bridge dessert tasty and cute. Service is top notch. The view is beautiful. We arrived early to have a drink at the bar and watch the sun. Highly recommended.", "author": "Miranda W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-07-20", "description": "Ok, my experience here wasn't the standard evening dinner deal.\n\nMy close friend had her wedding here \u0026 I have to say that the ambience was excellent (very romantic - my hair dresser told me he proposed to his wife there) views were excellent and the food that I had was delicious.\n\nApps that I was able to try were seared tuna on a bed of crunchy something in a vinegarette (is that how you spell that word?), seared duck breast w/a touch of hoisin (sp?) glaze, fried oysters on top of mashed potatoes w/a sprinkling of cavair (disclaimer, I don't really care much for oysters, but these were daxx good!) and pigs in a blanket (my all time fav)  - but w/a twist-- the 'blanket' part was a cheese biscuit type blanket - who would've thunk you could improve on a pigs in a blanket?!  \n\nAll the apps were excellent...I wanted more...but then they asked us to be seated because dinner was ready to be served.  (Basically, I'm just greedy.)\n\nFor our starter it was a bib lettuce salad with a shallot vinegarette and black truffle cheese and brioche croutons - fresh ingredients and a nice blending of flavors. (yeah, the ingredients are as yummy as they sound!)\n\nBlack cod on a bed of fried rice and the sauce escapes me, I want to say a squash, but I'm not 100% sure.  The cod was fresh and prepared well, the rice \u0026 sauce underneath were kinda forgettable but the presentation was lovely - the colors were v. pretty -- but the flavors were great, which is the imp thing.\n\nSeared veal medallions with a red wine reduction, carrrots and green beans and a parmesagn risotto cake - the veal was so tender!  Again, a dish where the main protein was cooked perfectly, the accompaniements were good, but not mind numbingly so.\n\nThe simple fact that I can recount the dishes down to a 'red wine reduction,' level means they were pretty darn good.  How many weddings have you gone to that you're like, 'um, I think I had filet mignon, or no, was it salmon?'\n\nDessert was a mango sorbet on top of some buttery cookie thing (the mango was mixed with basil or cilantro) wasn't my favorite but I did polish off the shortbread like cookie underneath - I'm a fan of butter...what can I say?\n\nI was amazed that the dishes were served hot, promptly - the service was excellent, staff working were very polite and friendly -- I can only imagine how well the dining room is run.\n\nAnd the bar has a great view, the bartendar is personable, easy to talk to and he let me sample a long grass vodka? which was light and refreshing (and free) which was cool.  (I got there a little early b/c I didn't want to make the mistake of showing up late for the ceremony, NOT b/c I'm a booze hound, well, at least not before the ceremony happens, that is.)\n\nBasically, worth it to fly in for the weekend before I head back to the UK and subject myself to the land of limited food.  \n\nI wanna go back and have a regular dining experience, the restaurant has amazing views of Manhattan and we had the terrace to ourselves!\n\nIf you're in NY - try to remember how good you got it!", "author": "K P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-06", "description": "My bf took me here on our recent anniversary and it was something really special. The river cafe really knows how to treat you well and your tummy well. I've always heard of this place, the restaurant with the amazing view and pricey menu. That was really all I was expecting, however, it's so much more. The staff is so attentive and the restaurant is filled with delicate and intricate details. The atmosphere is special. The food was really good too. We got the tasting menu for 125. We had six courses that were decently sized. The menu we got included scallops, rock lobster tail, chilean sea bass, foie gras, lamb chops, and an assortment of desserts. The foie gras was the biggest piece of liver ive ever had! I was so excited to see it on my plate and it tasted deliciousssssss! The desserts were amazing too. We each had 3 different desserts on our plates with a dish of mini desserts to share!  We were both sooo stuffed at the end. Drinks are also reasonable. 12 for a glass of wine or scotch. We ended up spending 400 but It was worth every dollar for those special occasions. It also made us really full and happy!", "author": "Elizabeth N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-12", "description": "Such a fantastic dining expereince. To start the location is drop dead gorgeous and I love how the place it off the beaten path and a little difficult to find. The food there is nothing short of spectacular (the rabbit loin wrapped in pancetta was to die for). I would HIGHLY recommend this place to anyone looking for a romatic spot with insane views and even better food.", "author": "Tom P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-24", "description": "We rolled up to get out of the cold. They lent me a dinner jacket. We rolled raw tuna in foie gras. I no longer felt homeless.", "author": "Bob L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-03-21", "description": "we live in the neighborhood, on our way home last night we stopped into the river cafe for a nightcap on the patio. There was no mention of a $25 per person minimum by the 3 hostesses, the waiter, nor was it printed on the drinks menu. So we were pretty surprised to see it  added to the check. 4 people. 4 drinks. 100+. \n?\n\nthe patio and the service were fine. The blank response of the hostess when I brought up the surcharge was too much. greed over graciousness. Its okay to have a minimum, but its lame to not mention it to your guests. \n\nI love the River Cafe for dinner, its such a special pretty space. But in terms of hospitality it would help if they took a lesson from danny meyer on how to run a restaurant.", "author": "Maria G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-05-04", "description": "Let me start by saying I have never wrote a bad review about any resturant before however I felt this was necessary. I lived in Europe for most of my life and moved to NYC a couple of years ago. I've been to many fine restaurants, but have never seen such a rudeness as I found in the River cafe.\nThe maitre d' spoiled the evening for us entirely.His body language and tone towards us was demeaning!\nHe was really cocky and seemed to be under influence of drugs or alcohol! While our party was waiting at the bar area to be seated I observed, that he was extremely kind to Spanish speaking customers!?! \nOtherwise the food and the service were wonderful.\nWill NOT go back again!", "author": "Jacob G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-02-03", "description": "Was kind of bummed to hear that this lovely restaurant was damaged by the hurricane. The food is pretty good. Classic offerings that aren't necessarily innovative but delicious nevertheless. Cannot beat the location next to the river and the lovely view, although i would've loved to enjoy the view with a table against the windows. This restaurant seem to disappear into another world while being in easily reachable brooklyn. The most memorable thing i enjoy is their dessert, which  is unique and in the shape of the brooklyn bridge (who could beat that!!). Another word of advice, they do small area for drinks which you can enjoy during the day. It's a bit secluded in the middle of this touristy area and give you a refreshing break from all the crowds. It isn't cheap, I definitely feel like i paid a bit for the novelty of location. It isn't your new school brooklyn restaurant like the Governor, but this a traditional restaurant so it isn't what you're shooting for anyways. Overall, had a lovely time and quite an enjoyable overall experience.", "author": "Martin L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-02-16", "description": "River Café was a great choice for a romantic dinner on Valentine's Day.  We were seated on time, the service was excellent from start to finish, food was great, and the view of the city \u0026 Brooklyn bridge... awesome.  The tiny box of mini cookies and the gift bag of flowers for the ladies was an unexpected surprise.  Thank you for the memorable night!", "author": "Jimmy C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-04-11", "description": "Best date place on the planet, especially if you want to pop the big question! Do it!!!", "author": "Nelson M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-16", "description": "The drinks, food and views are all amazing. This place is worth every cent!!  I felt like a princess every time :) Just beautiful.", "author": "Emily C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2006-05-20", "description": "Elegance times 10. Great way to impress out of towners (especially those rich relatives who wanted to take you to a nice dinner). Service is white gloved, top of the line, attentive without being pushy.  Well prepared cocktails, excellent wine list, food is expertly and loving prepared and presented.  And the view....well...its New York City at the tip of your fingers.  What more could you ask for (well...maybe a few more rich relatives....if anyone has some they could lone me i'd appreciate it). \n\nOr you could do what my friends and I do and wait for Restaurant week when they offer a 3 course lunch for around $20. Now thats a good deal!!!", "author": "Maryanne N."}], "servesCuisine": "American (New)", "priceRange": "Above $61", "name": "The River Café", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Water St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/C_8aEbAvcCLhiqXn9QdWSw/ls.jpg", "@type": "Restaurant", "telephone": "+17185225200"}