{"aggregateRating": {"reviewCount": 1049, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-03-24", "description": "Two stars because the prices dictate a higher standard.\n\nWe were well met and brought into the restaurant.  It's sort of a double entry which is interesting and embracing.  The host was a little put-offish finding our reservation. Felt like we were gypsies trying to take over the palace for a moment.\n\nStunning view of Manhattan.\n\nWaited for the rest of our party.  Bar was friendly, efficient.  Drinks and billing followed us to our table in seamless fashion.\n\nOrdered bubbly.  Som brought it out then suggested we wait until we finished cocktails before serving.  Put on ice.  About 10 minutes later the waiter served.  It was warm dagnabbit!.  Waiter offered no recompense until I had to take him aside and inform him he was buying a round while the sparkling wine chilled.  Reluctant compliance.  This really screwed up the flow of the experience and it took a while to recover.\n\nFoie gras was only ok.  Three shells was good.  Octopus and shrimp were good.  Turned out the appetizers were better than the entres.\n\nDuck breast was a little tough, dry and the skin lacked crunch.  Monk fish, sea bass and branzini also a little dry.  In general the entres lacked pizzazz.\n\nGood cheese selection and plentiful.  Brooklyn bridge was fun.\n\nThe evening ended on two down notes.  \n1) They picked up the check and reviewed it before we left.  This is pet peeve of mine.  Always makes me feel like I'm being judged.  \n2) They use a car service instead of local cabs.  Simple extortion.  Way overpriced.\n\nThe screw up with the bubbly set a bad tone admittedly.  But they fell on their face with a lack of recovery.  And the two flaws at the end indicate the level of service is uneven and inconsistent.", "author": "Ron S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-13", "description": "Came here for my birthday brunch. Started with zucchini bread which was cold and served with cold butter. The bread had a good flavor.\n\nStarted with the Amuse bouche which was banana flan with granola on top. The flan was creamy and topped with milk and the granola was crunchy. It came in an empty eggshell, which was a nice way to serve it.\n\nThe crab and coconut bisque was creamy and the crab was not overcooked. The coconut flavor along with the basil and lemongrass made it a very good soup. The wagyu steak tartar was fantastic. The toast was perfect, and the meat tasted like it was cooked. Cornichons, chives, mustard, and capers were added along with a raw quail egg to make the tartar. The foie gras was served two ways and both ways were cold. It had a good flavor but was not as rich or as good as the top foie gras I have eaten.\n\nThe lobster special came with a claw and a tail served over cheese grits (which had a nice spice). The lobster was fresh and cooked perfectly and came with fried taro strips on top. The sirloin was cooked in between medium and medium rare (it was ordered medium rare) and had a nice flavor to meat with good marbling. The Bernaise sauce was very nice on the meat. The duck steak and egg was cooked nicely, and came with a breast, sausage and egg on a puff pastry. It was a great dish.\n\nService was impeccable. Brunch was great and I would like to try dinner here sometime soon.", "author": "Tony T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-03-07", "description": "Probably the nicest restaurant I have ever been to. \n\nBesides the amazing view of the Brooklyn Bridge and NYC, the decor and surrounding gardens of the restaurant were stunning. I was able to go while with my stepmother on a business trip, so the very expensive bill was paid for on company dime. Nonetheless, I would definitely go back and be willing to spend my own money for the experience, excellent food and outstanding service. \n\nWe had what seemed to be a 7 course dinner with wine pairings and everything I ate was impeccable. For dessert, we had a chocolate masterpiece that was sculpted into the shape of the Brooklyn Bridge and it was a great finale to a very memorable dining experience.\n\nThis place has always stood out in my mind as one of the first fine dining experiences I ever had and one of the best.", "author": "Annie G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-07", "description": "Recently my wife and I had dinner here. The food was exceptional, the service even better. The only reason I cannot give this restaurant 5 stars is that the bread that was served in the beginning of the meal was cold and hard. The same could be said of the rock solid butter that came with it. For such a wonderful restaurant to not perceive the flaw in this simple and yet easily fixable issue does not make sense... Otherwise, I recommend this restaurant.", "author": "Tom R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-03", "description": "Cab fare cost us about $30 each way from Times Square to Brooklyn and back, but it was worth every cent to dine here. It's got a great view as you're dining right under the bridge as well as romantic. \nThere was a small wedding party the evening we dined there, the bride looked gorgeous in her beautiful white dress.  \nService was attentive and nice and the food was very good.\nHubby had a Manhattan, $16, pretty strong stuff.\nThe prix fixe menu 3 courses is $100 and 6 courses is $125.\nHubby had: terrine foie gras (very good), Lamb - large chops and the Brooklyn Bridge choc dessert which was really cute.  A thin cutout of a bridge topped the dessert.\nI tried the foie tuna - a raw tuna roll with a strip of foie gras in the center, which was also good.  My duck was delicious and I also enjoyed my souffle dessert.  We were quite full from just the 3 courses.  Definitely a special occasion place.", "author": "Ry T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-24", "description": "All-time favorite foie gras dish here! Such an incredible atmosphere and excellent service. The floral arrangements and view are bar-none. So many fine dining experiences in New York feel tired or that they are trying to hard, but River Cafe is on point. The sommelier was lovely, and I cannot wait to return for the lobster. Pro tip: come during the holidays!", "author": "Stephanie S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-01", "description": "Definitely worth the huge bill in the end.\n\nIt's romantic, quiet, not very stuffy. I was expecting it to be very uppity but it wasn't that bad. The tasting menu was a delight! The champagne was great. The service was attentive. The place is full of couples on dates and you're most likely going to be sitting next to a couple celebrating an anniversary but don't let this keep you away. \nGo with a friend, go with a lover, go by yourself! It's worth trying.\nI wish  i sat near the grand window that displayed the Brooklyn bridge but i had a great view from my seat near the back booth. I believe every seat has a good view since the windows are so large. \n\nAs for dress code, i went out and bought a dress for this place. And when i walked in there were women dressed up nicely but there also were women in slacks with nice a top. and even a guy wore jeans dressed up with suit jacket. Their website says they have a strict dress code but i really don't know how strict they really are. \n\nAnyway, have the tasting menu as it is great! and you'll receive about 6 little desserts in the end worth trying. and yes the Brooklyn Bridge cake desert was great! \n\nGO!", "author": "K H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-16", "description": "Holy wow!! Everything about our experience from the minute we pulled up to the front door was impeccable. The service is over the top attentive and courteous. They're clearly all highly trained and the standard with which they hold themselves, is abundantly apparent. You pay for this experience, but it is so worth it for special evenings! They had a gluten free bread for myself and all the desserts are gluten free which is not a big deal for everyone, but got me super excited! I had the duck and it is officially one of my favorite dishes in the city. I believe it was a manager who spoke to us about wine and got each of us really nice glasses of wine that fit our very different tastes. We had to rush to see a show unfortunately and the same manager rushed to run our cars and help us get out which is not always possible in restaurants, but much appreciated and it always makes you feel like the staff truly care about their guests. Such a beautiful location and venue, which goes without saying I suppose. We will absolutely be back again.", "author": "Leigh ann H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-05-31", "description": "The uptight managers were the reason I gave this beautiful restaurant with amazing food a 2. I witnessed one yelling at a bus boy(man) 2 different times. Reason enough to never return. \nAnd the restaurant also won't give u a price on the food your ordering- so it's just one BIG surprise when the bill comes. Seriously. If you can't list the price of your food on a menu...? We got our check and immediately felt BENT OVER! Thx a lot River Cafe!", "author": "Vssj S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-11", "description": "If you are visiting Brooklyn and want a classic Brooklyn place...Look no further.  Excellent spot right under the BK bridge.  You cannot beat the food, location, or service.", "author": "Thomas L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-07-07", "description": "Underwhelmed. This place is seriously only good for its view, which is lovely. The staff is subpar, food was average if not below average. I'm not sure what the hype is about. Having dined at Daniel, per se, and the likes, this is not anywhere close to that league of dining. Total pass.", "author": "Nih H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-10-02", "description": "Wow. What a beautiful place with the food to go along with it. \n\nThe River Cafe is an experience, more than just a restaurant. While driving up to the restaurant you will go through a gate into a lit, beautifully manicured garden. Once inside, you will be greeted with a beautiful floral arrangement. Smells amazing. Then, the view. I cannot describe the view. It's one of a kind. Just a stunning setting. The food was great. I would trust your waiter with his/her recommendations. The River Cafe is the ideal date night (make sure they are worth it :)), or the ideal place for a special occasion. You will not forget your experience. Also, the price is not bad at all, relatively speaking. For $100 the dinner experience is well worth it. Many inferior restaurants cost more. And come on, I know a lot of you have dropped over a bill bar hopping and not remembering your night. Doesn't get more romantic than this. Til I see you again River Cafe.", "author": "Malvika S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-18", "description": "I could come here just for the view besides the fact that the food is great. It's probably one of the best places to come celebrate a special occasion or an anniversary because of the atmosphere but I like to stop by during the day in the summer for casual drinks and sit outside at the terrace to enjoy the view and the vibe of Dumbo and Brooklyn Heights.\nI hope they will rebuild the place after Sandy by this summer...", "author": "Daria G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-30", "description": "As an old-school Brooklynite, the River Cafe has always held a romantic place in my heart. I recently dined there for the first time, after it reopened from Sandy damage. It was almost precisely as I expected. All of the table were oriented towards the views, the food was high-end, although not very daring, and it was a great location and setting for a romantic evening. The price is not as good a value as other high-end restaurants I have been to, but they also do not have this location.", "author": "Michael B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-04-24", "description": "Let's start off with the good. It's a magnificent restaurant with a location and views to die for. The service is outstanding and the presentation is top notch and beautiful. So far so good. The food was the real disappointment and for a restaurant this is (sadly) a deal breaker. We went for Sunday brunch. I ordered the steak tartare and the quality was top notch. Sadly it had little taste and desperately needed more seasoning. My main course was the lobster and, again,  the food was bland and tasteless. Portions were rather small as well, a real disappointment for these kinds of prices. Finally my wife ordered the steak (a $7 upcharge) and it was just awful. Full of fat and gristle. Certainly not the kind of meat you'd expect a place like this to serve. Very, very disappointing. If you're looking for a place with beautiful views and impeccable service, then this is your place. If you're expecting a first class dining experience, I'd suggest you look elsewhere.", "author": "M D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-01-27", "description": "We went here for lunch for Winter Restaurant Week 2010.  I was very much looking forward to trying this Michelin rated restaurant and since the reviews are also raving, I felt even if it is the Restaurant Week menu, it should still be outstanding.   Well, unfortunately, River Cafe fell below  and expectations.\n\nAmbiance: Very nice!  The view is outstanding, no doubt and we were seated facing the lovely East River and the Manhattan skyline.  The actual restaurant was well decorated and modern.  In the summer, this would be great to dine in the garden area.\n\nService:  was decent and attentive.  One point of contention I do have is that once our desserts were brought out, the waiter just dropped them off without explaining to us what they were which is customary in a restaurant of this caliber. It was odd.  Other than that, I can't complain. \n\nNow for the nitty gritty: THE FOOD.  I started off with the Maine Sea Scallop and Lobster Chowder. This had lobster cream, poached scallops, Russet potato, leeks, fresh herbs and coral.  At least that's the description on the menu.  This was just not enough food..even for an appetizer. It about 1/3 of a SCALLOP..not \"scallops\" and a very tiny piece of lobster. The rest of the chowder contained about three little square sized nuggets of a potato and a couple of slivers of celery.  The rest of it was just the lobster cream.  Although it tasted nice, it left a lot to be desired. At this point, I was pretty hungry.\n\nFor the main course, I selected the Grilled Atlantic Swordfish.  This was served with scallion whipped potatoes.  This was actually a substantial piece of fish and although a bit on the salty side, it was well prepared and satisfying.  This selection made up for the appetizer. \n\nThe dessert course was a Tasting Dessert Trio with crème brûlée banana bread pudding, coconut sorbet, fresh roasted coconut\nmilk chocolate ganache and candied coco nibs.  This was actually the best course and the largest course as well. I am a big fan of the creme brûlée   and banana bread pudding. That was actually excellent and huge!  I couldn't finish the trio but all three were very nice.\n\nIn conclusion, I didn't think this was a bad meal and for the price, I suppose compared to what I would have normally paid to eat here, was definitely reasonable, but still I feel they fell short of my expectations.  I don't think I'll return based on this experience, especially since Grimaldi's is up the street!", "author": "Natasha U."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-08-02", "description": "The view and ambience are what you pay a lot of $$$ for! However if you want to be treated as the staff is doing you a favor for allowing you to be there, this is your place!!! You can bring your food or buy a bucket of beer for $22 next door with same view. This is not being cheap because I'm not but don't make your clients feel inferior especially since most make a lot more $$$ than you think!!! Pathetic, disrespectful and not \"USA like\".", "author": "Orlando I."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-07-13", "description": "Not the greatest culinary experience but lovely overall. Loved the fresh flower arrangements at the entrance which reminded me of a flower shop and the ones on the tables. Flowers on the patio and in the garden out back. The restaurant seems like it is on a permanently docked boat that rocks while you are dining. Kinda feels like an earthquake. Came here for lunch during restaurant week and loved the view of the east river and manhattan. Servers were excellent and dressed in cute white jackets with gold buttons and black bow ties. They were excellent. The waiter I only saw once when he took our order. Im hoping some of my tip go to the wonderful servers that did everything else.\n\nFoodwise- great presentation, fresh clean tastes but nothing extraordinary. Appetizer I ordered the Lobster miso soup consumme with shrimp dumplings (2). The dumplings came in a cute glass octogon bowl with lid and then the lobster consomme was poured in. The broth was flavorful and tasted of lobster, the shrimp dumpling was ok and the edamame was superfluous in my opinion. My bf got the lamb meatballs that came with little cracker hats. They were nothing spectacular. For the main course, we both got the grilled atlantic swordfish as I dont like duck and didnt want pasta. It was simply dressed and soft in texture. I enjoyed it but have had better fish. Dessert was a blue, red and white dessert with creme brulee, strawberry ice cream and a blueberry pastry. It was yummy. Overall I enjoyed the food but the atmosphere was what was impressive.", "author": "Brenda M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-04", "description": "AMAZING PLACE!!! A friend and I celebrated his birthday here and the whole experience was superb!  From the moment we pulled up to the valet I knew I was going to love this place! The trees and little lights hanging from them gave the outside a magical touch.  Not to mention your right under the Brooklyn Bridge! Once you enter, the arrangement of beautiful fresh flowers everywhere will capture your attention! We were greeted from the staff and after we check our coats we proceeded into the actual restaurant. As soon as you walk through those doors your hit with the most beautiful breath taking view of the Manhattan skyline! I would loveeeee to come here often just for that view!  We went to the bar while we waited for our table. The view in combination with the live piano playing gives this place a wonderful elegant atmosphere! We had a 10pm reservation (reservations are a must!) and we were seat maybe 10 minutes later.  Although we did not get a window table the view from where we were sitting was still great.  In actuality every table in the restaurant has a great view! \n\nThey had our cocktails sent over from the bar for us (cocktails are around $15 each) and brought out a complimentary dish to start off along with a bread roll.  The maitre d' was friendly and really nice as  were all the waiters.  They were attentive to us and everything came out in a timely fashion.  The price fixe menu is at $100 per person which includes appetizer, main course and dessert! The Maine rock lobster is to die for! and the Colorado rack of lamb is simply delicious! My friend had the chocolate Brooklyn bridge for dessert and it was brought out with a candle and a little chocolate sign that said happy birthday along with my dessert and two glasses of champagne (As I requested when I made the reservations) A glass of champagne runs around $20.  During dessert they also brought out a plate of mini complimentary sweets which I thought was a very nice touch!  After dessert was brought out whenever the waiters and maître d' passed by they all wished my friend a happy birthday which was nice also!\n\nVeryyyy IMPORTANT!!! Men must wear a jacket, it's a strictly enforced dress code, suit jacket, sports coat or blazer it doesn't really matter as long as it has a lapel!\nAll in all if you plan on having a dinner for two here expect to spend anywhere from $350-400 (including tax \u0026 tip)  It's a bit pricey but If you appreciate a place with a great view, great ambiance, excellent food and friendly service then this is definitely the place for you!  I would dine here every day if I could!", "author": "Natoya R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-04", "description": "Took forever to get a reservation (which is why they lose 1 star), but other than that, this place was amazing! The food was delicious, the service was perfect. Very pricey, but worth your money for the location/view/service/quality of food.", "author": "Maritza M."}], "servesCuisine": "American (New)", "priceRange": "Above $61", "name": "The River Café", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Water St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/C_8aEbAvcCLhiqXn9QdWSw/ls.jpg", "@type": "Restaurant", "telephone": "+17185225200"}