{"aggregateRating": {"reviewCount": 1049, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-09-06", "description": "Location, view and ambiance were great but the food was not worth the price. $14 for a glass of orange juice and $19 for a mimosa?! The food is bland and nothing spectacular. I enjoy fine dining but $200 for breakfast for 3 (1 child) is a bit much.  I would recommend this for a pre-drink in the bar to enjoy the view and hit up somewhere else for food.", "author": "Kristina M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-19", "description": "I am definitely coming back to bring my daughter for her birthday. The view is priceless and the food was amazing!!!\n\nThanks.", "author": "David D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-10", "description": "Great restaurant, excellent service, but beware of livery cab scam!\n\nOur party of six visited this restaurant in the evening to celebrate a friend's birthday. The best views of Manhattan are naturally from the tables by the windows.  The inner tables are still very nice, but their views are limited by the awnings and at night by the glare from the lights inside.\n\nThe food was very good, but not sufficiently outstanding that we would return solely for that part of the restaurant experience.   Because of the size of our party, we were able to try several of the appetizers and main courses. While everyone was very satisfied, none of us was blown away by the offerings.\nThe service was excellent and the waiter made sure we enjoyed our celebration. He was very professional, knowledgeable and attentive throughout the dinner.  We never felt rushed or that we were waiting for attention. The various stages of the meal, from drinks to appetizers to main course to dessert were all extremely well-timed.\n\nAs we were leaving the restaurant, we were approached by one of the parking attendants who asked us if we had transportation. We told him that we were going to request an Uber car (which was 4 minutes away), to which he replied that there was a taxi outside that was large enough to accommodate our group. After enjoying such a great evening, we were caught off guard and did not notice that he was not directing us to a taxi but, rather, a livery cab. The driver charged us $60 to travel a shorter distance (to Chinatown) than an Uber cab had charged us $23 when we travelled to the restaurant (from TriBeca) three hours earlier. Technically, it was our fault for not negotiating a price ahead of time - but to take advantage of our trust after a great dinner and to charge us more than 2.5 times the true value of the ride was not just bad style, but abusive. \n\nFive stars for the overall ambiance, five stars for the service, four stars for the food, but the classless livery cab scam detracted from our experience and reflects very poorly on this otherwise beautiful restaurant.", "author": "Mark M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-10-18", "description": "The night started off marvelous with the charming, striking view of the Brooklyn bridge and Manhattan - it was quite amazing. Upon arrival, the receptionist was  very sweet and we were seated promptly, but not at a window seat as I requested being that we celebrating my boyfriend'a birthday and they somehow made a mistake and moved around my reservation to 8pm not 830pm as I made months in advance. \n\nThe Maître d' was inviting and our waiter walked us through the three course menu option, but failed to tell us about the six course tasting menu which I felt a strand of disappointment as  it was my every intention to experience that option as I read such great reviews and I overheard him telling the table next to us what it consisted of. We actually had to stop a waiter in transit to his table to ask what the breakdown of the six course menu was.\n\nWe ordered the octopus and the shrimp for appetizers which I must they were both well put together. The pan seared octopus came with sliced potatoes and a fresh chimichurri sauce while being cooked to perfection. The shrimp was so succulent and was sided with crab meat which gave it an extra plus in my book. \n\nFor the entrées, we ordered the lamb and branzino which were both incredibly tasteful! The lamb had an amazing mint and mustard glaze. The branzino was crusted with shrimp and was absolutely delicious. Oh, and might I add that both plates were served with a beautiful presentation that were definitely picture worthy:). \n\nMaking way to desert, I ordered the milk chocolate soufflé which was topped with a toasted marshmallow and sided with melting vanilla ice cream. I honestly expected more from this desert as it was just simply just \"good\" in my book and I was expecting it to be \"great\" after reading all the wonderful reviews and my obsession with chocolate soufflés. My boyfriend ordered the apple crisp which consisted of caramelized apples, almonds, and a green apple sorbet. We found his desert to be tart and we weren't very fond it. \n\nAlthough the food was great for the most  part, the service was horrible in my opinion. From not being offered the six course menu to having to ask for bread in the beginning initiated the laundry list of complaints. We waited an awfully long time for our appetizers to come out and even more for our entrees and at that time the wait made us lose out appetite which we felt the dinner could have been a bit more appetizing if it was brought out in a timely fashion. When I made the reservation, I put down that it was a birthday and even doubled checked with the receptionist. The deserts were brought out with a candle on the one my boyfriend ordered and since we didn't have spoons on our table the two waiters walked around the whole restaurant and back into the kitchen until we had spoons; by time it was given to us our ice-creams were half way melting!!!! And, to talk about a surprise - my boyfriend knew automatically it was for him as they walked right in front of him with the exact deserts we ordered and a candle in one - and he hates when I tell a restaurant it's his birthday which I was just trying to surprise him, but that obviously didn't turn out as planned. \n\nThree stars because - all in all, the food and view was enjoyable. The staff was not attentive at all and we had no idea who our actual waiter was as we were greeted with about 5 throughout the duration of our dinner. I was highly disappointed with The River Cafe as it took  months in advance to make a reservation and to think I was going to receive superb service especially for the price you pay! \n\nSadly, I will not be returning to this establishment in the future. I really expected a lot from this place and left feeling highly disappointed.", "author": "Ashley W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-17", "description": "Beautiful atmosphere. Breathtaking view. Incredible food. Wonderful service. A perfect romantic evening.", "author": "August P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-10-31", "description": "We came here to celebrate my birthday. First off, the ambiance and view of the city is breathtakingly amazing. You are directly adjacent and under the bk bridge, which provides a vista of the river and bay with spectacular light reflecting off of the water.\n\nNow before I begin, take note that my original ranking was going to be 2 stars, but due to ratification by manager, this was amended to 3. We were seated in the middle of the dining room even though we asked for  a table by the window so we could enjoy the view. The host told us that we could not be accommodated because they are reserved for regulars. WWHHHAATTTTTT!? Needless to say, the table we wanted remained vacant for the entire time we were there (close to 3 hrs)\n\nNow onto the food. The menu is prix fixe at $115 per person with choices from starters, entrees, and desert. Each item was great and well prepared. They just took forever to come out and we had three different waiters, and four different assistant waiters/bussers making it very confusing regarding who to order with or make requests to. Our total dining time was close to 3 hours, which really put a dent in our other planned activities, as it set us back tremendously. \n\nFor dessert, my gf arranged for them to bring out mine with a surprise candle and happy birthday on it. They ruined that and made it very obvious when they came out to the table, didn't give us our desserts, and did a lap around the restaurant causing our ice creams and sorbets to melt. All because there was no silverware on the table. Whose fault is that?\n\nNow for the extra star...my gf contacted the manager after to complain about the lackluster experience, and he credited her back $95, which brought the total amount spent from $300 to $200. The service and food versus the price just doesn't match up. No view or legacy as a nyc famed restaurant equates what is being offered here. This is one of the REALest reviews I have ever wrote.", "author": "Gordon H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-09", "description": "The restaurant has a beautiful waterfront location with great access to the bridge park for a before or after dinner walk. Dining room is filled with fresh flowers and natural light. Temperature is well controlled even as the room is bathed with sunlight. Service team never lets a glass go empty and is very accommodating to special requests. Oysters came with this awesome granita dressing. Duck and lamb were perfectly cooked. Both desserts, goat cheesecake with mango, and a pistachio dish that I forget the name of, were excellent. Pistachio dessert came with toasted pistachios in some sort of honey sauce that really impressed us. Overall, River Cafe is worth returning to and a very enjoyable experience.", "author": "Matthew B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-14", "description": "Food was like a burst of flavor with every bite. I ordered the oxtail ravioli for appetizers it was amazing. I then ordered the lobster for my meal... did i say amazing yet? So delicious. Then i got blueberry tartlet for dessert. Portions are normal (my husband said the portions were tiny). Overall beautiful atmosphere. The little outside park  made my heart melt! Sidenote there was a fixed menu so per person it was $125 not including drinks or tip/tax. Its high end but you do get what you pay for.", "author": "Stefanie J."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-04-04", "description": "I was really hoping for a great night to celebrate my best friend and my husband's birthday. Despite the glowing review by NYT's Pete Wells, I was disappointed by our evening.\n\nService was really bad. The coat attendant and the maitre d were a pleasure but problems started with our waiter. He didn't welcome us to the restaurant and proceeded to provide very little explanation of the options after we asked several questions (Q: \"Tell us about the tasting?\" A: \"We're not doing that anymore tonight I think.\"). It was a full night and he seemed very rushed to take our order. After going to Stone Barns Blue Hill last week, the service at River Cafe paled in comparison.\n\nThe food itself was satisfactory but felt unoriginal. Our table ordered an array of entrees (poached lobster, the lamb chops, mushroom Wellington...). No one volunteered thoughts about their meal until I inquired their thoughts (when I did, responses were typically \"it's good\"). \n\nThe ambience is beautiful, a true NY classic on the water which gave them the extra star on my review. However, given the lackluster food and poor service I recommend taking your hard earned money to another place that provides the full experience of fine dining.", "author": "Mary P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-03-09", "description": "Go for the view but not the food, it's nothing special. Actually enjoyed sitting at the bar more - it's less stuffy and features an unobstructed view. If you are dead set on dining here do it way in advance and try to guarantee a window seat as we did not make the cut apparently. The hostess and wait staff did not seem to really want to be there which in turn made us feel the same. I won't be back but glad I got to see the place.", "author": "Scott M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-06-16", "description": "Came to this place on a recent trip to New York with my wife. I had contacted the manager about reserving a table as early as possible, to which we were advised there were no reservations available, but that she would try and accommodate us as walk-ins. I advised her that we would be coming from an extensive hike around the city and would not be dressed too formal, to which she told  us they would provide me with a suit jacket and that the rest of our attire was appropriate.  Upon our arrival at 5 pm, when the restaurant opened (no other clients at all) I had told the hostess I spoke with the manager, to which she phoned her seeking confirmation, letting her know condescendingly  that \"that couple\" had just arrived. Upon getting confirmation she proceeded to escort me to a table and pull up the menu telling me \" you are aware the expense of this meal? Just wanted to show you the menu.\" I was fully aware of the dining experience here, read about it, and I wanted us to eat by the water with a view of downtown and the Brooklyn bridge. My wife and I on several occassions have eaten at places of this nature, but never have we felt so embarrassed and belittled. The hostess was judgemental of our presence, so I pretty much told her she was disrespectful and rude. We were so disgusted by our initial greeting we decided to walk out. Never did we sit down, never did we try the food. I pray there dining isnt as terrible as their treatment of guest.", "author": "Daniel P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-08-28", "description": "I was expecting a lot from this place.\nMy boyfriend booked a table months ahead to make sure to get a good table as he was planning to propose that night (and yes, he did!).\n\nWe got a good table but not one with the bay view, these ones seemed to be reserved for the old and rich looking people.\n\nThe clientele is actually pretty old and looks very posh.\n\nI assumed the maître d' would explain us the menu and make some suggestions. Alas, he just handed them to us and left. What the ...? Even in Paris (known as the worst service you can get in Europe) it's not like this when you're about to spend 150$ for a dinner. \n\nAs an appetizer we ordered a glass of champagne...that we have not been able to select. Don't tell me this kind of place does not have at least 5 different champagnes by the glass.\n\nSo we made our choice by ourselves. The menu is actually amazing, and all the products are from the US: very very interesting.\n\nThe wine waiter was very professionnal, able to drive us according to our budget (that he guessed) and our expectations.\n\nSo, what about the food? A-MA-ZING. Honestly, the best food I got during my stay in NYC. The lobster, the branzino, the cheese. OMG, I could go back there just for the food!\n\nSo in the end? Honestly the place is packed so it looks and it sounds very crowded. The service is disappointing. But the food is 1000% better than all these negative aspects.\n\nDo I recommend this place? Unfortunately at this price, a disappointing service is unacceptable.", "author": "Cecile P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-04", "description": "I love this place so much, we were lucky that our table was sitting next to window, which they have excellent view of Brooklyn bridge, river, and Manhattan. Lunch is more casual than dinner, and the price is reasonable and acceptable. We ordered Foie gras, lobster, and their signature Brooklyn bridge chocolate cake, they are all delicious. I can't find any critic yet. Overall end up with 90/pp. good for anniversary and birthday. Definitely come back :)", "author": "Ray C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-03-28", "description": "If I could give this restaurant no stars I would. I have traveled the world \u0026 eaten at some of the finest restaurants. Never have I seen such a rude staff. The view is not worth enduring the attitude we received when paying over $300 before a tip. Thanks but no thanks. Don't waste your $!", "author": "Christina L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-08-11", "description": "We made our reservation way early for my birthday so that we can get nice seats with view. \nBut unfortunately, when we arrived, our seats were all the way in the back. We were disappointed but understood everyone comes in for a view and can't accommodate all requests. \nAs we go through our dinner, the guests who sit by the windows finished their dinner and left.  Then we saw, a couple who were sitting right next to us were awarded the seats. We asked our waiter and host if we can do the same. The host told us people are waiting outside and can't do that. I begged to let us sit for 5 min to take photo. He reluctantly said OK. When another seats become available, he allow other couple to move to the seats again. \nWe had enough and left.", "author": "Lily L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-23", "description": "This place was beyond what I expected! I came here for a dinner for my boyfriends birthday. He was astonished and the scenery was out of this world. Loved the ambiance and the piano playing in the background (especially since we're music lovers).\n\nWhat I appreciated most is that they accommodated my boyfriend and I even though we were late for our reservations. The restaurant's kitchen closes at 11 \u0026 we came in at 11:05 and they still let us eat. So I'm extremely grateful for that.  \n\nThe food was okay,  nothing extraordinary. I got steak, it was cooked well for my liking \u0026 the shrimp appetizer was really good. I know we came late, but I did feel rushed. I didn't get to explore the menu and ask questions the way I wanted to. So I just ordered safely with the steak. I did feel like I was being watched a lot. I don't know if it's because they really wanted us to leave or they wanted to ensure customer satisfaction. Anyways, I would definitely recommend this spot to someone else.", "author": "Kim N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-06", "description": "I went there couple times for special occasions  (of course, special restaurant for special occasions.) Always get nice service. Food and the view :)", "author": "Joop Y."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-07-15", "description": "I came here with the gf for her birthday. It's been 4 years. The price shouldn't be that bad to swallow knowing it's been 4 years. Man up and take her somewhere nice!\n\nI came on a rainy day, with a sprained ankle. I saw the bus boys outside by the door with huge umbrellas, and coincidentally, I forgot to bring mine (traveled by car service). But it's okay, I'll LIMP walking in the rain, while you stand there looking at me, deciding whether I would appreciate you coming over or not. I love wearing wet clothes.\n\nReception was lovely. Very sweet, good looking, and opened doors for you. I called for a reservation 3 weeks in advance (so glad I did), and was told formal dressing required. (if you come here without a suit jacket, a rental will be given to you, and you will be seated in the back). I was given the hint that the better you dressed, the higher chance you'd get seated by the window. They cannot accomodate over the phone. Which is true, to an extent* \n\nGood view of the Brooklyn Bridge. Live piano music. Expensive, intimate looking decor. Definitely a place to come back to on a special occasion. \n\nNow to review the food. As of date, the pre-fix is $115, with the chef's tasting at $145. We both went for the prefix:\n1) Battle of Appetizers: Shellfish platter vs wagyu steak tartare: Wagyu steak wins! The tartare was very beautiful \u0026 flavorful.\n2) Battle of Main Course: 16 oz steak (medium) vs rack of lamb (medium rare): Steak wins! The rack of lamb could've used slightly bit more seasoning. The mint jelly that accompanied the lamb was strange.\n3) Battle of Dessert: Chocolate Bridge Cake** vs Sorbet plate: Sorbet wins! The cake was kinda dry.\n\nOverall, I recommend the place, on VERY special occasions. If you want a seat BY the window, maybe after you earn at LEAST $100k a year, have the appearance of a rich person, and speak French. \n\n*There were THREE open tables exactly by the window, with the restaurant half full when I entered. I was led, however, to be \"near\" the window, with a much older couple blocking the view. When night came, and the restaurant was full, I noticed that all those near the window were older (30+years), appear to be regulars, or insanely rich. I understand the business practice, but you basically assumed I can't tip well, or don't belong here. I dressed very sharp, and my date had a nice dress. Whatever; I tipped you well regardless, since the service was very professional (although on borderline friendly - stern).\n**The restaurant probably knows there's a lot of birthdays and proposals going on. If you mention it to your waiter, they can prepare a candle for your dessert.", "author": "Andrew C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-27", "description": "The iconic River Cafe is an amazing setting for a special occasion. A perfect destination for a journey starting on the brooklyn bridge which combines a classy dining room with breaktaking views of the East river and Manhattan skyline.\n\nThe service, while bordering on stuffy, is polite, knowledgable and courteous. The menu offering a 3 course menu for around $115, as well as a pricier 6-course chef's tasting menu, has something for everyone. Each course gives you the choice from some ten options, meaning that you and your date can try several options between you. This, coupled with a litany of tasty sounding creations leaves you spoiled for choice. The goods, once they arrive, perfectly deliver on the promise of the mouth watering descriptions; we attacked each course with gusto and were never disappointed. \n\nDessert and drinks menus are also comprehensive - the Brooklyn Bridge dessert if a must-try. \n\nOverall, a great experience - a worthy destination for a Manhattanite feeling some wander lust (but not too much)", "author": "Ashwin T."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-11-29", "description": "My family and I (5 of us) went here for Christmas dinner in 2016 and it was a lovely experience. Very good food, attentive staff, stellar views. We liked it so much we wanted to make a reservation again this year (2017) for Christmas dinner (this time for 6 of us). We called on the first day they were accepting Christmas Dinner reservations (Nov 25) within the first five minutes the phones opened up - we wanted to be sure we got a reservation as it is very popular. They refused to confirm a reservation for us - telling us that reservations for a table of 6 had to be approved by \"management.\" We left a telephone # and they said they would call back with a confirmation in a day or two - they didn't. So far, we have called at least four times and the persons answering the phone are clueless and rude, and after one week, no one will tell us if we have a Christmas Dinner Reservation. Have not been treated like this by any other NY restaurant. So much for their supposed great service. I feel like they are making sure that their preferred customers get seats and only after they all have their reservations will they get back to us, making it difficult for us to plan Christmas. What a terrible way to treat the public. People should beware of this place if they want to go there for a holiday meal.", "author": "Linda S."}], "servesCuisine": "American (New)", "priceRange": "Above $61", "name": "The River Café", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Water St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/C_8aEbAvcCLhiqXn9QdWSw/ls.jpg", "@type": "Restaurant", "telephone": "+17185225200"}