{"aggregateRating": {"reviewCount": 1049, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-04", "description": "Was a grt experience with my wife for our anniversary! The Brooklyn bridge shaped dessert was grt!", "author": "Abdul W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-14", "description": "Service threw me off - some staff were overly and uncomfortably formal, while others were friendly and delightful - guess it just depends.  They gave us all the time we wanted, at least.  Anyway, the FOOD was outstanding.  Portobello mushroom soup starter - very nice.  Appetizers - foie gras two ways was fantastical (loved!), and veal and dumplings with bone marrow so satisfying.  For entrees the beef wellington was outstanding, but unfortunately the branzino was quite a disappointment - simply nothing special at all.  I regretted ordering it for at least the next 24 hours - so many more amazing options!  Dessert - sorbets very good, creme brulee excellent, and chocolate brooklyn bridge pretty good but not amazing (maybe amazing if you like light/fluffy chocolate).  Wine list excellent.  A little bit crowded - I would have preferred to sit in the outdoor patio space, regardless of view.  Oh yeah, Anne Hathaway was dining behind us, if you care about celeb sightings.  Overall wonderful experience and perfect for a special occasion.", "author": "Julie S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-21", "description": "My boyfriend took me here on my birthday and it was one of the best birthdays ever. i loved the goat cheese cake it was great!! of course the portions are not big but if your looking to impress a date and have some extra cash to throw around, by all meansdo it in this place. we went in may but we stopped by during the christmas season and the decor and scenery took our breath away. real romantic place.", "author": "J R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-06", "description": "Jackets required. That's when you know it's legit. \n\nThis is the perfect place for a nice night out. The view is incredible - right under the Brooklyn Bridge with a picturesque view of downtown. The restaurant itself is on the water, tucked away from the street and surrounded by a little garden. The decor is great, inside and out. The service is impeccable. Everyone was very attentive and nice; I had expected a stuffy/snobby atmosphere (it's pretty formal) but was fortunately proven wrong. \n\nThe food was amazing. It's $100 for a three course meal, and $125 for a six-course. There were three of us, and we all got the prix fix as opposed to the six course. I had the lobster for dessert, and it was really good. However, I regretted my choice after trying my mother's yellowfish tuna appetizer. Both appetizers were good, but I preferred the tuna and whatever sauce it was prepared with. My father ate the scallops, which he seemed pleased with. For the main course, I had the lamb. As a rule, I only ever eat red meat if it is well done, so I've been served dry, over-cooked meats more than a few times. However, this lamb was well-done while still being moist and delicious. My mother got the salmon, which I also thought was good. My father picked the real winner: the chilean sea bass. I eat fish and seafood all the time, but this was hands-down the best fish I've ever had. It was so good. For dessert, my father had the tart (I can't remember if it was apple and almond, or pear and almond), and it was really delicious and pretty big. I had the Brooklyn Bridge, and if you love chocolate, you need to have this cake; it was so good. \n\nOverall, a really great experience and highly recommended. The hefty price tag is most definitely worth it.", "author": "Dragana B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-02-23", "description": "wow, great view of lower manhattan and the brooklyn bridge.  Service was very top notch - they made sure that my friend has his share of his bread (six times).  And my duck was perfect.  The brooklyn bridge cake was kind of cheesy but it was good too.  I would definitely go back here again.", "author": "Lawrence Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-03-16", "description": "My first five-star review.  I was surprised with a dinner at the River Cafe for my birthday.  Nestled in the shadow of the Brooklyn Bridge, the River Cafe is on the water, with spectacular views of Manhattan.  I spent most of the meal gawking at the skyline, boats, and water taxi (yes, I'm a native New Yorker).  Okay, now the meal.  Awesome.  The menu includes a $100 prix fixe option (appetizer, entree, dessert).  Almost all of the choices sounded delicious and we had a difficult time choosing.  While waiting for our appetizers we were treated to an Asian-inspired amuse bouche.  I can only speak for myself, but my crab bisque and duck breast were wonderful.  Excellent flavors.  My other companions also ooh-ed and ahh-ed over their meals.  Steak and fish, respectively.  Dessert was also quite yummy.  As a chocolate lover, I was satisfied with my chocolate Brooklyn Bridge creation.  Sticky toffee pudding was also lovely.  After dessert we were surprised with some handmade chocolates and mini biscotti.  \n\nStaff was very attentive, refilling water, asking if anything was needed, and providing explanations for menu items.  Valet called for a car service and then ran to the street to hail us a cab (after I vetoed the car service's offer of $20 to go 2 miles).  Overall, an excellent experience.  Would definitely love to return!", "author": "Ana B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-09-12", "description": "WOW This was definitely the fanciest restaurant I've ever been too.  Jackets required in the dining room.  Service was outstanding.  The staff sat us down (a table for two) on a Friday night without reservations, so they were extremely accommodating.  They have to be for a 98.00 prefix.  I had some duck, King crab, lobster, and lamb, and all were exceptional.  Also, they offer a really fancy dessert of a mini Brooklyn bridge made out of chocolate.  \n\nThe view of downtown NYC is amazing and they are right next to the Brooklyn Bridge waterfall.  Of course, they have a bar with a great piano player.  \n\nIf some really special happens or you want to propose, this could definitely be a possible location to celebrate.", "author": "John P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-11-25", "description": "This is an excellent restaurant. It's advisable to book in advance - we went on a quiet weekday lunchtime and it was packed. If you book far enough in advance ask for a window seat, as apart from looking out over the Hudson River you will also be right next to the Brooklyn Bridge.\n\n\n Food and service are all top class. There's a viewing area next to the restaurant where you'll get great pictures of Manhatten across the water.\n\n\n Wear something at least semi-smart and be prepared to pay if not 'top dollar', then certainly above average. Worth it for the location and the occasion.", "author": "Lindsayhead"}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-07-04", "description": "You gotta live your life and you also got to experience life to the fullest by exploring places that can leave an impression. The Rive Cafe is one of them. I am an avid diner and i know good service and food when I get it and the River cafe was all about that. Took my boyfriend there for his birthday and I couldn't have been prouder of myself for picking this breathtakingly beautiful restaurant to make his day special.\nFrom beginning to end, the service was just outstanding. The you also get to experience the beautiful view of Manhattan. \nWe went for dinner and they have a set price menu where you get many choices to choose from. I have the Colorado Rack of Lamb wish was D.ELI.C.I.O.U.S!!!!! Everything was just done just right. The dessert are so cute and very artistic looking. I had a hard biting into it because of how beautiful it was but I'm glad I did because it tasted as good as it looked.\nEveryone was so attentive and was on top of their games and held themselves to their highest standards. \nAll I have to say is the place was magnificent. Go if you want to experience a good restaurant and be left with memories that can last forever. I will definitely go back again and if I were to choose a place to hold all my special events, it would be my number choice. Keep up the great work River Cafe!!!!!", "author": "Leila A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-02-02", "description": "3 words. Oh my gosh. This is what a fancy restaurant is supposed to be like. GREAT food, BREATHTAKING views, and beautiful music. They treat you like royalty here. Especially great for a late dinner.", "author": "Kiera D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-01", "description": "I went with my sister and best friend, this is a beautiful place with wonderful food. Everywhere you sit in the main dining area would give u a wonderful view of the city. The dress attire is classy and nice. If you want the view in the main dining area you have to have the pre fixed meal for dinner at 100 a person it was hard to swallow. But the waiter staff was very nice even though we arrived late. I just wished that I could of had the window seat. Just remember the population that eats here are usually not your young and trendy it's a classy place majority of the people were in their 40\"s when we went. At the price I wouldn't be surprised. It's definite a wonderful place for a special occasion in the evening. one thing to remember i would not go there without an reservation, the main dining area is cozy and small, and parking is valet or you have to walk a bit on cobbler streets for the ladies:)", "author": "Yann P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-03-28", "description": "People complain at all times why am I picky with the food and why I cant be easily satisfied. What can I say? Im unique. We had arrived there and voila, a valet, how kind! They sure took care of my natylka(car). And off we entered inside. The first thing that I have noticed was the fresh smell of the flowers that was taking over the place. Magnificent, this is the type of restaurant that you would bring a hot date to and if you want to impress her more, get a table by the window which overlooks the ocean, Brooklyn Bridge and the city. The place is pretty pricy but thats the price you pay for love. The food and desert was well prepared and tastefully done; I just didnt want to eat it because it was so beautifully looking and in small portion just the way it needs to be. I was beyond impressed and am planning to go back to this location.", "author": "Pliego Family N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-05", "description": "Went here for our anniversary and were absolutely NOT disappointed.  We had requested a window seat and hoped for the best, so when we were seated at the window we were quite happy, as the views are stunning.  They knew that it was our anniversary and every person on the waitstaff wished us a happy one.\nService was impeccable - every time I took a sip of water, someone was refilling it, and yet, I never felt like they were hovering or trying to rush us.\nWe had the three-course menu and the chef sent out some amuse-bouches and with dessert some mini petit-fours.  The food was phenomenal - Yellowfin Tuna/Butterleaf Salad, Crisp Duck/Steak, Brooklyn Bridge/Coffee Caramel Parfait - all delicious.  The portion sizes were just right too, as we left feeling full but not stuffed at all.  \nOf course, we also wanted to get our picture taken with the lovely view in the background; unfortunately, as it was still light out, the inside pictures were coming out too dark.  The waitstaff captain said that after our meal, she would be happy to accompany us outside and take pictures, which she did.  It wasn't like she took just one either - she took several from different angles.  \nThis is definitely a place to go for any special occasion; I would even go here just to experience the overall ambiance and delicious food.\nStill can't get over what a spectacular experience we had.  So glad we picked The River Cafe!", "author": "Lady R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-10-26", "description": "Love the fact that they cater to vegetarians and that it's not just rabbit food. Had the ravioli (literally not kidding here - it's ONE ravioli :) which was fresh and unique and delicious. A group of four shared the chocolate marquis, the toffee cake, the goat cheese cheesecake, and the souffle - all were spectacular - made even more so by the fact my friends basically gave me their desserts because they took pity on the One Ravioli girl.", "author": "Sabrina R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-05-04", "description": "fat Peter rating system.  \nas follows:  \nSTARS- standard yelp\nCHANCE I WILL BE BACK- YES\nWhy I went-ex wanted eat there.  \n\nRiver cafe really is Mcdonolds of Hi-class restaurants.   I will tell you how it goes.  they have a great spot, its a boat under Brooklyn Bridge.  You wear a jacket no tie and slacks you walk in the price is 100 set dinner or 125 set dinner .  \n\nYou pick you choose you eat you go home.  if your making a big deal about it.  you lost something.  \n\nRomantic YES.  \nFood is ABOVE AVG GOOD.  VALUE wise its on par! \nIf your house has a view of Brooklyn bridge on the water and you invite me over and want 30 for a plate of eggs and you serve me, I will pay you.  \n\n\nFood is cook by an artist and expect no less.  \n\nHonestly if you got a bad attitude or bad service TO A POINT.  I'd would end the meal right there, i'm old enough to not take shit from anyone WITHIN reason. Id call guy over and i'd cut this dinner RIGHT OUT.  BILL at certain price or call police.  \n\nHowever the river cafe is funny, eat it ,finish dinner and move on. I mean I ate there twice in last 10 years so I definitely dont keep em in business I doubt any of you people do.\n\nPeople eat there cause of the location.   your lucky food is above average and people like \"crap\" like  that chocolate brooklyn bridge they make for dessert.  \n\none yelper said \"I felt like half of what we paid was just for the view. \"  your wrong its more like 25%.  \n\n\n\nafter writing this I changed my rating to a 3 star cause 4 was too generous.", "author": "peter C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-21", "description": "How could i forget to review the River Cafe? Why its only been my favorite place since I was born...talk about special, this restaurant has the BEST views, the most romantic setting, top notch service and very good dishes. I loved my meal (fish) and my fiance loved his (i think it was fillet) all I know is his came with Gorgonzola potatoes that were truly to die for. The very BEST part was that my best friend proposed to me here, which was my dream, so you better believe our anniversaries will be celebrated here as well. I LOVE this place, what a special, memorable time.", "author": "Caterina M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-05", "description": "OK, it was delicious and the view was amazing, but my girlfriend and I both had a stomach issues after getting home.  We both were trying each others food, so I'm not sure in particular what it was.  It was totally worth it though.  This is a once in a lifetime experience.  The service was amazing as well and not snooty at all.  Some of the other customers are a little, though.  At least we were alone by the window for most of the time.  We arrived at around 6, and it wasn't busy at all.  By 8 it definitely was.  I recommend reservations around sunset, so you get to enjoy the view during the day and night.", "author": "Jacob L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-07-27", "description": "Rude rude rude - these guys need to get over themselves.  Uptight, arrogant and the food's ok but not innovative.  Go for the view but nothing else.", "author": "Sara B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-09-07", "description": "Well my experience at the river cafe was nice but disappointing:( when I made reservations I specifically asked for a table by the window, few hours before I called to confirm first they couldn't find my reservation then they ensured me that everything is fine. When we arrived we asked as to wait for the next available table, we waited for 2 hours and then got a table NOT by the window. Food was good, view is amazing! But after paying $650 for small dinner for 4 it didn't seem all that nice. Over all it's a nice place for romantic dinner for 2.", "author": "albina V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-06-28", "description": "Went here for our 2 year wedding anniversary and it was absolutely phenomenal!  The view was tremendous and the food was excellent.  I have seen some reviews on here about average food, but I can't imagine what wasn't delicious.  I had the duck and it was great.  Definitely recommend this place.  It is expensive, but that is to be expected.", "author": "Adam M."}], "servesCuisine": "American (New)", "priceRange": "Above $61", "name": "The River Café", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Water St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/C_8aEbAvcCLhiqXn9QdWSw/ls.jpg", "@type": "Restaurant", "telephone": "+17185225200"}