{"aggregateRating": {"reviewCount": 1049, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-08", "description": "The most romantic spot in the New York area.  The bartenders make the best drinks and the food was absolutely perfect.  The view was incredible. This is my favorite place and will definitely be a place we go to annually for my birthday.", "author": "Dorothy G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-24", "description": "Best steak tartare of all time. Also they somehow remove the entire shell of the lobster while allowing the lobster to keep its exact shape, I'm not even sure how that's possible. The view is second to none and the service is also top notch. Would go here for any sort of big celebration or formal dinner.", "author": "Charlie H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-18", "description": "now for full disclosure I was taken here by a friend  for 50th birthday, so food always tastes a little better when your'e not paying !! but I was really pleasantly surprised. Thinking initially that this was more of atmosphere, great view restaurant first and food secondary, the delicious  lamb main course and scallop ,fois gras appetizer made me a believer. My friend's steak tartar also very nice. Choc. souffle Iv'e had better , not light enough but nonetheless this place hits the mark, the only question is if your'e paying $150.00 a person, is there better , probably? but not with same view and atmosphere. They just need to build a subway line closer ,! but since I drove wasn't an issue.", "author": "Thomas E."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-09-17", "description": "I found out about this restaurant through yelp and a few recommendations from coworkers. I made a reservation a month in advanced and was looking forward to spending my last night in New York here. The view would have been amazing but we were sat in this awkward corner and very close to both tables either side. The service was great and everyone was welcoming. The food I found bland and disappointing. Definitely not worth the price tag, and on top of it all I was sick the next day nauseous and vomiting the whole way home which is not fun on an airplane.", "author": "Jamie M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-16", "description": "Came on 10/15 on a Saturday night at 8PM for our anniversary. The valet guys were very friendly and opened the door for us. The receptionist was also very nice and we got seated right away. Our server was amazing! We did the 6 course tasting menu and everything was really great (tuna, shrimp, halibut, foie gras, steak, and dessert), especially the shrimp appetizer and the foie gras. They put 2 candles and happy anniversary writing on our chocolate cake which was a nice gesture. We paid around $430 for two of the 6 course menus and 2 glasses of wine. What's even better is the view! Very beautiful and definitely do take some time to walk around the restaurant by the water. I'd recommend this place for special events!", "author": "Sheryl L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-09", "description": "I brought my husband here for his birthday since we were visiting NY, so I thought we'd go all out fancy. I didn't like that there was this dim light on the table that had to be plugged into the wall of our booth, so when they pulled out the table for us to sit on the booth side, I had to step over the wire and try not to trip over it in my heels. Besides that, everything else was great. We had great service, great food, and an amazing dessert of a chocolate Brooklyn Bridge. I got the steak with potatoes in bone marrow, and both were exquisite. My husband had the lobster and he thought it was delicious. The dessert was a little bit too rich for me, but I still loved the novelty that we ate a chocolate Brooklyn Bridge. :)", "author": "Becca C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-05-21", "description": "In the mood to be treating like crap while choking down a meh meal?  They come on down to the River Cafe!\n\nI'd love to see Gordon Ramsay yell at the managing jerk staff and put them in their place.  hahaha... BAM!  Just yell at them and leave - they're the type of people who wouldn't want to change to better themselves.  They enjoy being rude and miserable.  Bollocks.", "author": "Michele H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-10-09", "description": "All expectations met given that it's a $$$$ place. Everything from friendly, attentive staff, delicious food to beautiful view of the brooklyn bridge as you dine.\n\nIf you're wondering if it's a worth $$$$ for this experience, I'd say YES!", "author": "Nancy N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-16", "description": "My boyfriend brought me here around March 2012 and it was the best experience food and atmosphere. The wait staff was very attentive to our needs and we did not have to wait long to sit after we arrived for our reservation. I had a scallop appetizer which was delicious while my boyfriend had the tuna. I then had the salmon for dinner and my boyfriend had the steak and oh my, that steal was delicious! So I would definitely recommend that! I had the sticky toffee pudding with pistachio ice cream sandwich for dessert and that was so much better than the Brooklyn bridge dessert! Overall it was a great experience and we are hoping they will be open soon!", "author": "Tiffany A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-18", "description": "the BF made reservations for an anniversary lunch during our visit to the big apple.  it was a perfect, gorgeous summer day in NY.  even during the day, the Manhattan skyline is just breath-taking.  the restaurant isn't too difficult to find, even walking to it from the beautiful Brooklyn Heights. \n\nthe restaurant isn't very big so making reservations was a smart move, even for a weekday lunch. the clientele seemed to be more of business than social. one thing i did notice was that we were only 1 of 2 tables there who spoke english, every other table around us spoke mostly french.  upon arrival, we asked to be seated next to the window but was told the window tables were reserved for their \"regulars\". it didn't make too much difference to me since the entire dining area facing Manhattan is surrounded by glass, no view was obstructed. \n\nthe staff here is very friendly and attentive.  even though we were probably the youngest patrons at the time, they weren't snooty and still treated us like all their \"regular\" diners. i didn't read up on this place prior to dining here since it was a surprise by the BF, but it looks like their menu changes daily. it was only two pages long with a list of appetizers and a list of entrees.  for appetizer, we had the foie gras two ways and for my entree, i had the crisp duck with organic carrots, duck leg potato croquette and bok choy. i accompanied my meal with a glass of white wine (ya, i know, should've been red but i wasn't feeling red at the time). we didn't want to order dessert because we had plans to go to a dessert specific shop in the city but they gave us dessert du jour which is a small sampling of a few of their desserts in miniature portions. our entire meal was slightly over $100 (not including tip). \n\nthe entire meal was delicious, romantic and well worth it especially for special occasions. like many fancy restaurants, be prepared to eat light, be captivated in a culinary experience, be serviced well and pay well.", "author": "Sara C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-22", "description": "I have been meaning to write this review for a bit.... I have been here a few times. More for the wine list, desert and view than for the actual food. Meat eaters have many options, however if you have a vegetarian in your party this is NOT a good place. I had their only vegetarian option (besides salad) that was essentially a vegetable empanada. It was good, but not at that price point.  Last time I was there someone said that if I call in advance they might be able to do something different. I will try that next time and report back!", "author": "Claudia R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-12-31", "description": "Ate here some time back, with my lovely wife, \u0026 we had a very romantic time of it, given the dress code \u0026 the wonderful view that feels more big city than Brooklyn  (just be sure to request window, with view seats when making reservations \u0026 confirm again when waiting to be seated.)  Overall the food was good, but the menu could use a bit of life injected into it, given the high price point of eating out here.  For a really enjoyable time where foodies like us get stuffed, but still have a very high end, we were better served in a couple of NJ locations, such as The Manor in Orange, or The Benard's Inn.\nThe service was very good however, \u0026 we did enjoy the main entrees (sticking with basics, such as Lobster \u0026 Steak.)  Not an everyday visit, but worth dressing up \u0026 hitting for dinner if you have never been there before.", "author": "Bill L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-22", "description": "This place is one of those few places these days still keeps it's standard. Excellent food and service. It's a wonderful place to spend few hours and watch the boats run by in front of the Manhattan skyline backdrop.", "author": "Henry W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-05-10", "description": "Rudely turned away. Maybe because we had a child with us but who knows. I've never been told \"sorry we're full\" without being offered a wait time. Would never go back and this level of snobbery has no place in Brooklyn . There are a million fancy restaurants in this city , kindly get off your high horse .", "author": "Chris N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-05-29", "description": "River Cafe is simply a really nice restaurant with very good service and very good food. One thing I found interesting however, was as fancy and formal this place is (Jackets required for men btw), I didn't find the atmosphere equally as fancy or snobby. I actually thought the atmosphere was very lively and fun. Don't get me wrong, this place is upscale. The food is sophisticated, the restaurant has expensive decorations, etc.. but when you're at a place where it's a minimum $100 a head, I think you would want to be in an upscale restaurant surrounded by other people who are dressed nicely. I was happy it was formal, but not stuffy.\n\nSo for the food, my wife and I shared the Yellowfin Tuna app and the Rabbit and Dumplings appetizer. The tuna was really delicious. The bacon wrapped around the fish added a really nice crispiness, and the sauce in the dish was really unique. The Rabbit and Dumplings was something special. We licked clean the plate. Having the rabbit two ways was really nice and the ricotta stuffed dumplings were so good I wish we could have ordered a whole plate of them.\n\nFor entrees we went with the Rack of Lamb and the Branzino. Both were great. The lamb was cooked perfectly. The meat was juicy and the mint glaze around the plate was a cool twist on a classic combo. The Branzino was the best thing we got all night however. The fish was creamy and practically melted when you ate it. It also was completely covered with a breading that went great with the fish.\n\nFor desert we did the Brooklyn bridge desert was was very chocolaty and had a fun presentation, although it also came with this seltzer drink that was kind of odd... We also tried the Chocolate Sticky Toffee Cake which was very rich and also had a pistachio ice cream sandwich with it that was awesome.\n\nAll in all the food was great and the service was really good. I appreciated that we were never rushed and the servers always seemed to come by at the right moment to ask if we wanted a new drink, and also didn't come over when in the middle of good conversation. They also let us breathe for a while between dinner and desert and just enjoy our drinks which was great. Lastly I just have to mention the view. It's really nice to look our on Lower Manhattan and the Brooklyn Bridge and watch a sunset and then see the city lit up. Really great view that most other restaurants cannot offer. While this place is expensive, I definitely recommend it for a special occasion. The only thing I would probably do differently is bump up the extra $25 a head and do the full 6 course chef's tasting menu. For $25 more you really seemed to get a lot more food from what I saw at other people's tables. I think that's probably the best \"deal\".", "author": "Ryan B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-22", "description": "The food takes a close second to the view and romance of this restaurant.  Feels like one's transported to the Titantic dining room.  Lots of kissing between bites of sumptuous food.  We enjoyed the fois gros (sp?) 2 ways as appetizer, the grilled black seabass was delicate and delicious and finished with a creme brulee.  Witnessed two marriage proposals.  Pricey was the only negative.", "author": "Lana K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-11-17", "description": "Beautiful views, incredibly classy atmosphere, but mediocre food for a restaurant of this quality.\n\nIf you ever want to feel like you're sitting in a movie full of the upper crust of New York social life, go here. The view of the water is incredible. The people are beautiful and dressed impeccably. The service is flawless and the plating is dazzling. But if you want your mind to be blown by the food you're eating, if you're looking for a place that will make you rethink what it means to be eating good food, this isn't really the place for you.\n\nDon't get me wrong, the food was very tasty. But some of the sauces were pretty simple, and not in the \"elegant in its simplicity\" sort of way (the abalone we had, for example, was in a sauce that I'm pretty sure was just vinegar and soy sauce). Similarly, the steak we ate was chewy. Some pieces had large amounts of gristle on them. The shrimp we ate was overly salted, and the foie gras, while very, very tasty, was in a portion that was a bit too big.\n\nAll this would be fine in a restaurant of lower quality, but when you're paying $400 for a meal for two, I think it's reasonable to expect every dish to wow you. Personally, I don't think I'll go back to The River Cafe anytime soon. For my money, I'll take myself back to Nobu, where every plate was spectacular.", "author": "Ben S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-08", "description": "Prix Fix is $100 for 3 courses and Wine from $50 to sky high. Given the quality this is good value.\nDeserves reputation for fine dining and the view over lower Manhattan is fantastic.\nYou need to wear a Jacket, which I think is a bit silly, it certainly didn't mean everyone was well dressed!\nPerhaps a shirt and tie rule would be better.", "author": "Simon P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-08-12", "description": "Expensive, but this restaurant is worth every penny. The food was beautifully done and tasted great. The service was perfect on timing, presentation, and suggestions.\n\nThe view is also fantastic and the deck/bar is great for a drink while you wait to sit. I'd recommend it for any special event.", "author": "Tyler G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-27", "description": "Came here for a business dinner last night and was pleasantly surprised. At first i thought the view of the place is the highlight, but was I wrong. The food here is AMAZING. With a party of 11, I was able to sample a large selection of the menu and there was nothing i didn't like. Remember to wear a jacket for the gentlemen, if not, you will need to settle for their spear jackets. \n\nIf i am to pick my favorite dishes, i will say the steak tartar, lamb chop and maine lobster. For desert, the brooklyn bridge chocolate cake is a lot of fun, but can be quite heavy. The apple tart was amazing! \n\nWe arrived at the restaurant at 6pm and didn't leave until 10:30pm and i enjoyed every moment of it. There was even a lighting show last night, with the storm coming in. It made Manhattan looked like Gotham City. \n\nAmazing place!", "author": "Amanda J."}], "servesCuisine": "American (New)", "priceRange": "Above $61", "name": "The River Café", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Water St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/C_8aEbAvcCLhiqXn9QdWSw/ls.jpg", "@type": "Restaurant", "telephone": "+17185225200"}