{"aggregateRating": {"reviewCount": 1049, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-27", "description": "Ambiance: The best place to fall in love! It is most romantic at night when that subtle nighttime fragrance fills the air. You have a spectacular view of the lower Manhattan, all lit up with sparkling shadows cast onto the gentle waves of the Hudson river. \nYou will love it!\n\nLocation: Ideal, just beneath the famous Brooklyn Bridge in Brooklyn Heights, across from lower Manhattan and right on the Hudson River.\n\nMenu: Continental, American and modern and all superb!\nService: Elegant.\nParking: Valet (call ahead)\n\nThe River Cafe holds the best memories of the time my heart soared. We dined there at least once per month, enjoying the elegant menu, service and each other. This will always be a special precious place for me.", "author": "Jaye P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-18", "description": "Worth the drive and the calories!  The Wither Hills Sauvignon Blanc paired perfectly with the crab appetizer and Bronzino.", "author": "Eileen G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-08-28", "description": "I've been to river cafe many  times and I've always thought of it as a very nice place to get a diner. I've had 3 birthdays dinners there ,been many times there with my boyfriend. Today we have been rejected a service at this place because we came with the equipment . Me and my friends who are professional photographers came to river cafe to have a breakfast and talk to the clients. Only one of us was allowed to stay there . the other part of the team had to leave because the equipment is not allowed even on the terrace. Just because we obviously weren't able to leave an  expensive equipment outside or in the car we were literally thrown out of the restaurant like some trash in a very rude and unprofessional way. If you are not able to accommodate clients , at least be nice and apologize for that. They way we were treated is very offensive and I'll make sure to tell everyone to avoid this place at all costs since now. Very disappointing", "author": "Darina S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-28", "description": "I wish I could write something that hasn't already been said about this lovely and romantic place!  (I'm still going to try! lol!)\n\nTips:  as some of my sisters here have stated, if your man makes a date for both of you here it's time to step up your game and dress to the nines!  :)\n\nIF by chance you have any say in the time to make your reservation then by all means try to coordinate your time there with the day's sunset.  We had an absolutely heavenly one and it only added to our experience here!!!\n\nThe food was delicious and our waiter was kind and attentive. Dessert was delish! \n\nMy only tiny little issue was that about ten feet away there was a table of two couples where the women could not stop taking pictures (with the flash on!) of their food!  Ladies - here's a bit of advice: concentrate more on your men and be in the moment with them.  The looks on their faces made it seem like they weren't going to be taking you back there soon anytime!  You're welcome!\n\nClass dismissed!  :)\n\nPS - Hi Jimmy! (smooch)", "author": "Tomeka S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-19", "description": "Incredible.  The menu is fantastic and the view ls of the NYC skyline are breathtaking. The staff is attentive, and the decor is second to none.", "author": "John D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-27", "description": "Outstanding food and service. My girlfriend and I came here for her b-day. I made reservations 2 weeks in advance and while making the reservation they also took note that it was her bday. We arrived 15 minutes late and our table was still reserved for us. We were greeted with a smile by everyone and the doors was held for us. The view was spectacular from the sun setting to it becoming dark outside. Immediately after we sat down, the service never stopped. Not once did I have to call for a waiter except for the check. We proceeded to celebrate my girlfriends birthday with 3 course meals. I had the lamb chops and wagyu beef tartare to start, while she had the red snapper and oysters to start. Oysters were fresh, they were so confident in their seafood that they didn't even need to provide cocktail sauce. The wagyu beef tartare was amazing and presentation was beautiful. For our main courses, not a single flavor was missed. My lamb chops, simply cooked to perfection and was juicy meanwhile tender. The red snapper went perfect with the lobster brown sauce. The chef definitely knows what he's doing. We're not really dessert people but we had the brooklyn bridge and cheesecake. Her cake came with a candle so it was nice of them to keep note of it meanwhile making the reservation. We finished the night by getting the bill, many may say it's expensive but honestly it wasn't. I believe that every single bit of our experience was worth every dollar.", "author": "Dennis K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-04", "description": "This place is fabulous. We arrived about 20 minute early( we had an 8pm reservation). We were told that we could be seated immediately or wait at the bar for a better table. We sat at the bar and ordered a few cocktails. They were ok. About 30 minutes later, we were escorted to a prime table right by the window. Yes!!! This place is expensive because Of the view of Manhattan. Beautiful!\n\nI love the fact that they brought out a stool to put my luxury purse on. Nice touch!\n\nWe chose the 3 course meal because the 6 course chef tasting had a lot of unappealing dishes. \n\nFor appetizers we had the wild shrimp Oscar style. Wonderful!\n\nFor an entree we both had the lobster with the squid ink pasta. That was delicious as well.\n\nFinally for dessert I ordered the brooklyn bridge. It came with a candle and an edible happy birthday chocolate sign. Yummy!\n\nOverall this place is worth the price. The only thing I would change would be the chairs. They should be cushioned instead of picnic lawn chairs.", "author": "Ms C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-10", "description": "Best place for dating girls. Infinitely close to the Brooklyn bridge. Smaller than I thought, but has really good food. Lunch is so cheap, and I will go back again for dinner on May 9th.", "author": "Zeyuan L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-24", "description": "Had our wedding here back in 2013. If I could have a physically way to show magical River Cafe is it. Just breathing from start to finish.", "author": "Gardenia B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-09", "description": "What an experience!\nIt's expensive as expected , but worth it.\nYou feel good from the moment the door of the cab is opened for you.\nThe atmosphere , the food , the people , the service and of course the view.\nTry it for some celebration/anniversary  if 500 for couple it's huge on you OR just a romantic dinner if you can afford it weekly/monthly.\nEnjoy!", "author": "Igor Z."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-29", "description": "We were married at the River Cafe in May of this year. New York City has been our home for a number of years and we wanted to celebrate our marriage in the city we both love. After touring many event spaces in Manhattan and Brooklyn, the River Cafe was our last stop. My now husband and I were both immediately drawn to this beautiful and historic restaurant next to the Brooklyn Bridge.\n\nHaving our wedding celebration at the River Cafe combined many things that we both love: a beautiful and historic setting by the Brooklyn Bridge, wonderful food at a Michelin star rated restaurant and breathtaking views of the NYC skyline. Luke, the director of events was also amazing. As was Maureen the florist at the River Cafe. Highly recommend!", "author": "Diana D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-09", "description": "I'd like to say first that the chicken here is amazing! It was delicious! My main entree also came with waffles and each bite was sweet and delectable.\n\nSince it was a 3-course dinner I had to choose an appetizer first which I did not care for any on the menu. I asked for a garden salad but the taste of vinegar was too overwhelming so I left it untouched. \n\nThe main entree saved the restaurant from getting 3 stars. The dessert looked very pretty but I've had better chocolate desserts at other fine dining restaurants. And the view was excellent but I needed to enjoy each entree to deserve 5 stars.\n\nWe enjoyed our time despite getting 'looks' from other patrons dining there. Perhaps because we were the only couple there under 30. \n\nI thought it was nice they gave us a copy of the menu as a token to take with us. And the waitress/waiter were very formal until my boyfriend cracked a few jokes with them. They seemed to loosen up at our table which it was nice to see a genuine smile and engage in conversation. \n\nOverall, I'd come back here again if it wasn't for that 3-course requirement.", "author": "Zira C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-25", "description": "We enjoyed Sunday Brunch here. The views of the downtown Manhattan skyline, Brooklyn Bridge with the river teeming with boats and watertaxis shouldn't be missed!  Service is impeccable. And you feel welcome as soon as you step out of your taxi.  Brunch was a Scallop Ceviche appetizer with the Salmon main course accompanied by Bloody Marys!  Food was fresh and delicious and beautifully presented. And don't miss the Brooklyn Bridge Chocolate dessert!  Yum!  Put this special occasion restaurant on your list!", "author": "Debbie P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-10", "description": "Thank you to Kesia and everyone at River Cafe today for an amazing dining experience! Fabulous meal and excellent service!", "author": "Michael C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-23", "description": "i wanted to check out the river cafe for years and finally came across a last minute reservation on a crisp winter afternoon (blue skies but freeeeeezing). we hustled over just in time for our saturday lunch and i loved the entryway which was covered in fresh flowers even in the depths of winter. there was a live piano player and we were quickly seated in a table 1 row off of the window (though the window side seats were empty so we had a nice view). \n\ni was pleasantly surprised at the food. i had average expectations but found the food quality to be impressive. i had the crab and branzino both of which were very fresh and nicely composed. i also tried the the special pasta with truffle, which was excellent, and the duck breast which was my least favorite item mostly because of the strange texture of the spaetzle. \n\nservice was very odd here. they certainly have a formal air about them but we found the service to actually be quite poor. lots of empty glasses, dirty plates lingering on our table, and having to look for someone to ask for our check long after we finished. perhaps less pomp and more actual attention would result in a better overall service. \n\noverall a nice, special occasion restaurant with a great view.", "author": "Christina H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-28", "description": "Very good food, reasonable prices and proportions, would definitely return here and bring friends that they confirmed my opinion.", "author": "Cataleya B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-17", "description": "Delicious appetizers, seafood,steak and dessert. I am giving this place four stars because service was lacking; However the food was delicious and deserves five stars. I highly recommend you try the crap cake with avocado salad appetizer and, STEAK with mashed potatoes . Mashed potatoes are served on a bone and they are very TASTY ... You Must try it. Nice place to enjoy your dinner with a beautiful view. I highly recommend this place if u are visiting NY. I think that I will come back during day time next time I visit !", "author": "Espy M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-08", "description": "One word .. AMAZING! I will highly recommend this place to anyone and EVERYONE .. I came here to celebrate my  anniversary with my Gf, and the experience was just BEAUTIFUL .. The workers really make you feel  like royalty and very nice and attentive .. JUST GO ! You won't regret it.", "author": "Eric F."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-01-11", "description": "I have been to this place a few times, but I never had such a horrible time anywhere else than the river cafe  \nMy friend never been there before so he didn't have a jacket. A judge that was coming out offered his jacket to him. He's a Vet. he had a hat on that said this We wanted to sit at the bar and have 1 drink. So the maitre d came out and asked if we had a reservation for the bar\" I never went to a bar that you needed a reservation for. \nI didn't question it and we left . The judge was going to give us his jacket so we can go in. The very kindness of strangers.\n\n what I did do the next day was call  them and said I never was there before and wanted to know details about reservations etc. etc.\nAt the end of the  conversation she told me \"they do not make reservations for the bar \"\n\n\nThey are prejudice against Vietnam Vets- they didn't want us there because he was a Vietnam Vet. The reservation thing was clearly a lie. I would never go there again.", "author": "Chris B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-09-15", "description": "It's just ok. Not worth it. View was nice, but there are better. You can get the same view for less with a better atmosphere.", "author": "Kim T."}], "servesCuisine": "American (New)", "priceRange": "Above $61", "name": "The River Café", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Water St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/C_8aEbAvcCLhiqXn9QdWSw/ls.jpg", "@type": "Restaurant", "telephone": "+17185225200"}