{"aggregateRating": {"reviewCount": 1049, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-28", "description": "I came here for my birthday and had the prix fixe menu for $100. The view of the vast lit-up Manhattan skyline was absolutely gorgeous, which is why I give it 4 stars. The food was good, but not amazing for me. For the price, I expected a little more quality and attention to detail on the food. The view is really what made it an unforgettable experience for me. If any of you gentlemen forget to wear a jacket, they have extras there for you to borrow.", "author": "Yingtao Z."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-08-08", "description": "Lame.\n\nMy dinner was so rushed I don't remember anything.\n\nA RUSHED DINNER?\n\nWHAT TASTES GOOD ABOUT A DINNER AT AN UBER-EXPENSIVE PLACE THAT'S RUSHED?!\n\nGoodbye.", "author": "Lisa Q."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-13", "description": "The view and the food were great!  I really enjoyed the 6 course tasting menu, particularly the foie gras.  The lamb at the end was so-so.  \n  The service we received was excellent and we had a pretty funny waiter.  One thing I did not care for was how close the tables were put together.  Definitely recommend this place based on the food and the view.", "author": "Waylon K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-22", "description": "The view from the base of the Brooklyn Bridge is AMAZING. It's a bit stuffy, (jackets required) but the food and service are impeccable. I always have the wine pairings.  40yr tawny port with the cheese plate which always includes Epoisse and Humboldt Fog......OMG. Good for a special occasion or to entertain customers.", "author": "Joyce I."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-09-22", "description": "I will start off by saying that I am a native New Yorker and when I was younger my family dined here on many special occasions so this was not my first time at this \"want-to-be\" of fine dining. Although it has always been touristy with mediocre and overly priced food, it does have a good view but beware of their horrible customer service. The other night, I met my fiancé for a drink before attending a dinner party at a friend's apartment directly across the street. I walked in with a small shopping bag which contained an expensive gift to bring to the party. When I arrived, I was looked up and down and asked if I wanted to check my shopping bag. I said no that was ok. I went to the bar, where an expensive glass of champagne had been ordered and was waiting for me. After a sip, a self-important arrogant man, I am assuming the manager, came up to me and asked to check my shopping bag, which was on the floor in front of my bar stool. It was definitely not in plain sight and, again, a small bag but he knew that I had walked in with it because I saw the hostess whisper to him before he came over. I, again, said \"that is ok. I just came for a quick drink and I will be leaving in five minutes.\" He insisted on checking my bag and said that I couldn't keep it with me. I then said the bag contains an expensive item for a friend across the street and I will be leaving as soon as I finish my drink. He just stood there and I said \"I would like to enjoy my drink and then I will be leaving.\" I felt harassed. Well, that was apparently not good enough for someone who gets a high off of a position of what he perceives as power. Again, he just stood there and said that this is the owner's policy and then turned to the bartender to say \"the lady would like her check.\" I could not believe the nerve and the scene he was causing. Even one of the bartenders raised an eyebrow. What a joke. I have been to and frequent he best and finest restaurants in the city-and The River Café is not even in that category- and would NEVER be treated like that. The arrogance. All I can guess is that because they cater to tourists who may be arriving after a day of shopping, they do not want shopping bags in the dining room. I get that. But, a small shopping bag that is hidden beneath a chair? The restaurant was fairly empty and this is what he was spending his time on? It is clear that this twit and the owner Buzzy, who I have never heard good things about from those who know him, both need a good kick towards reality. The River Café is and remains an overpriced and puffed up established. Don't waste your money. It is no Daniel, Le Bernardin, Bouley, Eleven Madison Park, etc. They may not have a view but they have amazing food, excellent service and class.", "author": "Ali R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-10", "description": "DESSERT AND THE VIEW = PRICELESS!\n\nWe came because of the Sopranos and the Brooklyn Bridge dessert and of course the view. The chocolate dessert shaped like the bridge above is awesome.", "author": "Nina P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-04", "description": "Totally forgot to write a review for this place. Came here in the winter time and OMG I was blown away by the view once I walked in. I almost cried because I forgot to bring my camera. Anyway, I don't remember what night I came on, but it was definitely a weeknight. Came with a group of 10 people and were seated right away. I guess the only complaint was that we were right next to the kitchen where all the servers were coming in and out.\n\nSo we ordered two bottles of Rose to start with. For those of you who don't know, the dinner is a pre-fixe menu @ $100 per person. Our group ordered different things and I couldn't help but pick at everyone's food. I ordered the pear salad, which was good. Except, I'm not a big fan of goat cheese, but at a hundred bucks per person, it's hard to go wrong with anything on that menu.\n\nFor entree, I ordered the crisp duck breast. Now being Chinese, I'm use to eating those roast ducks hanging in front of the windows in Chinatown. I must warn that the River Cafe does not prepare well done ducks. I did see that they left it a little pink in the center. Anyway, I gave it a try and it was actually pretty yummy. Very juicy and tender. I also had a taste of the steak, which was okay, but I would probably prefer Peter Luger when it comes to that department. For me, the Branzino, which was sea bass was a win. While the menu does not state, the dish is breaded and fried, but it was still awesome.\n\nAs for dessert, I ordered the caramelized apple tart AND the chocolate marquis brooklyn bridge. I wasn't paying, so I decided to be greedy. I loved the caramelized apple tart for its taste and the chocolate marquis for its presentation. But you can't go wrong with either one.\n\nSo the bill ended up to be around.... probably $1500??? for the entire table with complimentary chocolates at the end. AND FINALLY...  go for the view. Go for the food. Go for the excellent service. Oh, did I mention go for the view? :)", "author": "Winny L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-12", "description": "I would return here without hesitation. I took my girlfriend here for her birthday. The food and service were both excellent. In fact, the only thing that prevents me from giving this restaurant 5/5 is the fact that while reasonably good, the desserts were a bit of a letdown after the quality of the meal preceding them.\n\nBig recommendations toward the Yellowfin Tuna appetizer and Duck entree.", "author": "Justin B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-25", "description": "This place was wonderful. The atmosphere is romantic and beautiful. The live piano playing added a beautiful touch to the atmosphere. I got the rabbit appetizer which was delicious. I never thought I'd enjoy eating rabbit, but this was amazing. Husband got to oxtail ravioli which was equally good. For mains we got the duck breast and the strip steak- both delicious. I had the thought before coming \"how can the food be that good, to justify the price\"? As I ate, I answered my own question. Divine.\nLastly the location is my favorite part of NYC it's worthy giving time before/after eating to walk around and enjoy the area. Loved every moment spent at this place", "author": "Hannah O."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-10-18", "description": "Romantic, beautiful, it's like heaven... except this restaurant has a very dark reality lurking beneath its pristine facade. I worked there for a couple days, but I didn't stick around when I found out that the owner hates Hasidic jews and advises the staff to lie to them and say there are no tables available when they come in. He is also a sexist and tells his female employees not to wear glasses because they should come into work looking like they're going on a date with him.  There are plenty of romantic spots in the city that don't involve giving money to this vile old man.", "author": "Mia F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-09-01", "description": "Everybody has heard of this restaurant, something that usually denotes it will be more hyped and less 'good' than anticipated. \n\nI have to say though that our visit was impeccable and enjoyable for my wife's birthday. \n\nWe mentioned we were HSBC Premiere customers and got complimentary champagne, oysters and amuse bouche. That was awesome. \n\nSecondly, I mentioned in passing (and not deliberately) it was her birthday. They went to extra trouble to help us celebrate which was nice. \n\nFor $100 per head we expected a nice place, great service, well put together food.  We got all of that plus more. \n\nRecommended.", "author": "Adam S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-04-09", "description": "My pal called to book a five-top for his wife's birthday in July.\nHe was advised that there was room for 5 at 5:30 or 9pm.\nWhen he asked if there were any other options, the booker paused,\nthen replied\"we can get you in at 7, but you'd have to leave by 9\"\nWe were stunned.\nThese friends chose River Cafe to celebrate milestone events.\nHe popped the question there, they had their first anniversary there,\nShe turned forty there, and now we were to gather to enjoy another \nmilestone birthday.\nWe'll be celebrating...but not at River Cafe.", "author": "Paul K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-11", "description": "The views which come to my mind when I think of NYC, this place has got those! By far the best ambiance \u0026 service I've experienced. My rating is one shy of absolute just because it didn't have enough vegetarian options... but well, you won't come to this place for eating anyways :)", "author": "Rushabh M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-29", "description": "I went there with my wife the other night.  Service was excellent, food quality was really good.  They gave us a booth with view of the water and downtown manhattan. \n\nMen are required to wear a jacket, I didn't know so they lent me one.  \n\nAll meals are prix fix but fully worth it.  Great for special occasions", "author": "Don C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-06-17", "description": "We held our wedding (both ceremony and reception) this past Sunday at the River Cafe, and it was a beautiful, flawless and memorable experience.\n\nWe're receiving accolades from our guest at how magical and special everything was from the setting to the food, to the service.\n\nIt's expensive, and if you're planning a large number of people, it's a stretch, but if you're having around 50 people, the Terrace Room is private, lovely, and elegant.  Guests danced inside and out, hung out under a tent outside on the terrace, gazed in wonder at the twilight and night skyline across the river, and raved about the food.\n\nI'm so happy we chose this venue. It's one of a kind and they are true professionals at pulling off a memorable evening.\n\nIf you're thinking of the River Cafe for your wedding, feel free to contact me through Yelp for some tips.", "author": "Matthew P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-09-07", "description": "I absolutely had such an amazing experience at The River Cafe; fine dining at its finest sans the stuffiness (which I really appreciated) you would expect to find at a place like this. \n\nMy husband I were greeted with \"Happy Anniversary\" by everyone from the staff that we came across. Service with a genuine smile, the attentiveness was such a breathe of fresh air. The food; simply delectable, delicious and deceptive...you would think that small portions wouldn't fill you up, but I am here to testify that my insatiable appetite was fulflled in every respect.  He had the Braised Rabbit/Dumplings app, I had the Shrimp/Tortellini app and we both had the Lobster special main course; whole lobster off the shell on a Corn Tamale-'nuff said.  I could never, in my wildest dreams, imagine ending a dinner date without finishing desert, what?! I had most of the Chocolate Sticky Toffee Cake, he had the Chocolate  Marquise Brooklyn Bridge, yumm yumm yumm!!!  All in all, experience was fanciful dining with a breath-taking view and wonderful service to boot. Please GO!", "author": "Kay H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-10-27", "description": "For a first time customer interested in dining there, the customer service was very poor. Maybe the representative Tracy was having a bad day, but great customer service goes beyond just your actual physical visit. Management should speak with her and how she is representing The River Cafe.", "author": "Justin R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-07-27", "description": "For both lunch and dinner, The River Cafe is the best and to my mind, the most romantic restaurant in New York.  Nestled at the foot of Brooklyn Bridge, the view is simply phenomenal. \n\nSo, on special occasions, including my passing the bar exam, birthdays or anniversaries as well as my friend getting her permanent residence card or \"green card\" if you prefer, we go to River Cafe.  The waterfalls last year is now gone (maybe thankfully) as it messes up the salinity of the ground and kills the flowers outside River Cafe. They have valet parking or at times, there are parking spaces just outside the restaurant or up on the street towards Grimaldi's. \n\nIMy favorite entree here is  the rack of lamb, while my husband loves the sirloin steak.  The last time we dined,  my friend had the branzino.  Everything tastes perfection, the fish is fresh and flavorful, the rack of lamb tender and juicy while the steak is also tender and melts like butter. For dessert ,the Chocolate Marquise Brooklyn Bridge caps the experience  I was tempted not to eat it and save the bridge but I realized that it is best to eat it before such a fantastic view and savor the moment.  Then, we headed out (after paying the bill of course) and walked on the landing by the water. Until, we heard a gunshot.  \n\nIt turns out Law and Order SVU was shooting an episode. :-) That made us laugh as we headed home, promising to remember that, indeed, there are moments that you can rightfully call a perfect New York evening.", "author": "Lara G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2010-07-17", "description": "Bottom line: if you like to be treated with respect when you are about to plunk down $400 for dinner, DO NOT GO TO THIS RESTAURANT.\n\nIf I stop one person from going to the River Cafe, I will be happy and feel that my job here is done.\n\nFirst let me start by saying, I truly believe that the maître d' has a chalk board in his little office behind the kitchen where he sadistically keeps track of how many women he causes to leave his restaurant in tears. Extra points for the partner who follows behind her saying \"I'm sorry honey! I really thought this would be a nice birthday present, please stop crying ... \" \n\nAnyway, my husband and I had the good sense to walk out of the River Cafe before ordering because we could tell it was going to be something we would regret paying for. I feel bad for people who have written other reviews saying that they stayed but wish they'd left. Remember vote with your feet! Please walk out of an establishment that does not treat you like they need or want your business.\n\nThe restaurant lives by some weird 1980's code where if you aren't \"somebody\" then you are \"nobody\" This is not the NY my husband and I know. We love going to restaurants in NY but we will never set foot in this restaurant again.\n\nIf you complain about the service you get they will practically walk you to the door and throw you out, giving a clear message, \"WE do not need your money, nor do we want your business, now or in the future.\"\n\nRestaurant rating: F (would rather eat from my dog's bowl)", "author": "Patty B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-03-06", "description": "Last NIght 3-5-2014 was a special night for my wife and I. I called up the river cafe to make a reservation for a bar table. When I got there I was greeted with respect The Valet did there Job. Hostess was More than Polite confirmed our reservations and than began to walk us over to the table. Then the reason for the One Star Happened We were all approached by the angry Manager or Maitre D. And told we were not able to be seated. That it was RESERVED Already . I noticed there were tables available and seats empty at bar.  .", "author": "Naftoli L."}], "servesCuisine": "American (New)", "priceRange": "Above $61", "name": "The River Café", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Water St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/C_8aEbAvcCLhiqXn9QdWSw/ls.jpg", "@type": "Restaurant", "telephone": "+17185225200"}