{"aggregateRating": {"reviewCount": 1049, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-26", "description": "I'm a big fan of this place.  Awesome, timeless location on Cobble Stone old town NYC street.  Great crowd.  Great food.  Excellent drink selection.  And the biggest plus is that it's not so much of the stodgy Wall St crowd, and it totally could be.  It's a great mix.", "author": "Jason M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2007-09-30", "description": "I'm always leery about restaurants with a gimmick, say maybe the fact that they rotate, or have a great view.  Well, River Cafe wasn't good just for a restaurant with a view, but was a genuinely pleasurable dining experience.\n\nWe started with the Ceviche of Taylor Bay Scallops, which was very enjoyable, as was the initial bread.  For the main course we had the Crisp Duck Breast and the Branzino Fillet, both of which were delightful.  The duck breast was an Asian fusion-type of dish, with a tangy and savory sauce.  The sea bass was interesting, topped with a crispy layer that was a nice counterpoint to the smoothness of the fish. \n\nAdd in the nice view, and all in all I thoroughly enjoyed my meal here.", "author": "Michael L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-08-24", "description": "River Cafe is one of a handful of top-end, highly anticipated, very expensive restaurants that I have been to that lived up to the hype and completely justified the price.  The food, drinks, service, pace of the meal, ambiance -- and lets not forget the views -- were all outstanding.  \n\nAs other reviewers have noted, the atmosphere is very casual and inviting and not too stuffy.  The wine list is pretty expansive and rather overpriced, but even one of the cheapest bottles on the menu was great and perfectly matched our meals.  The portion sizes are also very adequate and by the time you get done with an appetizer, main course and dessert you walk out feeling full but not stuffed.  And if you do feel a bit full, walk it off while admiring the wonderful garden and river views of the bridge and the lower manhattan skyline just across the way.\n\nFor a once-a-year or special occasion type of dinner, River Cafe is a perfect spot.", "author": "Jon M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-03-13", "description": "The River Cafe is located on 1 Water St. in Dumbo Brooklyn. On my second visit to the River Cafe-I got to celebrate Thanksgiving @ the River Cafe with my friend Mark and his family. It was truly a memorable Thanksgiving. I would have loved to take pictures while I was in the restaurant, but you just don't do that @ the River Cafe-it would be very tacky!-TRUST!\n\nThe River Cafe, is noted as one of the best restaurants in NYC for years. Since opening in May of 1977, The River Café has been the recipient of numerous awards including selection as one of the five best restaurants in New York by the French culinary guide \"Gault Millau\" The restaurant itself is on a barge right on the river. The view is phenomenal-skyline of Manhattan. Truly romantic ambinace topped off with superb service.\n\nSo what did we eat for Thanksgiving-NO TURKEY! It was FAB! Everyone had everything but turkey. The lamb was popular, followed by the Venison. Oh yea, my appetizer- Foie Gras, was extremely rich, but truly orgasmic!! The desert was as good as the main course-The Brooklyn Bridge Chocolate Marquise was to die for!\n\nThe River Café is truly for special occasions only. The quality of the food is worth the price! Yes, its quite expensive, but it is an experience you will never forget-very magical! Its extremely romantic, so couples I highly recommend it!", "author": "Maria F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-06", "description": "My bf took me here for my bday this year and i thought the place was extremely formal and nice. The view was awesome and its those one of kind experience bc its so expensive... i didnt like our seating arrangement( we were not next to the river or the piano...) but the atmosphere was really nice. The food i thought was alright - it wasnt spectacular... i had a salmon steak i believe, i cant say its the best ive had. If you want to bring someone there for the experience..its a great place bc u can see the bridge and the nyc skyline sipping wine... its memorable. i honestly think its overpriced though but i guess its for the experience.", "author": "Julie L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-21", "description": "Amazing service, terrific views, delicious food. We had the 6 course tasting menu with wine pairing, which was excellent. Each dish was stellar and wines were perfectly matched. Overall, this place is truly special and unforgettable. As someone else mentioned on here - its pricy, but well worth it.", "author": "Andrew C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-09-25", "description": "The River Cafe is exquisite. \nNutshell: Beautiful setting, great service, delicious food\n\nI tend to stick to Manhattan for dining but am so glad I made the trip over to Brooklyn. Came here one rainy night and the views (Manhattan, Brooklyn Bridge) were still mesmerizing.  Has a water-side table, and it was incredible to watch the swirling waters of the East River.  I love flowers, and was delighted to see the gorgeous arrangements everywhere.\n\nThe food was great (loved the olive oil too!). I had a deceptively simple (but delicious) salad, a citrus-tinged fish, and the Brooklyn Bridge (being a chocolate fan, how could I resist?).  Also had the delightful peach souffle.\n\nAlso, the service was friendly and welcoming.\n\nIf you have a chance to go, I highly recommend it!", "author": "Jane S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-07-27", "description": "We enjoyed a wonderful Sunday brunch at the River Cafe. Pre-planned as a surprise for my mother's 85th birthday, the River Cafe did not disappoint. Most all reviewers have commented on the view, so I won't elaborate further than to say--stunning. \n\nWhile the price was high, $55 per person for brunch--with coffee and tea being extra--the food and service were both exquisite. From the time we arrived to the time we left our every need was attended to. From the first person we met, the valet, to the last person we saw, the host, everyone was unfailingly polite and upbeat.\n\nThe mixed reviews I have read about the quality of the food are surprising as we had many different courses between the 4 of us and all were a taste to savor and enjoy. The portions are neither large nor small, but I could see how for the price so people would expect more.\n\nWe were treated, as many mentioned, to a small treat \"compliments of the chef\". Ours was a banana yogurt, served with granola and cream. It was served in an egg shell. Both unique and tasty.\n\nFrom there, brunch consists of an appetizer and a main course. My appetizer was smoked rainbow trout-- a fish that usually at best is a little better than bland-- however, it was juicy and very flavorful. My main course was the brazino fillet, again, cooked to perfection.\n\nThe atmosphere was not stuffy, or pretentious, but a nice mix of different people out enjoying a Sunday brunch--couples, families, friends. Some people were dressed in their Sunday best and others were casual. While there was a great deal of chatter, it was not loud enough that you couldn't enjoy the fine piano music.\n\nGive it a try, I don't think the River Cafe will disappoint!", "author": "Larry R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-09-13", "description": "It was our first night in NY after having travelled from CA.  We took a cab to River Cafe upon the advice of friends.  We wanted to have a quick drink and take in the view before heading out to dinner in Brooklyn.  We had on nice jeans, and I was in my heels.  We were not dressed for dinner, but to sit outside for a cocktail, we were fine.\n\nOne of the bartenders took our order and told us to take a seat outside.  There was only one other couple sitting outside.  They had room, and it was early.  \n\nWe went outside and were looking for a table when the very rude hostess stopped us and said we couldn't stay because there was a $25 min.  We said that's fine...then she changed it and said it is $25 per person.  It was obvious she was making it up.  \n\nWe left thinking that this is what they are talking about when they say new yorkers are rude.  And by the way....we ended up loving new yorkers...it was the tourists who are rude.\n\nI would never go back and will let people know that if they want to have a nice experience to go elsewhere.", "author": "Marla Z."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-10-31", "description": "Great location. Fancy enviornment. Went there in summer resturaunt week. Quite a bargain. Food is...well.. Dessert was memorable tho.", "author": "Tiantian X."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-09-05", "description": "Came here for my birthday. It's very pretty. The drinks are hella strong and the food was freaking unbelievable. Again I say this all the time but I love seafood just not fish and the tuna was like biting into something made by angels! Amazing amazing amazing restaurant. Go there!!! It's hard to find though.", "author": "Mina K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-21", "description": "Expensive, yes. Full of tourists, yes. A great experience, yes. It's an institution. It's romantic as all get out. The food isn't great but it's not bad, either. It's a special occasion joint and there you sit, under the Brooklyn Bridge with a breathtaking view of lower Manhattan. There's no other place like it in the world. It reeks of pretension because its pretentious. If you can't enjoy that don't go. If you're going to be grumpy because it's expensive and full of tourists, don't go. You want a glass of wine and a hanger steak there are plenty of swell places in Cobble Hill that won't cost you half (or Pete's Downtown, for that matter, just across the street.)", "author": "Laura T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2006-03-26", "description": "Ok...where to start...\nOK, yes..this place is PRICEY but a wonderful night out. romantic dinner, marriage proposal and impressive business dinner type of establishment..\nthe staff is PROFESSIONAL, the scene is PHENOMENAL and the food GOURMET", "author": "Miranda B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-04-22", "description": "Wonderful restaurant with amazing views! This place is perfect for a special occasion. We just went for our 1 year wedding anniversary. It is very expensive, so be prepared, but well worth it. The food is outstanding, so too is the service. Just make sure you have several hours blocked off for dining, you will need it. Nothing is rushed here, so make your reservation early and enjoy 3 hours worth of eating and drinking! If you make a trip to NYC, this is a must-do.", "author": "Rachel P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-08-20", "description": "If you favor sweat dripping from your forehead to add extra flavor to your dish I strongly recommend that you dine at the River Cafe.  It was a balmy 104 degrees on the day I frequented this establishment.  I was immediately seated in the area on the water where either to cut costs or having not yet being installed there was no air conditioning.  If having to wearing to a jacket to dinner isn't bad enough, I tried to remove my jacket to wring the sweat my shirt...the waiter made a b line to our table to inform me that I could not take my jacket off.\n\nNow for the food.  I really wish I could remember what the food was like because it was good but all I was doing was sweating while I was there.", "author": "Jon C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-07-26", "description": "I've been here once before, and went again with my family for RW lunch. The decor is a bit tawdry (nautical decorations surround the walls) but cute and unique.. The view of the city is almost the best it can get, both day and night. I wasn't too thrilled with their restaurant week dishes, but this RW family lunch doesn't do the River Cafe justice. I will, of course, come again.", "author": "Penny S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-04-15", "description": "If you are an avid follower of my (awesome) reviews, you'll see that I am  not into these upscale, Michelin blahtidy-blah restaurants. Regardless, it was a BIG day in my life and my mother suggested she treat me here in honor. How could I resist? We've all eyed this place and it's ONE OF A KIND view from the Brooklyn Ice Cream Factory or stood next to it whilst on line for Grimaldi's. It was pretty amazing. The view made everything taste at least 100x better. I had the crab bisque soup to start which was amazingly yummy and then the lobster lobster as my entree which was bizarre but definitely excellent. It consisted of a fancy lobster grilled cheese type sandwich and a lobster tail in some decadently rich sauce with fresh veggies. Everything was so rich. We couldn't move. Of course I was easily convinced to get dessert (it was a special occasion, after all) and ordered the chocolate brooklyn bridge. \n\nWe ate everything, including the Brooklyn Bridge. And it felt like it afterward. \nCan't emphasize how gorgeous NYC is from this angle...", "author": "Marin G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-02-04", "description": "This is one of the best experiences I've had. They require a jacket. But they have some old ones available to go thru the door and then you can take it off. Long sleeve shirts seem to be a must though. \n\nThe food is amazing and the view is awesome. They have a bar too which allows you to enjoy the view without spending too much. Both are great.", "author": "Gabriel L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-02-07", "description": "Went there for my wife's birthday. Everything was fine until the staff came over and told me that my son was disturbing others by listening to the iPhone. Only problem was my son was completely behaving himself and the volume was inaudible to him and myself even though he was sitting right next to me. Dinner was over and we were just waiting for my daughter to come out of the bathroom before leaving. The staff said he could hear it from across the room. This was not possible since the restaurant was completely full and the piano was playing. The staff said he was trying to prevent other people from complaining. I know kids can be annoying but I also think some people just hate kids and get jealous when they see a loving family having a good time. I spent several hundred dollars on the meal and this one staff was very rude. I told the manager about it and the manager apologized which was the right thing to do. When leaving the staff still insisted he could hear the phone. I realized it was not worth my self respect to argue with someone like this and let it be. I think every parent knows that some places are not kid friendly but something like this is not really fair because people should respect others boundaries enough to mind their business. Parents have enough to deal with than being discriminating against by snobby jerks who accost their children in public because their have issues themselves and feel the need to avenge their anger on decent people. Food and the setting is still amazing, I must be fair, but I guess the young unmarried childless staff need to be educated on dealing with families unless they want to ban children all together.", "author": "Scott A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-01-22", "description": "Quite possibly the nicest restaurant I've ever been to IN MY LIFE.  And not to sound like a snooty dbag, but I've eaten at a lot of nice places.\n\nThe view, of course, accounts for at least half of your bill, but you won't even notice because you'll be staring out the window at the gorgeous view.  Even if you're a jaded, bitter, why-do-I-still-live-here-when-I-make-no-money-and-I-constantly-get-touched-inappropriately-on-the-subway type of New Yorker, a table at the River Cafe will quickly transport you back to when you were a wide-eyed youngster, dreaming of moving to the \"Big Apple.\"\n\nThis was the long, tedious way of saying, \"be prepared to drop some cash.\"  The menu is prix fixed, which means that you have no choice but to spend $98 a head.  And if you're a boozehound like me, you're probably going to rack up at least $40 on a bar tab.  Just put it in the back of your mind--you're here now, and the next time you'll be able to afford to come back is probably in five years, so enjoy it.\n\nFor $98, you get your choice of an appetizer, entree, and dessert.  My favorite appetizers were the braised rabbit and dumplings, and the wild rock lobster.  For my entree, I had the branzino, which was like I died and went to fish heaven (FYI, in fish heaven, it doesn't smell like fish).  Everything was delicately plated and the portions, while not huge, were not skimpy.  \n\nOf course, you've got to end the night with the infamous Brooklyn Bridge chocolate cake, and then call a town car to take you home--tonight you're pretending you're a millionaire, and millionaires don't take the F train.", "author": "Amanda S."}], "servesCuisine": "American (New)", "priceRange": "Above $61", "name": "The River Café", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Water St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/C_8aEbAvcCLhiqXn9QdWSw/ls.jpg", "@type": "Restaurant", "telephone": "+17185225200"}