{"aggregateRating": {"reviewCount": 1049, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-01", "description": "This is my first review of The River Cafe, although I've been here several times. It's all about the view and the service and the food, in closely following order. I like the fact that the menu is entirely prix-fixe. It's not inexpensive for NY standards. \n\nIn my experience, the fish entrees are the way to go. From the Sea Bass to the Monkfish and the Branzino, they are all great. I ordered the steak this last time and while it was very good, this isn't a steak house. \n\nThe ambiance is a bit old-school, the view is very much one of a kind and the service is top notch. Bring your most romantic dates, partners, wives, husbands etc. PRO-TIP - if you want the view with out going all in for dinner, just go sit in the bar and order a drink, where jackets aren't required.", "author": "Shelton H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-29", "description": "Came here for lunch for mom's 50th. Food was exquisite and all waiters were friendly and attentive.  Valet guys were cute too!\n\nGot a free Brooklyn Bridge dessert on the house!", "author": "Mikayla N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-15", "description": "I celebrated my birthday here, and it was definitely an amazing experience. If you're entering via car, they have a driveway right to the door, and if you're driving, they have valet available. The whole place had such a romantic atmosphere especially with the little park they have beside them. \n\nWe did the 3-course dinner menu for $130 per person. The chef gave us a little tasting plate of fluke, which definitely opened up our palettes. The restaurant had nice bread options going around. Appetizers were Wagyu Steak Tartare and Scallop/Pork Belly, which were amazing! I definitely would order again. The chef then gave another tasting of corn ravioli and gnocchi with crispy asparagus, which were all so good. Our entrees were Niman Ranch Strip Steak and the Duck Breast. The steak came with bone marrow mashed potato, and that was a highlight on its own. It's definitely a nice size portion wherein my boyfriend even shared some with me, and that rarely happens! My duck breast tasted delicious as well; however, I was not a big fan of the sweet potato spaetzle that it came with. Now, on to dessert! We ordered the chocolate Brooklyn Bridge and key lime soufflé. 10/10 would order the soufflé again, I just wanted a whole pint of that graham cracker ice cream. I enjoyed all the elements of the Brooklyn Bridge, and it's honestly a very pretty cake for my birthday, but would try something else if we dine here again. You absolutely need to get it for your first time! The chef also gave us tiny dessert pieces including two chocolates, jelly, and a macaron. We had a delicious bottle of wine (Napa 2007) recommended by the sommelier that both fit our entrees. \n\nService was amazing from finish to end. They are very attentive to your needs, so you never feel like you lack anything. They always do it before you even think about asking for it. \n\nI would recommend that you book at 530pm like we did because that got us a table right by the window, and it's much more intimate before the dinner rush sets in. Plus you get to see the sunset as well. We didn't feel rushed at all, and we took our time with our meals. It was very romantic especially when night came, and the restaurant was lit with candles and the Manhattan skyline. A gorgeous view to accompany such a wonderful evening.", "author": "Stephanie Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-22", "description": "Amazing! From the ambience to the service and continues my to the elegant, taste creations from the kitchen, this was by far the best lean I have ever had. The view of NYC at sunset was awesome. Anytime we are in NYC we will return!", "author": "Courtney H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-06", "description": "All the worst parts of an expensive restaurant...pretentious and rude wait staff, expensive....plus bad service and mediocre food! The ceviche is the equivalent to getting hit in the face with a salty tomato. The benedict came with a waffle completely burnt to a crisp. Good view...but if this place is Michelin starred, they need to rethink their standards.", "author": "Shad A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-12", "description": "Great Views a window seat is a MUST.. I have visited 3xs... The First was a great day without question... the food was awesome and the service was top notch. Second was even better than the 1st, went for dinner and again a window seat, the food was great and the skyline in the evening was spectacular. The 3rd \"The Charm\" oh well, the other reviews ring true.. Went for late lunch 1pm, and the staff must have been out the night before. Very pushy, short and quick tempered. They were seemingly trying to flip tables like you were at Fridays. Well this experience has left a bad taste in my mouth and for the $$$ its not worth going because the unpredictability and attitude of the staff on any given day will ruin the experience.", "author": "James B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-03", "description": "We decided to visit this place just to see what's the hype in there. Very nice ambience, big plus because we were able to have a sane conversation without screaming at each other's. Weather was really cloudy so we couldn't see much out but I'm pretty sure during a sunny day, the view must be stunning.  The pear salad was super good, it was my favorite overall. We had Wild shrimp dish as appetizer as well and it was ok. The Lamb was nicely done and Tender.  The lobster was bland, I thought it was going to be freaking out of this world after reading the components but it wasn't. It had some sort of Tamal and green beans. Honestly I guess the price is more about the location and the view, maybe we weren't that lucky and picked the wrong plates but weren't impressed. Now Gramercy Tavern was for us by far way better than River and the price range is not that far from each other.", "author": "Alex S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-17", "description": "Excellent!!! The food is superb, service is 5 Star and you can not beat the view.  I highly recommend their Saturday brunch!  A must do in NYC!!!", "author": "Kara Fox T."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-12-26", "description": "sadly, rude from the beginning and non-responsive to cordial emails of complaint.  I would even say racist, though I haven't had enough experiences there to say so definitively. What is clear is that if it were actually good service in addition to good food and good city views then they would care about their customers enough to treat them all with respect, which was not the case with me.  very sad, and I'll be recommending against going here to my circles.", "author": "Yonah Lonah L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-18", "description": "Had a beautiful time here my boyfriend, celebrating his birthday. The staff here is so attentive and friendly, always available when you need something. Not a very big restaurant so seating is super limited. Make sure to call at least 2 months in advance. Food was good, but not the most amazing. The presentation of the food is on point. For appetizers, we got the sea scallop / pork belly and octopus. Entrees we got the squid ink pasta with lobster and lamb chops. Lobster was cooked really well but the ink pasta and sauce that came with pasta was very bland. The lamp chops was good, nothing out of the ordinary. Dessert we got their famous Brooklyn bridge cake and apple pie dessert which was incredible. Also, do not get the hazelnut bread..Stick with the regular bread. Overall very nice dining experience.", "author": "Meiki W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-01", "description": "We went here for a small 80 person wedding and it was gorgeous! Cocktail hour service was great with passed (delicious) hor d'oeuvres and servers always made sure you had a drink in hand \nService was impeccable during dinner service as well and all the food was cooked well also. Probably some of the best wedding food I've had but I wouldn't expect anything less from this place. Oh, and I also looooove all the fresh flowers and roses, and giant greenery (huge fiddle leaf figs) in the lobby and basically everywhere!", "author": "mi l."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-08-07", "description": "Meh..... \"the view is nice\" is about the best thing you can say, apart from that its an over price pretentious \"NY institution\".\n\nIf it was more reasonably priced I'd maybe rate it 4 stars (eg $200 pp with tip + one glass of wine etc) but the tables are too close together, the tables staff too intrusive etc for it to be considered \"fine dining\".\n\nIts menu leans towards \"seafood\" though from the dishes I tried the rabbit and the duck won the night.\n\nUnderwhelmed but pretty busy night though even for a Sunday so maybe its just me.", "author": "Dean C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-03-29", "description": "Went for an anniversary dinner. The views are great. The menu is prix fixe, $150 per person, not including tax or tip, so for two of us, the price tag came out to be well over $330. The service was great. The food was nothing memorable and the portion sizes were really tiny, and as I'm writing this right now a few hours after dining there, I have terrible food poisoning. I'm disappointed as this is a Michelin star restaurant and we paid so much money only to get food poisoning and for not even food that was worth it. Would not recommend", "author": "Elizabeth A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-12", "description": "If you are struggling go to this restaurant or not. Please stop thinking and just go! \n\nThe food is amazing and the service is even better. We were sitting in a inner table, which already has a pretty good view of outside but the waiter invited us to a window table as soon as one available. It feels like we just spend our anniversary in two restaurants. \n\nHaha I only wrote review for extreme satisfaction. Even though it is kind expensive here. We chose the 7 courses and it is 155 per person. We spend total 400 including tip and tips for the valet. If you are affordable, definitely should come to this restaurant, you will have an amazing night. \n\nLast but not least! Make a reservation! We called too late and only table at 10pm is available. Anyway, love here!", "author": "Yanlin Alice G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-24", "description": "Had the very good fortune to dine here for a second time this year, this time for Saturday lunch. We enjoyed crabcakes and tuna tartare as first courses and duck breast and branzino for main courses. Everything including the delicious bread selection, are truly outstanding. Like our dinner earlier this year, portions are generous although we did save room for dessert - a must. Yes River Café is pricey but so worth it as food is exceptional, service in a class by itself and of course - the view!  While this has always been a go-to favorite for special occasions, I'm finding reason to go more and more as the total experience is just so wonderfully satisfying!", "author": "Mona S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-02", "description": "I wouldn't give this place one Michelin star, but it was generally pretty good with nice views of the Manhattan skyline.\n\nFood:\nAmuse bouche - ok\nFoie gras and scallops - delicious\nCrabcake - ok (not as good as Del Frisco's)\nLobster with cavatelli - good\nCheesecake - decent\nPumpkin souffle - very good", "author": "Bo B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-16", "description": "Me and my wife came here to celebrate our Anniversary and because I didn't have on a fancy suit we were turned away. I was dressed nicely as if it was a job interview with a button down shirt and slacks but because it wasn't a suit I was turned away and they still charged my Credit card which I disputed with my bank due to these circumstances. They are VERY rude and don't care about you but I make my money and had about $700 saved for that night due to there prices but couldn't even enjoy ourselves", "author": "Derek F."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-12-30", "description": "I live in NYC and wanted to take my out-of-town parents here for their 50th wedding anniversary.  I made the reservation about 3 months in advance and requested a table by the window, letting them know way ahead of time that it was for a 50th (I called and also left a note on the OpenTable reservation). When we got there, they seated us elsewhere even though we ate very early and there was a window table open throughout our entire meal. When I quietly went to ask the maître d about it, I was taken aback by how much of a jerk he was, telling me that they \"needed to keep window tables open for regulars\" and that we would have to \"enjoy our meal wherever they put us.\" The immediate sharp attitude was a shocking bummer. The food was average for how expensive it is (over 700 for 4 people and w a wine pairing this would have been doubled) -- average and uninspired --  silly prices for average -- a glass of just-okay wine was $22, dumb. There was a greasy, sad piece of pork belly that one of us had as an appetizer and two of us had the lobster which was rubbery and mediocre, the duck was a C at best -- not one thing stood out as very good. One of the desserts was made up to look like the Brooklyn Bridge with waxy-tasting pieces of chocolate -- like food from a bad wedding caterer in 1988 -- embarrassing. \n\nI chose this restaurant to celebrate a milestone for our family and had much higher expectations than I should have. The view is nice (a view we ended up having to strain all of our necks to see), but in a city filled with incredible service and food, it's very hard to understand how this place is even remotely worth it. My heartfelt advice -- walk along the promenade for the view and then go to a place (that actually cares) to have your supper.", "author": "Kristy M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-13", "description": "I will say I was a little nervous to try this place after reading some of the reviews, however my husband and I had an absolutely wonderful dinner here. \n\nThe staff upon arrival were very welcoming and friendly. The servers provided exceptional service without being to in your face.  You can taste the work that goes into preparing such beautifully presented food. The Three Shells and Roasted Rabbit appetizer were incredible, and the Branzino and Duck Entrees are melt in your mouth delicious. \n\nFor dessert we tried the chocolate Brooklyn Bridge ( I mean... you kinda have to.. right?) and the goat cheese cheese cake. Both were delectable and even came with a \" Happy Anniversary\" note on chocolate. \n\nIt was truly a pleasant experience and I highly recommend coming here for any special occasion.", "author": "Krista D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-14", "description": "The River Cafe is dedicated place for celebration and special occasions. I had my birthday dinner here a few years ago . The view is magnificent and well worth trying to get a window seat . The pianist adds a lot of flavor \u0026 romance to your experience .\n\nThe price is expensive but again for a special occasion it would be worth it .", "author": "Notoya S."}], "servesCuisine": "American (New)", "priceRange": "Above $61", "name": "The River Café", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Water St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/C_8aEbAvcCLhiqXn9QdWSw/ls.jpg", "@type": "Restaurant", "telephone": "+17185225200"}