{"aggregateRating": {"reviewCount": 1049, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-12-25", "description": "Great view. Period. Overpriced, tiny servings, cramped dinning. I had to look accross at an 80 year old hag, with a cheep, strapless, low cut dress all night; yet when I took off my $800 Brooks Brothers blazer halfway thru a very warm dinner - I was quickly told I had to place it back on. This is sexist !!!", "author": "KJ B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-02-07", "description": "The nicest thing about this place is the doorman. Rude pretentious Maitre De, who suggested that I was \"inappropriately\" dressed to sit in the window???.  Smart casual was the code. So I wore designer jeans and a t shirt. Not really sure if it was the shirt or my tattoos that offended him.  Either way it was the quickest and worst experience I have had at any restaurant worldwide.  2 days ago we ate at Le Bernardin (3 michelin stars) and have Per Se and 11 Madison Park to go and I'm sure they will be more accommodating than that smuck.  Writing this having pizza at Juliana's and it's amazing.  Any wonder they have a better rating than you!", "author": "Dale-Kim S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-29", "description": "Great place, The food was out of this world  unbelievable view of the Brooklyn bridge and New York City at night", "author": "William M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-02", "description": "There is a prix fix menu for $100 (three course meal) and you can choose wine from a vast selection (the world is your oyster). Given the atmosphere and beautiful scenery, in addition to the consistency and quality of the meals, I'd highly recommend stopping by for a special occasion.\n\nAtmosphere \u0026 Scenery: This is a place where you go for a special occasion, whether it be for your parent's anniversary, birthday or engagement, make it count! I've been here for brunch (make sure you get the Brooklyn Bridge dessert!) and dinner, and it looks completely different (I'd recommend going for dinner). In the evening, you can take pictures in front of the restaurant where the landscape is beautiful with your family or significant other and the view of the bridge if breathe taking. And to tip it off, there is a piano man who plays light jazz to set the tone. The only downside is that men have to wear blazers but it's not a stuffy restaurant. No ties or full suits needed.", "author": "Daniel K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-23", "description": "Spectacular view of Manhattan. Extremely romantic settings, and very good food and service. It's a beautiful, classy and upscale place. Worth going at least once for the experience.", "author": "George T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-31", "description": "I've been to The River Cafe on several occasions, all of them special events -- Valentine's Day, 4th of July, and last year we held our wedding rehearsal dinner here. It's a lovely, elegant venue with a stunning view. And yes, it's expensive. I have to say I'm not a fancy-food kind of gal. I don't want or need caviar or foie gras (in fact I had to just check to make sure I spelled \"foie gras\" right, because I care so little for it). So that's what really keeps me from giving the River Cafe 5 stars -- I find some of the menu too pretentious. But the ambiance is fantastic, and the menu we picked for our rehearsal dinner was a big hit. You can also always win me over with decadent desserts, and The River Cafe sure knows how to do that. I about fainted with delight from our chocolaty dream of a dessert.\n\nThe staff was very polite and helpful. When one of our guests revealed that she didn't eat fish or red meat (which were our two entree selections, of course -- doh!), the staff was very understanding and prepared a special dish just for her, a dish that she loved. They were also very nice in dealing with one of our other guests, who seemed to complain about every other thing (unnecessarily so, I might add) -- from the to the temp of the room (no one else had a problem with it), to wondering why he couldn't get a special dish too, to the fact that they were serving red wine with the meat and he wanted the same white wine he'd had with the fish. (He was certainly having enough WHINE with his dinner, let me tell you...) The staff was excellent and highly professional in dealing with him, whereas I personally was about to throw him over the pier's edge.\n\nAll in all, I definitely recommend The River Cafe for special events. They helped make our rehearsal dinner a success and a night to remember fondly. I wish it wasn't so expensive and that their food was a little less highfalutin, but the view and service can't be beat. Bon appetit!", "author": "Cici P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-09-11", "description": "River Cafe has a fantastic location and view available no better anywhere in the world.\n\nThe food is expensive - and the quality does not match the price level. A Michelin-starred restaurant should deliver something unique - and so does RC unfortunately not.\n\nThere is much noise in the restaurant and their air conditioning is of a very poor quality that makes you freeze and sit in windy conditions.\n\nSeveral guests left the restaurant because they froze and was afraid of being sick.\n\n\nThe toilets are not in an expected standard - I have experienced more public toilets in NYC parks that smelled better and was in a better standard than those at The River Cafe.\n\nSo all in all, the surroundings and the food a disappointing experience, but the view is spectacular and unique.", "author": "Per Skovgaard H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-10-13", "description": "I went for Saturday lunch. The restaurant itself could use updating but the view was beautiful. The service was great. The price is higher then it should be and honestly they need to freshen up their menu, no one wants to go out to eat and have an amish chicken...\nMy husband had the steak (excellent), I had the lobster and lobster (ehh). The dessert menu was not tempting at all and the bread to start with was cold and unappetizing. I also couldn't find a starter on the menu that sounded good. This place needs an overhaul.", "author": "Jaime B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-12-20", "description": "This is the kind of experience you think that restaurants used to be like back in the good ole days....you know, where the waiters treat you like you are their only customer in the whole world, where the food throws you back into your seat, and where the ambiance makes you feel like you never want to leave.\n\nYou already know from the other Yelpers that the food is amazing. I agree. But add cute waiters to what I described above and the amazing food and wines...and voila, you've got quite a memorable experience. And the view -- WOW.\n\nSo, I went to River Cafe as part of a huge group. I was expecting some of their legendary quality to go down -- because after all, how perfect can you cook 70 filets mignon at once? Well, they've got it down to a science because everyone loved their meals. And because the group paid, I don't know how much my particular meal/wines cost....but whatever it was I'm sure it was worth it! \n\nIf i were to offer a tiny criticism, it would be the temperature. I think I had the one seat in the outdoor [closed] tent that had a cold vent right on her face....but oh well. It didn't break my experience in any way. In fact when I complained to the waiter he offered to turn it off. I declined because I didn't want everyone else to suffer in the heat, but I thought it was a nice touch.\n\nEveryone -- enjoy.", "author": "Flavia A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-08", "description": "Great place, really lovely. Really good food. Really great service. The two kinds of fois gras was one of the best dishes ever. Mushroom Wellington was really good. Duck was good. Red cabbage slaw with duck was great. Branzino was good.  \n\nService was REALLY, REALLY good, extremely attentive and friendly without overdoing it. \n\nGot a window table without asking. We got there at 11:45 am on a Saturday. Great view. Beautiful restaurant. \n\nGot the apple paté for dessert. It was good, but nowhere as good as the little tastes they \"give\" you. Oh, and the little tiny appetizers at the very beginning, compliments of the chef. DELICIOUS! Chilled melon soup and teeny tiny bacon fig sandwich. WOW!\n\nNot cheap, but worth it.", "author": "Serena U."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-26", "description": "My bf and I came for dinner and the overall experience was pretty good in terms of food and service...  wouldn't say excellent though.  We both ordered the prix fixe menu and ordered an extra appetizer of oysters.  His scallop app was delicious, while my mackerel was decent, and the oysters were as expected. For our entrees, we had ordered the lamb and the duck, both medium rare.  His came out perfectly tender and juicy, while my duck came out almost well done and chewy, which was very surprising.  It seems like the restaurant has a tendency to overcook the meat.  I had to return mine, and the next one came out better, but still wasn't fantastic like the lamb.  I have definitely had much better duck at other restaurants.  For dessert, we ordered the pistachio semifreddo and the key lime souffle.  The semifreddo was really good, but the accompaniments were both too tart and sweet as was the souffle.  The views of the restaurant were beautiful of course, and it was cool to see the boats passing by.  So, it was a pretty good dinner, but not terrific.", "author": "YJ A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-15", "description": "Beautiful restaurant for a special occasion! Loved the gardens \u0026 the atmosphere!  I would love to come back here and think it's a great place to experience NYC. Happy to see vegetarian option. Delighted with my first Michelin star restaurant.", "author": "Sally D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-12-16", "description": "I recently held a private event for my company here. Walking out extremely disappointed is putting it mildly for what we experienced. I was aware before walking in that this venue has a reputation of being pretentious and rude.  Well, I would say they 100% back up these accusations. This is going to be a long one!\n \nThis all started off great!  The planning stage was fine, the private events coordinator being easy to work with and such.  We mentioned we wanted a DJ and their usual DJ contacted us right away. \n \nI arrived about 20-30 mins prior to my event to set up the seating cards and to make sure everything was set up according to plan.  Everything was pretty much perfect and the waiters and waitresses were helpful in making sure I was happy with everything thus far.\n \nHere is were it starts to go down hill.  Guests arrive and we are having our cocktail hour.  I am approached by one of the waiters giving me a heads up to start having our guests take their seats.  I ask for a few more minutes since we had guests still arriving.  Not even a minute later, I am chatting with my boss and was approached again.  Both myself and my boss ask again for a few more minutes for a few people to get settled.  Without warning, they being telling our guests to sit down.  I did not give the ok for anyone to begin doing that.  It was embarrassing and very rude.\n \nMoving on to the main event..dinner.   A number of my guests were disappointed in quality and serving size.  For the money that was spent, I was expecting top notch and what we received was something I could have paid a lot less for in a place where we would have been treated a lot nicer.\n \nHere is the real kicker!  According to the contract the party was to end at 11:30PM.  Also mentioned in that same contract was the option to extend the party and the pricing was listed for each allotment of time.  We are in the middle of dancing and enjoying the music when all of a sudden everything just stops.  I look over and the DJ left his table.  It looked like he set the last song and disappeared.  They begin to shut the lights on the terrace outside of the private room.  Then they begin to take the patio umbrellas in!!  I look at the time and it is 11:30PM.  My boss and I were so upset.  No one had even approached us to ask if we would like to extend the party.  Everything was just ended so abruptly it was mortifying.  Everyone was looking around and asking what was going on.  We were being rushed out!!  I ask for the bill and my boss asks if all parties here end so abruptly.  His answer was \"well 11:30PM was your end time and no one expressed they wanted to extend\"  My boss's reply was \"Well we were never even asked, we were in the middle of dancing and things just shut down\"  No one was sitting on their watches, we were enjoying the party!!  I have hosted events at other venues where I was approach about 15-20mins prior to the expected end time and I WAS ASKED if I wanted to extend since people were enjoying themselves.\n \nOne of waiters then proceeds to announce in the middle of the room to please proceed to the front if anyone needs a cab.  I mentioned my car was valeted and he took my ticket before I even had a chance to get my coat.  We had people visiting from as far as Dallas, TX and I felt terrible that this was what they traveled for.\n \nThen to end our night I finally make my wobbly way in heels down the cobble stone walk way to get my car to see it drive down past me way down the driveway, what was the point of even valeting when I have to go chase my car down their driveway.  I am assuming they did this because they were allowing cabs to come in and I am almost hit by one trying to get to my car.  You have a bunch of valets with vests and walkie talkies directing traffic but yet it was still a mess. I then received more attitude when I approach the valet for my keys.  UNBELIEVABLE!", "author": "Alex V."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-08-17", "description": "This is mostly about the view. The food is mediocre to bad. The check hurts.", "author": "Stephan H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-11-17", "description": "As a native NY'er this establishment was always one of my favorites, until NOW- The arrogance, the nasty Hostesses and Door man were horrendous-\nIs ok to turn people away with no jacket, but 6 of us were well dressed, extremely good looking- lol and coming from a wedding on a Sat night and were turned away- \nNot only did they keep us waiting over a half hour, but then decided they didnt have room for us- (one of our party left, as he didnt have a jacket, nor would they loan is one- thats ok- he couldn't stay anyway)\n\nThe Bride and Groom were on their way when they told us they couldn't seat us at an empty bar- She was so looking forward to a cocktail here- \n\nWe were told by the young, unpolished hostess that it was a MIS- Communication-\nTHink about where you want your money to go before booking your reservation-\nThey should be ashamed of themselves- \n-\nNative New Yorker-", "author": "Francesca c."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-08-02", "description": "Took my wife her for her birthday after reading it was voted one of the most romantic restaurants in the United States.  The place says that 6-8 people propose there a week so you know if has to be good.\n\nThe Food: Very impressed with the use of flavors.  Ceviche with cilantro sorbet, very delish and unique.  Highly recommend the tasting menu.  Foie gras two ways was also very good.  We requested it on the tasting menu because I had read so many good things about it and it did not disappoint.\n\nThe Crowd: Jackets are required and most people wear suits either with or without a tie.  I wore a jacket with nice jeans.  Definitely wear a collared shirt.  FYI do not wear ripped or torn jeans if you are going to go that route.  The crowd is a bit older, like 45 plus.  Lots of people celebrating birthdays.\n\nThe View/Setting: Views are amazing, best in NYC.  Right on the water, literally.  You can watch the sunset as you are eating, pretty cool.  Outside the trees are lined with lights which makes for a very romantic setting at night. \n \nThe Price: We did the six course tasting menu for $125 a person and had quite a bit of wine including a bottle for $100.  As a result, our total bill was around $400.  Epic meals are not cheap.", "author": "Keith R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-19", "description": "The River Cafe is the best restaurant I have eaten in in decades.  One of the best in the world.  Simply great service \u0026 food.", "author": "Wendy S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-07-19", "description": "It had been many years since we went back and although the view is still the best there is to be had, the setting the most romantic in the five boroughs, the food quality was a disappointment. Between us we started with the Wagyu Steak Tartare, Hudson Valley Foie Gras and the Scallop and Foie Gras. Overall the flavorings were bland and although the presentation was fine, they didn't 'pop' nearly as much as the fireworks that took place outside. Our main courses consisted of the Rack of Lamb, the Duck Breast and the Lobster Wellington and again, everything was presented nicely, but everything lacked the pizzaz of a kitchen trying to find something to entice with. The desserts were cloyingly sweet and also uninspired: the mixed sorbet plate was clearly not anything thought through. Too bad, because you would hope that the exterior views should at least match the interior when it comes to New York par excellence...", "author": "D E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-11-23", "description": "The price is fixed at $100 for a set of appetizer, entrees and dessert. Wine and coffee will cost extra. The atmosphere is perfect for any special occasion like anniversary or date. Dress code required.", "author": "ShihYa H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-04-24", "description": "If I could give this establishment zero stars, I would.  This restaurant has been on my \"must dine at\" list for months , but after my horrible experience today (4/23/2016) I will not even think about returning , I will not recommend to any of my friends. \n\nMy friend and I were looking forward to having a glass of wine here after dinner.  As we approach the main entrance, another party was also entering. This groups was much older, men and women dressed in suites and kitten heels . This group was allowed to walk straight past reception without so much as being questioned. My friend informed the receptionists that we were looking to sit at the bar. One young lady  then proceeds to pick up the phone, places it to her ear and then turns to us says \"unfortunately , the bar is full right now we can't let you in.\"  Mind you she NEVER OPENED HER MOUTH TO SPEAK TO ANYONE ON THE OTHER LINE, SHE DIDN'T HAVE A CONVERSATION WITH A SINGLE SOUL. Is she psychic? Who knows, maybe she has super powers. I just couldn't figure out how she got an answer without asking a question. If this is their tactic of turning away guest , next time try actually pretending to speak into the phone-__- . \n\nWe were turned away because of our \"image.\"\nWe are both \"Brown,\" we were both dressed \"casual.\" In other words we didn't \"fit\" the pretentious standards that River Cafè upholds. \n\nI am disgusted and disappointed with my experience here , it's 2016 and racial profiling is still a common practice in public service. Those two young ladies at the front desk should be ashamed of themselves. If the bar was \"full\" then you offer another option, like a table. \n\nSide note, as we walked out completely baffled, we looked towards the bar and it was EMPTY!!!!", "author": "Ashley L."}], "servesCuisine": "American (New)", "priceRange": "Above $61", "name": "The River Café", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Water St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/C_8aEbAvcCLhiqXn9QdWSw/ls.jpg", "@type": "Restaurant", "telephone": "+17185225200"}