{"aggregateRating": {"reviewCount": 1049, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-26", "description": "Thank you River Cafe for an experience of a life time. You guys, this is something you can't skip\n\nThis Cafe is set in a stunning location, right underneath the Brooklyn bridge. The only thing that may be better than the food is views. People from all over the world come to take pictures here. It is an \"Instagrammers\" paradise.\n\nThe food, you can't beat. Perfectly cooked lobster. Perfectly cooked lamb. And the appetizers are wonderful. I reccomend the \"fois gois\"...you can never go wrong with a touch of France in your dinner.\n\nThe desert is a work of art, all across the board.\n\nFor the drinks. The wine list could be better for the price. However I loved the wine they did have and I loved the Sommelier, again, I do think they up charge the wine a little too much. If you go with your family, anticipate a high price. 150 for the cheapest bottle and I wouldn't expect a dinner lower than 800$\n\nEnjoy this place guys, it is not to be missed.", "author": "Ford M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-04", "description": "Gentlemen, attire is strictly enforced. \nCame on friday evening and everyone is well groomed and elegantly dressed. The waters are very friendly and accommodating. I was very pleased with all the dishes. A beautiful display and full of differwnt flavors. Nothing too overbearing. Definitely a romantic place and expect to stay for atleast 2 hrs they do not rush you out the door which i love. Thank you river cafe for making it a night to remember for the bday girl.", "author": "Theresa N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-03", "description": "Every girl has her dream of getting proposed after a perfect meal at a perfect place. The River café is one of them. I dined in this place with my mom and I thanked her for giving me amazing time. \n\nBefore entering the restaurant, i was amazed by their garden decorations. Lightings were romantically arranged and the flowers were beautifully ornamented. We sat by the window area for dinner, looking at the downtown area of Manhattan, the river, and brooklyn bridge. The view was so beautiful. My mom and I looked  outside the window for a long time and enjoyed our drink. \n\nI ordered ox tail ravioli with truffle for starter and lobster for the main course followed by the Brooklyn Bridge dessert. Honestly, ox tail ravioli was some what mediocre, but the lobster and desserts were AMAZING.", "author": "Jane H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-19", "description": "Oh man! River cafe was absolutely having the best view in Brooklyn and probably in all Manhattan area. Looking outside the window, you got the full view of Brooklyn bridge and the other side of the city! How nice and how chill!\n\nMe and my friend were having a relaxing brunch here on a sunny Saturday morning. River cafe offered a prep fixe brunch set with one appetizer and one entree, apparently with many more complementary dishes that would send you full. Out of all their dishes, I enjoyed the grilled duck the most. You must try the Brooklyn bridge dessert which was literally the bridge made of chocolate with raspberry sorbet on the side! Absolutely my favorite dish for the day!\n\nOur waiter was also nice enough to bring us complementary wines for pairing. I would definitely coming back for their dinner tasting!", "author": "Elaine H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-11", "description": "Place is really nice and the service is great. The view was very good as well. Ok here's the part that most people need to know since the place is ok the higher end there's a fix price which means you'll pay $125 per person for a three course meal. I think it's a good deal for anyone that wants to eat three meals at a high end restaurant but for those who only want to get main course then I prob wouldn't say this is your first option. This place however should be your first if you want good service and food and view and a classy setting. FIY guys need to wear a suit or a sit jacket and shirt.", "author": "Shanel L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-09-27", "description": "We went to this restaurant tonight. We wanna take a picture in front of the restaurant before dinner. One of waiter came out and stopped us. He said we are not allowed to take a pic here. I said \"we are going to have dinner here. And we just want a pic. He said no. Not for professional photo shooting use. I am not sure why he said like that. May be we are not  American? ?It really made us  unhappy. And finally we decided not have dinner here.  P.S.  The waiter yellow hair, medium height and responsible for the customers' parking, I think. the worse is he yelled at me.", "author": "Sasha Q."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-12", "description": "I visited the River Cafe as a member of a wedding reception held there in October 2016. The service stood out as possibly the highlight of the event, as it was spectacular. The food was also some of the best I've had anywhere. \nAppetizers were miniature crab cakes, fried oysters, pumpkin pastries, and several other options. All were presented beautifully and were delicious. I almost spoiled my appetite.\nMeal was five courses with a pear salad topped with caramelized bacon to start things off. Amazing balance of flavors! The seared sea scallop was also near-perfect, but could've been a bit larger. Sauces accompanying the scallop were light and delicate, not taking away from the taste. The beef tenderloin main course was the epitome of what to expect from a Michelin starred restaurant. It must have been sous vide prepared, as the level of preparedness was ideal. The Brooklyn Bridge dessert was also amazing. \nI'm probably on the hook to bring my wife here next time we visit Brooklyn, as our memory of this place demands it. You'll love the scenic view of the river and the Manhattan skyline. It's to die for. Enjoy!!", "author": "Jim C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-05", "description": "So like most of the reviews for this place have said.. it's expensive but totally worth the experience. The food was to die for. As a massive seafood lover the choices were amazing and every dish delicious. I took my 10 year old son and the staff treated him like he was a king. Even bringing him mock tails and  ice cream with a special message on the chocolate. So special and such a beautiful night.", "author": "Koby S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-20", "description": "worst experience ever！I'm curious how this restaurant got Michelin star with that captain throwing attitudes at customers", "author": "Danjie Z."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-31", "description": "What a beautiful, beautiful spot overlooking Manhattan.  Magical.  The restaurant of dreams. I've only been here for lunch once with my mom, grandma, and aunt years ago.  It was not quite what we expected to spend, so we shared an appetizer or two.  And so, I can't speak to the food as much as I might wish, but it has been long on my list to return.", "author": "Laurie V."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-08-13", "description": "The food was good and the view was great; but ultimately we found this restaurant to simply not worth it with so many other options available. \nFor our three course, I had the steak tartare and lamb with a dessert while my wife had the rabbit to start and the halibut for her main course. My wife and I are not heavy eaters, but after the meal was over, we were still hungry and even stopped for a slice of pizza in the way home. \nOf a. Offer concern for me was the service. With two notable exceptions (the hostess as well as who I assume as the sommelier) everyone seems plastic. As though what they were saying were scripted out for them and they were just going through the motions. Ultimately this is the reason I couldn't fully recommend The River Cafe.", "author": "Patrick M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-09", "description": "My daughter and I came here for Brunch on Sunday. While our reservation was for 1:30 p.m., we actually arrived early because we walked from Midtown over the Brooklyn Bridge, so gauging the time was dicey.  No problem! They sat us right away at a window seat.  Fortunately, 11:30 a.m. isn't a high-demand time.\n\nWe both ordered a specialty cocktail and then the Oysters (for her) and the Soft Shell Crab special (for me).  Prior to ordering, we received cute little cut out egg shells filled with an oatmeal/granola mixture and a Zucchini bread loaf.  Yummy!\n\nFor the entree, we both ordered the Black Truffle Omelette and I ordered a glass of white wine.  Everything was wonderful.  Yes, it is pricey.  But with the awesome views, I was happy we had the experience.  My daughter now wants to come here for her Birthday Dinner!", "author": "Diane E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-25", "description": "This restaurant was a great experience from beginning to end!\n\nMy man and I, Mr. Holipsism, were greeted and served with a smile from the moment we walked into the door. The service was excellent and the host, whose name escapes me but his smile didn't, was a gentleman was vast knowledge of the menu and provided us with great choices. \n\nFor appetizers I had the \"Oscar Style\" Pacific Blue Wild Shrimp, crabmeat, White Asparagus with citrus Maltaise sauce. My man had the sea scallops Foie Gras. Both were mouth watering and we both shared from each other's plates. \n\nFor the main course I had the poached Nova Scotia Lobster, squid ink cavatelli pasta, lobster infused marinara, lobster claw and spinach gratin. My man had the Colorado rack of lamb, grilled Merguez Lamb Sausage, fondant potatoes, mint and mustard seed glaze. Both the lobster and the lamb melted in your mouth. He ordered the lamb medium rare and it was as smooth and tender as butter. The lobster had my eyes rolling into the back of my head and my toes curling!\n\nWe were both celebrating our birthdays, which are 2 days apart, and for dessert I had the Chocolate Brooklyn Bridge and he had the Apple Almond Pave'. Both were delicious and excellent and the staff was extremely friendly and attentive. We even talked with the host about how they were able to renovate the restaurant so perfectly after it was destroyed due to Hurricane Sandy. \n\nI'm giving the highest on Yelp but, if I could I would give it 10 out of 10 stars. A lot of of expensive 5 star restaurants don't live up to high prices they charge for their meals but if you have to experience one 5 Star restaurant and pay your hard earned money for a special occasion, make this your restaurant of choice because you will definitely get your money's worth and feel treated like a million bucks!\n\nFour thumbs up (from me and my man)\n\nEsther E. Evans", "author": "Esther E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-25", "description": "I came here for an anniversary and had a wonderful experience. We were seated next to the window, with a lovely nighttime view of the Brooklyn Bridge and the lower Manhattan skyline. The cocktails, while expensive, were terrific. And although it was crowded, the atmosphere was very relaxed and quiet. \n\nThis is not a cheap restaurant; you are going to pay a hefty sum. However, it is all worth it. The appetizers (Scottish salmon and rabbit lasagna) were delicious and perfectly prepared. The entrees (rack of lamb and duck breast) were just as delicious, savory, and satisfying. It is difficult to describe just how good the food was. Nothing can substitute for actually tasting it.\n\nThe River Cafe is definitely a great place for a special occasion and, though you will spend a good deal, you will find that it was worth it.", "author": "Brendan B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-30", "description": "I had very nice dinner here ! View from restaurant was amazing and everyone working here was very kind and nice, food and presentation were excellent!", "author": "M T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-20", "description": "This reseraunt had a lovely entrance and it had the most beautiful view of New York City. They had a good bar with very nice people. As I got my family and friends we finnaly sat down and  looked at the menu. I already looked at the menu online so I knew what I was ordering. I had the strip steak with a side of potatoes.\n\n     The steak was great but the potatoes were really salty. I told the waiter that it was really salt so he got me a side of mash potatoes. Everything after that was fantastic the view, the dessert. I would recommend it  for anyone who really likes food and loves the view of NYC.", "author": "D. B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-15", "description": "Honestly, I can't imagine anything better than this. \n\nLet's just assume that you can imagine how great the view is. It's unrivaled. \n\nThen you add in the fact that every member of the staff operates under the highest level of service and kindness and you can tell that they genuinely enjoy what they do. Shout out to the mâitre d, Josh Brown for knocking it out of the park!\n\nSo then last but certainly not least, the food is out of this world. Chef Steelman and his team definitely deliver on a delectable menu that leaves you with the highest level of satisfaction possible. \n\nI recommend everything. But especially the fois gras-- prepared to the chefs preference that will leave you wondering how you'll ever have something more delicious. For dinner, if you don't go for the tasting menu, the Branzino and the New York steak will rock your world. Oh and start off with some caviar because you only have so many chances to taste truly astounding caviar and the River Cafe is one of them. \n\nDessert is a whole other delicious ball game and it's impossible to go wrong. but the Brooklyn Bridge chocolate marquise is both beautiful to look at and eat. \n\nKudos to Buzzy Okeefe for being the man and essentially producing the best chefs the world has ever seen. Chef Steelman certainly is!", "author": "Lauren D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-03-10", "description": "I took my wife here for her birthday, we were in NY on holiday and this was following a Broadway show. \n\nI'll start with the good. The view is beautiful, albeit it was a rainy day. The food was nice, not spectacular but 4* for sure. \n\nNow as to why it got 2*. Firstly I got a call to see if I'd be able to arrive earlier, i got the latest reservation of 10:30 on open table since it coincided with the show times. On arrival I see why. There were about 3 tables finishing up and soon enough we were the last table there. Throughout the whole meal i felt rushed to the point that my wife noticed and it dampened the mood. \n\nAt various points where some privacy was appreciated there were people hovering, not to serve but to get us whatever we wanted to get us the hell outta there. They couldn't have given us and collected the check faster.\n\nOn exiting I even regretted leaving only 10% tip given the farewell received. We've been going to many nice restaurants and this fell short off the potential. \n\nAll in all,  I bet the service would have been better at an earlier time, but then why offer the time to book? I could have gone uptown somewhere in Manhattan for a view at that time and it'd be full. The food was not worth this at all,  and if i wanted that view there's an ice cream parlor and a seaside bench next door that'd have been just as effective.", "author": "Marcus S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-15", "description": "Overall: one of the more special and unique dining experiences in the city. Nestled on a cozy street underneath the Brooklyn bridge, the River Cafe exceeds in both elegance and charm.  It is the perfect spot for special occasions, anniversaries, birthdays, entertaining parents from out of town, etc. I have never not had a truly wonderful time and it is one of the few restaurants in the city I foresee myself revisiting year after year. \n\nAtmosphere: upon arrival you can't help but enjoy the thousands of lights strewn throughout the trees that lead you to the restaurants entry. The inside is arranged so that each table has a view of the water and downtown Manhattan. The tables along the water are our favorite, but the back banquette provides a fun opportunity to observe the whole restaurant. Elegant but not pretentious. \n\nFood: having dined at River Cafe several times, I have never been disappointed by the food. The menu is prix fixe, comprised of three courses (app, main, dessert). The wild shrimp is among my favorites for starters. The crab dish and oysters are also great appetizers. All of the fish dishes have been enjoyable, the monkfish and branzino in particular. On this particular evening I had the lamb and it was spectacular; the meat was tender and rich without being too filling. Our favorite dessert is the Brooklyn Bridge: made entirely of chocolate, it is probably the closest you'll get to an edible mini replica of the bridge itself. Also, do NOT forget to request several salted caramel chocolates at the end of your meal -- they are highly addictive and absolutely delicious. \n\nService: quite possibly the best part and reason we keep returning time and time again. Michael, the sommelier is one of the kindest people in the industry and makes each visit an absolute delight. The entire wait staff deserves an A++, Ricky being among our favorite servers. They are all incredibly kind, helpful and above and beyond accommodating.", "author": "Hilary R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-04-30", "description": "The experience here was horrendous. The staff was incredibly rude and made us feel extremely uncomfortable. My fiancé's luggage had been lost during our flight to New York, so he only had more casual attire for brunch. Because of this they sat us at the back of the restaurant instead of where I had reserved by the window. Mind you I had called several weeks in advance for our reservations. \n\nMy fiancé is a very positive person, so even after the host rudely told us his attire was not good enough for the window seats, he was optimistic about the food. That being said, every plate we had was awful. \n\nI had the scallop appetizer that was at best a 4 out of 10 with 1 being the worst and 10 being the best. The bread that was served was cold and the butter was frozen. Our entrees were so bland that we sent them back immediately. We paid the check and left without a word. \n\nMy advice as a successful business owner is to focus on your food and less on what your customers are wearing. \n\nP.s. My fiancés is highly successful and we left paying a 200+ bill for food we did not eat and walked down the street to a coffee shop and grabbed coffee and bagels. Much better than the overly pretentious restaurant with nothing to back its image.", "author": "Sarine O."}], "servesCuisine": "American (New)", "priceRange": "Above $61", "name": "The River Café", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Water St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/C_8aEbAvcCLhiqXn9QdWSw/ls.jpg", "@type": "Restaurant", "telephone": "+17185225200"}