{"aggregateRating": {"reviewCount": 1049, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-20", "description": "Perfect! I went there with my boyfriend to celebrate our 9 month anniversary. We got a table right by the window, where we could see the Statue of Liberty and the one World Trade Center. Excellent staff, music, food, ambiance. Very romantic. Not even a single negative point! Highly recommended!", "author": "Danielle F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-29", "description": "This must be a ( MUST TO DO) in your bucket list; came here with my beautiful fiancé. Mind blowing view,excellent service, Yes great drinks. Food was marvelous lamb was to die for did I mentioned service was ... Planing on going again with my fiancé.", "author": "Noel F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-10", "description": "Dreamily romantic and located right on the water, this is the spot for a special occasion meal. Was seated at a window table as the sun was setting and had stunning views of the city. As others have noted, the ambiance is lovely with beautiful floral arrangements, low lights, and a live pianist. I am not one to take photos of my food but everything was as appealing to the eye as it was to the mouth. Being a Maryland resident the crab cake passed the test with melt in your mouth delicacy that was clearly not stuffed to the loins with filler. The Mushroom Wellington was better than I had even expected, with the mushrooms being perfectly cooked and flavorful. The sorbet plate was also a delight. Treat yourself to a meal at this intimate venue.", "author": "Jenna Z."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-10", "description": "Oh my GOD! Talk about being treated like royalty. Everything was amazing here. From the decor, to the waiters, the view AND the food. Make reservations way ahead of time as they tend to fill up quickly.", "author": "Dori S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-16", "description": "This was like a dream finally being taken on a date here since I discovered it when I first moved to the city years ago after walking over the Brooklyn Bridge.  Beautifully decorated and lit up garden outside and gorgeous view of Manhattan.\nThe atmosphere of this place is 5 stars.  Inside it feels rather old fashioned, maybe a bit dated but we loved it.\n\nThe appetizers:  Tuna was delicious - served with some sort of bacon..Like nothing we have ever had before.\nI had a sampler with shrimp, scallops and seafood dumplings.  The dumplings weren't too good, the shrimp was okay but the scallops were melt in your mouth delicious.  Too bad there was so little of them.\n\nBf loved his rack of lamb entree, although it was a bit small.\nI was torn between the Scottish Salmon and the Branzino, and wish I had chosen the salmon dish.  The Branzino was good - but I didn't flip over it.  The fish was covered with some sort of breaded coating that seemed like blah tasting melba toast covering it  -- wasn't for me.  The chorizo sausage and seafood stuffing was good-- not an overpowering smoky sort of flavor, just a little.\nI would give this dish no more than 3 stars.\n\nThe Brooklyn Bridge chocolate dessert was quite a sight.  Very cool.  Wayy too much chocolate but it tasted good.  The complimentary cookies were all very good except for the miniature macaroon which tasted like pure sugar.\nMy creme brulee came with a delicious hot peach sauce and peach ice cream.  It was good but I didn't flip over the flavor combinations.\nThe desserts were huge so we filled up on this.  If only their food were as big portions.\n\nIt was such a nice, romantic evening and I think the experience itself was worth the extremely high price since we were celebrating a special occasion.  \nFood-wise, the meals could and should be a lot better - more 5 star- to suit the high prices.", "author": "Alexandra C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-20", "description": "This is a true New York institution that rivals the best restaurants in the city. \n\nFOOD\n\nWhile the 5-course dinner tasting menu is pricey ($155 pp) the lunch menu on the weekends is a steal ($42 pp for two courses). All of the food was top top notch. My girlfriend and I shared two apps - a crab cake that came with uni and avocado, and steak tartare with quail egg. Both dishes were equal parts beautiful and delicious. My GF's mom had the kale ravioli with oxtail which was a special and it was also delicious. My mother had a scallop with foie gras. Every bite I had around the table was superb. I would recommend the ravioli and the scallop as the best of the four.\n\nFor the main course my girlfriend and I shared the duck with spatzle and the branzino with chorizo crust. We were torn between the fish dishes, but it was the duck that really excelled. The meat was perfectly cooked with a sort of berry compote that tasted like thanksgiving. Everyone who ordered the duck was extremely satisfied. The branzino was also good but not as superlative. The crust on it had a sort of grilled cheese taste. Now I love grilled cheese but not on my fish. My girlfriend's mother got the niman ranch steak which was a prime cut cooked perfectly with a side of creamy mashed potatoes. I recommend sticking to the meat dishes. \n\nFor dessert we shared the chocolate souffle and almond-apple tart. Both were tasty. We skipped the famous brooklyn bridge because I've heard it's more style over substance.\n\nOverall the food was very, very good. I would feel $155 for dinner is stretch, but again the lunch deal is impossible to pass up.\n\nDRINKS\n\nWe shared a bottle of sancerre (an always excellent white) which was a somewhat modest $52.\n\nSERVICE\n\nI would put the service at River Cafe above any other restaurant in the city. It was technically on the level with it's more international rivals, but it was more down to earth, pleasant, and less pretentious than the Bouley's and Per Se's on the world. It really has an old american feel to it that is hard to replicate.\n\nAMBIANCE\n\nThis is where the River Cafe excels over all rivals. Situated right on the water in Dumbo with floor to ceiling windows showing up the Manhattan skyline and statue of liberty make it the single most breath taking ground floor restaurant in the city if not the country. Add to that an incredible display of flowers inside and out of the restaurant, and you have a picture perfect spot. There was a wedding there during our saturday lunch and I think that's a good idea.\n\nOVERALL\n\nGraduation, anniversary, engagement, birthday - find any excuse to come celebrate at River Cafe. Come for lunch to sample the treasures without breaking the bank. Enjoy this ideal symbol of restaurant greatness.", "author": "James A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-12-29", "description": "Stopped in the River Cafe with my boyfriend after exploring DUMBO and the promenade. I got the cheese ravioli and he got the salmon with a dijon sauce. Both of our meals were great. The atmosphere was very dark and what some would consider gaudy.  The staff was friendly and helpful. My only complaint was the amount of time it took for our waiter to realize we were done and bring us our check. Other wise it was a decent spot for a slightly more upscale dinner than the other options in that area.", "author": "Ashley B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-05", "description": "This place is just unbelievable, the view is amazing, but make sure that you have at least 120$ per person (3 courses)to pay because there's no option and the tip is also 120$ included in the receipt", "author": "Betzai R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-28", "description": "Love the food, the view, the ambiance!  Special place for a special occasion!\n\n...but for a restaurant of this caliber, I was surprised that when I called up and asked the lady who answered the phone \" Can you tell me what the restaurant's corkage policy is for those of us with a wine cellar?\",she replied  \" Oh no, the restaurant doesn't allow any outside beverages\". \n\n Just don't know what I am going to do with that perfectly aged bottle of Night Train I was planning to bring  :(", "author": "Thomas V."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-04-18", "description": "The food was great. Josh, the host, was not. We could only get a granny 6pm reservation, which whatever. Fine. We shouldn't have waited so long. My boyfriend asked if we could get a window seat. I realize these are in demand, but we're going to be there for early bird special--why not? \n\nWhoever took our reservation said that they were given out first come/first serve and that if we showed up early, we'd have a better shot. So we got there at 5:30 and asked about the window. The restaurant was nearly completely empty. Perhaps two tables had been seated and two people waiting at the bar. Josh said window tables were only for regulars. The boyfriend repeated what the person who answered the phone had told him and Josh just smiled and shrugged. My man said, \"so basically the person on the phone lied and we could've taken our time getting here?\" I mean, who wants to eat at 6pm, let alone 5:30? \n\nJosh just kept repeating himself. Josh needs to speak to the people who take reservations so they can tell people who call that unless he's wearing a Rolex and she's wearing Manolos (and they're both over 80), you're not getting a window seat. I am not a fan of Josh. \n\nIronically, the main reason we went was because we were trying out places to hold a family member's 80th birthday party later this year. It won't be at the River Cafe, that's for sure. Thanks, Josh!", "author": "Judy M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-26", "description": "I'd like to start off by saying, if your planning to go to the river cafe, your planning to spend $$$$, but it is well worth the money! To say this place is special is an understatement. The restaurant is located just adjacent to the Brooklyn bridge and offers breath taking views of the NYC skyline. \n\nTip for those new to the area or restaurant, try to go during the evening time to watch the sunset in addition to this try to be seated closer to the water. When we went, we were seated towards the back of the restaurant and although every seat offered a view of the city, I believe those seats where that much more spectacular. \n\nThe food was amazing. Small in quantity as you would expect for most high end restaurants in NYC but that taste is unforgettable. I had rabbit for appetizer and duck for entree. My wife had a very nice cut of beef cooked exactly as she ordered. The food is above and beyond. \n\nService was highly attentive. They were there to serve. Very attentive to refilling wine, water, bringing extras like bread (oh and the dinner rolls were unbelievable). \n\nThe setting was amazing as I eluded to earlier. Don't leave this place in a hurry. Walk around the grounds. They have a beautiful garden nearby which you can sit in. Super romantic. They also have a small dock side next to the restaurant. Also try to enjoy DUMBO. It's an amazing part of Brooklyn! And when your finished with all your experience, the restaurant will bring you home in one on their private cars (if you really want the convenience) or you can flag a cab (if your looking to save some money) \n\nThis is the perfect spot for a special occasion. I went for my first anniversary. I would definitely recommend this place to others and would love to go again for a special occasion.", "author": "David F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-19", "description": "5 stars all the way!  Wonderful food, sophisticated and comfortable atmosphere and amazing view!", "author": "Dallas W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-06-05", "description": "If I could give this 5 negative stars I would. Have been waiting years to go here for a special occasion. Came after I graduated college only to pay $370 to get food poisoning. Do not bother going here.", "author": "Eline Tangen A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-16", "description": "My wife and I came here for our first wedding anniversary back in August last year.  The restaurant has amazing views of the skyline and brooklyn bridge.  We had asked upon reservation (2 months in advance) if it was possible to sit at a window seat and was told that this was only guaranteed after a third visit.  Slightly disappointing but company policy I guess.  We ended up being seated at a table just after the window seats so they tried to accommodate as much as possible.  Food and service was amazing and cannot be faulted.  I would definitely recommend trying the rabbit appetizer and lamb entree.  My wife loved the strawberry martini's (not on the menu) and said they were the best she has ever tasted, and she has tried alot!!  Overall we really enjoyed our experience here and would definitely recommend it for a special occasion.", "author": "Mark H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-10-06", "description": "This restaurant is well presented near dumbo. As I sat down for dinner and  ready to order  the waiter ignored us. Not sure if he was being racist but that's how I felt. The food was OK, I will probably not come back", "author": "Yannie H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-27", "description": "Any place by the water is already starting from 3 stars on my book. And when you combine it with good food and summery atmosphere, they don't need to do much to get 5 stars. And they did not fail. I am not a restaurant reviewer, I will leave that to people who know better about food (Or think that they are?) I will say that I had a great afternoon at the River cafe. From the service through the food, this place is good.\nAnd the view. Oh the view...", "author": "Nadia O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-29", "description": "Big fan of this place. The view is great, filled with flowers..great for proposals, bridal showers, rehearsal dinners, anniversaries, girly things too. \nThe food was good: octopus, scallops, the duck was a lot of food and amazing, the different fishes and etc. YUM YUM! great service, pretty formal, not insanely expensive...totally worth it!", "author": "Lily P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-04", "description": "Date night here was PERFECT. We chose the fixed menu over the tasting menu because im a really picky eater and dont eat red meats, certain veggies (haha, im difficult).\n\nThe food was very very good, but i cant say that i was focused on the food because i was so entranced by the atmosphere and gorgeous views. The live piano player was also an excellent touch. Oh and saw a couple get engaged here! \n\nThe servers are beyond attentive. I set my purse on the floor under mh chair because i really dont care about it that much, and 5 minutes later a server brought out a small stool for me to place my purse on. A server also offered to move us to a table right by the window when a table cleared up.\n\nAs great as this experience was, i dont know that i will return because i dont want to tarnish the perfect memory i have of my dinner here. But definitely a place to visit at least once!!", "author": "Kyna C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-08-22", "description": "You're basically paying for the view. Portions are small, not too big. Food was okay. Took forever to bring out each course as well as someone to notice we needed the check. Overall, probably wouldn't go here again although the view was gorgeous. 3 stars only bc they were friendly and gave a complimentary starter as well as some chocolates that came with the dessert. Oh and not to mention the delicious fly that was in my sprite. Waiter noticed and changed it immediately before I could even say anything.", "author": "Mace D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-06-18", "description": "This restaurant has a beautiful garden with fragrant flowers and a nice view.  \n\nHowever, it also has mediocre service that would be fine at a cheaper restaurant but not at a restaurant of this caliber.  I don't see the added value if I'm greeted by 6 people instead of 1 but it does take away from my experience when a server hands us the desert menu and disappears for 10 minutes or if my water glass is empty for 15 minutes before it gets refilled.  It was also hard to get the server's attention.\n\nI also did not care for when I got chilly in my dress and my husband tried to remove his suit jacket to drape it over my shoulders but was promptly stopped by their wait staff and asked to leave his jacket on.  He was wearing a nice dress shirt underneath - not a tank top!\n\nAs for the quality of food, it tasted fine but should have cost about half of what it was.  I was expecting a more creative presentation and more intricate taste.  \n\nThe place also felt cramped.  I realize it's NYC but other restaurants in the same price range tend to be more spacious so you don't feel like you're in some happy hour place in the East Village.\n  \nTo sum it up, if a restaurant wants to charge those kind of prices, their service and the quality of food need to live it up it.  If they want to charge half for what they are currently charging, then they can continue with their current level of disorganized service and decent food quality.", "author": "Tanya N."}], "servesCuisine": "American (New)", "priceRange": "Above $61", "name": "The River Café", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Water St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/C_8aEbAvcCLhiqXn9QdWSw/ls.jpg", "@type": "Restaurant", "telephone": "+17185225200"}