{"aggregateRating": {"reviewCount": 1049, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-08", "description": "Came here for our wedding anniversary. Loved the gardens and the feel when you first pull up to the venue. We got a table by the window which was great because the view is beautiful. Right on the water. For a romantic setting, I thought the tables were too close together and that the actual dining room didn't have much ambiance. The view is really what made the place. The service was attentive and formal. The food was good, but for the price and restaurant level, I did expect more. I didn't feel it measured up to other top rated high class restaurants that I've been to and that are in the same price range, but it was still good. Overall i felt the dining room was a bit stuffy. It was a nice experience but not as memorable and breathtaking as I had expected.", "author": "Phoebe C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-30", "description": "We ate here for our anniversary and the staff made our evening enjoyable from the start by giving us a window table. The view is spectacular,  and the sunset happened to be especially pretty and right behind the Statue of Liberty.  The food was extremely good.  We had a small meatball with a lentil cream soup to start that wasn't on the menu. I had rabbit for the appetizer and my wife had pear salad. Both were presented beautifully.  The rabbit loin was prepared in rolls with a sort of pasta accordion on the side. We both had strip steak,  which was prepared perfectly (there was actually a difference between medium and medium rare). The steak was accompanied by mashed potatoes in a bone cut in half longitudinally.  The potatoes were placed where the marrow originally was,  and it seems there was something brushed on top before it was broiled. The desserts were very nicely done.  My wife had what is apparently their signature dessert, a chocolate mousse cake with a confection Brooklyn Bridge on top. I had Apple Almond Pavé, which was thin Apple slices on a filo pastry almond crust. On the side were vanilla ice cream and two different flavors of sorbet. I only had a glass of Cabernet Sauvignon, which was quite good.  The wine list is truly breathtaking,  and if I had a wine coach to help me I might have tried to choose a bottle. The service was fairly formal but human. The dining room was well staffed and carefully supervised,  but the tone was not overbearing.  The was plenty of energy without it being difficult to converse normally or listen to the live piano. Overall, an experience I would be happy to repeat.", "author": "Stuart G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-15", "description": "Fabulous restaurant for an all around romantic dining experience!\n\nWent with my husband on a Monday night for no special reason.\n90% of the restaurant is the view and 10% is the menu.\nWe had reservations for 8:30 (reservations between 7 and 9 were available), but it was packed.\n\nHere's the breakdown\nBAR\nThere's a small bar to sit and have drinks while you wait for a table. We arrived 10 min before our reservations and that's exactly how long we sat at the bar. Great environment to sit and sip.\nSEATS\nThere are 2 types of seating, tandem, where you have to sit side by side, or standard across the table seating. Initially we were side by side but the waiter noticed a draft coming from the vents and when a table for two opened up right by the huge picture window under the bridge he promptly moved us. We never even asked to be moved he just did it.\nMENU\nThere are ONLY two options here.\nA- The 3 course fixed menu. Everyone at the table can pick 1 of each, an appetizer, main course, and desert. The menu is pretty extensive and ranges from scallops to lobster to fois gras. ($100/pp)\nB- The 6 course chef's selection meu. The chef chooses 2 appetizers, 2 main courses and 2 desserts. HOWEVER each portion is a 1/2 portion, so you're not getting twice as much food, rather you're getting to taste more food. The courses are pre-selected for the evening but if there's something you don't like (or don't eat) the chef is happy to change it. They recommend everyone at the table get this and there's good reason. ($125/pp). \nDRINKS\nIf you want to do a wine pairing with your dinner it's $50/pp. But the by the glass option is always available, and probably preferable unless you have an incredibly fine palate for wine and want the absolute perfect drink for every course. Keep in mind it's 6 different wines in addition to anything you've had at the bar.\nSERVICE\nThere is a head waiter, an assistant waiter and an additional waiter(s). The head waiter will take your order, tell you about the menu and chef's specials. The other two will bring bread, drinks, and clear the table. From that perspective you expect to have a never-ending supply of food served to you without delay. That will not be the case. Service is top notch, but this is not a restaurant where you can run in for a quick bite. Food comes out slowly.\nFOOD\nSuperb! Every item is perfectly created to make the most fabulous flavor combinations. Again, if you order the 6 course you'll receive small appetizers so understand that once you get the first bite you will likely be very hungry, and the portions will be small, and the next appetizer will be 10 min away. But they did bring a small app on the house before our actual appetizer. Once they bring the main course it will be a smaller portion than it would be if you ordered the 3 courses, but it's still a great meal. We had lamb chops and there were 2 impeccably cooked, well seasoned, chops. We chose 2 desserts (full sized). The lime souffle was amazing, and the coffee caramel tart was just as great.", "author": "Tamarra H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-21", "description": "Fantastic views of the Brooklyn Bridge overlooking Manhattan.  This upscale restaurant requires formal attire (jacket and tie) and reservations are recommended.  It's good for hosting corporate events and social functions.  The wait staff are not too stuffy but attentive to your needs.  I attended an event from my former company which was amazing!  It's ambience is romantic for couples as it sets the backdrop for photos.   I do not recommend this restaurant for children.", "author": "Tina C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-22", "description": "If I ever return to NYC, this is definitely going to be a scheduled stop. While exploring Brooklyn in all it's fabulousness, we happened upon this little gem. Situated on the water underneath the Brooklyn bridge, the River Cafe overlooks lower Manhattan, a place I would rather look at than be.\n\nWe initially meant to grab a quick drink at the bar and head out to pizza at Grimaldi's, a plan that was very fortunately foiled due to the INSANE line (see Lucali for our later impromptu pizza adventure). One drink turned into a second, then a glass of wine accompanied by some very fabulous foie gras.\n\nLiz and I were so happy, we tried to see if we could stay for dinner, but alas, it was not to be. They were completely booked. That's okay with me, though - I have even more reason to return!", "author": "Erin K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-11-04", "description": "Oh, the hassle of finding the right place for my dad's birthday lunch... Not that I was organizing a real party (we were four), but my dad is pretty much the epitome of a foody. And he has been eating around the world in the best restaurants ever opened. So yeah, a total drag to find the right place.\n\nMy partner suggested to take advice from our favorite food traveler, Travel channel's own Samantha Brown. Turns out, she did a special about Brooklyn and my dad had always wanted to go there. Bingo.\nSamantha recommended the River Cafe. So we made reservations. (I would trust Samantha with my palate's life).\n\nAMAZING view of Manhattan from Brooklyn. You are literally on the water. Great service, nice staff.\nThe food was terrific and the ambiance very relaxed and perfect for a lunch by the sea. \nDo not forget to check out the desserts, they're excellent.", "author": "Christophe G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-11", "description": "Most beautiful, romantic restaurant in New York...maybe anywhere!", "author": "Jackie M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-04-11", "description": "What an amazing experience! The food, service and priceless view was all worth the hefty price tag. This is definitely a special occasion place and the service and ambiance makes you like its a special occasion.  I did feel the decor could use a facelift. It looked a little 80's, and the flowers although looked beautiful smelled a little overwhelming.  The food was of excellent quality and I expected nothing less than great.  I choose the rock lobster tails for an appetizer and the rack of lamb for entree.  My lamb came out overcooked so I sent it back and the waiter kindly sent out a scallop ceviche for me to nibble on while I waited, that's the 5 star service we all crave from a great restaurant.  They were perfect second time around. I do love chocolate so the bridge dessert was perfect for me and it made for a nice picture.", "author": "Jackie S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-06", "description": "Asiate last night. River Cafe tonight. RC far and away the superior experience. Service impeccable, food from start to finish superb,  view from any table breathtaking. Prix Fixe menu reasonably priced, tartare and fois gras amazing first course, all of our (8 people) second choices perfect. Dessert (Brooklyn Bridge for me) wow!  Worth the trip if you are in Manhattan.", "author": "John S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-12-02", "description": "Good ambience, food is very good, but service is a little slow, if they work to provide a faster service this place would be perfect.", "author": "Jojo D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-03-18", "description": "Went here for the Dine in Brooklyn restaurant week deal.  20 bucks is a pretty good deal.  The reservations are booked for the duration of Dine in Brooklyn.\n\nIt was a great day to be there with the gorgeous weather.  However, I was ridiculously hungover from St Patrick's Day and had noon reservations.  DEFINITELY NOT the best hangover food haha.  First time ever at River Cafe...and yeah the view was obviously perfect.  But overall, I wasn't a huge fan of the entree.  I got the the lamb meatballs appetizer, which I liked a lot.  But my duck was just really really MEH.  It was burnt and a bit dry honestly.  My buddy also got that and it was the same issue.  And the table next to us -- one of the diners also got the duck and I overheard her comment that it was dry.  So I dunno -- maybe it was just a bad day or what.  The highlight was the dessert trio though -- strawberry ice cream from Brooklyn Ice Cream Factory, delicious creme brulee, and a little chocolate cake.\n\nGot an esprseso too, which honestly was very poor.  And um...$7.  Really?!?!  Coke was 5.50.  Pretty ridiculous prices I felt.  And at $7 for the espresso, I wouldve expected some very good coffee (and that price is pretty unjustifiable).\n\nDunno if I'll come back honestly.  Maybe for another Restaurant Week.  Honestly, the best meal you can have in the area is a Grimaldi's take-out (call ahead to pick up pizza) and then you take it to Fulton Landing.  Same beautiful view...and 18 bucks for the pizza.", "author": "Victor S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-22", "description": "A great experience. The food, the views and the tight but not stuffy atmosphere made up a great dinner this past weekend. Enjoyed the rabbit and ravioli and crispy duck finishing off with the Brooklyn bridge dessert, while my fiance tried the tuna tartare, steak and peach souffle.  Service was friendly, and you just can't beat the views out on the deck of the city skyline.", "author": "Renato S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2009-04-07", "description": "Been there twice. Once last year just for drinks and this year during Restaurant Week. View is really breathtaking, perfect environment to eat. Food was OK...just OK, nothing spectacular. Does not match the view AT ALL. I think that's the biggest disappointment from this place. Good thing we didn't order anything extra. However,I'm really glad for the experience.", "author": "Annie T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-12-31", "description": "I came to this restaurant at the beginning of December with my sexy man. \n\nIt was pretty much perfect  ! \n\nWe had a few issues persuading a cab to take us there but we found one in the end and began our journey over the bridge. it was such a clear night and the views were spectacular. \n\nOn arrival at the restaurant, we were a little early so they guided us to the bar where we were served lovely strong spirits.\n\nWe got to our table and from there one the service was amazing. Not too attentive but making sure that all of our needs were met. \n\nThe food was delicious. I have the Fois gras two ways, the duck breast and the chocoloate bridge. Each course had the most wonderful concoction of flavours. My partner had the oysters, the venison and the sorbet. Outstanding! \n\nAs it was Chris' bday i asked if they could make that known. They served his desert with a candle and a piece of choclolate with Happy Birthday Chris written on it. a little corny perhaps but a sweet touch. \n\nWe left the river cafe stuffed and totally content. A really lovely experience.", "author": "Amy W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-05-21", "description": "It's been many moons since I've been here, but I'm sure it's still as heavenly as ever!\n\nI went here after seeing a Broadway show, cabbed there. When I made reservations for this place, I was doubtful, I mean it's in Brooklyn of all places! But after reading many reviews, I decided to give it a chance. When first arriving, the first thing you notice is the size of the place, it's tiny  looking and of course, you can tell right away that the place has an amazing view. I made dinner reservations around 7 pm, it was faith that I was able to get a table.\n\nWhen I walked in, I was quickly greeted and was seated right away. Got a table by the window (something you must request and is a recommended MUST), and the waiter followed as the hostess left. The waiter was very inviting and knowledgeable. He walked us through each of the dishes and answered all of our questions. We placed our orders and thought we were going to wait forever for our entrees. Not the case!\n\nTo our surprise, the chef sent out two special dishes for us to taste (on the house!), both to die for! I wanted more, but didn't want to seem like a pig so I munched on the bread. I didn't do the prix fixe menu, I did the a la carte. For appetizer, I had their crab and scallop salad, AND their tuna tartar, everything just melted in my mouth! For my entree, I ordered their fillet with their baby lobster, I felt like there was a party in my mouth. Everything was so good! I was floating on air! I wanted more....! Even though I thought the portions were a little on the small side, I was actually full by the time dessert came around.\n\nWhat did I have for dessert...? Their chocolate Brooklyn bridge creation of course! I'm going to state this of hand, I'm not a chocolate fan, but that was something I'll never forget! Everything about it was wonderful. When the waiter brought out my dessert, I actually felt bad sticking my fork into it because it was so beautiful! But it was meant for eating, so I ate it. Every last bit!\n\nThis is one of those hidden gems that I would come to again, and again if I was living in NYC, but unfortunately for me, I don't. The serve was wonderful! Top notch! So attentive and our glasses was never emptied. It was a two-hour meal for us, but every second was worth it. The view? Breath taking! The food? Delightful! Many reviewers says that this place is pricey, but it's really not. I mean, just the view itself pays for it all...it's to die for!", "author": "Viviane T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-11-22", "description": "I attended a good friend's wedding at the River Cafe in Oct 2011.  \n\nBottom line: best wedding ever.  Best location, best view, best service, best food, best ambiance.\n\nThe courses were served with enough time in between to give me a break from eating; meaning that I did not get too full in between courses and was able to enjoy each one.\n\nThe wine was absolutely exquisite and I have since tracked down a few bottles of my own through BevMo out here in CA.  \n\nThe views of Manhattan are spectacular and I couldn't have asked for a better night.\n\nADDITIONAL INFO: I happened to drop my make-up bag at the restaurant and had to catch my flight back to LA the next morning.  I didn't know where I'd left it and I finally emailed River Cafe, and they had it!  They sent it back to me, and I was beyond grateful as it held a number of valuables - earrings, a gold necklace, my entire supply of contacts (those things are expensive), etc.  So this was above and beyond in my book.  River Cafe is on my list whenever we head back to NYC.", "author": "Megan M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-07-17", "description": "Well this is not a place to go on the cheap.  But it is a place to take someone to impress.  We were a large party -- 12 or more with some special out-of-town visitors.  The meal and the view were sublime.  Not my first time (in fact about the 10th) but great every time.  \n\nI had the scallop ceviche -- perfect for a summer night -- cool, light and refreshing.  The seared branzino was perfect.  This fish is always good and is now found all over the place -- but this is a very usual presentation.  Give it a try.  \n\nFor dessert -- I have had several times in the past -- the Brooklyn Bridge -- but this time prepared for disaster I tried the goat cheese - cheesecake -- be prepared to be amazed.  \n\nThe service as always is attentive and respectful -- but wear a jacket or you'll get stuck in one of their River Cafe outfits.", "author": "Wm B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-10", "description": "I just love the view.  The view is fantastic.  I just had two Martini's at the bar and nearly missed my flight - I got caught up in the moment.", "author": "Tim T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-01", "description": "Not only was the food perfect, the environment and service was a-mazing.  The view of the NYC skyline, the piano player, and 4 course meal was the best I've had in Brooklyn, NY. It is pricey, but you will not be disappointed.", "author": "Candis G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-07", "description": "We called to make reservations and they said they were booked but we walked in and they sat us in about 10 minutes... We ordered the fixed 3 course lunch and the meal was good but the most memorable part was the dessert. We had a beautiful view and romantic lunch.", "author": "Christine K."}], "servesCuisine": "American (New)", "priceRange": "Above $61", "name": "The River Café", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Water St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/C_8aEbAvcCLhiqXn9QdWSw/ls.jpg", "@type": "Restaurant", "telephone": "+17185225200"}