{"aggregateRating": {"reviewCount": 1049, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-07-11", "description": "Overrated and overpriced.\n\nWe went here due to the Michelin star, but it must have been assigned for the view, not the food or service. And if you're not in the \"window-row\", you can't really see the view anyway.\n\nFood was average, service was annoying. If you want a delicious establishment, go to Peter Luger. At least the waiters there have class.", "author": "Robert M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-25", "description": "I dine at the River Cafe regularly, and it's my fave spot for an AMAZING day time and nighttime view couple with good service. On this visit to one of my fave spots, I came for Bklyn Restaurant week for a lunch with my cousin.\n\nThe dining room hostess (young woman with blonde hair) was not as warm and friendly as I'd expect from my past experiences at the River Cafe, and was very short. I also didn't enjoy my experience with my waiter, who never checked to ask us how our meal was going, nor did he ever offer us dinner rolls (we had to ask our water guy). I believe his name was Josh, yes, Josh. \n\nThe menu was what I'd expected-- solid food with a kick-@$$ dessert! I had the lamb meatballs, with the fish fillet with vegetable basmati rice (my cousin had the chicken salad, pasta with bolognese sauce) and we both had the dessert trio with the vanilla bean creme brulee, chocolate cake, and ice cream. \n\nI consistently love the food at the River Cafe-- everything from the Fois Gras, to the Bklyn Bridge Cake, Creme Brulee that is HEAVENLY, to their soups and salads are great. \n\nTYPICALLY the service is awesome. I have never been waited on by Josh before so it wasn't an option. It's typically the type of service that the moment you wish your water needed refilling, you desire another dinner roll, or you want another glass of wine to be poured from your bottle, it gets done. Josh was very inattentive, and although it was Restaurant Week, the idea is to lure guests to return to your place of business at later dates, not to detract them from your establishment. \n\nThe rest of the wait staff was still amazing, as usual, so was the maitre' d that seated us, and the girls that initially greet you prior to heading into the dining room. Josh and the blonde girl at the dining room greeting podium were atypical and disappointing. \n\nAll in all, I LOVE this place, and it lost out on pricing for the location for my wedding. I'd still consider it as a venue for my mom's 50th birthday party, so long as the service is top notch, with no room for errors.", "author": "Ebony C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-19", "description": "came here for my man's birthday, \nand was absolutely perfect.\nthe food is great, the service was also excellent.\n\nhowever if you are thinking about saving money,\ni do not recomment this restaurant.\n\nit's a really really expensive place, and you should definitely come here\nwhen there is special occasion.\n\nit's not a random place to eat. you must think at least $500 including gratuity.\n\nhowever, a very romantic atmosphere.\nbeautiful view of the brooklyn bridge.\n\nwill definitely come back for my birthday again lol", "author": "Jinah C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-06-21", "description": "I went there today (weekday) for lunch with my mom. It has a small garden outside and is very lovely. The service was impeccable and I can see why Michelin gave it a star. The view was so pretty and trust me if you do have money go there and do some private event, it will be unforgettable! \n\nWe had oyster and crab soup to start. I loved the way that they put lemon ice in a lemon shell and you can eat your oyster with the lemon ice. The crab meat was ok, but it did get points for being creative as it was added in thai basil. \n\nMom had sirloin for entree and I ordered rainbow trout (an appetizer) for entree. The sirloin came in a decent size with french fries. Both were tasty. The rainbow trout was smoked with interesting decoration (you can see it yourself in the picture). \n\nFor dessert, we shared the brooklyn bridge. The bridge was made of a chocolate cake which was on the sweet side (that was why I did not give it a 5 star). The hazelnut icecream was really yummy. The whole plate was well presented and good enough for two people to share. \n\nMy mom loved this place and I am sure the evening view would be more breathtaking.", "author": "Jasmine W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-30", "description": "I've been here a few times over the years and this place consistently blows me away. It may be because I'm in love with the view that you get while dining at The River Cafe. This is the perfect place for a special occasion, whether it be a proposal, graduation dinner, birthday celebration or just because. This would be an amazing place to be married or proposed to if you want that romantic feel! It doesn't hurt that the food is amazing as well, and the service as attentive and polite as you could ask for. This place is pricey, but well worth it. Downside is that it's so hard to get to. Otherwise I would come here more!", "author": "Melissa C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-19", "description": "The restaurant is cute, but the food was okay.  The view is underwhelming during lunch (compared to a San Francisco waterfront); I suspect it might be more impressive during sunset or at night. There were a few empty tables in this small restaurant, but this location will probably be bustling once Brooklyn Bridge Park fully opens.\n\nI love the reception area (which looks like a flower shop) and the bouquets of flowers on each table are fit for a quaint wedding.\n\nFoie Gras Two-Ways:  \n* Terrine: almond crust, ground coffee beans\n* Poached: fig sauce, balsalmic vinegar\nEither way tastes like butter coated with a sugar glaze, with the added vileness of a liver.  How many times do I have to remind myself that I don't like Terrines? (*rolleyes*)\n\nLobster Two-Ways:\n* Lobster Tail - bland\n* Lobster Cheese Sandwich - oiliest sandwich ever!\nI wished I had ordered the Brazino while I was waiting for this dish and I wished even more when I was stuffing the greasy lobster sandwich down my throat.\n\nWe were too full for dessert.  We might still have ordered one based solely on the glowing dessert reviews here, but the super rich-looking desserts on our neighboring table did not beckon us.\n\nI didn't realize that the restaurant is a house-boat until we walked outside the waterfront next to it.  That explains a few seconds of mild shaking while we were eating.\n\np.s.: If you are walking here from the Brooklyn Bridge, get off the first stairway on the Brooklyn side.", "author": "Lisa C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-06-02", "description": "If your looking for a 5 star elegant professional fine dining experience this is the place for you. Its very expensive but if you want to splurge or celebrating a special occasion this restaurant is really worth it for a memorable experience. The views are breathtaking. The entrance with the flowers and garden make for great photos with your guests. The service is just outstanding here. Our food was really served beautiful and delicious. Make sure to order the Brooklyn Bridge as desert.", "author": "chris d."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-21", "description": "My husband and I had our anniversary dinner here in January. The whole experience was magical. \n\nYou walk in through this hallway with a huge beautiful arrangement of fresh. fragrant  flowers and then through an enclosed plank (the restaurant is actually floating on the East River). When you enter the restaurant it's like WHAM! You are hit with THE MOST SPECTACULAR VIEW.  \n\nPre-dinner cocktails at the bar are served by friendly, professional bar staff with lively, yet, mellow piano music in the background. It just feels like \"Why can't life always be this good!?\"  \n\nWe were lucky to snag a window table for dinner (you can make reservations far in advance for a window table, but not being by the window really does not detract a whole lot from the view or the experience). \n\nThe food was truly delicious. I had the NY strip steak for a main course and even though I have been to every well regarded steak house in NYC and beyond, the steak at River Cafe was among my top three. I couldn't believe how flavorful and tender it was. The service was 100% impeccable. \n\nFor desert, I went with the Brooklyn Bridge chocolate thing and it was huge, delicious, crazy cool-looking. \n\nLoved every moment of this dinner. You will too. Splurge. You won't regret!", "author": "chris g."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-22", "description": "The food is delicious, the location and view are outstanding. My husband and I have been going here for a long time however I had to take off 1 star because on my husband's birthday they refused to bring out the cake for him insisting they \"have their own pastry chefs.\"  That in my opinion is very rude and as a paying customer  I should be able to bring a cake for a birthday party. We had approximately 8 people with us and the cake that was brought out with 1 candle was a slice of their Brooklyn Bridge cake. Bottom line: don't have a birthday party here.", "author": "Lilit A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-02-07", "description": "Solid three stars. FOOD: My husband and I ordered the six course tasting menu with wine pairings. It was a very traditional tasting menu.  At each course I found myself thinking, \"I've had this before at XYZ, but they did it better.\" The wine pairings were also safe bets, nothing interesting. ATMOSPHERE: Everyone around us looked to be on a 'special occasion' meal, taking selfies by the window. SERVICE: The service was the only thing that stands out as five star. We were attended throughout. VIEW: Not guaranteed \u0026 didn't make up for the 'meh' meal. We didn't get the view we'd hoped for-- we thought we would have a window seat, but were seated in probably the worst spot by where the food comes out. BOTTOM LINE: We wished we'd crossed the bridge or gone to one of our other favorite places. I can't imagine we will return, there are just too many other/better places to go in this city in this price range.", "author": "I Heart New Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-12-18", "description": "I am in LOVE with this restaurant. Great ambiance, great food, great view. We made reservations but never requested window seats, however the dining room is small enough so that, window seat or not, you get the best view. \n\nWe were greeted by the nice lady at the lobby and the Maitre D' seated us within a few minutes. We promptly got our menus, made our order, and then were presented with a complimentary gazpacho. As an appetizer, I ordered the Crab and Coconut Bisque. I'm not a huge fan of coconut but I love crab and it was delicious. For the main course, I had the Branzino Fillet which was good, but not great. My boyfriend's dish though, the Crisp Duck Breast, was phenomenal. The duck was so flavorful and tender! Felt like it was melting in my mouth with every bite. For dessert I, having a very sweet chocolate tooth, had to have the Chocolate Marquise Brooklyn Bridge. I honestly loved it but I was so full by then, I only finished about half the bridge!\n\nThe service was excellent. One guy who came with us was watching his health so he asked the waiter if there was any way he could opt for a healthier dessert. Our waiter spoke to the Maitre D' who asked him if he had any preference - he really just wanted fruits - Maitre D' asked if he was sure if that's all he wanted, then asked the chef to prepare a small fruit salad. Not the biggest request from a patron, but it was a nice favor from everyone there!\n\nAll in all, $100 a head is really nothing for this place. You're paying for the awesome location, food and view!", "author": "Stephanie D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-01", "description": "came here for my 8th anniversary, i have to say i had a lovely time! the view was great, the service was excellent but except they forgot to bring out my request of happy anniversary when i reminded them two times.. i had the chicken and my boyfriend got the steak. it is a prefix menu and i remember every dish was really good!!! i recommend this place for birthday, anniversaries... the scenery is awesome!!! oh ps! dont forget to get their signature dessert bridge!!! it wasnt as good but it is so worth the pics.", "author": "Kaitlyn Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-23", "description": "Beautiful and  sophisticated place. The view is magnificent. For appetizers we had soft shelled crab, pear salad and tuna foie. Very good! Main course we ordered lamb, Bronzino and monk fish. Absolutely delicious! Desserts amazing too.  We sat by the window. And even though  tonight  it was raining, we still enjoyed the view and really believed we were on big ship cruising around Manhattan.", "author": "Alice M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-12", "description": "Wow, what a view!  The most unique setting for fine dining in the area.  Food was good; service was a little spotty for the calibre of the restaurant.  Head waiter made comments about our conversation and other waiters had to hand dishes to some members of our party because of space contraints.  If you are going to charge $50+ for an entree, I think you should be properly served.  But the stunning view does erase some of that pain.\n\n$100 for 3 courses with some supplements.  Wine list is manageable.  This place does not give off a snobby vibe.  I would come back to have a drink at the bar and stare at the view.  Perfect spot for romance!", "author": "J S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-29", "description": "River Cafe has been my fancy next-door neighbor for almost two years (and is where I tell cab drivers I'm going, since none of them have heard of my street), but for some strange reason I'd never eaten there until Friday.  What on earth could that reason be?  Oh wait, I think I've got it.  $98 pp for 3 courses.  Thank heaven for Restaurant Week, no?  \n\nIf there's ever a place to go for RW it's River Cafe, because, as NY Mag put it, it's not like they take away the view just because it's RW.  Now, the view (a stunning panorama of the BK Bridge and lower Manhattan) isn't so much the draw for me, since it's the same view I have from my roof, but it's still breathtaking nonetheless.  And even though River Cafe is only 30 years old, it feels like New York circa 1940--white-coated waiters, little lamps on the table, about four different people to greet you and show you to your table--I love this stuff.  Classic and classy, but not pretentious.  \n\nSometimes when you go to a restaurant for RW they offer you a crappy, scaled down prix fixe menu where you suspect your dinner was created out of the scraps from last week's staff meals.  Not the case at River Cafe!    The inimitable Kaelea A and I had a choice of 4 delicious-sounding (and tasting!) appetizers and 3 drool-worthy entrees, and for dessert we didn't have to choose, because each person automatically got a DESSERT TASTING of creme brulee, chocolate mousse cake and peach sorbet (see pics).  Holy cow!  This is my kind of place.\n\nI'm now thinking that I should have started frequenting River Cafe the second I moved here--you know, get in with the bartenders, make friends,  play the neighbor card whenever I need a hard-to-get resy--and then maybe I'd be able to get a little of that $98 shaved off the top when it's not Restaurant Week.  Or at least a comp'd BK Bridge cake.", "author": "Becca S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-05", "description": "I can't believe I forgot to write a review about the River Cafe, especially since it was one of the best meals I've ever had before.\n\nI went in the winter for my birthday brunch, and my boyfriend and I had the luck of getting a table right next to the window on a perfectly clear day. I had a perfectly crafted champagne cocktail, while he had an equally strong gin and tonic. After that, the waiter presents to you granola inside of the shell of a brown egg, and pours milk in an old-school bottle on top, which was beyond delicious. For appetizers, he had the seafood trio, which he loved, and I had a simple but tasty and fresh vegetable salad. For the main course, I had these out-of-this-world waffles and he had an omelette, and each bite was better than the last.\n\nAnd then my most memorable part--the pianist stopped what he was playing and started with Happy Birthday, as my waiter presented me with the famous Brooklyn Bridge chocolate cake, as the restaurant sang. The service was so sweet and not at all pushy, and I'd love to make it a yearly tradition. \n\nThis place is by no means cheap--brunch was close to $200 for 2 people, but for a special occasion, you really can't go wrong.", "author": "Lauren L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-04-26", "description": "One star is strictly for the view. Which honestly you can enjoy from the park next door. We have dined at numerous 2 and 3 star Michelin restaurants in NY, as well as Paris and Cali, this place is a joke to carry a star. It's more like a bar \u0026grill or cheap seafood shack. The decor is 80's tacky without any update. Full of lacquered wood planked ceilings weird floral displays...The crowd fits well with the decor, of a certain outer borough yuck. Upon entering the maître'd Josh,must've realized our discomfort, and seated us at a lovely table by the window (as opposed to other reviews stating he saves those for regulars?)\nAgain, the view was about all we enjoyed. Our waiter was rude and disinterested, which I almost found laughable since he was working in such a ridiculously lame place. The food was beyond mediocre. The amuse Bouche was fried ravioli and tomato soup (really?)The lobster, lamb, duck, were all forgettable. There were people sitting near us with packs of kids who were so loud, that I honestly thought we were at a Friday's. It was a zoo. Nothing made this restaurant worth it. ALSO WATCH YOUR BILL!! We paid in cash (400) and the other couple with us by card. the next day the ENTIRE  amount had been charged to their card in addition to taking the cash!! Be sure this is in dispute. What a waste!!!", "author": "Said D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-05", "description": "What a view!!!! We came here for our anniversary and what an amazing evening it turned out to be. This restaurant is stellar and pays such careful attention to detail. Drinks were on point and the food is beyond amazing. They also have valet so you don't have to worry about parking your car.", "author": "Natalie T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-01-18", "description": "If I could give this restaurant six stars, I would.\n\nIt's pricey and the menu is prix fixe.  It's very pricey, ok?  You need to know this.\n\nThe restaurant and bar area (with the live piano) is beautiful.  The view is worth a million bucks (ok, five million bucks).  In fact, it has the best view of any restaurant I have ever visited.  The food, overall, is very good.  The service is also top, top notch.\n\nSpecial occasion restaurant?  You betcha.  But don't wait for the ultimate special occasion because you need to experience this spot sooner rather than later.\n\nWhen one of my lottery tickets pays off, I'm going to eat here once a week.  It's really a great experience.", "author": "Craig W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-12-25", "description": "This is FOR SURE a date restaurant! We came here for our 3rd wedding anniversary and it was such a special place. Hands down, the restaurant with best view \u0026 ambiance. Great great service, portions, presentation, food. We ordered: Steak tartar (recommended!!), Yellow tail tuna apptzr (WOW recommended!!), lobster \u0026 steak for dinner, goat cheese cheesecake \u0026 Brooklyn bridge cake. The food was tasty and the prices was reasonable for a high end restaurant like this. I would DEFINITELY recommend this place if you want to make it a special night!", "author": "Stephanie M."}], "servesCuisine": "American (New)", "priceRange": "Above $61", "name": "The River Café", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Water St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/C_8aEbAvcCLhiqXn9QdWSw/ls.jpg", "@type": "Restaurant", "telephone": "+17185225200"}