{"aggregateRating": {"reviewCount": 1049, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-09-22", "description": "Ok so I only go here during Restaurant Week...so not sure if the menu is indicative of the usual fare but I LOVE this place.  I mean, yes the tables are a bit close but the service is stellar and the view magnificent especially right at twilight..... Fellas, this is the place you take her when you got some money and you wanna impress and yes the food is delicious.", "author": "Wanda N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-09-04", "description": "My husband took me here for Thanxgiving dinner, after he proposed.\nTruly, it was the BEST service, BEST food, and BEST night...    Great place for special occasions.", "author": "Haya M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-09-12", "description": "First off the view is insane at this place. Went here for lunch and it was a perfect experence, except for the secret service all over this place for the vip who was eating here. Ordered the lobster and lobster which is a lobster tail and a lobster grilled cheese sandwich with black truffle. Was excellent. Also you must get the brooklyn bridge for desert, it is suberb.", "author": "Casey S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-11", "description": "the restaurant is absolutely breathtaking! the food was excellent - the salmon in particular, with the chocolate pistachio icecream for dessert! the salad was also one of the best I have ever had! \nService was very attentive! we had a reservation for 2 but they very sweetly adjusted it to accomodate 2 more people - although we waited at the bar for about 45 mins to get the adjustment. I didnt mind at all - the views were absolutely breathtaking!", "author": "A I."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-08-15", "description": "Wow, what a view!\n\nHad dinner hear as part of a private event, and we had an amazing view of downtown Manhattan from under the Brooklyn Bridge.\n\nI think this place would be a perfect spot for a romantic dinner.  There was a HUGE display of fragrant flowers as you walked in.  Don't know if this is always there, but definitely a nice touch.\n\nIn terms of food, we had a fixed menu of some great dishes. \n\nStarted with some light h'ors d'oeuvres, including hummus on artichoke, perfectly fried shrimp, and a few other items.\n\nThen, a wonderful salad with some of the best croutons I've ever had.  The croutons were extremely crunchy yet light and fluffy, if that makes sense.\n\nThe fish course was a blackened salmon with green beans and carrots.  The fish was the weakest link in the menu, but the green beans and carrots were perfect.\n\nThe meat course was the highlight of the night.  All I can remember is the absolutely perfectly cooked pieces of beef tenderloin (it appeared to be sous vide), and the very subtle flavors of the gravy/sauce.\n\nFinally, we ended with a dessert which, by this time, I don't remember what we had because of the heavy pours of the wine ;)\n\nBesides the view and food, the wait staff are friendly and attentive.  All around a great meal!  Can't wait to bring my wife.", "author": "Richard K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-01-10", "description": "This restaurant is simply divine. From doors opening every which way you walk, to superb service, an amazing view, and, let's not forget the food. There was a wedding going on when we got there, so I'm sure if there is dining in that room usually, because the main area looked small. But, the view was simply beautiful. \n\nMy boyfriend, well, fiance, originally planned to propose to me two nights ago, but he decided to do it new years eve instead. They still gave us the window seat, though there's no bad seating, really. \n\nThe staff knew we had theatre tickets, and ensured us that we would be able to make it to the show because they rushed our order. The atmosphere is really rice, but when they offered us a tiny espresso cup three quarters filled with soup, I was doubtful. But the soup was just to whet our appetites, I guess, and it was deliscious, with a little crunchy disc of bread in there. \n\nThe bartender was great, and he even refilled my daquiri before they brought it over from the bar, free of charge. I ordered the foie gras, not really knowing what it was, but after I was told I didn't want to back down. I ordered the french toast and apple version, and while I can't say I'll be ordering it again (not a huge fan of animal organs) it wasn't bad. My fiance ordered the rock lobster, which was pretty good, and they offered us bread from a silver tray and we chose between, french, grain, and olive bread. \n\nI orderd the branzino, knowing I like it, and he ordered the steak killed, natch. It was more than delicious. It was creamy, it was juicy, it was crispy and crunchy. They but a thin piece of amazingly crispy bread on top of it, and they pour grilled lemon juice around it, and honestly, it was astounding.  The only way I can describe it is pure and utter goodness. \n\nMy fiance loved his steak, but It could have been  supermarket bought for all I knew. They way he orders his steak (well), to me makes it not worth eating to me. He also loved his mini potatoes with blue cheese, though I am not a fan of blue cheese so I didn't find it too wonderful. \n\nThey let us order the dessert in advance, and since they knew about the engagement (since he called to let them know there would be no proposal) they gave us candles on each of our dishes as well as pink champagne. A little corny, but also very sweet and yummy! I got the brooklyn bridge, which was good but not wonderful. I did marvel at the brooklyn bridge chocolate, though.  He got something in which the name escapes me, but it was coconut with a raspberry sorbet. The sorbet was amazing, and he loved the coconut... thing. \n\nIt's very formal, but not snobby. Not a place that makes you feel like you should be grateful to be eating there. Wonderful atmosphere, excellent service, more than excellent food.  I want to eat there every night.", "author": "Katheryn M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-08-17", "description": "The River Cafe is beautiful.  You feel like your in a different world.  The army of wait staff abides to your every need so the experience is worth every penny.  However, the food though inventive, does not live up to the ambience of the restaurant.  I ordered the lobster omelette, which was not at all special.  The eggs would not stand on their own and the lobster was distributed in a way that you just have an urge to pick it out and eat it on your own.  I remember there were cute eggs filled with granola and homemade yogurt.  Beh.  Too much work for something so plain.", "author": "sarah h."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-10-28", "description": "The River Cafe is expensive but it's amazing. Much better steak here than at Peter Luge. The view is awesome and the location under Brooklyn Bridge is amazing. DUMBO is a cool area to explore now. Definitely splash out to come to The River Cafe at least once. Just book well in advance.", "author": "Luke V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-13", "description": "Unfortunately I have not yet had actual food here, but I have had drinks and cake! The view alone is every reason for going to The River Cafe! It is one of my favorite views of the city, and awesomely located beneath the Brooklyn Bridge ( my favorite bridge!) \nThe wait staff is extremely and exceptionally nice for such a high end place. Usually servers in such high end establishments are stuffy, rude, and unhelpful....it is quite the opposite here! \nI took my girlfriend here for a belated birthday celebration and got her a cake. The look of the cake alone was impressive...but even more-so upon tasting it. It was decorated with a chocolate replica of my favorite bridge, with 'happy birthday' written in chocolate sauce. It was delicious...sweet but not overpoweringly rich. \nWe had some sort of lemonade cocktails referred by the server....had a few too many as I cannot remember what they were called...but very refreshing. The atmosphere is beautiful and they always have fresh flowers, to me, adding even more beauty if possible. I look forward to trying the food next time I am there...it is very tempting as it smells so good:)", "author": "Tammy K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-02-14", "description": "What a dining experience!! Worth every penny!!! The food was excellent, the staff unlike any other! Great views of Midtown West and Brooklyn \u0026 Manhattan Bridges. Most romantic atmospheres around. Loved it. Can't wait to go back!!!", "author": "Guy N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-24", "description": "With the economy forcing the powers that be to extend Restaurant Week 2009 into Restaurant YEAR 2009, I was happy to indulge in Brooklyn's turn with their $24 three course lunches, dinners and, in some cases, brunches. I perused the list in TIME OUT NY and checked off my selections. So I made a list and my first lunch voyage was to one of the top dining experiences in Brooklyn, The River Cafe in Dumbo, on the relaxing shores of The East River. Opened in 1977, this New York landmark has an amazing view of Lower Manhattan. Michael O'Keefe's vision of great food, ambience and service is realized in the River Café. With Chef Brad Steelman in the kitchen, this restaurant under the Brooklyn Bridge is one of the most well known destinations in the five boroughs for the combination of romance and fine dining. This place is everything Tavern On The Green has aspired to be but the tourist trap that it is and historically weak menu has kept it from being. After a short A train ride to the High Street stop, I exited the station and sauntered down to the watefront. Upon arriving for my 1pm reservation, I noticed the formal circular cobblestone driveway that allows limos to drop off guests and swing around to park on the street. There were lights on the trees and at night it must be quite a beautiful sight. I came to to the door and was greeted by a well dressed doorman who pointed me down a corrider bridge to the riverboat restaurant. The lobby is lined with flowers, fake flowers, but still..a nice touch, also some sailing items and maritime paintings hanging from the wall add to the yacht club atmosphere. The hostess at the podium checked my coat and led me into the main dining room. There is a second dining room to the left reserved for special events and offers more garden-like surroundings. The restaurant tables are elegantly adourned with the finest linen tablecloths paired with wooden, wicker-like chairs and each table along the perimeter of the room has its own mini lamp. The servers are dressed in traditional fifties style waiter dinner jackets which is appropriate as most of them are in their fifties. The younger staff seem to be the assistant managers, hostesses and kitchen personnel. I had already looked over the Restaurant Week Menu on the website. My first course was a savory lamb meatball au poivre dish with russet potato puree and cognac sauce. It was a satisfying starter and similar in quality to the meatballs I tried over at Mia Dona, although these meatballs were a bit denser. I accompanied my plate with a refreshing Pinot Grigio ($10) which was generously poured..a nice change of pace of late. The servers were very attentive but not intrusive and refilled my bread plate without asking. The second course was a three cheese ravioli with wild boar ragu. This dish was as good as any you would find in the Italian restaurants of Little Italy or Arthur Avenue. Mario Batali would have given it a \"thumbs up\". Before dessert, I was craving a pre-cocktail. So I ordered one of my favorites from the bar..a classic Grasshopper ($13). The bartender made it well using the traditional recipe. But I still think Sam Ross at Milk \u0026 Honey makes it the best. Halfway thru my Grasshopper, my waiter said that the other guests were intrigued over what I was drinking. I love being a trendsetter. There was only one choice for dessert. The kitchen chose for the menu their signature River Cafe Duet of Marquis chocolate terrine coupled with a pear sorbet and home made vanilla wafer. It was nice and light and an end to a great lunch. This place is all class and I would like to try it again for dinner with a special someone..now I just need to find her. Three course lunch with two drinks, tax and tip was $60.", "author": "The Jedi Foodi E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-10-01", "description": "My friend surprised me for my bday by taking me here. I've been meaning to try this place, as there has been a lot of hype about the views as well as the food. I noticed a sign out front that read: \"PLEASE PARDON OUR APPEARANCE - The garden and windows at The River Cafe have been badly damaged by The Waterfall Project.\" By this I am assuming they meant the salts from the water. They use Christofle Hotel knives here. Service was professional and inobtrusive. We passed on the Choco Bklyn Bridge dessert due to the face that when we observed 3 people that ordered it, we didn't see anyone finish it.  Too bad they don't allow outdoor seating for dinner, only for drinks. The view is remarkable from there. Not dying to go back, but well done. \n\nWe Ordered the 3-course prix fixe ($98) - ignore their website - it says $95\n(I will denote standout dishes with an asterisk)\n\n-Amuse bouche (free) - slice of smoked salmon over a round cracker w/ cucumber raita\n*Foie Gras Two Ways [classic pressed terrine with fig jam and brioche melba toast poached roulade with coffee, date and almond crust] - wow, the coffee/almond crust sucked the gameyness out of the foie, coffee was a brilliant twist, surprisingly went well, the classic terrine was delish as well, very generous portions, but only served w/ 4 tiny slices of thin brioche melba, expected the fig to be caramelized more\n*Yellowfin Tuna [seared rare with foie gras stuffing, burgundy black truffle vinaigrette, sweet roasted onion puree] - loved this dish, the puree and vinaigrette were so synergetic, foie gras made this dish over the top, pancetta wrap being super crispy was a little slice of heaven\n-Prime Aged Sirloin Steak (+$7 supp)[charcoal grilled, handmade potato gnocchi and parmigiano gratin, roasted spring onions] - also garnished w/ halved cherry tomatoes on top, the caramelized onions, albeit paltry portions on top, made this dish SING!, ordered this medium, it was perfect in the middle but overcooked on the sides, expected more for +7 supp.\n-Cape Cod Monkfish [slow roasted suckling pig filled ravioli, muscat poached golden raisin puree, roasted mushroom filets, pork braising juices] - huge 3\" square ravioli, 2pcs of monkfish, this was nothing to write home about, just OK\n*Coconut Bavarian [blackberry - lime sorbet, lime syrup, blackberry compote] - sorbet was way too soft, perhaps it was on a hot plate, but the coconut tasted like a pana cotta, super rich and a thin layer of sponge cake under it\n*Chocolate Sticky Toffee Cake [pistachio ice cream sandwiched between dark chocolate cookies, butterscotch sauce, ronnybrook farm whipped cream] - opted out of the butterscotch sauce, cookies are really super thin, ice cream was heavenly and surrounded by pistachios on the outside, whipped cream was fresh as can be\n\nThey also offer:\nSIX COURSE CHEF'S TASTING MENU ($125) - ignore their website - it says $115\n-Taylor Bay Scallop Ceviche\n-Sauteed Hudson Valley Fois Gras\n-Maine Lobster Special\n-Colorado Rack of Lamb\n-Branzino Fillet\n-Dessert\n\nTotal came out to $127/pp after everything\n\nPics: http://www.meetup.com/teamfoodie/photos/449143/", "author": "Jeff C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2007-09-01", "description": "I found this place pretentious and pompous because having gone there with reservations for 12 and only 11 able to show, they didn't want to seat us. I think that kind of sucks, but what do I know? We left and went to Totonno's Pizza (read my review) instead.", "author": "Rob H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-11-30", "description": "Fantastic!\n\nOur server, Josh, took great care of us-- above and beyond.  He ordered extra desserts and tastes for us, because I wondered what the buttermilk sorbet tasted like.  We also received their pumpkin pie as a \"birthday\" surprise!!\n\nGreat views of the NY skyline and Brooklyn Bridge at night.  Well worth paying the price of the meal.  \n\nIf we had it to do all over again, we'd probably bring our own wine and pay corkage-- if it's an option.  That was the only thing that bulked up the price of our meal a little beyond expectation. \n\nAt $90 for a three-course prix fixe, it seemed \"fair.\"  But after ordering two bottles of Veuve Clicquot ($120 each) and a bottle of water, somehow our tab inflated to almost $650 + for 4.  With tip, we paid $800+.\n\nOne of the most expensive meals I've had in my lifetime, but again, well worth it.\n\nIf anyone is looking for a place to get engaged, this is it!\n\nWarning: Men must wear jackets.  No jeans allowed.", "author": "Anna V."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-06-10", "description": "I was looking at this venue for my upcoming wedding. I called Luke who is river cafes party coordinator. I called him a number of times and left numerus messages, he never returned my calles. Finally after a month I finally got  a hold of him. My fiancé and I scheduled a walk through with our families for 6pm. Upon arrival Luke, was very unpleasant. He had an attitude and didn't did a good job answering our questions. The venue is very small I was hoping to have a chance to sit down and go over prices. Luke rushed us and made unpleasant comments and rolled his eyes when we asked questions. My fiance's father was running 10 min late so when he got there we asked Luke if we can show him the 4x by 4x room in which our ceremony would take place. He looked harshly at my man and said well I have to get ready for an event...NOT COOL. They charge up the ass and I would think a place which is held to such high standards would show a little more respect to potential clients. We asked him to send us a sample invoice back in May. We have received nothing from him. When we called him he said he \"forgot\". Only nice thing about this place is the view.", "author": "Biana M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-08-26", "description": "I came here with guests from out of town and it lived up to everything I expected it to be: amazing view, great food.  I'm surprised there are so many comments on service - our waiter was great and his food recommendations were right on.\n\nAs much as I enjoyed this place, I only feel the need to do the full dinner here once.  Now that I've had the experience, any repeat visits will probably be for drinks and appetizers.", "author": "Lauren A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-03", "description": "As everyone has commented already, the view is to die for. I mean, i daydream about being proposed to there with the new york skyline as the backdrop. man, I sound like a naive tourist. I'm not- I don't even own my own camera to hang around my neck.\n\nnot to sound like an ultimate douche, but my dad has been going to river cafe for 20+ years so he knows the maitre 'd and the pianist so we get treated very nicely. the pianist, don, he plays the Japanese song \"sakura\" every time I go. He's extremely nice so chit chat with him, request a song and don't forget to tip him!\n\nThe service and ambiance is amazing but the food could be A LOT better. The head chef hasn't changed since 2001 but the sous chefs have so the dishes have changed, and NOT for the better. The beef tartare was pretty good, and the sauteed fois gras was okay but it came with a weird strawberry crepe-would have just liked toast. My brother's steak tasted pretty burnt, my duck was nothing special, and my mother's lobster looked/tasted something from a cheap Chinese restaurant. Mt dad's halibut was probably the best.\n\nThe dessert chef also has changed since I last went last summer but unlike the rest of the meal, the desserts were better than last time. We were treated to two extra desserts besides the 5 we ordered (went with the fam + uncle \u0026 grandma) so I got to taste most of the desserts: Caramelized Apple \u0026 Almond Tart, Coconut Bavarian, Goat Cheese Cheesecake, Chocolate Marquise Brooklyn Bridge, Chocolate Sticky Toffee Cake, Sorbet Plate, and Traditional Ice Cream Plate. I say the cheese cake was the best; the chocolate sticky cake was WAY to sweet.\n\nYes, the food could be better but in the end, I will KEEP visiting this place because there is no other place like it.", "author": "S Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-10-10", "description": "This is by far the most romantic dining experience I've ever had. \n\nThe floral courtyard and Christmas lighted trees lining up the long cobblestoned driveway gives this place a fairy tale appearance. The ambience is uber fancy where a jacket is required. A piano player provides all the music reminiscent of Sinatra.\n\nThe view of Brooklyn Bridge \u0026 the Manhattan skyline is breathtaking. If you do make a reservation here, ask for a table by the window months in advance. The full experience is well worth the wait. \n\nFor appetizers, we had the buffalo steak tartare \u0026 warm pear salad. For the main course, we had the prime aged sirloin steak \u0026 wild striped bass. Every dish was absolutely amazing \u0026 we enjoyed over indulging ourselves here.\n\nFor dessert, I had the chocolate marquise Brooklyn Bridge, a terrine of toasted hazelnut \u0026 tiny scoop of vanilla ice cream. It comes with a centerpiece in the mold of the Brooklyn Bridge made out of chocolate. With all the effort they put into the mold itself, I was afraid to touch my dessert.", "author": "Wendy C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-04-25", "description": "My favorite place to be romanced in NYC.  I dream of my return...", "author": "Marie B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-14", "description": "Good food, nice view, tourist-y crowd.", "author": "Tabby M."}], "servesCuisine": "American (New)", "priceRange": "Above $61", "name": "The River Café", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Water St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/C_8aEbAvcCLhiqXn9QdWSw/ls.jpg", "@type": "Restaurant", "telephone": "+17185225200"}