{"aggregateRating": {"reviewCount": 1049, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-28", "description": "Excellent. Delicious food and great service. We attended a dinner party and everything was perfect. There was a menu chosen for guests and do to dietary restrictions comparable and delicious substitutions were made without any issues. I loved the crispy shrimp appetizer and the scallops with taro and citrus. There is a beautiful setting overlooking manhattan, on the water and just to the side of Brooklyn bridge. What a great view and space!", "author": "Andrew C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-03-22", "description": "HA! WHERE DO I START?!!\nI just left so this is fresh on my mind.\nFirstly, I will begin by saying even though I didn't have a confirmed reservation, they were willing to accommodate me. \nHere's the tea.\nI was appropriately dressed, lovely midway (longer than my knees) dress and heels, but still got the third degree!\nThe blonde lady, w the round face was pleasant at the end (she was the one who confirmed I can still be accommodated) but the brunette with the long pointy nose?! Began questioning me about the establishment. Our exact conversations, verbatim: \n\nBlonde: are you gonna eat at the bar? Grab some drinks?\nMe: Excuse me?! I have a reservation. Well, I believe is wasn't confirmed so I'll need a confirmation. \n\nShe helped and that's why they got the 1 star. But the brunette?!! \n\nBrunette: have you been here before? \nMe: *Excited * no! But I'm excited! \nBrunette: *dull expression * oh, well are you familiar with our menu?\nShe proceeds to grab a menu and that's when I realized the prejudicial undertone in her questioning.\nI stopped her immediately and said well I took a look at the menu already.\nBrunette: oh ok, so you're aware of our price--?\nMe: yes I am. \n\nIT GETS BETTER!!! \nBut before I was even addressed, a white couple walked in, brunette: Hello and welcome!!! what time is your reservation?\nOh! So the white couple doesn't get asked if they have been there and is familiar with the menu and prices but the black girl does???\nSo the white couple doesn't get invited to the bar for drinks which is less expensive because you think they cannot afford dining in the main area but the black girl does?!\n\nDidn't even stay to enjoy this Michelin star restaurant people rave about. \n\nTrump is in power and all the prejudicial \u0026 racists acts can finally egress! Feels good to be free huh The River Cafe?! \n\nI have dined at fine restaurants, Michelin star and all and dressed less exquisite and was treated WAY better than a restaurant w a view of the bridge in Brooklyn. You should be ashamed River Cafe!!\n\nBy the way, THE PRICES ARE ON YOUR WEBSITE SO STOP SCREENING YOUR PATRONS! WE KNOW IT'S  $125PP! I've dropped $500+ on dinner, puh-lease. \nI may not 'look' like I have $ but trust I do.", "author": "Toya H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-05", "description": "The location is beautiful right under the Brooklyn Bridge. This restaurant is so beautiful with the garden, lighting and huge ceiling to floor windows. We waited for our table at the bar. We took our glass of wine outside and enjoyed the sunset while we waited for our table. The view is beautiful as the sunsets and after the sun sets, the breath taking view of Manhattan's skylines. \n\nThe food was delicious, we went with the six course tasting menu at $155. We started off with the three shells appetizer with the abalone, oysters and ceviche, which was delicious. Then we ate a fried seafood ball that you dip in this amazing cheese sauce. The main course was the lobster. It was amazing, the shell was removed, the texture was perfect, the flavors were on point. I am not sure what the dessert was but it was perfect and the mousse was delicious. I wish I wrote down each course of the meal, but we were enjoying our time together and took minimal pictures. We want to come back when we are in New York. I will remember to do a better job then.", "author": "Katherine Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-12", "description": "I've been here twice and the service, food and ambience is exceptional. The best part of dining are the deserts and the views. After or before dinner you can walk by the pier. Make sure to get a table by sunset.", "author": "Perel D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-11", "description": "The restaurant has a stunning view of Manhattan. Food is unforgettable. I got the steak tartare as a starter and lamb chops as my main course. Delicious.", "author": "Mackenzie R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-03", "description": "I came here for a bachelorette luncheon on my most recent visit to NYC.  The restaurant is a small floating building right on the Hudson.  You can see the Brooklyn Bridge from almost everywhere in the restaurant and the outside area is absolutely beautiful. I loved all of the bright flowers and the great views.  The inside is a little small and a little crowded for my taste.  I really enjoyed the pianist who played a lot of soothing familiar tunes.  \n\nThe menu is pre-fixe which I am not generally a fan of because of my food allergies.  They were able to change up my appetizer and main course to make it allergen-free for me but I paid as much as everyone else with less of the taste :(  Still, the food was very fresh and tasty.  I had the fluke as my appetizer and the monkfish as my entrée and both were very enjoyable, if a little bland (again because of MY food allergies - nothing really that they could do); \n\nThe service was phenomenal.  The staff was very attentive and very interested in making sure we had a great time.  I was a little confused that the brunch was no longer being served at 12:30 because we were supposed to be going there for brunch but the lunch menu was so good that at the end of the day, I'm glad we lunched instead.\n\nThis location seems like it would be perfect for a romantic evening with that special someone.  I'd like to come back sometime and check out the dinner menu and see the views at night!", "author": "Erica R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-05", "description": "I celebrated receiving my Master's degree at River Cafe and what an amazing experience!! The location is perfect with a stunning view/sunset, the staff is very organized and pleasant and the food is absolutely delicious. It's a quaint, intimate setting with elegant decor. I will certainly visit again! It's worth the money!", "author": "Tiffany W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-22", "description": "Came here with a party of 6 and was greeted with the utmost service. Our host, Josh and the waiters made sure we were satisfied throughout the night and adjusted many of our courses on the pre-fixed menu according to our peculiar tastes. The food was delicious! We got to try the jumbo shrimp, lobster, and a raw platter. The raw abalone and the scallops were so fresh and definitely opened up our appetite. Their steak was cooked according to my taste, just wished they had more of the sauce that comes along with it. I'm not a fan of desserts, but their signature Brooklyn bridge cake was really rich with chocolate and adorable.\n\n The view would have been amazing if it wasn't for the rain because this restaurant is right under the Brooklyn bridge and you get to see the skyline of downtown Manhattan. They also have a small little garden where you can take pictures. \n\nThe only downside I had was the table arrangements. They tried to fit as many tables as possible in that small space.", "author": "Hailey W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-09", "description": "Perfect experience from beginning to end.  As many have stated, The River Cafe has pretty spectacular views and, while the window seats are the best seats, there really is no bad table as they've gone to great lengths to ensue that couples can experience the stunning views while dining. I guess that I'm trying to say that it's romantic.\n\nWe had a 10 PM reservation and were a little worried that we would not have the opportunity to order the 6 course tasting, but it was not a problem and it was perfect!  Every dish was both gorgeous to look at and to consume. For anyone with dietary restrictions or allergies, they accommodate all.  If you have the appetite and/or just enjoy the tasting menu experience, this will not disappoint.  We opted to go without the wine pairing, but they wine list is really nice.\n\nThe service was outstanding, as well! Our hostess, Sonja was the perfect welcome and we were then treated to impeccable treatment from Brittany and Helena.\n\nWe loved this place and I HIGHLY recommend it!", "author": "Jon N."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-03", "description": "What a disappointing experience.   Terrible customer service.  We arrived at the restaurant's 5:30pm opening to an EMPTY restaurant in hopes to have a quick drink at the bar, only to NOT be seated as they \"leave the bar stools open--which cannot be reserved--for guests who are waiting to be seated for dinner.\"    Again, the restaurant was empty and no bar seats were reserved.   Very odd and disappointing not to be able to have a drink there.     Frustrating communication from the hostess at the front.  Pretty atmosphere.  Terrible service (or lack thereof).", "author": "Jenifer F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-06", "description": "Went to celebrate for the anniversity with my husband. Great food and great service!!!!! Great view of Manhattan as well.", "author": "Jee P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-10", "description": "From the attentiveness and professionalism displayed by the staff to the excellence of the food, dining at the River Cafe is a great dining experience. Looking forward to returning.", "author": "Jerome d."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-05-06", "description": "All in all, it was okay. \n1. The manager guy needs to be a little more friendly/polite. \n2. The tables are too close to each other. \n3. Food: we had the scallop+pork belly and beef tartar for appetizers. They were very delicious. The steak for main dish was also quite good but kinda boring since it doesn't come with anything else except mashed potato. The lobster dish was a fail, i dont know why people rave about it. There was nothing special and the balance between the lobster and the pasta was kinda off. The black pasta was a little discomforting to look at. \n4. Desserts - the brooklyn bridge and cheese cake - were just ok too. \n5. The view was just ok as well if you have seen other manhattan skylines. \nSo overall, i will not come back or recommend it.", "author": "NuttyNut L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-17", "description": "A classic New York restaurant at the foot of the Brooklyn Bridge.  The restaurant is on the water with a marvelous view of the bridge and Manhattan.  The food is wonderful, not old or too classic.  The service is excellent.  A real experience.", "author": "K. C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-04", "description": "By far one of the most romantic and special dining experiences around. I came here for my anniversary with my partner and it was a perfect evening. \nFrom the start the staff was highly attentive. They took our coats as we arrived and the maitre d' sat us promptly. Unfortunately, we did not sit by the window despite asking when we made our reservation. We were told that seating was left to the  maitre d' and it didn't happen. \nThe atmosphere is great and super romantic, however there were some guests that were rather disruptive during the night. First, a couple came with their young child (less than 2 years old) and the child was walking around to other tables but was quickly stopped by the staff and the parents were spoken too. Later on in the evening the child started screaming and the manager came over immediately and spoke to the couple and tried to distract the child. Clearly this is not a place for children and many people were annoyed, but thankfully the staff were very aware and sensitive to this and stopped any disruptions to others immediately. Second, there were two young women at the table next to us and after they finished their entrees and ordered dessert a manager was called to their table for what seemed like an issue with their service and dining experience. The manager was very professional and very nice and calm to these ladies, and offered them after dinner drinks on the house for their less than satisfactory experience. Regardless of these distractions, it was still a fabulous night for our anniversary. \nThe menu is a 3 course pre fix which includes appetizer, entree and dessert. All of the food was delicious. As an appetizer I had the grilled octopus and the steak with bone marrow mashed potato as my meal. The portions are perfect and everything is prepared to perfection! Last but not least, dessert was amazing. The Brooklyn bridge chocolate and raspberry dessert is a classic and truly lives up to all the reviews. The chef also sent over some additional mini chocolate and sweets with the desserts which was an extra special touch. \nAside from the distractions from other guests, the staff was highly highly professional and attentive and made our night absolutely special. I am not going to let other dissatisfied and rude clients ruin my evening or my review/rating because the staff handled everything perfectly. I would absolutely recommend The River Cafe for anyone looking to celebrate a special occasion or romantic evening.", "author": "Danielle S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-06", "description": "Rated 5 stars.  For the following reasons. \nExceptional service.  Very tentative \u0026 friendly.\nFood (\u0026 I have tried many dishes on the menu) \"delicious\".\nThe presentation, texture, \u0026 taste of each dish, simply mouthwatering. \nThe view.... Breathtaking..\nHighly Recommended", "author": "Lisa S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-11-25", "description": "The food was delicious, the wait staff was courteous but the maî·tre d's were beyond infuriating.   My husband was wearing a jacket and gave it to me because I was freezing by the bar.  TWICE they came over to see if he needed a jacket - after it being quite clear that I was wearing it.  I will not wear a shawl that they have laying around around - because who knows who wore it last.  We wound up leaving earlier than expected because I was so cold and couldn't handle the questions about his jacket. We were done with dinner and drinking at the bar.  I enjoyed the dinner but will never go again because the pretentiousness was overwhelming.  \n\nAlso, if you are going to nitpick about shawls/jackets - then redo your outdated chairs and make sure the maî·tre d's pants are the appropriate length.  \n\nThanks for the birthday memories... :(", "author": "Kristen G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-07", "description": "Great view! There is a dress code. Food is exquisite. Had the prefix menu for $100 which included $4 course meal.", "author": "Sumi S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-20", "description": "This place is simply top notch. Service, food, ambience are all 5 stars. Went for breakfast and everything was made to perfection!  Get the fresh juice and their bakery items to top it off.", "author": "Krishan M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-03", "description": "D I V I N E. Michelin the food already. Ernesto is godsent. Made the experience worthwhile. Needs to have breaksfast/brunch available on Saturdays. Will definitely be back.", "author": "Angel M."}], "servesCuisine": "American (New)", "priceRange": "Above $61", "name": "The River Café", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Water St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/C_8aEbAvcCLhiqXn9QdWSw/ls.jpg", "@type": "Restaurant", "telephone": "+17185225200"}