{"aggregateRating": {"reviewCount": 1049, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-17", "description": "Went here on the night of our wedding. Bar is great and wait staff are professional, courteous and friendly. Food is great and drinks are good too. Not too expensive for what they offer. Parking staff a bit inexperienced! All in all, a great romantic night.", "author": "John B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-21", "description": "All in ONE\n\nFood, location, view, decor, music, staff, wine selection, atmosphere\n\nMy dinner at The River Cafe few months ago ranks as my most romantic and highly memorable gourmet experience in NYC ( I know I know it is actually in BK) so far. I always used to stop by for a drink at the bar during the day when I had friends in town. But I knew one day for a special occasion with special someone I will show up for dinner in LBD :o)\n\nI had the Foie Gras two ways complimented by Sauternes wine which was absolutely divine. The way it all melted in your mouth and hit all of the taste butts including those you though you don't even have was out off this world. \nFollowed by white truffle honey and fennel pollen glaze, duck leg and potato croquette, organic carrots, julienne bok choy. Yes, you guess it right - it was extraordinary. \nTo finish the great meal in proper way we did order the famous Chocolate Marquise Brooklyn Bridge handmade chocolate with a terrine of toasted hazelnut and Tahitian vanilla ice cream. Hmmm, hmmm let in your mouth for a bit so all the flavors have a chance to show the proper chocolate dance for you.\n\n\nWIth a wonderful bottle of red, smooth piano music in background, gorgeous  views of Manhattan in near distance and the best company one can ever ask for this ranks as to of the top. \n\nGo and fall in love.", "author": "Lada P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2010-05-12", "description": "Abundance of five-star reviews of this awful restaurant makes me wonder--was it just we who were singled out to receive a service that is a stuff of nightmares? Are my taste buds incapable of picking up the subtle flavors of this restaurant's food? \n\nBut let's start ab ovo. For his birthday, I decided to give my boyfriend the time of his life by bringing him to this famously romantic restaurant, and made a reservation well in advance. It was February, the landscape outside resembled an Agata Kristie crime scene, and it seemed that everyone but us was hopelessly snowed in. After arriving to the mostly deserted restaurant, we approached the Maitre 'D and immidiately offended him by our existence. Never in his life has he imagined seating such plebes! Averting his gaze, he carried on his phone conversation. \n\nMere 15 minutes later, he realized that we were still there, pestilent in our insistence to be served.  Before we even knew it, the birthday boy and I became the only customers who were not seated by the window, which made us feel extra special. Maitre 'D even managed to take our order despite the waves of  violent nausea he clearly experienced in our presence. After expressing surprise that even a person of such low class as I could pronounce the word \"chablis\" correctly (I practiced for hours in front of the mirror well in advance!), he disappeared for another 30 minutes. Of course, a mere half an hour is not enough to recover from being exposed to the foul masses, which is probably why, when the Maitre 'D appeared with our wine, he had a case of halitosis that could make a grown man cry. \n\nThe culinary artistry of the River Cafe's chef was wasted on us proletarians. Dishes seemed bland and greasy to our unsophisticated palates, but at least the portions were small. In any case, who cares about the food in a presence of such a great man--and such a formidable case of halitosis? \n\nUpon mercifully accepting our filthy money--$300, to be exact--Maitre 'D handed my boyfriend the filthy rags that we tried to pass off as coats, holding them with two  manicured fingers.\n\nIn short, before going to the River Cafe, ask yourself--are you good enough? Does your apartment smell of rich mahogany? If the answer is anything less than a resounding \"yes\", spare yourself the humiliation of being put in your place.", "author": "Olga F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-24", "description": "Foods great, service better, \u0026 views among the best! Great date night dinner \u0026 stroll around the area for dessert!", "author": "Christine S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-15", "description": "Went there for Restaurant Week lunch, drive in was like a secret garden =) would give this a true 3 1/2 stars\n\nService was okay...no one came to our table for a few minutes. the server taking drink order went to another table first as soon as they sat down then came over to us.  Later on asked for coffee before i went to the restroom....came back....still no coffee, however the captain fixed it and we kept getting coffee refills! and didnt charge us for coffee. \n\nWith previous knowledge of this being an expensive place the mimosa was still a mind blowing $19 (regular sized champagne glass)\n\nGET THE LAMB MEATBALLS!!!!!\n\nMAYBE might go back for dinner if they were paying =)", "author": "Raven C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-12", "description": "I absolutely ADORE this place!  I have been wanting to write a nice review about the restaurant for awhile. I live in the area and I love taking friends and family to the River Cafe. Even if it's just for a drink at the bar during sunset. I remember going here \u0026 dining here back in the early 90s ~ I loved it then and I love it now! A true gem in Brooklyn and must see for those visiting New York on a vacation.", "author": "Nancy N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-07", "description": "Best meal of my life!\n\nStumbled across this place during a freezing walk in the month of February. Boy am I glad we did!! It was pretty late at night when we came here and not many people were in the restaurant. As soon I walked in I knew this place was special. THE VIEW!!! We sat down at the beautiful table next to the window and looked across the river where you can see the beautiful Manhattan skyline. My friend looked at the price and said...\"guys it's $120 fixed menu to eat here, we can go somewhere else if you want\" \"I am not going any where!\" The view was worth the money, not to mention the sensational food and wine! It was a 3 course meal and you had several options to go with. We ordered a delicious bottle of cabernet for the table. I ordered the grilled octopus for the appetizer and it was amazing! I had the lamb for dinner and it blew my mind!!!!! It had thinly sliced potatoes under it that were divine!! I still dream of that lamb. I am not a huge dessert person but ordered the apple tart and had it with a glass of port. YUM Everyone was happy with their plate. I wish I tried food off my friends plates because they looked amazing but I was too entranced with my lamb! They ordered the lobster and the rib eye, both were said to be amazing.\n\nExceptional service and a meal I will never forget during a trip I will never forget! Thank you River Café for making it so special!", "author": "V. S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-01-30", "description": "Took my husband here for his birthday ... though the view was romantic (and we had a great time walking the brooklyn bridge to get there), there are so many other restaurants around that have MUCH better food at the same price (or less), so we will not be back. \n\nWe did the tasting:\n\nHighlights: \nScallop ceviche, Hudson valley foie gras, drinks (good pours) \n\nOK: \nBranzino (the fish was not the star of this dish...lemon and chorizo overpowered)\n\nMeh:\nWild Rock Lobster (rubbery, no butter??), Brooklyn Bridge Dessert (we didnt finish it--that NEVER happens. very bland!!) \n\nTerrible: \nSirloin (VERY dry!!) \n\nThe pacing was slow ... took over 3 hours to do 6 courses, and we never knew who our waiter really was. When it all came down to it, we really didnt feel like a 20% tip was deserved. \n\nBottom line: Great view, but for good food for a special occasion, head to a place like Le Bernadin or Eleven Madison Park.", "author": "Kate F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-08-13", "description": "Dining at the River Cafe is an experience like almost no other. In New York City, only the now defunct Rainbow Room surpassed it's view.\n\nLocated right under the Brooklyn Bridge on the Brooklyn side, this converted barge, has converted more people in it's 30 some years of life, than all the Witness's combined. What have they been converted to? A love of amazing food with a breathtaking view.\n\nBesides awesome cuisine, the bar is first rate, and if you don't want drop the dough on dinner, stop by for a drink. It offers the same view of the city that never sleeps straight ahead, and lady liberty to the left.\n\nWhen you go, make sure to take note of the World Renown Jazz Pianist, Dom Salvadore. Drop him a buck and ask him to play \"Under My Skin\" for me.\n\nWe loved this restaurant so much we had our wedding reception there, and go back each time we are in the city.", "author": "Shane B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-31", "description": "This place is special.  You want to seal the deal, celebrate an occasion or fall in love? This is the place.\n\nI love to have a drink on the back terrace if the weather is nice.  That's the best view in the world!", "author": "Alison R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-19", "description": "The River Cafe is my favorite upscale restaurant in all of New York.  I have been several times and have had a delicious meal and fantastic service every single time.  First, I love to walk through the garden right outside.  In the summer, it's a peaceful place to sit and relax for a few minutes in the shade surrounded by beautiful flowers.  \n\nAs you enter the restaurant, you are again surrounded by the most beautiful flowers (the restaurant has a full-time gardener!) and you feel as though you're on a ship almost (because you kind of are).  You're quickly whisked away to the dining room which has a breathtaking view of the water and lower manhattan.  Even the flower arrangements on the table are breathtaking.  \n\nAnd the food!  I always get the tuna tartare appetizer, and my favorite entree is the duck.  There is also a lovely chocolate dessert in the shape of the brooklyn bridge that I love.  It's such a special place!  My advice is to go for lunch when you can enjoy a lovely meal for a little less. \n\nIn fact, love this place so much that I even considered having a very small wedding here.  Now if that's not a vote of confidence, I don't know what is!", "author": "Ashley C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-18", "description": "What a stunning place... The view, the drinks, the sound of the piano and did I mention the view! Spectacular beginning of spring..  Definitely a New York must do!", "author": "Paris G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-22", "description": "Location, location, location.  Simply can't beat the view.  It would be great for a romantic date, and is especially great towards sunset.  The food is beautifully presented and always outstanding.", "author": "Brad H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-11", "description": "From the river cafe, we can see the most fantastic view of Manhattan. They also play opera in the restaurant. The desserts were nice. I went there with the other three of my friends. The chocolate Brooklyn Bridge was very nice. The sticky chocolate one is also good. But the one I ordered, that is sorbet plate was just fine. \n\nI will def go again to enjoy the view and the music.", "author": "Emily B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-09", "description": "WOW! I took my wife to celebrate her anniversary and we were blown away by the whole experience. The food, service, and view were exceptional. \n\nWe sat at a table with the wonderful view - Hudson, financial center, Brooklyn Bridge, Statue of Liberty, and the Empire state building all at once! For the first course we had the River Café Oysters and the famous Yellowfin Tuna stuffed with foie gras. For the main course we had Scottish Salmon and Colorado Lack of Lamb and the Chocolate Marquise Brooklyn Bridge for dessert. They were all above our expectations to a point where we were asking ourselves: how could someone prepare food like that? \n\nIf your an HSBC Primier client, they have partnered and you get the window view, the Oysters and a glass of champagne as a perk. The chef is supposed to come to your table as well, but we didn't get that part, but still - the best meal of our lives.", "author": "Tulio T."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-06-12", "description": "Dear Katherine, I made my reservations with 6 weeks of advance and made sure to email, call and put a note on my reservation that I was VEGAN (NO EGGS, DAIRY, ANIMAL PRODUCT!) and insistently called back a bunch of times to try to see if they would accommodate me. all I got was that I could have a plain bowl of vegan pasta for $100. that's sounds great to me, better put some white truffles in there! awful!", "author": "Mary N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-02", "description": "WOW. This is place for special occasions. The service is great, the food was wonderful and they don't skimp on the portions or extras, and the view is one of a kind. \n\nMy wife and I celebrated our first anniversary here this past weekend. Her brother had got us a gift certificate to cover a dinner for 2 (which in itself is a great idea for a wedding gift - it takes the stress out of picking a place for your anniversary). \n\nI timed my reservation for sunset, but I was a little displeased that I couldn't request a window seat ahead of time even for our anniversary (in hind sight, everyone there is probably celebrating something special so they wouldn't be able to accommodate each request.) We were seated one table away from the window and could still fully appreciate the view. All of the seats are pretty  good as this is a long and narrow restaurant along the waterline. \n\nThe wait staff was very friendly, informative, and attentive. There was a lot of table side service and presentation. \n\nThe walk to River Cafe is magical in itself in that you are slowly approaching the enormous base of the Brooklyn Bridge and then you spot this lush, beautiful garden out of no where. I would recommend coming early to take it all in and enjoy the experience. This is a leisurely, romantic dinner. We were there for over 2 hours - we did not feel rushed nor were we waiting for some to take our order or bring our next course. It's really nice to slow down. \n\nOn to the food. \nWe were greeted with a small gazpacho which was great and a watermelon medallion with shaved feta and mint amuse bouche that was perfect since it was 90 degrees outside that day. \nMy wife started with the foie gras 2 ways - they give you 2 good sized portions (either of the 2 pieces ran larger than any foie gras I have ordered in restaurants in the past.) They were both fantastic - buttery and perfect. I had the Waygu beef tartare with quail egg - it comes out deconstructed and \"constructed\" at your table. I wish I could have tasted the bare beef before the egg, Cognac gelée, mustard, chives, caper puree, and who knows what else was mixed in; however, it was great as is too. \n\nFor the main I had the lobster special which was tail and claws (de-shelled) over a tasty tamali. Dont get me wrong, it was great, but I wasn't blown away like with everything else.  My wife had the New York sirloin with sweet potato gratin with blue cheese fondue. WOW. Thank God this thing was a pound or we probably would have fought over it and the newly wed stage would have some to an abrupt end.  \n\nFor dessert we split the goat cheese cheesecake (not too rich, severed with a tart lemon sorbet - more like a great lemon ice) and the peach souffle also served with ice cream (I love how a lot of the desserts come with ice cream which I believe they get from the Brooklyn Ice Cream Factory next door which makes me love it even more.) \n\nI believe their were also some petite fours but my selective instincts steered me away from these to save room for the ordered desserts. I was already stuffed from the apps and entree. Our severe also brought out a small plate with candles and a thin chocolate with happy anniversary written on it along with Earl Grey and toffee chocolates. A nice touch\n\nAll in all this was a great dinner that made our anniversary very special. I was all smiles during and painfully satiated afterwards (Note - you might feel to sexy after this meal.) It was also the most we've ever spent on a meal but we both felt that considering the location, the service, the food quality and portion sizes, dollar for dollar it was totally worth it - it's just a matter of finding those dollars and for that we are very grateful for our wedding gift.", "author": "Piruz M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-15", "description": "Aside from boasting an incredible view of the Manhattan skyline, this place has an incredibly classy, romantic ambiance to it that screams New York. I had high hopes for this place before my first time here and I was blown away. The service is impeccable, everyone is dressed up (men are required to wear coats in the evening / night) and the food is amazing (well at least their steak is). If you are looking to impress someone whether it's out of town guests, significant other etc. then this is definitely a place you should consider. If you do come for dinner, then be sure to come a bit early and soak on some of the views from out front (the view is simply jaw-dropping). The walk to/from the subway is not too far but it's not necessarily the nicest neighborhood (not dangerous but rather dark and dimly lit sidewalks).", "author": "E E."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-03-07", "description": "Food was great.  Steak, lobster, bisque, braised beef ribs were killer, goat cheese cheesecake, a few others.  Not extremely unique but really well done.  Service is quick.  Somebody always seemed to be around to ask how things are, but sometimes it's too much.  Saw too many servers just standing around.  \n\nDidn't feel intimate for a restaurant such as this.  We went on our anniversary.  Then they sat someone right next to us towards the end, literally 8 inches away was their table.  Didn't seem too classy, started getting noisy at that point too as the evening went on.\n\nExpensive is relative so it's hard to say who will find this place to be worth it.  I thought for 300+ it wasn't a good deal.  I don't mind paying a lot, but the experience has to be great and this was lacking a few things.  We prefer One If Bye Land, Two If By Sea in Manhattan over this.\n\nView is nice but you can get that from the park next door for free.\n\nReservations are not as hard to get as some are making it sound.  Weekends you need to do 2 weeks in advance, weekdays always have openings.  I had to change our plan several times so I know.", "author": "Bat M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-02-27", "description": "This restaurant is absolutely amazing.  The atmosphere is stunning, looking across the water to Manhattan at night was breathtaking.  Probably the most romantic dinner I have ever experienced.  This is a place you need to dress your best for.\n\nThe staff was attentive to our needs and we never felt as though they had forgotten about us.  The dishes are perfectly portioned and the flavor to die for.\n\nI would highly recommend it for anyone trying to have a fancy night out with your loved one.  Be prepared to pay a lot of money though.", "author": "Jennifer W."}], "servesCuisine": "American (New)", "priceRange": "Above $61", "name": "The River Café", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Water St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/C_8aEbAvcCLhiqXn9QdWSw/ls.jpg", "@type": "Restaurant", "telephone": "+17185225200"}