{"aggregateRating": {"reviewCount": 1049, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-02-28", "description": "It was my first time for Brunch here recently and I loved it.  Delicious amazing food (omlettes with black truffle cheese and lobster tail), great views and such a nice treat for a special occasion.  Definitely get there at least once.", "author": "Eat It B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-05-01", "description": "For a fine dining experience this is the place to go. The food is superb. The service unmatched. Our food arrived, The steak was delicious, the fish tender and seasoned to perfection. Dessert -the brooklyn bridge wow! Good stuff.\nFor a special occassion this is the place to go...be ready to drop $125 pp", "author": "M.P R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2007-08-27", "description": "I took my boyfriend there for his birthday and it was absolutely amazing. Service was great and food was even better. I didn't even care about the price, when food is good, money is not a problem. I will definitely go back", "author": "Sarah S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-16", "description": "i made reservation a month in advance... i was celebrating my bday n i love it!!!NIce manhattan view,excellent service, delicious food, good wine, but people are boring over there except u with your company which i had!!! ...i think its for people who want just quite n elegant evening...but good to experience it !!!and $100 per person n jacket required(men)...", "author": "Anya A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-11-06", "description": "Delight! Total delight! Exceeded all expectations, which were set very high. \n\nLooking over to the Manhattan skyline, The River Cafe first blows you away with its tremendous view and atmosphere. My girlfriend couldn't get over the gorgeous display of fresh flowers at the entrance.\n\nMy family all ordered the course meal and we completely recommend this to anyone looking for a unique food experience. All courses are delicious. Our waitress was excellent and very friendly.", "author": "John A."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-07-12", "description": "The food is good, but the service is not as good as people described. My friends and I went there this week. First, they did not give us the seats which are next the windows. We saw there was a empty table which was next the windows, so we asked the maitre'd whether we could change our seats. He just said''No'' and did not give us any reason. We felt uncomfortable at the time. Anyway, I will not visit this restaurant anymore.", "author": "Lee Y."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-02-13", "description": "Let me start out by saying I USED to be a fan of the River Cafe, my husband was never really impressed.  I enjoyed the quality of food (specifically the lamb) and so my husband would be the good husband that he is, and take me to the River Cafe on special occasions.  After going to the River Cafe for a pre Valentines date last night, we will NEVER go back.\n\nMy husband had bought me a gift certificate for the holidays because he knew how much I enjoyed The River Cafe.  He picked up the gift certificate back in December IN PERSON, made the reservation for February 12th, and nobody informed him that he needed to wear a jacket to dinner.  Strike 1, River Cafe.  THEN, when he was called by the restaurant to confirm our reservation a few days ago, he was AGAIN never told to wear a jacket.  Strike 2, River Cafe.  Great management you have!\n\nFirst off, my husband wears a suit and tie everyday to work and would have been very happy, as would I, if he was in a suit, but because nobody informed him, how was he supposed to know?  He was also dressed very well last night in a white collared shirt, TIE and sweater over the tie.  He was also wearing khaki slacks and shoes he would normally wear with his suit.  He was dressed way better than some of the clowns I saw that just-so-happen to have on jackets.\n\nWhen we arrived at the River Cafe last night (via cab from Manhattan) the minute my husband took off his winter jacket he was bombarded by more than one EXTREMELY obnoxious hostesses (as if they were waiting for their next kill).  The the very frumpy, and definitely poorly dressed hostess, informed my husband he had to be in a jacket to enter the main dining room or else we would not be able to eat.  Obviously there are restaurants that require a jacket and I have been to plenty in Manhattan, many restaurants a lot more upscale than the River Cafe, but a restaurant that doesn't  inform their customers, to me, is lacking management and almost poking fun of the people who come to eat sans jacket.\n\nThe rude hostess said he would then have to wear a borrowed jacket from the River Cafe.  Not only was my husband in a tie, but compared to the way others were dressed at this venue, we were extremely insulted and I wanted to get in a cab and go straight back to Manhattan, but because we had purchased a gift certificate we wanted to make the best of it and decided because of the way we were treated we would make this our last visit to the River Cafe.  \n\nThe jacket he had to wear was extremely insulting and had a huge pin that said River Cafe.  We both sat throughout our entire meal, extremely embarrassed and disgusted because not only was he wearing a jacket that looked like it hadn't been washed in months, but it had a huge River Cafe pin on the lapel almost 'mocking' us.  On a side note, we ended up sitting next to a couple that wanted to sit side-by-side next to each other as they shared their dessert.  The minute they changed seats they were again bombarded by the waiters (like sharks circling their prey) and were reprimanded by the waiters, telling them they could not sit that way, restaurant policy.  For a restaurant that doesn't even allow you to choose a-la-cart, and demands a prix fixed meal EVERY NIGHT, I rather not pay so much money for prison-like conditions.  There are MUCH better restaurants in the city that aren't so uptight..  Good job River Cafe, you lost a regular customer because of your \"prison-like-policies,\" and we will not only ever come back, but do what we can to make sure others do not go to your restaurant  and have to put up with the embarrassment that we put up with last night.  Not to mention the potential bed bugs that could be hiding in their unwashed jackets, something I could not get out of my mind throughout the whole dinner and after we came back to our Upper East SIde apartment.", "author": "Stephanie D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-10-31", "description": "Very nice view and a place to know if you want to appreciate beautiful restaurant and good food", "author": "Cecile D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-29", "description": "Without a doubt one of the most romantic spots in the city. The atmosphere, the food, and of course, the view are unparalleled. While the Cafe skews on the pricier side,  you could get away with even just coming here for dessert and drinks. Honestly, while it seems over the top at times, the River Cafe is a special place that I think all New Yorkers should enjoy at least once in their lives. A definite must if you're in this part of Brooklyn.", "author": "Mike T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-10-24", "description": "Amazing restaurant with a fantastic view.  I got engaged there and the staff took great care of us and really helped us celebrate. The food was amazing and I highly recommend the chef's tasting menu.", "author": "Martin M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-08-18", "description": "Classy all across the board. Exceptional fine dining. It's epensive but you get what you pay for. I took my wife here for our engagement dinner and we go back quite often. The brunch is good too.", "author": "Ryan T."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-10-11", "description": "i cannot even review this place because i reached out to them to discuss possibly hosting my wedding there.  the events manager luke would NOT clearly answer the question as to whether the bathroom is wheelchair accessible. \n\nthese are all actual copy pastes from our emails.\n\nme: is your bathroom accessible?\n\nhim: The restrooms are a bit tight,\n\nme: When you say the restrooms are \"a bit tight\" does that mean that they are too tight for a wheelchair?\n\nhim:I think it would be difficult for a guest in a wheelchair to use the restrooms without assistance\n\nme: I just need you to please clarify - can a person in a wheelchair use your bathrooms or not?\n\nhim: A person in a wheelchair would most likely need assistance to use your restrooms.\n\ni had to CALL HIM and he proceeded to get defensive that my question was unclear.\n\njust wow.", "author": "Mel H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-31", "description": "Some places on the water with a great view don't bother with good food, but we had a very well executed meal here after walking the Brooklyn Bridge. The service is very professional and they dispel any notions of this place being a casual restaurant - this place has a Michelin star! You may be a bit confused by the mix of formally dressed staff and an eclectic garden-furniture decor and clientele that is equally mixed, from groups that look like they just came from the country club or park ave to people in T-shirts or big hair and bigger nails (and we were dressed like tourists who just walked across a bridge!). Let the confusion go, order eat and enjoy the view. I found the place to be like an oasis.", "author": "Ian K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2006-10-09", "description": "We have been going to the River Cafe for many years, you can count on the view the service and the food BUT you can't count on the crowd.  The last time I was there there were 2 high priced escorts with business men and a table full of tourists with shorts (it was lunch) but still who wants to sit with all this at these prices?!", "author": "ExPark S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-05-10", "description": "So,...I gets myself back to the hotel just in time to gussy up for dinner. All day long it has been a surprise as to where we's guys is going to eat. Usually, Sunday dinners are held at Picholine, off of 64th St. near Central Park. Picholine is no longer open on Sundays, on account'a dey open up a new place, capisce??? LOLOL. I don't want to say it is a good thing, missing Picholine, but..., we would never have been able to afford to eat at The River Cafe', on our own. The River Cafe' is located directly under the Brooklyn Bridge, now also on a barge. River Cafe' has been voted one of the five best restaurants in NYC every year for years. It opened in May of 1977.\n \nI think the original cafe is located on the dock. Word is that not one bank in NY would lend money for start up. Somehow, money was found (thank goodness) and from the first day of opening it was a resounding success. Upon entering the restaurant area, one can hear the tickling of ivories to the left and the sweet aroma of roses and other assorted flora. We were seated one row back from the window tables, at a round table, as there were twelve of us this time. I swear, Alan Colmes was sitting right across from us. Dinners here are Prix Fixe $98, so I went for the lobster. I don't know how they got all the meat out of the shell without tearing it up, but it sure looked like an entire lobster to me, sans/shell. The lobster was sweet and not over cooked. Susan had steak that was fantastic...we order different things and share. They also have a seven course Chef surprise meal for about $30 more ($130 per person + drinks), but only a few of us felt like being surprised and it has to be a unanimous meal choice for the entire table.\n\nDecadence is overused, especially where chocolate is concerned. The signature dessert for this restaurant may be an exception. It is a chocolate mousse foundation that supports a bitter sweet chocolate replica of the Brooklyn Bridge. So rich and creamy smooth...MMMMMMM!!!!!  Did I tell you how we all got to River Cafe' and back to the hotel? Our hosts sent limos around...Wow!!!\n \nAnyway, as night descends on the New York Harbor, lights of Manhattan begin to illuminate across the bay. The Statue of Liberty and Government Island, to the East and South, become visible as well as the Empire State building, towering over the tops of the rest of Manhattan's tallest structures. The entire water side of the cafe is glass so it really provides a totally unobstructed view of the \"City\". Can't say enough about\nthis place or their food to do it justice, so will hope you can go there some time. Be sure to get reservations, as there are never any empty tables, ever.", "author": "Lawrence H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-18", "description": "3 stars for food, 5 for view, we went there last summer a week prior to fleet week-the fire boats were practicing shooting red, blue and white water into the air with the sun setting behind manhattan.  Our meal was good, not memorable but well prepared and we had a delicious chocolate mousse that was designed to look like a small brooklyn bridge.", "author": "Deborah H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-08-31", "description": "I been here a couple of times and I have not been disappointed yet. The menu changes according to the season. The view and ambiance is breath taking. The service is amazing. Everyone seems too professional so it's fun to act silly and break the tension with all the staff. The best advice is not to go here for major holidays like Valentines Day. You'll blow over $600 easily and nothing special occurs on that day. It's the same food and service you'll get on any other given day. I hope to see this place soon because I'm in love with it.", "author": "Dorian S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-16", "description": "I'm still surprised about getting a chance to experience dining here and having an opinion to write this Yelp review because... good luck getting reservations. I was originally obsessing over this place because I grew up watching Coming to America and the scene when Akeem took Lisa on a date was filmed here! Each day I called the receptionist to check for openings and cancellations and finally got lucky and caught a cancellation. It was either reserving 2 months out or landing a no-show or be famous - which ever comes first. HAH-I took the gamble and got to go after calling for 5 days. The dinner was great and the wifey loved the chocolate Brooklyn Bridge Dessert. Everyone was well dressed, opulent, and rich. I totally did not fit in as a young HR Intern but I still felt pretty bad ass. The food was rich in calories so the course selection was filling. Spacing is also tight so if you are claustrophobic this might not be the best place for you. If you are also trying to have a \"private\" conversation like talking dirty or your next billion dollar website, the people around will be able to here your every word even at a whisper level but the ambience makes up for it and you will feel like your worth a billion dollars anyway so Enjoy yourselves! If you get a reservation that is.", "author": "Jinho P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-08-25", "description": "I haven't had dinner here, but I just spent the evening here with friends having after dinner drinks. We sat in the outside seating area and had such a great time. While there, everything else in NYC seems to slow down. It's quiet, the view is outstanding and the drinks were great. I'll definitely be back.", "author": "Brian M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2006-08-11", "description": "River Cafe is FANTASTIC! The service is absolutely amazing. I went there for restaurant week and the service and food were fantastic. The food is so flavorfull and the wine list is excuisite. They have a very sweet German Reisling that went perfectly with our food. I would def recommend it.", "author": "Jasneet G."}], "servesCuisine": "American (New)", "priceRange": "Above $61", "name": "The River Café", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Water St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/C_8aEbAvcCLhiqXn9QdWSw/ls.jpg", "@type": "Restaurant", "telephone": "+17185225200"}