{"aggregateRating": {"reviewCount": 1049, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-04", "description": "I just love this place. I know that there are new and interesting restaurants opening up all the time in NYC but I find the River Cafe eternally charming and romantic. The food is never disappointing, the flowers are never disappointing, and the view never gets old.", "author": "Jenna M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-16", "description": "Great place and service , food is amazing! Went there for our anniversary. The Brooklyn Bridge dessert looks good and creative and tastes even better! Also chicken, lamb and appetizers were all top notch.\nDon't forget great views and live music!", "author": "Anna M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-10", "description": "KenScale: 8.0/10\n\nRecently my wife Jun and I celebrated our first year anniversary since we became couples. How time flies so quickly! I was looking for a special place to celebrate that we hadn't been to (after all, we've been to A LOT OF restaurants...), and found River Café that sits beneath the iconic Brooklyn Bridge that we cross on weekends from time to time. The restaurant has been an old school classic until it shuttered during Hurricane Sandy. I don't know how the restaurant looked before the hurricane, but the décor inside and outside was absolutely charming, and the killer view of East River from our table was definitely something to remember for our special day. The food at River Café was overall satisfying as well.\n\nAt River Café, you can opt for three-course prix fixe at $130 per person or six-course signature tasting menu at $160 per person. For our special day, we wanted a full experience so went for the latter option. The dishes from River Café tend to be on the classical side than the inventive. The tasting menu felt a little bit dated that way, and there were some issues with seasoning or execution. Jun thought adding soy to the fresh abalone was a total overkill, and I wasn't quite sold on the scallop ceviche in the first dish. On the other hand, I liked the refined shrimp and king crabmeat accompanied by citrus Maltaise sauce that gave a nice flavor to the gently touched seafood (although Jun thought the flavor was a bit overpowering). Atlantic halibut that came next was nicely cooked, but we both left wondering why the maitake mushroom on top of the fish came out so salty. One of my favorites during our meal was the seared foie gras. I was pleasantly surprised that the kitchen brought out strawberry jam underneath the tender foie gras that added something new to the table. On the other hand, strip steak didn't come out the juicy medium rare that we typically like our steak to be. It was still a good steak nonetheless, with minimum seasoning just the way we prefer (the side dish of bone marrow Duchess potato and red wine mushroom marmalade next to the meat helped with adding flavor). Of the two desserts that came out, we liked the refreshing touch of coconut sorbet and raspberry granita, but the \"Brooklyn Bridge\" chocolate was too sweet, even for a sweet tooth like Jun. \n\nI didn't get much issue getting a reservation about two weeks in advance, but the restaurant was packed with a good mix of locals and tourists during our meal. There is full bar with some surprisingly affordable wine options in the expansive list. As noted above, the atmosphere is definitely a stunner at River Café so if you're looking for an awesome view while dining for a special occasion, this place is a nice option to consider for your next special anniversary. The restaurant requires jackets for all gentlemen, so bear that in mind as well. We wished our meal at River Café were as magical as the view of Brooklyn Bridge above us, but still there was enough to like about from the sophistication of cooking that we wouldn't mind coming back for another trip to Brooklyn. I look forward to more restaurant trips with my beloved wife for years to come!", "author": "Ken S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-09", "description": "If any employee of the River Cafe is reading this, please let the bosses know that requiring a jacket in the main dining room when it is 95 degrees and humid outside is downright criminal. There should be some reverse-white pants rule where no jacket is required between memorial day and labor day. If the view wasn't so gosh darn pretty, I wouldn't have bothered, alas, the location and ambiance make it a good spot for a celebratory meal. Although speaking of ambiance, everything is nice except, as another yelper pointed out, the chairs are like patio lawn chairs. I normally wouldn't mind straw chairs, but I'm also not normally paying $200 for a restaurant experience. \n\nThe food itself is ok, Nothing spectacular, but very solid. The wagyu tartare is pretty good, as is the rabbit app. The lobster main course was a little off and a slightly stale-seafood-y taste to it, but overall still aite. The branzino was really good because of this bread crust which I can only presume to be 80% butter 20% bread. So tasty, just run a mile beforehand and you're fine. The goat cheese cheesecake is light \u0026 doesn't have a strong tang to it. The lime souffle is good but not spectacular.", "author": "Monte H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-08-22", "description": "The atmosphere, decor, and view of The River Cafe are truly one of a kind. You won't find another restaurant that reeks a similar exclusivity with a beautiful private garden overlooking the Manhattan skyline. The River Cafe also requires jackets for gentlemen, so be ready for the formality.\n\nHowever, for a Michelin-star and very pricy restaurant, the meal was flawed. Mediocre and salty food all around. They seem to serve everything and lack speciality and finesse. All the waiter knew to say when asked recommendation was how \"delicious\" every dish is. He also asked about dietary restrictions but then never remembered them.\n\nWe were still eating our  desserts when the captain asked if we were finished -- well you do you see he forks on our hands? \n\nGlad I checked this place out finally, now onto the next fine-dining restaurant.", "author": "Mary C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-08", "description": "Two of us went to the River Cafe for a birthday celebration and it was everything I could have hoped for and more! I booked far in advance by phone and let them know it was for a birthday. \n\nWhen we arrived they seated us at a table by the windows so we really lucked out! It was a beautiful night and watching the boats float by and the sky change colors was amazing.\n\nThe restaurant itself is gorgeous, too, and very classy. A pianist was playing by the bar and the entry way was full of gorgeous white flowers. The service was exceptional.\n\nThe three-course menu is $125 per person and includes many options for appetizer, entree and dessert. All of the dishes we tried were excellent. The roasted rabbit was served with a perfectly delicate lasagna while the flavors of the sea scallop with foie gras blended perfectly. The lobster dish was incredible and the steak was cooked perfectly medium rare. It's worth it, too, to wait the extra 15 minutes to try the chocolate soufflé! And of course they remembered to bring a candle and chocolate that read \"happy birthday.\" \n\nAlmost everyone at the restaurant was celebrating some sort of event (how many candles does the River Cafe go through in one night!?) so the atmosphere was lively and festive. \n\nMake sure to explore the garden both before and after your meal. The twinkling lights were magical.", "author": "Sol C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-08-30", "description": "Celebrated SO Birthday on Saturday Lunch\n\nFood:\nWe ordered... \nFoie Gras with Sea Scallops - Perfectly seared scallops and foie gras, fresh mango on top add a great contrast, the sauce was underwhelming. The smoked onions were amazing, but did not fit in\nCrabcake with Sliced Avocado - Crabcake was dry, too much breading and not enough sauce to go with the crabcake. The sliced avocados were just a pretty decoration.\n\nRanch Strip Steak with Whipped Russell Potatoes - HUGGEEE steak strip that was seasoned well with a nice char on the outside! The red-wine sauce was also underwhelming, did not even notice it was there. The whipped russell potatoes were typical mashed potatoes.\nMonkfish with Caviar Sauce - Monkfish was well cooked, very tender and nicely seasoned. The sauce was tasteless, did nothing for the fish. \n\nBrooklyn Bridge Dessert - Amazing chocolate mousse paired well with the raspberry sauce and a dollop of vanilla ice cream! The dried bits and pieces of raspberry and vanilla added a nice gastronomy touch, but it was okay. \n\nService: \nWe made reservations through Opentable with special requests that it was a Birthday Celebration! We got window seatings with the best views of the Brooklyn Bridge! Towards the middle of the meal, a large family entered the restaurants and ordered bottles of champagne and wine. We felt that we were ignored as it took 45 minutes since clearing our entree plates to come and take our order for dessert and another 30 minutes for them to bring us our check. We tried flagging our waiter down, but he was nowhere to be seen. We tried flagging other waiters, but everyone seemed occupied with their own tables. I guess since we were not ordering bottles and bottles of wine, we were placed aside. \n\nOverall, the lunch is a great alternative to experience The River Cafe without breaking your wallet. The food and service was subpar, but it was a NYC experience you had to had once in your lifetime. It was one of those classic restaurants you had to try at least once.\n\nProbably won't be returning for the food, maybe for the Brooklyn Bridge dessert and a view of the Brooklyn Bridge!", "author": "Kim Y."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-10-09", "description": "Dress code?  I guess you want to keep the rift raff out of your establishment.  We were turned away because of no jacket.  Dressed with a collared shirt is not good enough.", "author": "Harold S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-28", "description": "Day of Marriage Proposal... Christmas\n\nLocation: Under the Brooklyn Bridge about a 5min walk from Jane's Carousel (great romantic pre or post date spot). Cab ride was riddled with traffic jams the whole way but I left far in advance. This restaurant sits directly on the East River with a beautiful view of Manhattan. Once you arrive you pass through a gate and garden that makes you feel that you have just left the city and have entered a place of comfort and good vibrations. \n\nThe Reservation: I called a month ahead to get in for Christmas day. I was vigilant in calling exactly one month ahead on the time that the restaurant opened. I had to sign a restaurant contract and put a card on file. I requested a window seat as I did some research and let them know I would be engaged at the point of our arrival. It was a prix fixe menu at $165 a person excluding drinks/gratuity and tax. Completely worth it. \n\nMenu: I know foody, but can't say I am one. I am a dilettante at this point in my life, but I do have a deep appreciation for culinary talent and artistic application. This was the best meal, hands down, I have ever had. I began with caviar, then the scallops and cauliflower, for the main course I opted for the lamb medium-rare and for dessert there was a plate of each to select from. Words can't appropriately do justice for how perfectly prepared my meal was as well as parallel in appeasement. \n\nThe experience: You have to check anything outside of your suit jacket. At this time I had some relatively expensive jewelry in my jacket and it created an odd start as I had to stall time and get all valuables out without my fiance's knowledge. The coat checker was understanding and I go the necklace out of my jacket. After sitting down at a window seat with my beautiful life love I had no choice but to offer her the necklace. This began a beautiful conversation about our love and future together. All with the skyline of Manhattan and the Statue of Liberty afar to keep us company. The meal was well paced and was about 2 hours from seating to leaving. \n\nConclusion: I would never have chosen another place for Christmas dinner after having a meal like that. Completely perfect and beautiful. I would gladly rate it 6 stars.", "author": "Travis R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-14", "description": "I made the reservations 3 month on open table. So happy we went here. \n\nOur Uber got lost and e ended up there 30 mins late but they were kind of enough to accompany us on a Saturday night.\n\nDumbo itself is beautiful and the restaurant is romantic!!\n\n3 course menu was amazing! App, Entree and dessert $130. \n\nWe had the octopus, steak tartare, my wife had branzino which had a shrimp crust and I had the lamb chops medium rare!! \n\n\nFood was AMAZING!\nService is quick and clean!\n\nVery impressed. \n\nThank you River Café!!", "author": "Bobby M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-29", "description": "This waterfront restaurant in Brooklyn is a beautiful spot. If you're seated, you have to order or you will be charged anyway. That said, the food was great and well proportioned. You don't leave the restaurant feeling very full.", "author": "Kristine S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-19", "description": "I truly enjoyed my experience at the River Cafe. The food was delicious and the ambiance was incredible. We went for lunch and even though it was a foggy day it was still a beautiful sight! The service was amazing as well. Any questions we had they were answered and our high expectations were met.", "author": "Caridad I."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-04", "description": "If you ever wanna impress a girl,take her to River Café! Wonderful place for anniversaries and romantic dinners or just a casual lunch with a VIEW.\n\nService was impeccable,from the moment we walked in everyone was very polite,wonderful atmosphere.\n\nDecorations are very beautiful each table had beautiful flower arrangements and live piano music.\n\nThe view is unbelievable,right on the waterfront,\n\nFood was good,but nothing extraordinary,that's why  four stars.\n\nWould definitely love to come back when in NYC!", "author": "Zanda L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-19", "description": "The food at this one Michelin star restaurant was fantastic. I took my mom for a New Years lunch here and opted for the $60 prix fixe menu. The meal started off with compliments from the chef, a delicious zucchini bread and granola. The appetizers were amazing, and my main course of Branzino made the top of the list for best meals I've ever had. My mom got the duck which was good, but definitely sat in the shadows of my fish dish. The wait staff was a little unfriendly but the food alone justifies my five star rating. I'm already looking forward to the next time I come back.", "author": "Annie Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-27", "description": "The River Cafe has received enough five star ratings that it barely makes sense to add another -- but given some negative experiences from a few reviewers, I wanted to write to reassure others: Those most have been off nights. Because the restaurant is an exquisite, old school New York dining experience.\n\nWe were a little early -- they won't seat anyone until the full party is there, so we sat in the small bar area next to the pianist. Our two other guests were stuck in traffic, so we were late for our reservation -- but they still accompanied us.\n\nThe food:\n\nI don't eat seafood but everyone else in my party does, and everyone loved what they ordered. One had the salmon, one the sea bass. Can't recall the third, but I imagine you can't go wrong.\n\nMy appetizer was the pear salad -- I have to say, I tend not to like pears, but when they're grilled a sweetness comes out that is so yummy. Loved all the different flavors in this dish.\n\nThen I had the steak. No, I actually had ALL the steak -- it was a perfect cut, and cooked exactly the way I like it, medium well. I know this preference often offends chefs and sometimes they'll go a little far to emphasize the \"well done\" part -- the chef here cooked it exactly right.\n\nI've said this in other reviews: Have the bread. It's worth it. \n\nAlso, I'd recommend not eating a lot during the day -- this is a prix fixe meal, and you want to enjoy every morsel. Again, it's worth it.\n\nHAVE DESSERT. My god, what they offered was unbelievable. One person in our party was having a birthday, so like other folks, they created a specialized little dessert for her. I had the key lime souffle (it takes a few extra minutes to make). Another person got the goat cheese cheesecake, another the pistachio semifreddo and the fourth got the apple mille feuille. we tasted each others' and one was more exquisite than the next. We also appreciated that the chef gets that we've just gorged ourselves on phenomenal food, and so the dessert portions are not overwhelming in size or in flavors. The perfect size, the perfect combinations of flavors on each plate.\n\nSome tips:\n\n1. Try for an early reservation. You're at an unbelievably high-end restaurant, and so you don't want your meal to be rushed. The views are astounding. The place will be packed, so expect the timing of your meal and the care that is given to each dish for each guest to reflect that. We had outstanding service, from the beginning of the meal to the end. But you're eating at a Michelin-starred restaurant. Be patient, and you will be rewarded.\n\n2. Don't try to walk in without a reservation. I think a few reviewers seemed to be offended that they walked in and then weren't accommodated -- but dude, it's THE RIVER CAFE. At the very least, give a call before walking over. Also, dress nicely -- they will turn you away if you were just strolling around in Brooklyn for the day and aren't dressed up. Best to reserve well in advance.\n\n3. Bring sunglasses. No, I'm not kidding -- if you're there for an earlier dinner, you'll be getting the beginnings of sunset -- and if you have sensitive eyes, it'll make it tough to enjoy the beautiful view.\n\n4. I'd suggest two or three people in your party max -- it gets very loud because it is always full. If you want to have a nice, romantic dinner or good conversation to accompany your wonderful meal, smaller is better.\n\n5. Watch your alcohol consumption. This isn't a safe driving PSA, it's just easy to forget because what they have is so good. Only two of us drank, one of whom had two glasses of prosecco, and the other of whom had a bourbon cocktail and a glass of prosecco. That brought us to around $100 in alcohol alone. (The prosecco was wonderful, as I'm sure all their wine choices are).\n\nI cannot think of anything even slightly negative to say about this experience. I plan to save my pennies and return for other special occasions in the future. Believe me, it's worth it.", "author": "Elizabeth S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-09", "description": "Amazing! This is a very special place and it really doesn't get any better than this...The finest of finest for the most discerning of food critics. My daughter and I had the most special dinner here and we were treated like princesses! Order a 77 for sure and the best steak on earth...$$$$ but worth every penny!", "author": "Genie M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-06", "description": "If you want to experience a most romantic and civilized restaurant please make a reservation at the River Cafe under the Brooklyn Bridge.  Every visit I feel more and more special thanks to Josh and the remarkable wait staff.  Each plate delights and surprises and makes me want for more of this treatment.  This cafe has been responsible for giving some of the top chefs a great beginning.  You will be pleased that you visited the River Cafe.", "author": "Frank R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-03", "description": "My husband and I were planning a trip to NYC, first time trip, and I saw this restaurant somewhere on the travel channel??? Anyway, this is a place you have to book far in advance, the food is so good and you won't be disappointed. Do an evening meal, the city lights are beautiful!! I surprised him with a trip to New York for his birthday, and we spent a nice romantic dinner here.", "author": "Mari R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-10", "description": "I went here on date night and i must say it was better then I thought!!!  I thought it was going to be very stuffy and overrated.  But I was pleasantly surprised by the atmosphere and the service.  When we arrived they immediately pointed us to the bar, not a problem for me because I like to drink:)  However a few people mention the pointed out the reservation thing?!?!  \n\nOur service was nice and the food was good.....HOWEVER...I was quite surprised when this place got my order wrong?!?!?  I order the steak and of course I wanted it Medium....well to my great shock it came our well well done????  Of course I showed the waiter who agreed immediately and took it back.  The issue is my BF's meal came out so he was eating(and sharing) while we waited for them to cook another steak for me.  I was a lil annoyed by that but my BF is cool as hell so he just got me more drinks and shared his meal with me.  Of course when the steak came out I did the same.  The also brought out a larger portion of mashed/puree potatoes.  Other then that I did have a good time.\n\nThe view/location is everything!!!!  I will be back I want to see if Brunch is the same feeling??", "author": "Nicole B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-09", "description": "My wife and I are in our late 20's / early 30's, and chose The River Cafe for our special night out on our visit to New York City. They did not disappoint! Everything is spectacular, from arrival to departure, all of your expectations are exceeded. We had a beautiful view of the restaurant / river, as well as a delicious \u0026 romantic meal together. Granted, this is the most expensive bill I have ever received for supper, but it was actually worth it. My wife was beyond impressed. \n\nNote that it is pretty difficult to get from Manhattan to Brooklyn around supper time, so allow yourself PLENTY of time for the taxi ride anytime between 4pm and 8pm. We were about 15 minutes late, but a phonecall to the hostess bought us extra time. \n\nHighly recommend for a beautiful, romantic night out.", "author": "Furman L."}], "servesCuisine": "American (New)", "priceRange": "Above $61", "name": "The River Café", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Water St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/C_8aEbAvcCLhiqXn9QdWSw/ls.jpg", "@type": "Restaurant", "telephone": "+17185225200"}