{"aggregateRating": {"reviewCount": 1049, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-08-17", "description": "Bottom line: Beautiful views and gardens, impeccable table service, host service not so good. Food items were Bs or Cs.\n\nWent here for our anniversary \u0026 had pre requested a window seat. When we arrived, we weren't seated at a window. When i pointed that out to the maitre de or whoever he was, he said \"yeah well, everyone does.\" Whats up with the sass??? Not a good first impression of service.\n\nService was definitely made up table-side as wait staff is attentive to your needs \u0026 dietary restrictions. They were on their A game with crumbing the table, removing plates on time, refilling waters, etc. \n\nFood: smoked salmon appetizer was ok \u0026 octopus appetizer was pretty good. For mains, I got the mushroom Wellington which was recommended by other Yelpers but it's simply puff pastry stuffed with mushroom and nothing else exciting is going on. Comes with a side of bland steamed vegetables. Husband got the lamb and said it was done well but seemed like it was only salted and even then, very bland. Nothing mind blowing. Dessert is dessert and can't go too wrong. I enjoyed their blueberry tartlet with coffee and the brooklyn bridge dessert was cute! \n\nIt's definitely a lovely date spot with live piano and formal dining but if you are looking for fine dining options in NYC mainly for food and sophisticated palate stimulation, don't go here. That said, we were charmed by the ambience, piano player, and I have a special connection with Brooklyn Heights and the so the night was great", "author": "Sayeda A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-05", "description": "When you want THIS anniversary to be the very best, THIS is the place.  When somebody (who can afford it) asks you what you want for your birthday, say \"The River Cafe\".  You don't need any more \"stuff\" anyway.  When you're proposing to \"the One\", do it here.  Plan ahead, and get the table right up against the window.  Right under the shadow of the Brooklyn Bridge.\n\nYou might want to read the menu on line before you go, as it is pretty up to date.  That way, you'll at least have an idea of what's in store, otherwise you might get sensory overload and want to order everything!\n\nDress nicely, you'll be glad you did.  We came to New York without a sport coat, as it was summer.  The River Cafe supplied a well sized, neat and clean, jacket for each of us.\nNo tie required.  \"appropriate footwear required.\"\n\nWe started with a cocktail.  This slows the pace of the meal and allows for time to soak in the view.  The River Cafe has excellent wine service with attention to detail.  I know wine well enough to chose from their library, but was advised away from my choice by the wine steward... and rightfully so.  He offered us a side-by-side sample of my choice and another wine he suggested and, as it turned out, the wine steward's suggestion was spot-on!  \nI'll have that!\n\nI had a mind to bring a special bottle I had shipped ahead to New York, from California, but The River Cafe does not serve wine other than from their library, so I left mine at the hotel, to enjoy later.  \n\nThe table service was impeccable.  Formal, yet not stuffy.  Knowledgable, but never condescending, gently efficient.  Not rushed.  Smooth and subtle teamwork.\n\nThe food was flawless.  We looked at what others ordered and it all looked stylish and delicious.  Our choices were perfect.  Yours will be too.\n\nDessert was delicious and more than ample.  I nursed my wine though the dessert course, but next time I would order a glass of port.  That would have been the topper!\n\nAll-in-all we had the best of meals, and spent (only) $400, including three course meals (for the two of us), a cocktail each, and glass of wine each, tax and tip included.  Well worth it for such a special meal.  \n\nDetails...  It might be nice to read the wiki page on The Brooklyn Bridge before you go, just to feel the connection to the place.  it made our experience richer. If you're coming from Manhattan, the Ferry drops you right at the door of The River Cafe.  (Check schedule for return times).  Lunch/Brunch here must be a good alternative to the Dinner, and less pricey.", "author": "James G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-23", "description": "Absolutely amazing restaurant with great service, food, and ambiance. Came here for my birthday dinner with the a nice proposal surprise at the gorgeous garden outside of the restaurant. \n\nService: Staff is very attentive. People take your jackets in the front and seat you. When you need them they will always be available to serve your attention.\n\nFood: I had the rabbit appetizer with the duck entree and I loved it. I didn't think it was too filling for me in the end but that's because I shared some with my boyfriend since he eats more than I do haha. I forgot what he had but it was just as good. \n\nCost: It's a bit up there so come here for occasions.\n\nAmbiance: Romantic. We didn't get to sit by the window but we sat facing the window and witnessed the sunset where we can see the water right in front of us so it was still nice. Would definitely recommend coming here at least once!", "author": "Sharon L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-02", "description": "Went to celebrate my girlfriends birthday, very nice and intimate setting. Atmosphere was elegant and romantic; thumbs up.", "author": "Alex H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-19", "description": "This is by far my favorite restaurant in New York City. One hundred percent worth the $125 price if you're willing to splurge. Every dish is made with such delicacy and perfection. Presentation, taste, and environment are all amazing. They do have a strict dress code and dont let you take your suit off even if youre sweating. The side door goes outside by the river and is perfect for pictures(the place is a boat)\n My favorites:\n- soft shell crab: fried to perfection (not always on the menu)\n- foie gras dishes: the appetizer one is super creamy and goes perfect with the jam they give you. The entree is a masterpiece, seared perfectly on the outside sealing up the creamy inside. The entree isn't always on the menu\n- tuna: so fresh and delicious. It melts in your mouth\n- oysters: super fresh and the lemon juice in sorbet form is quite the touch.\n- steak tartare: by far the best I've ever had. The cognac jelly is the perfect addition to the traditional recipe. Quail egg is also a nice touch\n- souffle: perfect balance of hot and cold. Beautiful dish", "author": "Kevin Y."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-15", "description": "Excellent atmosphere. Very pricey but views are spectacular and worth the extra cost especially for a special occasion.", "author": "Donna B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-08", "description": "Love love love this place. My fiancé took me here for my birthday and it was absolutely perfect. The view was beautiful, the atmosphere was very romantic, the service was great, and most importantly, the food was amazing. The menu probably changes, but everything the waiter recommended was in point! Especially loved the lobster entree and the rabbit appetizer. It's definitely on the pricey end, $125 for a 3-course pre-fixe, and $17 for a glass of champagne.... that being said, I can't imagine a better place for an anniversary or other special occasion dinner. Highly recommend!", "author": "Lina Y."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-11-23", "description": "Nice restaurant.  Good food and service.  Not as spectacular as the price for pre fix only option of $400 for two, with 2 glasses if wine.  Most disappointed with car serice only option for return to Manhattan.  This is an isolated location and at the mercy of establishment for car service.  I paid $19 (with tip) for ride to restaurant from Greenwich Village.  Car service quoted as $35 for return with no option for other service.  I agreed and once in car was told it would be more and he would \"let me know the price when we got there\".  I told him $35 or let me out.  Ridiculous to pay $400 for dinner and then get screwed for ride out!   I pa", "author": "Theresa M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-06-29", "description": "The River Cafe definitely has its group of regulars. If not, slipping cash while forging a handshake can make you into one. I was not even shocked when a man slipped the maitre d a bunched-up bill before sliding into his window seat next to our table with his date for the night. Tourists: It doesn't get more New York than that if you're looking for an \"authentic\" experience. \n\nAmbiance: I arrived with my mom (party of 2) for dinner early on a Saturday night. The crowd was much older than I expected, with elderly couples pining for the window seats. The views were great but you can also get the same view outside on a bench for free. If you're planning to come for the view or the general ambiance, I'd recommend another establishment. \n\nFood: The only reason I rounded up to 3 stars is because the food was better than I thought it would be (although quite underwhelming) and definitely not at the level that it merits a Michelin star. The desserts, however, were on point. We had the Chocolate Brooklyn Bridge and the Sorbet Plate, which were perfect compliments to one another. The portion sizes are generous and we left stuffed even after just two courses each. \n\nService: Our food-runner was generally pleasant, and kindly explained each dish as it came out, but the server who took our order did not ask if we needed any recommendations, nor asked if we had any questions. The service was average compared to other New York restaurants, and sub-par compared to other Michelins. \n\nTHE HOSTESS AT THE FRONT TOTALLY RUINED THE EXPERIENCE FOR US IN THE BEGINNING. She greeted us, and when I said that we had a reservation, she asked if we were familiar with the menu. I said no, but I was fully aware that it was a fixed price dinner. She said she would bring it over anyway to make sure we were \"comfortable with it\" (aka the price). \n\nOnce she went over to call the matire d, I stared at the other hostess with a flat expression and said, \"I said, we have a reservation. Are you going to let me in or not?\" She looked flustered and apologized profusely, making an excuse that she didn't hear that the first time around. \n\nBesides this slightly minor setback, the overall experience was good. Good but not great. I will not return.", "author": "Leah C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-01-20", "description": "We had heard great things about the restaurant, unfortunately it did not come remotely close to our expectations.\n\nAtmosphere - Great setting, looking right at Manhattan. Very picturesque and I could see how many people would do a proposal or something of the sort here. Also, the staff was nice enough to move us to a window table when one opened up.\n\nFood - Decent. We initially asked to do the 6 course tasting menu, but when I mentioned we had some dietary restrictions, the waiter looked at me like I had 3 eyes. Not the end of the world I suppose, so we just ordered dishes off the menu. The shrimp and oysters were solid as were the crab cakes. Gnocchi and rabbit were ok, but nothing spectacular. Lobster was good, but duck, fish, and lamb were nothing above average. For dessert, we ordered chocolate bridge and key lime souffle. Instead of telling us they were out of the souffle, they took it upon themselves to just bring us out two chocolate dishes. Not a bad dish, but the experience did leave a sour taste in our mouths.\n\nService - This is where the restaurant truly fell apart. As mentioned previously, the waiter and staff were very confused by our dietary restrictions. I unfortunately have a fish allergy, and as part of our \"compliments of the chef,\" we were given a fish dish - not just once, but twice! The staff seemed like they had no interest in being there, and their lack of attentiveness at all points in the experience made Taco Bell look like a Michelin 3 restaurant. In fact, the waiter didn't seem to know the menu at all. The one thing I will say is when we switched tables and had a different waiter, the service improved somewhat. Unfortunately, it was towards the end of our dinner and couldn't make up for the disaster we experienced prior.\n\nAll in all, of all of the Michelin restaurants we've been to, this was by far the worst. That being said, the view is truly exceptional, and it's probably a good place for drinks if you've never been.", "author": "Anil N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-21", "description": "5 stars for various reasons. \n\nSERVICE IS EVERYTHING TO ME \u0026 the service \u0026 attentiveness of everyone assigned to your table is impeccable!! \n\nFood: nothing short of amazing! I had the steak tartar as an appetizer... Well, let me back up, we received a complimentary duck filled sort of potato? from the chef. Delicious!! The steak tartar was good (I've definitely have had better in Los Angeles but nevertheless it was great). For my main course we all had the chicken. It was HEAVENLY! It is so tender it literally melts in your mouth!  the accompanying sides are pretty fantastic as well.\n\nDessert: The chocolate dessert comes with a Brooklyn bridge made out of chocolate. Considering I hate chocolate (I know, how weird) I had the blueberry tart. However, I still wanted the chocolate bridge for photo opportunities. They were so nice \u0026 were able to do it for me  like I said, SERVICE! \n\nThe ambiance: It is definitely a nice romantic, intimate ambiance with a SPECTACULAR view of Manhattan (something you don't really get to see unless you're on the other side of the Brooklyn bridge).\n\nIt is pricey \u0026 a prefixed menu. $125 a person but WELL WORTH EVERY PENNY if you can afford it. Ours was a little more because we added a nice bottle of Chardonnay. \n\nOh! Men are required to wear a suit coat at all times. Yes, it's that kind of place but nothing short of amazing. Enjoy!", "author": "Catherine G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-02-11", "description": "The restaurant was good, but if you are getting a car out of this place expect to pay more than 2x the standard cab rate. Don't know what deal the valets have with the green cabs but it's a rip off to the customer.", "author": "Liz D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-06-08", "description": "Having frequented my share of Michelin starred restaurants, I've grown to expect a certain level of snootiness, but I can't fathom they believe the product they are churning out warrants this elitism. It's a tourist trap with a view and they are holding on for dear life. Scott Stamford, the GM, was downright snide and unhelpful at our request. He never greeted nor addressed me directly. The poor hostesses seemed so on edge about upsetting him they looked fear struck. \n\nIf you're over a certain age and deem quality is proportionate to what you pay for it, then maybe this place will fool you. Slap the word Kobe in front of anything and maybe it'll be good. \n\nFor any New Yorker with any sense or (God forbid) style, I can take the 4 train during rush hour if I want to be spoken down to by an empty suit. In the case of Scott Stamford, one desperate to be a \"big man\" he's emblematic of the lack of invention is these old world restaurants. For such cool real estate it's a sad sight to see this joint holding Brooklyn back for actually creative restauranteurs.", "author": "Kate E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-12", "description": "This Michelin rated restaurant is located on the Brooklyn side of the Brooklyn bridge.  Bordering the east river, they are in a prime location which overlooks the lower east side of the Manhattan skyline.  \n\nThe whole atmosphere here is very professional and they expect the patrons to be the same - suit jackets are required in the dining room. I've read some reviews in which some diners wore jeans, but I would recommended against it to refrain from standing out in a bad way.  As expected the staff is very professional and friendly.  You are given two options for dinner, a 3 course pre fixe or a six course chef's choice (about $65 more).  The latter appeared a lot more economical and made the most sense as their menu featured several dishes that we wanted to try. Note that the whole table is required to get the chef's tasting menu if you opt for this choice. \n\nFirst course - very fresh oysters and clams. I can't remember the names of each, but they were all topped off with some additional flavoring (ceviche style, roe, and scallions).  No cocktail sauce is provided as it would not do this dish justice. 4/5\n\nSecond course - Gigantic piece of shrimp with an amazing butter sauce on top.  With crab meat and beets on the side, this was one of my favorite dishes. Flavor, texture, it was all there. 5/5\n\nThird course - monkfish, which had a texture very similar to lobster but a little less chewy.  This dish was a little on the bland side, and I didn't quite enjoy this one much. 3/5\n\nFourth course - a huge portion of foie gras alongside a slice of pistachio cake. The combination of the two was interesting. Although good, I got a little sick of it at the end. But I had to finish it though, as I couldn't let high quality foie gras go to waste. 4/5\n\nFifth course - black pepper crusted duck. The crust along with the meat was excellent. The meat itself was average, but have it with the seared exterior and you will never forget the flavor.  This was served with some German pasta on the side (fried potato pieces) 5/5.\n\nSixth course - dessert.  We asked to move near the piano bar so we could have a better view and a more intimate atmosphere. The staff gladly complied and served us our desserts there.  There were several plates, one of which was the Brooklyn bridge chocolate cake.  This was a perfect ending to a wonderful night. 5/5. However, I though he cheesecake was just average 3/5. \n\nI definitely recommend this brilliant restaurant for anyone looking to celebrate a special occasion. Food was delicious and filling, staff was exceptional and the view is perfect.", "author": "Christopher C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-10-04", "description": "Unfortunately I can't comment on anything other than the location because my then fiancé/now husband and I weren't allowed in. We had just had our engagement photo session by the Brooklyn bridge and we wanted to get a drink afterwards. I had my hair and makeup professionally done and we were dressed to the nines from our shoot - I'm talking Prada menswear/nice dress/the good jewelry you only break out for special occasions dressed up - and they looked at us like a dumpster rolled in the door from the second we walked in. I understand having jacket only dress code policy, however they were so snotty about it it was unbelievable. I have been to so many of the top restaurants in NYC from Meatpacking, to the LES to Soho and I have never experienced the snottiness we got when we worked in the door. They have us a dirty look, said \"sorry you must have a jacket\" and walked away as quickly as possible. I heard later that they actually have a jacket they lend people but this was never offered to us. Once again I get the policy but the snottiness was unnecessary. My husband actually had a jacket in the car and we debated getting it, but after the attitude we decided to go somewhere else. Too bad as we were feeling celebratory and looking to splurge on a few drinks!", "author": "Bernadette P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-06-04", "description": "Horrible experience with this restaurant. The staff are very unprofessional and rude. Furthermore,\nI don't recommend this place because the food is mediocre at best and it's way overpriced. The wait for food is also too long. Nothing special about this place , it just looks pretty from the outside and inside but the quality sucks and a one star Restuarant in my opinion.", "author": "Max L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-08", "description": "My boyfriend and I each enjoyed the chefs tasting menu and it was absolutely delicious. There wasn't a single dish that I did not enjoy. My favorite dish of the evening was the sea bass... it was the most delicious piece of food that I have ever put in my mouth!!! The view was so beautiful and the service was amazing! If I could give 10 stars I would", "author": "Kaitlin W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-10", "description": "This restaurant was quite the ordeal to book a reservation. So much so I almost decided to forgo it and go elsewhere but it was a special occasion and I really knew my husband would enjoy the experience and frankly I was interested as well. So we kept their earliest available reservation at 9:30pm on a Friday night. I had originally wanted a 6:30 or 7:30pm dinner time but they had no availability 3 weeks out. Traffic was just terrible getting there from central Manhattan so we arrived dreadfully late, minutes before 10pm. I called to let them know we were running late and they were very accommodating. Once we arrived, we were seated within 2 minutes at a corner table in the back of the restaurant but facing the window. All the window tables were full and I was late so I was just happy to have a seat. The view from our table was still romantic and beautiful. Service was superb and the food was fantastic. They offer a 3 course menu for $125pp. The quality of the food, the presentation and the taste of the food were all terrific. \n\nOur dinner selections were:\nAppetizer 1: Crab Cake 5/5\nAppetizer 2: Wild Shrimp 3/5\nEntree 1: Lamb 5/5\nEntree 2: Duck Breast 4/5\nDessert 1: Milk Chocolate Soufflé 5/5\nDessert 2: Chocolate Brooklyn Bridge 5/5\n\nFlavio from the River Cafe assisted us with our wine selection. I opted for a Peach Bellini and it was awesome. Flavio recommended to my husband to try a glass of Sauternes because my husband and I enjoy sweet drinks. It was a perfect choice for us, it was sweet and delicious. We couldn't be happier with his recommendation. \n\nAfter we finished our main entree a table opened up next to the window and the staff came over to ask us if we would like to sit at the window for dessert. How thoughtful, they remembered that was my request when I booked the reservation. We were served our desserts at the window table. It was the perfect end to a perfect dining experience.  \n\nI highly recommend coming here to celebrate a special occasion in style and class. The table next to us got engaged and some other tables were celebrating birthdays and anniversaries. This is the spot to celebrate a romantic and special occasion - trust me! You're welcome.", "author": "Nicole C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-01", "description": "The food was quite good. The view was incredible and the service was amazing, truly amazing! My Three Shells appetizer of abalone, oysters, scallops was so so good (though a small portion of each). The Branzino was good and the steak my friend had was delicious. The daiquiri cocktail was okay and the wine, overpriced (if you can drink less the total bill will be far more affordable), but the suggestions by the sommelier were spot on. This is a fabulous place for a special occasion and if you have the money then more often! I waffled in giving it a 4 instead of a 5 because it was so expensive that you do have to be more critical!", "author": "J F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-01", "description": "We celebrated our 17th anniversary here.\nIt is an unforgettable dining experience.\n\nThe view is excellent! \nThe food is excellent! \nAnd the service is more than excellent! \nFor special occasion, I will definitely recommend the River Cafe!", "author": "Alan H."}], "servesCuisine": "American (New)", "priceRange": "Above $61", "name": "The River Café", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Water St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/C_8aEbAvcCLhiqXn9QdWSw/ls.jpg", "@type": "Restaurant", "telephone": "+17185225200"}