{"aggregateRating": {"reviewCount": 1049, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-04-17", "description": "Food: 5 stars\nService: 5 stats\nLocation: 4.5 stats\nAmbiance: 5 stars\nPrice: 4 stars\n\nRecommendations:  The oysters are a great appetizer. They are fresh and delicious. The Bloody Mary's are made from scratch and probably the best I've ever had. The Lobster and Lobster is heavenly and two unique preparations of such a delectable meat.  The catch of the day (sea bass) was buttery, moist and melted in your mouth. The service is spot on and the view of Manhattan is breath taking. I would definitely make it a point to go to River Cafe for lunch or dinner. A unforgettable dining experience.\n\nDid I mention that I got engaged here too?  The staff did everything they could to make my experience go 100% smoothly, even bringing out complimentary champagne to the terrace!\n\nOverall: 5 stars", "author": "Sean G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-12-28", "description": "really wanted to go Xmas dinner only time in NY read the reviews/ location etc hadta go however unfortunately only wait list 'call you back' know what i mean..... didn't happen perhaps next time in THE BIG APPLE", "author": "Jack C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-17", "description": "I'll try to keep this short and simple since there are so many reviews already about this place. \n\nYou are definitely going for the view. The food is not great. For $100 or more a person you kind of hope for something better. \n\nI requested for a window seat 3 weeks before my reservation. Even going at 6:30 we didn't get a window seat. I had to admit I was fairly disappointed because we were celebrating our anniversary. Regardless, the view was still nice. We got to see the sunset.\n\nMy most memorable dish was the lobster tails. For an appetizer you get a good chunk of lobster. I almost got full just from that. \n\nI also ordered the branzino which I didn't like. It was a very small portion and there was nothing special about it. \n\nMy bf ordered the sirlon and it was too charred and too rare for him. \n\nThe waitstaff was very professional and courteous. We even got complimentary champagne for our engagement (yes, he proposed there)!\n\nWill I go back? Probably not but I think everyone should at least try it once.", "author": "Daisy K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-09-21", "description": "Came here on a wonderful Sunday evening for a b-day/engagement dinner for me and my new fiance ;)\n\nThe view is amazing and there really is no bad seat in the house. Service was nice - attentive but not stuffy. The food was also delicious and generous portions. We got the rabbit, tuna tartar, steak, and duck. All were great, but the duck was especially delicious. \n\nFor dessert we ordered the famous brooklyn bridge - which was very good, and the peach souffle which was delish too...\n\nOverall a great place to celebrate a special occasion, and I look forward to going back!", "author": "Jenny L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-27", "description": "My husband surprised me with this spectacular place for our anniversary. I think he said he booked it a few weeks ahead. It was beautiful and calming. We arrived about 40 minutes early and were seated at a table around the bar area and some wine while we waited for our table. We were then seated at a table where we were able to look at the view. Although we were a little too busy eating their wonderful endless serving of bread and I think the food we ordered was a $150 per person, it was a Chefs special (the chef pretty much picked what we were going to eat I think). We went with it and ate a few things we hadn't tried before. It was delightful and tasty. Our waiter was attentive even though it was a busy night (not sure if it is always so busy). At the end they brought us the cutest Happy anniversary dessert (the chocolate was the shape of the Brooklyn bridge =) ). We loved it and were surprisingly quite full when we left. I couldn't have asked for a better night ,it was perfect!", "author": "Chris V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-12-17", "description": "Dining at The River Cafe was one of my most memorable experiences in NY. Here's why: when I ordered my main dish, I asked for a side of broccoli. The waiter kindly told me they did not have any that night. When my meal arrived, there was a side of broccoli and the waiter said, \"We had someone run out to the local grocer and get some for you\"!!!\n\nThe food was amazing, the ambience was breathtaking, and the service was impeccable. Truly an unforgettable experience.", "author": "Jenna Q."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-12", "description": "There was no problem getting a lunch reservation.    The location is perfect.  While it's a bit of a trek from the A line subway station, the destination is ideal.  It's right on the East River, almost directly underneath the Brooklyn Bridge.\n\nWe tried the fruit wood smoked salmon and the spring parsnip soup as appetizers.  Our entrees were the filet mignon and the lobster and lobster.  Everything was great.  \n\nIt's an upscale restaurant without being too stuffy.  The service was great.  The food was enjoyable.  Our bill came to $107., with 2 sodas and no dessert..  Since we used a gift certificate, given to us for our wedding, we tipped $53.\n\nAlthough it's a very nice restaurant, I wouldn't wait for a special occasion to dine here.  Life is short, enjoy yourself and come here when you need a break from life.", "author": "lynn n."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-21", "description": "Great view of the Brooklyn Bridge.  Food is delicious and wonderful atmosphere!\nThey do a six course menu tasting with wine pairing that is incredible!", "author": "Christy G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-07-06", "description": "The restaurant smells horrible.  Combination of seafood and sewage!\nThe service is deplorable!  Incredibly inattentive with average food.\nThis is just a tourist trap with overpriced food.", "author": "Bruce F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-11-13", "description": "Ambiance, view, service, food all excellent.  This has the most amazing view of Manhattan, especially at night.\n\nEverything is a fixed price and comes with Appetizer, Main Course, and Dessert for $100.  If you want the 6 course Chef's signature menu it's $125.\n\nWHAT WE ORDERED:\n\n  - Sauteed Hudson Valley Foie Gras: sauteed with roasted apple in a cider reduction and candied pistachio.  Served with french toast.  Seared foie gras is truly the best way to eat it.  The sweetness of the reduction makes a nice charred crust on top.  This blissfully melts in your mouth like rib eye butter.\n\n  - Wild Rock Lobster (small lobster): Two roasted tails on top of thin slivers of mango with a pool of citrusy fennel, lemon olive oil sauce.  Very very moist and tender.  Perfectly cooked.  Complimented well with the mango and citrus sauce.\n\n  - Colorado Rack of Lamb: Huge pieces of lamb, seared with a nice crust.  Very tender and flavorful.  This is apparently one of the most popular dishes.  \n\n  - New York Cut Sirloin: everything that a NY steak should be.  Cooked well, seared.  One pound of meat dry aged.  The russet and sweet potato gratin with blue cheese fondue tasted like a cheesy potato au gratin.  The gratin is served in an escargot platter.\n\n  - Caramelized Apple ~ Almond Tart: thinly sliced apples over a layer of fragipane (almond paste \u0026 butter) on puff pastry with a side of vanilla ice cream and green apple sorbet.  It's like the inside of a bear claw with apple and caramel.  So buttery, flaky, and went really well with the ice cream and sorbet.\n\nAn enchanting and romantic dinner setting.  Definitely worth it for those special occasions.", "author": "Mayumi T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-06-09", "description": "If you want to impress someone in an intimate, friendly, low-key environment, this is the place to go. My boyfriend took me here for a Valentines lunch (he had been here before, I haven't), and it was breathtaking. The view is absolutely amazing, and you dont' have to be near a window to see it! The windows are from floor to ceiling, looking right into Manhattan and the Brooklyn Bridge, with alot of natural light streaming in during the daylight hours. \n\nThe service is superb (and attentive - our wine glasses were always promptly refilled), and the food is delectable. We got a crab bisque and oysters to start - my boyfriend doesn't even like oysters, but these were super fresh and juicy. The crab bisque was beautifully presented and a great start to the meal. I got the lobster \u0026 lobster entree, which had a grilled cheese lobster sandwich... and it was amazingly light! (a huge huge plus). He got a shrimp entree, which I proceeded to take many bites of as well. The food is fresh, beautiful, and delicious. I would highly recommend having the seafood here (as those are the only ones I've tried) and would not hesitate to recommend this place to anyone!! Goooo.", "author": "Amy Y."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-05-04", "description": "Most of my first visit to River Cafe was pretty enjoyable. The food was great and the location can't be beat of course. This review mostly has to do with the service. \n\nI had taken my fiance there for her birthday, and neither of us drink alcohol. I have been to a number of upscale restaurants (Daniel, Bathahazar, Maze) around town and sometimes notice this effect, but it was particularly strong here. We essentially felt ignored because we didn't drink, which i understand is how these establishments make their money and I'm fine with that, just not with discrimination because I have a slightly lower tab (hell..i'm still paying 250 bucks to eat..doesn't mean I should be ignored). \n\nEveryone around us who was drinking got their dishes placed by the head waiter and had them described in detail and they got very attentive service. We got our dishes sort of plopped down by the wait staff with no fanfare or anything like that. Other things felt very slow (ie even slower than you usually expect for a nice fancy experience)\n\nAgain, I understand that you're making less money from me sitting there, but at least be upfront about how I should expect lesser service in comparison to everyone else because I choose not to drink. I doubt I'll be returning to this place any time soon.", "author": "Blair N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-19", "description": "Ein wunderschönes Café/Restaurant mit einem noch wunderschöneren Ausblick. Man blickt direkt auf die Skyline von Downtown Manhattan und das bezahlt man auch ;-) Am besten danach oder davor über die eindrucksvolle Brooklyn Bridge spazieren und der Tag/Abend ist gerettet!", "author": "Andreas M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-25", "description": "Gorgeous location, Food is excellent and Service was top notch. It's cozy and romantic, and the staff is friendly yet professional. Took my gf there for post valentines, wary it might feel a bit stuffy but it was very pleasant. Completely worth planning a 2nd \u0026 3rd visit soon", "author": "Cal Y."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-11", "description": "The River Cafe, underneath the Brooklyn Bridge with a front-row view of Manhattan's skyline, is what Tavern on the Green wishes it had been before ingloriously filing for bankruptcy: a quintessential New York experience, including great service, food and a view unlike any other in the city.  Also, unlike Tavern, it wasn't filled with midwestern tourists or elementary school birthday parties.\n\nThe lady and I had the 6-course tasting menu ($125 pp) as our Valentine's 2k11 celebration (that's 4 in a row!) last night and overall I was very pleased with the experience.  It's not the kind of place you would go regularly (price, location, ambiance) but for a special occasion it's worth doing at least once.\n\nCOURSE 1: TAYLOR BAY SCALLOP CEVICHE\n\nNice presentation, with ceviched scallops being served along with a chilled tomato and light gazpacho in a half shell, but the scallops themselves were flavorless.  The tomato was interesting but this was probably my least favorite dish of the meal (which made me nervous as we began).\n\nCOURSE 2: WILD ROCK LOBSTER\n\nNow we're on track.  Pretty straightforward presentation of a lobster tail with mango, lemon and fennel.  Lots of meat - a winner.\n\nCOURSE 3: BRANZINO FILLET\n\nIn my opinion, the best part of the meal.  This was a total home run: perfectly cooked baby sea bass layered with chorizo and shrimp, covered with a thin, toasted brioche surrounded by bits of tomato and zucchini.  Felt like eating super delicious and expensive comfort food. Loved it.\n\nCOURSE 4: SAUTEED HUDSON VALLEY FOIE GRAS\n\nThe fact that some people want to outlaw foie gras is so abhorrent to me that I can scarcely believe that their protest is real and not just some Wes Craven horror fantasy.  This wasn't the best foie gras I've ever had (Cyrus wins that, by a landslide) but it did the trick.  One thing the restaurant did which I could have lived without was to fill the brioche with a roasted apple filling and treat the whole thing as a french toast.  Mushy and not awesome.\n\nCOURSE 5: NEW YORK CUT SIRLOIN\n\nThree just-over-bite-sized cuts of sirloin.  Sort of tough, very meh.  Served with a mushroom marmalade in a red wine reduction that was actually very nice.  Could have done with a dish that featured those mushrooms instead of the steak.\n\nCOURSE 6: DESSERT\n\nFor dessert I had the coffee parfait with caramel chantilly.  The parfait was nice but the chantilly was way, way too strong.  Think of a bittersweet caramel you've had and then multiply the intensity by 1,000 - you're now almost imagining the intensity of this stuff.  My girlfriend had the goat cheese cheesecake which was a better choice.", "author": "Eddie B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-11-17", "description": "$100 for that?!?!?!  Special Scallop Appetizer - 1 scallop (!!) cut into 4!!!\nWhat in the world?!?", "author": "Debby T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-06", "description": "What a lovely experience.  I made the reservation well in advance then had to change the time at the last minute.  I arrived early and was seated at the bar until a table cleared.  The view from the bar was amazing.  The wait for the table was a little long but the hostess checked in constantly and kept us updated.  He stated he had a table available but if we waited a few more minutes he'd have a better one.  Of course we waited and it was worth it!  He knew it was a special night and seated us at the window, how thoughtful!  The restaurant was smaller than I expected, but the food was excellent and the service was exceptional.  The menu was fixed and expensive but oh so worth it!   If you're celebrating a special occasion I suggest you make advanced reservations and request a window seat.  The view is unforgettable and provides a great backdrop for photos.  The restaurant does offer valet parking but call in advance to confirm it's available when you visit.  If not, ladies in stilettoes beware of the cobblestone.", "author": "Channy M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-06-23", "description": "The food preparation and presentation was spectacular. The service was very poor and brought down the over all experience leaving us with a bad taste in our mouth upon leaving.  \n\nWe were seated almost immediately.  But how we were served became an issue.  Our initial plates were brought out to us prior to our order being taken or menus removed. So we sat there trying to enjoy melon, feta and kobe beef with menus in our laps and staff that took too long to move the process along. This seemed to be a theme throughout our courses.\n\nI quickly noticed that the table to the left and another table at an angle to ours (with more people) had their food, drinks, etc served before our table, even though they may have been seated 10-15 min after we were seated.  Having empty wine glasses and requesting someone over to refill because they were not paying attention. This of course made them pour our glasses every 5 min - overkill.\n\nThe best part was after our meal and leaving. There was a line of 6 woman waiting for the restroom outside in the restaurant welcome area.  imagine walking into an expensive/high end establishment and feeling like your walking through a dive bar on a friday night. Poor planning and making woman wait 15 min for the restroom after spending that money is absolutely ridiculous.\n\nAs mentioned the food preparation and the very knowledgeable staff was a plus. But i can enjoy this experience at a couple other restaurants with a better understanding of the new york culture and community.", "author": "Amanda S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-10-07", "description": "(Preface:  This place is on my \"Two-Week List,\" in which I list the top twenty restaurants and bars that I'd go to if some soothsayer came up to me and told me that I only had two weeks to live.  Check out the full list on my profile!)\n\nThis is the ONLY place on my list that I haven't frequented.  (Definitely a special occasion place.)  In fact, I have only been here once, but it was the most memorable meal I have ever had in New York City.  We had friends in town celebrating their ten-year wedding anniversary, so it was truly a special occasion.  We had the chef's signature tasting menu.  Well let me back up -- I'm getting too excited.\n\nFirst, the place is breathtakingly gorgeous.  Picture the most beautiful restaurant of your dreams.  There, that's what it's like.  It's floating, and we had to walk through this breathtaking garden to get in.  Walking through that garden, I felt as if I wasn't in New York City.  I felt as if I wasn't in the same era, even... until I looked across the East River and the entire Manhattan skyline twinkled at me.  (I know it sounds so romanticized.  Honestly, though, this restaurant is just so... PERFECT.)  \n\nUpon walking in, we were greeted by a handsomely dressed maitre d', who whisked us to a table right at a floor-to-ceiling window, facing the water and the skyline.  (He insisted that the ladies get the prime view, and made the men sit with their backs to the skyline.  Loved it.)  We ordered two or three rounds of classic drinks:  gins and tonics, dirty martinis, or negronis.  \n\nA man was also playing a piano, which provided the perfect background.  Play it, Sam.\n\nWe then had a round of oysters and wine.  A sommelier came to our table to advise us on what to pair with the oysters, as our waiter listened with rapt.  I loved that.  \n\nWe followed this up with the chef's signature tasting menu WITH wine pairings.  It was extraordinary.  Every course was to die for.  Every course was my favorite. And the desserts were absolute decadence. \n\nThis is the place to come for a proposal, a big anniversary, or anything that you want to remember FOREVER.  As I said, it was my most memorable meal in NYC.", "author": "J. K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-06-15", "description": "Are no stars possible?! Two of my family members (including myself) called on several occasions in the past two weeks to inquire about making a reservation for a November wedding rehearsal dinner - note we have dined many times in years past and had lovely experiences. Now - we can not even receive a call back to potentially make dinner arrangements  for 12 people - (or not) - assuming a $2000+ bill????? What has happened over there - certainly the idea of customer service went out the window with the hurricane? What a shame as The River Cafe used to be the diamond of the neighborhood - I'm sorry, no place is that good  - that you would consider spending so much money if they cant even respectfully return several phone calls. \nWill be moving on to someplace else that respects it clientele and treats people kindly.", "author": "Susan K."}], "servesCuisine": "American (New)", "priceRange": "Above $61", "name": "The River Café", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Water St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/C_8aEbAvcCLhiqXn9QdWSw/ls.jpg", "@type": "Restaurant", "telephone": "+17185225200"}