{"aggregateRating": {"reviewCount": 1049, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-08", "description": "First off... come here prepared to spend at least $300. If you are planning on spending less, stop reading now and move on to another place.\n\nThe food is great, did the 6 course menu ($125 pp)... every bite was delicious. I would say that the desserts are regular, they aren't out of this world, but pretty good. Every other course was great though!\n\nTry to get a table by the window, even if you have to wait at the bar it's well worth it. \n\nAfterwards I suggest a walk in the park next door, has great views of the city", "author": "Hansel B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-23", "description": "My bf took me to this restaurant for my birthday dinner. The setting was beautiful, and the service was impeccable. The actual food was delicious, but I feel like the steak I ordered was a bit on the dry side, however the lobster tail appetizer was probably the most tender lobster I've ever had. The desserts were very creative, and appealing. It might be a 50/50 in terms of awesome taste. \n\nDefinitely a nice place for a special occasion. :) Will return!", "author": "Cat L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-12-08", "description": "Enough time has past and I'm no longer upset with the cancellation of my anniversary dinner. For all my California followers, this place came highly recommended to me from friends in NY. I anxiously made reservations in May for my August trip. I even noted that we were coming from out of town and it was a special occasion. The \"dress code\" says jackets for men are required so we made sure that we brought proper anniversary attire. We were excited. The night before our reservation I get an email saying they cancelled my reservation AND there was ZERO explanation and NO call. \n\nThis was such a disappointment. I can't explain how upset I was that they would treat their (potential) customer like this. But I guess they saved me $300.", "author": "Steph C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-09-07", "description": "Someone has to say this to spare an embarrassment to the others like me and my husband. Enchanted by the posh and romantic place and reviews we decided to stop by for some drinks after the longest walk ever. The greeter asked us if we are joining for the dinner and having learned that it is \"for the drinks ONLY\" she informed us that men have to wear a dress jacket to be in the bar (probably does not apply if you are having dinner). Although he had a dress shirt and slacks on we felt like we were some bums. Most unpleasant feeling. I get the dress code rule but there should have been a sign on the door or something.", "author": "Anna S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-20", "description": "Best food I've ever had the pleasure of eating in my life. \n\nThere were four of us when we went and we all ordered a different appetizer and main course. This was for lunch, so no 5 course meal for us. Absolutely delicious. \n\nHopefully I'll be back at some point to be able to try their course meal for dinner.", "author": "Nicole D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-11", "description": "Ahhh, The River Cafe.  I came here for lunch with two other friends for Restaurant Week.  I arrived first and walked through the drive-in garden area which kind of prepares you for the atmosphere within.  We got seated in the middle of the restaurant but was still able to catch a nice view, I can only imagine how beautiful it would look at night.  \n\nAnyway, I had the lobster miso consumme which was refreshing.  The dumplings were stuffed and the consumme was light.  The edamame added a nice texture to the dish.  For the entree, I ordered the crispy duck breast(very tender) which was also delicious.  For dessert, I had the trio which consisted of a vanilla bean creme brulee, a warm blueberry almond tart and ice cream from the Brooklyn Ice Cream Factory.  I read a review that said they had a miniature Brooklyn Bridge! I wish we had that!  But both the creme brulee and the tart was yummy. \n\nThis is definitely one of those restaurants where you would go for a special occasion or with someone special.  I enjoyed it for restaurant week and can't wait to come back for dinner!", "author": "Diana L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-13", "description": "This place is just superb.  I had lunch there and the food was amazing, the views were gorgeous and the wait staff was great. I loved it!! Pricey but well worth it. I can't believe it took me so long to experience the River Cafe. I will be back!!!", "author": "Yup Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-18", "description": "In the 6+ years of living in NYC, I only had one comparable eating experience in NYC, and that was Del Posto. I went here for my fiance's birthday dinner, and I was absolutely blown away. Although more continental then it's Manhattan counterparts, the food is beyond spectacular. Also, the experience you will get for $225/person (drinks, wine, food, tip and tax included) is infinitely better than the ridiculous amount of money I spent at Per Se. Oh, did I mention the spectacular view of downtown Manhattan? (For those interested. I would definitely book a reservation time in line with the sun setting)\n\nAs a resident of Brooklyn, I can honestly say I am very proud to have such a world class eatery that I don't have to leave the boro for. Till next time River Cafe!", "author": "Anderson L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-03", "description": "I have been here several times for both lunch and dinner...it does not disappoint in any area. Had dinner with my family at the cafe last night for my wife's birthday...beautiful table on the glass right on the East river across from the freedom tower in Manhattan.\nIf you're not looking for an attentive staff that caters to just about every need or want you or your party may have...don't go here. If you're not looking for a meal that is as close to perfection as a meal could be...don't eat here. The presentation and sometimes table preparation of every course of the prix fixe menu is flawless...the apps of crab cakes, big eye tuna, pear salad were eye pleasing and delicious. The entrees of NY strip steaks and organic Amish chicken were to die for and desserts of Apple almond pave, pumpkin soufflé and chocolate mousse and decorative chocolate Brooklyn Bridge were as artsy as the were tasty. Please know that you are going to drop a lot of coin here and it is worth every cent. If you're looking for a unique dining experience that you won't stop talking about please go here.", "author": "Vinnie C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-29", "description": "hands down the best restaurant in Brooklyn from the scenery to the decor service and the best food anywhere in th boro.treat yourself and a love one. you will thank me.p.s. josh is a class act and knows how to run a restaurant.we need more people like him running the show to keep things at a standard that no one strives for anymore.you pay here but you get what you paid for that is for sure.", "author": "Robert P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-02-02", "description": "I went to The River Café for the \"restaurant week\". It was a wonderful experience. \nI had $27.04 lunch. \nThe appetizer was Citrus Marinated Montauk Fluke. The raw fish was so fresh! \nThe main course was Pan Roasted Duck Breast which was the best duck I've ever had. \nThe Desserts were mini size chocolate marquise Brooklyn Bridgeclassic vanilla bean crème brûlée and warm cranberry and almond tart. They were so delicious! I love it!\nThis was the best \"restaurants week\" meal I've ever had.", "author": "Ivy C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-01-02", "description": "First impression was good with the wonderful view of Manhattan and the Brooklyn bridge from where we sat. It went downhill from there. \nThe tables were right next to each other so getting out for the restroom was a hazardous \"step over the lamp wire\" adventure. Luckily my wife wasn't wearing a tight dress. Next, it took the server a good 20mins after giving us the wine menu before coming to ask what drinks we had wanted. With our wine menu and the food menu still in hand, an appetizer was placed on the plates in front of us, so we had to hold the menu while going through the food we wanted?!! For a good 20minutes.\nThankfully the food was decent, as both my foie gras and steak and my wife's shrimp and duck breast were appetizing. Nevertheless, we were expecting something beyond what we would find at a normal restaurant since this was a 1 Michelin star establishment, and that was a little disappointing.\nOverall, service was tardy, other servers were rude when we did interact with them, and that really spoilt the otherwise nice ambience and decent food, despite paying the price for fine dining.", "author": "Hansen T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-22", "description": "The brunch was amazing! It is a prix fixe menu. I ordered the pear salad (minus the bacon) and the waffle \u0026 eggs Benedict (sans ham) and both were wonderful. For dessert you must try the Brooklyn Bridge chocolate dessert and the sorbet sampler. The wine selection is also top notch. A must visit for excellent food and breathtaking views.", "author": "Jessica G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-20", "description": "I have spent a lot of time here and not only does it have the best view of the Manhattan skyline in existence (if you ask me), but the service is on point and the food is wonderful. You want chic, luxury dining in a gorgeous, romantic setting under the Brooklyn Bridge facing the most beautiful city in America? This is it. There's also a lovely garden (complete with resident garden cat) for strolling through. The River Cafe is a fairy tale and it will steal your heart. All I have to say is... will someone please propose to me here? That would be my wish.", "author": "Bernadette L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-22", "description": "Went here for my birthday last week and it was a wonderful, old world New York experience. It's refined luxury. When you walk up to the restaurant, it really is beautiful. The views are incredible and the food, while not super innovative, was delicious and well executed. I started with the corn ravioli and then had the duck with sweet potato spaetzle and my husband started with the foie gras and then had the steak and bone marrow mashed potatoes (which were pretty cool, as they were served in the bone).  Our server left something to be desired which was a bit annoying for such a nice restaurant, but overall an excellent experience!", "author": "Nicole N."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-07-06", "description": "Pretentious and snobby! My husband and I stopped in to look at their menu on Friday night. We were dressed casual but very nice.  The hostess basically blocked us from entering the restaurant and told us they only offered a pre fix menu for $120pp.  I told my husband I wasn't that hungry and we could just sit at the bar and order a drink and appetizer.\n\nAgain the hostess basically threw herself in front of the door and said, \"I'm sorry you cannot go into the restaurant without a suit jacket\". I told her we just saw a couple leaving and the man had on a polo shirt.  She said, \"Ah, yes, he had a reservation and we lent him a jacket\".\n\nShe looked at us as if we came in dressed like a homeless couple.  We were willing to spend money on what I assume were very over priced drinks and appetizers.  But we will NEVER go back.\n\nMany good choices in the area without their noses in the air! Shame on you River Cafe. You were once a nice establishment but after reopening not so much anymore. We will spend our hard earned money elsewhere.", "author": "Francine P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-09-04", "description": "The River Cafe is always a treat, what a great little oasis!\nWe were there for a wedding ceremony and had the best service and meal money can buy. The only thing was the sound of the East River Ferry's coming in and out every 20min. I imaging it would be the only upside to that would be if you were commuting on it to and from dinner.\nNone-the less, The River Cafe is always a wonderful experience.", "author": "Damani H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-17", "description": "We had the pleasure of being invited to dine with family members at the River Cafe for Father's Day!\nWow! We were immediately seated at a table with a beautiful view of the water, and felt as if we were somewhere very special.  The service was excellent, and the food was incredible.\nWe tried many of the dishes offered, and loved all of them.\n\nA wonderful place to go for a special celebration~\nKudos to the owner, Buzzy, on a truly remarkable eatery!", "author": "Suzie C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-08-15", "description": "It's a nice place but when I saw the way the \"Captains\" and \"Managers\" treat them own staff and busboys I was shock! they are humans no animals!! \n I've been in the restaurant business for years. I can see that everyone works under a lot of stress and unhappy.\nThat's the only reason I won't go back to that place!", "author": "Alberto L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-03", "description": "This place is a MUST for a trip to New York. My husband and I journeyed to NYC from England last summer to celebrate my 30th birthday, and this is the restaurant I chose to spend our last magical night in New York before returning home with a heavy heart- I'm so glad we spent it here.\n\nThis place is magical- from the impressive floral display when you first enter, to the old-romance ambience that hits you when you first walk into the restaurant- dimmed lighting and live piano playing really setting the mood- to the unmissable panoramic view over Manhattan that each and every table can benefit from- this place is amazing.\n\nYes it's expensive- its a fixed price menu so don't go in thinking I'll have one cheap course just to try the place- this ain't that kinda place! You go all out or you go home!\n\nBut its worth it; attentive waiters, exceptional food and wine, a view literally to die for. This place was made for special dinners, and for the last night in NYC it fit the bill perfectly.\n\nTop tip: after your meal you simply MUST mosey on outside to the riverside and take in the view of Manhattan proper. Breathtaking.\n\nI very much wish one day to return here and have already recommended it to friends visiting NYC, who I'm thrilled to say went on to sample River Cafe's delights.\n\nYou won't regret it.", "author": "Suzie G."}], "servesCuisine": "American (New)", "priceRange": "Above $61", "name": "The River Café", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Water St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/C_8aEbAvcCLhiqXn9QdWSw/ls.jpg", "@type": "Restaurant", "telephone": "+17185225200"}