{"aggregateRating": {"reviewCount": 1049, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-09-15", "description": "We got married at River Cafe on Saturday night in April. We had both ceremony and reception. Everything went so well that we couldn't ask better. The view was amazing and food was great. Our guests were so impressed. The special event coordinator, Luke, was so professional and kind.\n\nThe wedding wasn't cheap but it was well worth the money. Highly recommended place for wedding.\nThank you River Cafe. We will go back for 1yr anniversary!", "author": "Meg F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-29", "description": "This restaurant is really romantic and has an amazing view of the city!  We arrived around 7 (read: before sunset) and were seated right next to the windows so there were no obstructions in our view.  Our dinner lasted till around 9:30, which means we were there for a daylight view, a sunset view, and a night view.  It could not have been more perfect!\n\nUnfortunately, the food is not quite as stunning or memorable as the view.  The best dish that we got was the lobster main course, so I would recommend trying that if you go.  I would give 4 1/2 stars if I could but since I can't I'll round up to 5 because I would definitely return.\n\nI would definitely come back here for a romantic night on the town.", "author": "Nina S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-10-13", "description": "I went to a gorgeous wedding at the River Cafe. The ceremony was in the garden with the sun setting in the back drop - and a view of the Statue of Liberty. And the bridge all lit up at night - amazing.\n\nCocktail hour on the patio with champagne and passed oysters, mini mushroom egg rolls, and the most delicately fried shrimp I've ever had.\n\nDinner consisted of 3 small plates. A crab cake, seared tuna with Israeli cous cous and filet with velvety whipped potatoes. And the dessert was a beautiful Napoleon type dessert with layered chocolate and chocolate designs of the Brooklyn bridge. Truly amazing wedding food.\n\nThe venue was perfect. Dancing with the glow of the city lights and the bridge in the background. Service was wonderful. And the bride and groom were the perfect couple for such a wonderful event. Incredible.", "author": "Debra L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-08-19", "description": "The food \u0026 the view well worth the price! BUT the service was lacking... big time! Sat 5here for 30 mins before we had to ask for menus! If you spend over $600 for dinner you should feel like a VIP!", "author": "Deanna M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-06", "description": "One excellent place to relax and enjoy a great meal with someone special!\nIt has a great view , looking over the Hudson river,which makes it even more attractive in my eyes.\nThe food and drinks were superb, top class, as you would expect from such a place.The staff are great, and so is the service. It is advisable to book in advance, and dress smart, it is a relatively expensive place but it worth it , for the view, the food and the atmosphere.Save it for a special occasion!", "author": "mattnick"}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-12-13", "description": "We went there for my birthday. the food was amazing. They had an extensive wine list. The staff was very friendly and professional. They have a spectacular view of the river. Make sure you request a window table when making your reservation. The price can be a little high, our bill was over $400.00 dollars for 2 people. The valet was very cheerful. enjoy!!!!", "author": "Jeffson G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-07", "description": "I recommend this blog http://gastrowine.blogspot.com/2014/02/the-river-cafe.html", "author": "Rocio C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-03-25", "description": "We got dressed up.  Him in a suit.  Me in a cocktail dress (and flip-flops, damn sprained ankle).  It was his birthday and we were going all out.\n\nWe took a car - cause that is how fancy people travel.  We walked in past the forest of fresh flowers and my heart leaped a little.  This was going to be one hell of an evening.\n\nWe were seated promptly and given the chicken salad that everyone raves about on yelp.  We looked out the window and gazed at our lovely city.  We had timed it perfectly - it was still light when we arrived and we got to watch the evening settle along the water and the lights of Manhattan turn on.\n\nBack inside things were going well. We felt classy.  We ordered cocktails.  Fois Gras arrived (omg get the fois gras sauteed, I don't even like fois gras and I loved this.)  My scallops were refreshing.  \n\nWe ordered a bottle of wine.  Our conversation got a bit louder.  The tables around us filled up.  The couple next to us planning their wedding left (and thank god because who really cares which shade of purple flowers she orders.)\n\nOur entrees arrived.  Branzino and duck which were both heavenly and far too much for us to finish because we both knew what was coming.  The tour de force.  The reason for coming to the River Cafe.  The Brooklyn Bridge chocolate construction.  And oh was it worth the calories.  \n\nAnd then the best part of the evening.  A woman who had clearly dragged her boyfriend to dinner sat down next to us.  He bitched that he didn't understand anything on the menu.  She told him to sit up straighter, to let her order, to stop whining and promised to get him a big mac on the way home.  The waiter bargained with him that if he didn't like the fois gras he would get him something else.  And this schmoo said, oh I might like it- I just can't handle the idea of it. And yet, five minutes later the sauteed fois gras was in front of him and we watched as he ate it in three bites.  \n\nThen we took our drunk-stuffed-selves home.", "author": "Becca F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-02", "description": "It's been awhile since I've been here but everything was just as I remembered! Service was great and the food was too. Great atmosphere. The last time I was here, I was a little too drunk and grabbed only few drinks. But this time I was driving and so no drinking and got to enjoy the great experience. \n\nPricey but reccommended on special occassions and romantic nights!", "author": "Reo T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-29", "description": "Walking into the River Café makes you feel as though you are walking into a scene out of a romance novel. When you walk through the front doors, it smells as though you walked into a flower garden with an abundance of beautiful plush flowers all throughout the main entrance. It is quite possibly the most romantic/best date spot in NYC with the beautiful backdrop of the NYC skyline/Brooklyn Bridge where every seat has a view. \n\nMy fiancé and I had wanted to try the River Café and finally decided to go to for dinner to celebrate my grad school graduation.  I must admit that I went in having very high expectations and perhaps that is where I went wrong.  We arrived a bit early to our reservation and grabbed glasses of wine while waiting for our table to be ready. The bartender told us that we could take our drinks to the outdoor deck next to the bar which was a beautiful place to watch the sunset on such a beautiful night. The views are picture perfect! \n\nOnce the table was ready, we were ushered to our table and given melon and gazpacho which was very delicious. You have two options, either the 3- course prefix for $100 or a 6-course tasting menu for $125. We chose the 3 course option, as the tasting menu is the chef's choice and I was really craving chicken for dinner. For the appetizer, I chose a special for the night--it was a cheese risotto with sweet corn and shrimp. The risotto had an odd texture and wasn't as rich and creamy with a bit of resistance as I'm used to, but instead was primarily resistant. The shrimp, however, was grilled to perfection. For my main dish, I ordered the organic chicken breast. The chicken was moist and a great-sized portion, however, there wasn't much flavor. It wasn't bad, it just wasn't anything special I would have expected at a one-star Michelin restaurant. I was won over by the dessert, as it was a great-sized portion and I have a sweet tooth! I ordered the goat cheese cheesecake- the cheesecake itself had a very tart taste which was matched well with the rosemary sorbet. My favorite part was the lemon mousseline--it was absolutely delicious! \n\nOverall, I definitely would come back for the atmosphere alone! If given a choice, instead of ordering a main meal, I would love to just have one of each dessert!", "author": "Kayla C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-09", "description": "My boyfriend surprised me for our anniversary and took me to the River Cafe. I've always heard about this place but never new much of it. To my surprise this place was elegant and fancy. Being that it was our anniversary, the price was just right. It was $125 per person for a prefixed 3 course meal. Even though this place is high-end, you get a lot! It's not like those high-end places which offer you barely anything to eat and leave you wondering what to eat as soon as you leave. My boyfriend and I barely had an appetite for dessert(although we obv had to get lol). The food was amazing and so was the outstanding service. The views of the city were incredible and having the option of sitting side by side with a candle lit dinner made it more worth while. The only issue we had with this place was when we received our bill. We put in more than enough in order to get change. Never once did the waiter ask if we needed change. We are not ones to complain, but if you're at a high end place clearly paying a lot of money, it would be nice to ask if you need change instead of thinking $100 is your tip for just two people. We waited for about 20 mins for our change but our waiter had not returned. When we called his attention he said, \"I'm sorry usually I think that is my tip when people leave more than what the amount comes out to.\" We both just though that was extremely rude to both assume and say. Other than that it was a good experience.", "author": "Gee03 .."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-12", "description": "It didn't need to have amazing food, not when it has this view.  And it doesn't have that, but it does have very good food, much better than it needs, and much better than you'd expect.  Coupled with the view and you get an outstanding restaurant.", "author": "Edward F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-02-17", "description": "The setting of the River Cafe is beautiful. Set underneath the Brooklyn Bridge with a panoramic view of Manhattan, words cannot describe how beautiful it is here.\n\nThis place was worth every penny. Although the food came out a little slow, the six course meal was great. For dessert, we had the Brooklyn Bridge classic vanilla bean creme brulee and warm cranberry and almond tart. Everything was so good!\n\nOverall, spectacular views and great food. This place is not cheap, but I highly recommend this place for special occasions.", "author": "Brian D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-12", "description": "Basically, you get what you pay for at this place. It is $42 per person. You get to choose from an appetizer and an entree. I had the steak Tatar appetizer. It comes with several added ingredients. The waiter mixes them at your table. It was delicious. Then I had the encrusted duck breast. Again, fabulous.", "author": "Tommy L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-04-02", "description": "Finally got my chance to try River Cafe during Dine-In Brooklyn!  For $20.11, we got a 3 course lunch, which was a complete steal.  The view is as gorgeous as everyone says -- but honestly you could get the same view sitting on the adjacent pier.  I was more impressed with the food!  \nThe portions are small (as to be expected with such a nice restaurant), but beautifully presented.  Service was the kind where you don't notice the waiters, but magically your water glass is always full.  The best part was...they didn't rush us in the least as my friends and I lingered over coffee to catch up.  \n\nRiver Cafe goes to show that Brooklyn can hold its own with fine dining!", "author": "Anny C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-07-18", "description": "Marriages, or relationships, are a bit like cars. If you want them to last, you have to treat them with care, and do all of your ordinary maintenance. \n\nAnd every once in a while, you gotta have some major maintenance, like doing something memorable; in our case, my major maintenance was taking my wife to NY for our 10th wedding anniversary. Which opened the issue of where to have THE anniversary dinner. Some place memorable was needed, so I decided to go for the view; checked out a few panoramic places in Manhattan, but they all seemed a bit tacky or touristy (not that we were anything else, but still). \n\nThen my due diligence took me to the River Cafe, in Brooklyn, just at the other end of the bridge.\n\nExchanged a few emails and phone calls, made a reservation, negotiated an hour (initially they only had 6,30 or 9,30 slots, the first being too un-romantic, the second too late for my jet-lag), and finally here we are.\n\nJust as requested given the occasion, the maitre d' kept us a first row table by the window (and eventually had the pastissier write \"Happy Anniversary\" on our dessert, which was not requested but very sweet).\n\nStrictly speaking, taken individually, most elements are probably worth 4 stars rather than 5. \n\nI had scallops chevice as an entrée and it was very good, though not memorable (and just had a far resemblance to ceviche, actually); and the same goes for all the rest; but then again, I live in Italy, and that may have made me a bit demanding with food.\n\nThe room is nice, tables are well laid, though from a Michelin-starred place you'd probably expect a bit more. Piano discreetly plays in the background, and patrons are quite elegant, as prescribed by the dress code: business dinners, couples taking out the in-laws, etc. Not much privacy, given how crammed the tables are.\n\nBut the view: breathtaking is the only appropriate word I can think of: the bridge literally over your head (well, almost), lower Manhattan just in front of you.\n\nService is good, but a couple of times I had to pour the wine myself; which of course didn't kill me, I do it all the time at home and in most restaurant I eat at; still, at a place like this you'd probably expect a bit more. But then I must say the way the maitre d' took care of our special evening was really flawless.\n\nThis, and the view, made our evening as unforgettable as can be, and well worth 5 stars: only because there's no 6th star available. And even breaking my all-time personal bill record (keep 350 $ ready for a dinner for two; that is if you fly low with the wine and undertip the Maitre d' - for which I sincerely apologize...) felt totally worth it. After all, you don't celebrate a tenth anniversary all that often, do you...", "author": "Luca C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-01-27", "description": "Michelin madness continues with a visit to this newly minted 1-star restaurant right on the waterfront in Brooklyn.  The view of the Manhattan skyline is gorgeous.  Unfortunately, it seems to distract most people, including reviewers, from the lackluster quality of the food.  \n\nI had a three course meal that began with the Maine sea scallop and lobster chowder.  They describe this on the menu as including lobster cream, poached scallopS, russet potato, leeks, fresh herbs, and coral.  Note the \"s\" on scallops.  In truth, there was about one third of a single scallop in this soup.  A similar sized piece of lobster was also included.  Both were fresh and flavorful, but noticeably small.  The potato was about 3-4 dice.  The broth was poured tableside, but the effect was lost given the comically small portion size.  I found the chowder to generally be good, but there simply was not enough of it to really remember its essence.  What it was successful in doing was making me very hungry for my entree.\n\nFor the entree I had the slow smoked pork shoulder.  This was single handedly the most ill-conceived dish I ever had in a Michelin starred restaurant.  Allow me to take you through it.  The smoked pork recalled almost immediately a flavor from my childhood:  sloppy joes.  This not exactly a good thing in fine dining.  Worse, the dish had blood oranges in it which punctuated it with bursts of citrus.  So, more properly, it was like eating sloppy joes with orange juice.  Not to be outdone, there were ricotta dumplings in the dish.  So, sloppy joes, orange juice, and melted cheese.  If that is not ill-conceived, I don't know what is.  The flavors clearly did not meld together to create something greater than its parts.  Just regrettable.  It was the only time I seriously considered sending a dish back in a restaurant for the simple reason of being terrible.  I labored through it though.  That aside, a restaurant of this caliber absolutely should be able to stand by all of its dishes.  \n\nMoving on to dessert, I had a trio that included creme brulee banana bread pudding, coconut sorbet with a coconut chip, and milk chocolate ganache with candied coco nibs.  Of note was the portion size.  For some reason this dish was very large.  In fact, it was larger than the appetizer and the entree put together.  Strange.  Each dessert was decent.  I thought the sorbet had a nice, subtle coconut flavor.  The banana pudding was a little dense, but I like the contrast the creme brulee on top provided.  The ganache was overstated though as it was mostly a hyped up dollop of chocolate pudding in need of a sieve.  \n\nThe service was functional and mostly okay.  I was put off though when the dessert was brought out and quickly placed before us, with the server quickly walking off.  That is to say, there was no explanation of anything being presented, even though that was done with several other patrons near us.  This was a curious lapse for a Michelin rated place, but otherwise the service was efficient and at times genial.  \n\nOver all, it is quite clear to me that the main draw here is the view.  The food simply could not hold up to any scrutiny.  Given the price point here, I could not recommend this place, save for a drink at the bar while waiting on a reservation elsewhere.", "author": "Jim U."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-07-18", "description": "Went for lunch restaurant week.  Overall, a decent experience but I would never pay full price here.  The view is great, service above average.  The entrees were sub par and for dessert they did not even offer their famous 'Brooklyn Bridge' Cake.  I never understood how restaurants during restaurant week don't put there best  foot forward, if they had I would have gone back, but instead you cheaped out so no bueno... \n\nAlso, this is completely absurd, it is 95 degrees today and humid and the hostess told me no water bottles allowed, but the way she said and looked at me... have you been outside?  I think if you did not have water today that is odd... \n\nSorry River Cafe... go elsewhere for a great meal...", "author": "Chi J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-04", "description": "It's 1:34 in the morning and I just got home. I'm completely exhausted but I simply couldn't go to bed without writing a review. \n\nI scored reservations here after relentlessly calling the restaurant to see if there were any openings, with the hopes that I might be able to bring my best friend here for his birthday, and I got the happy call late this afternoon. We were in! Still, after reading such a wide range of reviews here from people who seemed to be peeved by mediocre food or snotty service, I was nervous. \n\nI shouldn't have been. \n\nSince neither of us had ever been there, the oohs and ahhs immediately commenced as soon as we started pulling into the cobblestone driveway. The trees were lit, the water sparkled invitingly beyond the restaurant, and the Brooklyn bridge looming directly overhead truly made our spines tingle with anticipation. The night just became more and more magical with each passing moment. I was concerned that we wouldn't have a nice view because we didn't get window seats, but we had an eyeful plenty from our seat because the entire side of the restaurant is a glass wall, displaying a panoramic view of the East River. Beautiful as it was, I would have been truly sorry if the view was all they had going for them. Instead, I was THRILLED to find that the food knocked our socks off. Our appetizers were delicious (rabbit and dumplings and crab bisque), as well as the amuse bouche of ham \u0026 potato croquette and some kind of chive sauce (we missed the description, but I could have eaten a plate full of that for my entree). My best friend ordered the steak and gratin potatoes, which I would have defended to the death with my steak knife had I ordered it, it was that delicious. But because he is a far better person than I am, he allowed me a few generous tastes. Artfully charred, but still tender and perfectly pink on the inside. It truly made our eyes roll into the back of our heads. I had the salmon in mushroom sauce, which was seasoned and simply prepared, but also one of the freshest fish that has ever been introduced to the sea of my gastric juices. \n\nDesserts came afterwards, with a sorbet assortment for him, the apple and almond tart for me. They thoughtfully provided a candle for his birthday, without any embarrassing waiters clapping and singing a la Applebees. The service was completely on point, and we had to chuckle at the fact that our water glasses seemed to be refilled every time we took a sip. \n\nIt was a perfect night with unbelievable service and the most romantic setting possible. I don't like giving 5 stars too readily, but this was certainly a no-brainer.", "author": "Jane I."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-07-11", "description": "Go for the view - which is spectacular - but not for the service.  My wife and I have been here before - first within a few years of opening and then most recently about a year before Sandy hit.  I booked a reservation on our anniversary - 37th - which also happens to be how long River Cafe has been around.  I mentioned this when I made the reservation.  We arrived early so we could have drink at the bar, which is a great way to kill time with that terrific view.  No one came and got us and when I went to the hostess was told we can seat you when ready - which of course we were.  That seemed odd.  We were then seated at the smallest table for 2 in the restaurant.  The waiter asked us if we wanted bottled or tap water, and if we had any allergies as were going to be getting an amuse bouches.  Very robotic and cold.  A captain takes the order and we got through our 3 courses.  Food was good, but not extraordinary.  Looking at the wine menu I was not even approached by a sommeliere or anyone else to offer assistance in picking a wine.  I am knowledgeable enough to make my own choice, but in any good restaurant I have been to I have always been asked by the wine steward or someone on the staff if I wanted assistance with my choice.  Again - less than stellar service.\n\nOh, almost forgot - remember the anniversary?  Well, while I wasn't expecting anything special it would have been nice to have it acknowledged by the maitre d'hotel, or someone on the staff.  Didn't happen.\n\nAt any rate, the meal was OK but the service was impersonal and robotic, coupled with very cramped tables and space overall.  If I were to go back it would be to the bar and then somewhere else for dinner.  However, be aware that you can't drop into the bar unless you are properly dressed - which is fine, it maintains the atmosphere.\n\nYou win some and lose some.....", "author": "Nick P."}], "servesCuisine": "American (New)", "priceRange": "Above $61", "name": "The River Café", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Water St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/C_8aEbAvcCLhiqXn9QdWSw/ls.jpg", "@type": "Restaurant", "telephone": "+17185225200"}