{"aggregateRating": {"reviewCount": 1049, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-28", "description": "The food, the ambience, the decor, the servers were good. I did experience a problem in this upscale restaurant. We accidentally knock down one if our drinks, they quickly came to clean up but did not offer a replacement or even asked if we wanted something else, for a restaurant of this class i would have expected that but it did not happen. I think the price is good I left the restaurant very satisfied. The crab cakes left me a little disappointed, the mushroom wellington delicious. The bread is very hard for the most part, the only soft one was the multigrain bread, the other two almost broke my teeth. Expect to pay around $350 for two.", "author": "Freddy R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-18", "description": "Best food I've had in NYC. Everything about my anniversary dinner was perfect. My husband reserved a table for dinner and proposed after the most delicious treat I've had in a long time. It's such a romantic and beautiful setting, the staff is so attentive. When we told our waiter I couldn't drink because I was pregnant he offered the most delicious mocktails I ever had! I can't wait to come back next year, and I promise I'll find a baby sitter for the night of course.", "author": "Nameless N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-01", "description": "Truly beautiful place.  But they work limited hours during the week. Only breakfast till 11:50 and dinner starts at 5:00. To make reservation was the weekday call month in advance!!!", "author": "Anastasia G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-05", "description": "The River Cafe is an experience: best view, service, and food. Now, it isn't cheap, but if you can swing it, it is worth every penny if you do it right. I had the sea scallop foie gras to start and the branzino, but my brother's lamb chops were the best meal I tried at our table. Honestly, it is one of the best restaurants I've ever been to and highly recommend it.", "author": "Vincent O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-10", "description": "My boyfriend and I are super critical when it comes to food and dining experiences, so I am pleased to say that we had the most wonderful time at the River Cafe on Sunday.  They sat us at a romantic table for two in the large banket area up against the wall and it offered the perfect vantage point of the entire dining room and the Manhattan skyline.  It doesn't sound all that romantic but it totally was because we were the only ones seated on that side of the restaurant while everyone else sat at the window.  It turns out my thoughtful boyfriend requested a romantic table. He's the best...  \n\nThe service was flawless. Water and wine was constantly being topped off, which is something so small but makes a huge difference.  The waitstaff in general were all extremely knowledgeable, gracious, and really made us feel special. \n\nThe food was fantastic but I will admit the filling in my Coquelet was a bit dry, but I swear that is my one and only criticism.  If there is any hesitation about what to get, the Roasted Rabbit appetizer and the Lamb as a main will blow your mind.   It was a spectacular birthday that I'm sure we will never forget.", "author": "Tatiana M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-05-14", "description": "You're basically paying $100+ per hour ($300 per person) to experience a beautiful river and bridge view. The service is very good and the crowd is filled with birthdays, anniversaries, proposals, and other celebrations from all reaches of the tri state area.  As for the food, it's fine but not amazing or creative. The wine list provides no high value options and the wine pairings that go with the tasting menus are underwhelming in general and especially for the $125 per person cost.  Go with tourist business colleagues who aren't into creative cuisine and on an expense account.", "author": "John L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-10", "description": "What a wonderful restaurant. We were dressed to the nine's, celebrating a special occasion, and had requested on the resy that they sit us by the window, so that's what they did (the wait staff was excellent). The food was not particularly innovative (that's not what they're known for), but it was really well done, and sometimes the classics are just what I need. We had the corn ravioli (ok, I guess that is kind of innovative), wagyu tartare, lobster, and lamb. For dessert, of course we had to get the somewhat kitschy Brooklyn Bridge dessert (better looking than tasting).\n\nTip: They have a bar that also looks out into the bridge, so if you don't want to spend $$$$ on dinner, you can spend $$$ siting at the bar sipping bubbles.", "author": "Tammy K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-18", "description": "First real chance to be out this spring and decided to walk around Brooklyn waterfront. We walked into the River Cafe and asked for an outdoor table.\n\nThe Hostess actually told us that there was no table service outside but luckily the Maitre d' caught us on our way out and agreed that it was so beautiful out that he would accommodate us. \n\nWe were really glad he did. Our waiter was EXCELLENT and the chef sent complimentary amuse bouche that was simply perfect!\n\nThe lunch menu was a fixed price pairing of a choice of appetizer and entree. Every dish was perfect and delicious. \n\nAs we sat enjoying the sun and our drinks, a sea lion surfaced just off the pier. A perfect end to a perfect lunch.", "author": "Jerry G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-24", "description": "This place is perfect for celebrating. My boyfriend invited me for a dinner on my birthday night. The dinning room was quite with a gentleman playing piano in the corner. Great skyline view from the window. But we didn't get a window spot they said the window seats are saved for regular customers. Well okay we were first timer's and we have to swallow that. A little pricey. You are paying for the view but didn't get the view. One point taken.\n\nThey put a happy birthday note and candle when dessert was served, that was really sweet! The captain the waiters were very friendly and professional! A big thumb up! Oh and the food was amazing too!", "author": "Teddy W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-17", "description": "Situated beneath the Brooklyn Bridge with striking views of Manhattan from the East River, the iconic River Cafe does not disappoint for a special occasion.\n\nI took my boyfriend here for his birthday for the first time and was impressed. The decor was very classic and the atmosphere - sophisticated. The courtyard was adorned with fresh flowers secluded from the hustle and bustle of the DUMBO piers. The staff was a little stuffy, but extremely knowledgeable and polite. \n\nDRESS CODE: Men must wear a jacket at all times past 5pm or admittance will be terminated. Look sharp and presentable - everyone else will be too. I saw a couple get turned away for a dress code violation so be aware of their policies which can be found on their website.\n\nThe food is pricey but worth it. $115 for prix-fixe and a more expensive 6 course tasting menu is available. Check the website for the items that will be available for the evening. \n\nThe chocolate mousse Brooklyn Bridge is a must-try. \n\nAll in all, have your wallet ready and a reservation booked early in advance, bring a suit jacket and have an empty stomach.\n\nP.S. My 7pm reservation was perfect for views of the sunset from the East River.", "author": "Steven F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-18", "description": "We showed up at 5:30 - the first people to enter the restaurant, and it quickly became a matter of maître:\n\n-Can we have a seat by the window?\n-No\n-Why Not?\n-It is reserved for people who have come here a couple times\n-What is a couple of times, exactly?\n::condescending hand wave::\n\nAfter a brief cage match, we did get a notable upgrade to the middle of the restaurant.\n\nRiver Café is a unique proposition: its waterfront location is Brooklyn bridge adjacent, and it boasts a beautifully-landscaped garden that reminds you of the French countryside in the back.  I haven't encountered many restaurants that have peonies, roses, violets: a wall of flowers leading up to the entrance.\nThe restaurant has an amazing ambiance - just a wonderful view to match the special-occasion atmosphere.  Watch the sun set over the financial district, and marvel at the glimmering lights in the distance (as well as the jewelry of the upscale crowd inside).  I'm sure she'll say yes after she finds the carbon crystal at the bottom of her champagne glass.\n\nThe food, however, is not this cafe's strongest point.  I was really hoping for superlatives here, but it was just not what I expected.  I particularly didn't enjoy my tough-as-nails wall street standard 16oz steak sashimi.  Swallow your testosterone and order something else.  On the bright side, the milk chocolate soufflé was delectable.  \nI think I'll come back as many times as it takes to get my elite window seat status.", "author": "Artem A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-28", "description": "The River Café is an incredible landmark.  It's something that will always come to my mind when I think about Brooklyn Heights.\nI do not remember times when it was not where - but I do remember first time I came to the River Café to celebrate one of the friends birthday. That was years ago, but time after time, I did return - either on special occasions, or when you needed a special oomph in your life.\nWhile it closed briefly after Sandy, it is back and open for business - so I decided to go back to my roots in Brooklyn and walk familiar paths.\n\nReservations are quite mission impossible for dinner - but lunch time is much easier through the Open Table. Prix fixe menu for lunch is $42, and that would include appetizer and entree (drinks and desserts are a la carte). But there are also amuse-bouche and sweets on the end of your meal, courtesy of the chef.\n\nIt is old-school perfection in any sense, from walking to the doors and through the walkway to the actual dining room that sits right on the East River.\nThe live piano greets you with soft music, and you ushered quickly to your window table (if you lucky like me). \nViews are just spectacular (and even more so at night time). Brooklyn Bridge, The City, wavy waters of the river, and water taxis flying back and forth.\n\nStarted with warm bread and delightful amuse-bouche, presented in a little egg stand - it was smoked salmon and custard, perfect bite.\nThe drinks menu is something worth noting as well, wine and madeira list is very impressive. Mixed drinks are exquisite (altho quite pricey) - Sazerac was a perfection in a glass.\nOnce I got all the ducks ...er... drinks in order, we were ready to move to the food. Oh, the glorious orgasmic food. Yes, that good. Shivers-to-your-spine, eyes-closed, savour-every-bite good.\nThe scallop ceviche was presented on the base of ice in little shells - light, refreshing, with good acidity and bite.\nThe main course was something that would made good scene for \"when Harry met Sally\". The duck breast, cooked precise medium rare, seasoned so perfectly, that every bite make your mouth water for more. This is the best duck breast I EVER ate. No joke.\nDesert was an art on the plate, and delicious to boot, plus, complimentary sweets were pretty awesome. I also had cup of tea to finish the meal while enjoying more views of the waterfront.\n\nService is impeccable. It goes without mentioning. Not one thing was out of order or out of place. No hovering, just quick, pleasant and extremely polite.\n\nIf you want to select one place for special occasion - this is THE place to go.", "author": "Nadia Z."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-27", "description": "After reading so many amazing reviews and seeing beautiful sunset pictures, I was super excited and looking forward to bring my girlfriend here for our anniversary!!\n\nThe venue itself is super small, very tight corners, all the tables are very close to each other and only one person can pass by (while others are pushed up against the seated patrons), even while waiting for our table, in the bar area - which is squeezed into the corner was stuffy and bumped few people as I sat. Once we sat, we were in the back near the door and had a very obstructed sunset view\n\nBesides the physical constraints, the food and service turned out to be absolutely spectacular - which is why the 4-star review!! They only have an expensive (VERY expensive) fixed price 3-course meal... it is well-noted on their website menu about the price - BUT for the small portion sizes of the dishes, the price could be lowered.\n\nOnto the food - As mentioned, the portions are small... BUT, everything was so fresh and flavourful and tasty; plus the presentation of each dish is so delicate and beautiful.", "author": "Andrew C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-30", "description": "Beyond expectations... FOOD \u0026 SERVICE \u0026 perfect martini etc - I was with my parents who were visiting from Hawaii. The ambiance the service and the food was spectacular. The views are out of this world - sunset was amazing. The spirit of Aloha lives her on the water. My Octopus appetizer was super flavorful and perfectly presented. The goat cheesecake I would of never ordered but because it was a three course meal I had to \u0026 and I am grateful I did I ate everything :D The chocolate bridge was beautiful as well.\nIt's a real treat to have been able to enjoy the place with family:D I think it's an ideal romantic place for couples celebrating you can have conversation and take in a breathtaking view of NYC.", "author": "Hélène C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-30", "description": "Brunch: Amazing service, great view. We had the foie gras and steak tartare as appetizers and bronzino and lobster pasta entrees and all were great. We stayed for some time after finishing and they didn't rush us.", "author": "David F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-05-19", "description": "Came here few months Back . We dined   here for our wedding anniversary, the place is beautiful and the service was great. \nThe food besides being visually impressive  wasn't anything special to make us come back . \nOverall this  place is more for an experience and view.", "author": "Vera B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-10", "description": "Classy Uscale place. Romantic. Food is excellent no question! \nWent there few times and it takes your breath away.", "author": "Terry Š."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-26", "description": "Wowza!  \n\nWas surprised and taken here for a special occasion \u0026I it definitely is a WOW-er. As you walk in you are greeted by a couple of hostesses in the lobby and are ushered into the actual restaurant after confirming your reservation. We were a bit early, so asked to sit at the bar. I ordered a Sauvignon Blanc, for 13.00..which honestly not too bad given the caliber of this restaurant \u0026 the price that they charge for food. As we sat down, I felt like we had a team of staffers ready to help at any turn of the head. They brought over a small bench for my purse to be placed beside the table which I loved! The menu is pre fixe and you have the option of a three course for $115.00 per person or a six course tasting menu for $145.00 per person. The staff brought over a complimentary chilled gazpacho soup \u0026 a small watermelon and feta bite which was great. I feel like the appetizer choices could have included at least one option for someone who's palate  is not as experienced besides a salad, my date was adventitious and had the rabbit, because in his words \"I am not spending this amount of money and getting a salad\". He actually loved it and I tried it and it had a  mild surprising taste. I ordered the Wild shrimp with white asparagus and crabmeat which was DELICIOUS. Both of us devoured every bite of our appetizers. For entrees, I ordered the branzino fillet, served with an amazing shrimp and chorizo crust and he ordered the 16 oz strip steak accompanied by bone marrow mash (again stepping out of his comfort zone)  everything again was devoured. The River Cafe definitely knows the exact amount of food to leave you satisfied but not overly stuffed. On to the desert, we had the Brooklyn Bridge \u0026 the warm marshmallow and chocolate soufflé. They were beautifully plated and SO yummy. The staff had Happy Anniversary written in chocolate for us along with candles, which was beautiful. \n\n\nThe view is spectacular and I am sure at night it is beyond words (we dined from around (5:30 to 7:40 before running off to our play). It is extremely expensive and I deducted a star maybe because I am cheap- but believe that it is just a bit overboard. The staff is extremely friendly, and made us feel like we belonged and  actually could afford eating there without selling our firstborn. Would definitely recommend coming here for a special occasion.", "author": "Jessica N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-10", "description": "If you ever have the pleasure of coming here, do it on the 4th of July!\n\nA friend of mine invited me to a dinner party for the 4th. Yes me... i thought ummmm is this place ready for all of my personality, including my loud laugh??? Then I thought about the guest list for the dinner party and figured the river cafe didn't know what they got themselves into when they gave us a reservation. \n\n1st... there is a bit of a dress code: Men make sure you wear a jacket...YES, even in the summer. Ladies grab a sundress or cocktail dress and leave the jeans and flip flops for the diner. \n\n2nd... the fine dining experience is a bit different. The pre-fixe menu included, complimentary champagne and caviar, appetizer, entree, and dessert. Veuve clicquot is served... a goodie and out comes the caviar. Not a fan of caviar, but the mini pancakes that it came with were good (clearly, my fine dining training is minimal..LOL). For the appetizer I had the arugula salad w/ strawberries, beets, and a light dressing...pretty tasty. For my entree I had the strip steak and it was flavorful and made just right. Dessert was a smorgasbord of treats...chocolate bk bridge, a mini ice cream bar, and something else I couldn't identify but it was tasty. The other guest ordered the duck, the lamb, the mushroom wellington and seemed to be in heaven. \n\n3rd....the feeling of being served is a bit amazing. Our waiter or waiters were more than accommodating and seemed to appear when you thought of them. Just enjoy the experience. \n\n4th....you will be selling a body part to pay for your meal. It is pricey, but 1 time a year it's okay to splurge.", "author": "Ebony C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-09", "description": "What an amazing restaurant with spectacular Brooklyn bridge and river views. Business casual attires are required. Traditional English inspired interior designs enhanced by country style furniture. Beautiful waitress as your door attendant makes you feel like a million. Lol. Prix fixe menu. I had foie gras three ways as appetizer,every single way is amazing. The entrees is lobster. Very savory. Beautiful presentation as well. Compremantary dessert. Mine is a Brooklyn bridge chocolate cake. I don't have sweet tooth so 90% of bridge was left untouched. I wish it could  be replaced with salad or soup...\n\nOverall, the ambience of this restaurant is super romantic. Savory food and friendly staff.", "author": "Monique C."}], "servesCuisine": "American (New)", "priceRange": "Above $61", "name": "The River Café", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Water St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/C_8aEbAvcCLhiqXn9QdWSw/ls.jpg", "@type": "Restaurant", "telephone": "+17185225200"}