{"aggregateRating": {"reviewCount": 1049, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-02", "description": "A fine dining experience close to my Brooklyn home.\n While I have been here once before it was years ago . \n  The river cafe does a really nice job on all counts.\nFrom the Amuse bouch right through desert everything was up to par and above.\nWine service was top shelf as was the list\nAnd the staff attentive .\n   If their is a negative it's the seating\nTight and not really comfortable\nThe table we had was on the small side for 4 and the chairs too small.\nNot really up to the task of serving 5 or six courses with cocktails and  wine over a long period.\nOver all I would go back\n With certain seating request", "author": "Anthony S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-27", "description": "Yes, woohoo...!... This place IS as good as it gets! \n\nWe came for my daughter's 12th birthday party on November 30.\n\nIn making the reservations over the phone, I just happened to mention that it was my daughter's birthday, it was in passing...I didn't make a point of it. \n\nWalking in, the maitre d' and the hostess said, welcome and happy birthday to her, as well as the wine steward and our waiter as well. Considering the place was very busy, it's amazing how they got the word around to the staff tending to us. It was just a nice touch to make her feel special. \n\nThe food, as always, is top notch. You can't miss here. Yes, prix fixe at $120 per person is kind of steep, but a nice treat every once in a while.  \n\nBeautiful views.....patrons slightly skewed to the over 60 crowd, but it's ok. Well worth it.", "author": "Soumax .."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-28", "description": "Classic restaurant in NY. You gotta love it. Excellent food and absolutely view. The level of service is nothing but outstanding. Nothing to complain about at all (although the bill was kind of crazy ;-))", "author": "Rasmus C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-02-11", "description": "We were very excited to finally try the River Café, it had been on our bucket list for 3 years. It's in a beautiful location and upon walking up we were impressed with the landscaping and the view. The hostess was quick to take our jackets and we were seated immediately. The service was fantastic throughout, however their quick help felt at times, like they were pushing us along a conveyer belt. Now - the food. Given the price there was a LARGE disparity between the price and quality. Our appetizers, roasted rabbit and scallops/ pork belly came quickly and were presented nicely. The \"scallops\" were in fact, only one small scallop but it was a tasty combination with the pork belly. The roasted rabbit was a disappointment. The meat itself was flavorless, and the accompanying mini lasagna tasted like a store-bought Ragu recipe. For entrees, we had the Duck Breast and Monkfish. The monkfish was served beautifully, but the flavor did not match up. The fish itself was totally bland and the accompanying elements added nothing. The duck breast was an ugly presentation, and the taste was also poor. It was far too salty, and the cut of duck was quite fatty. Unfortunately, neither of us even finished our entrees, and were left somewhat hungry. The highlight of the meal was the key lime soufflé, which was a delicious and beautifully presented dessert. Overall, a great setting with terrific service, but the food did not match the price nor the expectations we had set.", "author": "J A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-06", "description": "Is it pricy? definitely but it worths... We went there for a last minute celebration and were lucky to find a table for four without reservation, but I wouldn't push my luck next time. They give jacket to men if needed. But there were many with jeans and sport shoes so dress code is casual/ smart casual...\n\nEverything was delicious; we all ordered different things and tried from each other and the most outstanding was the steak tartare and Rabbit Crepinette (for appetizers), duck breast, (for main course) and soufflé\u0026 Chocolate Brooklyn Bridge (for dessert). \n\nso enjoy!", "author": "N A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-09", "description": "I am a fan because of the phenomenal menu and the beautiful ambience. If you reserve a table later in the night, you will have a better chance of having a seat along the river. The customer service - the receptionists- were not as pleasant as I expected. I was surprised since there were two of them.  However, the waiter was extremely nice. Anything on the menu is delicious. The pear salad is a great appetizer.", "author": "Michelle F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-05", "description": "Just to be clear: everything was perfect!! The food was exquisite, cleverly designed, well executed and delicious. Its 3 courses, price fixe. You order app and main course first, dessert later. Of course this is after they let you settle in, have a drink and look over the menu and wine list. We got a window table because I noted our anniversary when booking the reservation on Open Table. BTW, make reservations WAY IN ADVANCE. Views are spectacular!! Service is not just excellent. You feel like they care. Yes it is VERY expensive. So once a year for a very special occasion is my limit.....but well worth it!", "author": "Bob B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-02", "description": "What a beautiful restaurant. This is one of the more expensive places that I've ever eaten in, but also one of the more majestic. The view while you are eating is incredible. The place itself is beautiful. Stand at that bar, have a cocktail and just try not to be overwhelmed by the view. Richard Kimball on the piano will make an evening in of itself. \n\nI've eaten here twice, once for brunch and once for dinner. Both were amazing. The desserts are just as good as the entrees. You have to try the Brooklyn Bridge Cake. \n\nA jacket is required.", "author": "Whoo W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-07", "description": "It is our anniversary and my girlfriend wanted us to have dinner at this restaurant. Unbeknownst to her I had already made reservations at another restaurant and was eagerly looking forward to eating there. However, after reading the reviews online and doing some research about the history and quality of service at this restaurant, I instantly made reservations and cancelled my initial reservations at the other restaurant. I have to say that this place absolutely lives up to their reputation. We were greeted from the main entrance by two doorman and were offered valet service. We were then escorted by another gentleman inside where we were greeted by a host and another young lady who gave us tickets and took our coats and scarfs. We were then escorted to a second host who confirmed our reservations and offered us a seat at the bar until they began seating for dinner (we were a bit early). We were shortly escorted to our seats and our drinks were brought over from the bar. Interestingly, it seemed like everyone was assisting our table. We weren't even allowed to pour our own water. It goes with out saying that the view was breathtaking and the food was absolutely exquisite. Everything from the Chef's welcome dish, appitizer, main course, and desert was to die for. I give it a 10 out of 10. I am not certain who the Head Chef was, but I guarantee you that his food is second to none. Literally, the best restaurant experience we have ever had. The decor was elegant as well: lots of lamps, candles, and wood gave it an elegant somewhat maritime feel. I would absolutely recommend this restaurant. And for our 7th anniversary this experience has made it unforgettably amazing. Thank you everyone of everything you did to make this dinner uniquely remarkable.", "author": "Edward B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-02", "description": "Wonderful view on Manhattan, historic reataurant, grand classic. Table, flowers, location, service, food everything is nailed to perfection", "author": "Celine T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-04-28", "description": "My family in New York has been talking up River Cafe for years now-- my aunt even had her wedding reception here.  I didn't think there was any way it could live up to the hype, but after going to lunch there this past Monday, I can honestly say that it did.\n\nThe view is incredible-- a full wall of windows looking at Manhattan, the Brooklyn Bridge, and the East River.  Service is impeccable.  The restaurant itself is beautiful and full of flowers.  And of course, the food is fantastic.\n\nThe appetizers are definitely all on the fancy side.  My aunt had the foie gras and said it was delicious.  The boyfriend and I both had the crab soup.  It is prepared tableside-- you get a bowl with an awesome pile of lump crab, and they pour the soup over it.  The flavors are perfectly balanced, and it tastes creamy without any cream.  I couldn't decide between about five different entrees (the sign of a good menu, no?) and ended up ordering the \"Lobster \u0026 Lobster.\"  The lobster tail was perfectly cooked, and the grilled cheese that came with was fantastic-- the truffle flavor didn't really come through, but you can't go wrong with lobster grilled cheese.  My aunt had the branzino; it looked fabulous and she finished every bite.  The boyfriend went with the steak, and while it wasn't cooked quite evenly (medium rare for most of it but medium well on the ends) he said it was great, and it came with the best fries I've ever tasted.  For dessert, I had the \"Brooklyn Bridge\" and it was great, plus probably the most beautiful thing I've ever eaten.  I can't remember what they had, but remember they both enjoyed it.\n\nSuper expensive, but if you're going to splurge-- or if you're staying with someone who wants to splurge-- I'd highly recommend it.", "author": "Samantha E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-29", "description": "What a beautiful and relaxing atmosphere. With a panoramic view of the east river, Brooklyn bridge, and statue of liberty; the scenery is unmatched as you dine at this well deserved Michelin star establishment (they should have 3) \nDelicious cocktails, and professional eloquent staff.", "author": "James C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-06-13", "description": "Over-priced for the food they have to offer! Food was ok, view is great, deserts are good!", "author": "Sanchita M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-12-06", "description": "I went for brunch a few weeks ago and enjoyed the atmosphere and the view. The food, however, was not all that great. Other than the pear salad, everything else was forgettable.", "author": "Clarissa C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-12-22", "description": "The views are wonderful, the food is good, the service is awful. My fiancé and I live in the neighborhood and went for a pre-Christmas dinner. When we asked the sommelier for a bottle of wine around $100 he scoffed. After that, our service was spotty, and we waited over 30 minutes for our check. I spoke with the manager who apologized, but my advice would be to take your business elsewhere.  You should leave a nice dinner excited about the experience rather than embarrassed for not spending enough money.", "author": "Jacqui S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-03", "description": "A signature dining experience for us during a visit to Brooklyn. We arrived a little early and settled comfortably in the piano bar with cocktails to await our third guest. It was early evening on a rainy October day so the view of lower Manhattan was misty yet inspiring. Service was attentive and friendly and we were seated promptly after our guest arrived.\nWe enjoyed the two course pris fixe dinner, starting with tuna tartar for one guest and the Wagyu beef steak tartare for the other two. The Wagyu came in a neat circle with rays of condiments surrounding. The shell of the shiny quail egg was propped to the side and served as a cellar for a measure of sea salt. The entrees of lamb and duck breast were expertly prepared and simply presented. The wine list is a little dangerous but with the cooperative maitre'd we were able to select 2 bottles of red that were reasonably priced and bold enough for the meal. We finished with the Madeira flight and confections for dessert. \nA wonderful evening. Highly recommended to anyone with the occasion to dress up and eat well.", "author": "Dan J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-27", "description": "I had come here in Summer 2012, before the place was temporarily shut down by Sandy. My brother and I treated our mother to this place for her birthday, and it couldn't have been a better choice. \n\nFirst thing you should know is that the place is strict with their dress code requirement, they require you to wear a jacket after 5 p.m. and prefer you wear a collared shirt--basically they have a business casual dress code.\n\nOnce you have taken care of your clothing selection, now it is time to enjoy the gorgeous view that this place offers. Its location is under the Brooklyn Bridge, and it offers a breathtaking  view Manhattan skyline, especially at night time. I must admit, however, that the atmosphere at the place is stuffy, and feels slightly pretentious. But once you get over that fact, and their prices, everything else is excellent.\n\nThe waiters are all super presentable, wearing their upscale uniforms, while providing superb service. The food was simply delicious. \n\nFor appetizer I had \"Foie Gras Two Ways\" with caramelized fig and Banyuls wine, poached roulade with coffee, and almond crust. For an additional small fee, they pair it with a small glass of Chateau Petit Vedrines Sauternes (white wine).\n\nFor my entree I had Branzino Fillet Mediterranean sea bass with chorizo sausage and shrimp stuffing, smoked tiny vine tomatoes, petite zucchini, and charred lemon confit. This was very scrumptious. Considering that this is a very upscale place, just like any other upscale restaurant the portions are considerably smaller than you may be expecting.\n\nFor dessert we just ordered a cheese plate with glass of wine.\n\nDo not be mistaken, this place is very expensive, but I personally thought that it was worth every dollar, considering that beautiful view this place offers and the quality of their food. Overall, a great birthday dinner!", "author": "Blake B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-06", "description": "Excellent service; the ambience was warm and beautiful view of the skyline and river is visible from anywhere; you don't have to have a window seat.  Food was superb.  Staff was kind as I had had a slip and fall accident right before I entered the restaurant, and I felt taken care of with my guests.", "author": "Martin G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-06", "description": "This is my favorite restaurant in the world...no kidding!\nI love everything about it, from its great location on the Brooklyn waterfront, free valet parking, nice reception area with fabulous flower arrangements, and the beautiful private room on the side. The main dining area was totally and tastefully redone after Katrina, and it exudes classy touch. The views of lower Manhattan, all the way to the Statue of Liberty, and the boats traveling up and down the East River create a great scenery...and then comes the food.. Chef Steelman is in a class of his own, creating new dishes and expanding on old ones, such as foie gras...I recently celebrated a milestone Birthday there and it was pure joy! \nIt was one of many times I have eaten there and that place never lets me down. Kudos !", "author": "Dana S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-09", "description": "I am actually really impressed by this place. My husband took me here for our one year anniversary. He didn't tell me where we were going, so when I walked in I was almost taken aback by how uptight this place is. He didn't read the dress code, so he didn't wear a suit jacket, but they are happy to provide one for you. The waiters and everyone in general are super attentive and do their best to make the experience great. When I heard that it was a fixed menu for dinner (appetizer, dinner and dessert) I was expecting really small portions and thought I would leave hungry, not the case. Everything we ordered was really good and we were super stuffed. The only thing I didn't like (but he did) was the bone marrow potato that came with the strip steak, it was a little dry for my taste.\n\nIn my opinion, this is a place to come to for special occasions. It is very romantic during dinner and I would return here to celebrate another occasion, I don't think I'd come back on a regular day. For me this place is more about the experience and the view than the food itself. The view is beautiful as well as the restaurant grounds. There is a small garden with benches that is really lovely.\n\nPrice wise this place is expensive, if you're coming for dinner plan on spending over $300 (for two people). And yes, the people here can come off as snobbish and stuck up, but they are just catering to the majority of the crowd that comes here. If you don't like that kind of atmosphere, this is definitely not the place for you.", "author": "A S."}], "servesCuisine": "American (New)", "priceRange": "Above $61", "name": "The River Café", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Water St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/C_8aEbAvcCLhiqXn9QdWSw/ls.jpg", "@type": "Restaurant", "telephone": "+17185225200"}