{"aggregateRating": {"reviewCount": 1049, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-27", "description": "The River Café is a restaurant located in the Dumbo neighborhood of Brooklyn. The building was founded in 1977 by Michael O'Keefe, who also owns The Water Club in Manhattan. Past executive chefs include David Burke, Larry Forgione, and Charlie Palmer. As of 2017, chef Brad Steelman had been there for 17 years. The restaurant has been reviewed twice by the New York Times and received two stars both times It is a Michelin-starred restaurant, and this is one of the most unique experiences from all of the 200+ restaurants that I have reviewed. From price, view, interior design, service, and of course, the food, the River Cafe set a new standard that has yet been beaten.\n\nWe came in to celebrate my girlfriend who graduated top of her class in her major. She is not only intelligent in her class but also a Yelp Elite. \nThere is a strict dress code for man. You must come in with a suit ( preferably black) if you do not want to stand out. You will get turned away if you do not come in! I have warned you! Ladies, please accompany your man ( yes, this is a very traditional European restaurant) in a black, white, or red formal dress if you want to blend in with the other clients inside this restaurant. I myself know the European dining etiquette, but if you use the American dining etiquette, you may be laughed at by the French/German customers next to you. Yes, we experienced it throughout the whole 2 hours! These French customers laughed and talked about all the negative things these \"Americans\" are doing wrong in the restaurant from not wearing a tie to how they hold their forks and knives. The customers also talked about how Americans always greeted them in the most obnoxious \"Comment Allez-Vous.\" Do not take it personally; just enjoy the food and the scenery. \n\nI myself am a 100% New York-born and bread customer who grew up on pizza and hot dog. This is the first time I been to a restaurant of this class. Although I have been to the Michelin-starred Japanese restaurant Sushi Nakazawa, I do wish people do not instigate personal culture into someone else who is not of that culture, especially since this is America and Not France! \nGirlfriend got the steak tartare ( she said it was very delicious and the only place she will try raw beef of this class) while I ordered the Sea Scallops and Pork Belly. The pork belly is sauteed with Maine scallops; slow smoked in Niman Ranch with soft white polenta, fruit mostarda, and natural jus. For Main Course, I got the Niman Ranch Strip Steak, and OMG!!! This was delicious. It was marinated with red wine and mushroom. There was also a side of Duchess potato bone marrow. Once you put that in your mouth, it will instantly melt and bring you and your imaginations straight into God's kingdom. My girlfriend got the American Red Snapper.\nFor desserts, she goes the Chocolate Brooklyn Bridge( most popular from what I saw)  and I Semifreddo (delicate yogurt semifreddo, fresh pomegranate sorbet,\ntoasted pistachio and sesame halvah).\nService was good. The manager ( in black suit jacket) was a little condescending. He even messed up the wine for the Frenchmen next to us. \nThe bill came out to over $400+! Please tip generously here. There are multi-steps here, and I think even if they messed up your food, you do not tip below 20%.\n\nTip: if you are asked if you want coffee, it is NOT free. I got charged $9 for it. It is fine though. It is the experienced that counts lol. \n\n\n\nWe also got the table next to the window ( well one table away). There were a lot of sugar babies and daddies. I am certain we were the youngest couples inside this restaurant. I live on Roosevelt Island, and I will definitely be looking forward to coming back here again. \n This I will state as a native New Yorker thisis the most beautiful restaurant in New York and perhaps  in the entire continental United States!", "author": "Jim W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-05-27", "description": "Never thought I'd be writing a statement this lofty or ridiculous, but here we are: Never in all my years of going to nice restaurants, Michelin starred or otherwise, have I felt so disrespected. \n\nLet's get the good part over with first, since the list is short; the foie gras duet was excellent, and enough for two. The view, if you are lucky enough to get window seats, is also excellent. \n\nAll the other dishes were sloppily executed; the duck was overcooked, the mushroom wellington underseasoned, and the dessert chestnut soufflé -- on boy, texture of vomit. I could barely eat two spoonfuls. If you are going to put a soufflé on your menu, Get. It. Right. \n\nThe most infuriating part of the whole experience is how quickly the waitstaff profiles guests. From the moment we stepped into the restaurant -- to celebrate our anniversary, no less -- we were treated as second class citizens because of how we looked; and don't get me wrong, we were dressed appropriately for the restaurant. The hostess didn't even bother with niceties (such as a simple smile) and had us wait unnecessarily at the bar for ~15 minutes even though we were on time for our reservation; we were seated at the back of the restaurant and if you looked around, everyone else in that section were Asian -- coincidence? The universe is rarely so lazy. Service was slow and haphazard, and it showed right down to the execution of the food.\n\nBut the crowning moment of all of this was when our server brought over our bill, looked at it, then sheepishly told us that she will take off the gratuity line they had sneakily included because they thought we were tourists. EXCUSE ME?! As a $$$$ establishment, you either go TIP FREE or you treat all your guests the same and allow them to make their own decisions; you DO NOT arbitrarily decide who looks like a tourist and who does not. \n\nFor shame, River Café.", "author": "Sherry Z."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-05-26", "description": "I couldn't ask for a more beautiful view!!!\n\nThe ambiance, decor and view is insane and overlooking the Brooklyn bridge. This place is $$$$ but definitely worth the experience. They first took our drink orders and then we ordered food. What we didn't know is that we 1) each get our own appetizers 2) appetizer, entree and dessert was a set price (definitely fine just weren't aware pre visit and is helpful for others to know). First a women with a bread platter came by and asked which bread we would like. Then our appetizers came and I had the steak tartare which was really good and had a pleasant presentation. For my entree, I ordered the chicken which was good - but not great so that is the real reason I am giving this place a four. Lastly, I ordered the chocolate moose cake that was flavorful as well.\n\nThere was a pianist that added to the already perfect ambiance. I will be back, even if it it just for a drink at the cute little bar!\n\nExcellent service too, but expected as we are spending quite a bit.", "author": "Andrea O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-17", "description": "This experience and food was on another level. This was actually the first Michelin star restaurant I've ever tried and I can see why it has one. I have tried almost every top restaurant in Atlanta (no Michelin stars in that city) and several New York restaurants. But this food just blew away everything else. New York is truly a foodie's dream. Everything in this city is delicious, and a Michelin restaurant in NYC has the highest expectations. \n\nThere were a few things that made this experience maybe more of a 4.25 or 4.5, but I have rounded up. What makes this restaurant is the incredible view, especially at night. We were seated not by the window, but next to a table by the window. Luckily, between guests at that table, we got some great shots of the incredible city and Brooklyn Bridge view. \n\nFOOD:\nThere is a 3-course fixed price dinner (I believe there is a 6-course but this was already a lot of food!). You pick one from each category of appetizer, entree, and dessert. It also starts with an amuse bouche. It costs about $145 per person, so for 2 people, it was about $400 in total after tip, tax, and drinks. Insanely pricey but you are paying for the view/experience as well.\n\n- Appetizer of Wagyu Steak Tartare: This was INCREDIBLE. The best part of dinner. I have always wanted to try steak tartare, but I have been scared. Raw beef is kind of intimidating. But what better place to try it than at a restaurant like this? It's hand-cut Kobe style beef with quail egg, cognac gelee, traditional garnish, and toast points. There's also the quail egg shell with salt in it to sprinkle. The server asks if you want them to mix it for you or if you want to do it yourself. It tasted so rich and buttery and almost like it had mayo in it, but it doesn't. The flavor of the steak is incredible and the acidity and saltiness of the toppings mix in so well with it. Bf got the scallop and pork belly appetizer and said it was good.\n\n-Entree: I got the American Red Snapper. It came with a delicious brown butter lobster sauce that they poured on for me. There were also vegetables that were amazing with the sauce. The fish itself was well-seasoned with crispy skin. I don't like fish skin, but this tasted incredible and I ate every last bit of this dish. There was no element on this dish that was an afterthought. Everything was delicious on its own. Bf got the Niman Ranch Strip Steak medium-well, which I'm pretty sure you are not supposed to do at a high-end restaurant haha. So it was not super juicy but it was very flavorful. It came with the potato in the bone marrow and wow, that was unreal. Definitely the winner of the dish. \n\n-Dessert: Obviously I had to get the Brooklyn Bridge chocolate dessert. It was very picture-worthy. I also love the little complimentary treats with dessert. They were all perfect. We were also asked if we wanted coffee and we assumed it was complimentary, but it was $7 for a small cup. That's very overpriced, but hey, if you're already spending $400, $7 is almost nothing added on top of it. \n\nENVIRONMENT:\nThe walkway to this restaurant is stunning. You walk in and they take your coat. I brought mine in with me, but keep in mind that you cannot hang it on the back of your seat. Definitely dress up for this place. Everyone was super formal and I felt a bit out of place. Suit jackets for the men and at least cocktail evening wear for the ladies. I wore a long sleeve dark-burgundy fitted dress with heeled ankle boots and I definitely felt like I should have worn a nicer-material dress and some heels. I was out all day though and we came straight here, so it was the best I could do in a pinch. \n\n-There was an intimidating man who took our orders and I felt like he may have looked down on us for being so young. However, the rest of the servers were so amazing and accommodating. They brought me a small chair to keep my purse and a bag of shoes on. They also sweep away the crumbs on the table. Water was filled often. I really felt like the service was top notch.\n\n-However, it was a slightly snobby atmosphere. I felt really embarrassed that I didn't have the best etiquette. Also the table next to us had two men who talked trash about everyone else in the restaurant. They were looking down on those who didn't wear a tie with their suit jacket and commenting on other people's etiquette/behavior and outfits. They definitely spoke like they come from a lot of money. Keep in mind that the tables are close together so you can likely hear conversations from other tables. I didn't mind the atmosphere as much later in, because I just focused on my food and experience! \n\n-OVERALL, great experience, food, and view. Just don't let other people there taint your experience. Highly recommend if you have the $ to drop for this. It was very memorable.", "author": "Stacey K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-03-24", "description": "This restaurant has been on my bucket list for a while, and I'm so glad to have experienced it. Brought my family while they were visiting, and we were all so impressed, both by the restaurant and the gorgeous backdrop of the Manhattan skyline that you can see from every seat in the dining room.\n\nThe menu is all prix fixe, and we opted for the 3-course. Loved every single dish, and I don't think you can go wrong.\n\nThe vibe is pretty quiet/reserved, so just keep that in mind. Dress code is elegant, and you will stick out if you are under-dressed!", "author": "Kathy Y."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-05-20", "description": "* Great view of the river, but the view was a little ruined by all the construction that's going on on the other side of the river\n* Elegant ambience\n* Great wait staff\n* Food was to kill for!! Everything was delicious, especially the seafood\n* Although the service and the food was definitely worth the price, it's still way too expensive for me. I don't think I would come again until a VERY VERY SPECIAL occasion comes up", "author": "Ying Yi Z."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-05-04", "description": "Came here for a special birthday. Food and service were close to immaculate. The view of the river, bridge, and Manhattan would've been nicer by the window. However we were seated against the wall and the two of us sat side by side while people walked up and down the aisle in front of our table.\n\nThey only have either 3- or 6-course prix fixe menus. I wish a la carte options were available since I'm not thrilled about dessert in general. For starters we had wild shrimp and tuna, both of which were generous portioned and fresh. Tuna could've been less salty, but still very well prepared. I had branzino for main; the flesh was very tender underneath a crispy crust that provided a nice complement to round out the crust. Warm avocado and cucumber salad was a nice touch.\n\nSince my boyfriend ordered the cheese plate instead of a dessert for the \"dessert\" course and I'd told the restaurant it was his birthday, they ended up bringing an extra plate of sweets with a lit candle.\n\nThe place is quaint and beautifully decorated, with lush flowers at the reception and on every table. Faint live piano was played. The courtyard outside leading to the entrance also has a nice small garden, and there are lights lining up the trees and plants. It would be even nicer if the tables weren't so close to each other though.", "author": "Ningxi X."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-13", "description": "I came here with my family for Sunday birthday brunch. As we were following the signs to River Cafe, I felt like we were walking into a secret garden with the restaurant tucked inside.\n\nThe service was exquisite from the moment we stepped in. We had reservations at 2pm and were promptly seated next to the windows with a beautiful view of the Manhattan skyline. For brunch, only served on Sundays, they have a $67 prix fixe menu which included amuse, appetizer, entree, and small complimentary desserts. Unlike many prix fixe menus, there is a wide variety of options to pick from that caters to any particular cravings you may have. There is a separate dessert menu after. We picked the Chocolate Brooklyn Bridge which was beautifully crafted chocolate marquise dessert. We were all full and satisfied after the meal. While the prices may seem steep, it is very well worth it for any special occasion. The food is delicious, the service was impeccable, and the atmosphere was one of a kind. They also have a live piano music playing in the background!\n\nThe River Cafe is easily the perfect spot to celebrate any special occasion or to simply have a romantic meal. Would love to return and try the dinner menu.", "author": "Teena L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-03-24", "description": "My expectations were rather high because of the superb reviews I'd read about prior to making a reservation. It was my parents' anniversary so we decided to come here for the special occasion. The exterior and the pathway leading up to the restaurant was gorgeous. My dad forgot to wear a jacket, so they had to give him one to wear throughout the meal. After taking our coats (which you have to check because they do not allow coats/jackets to be hung on the backs of the chairs), we were escorted down a narrow hallway to the dining room. The views were beautiful, especially at night. \n\nHowever, the space was incredibly cramped and I was not a fan of the tables and chairs. They looked like patio furniture, which I was not expecting especially not from an upscale dining establishment. The food was good, but nothing memorable, to be honest. The dessert was really good. They even brought out a special dessert for my parents, with a happy anniversary message scrawled out on the plates. That was a really sweet touch. Overall, it was a good experience with great service but I don't think it was worth a repeat visit.", "author": "Ada C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-17", "description": "Having lived in New York for over 3 decades, I used to carry around my Zagat (before there was Yelp) around New York looking for the best restaurants to dine at. The River Cafe was always on my list but I never got around to it. Life just got busy after moving to Jersey. As my husband and I celebrate our 25th, we thought it be wonderful to finally have the chance to dine at one of the most iconic and romantic restaurants in NYC with spectacular views overlooking the Brooklyn Bridge.\n\nWe made reservations for 5:30pm. It's best to arrive a little early, you can either sit at the bar or take a few photos outside the beautiful garden. Valet is complementary when dining here. \n\nThe restaurant was adorned with stunning holiday decor. Some tables had bouquets of beautiful roses. The restaurant is dimmed so picture taking is a bit tricky. A tiny cushioned ottoman is placed next to the table so women can place their purses.\n\nWe ordered from the prix-fixed dinner menu. Here is what we decided on:\n\nAppetizers:\n- Complimentary Amuse Bouche\n- Sea Scallop \u0026 Pork Belly\n- Wagyu Steak Tartare w/Quail Egg\n\nEntrees:\n- Lobster w/Corn Tamale\n- Spice Crusted Duck Breast\n\nDesserts:\n- Chocolate Brooklyn Bridge\n- Semifreddo\n- Complimentary array of chocolates \u0026 macaron\n\nWe ordered a Tom Collins and a White Russian along with a bottle of sparkling water. Never once did we had to refill our water glasses, it was like there was someone standing behind me the whole time and they knew when to. The drinks were delicious and PERFECT!\n\nIt was such a delightful surprise to be served a small plate of Amuse Bouche before the apps came. We loved it and it made us excited for what was to come. When my husband's Wagyu Steak Tartare came, the server mixed all the ingredients on the plate together along with a quail egg. A side plate of toast points is served along with the tartare. It was absolutely delicious. Don't be afraid to get this dish. At the end of our meal, they presented our desserts with a Happy Anniversary sign on a piece of chocolate. Dare I say this? The dessert was my favorite part of the meal and I'm not even a huge dessert person. The Semifreddo (I'm still dreaming about it) was incredible. I didn't even want to give my husband a taste because that would mean less for me. The Semifreddo is a delicate yogurt served along with fresh pomegranate sorbet with roasted pistachio and sesame halvah. Heaven!!\n\nThis is a Michelin starred restaurant that has won numerous awards. The price you pay matches the level of meticulous and impeccable service you will receive here. The staff here is at the top of their game, probably the best we've ever experienced.\n\nThank you River Cafe for making our 25th memorable.", "author": "Pamela L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-03-25", "description": "This restaurant has been on my bucket list for a while and I made reservations atleast 2 months in advance for my husband's birthday- especially because I wanted the window table for the celebration.\nBut even 2 months is not enough to get a guaranteed window table- which is clearly the reason for us to go ton American cuisine restaurant. \nAnyhow, the restaurant is as classic as it can get with uniformed servers, sommeliers and maitre ds. This is a 3 course type restaurant and we got the amuse bouche followed by our menu- we got the chicken and fish which were prepared in a classical way. All good along with the Brooklyn bridge chocolate dessert. \nGreat place for celebrations and taking photos from the event room if its not being used.", "author": "Garima K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-05-04", "description": "WHAT A SCAM!   Took my family to this place for a birthday celebration a year ago.  It was a real hustle to book this place.  I called about a month in advance, but because I was looking to reserve party of 5, they had to put us on a waiting list. Apparently manager had to approve it.  Once again I was planning to take my family for mother's day brunch.  Because our family doesn't fit their standard once again we had to go on a waiting list.  I was assured that they had plenty of space but the manager needed to approve it.  Earlier today I called to check in, a very busy lady told me that they have no space and manager still didn't approve it.  When I questioned the contradicting statement the lady got pretty angry with me.  \n\nI would probably let this one go, but i knew something was fishy.  I asked a friend who is a head concierge for a one of the top hotels in NYC to call and get a reservation for 5.  Apparently when he called, manager approval was not needed and they had space available.  It's all about who you know ;-).  I guess I won't be going there.", "author": "Grzegorz H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-13", "description": "My mother-in-law's birthday lunch was a wonderful experience from beginning to end here. \n\nI often find the service in fine dining restaurants to be either unctuous or condescending. From the coat check girl to the maître d' to our waitress-our service could not have been better. \n\nUpon arriving at the River Café one is met with a lovely garden space. One walks through a small and rather dark entry only to be dazzled as you walk into the restaurant and the views of the East River and Manhattan. \n\nOur party of four was seated by the windows. The lighting was very dramatic as the day changed from cloudy to sunny. The view simply cannot be beat. Starting with the amuse bouche right down through their iconic Brooklyn Bridge dessert, our food was of exceptional quality.\n\nFor appetizers our party especially enjoyed the crab-cakes and the steak tartare. Entree favorites were the branzino and the organic chicken. \n\nThe food and wine selections were uniformly delicious throughout the meal. It is true that the restaurant is very expensive, but top quality items and service are expensive to provide.\n\nThere simply isn't a better special occasion venue. Thank you River Cafe for helping to make the day so very special for her. Can't wait to go back!", "author": "Briana W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-05-26", "description": "The service was great and the atmosphere was amazing. I thought the food was average at best for the price. I had the strip steak and it was tough. Overall, not worth the price.", "author": "David K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-25", "description": "Very Romantic \u0026 Stunning view!\n\nWe  discovered this place years back, when John \u0026 Yoko frequented this  restaurant. We recently returned for our anniversary- and while it is expensive- it is everything I remember- the excellent service, the dining experience is above par with other NYC spots. The view speaks for itself and our dinner and wine exceeded our expectations. Complimentary dessert was chocolate shape of the Brooklyn Bridge.\n\nReservations \u0026 jackets for men required. Arrive early to enjoy it all and take photos. Big time favorite of mine- holds great memories.", "author": "Bella Donna M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-04-27", "description": "I've been wanting to come here for years and I was so happy when my best friend finally took me. From the moment you're walking in, you feel like you're in a movie, this place is so stunning with the exterior decor, view and food. I would like to come back during the day but I would just stop into the bar; the menu is not a la carte . So although I wasn't hungry and asked to share with a friend we all ended getting dish For $175 and having to take the extra food home, I was not happy with that but I have to the food is good and it's a place that should be experienced at least once", "author": "Angelica B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-19", "description": "We went here to get to know my buddies bride to be. \nFirst impression was A+. \nFirst one thinks you are at the wrong place but GPS kept saying, we were there.\nSomeone else commented the same as it's a great presentation for the front of the restaurant. \nVery classy when one walks into the restaurant. \nSanthi our server was excellent and the food was perfect of everything we ordered. \nI asked for a decorative dessert and the restaurant gave a nice card congratulating the couple on their wedding. \nI definitely recommend for that perfect occasion when you want to impress.", "author": "Chris L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-23", "description": "Dinner with a view and both are magnificent!  My wife and I enjoyed a spectacular evening dinner experience at the renowned River Cafe. We did the Chef's Tasting Menu and the Wine Pairings (highly recommend) and enjoyed every minute of our two-hour stay.  The iconic views of the Brooklynn Bridge, Lower Manhattan, and even the Empire State Building were visible from our window seating. Truly a Michelin Star experience, they have earned the rating.", "author": "Tom D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-24", "description": "The view...The view...The view!  Dining in this million dollar view restaurant was a great experience. This is a very small and crowded restaurant, their service was excellent. We chose their tasting course, everything was perfectly cooked but only lacking some excitment. \nFor the record, we didn't get a table by the window either , but I don't blame them keep their best seats to their royal customers. After all, i'm thankful to enjoyed a wonderful night there.", "author": "Michelle G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-19", "description": "I came here for one of my birthday meals while my family was in town and I was looking for a place that would have nice views for them.  We also generally tend to stay in manhattan so I thought it would be nice to take them to Brooklyn, though this is obviously just over the bridge.\n\nSince I didn't pay for this meal, the cost factor didn't really impact me, but I will say that I don't think this is the best value prix fixe menu option out there.  It's quite pricey for only 3 dishes, I think it ends up being about $46 per dish and one of those is dessert. \n\nThat aside, I was also annoyed that you have to be a regular to get a table by the window, though the restaurant isn't that big so you can see out the windows from probably the entire reastuarant.  Our party of 5 apparently couldn't fit by the window anyways, but it's still annoying.  I probably wouldn't come back here to eat on my own so looks like I won't be sitting by the window anytime soon. \n\nThose things aside, the service was very good and attentive throughout the evening and the food was very tasty, with some highlights and some items I thought could be better. \n\nThe foie gras was good, but I much preferred the mousse in the jar to the terrine which had a weird film like outer layer that I did not care for.  \n\nThe lobster was tasty but I did not like the flavor profile of the corn tamale, I just don't think it goes that well with lobster and it lowered the dish in my book.\n\nFor dessert since it was my birthday I upgraded to the tawny tasting since I love tawny and it came with 3 different bites to complement each wine.\n\nMy fiancé got the classic Brooklyn bridge dessert, which was adorable and he enjoyed it especially since it was gluten free!\n\nLike I said, since I wasn't paying it's probably 4-4.5 stars for me, but if I were paying I just don't think the value is there compared to other restaurants in this price point.  We'll see if I come back in the future.", "author": "Elyka A."}], "servesCuisine": "American (New)", "priceRange": "Above $61", "name": "The River Café", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Water St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/C_8aEbAvcCLhiqXn9QdWSw/ls.jpg", "@type": "Restaurant", "telephone": "+17185225200"}