{"aggregateRating": {"reviewCount": 1049, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-06-28", "description": "We went for restaurant week lunch and the food was amazing. The view is, of course, awesome. I had my back to it but I have a great view from my apartment so I was willing to sacrifice that. This was a rather random gathering of people but we are all in the same profession so conversation was lively and fun. The food portions were on the small side but for the price we did just fine. 3/4 of the table had the wild boar ravioli which was delicious and one had the scallops which were also perfectly cooked and creamy in the center. All the courses were wonderful, but petite. There was plenty of bread though and a couple of gin and tonics to set sail. Not sure this would be my first choice because of quantity but if you want a place to convey a feeling or mood for something special happening in your life, this is the spot. And wear a jacket for god's sake. Yes, even if it's lunch.", "author": "carl g."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2007-08-28", "description": "I was nervous before eating here because of all the hype.  Thankfully, in my view, it was all worth it.  My husband and I enjoyed a glorious anniversary dinner here.  The banquette tables are set up so that we were able to sit next to each other and enjoy the glorious view.  All of the food was delicious, from the amuse bouche to the desserts.  We had a lovely bottle of wine as well as some history of the vineyard from the sommelier.  It ain't cheap, but it's great for a special occasion.  Overall, it was a fabulous way to spend our first anniversary.  We'll definitely go back.", "author": "Jocelyn B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-27", "description": "My boyfriend took me here for an anniversary dinner and the ambiance was absolutely stunning. The interior is very elegant and outside you get the most amazing view of the Brooklyn Bridge and the Manhattan Skyline. The food wasn't as amazing and the menu is quite pricey, but the service and ambiance make it worth the buck--a great place for special occasions.", "author": "Ingrid F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-02", "description": "We were here recently on a special occasion.  It was an unusually early  night for us - we had a 5:30 reservation - but we were so happy we arrived early enough to get one of the window tables.  The view is superb.  The food and service lived up to the wonderful view as well - we had the branzino with a shrimp and chorizo crust that was delicious.  Our companions had lamb that looked and smelled divine.  The waitstaff was attentive but not all over us every minute.  Desserts were equally wonderful - we had the pretty bridge that others have posted in photos, and also the almond and apple dessert.  All great.  The sommelier was not as knowlegable as the winelist would indicate.  They have a breathtaking selection of extremely pricey wines from the Domaine de la Romanee Conti - and I guess if you are not willing to spend thousands (yes, these wines range from $1,400 to $8,000) they recommend a pretty ordinary bottle that only costs hundreds.  But we would still go back and still recommend this lovely place.", "author": "Deb R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-04-09", "description": "My dinner last night was amazing ,the ambience was simply  breathtaking and i have seen these views very many times from various dinner cruises.The food , the service, from the second you walk in you know you are in for a real treat. Upon walking in you see a luscious wide array of flowers,then walking in you meet the host which took us to our seat as you walk over the bridge onto the boat and see the seating area again you know this won't be a normal dinner.Our view was amazing we were right in the window, the food was so fresh the lobster had the taste of fresh salt water, as it should.The raspberry coulis on the bottom of the nice crackly brûlée was an amazing touch that I will be now adding to my brûlées. Then their was a chocolate cake with a chocolate bridge again details details, they nailed every last one.Everything from even giving Easter chocolates were really thought out I really could not of asked of somewhere to better spend my birthday .", "author": "Vanessa S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-01-13", "description": "I walked in with my bf 9PM today (1/13/2012) and the front girl looked up and down us and said this is not place for us. I wore a jean cause it was casual friday for our company. I think she just figured that we can't afford food from there. But I'm sure I make more money than she. She were pretty nasty and it was the first time I got race discrimination in public. (FYI I'm an Asian.) So embarassed. If you are an Asian or if you think they 'MIGHT' discriminate against the race I highly recommend not to go there. They totally ruined our friday date.", "author": "Kate C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-11-12", "description": "This place has one of the best views you will ever see.  Its right on the river and you get the full up close view of downtown Manhattan.  The food is also good but pretty traditional and nothing out of the ordinary.  A great place for a special occasion - very romantic.", "author": "Anna K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-08-28", "description": "TOTALLY WORTH THE PRICE.\nI went there for a birthday at night and the experience was genuinely amazing. The location was scenic: lit up Manhattan under the Brooklyn Bridge on a barge. Sparkling East River with the New York lights. Of course it sounds cheesy, but this is it.\nI got the rabbit ravioli (which I think they don't have anymore on the menu) as an appetizer and it was delicious. For my entree I had the duck with a side of duck confit. It was a knock out. The flavors blended excellently. \nOf course I had the Brooklyn Bridge cake as a dessert. I was as good as the meal, meaning amazing.\nOverall, expensive, but spectacular.", "author": "Jacob R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-01-20", "description": "True, it's expensive but it's worth every penny in my opinion.  Nothing beats the manhattan skyline, a musician playing the piano, a candle-lit dinner with the girl of your dreams, right?", "author": "David C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2007-04-08", "description": "Tremendous place and a New York institution. The view is fantastic, the atmosphere and service are impeccable, and the food is stellar. Excellent seafood with waiters that know how to give legitimate and objective opinions and a wine pairing or two. The brunch is great - perfect for a (pre-planned and reservations-secured) weekend meal, particularly before a museum or theatre visit perhaps. The dinner is equally impressive, arguably more so, and the view of the water and Manhattan is  really breathtaking. A lot of fun and absolutely worth shelling out for if you want to really enjoy an inimitable piece of the NYC restaurant scene.", "author": "Ron S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-06-19", "description": "Not sure why this place was so highly reviewed by others in a town full of excellent restaurants.  Yes the view, decoration and food presentation was pretty. But the menu was boring and food flavorless. A complete lack of mouthfeel - nothing piquant, nothing velvety, nothing succulent.  Service was perfunctory but sometimes out of sequence - amuse-bouche served before taking cocktail order.", "author": "Michael C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-11-07", "description": "I've been by this restaurant several times, but never realized it was actually on the water until my husband and I dined there for our anniversary (we felt the building move!).  You absolutely can't beat the view of Manhattan.  The restaurant is small and cozy.  Service was excellent.  The menu is set at $98 and that includes appetizer and desert.  I had the lobster tails for app, halibut for my meal, and finished with the chocolate brooklyn bridge.  A very romantic spot for celebrations.", "author": "jenny v."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2010-06-08", "description": "The River Cafe was truly a disappointment. My husband and I went here for our anniversary and the service was abyssmal. The view was not that great, you can get the same view for free 20 feet away from the cafe. Our waiter took our orders and never came back to check on us or anything until it was time to take our dessert order. That is the mark of bad service.\nWe had also asked to sit near the window because it was our anniversary. They said that we would need to ask inside the main dining room, (they won't take reservations for this), but when we asked, they said they were saving the tables for others. Doesn't really add up to what they said about it being first come first serve. Although the food was really good, I would never go back to pay that much money for bad service.  There are far better restaurants in NYC worth spending your money at.", "author": "C R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-06-12", "description": "We did not have an enjoyable meal.  We came for lunch and the restaurant was not busy.  We asked to be seated by the window,but we were told that we were not dressed properly to sit by the window.  The table we wanted remained empty during the entire time we were there.  We notice that a nice Indian couple, very well dresses was put further back than we were.  As was a table of four young men, flamboyant but nicely dressed.  Who got the window seats?  Old white people.  They were no better dressed than we were.  This place has serious issues.  Stay away unless you are old, white and nattily dressed or if you don't care if they give you a seat at the back of the boat.  Ugh!", "author": "Arthur B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2008-07-25", "description": "There's no denying that this is a fabulous location and an essential destination for New Yorkers and tourists alike. The food, decor and  ambiance are all spectacular. But the service on the outdoor terrace flat out sucks. \n\nI went in the early evening with a friend from out of town and neither of us can remember when we've had such lousy service. We were seated quickly and offered drinks. We ordered a bottle of wine and then proceeded to sit there, ignored, for 15 to 20 minutes while we watched other parties arrive, place orders, and receive both food and drinks. About four different waiters approached the table asking if we'd like to order, we told them that we already had and that we were waiting, and they would run off, never to return--not even with water. And it was really, really hot out that day. \n\nFinally the wine came, then the food; by this time our tiny water glasses were  empty but no refill arrived so we flagged another waiter down, and had to flag her down again as we sat, long finished with our dessert, waiting for the check. \n\nThe wait staff seemed to avoid us so studiously that my friend and I wondered if we'd each grown two heads while sitting there, or if our hair had suddenly sprouted snakes. This was a terrible disappointment and seriously below the standard of service you'd find even at a TGI Friday's.", "author": "Bonnie V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-29", "description": "This is an upscale restaurant with distinctly delicious food (all three courses in my case), fabulous scenery and expensive prices. In addition, you can walk on the bank of the East river after your meal. \nAdmittedly I would go back to this place despite the unusual pretentiousness of some of their staff (and one less star only for that).", "author": "Dan E."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-04-21", "description": "food - 2 stars, considering the price. we had the lobster \u0026 lamb. for $400 for 2 (with a bottle of wine \u0026 tip) you expect more than \"just ok\" food.\n\nambiance - 3 stars. they sure do pack a lot of people in there. and it's a bit on the loud side. you're elbow to elbow with fellow patrons everywhere. the bar area is a tight squeeze, and the tables too. come on river cafe, don't overbook, give us a little space!\n\nrestaurant service: 4 stars. very attentive, yet lacking a certain flair you'd expect at this price level.\n\nbar service: 5 stars. the bartenders are pros, no doubt about that.\n\nview: 5 stars. amazing water, bridge, and city views. what you pay for when you come here.\n\nverdict: great place for a drink. in the future i'll stop by for a drink at the bar, take in the view, then  go somewhere else for dinner.", "author": "George S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-02-10", "description": "My first experience here is still one of my most memorable dining experiences.  River Café lived up to all the hype and more.\n\nI had made a 9pm reservation on a Friday night for dinner with my girlfriend and arrived promptly.  I had a drink at the bar before I was seated about 10 minutes later.  The interior decor was that of which you would find on a cruise ship.  The accompanying view of lower Manhattan on the water also gave you the illusion that you were in fact dining on a cruise ship.  \n\nThe waitstaff was extremely attentive and friendly.   We were initially seated at small table for two in the middle of the dining area.  After placing our appetizer order, a larger table against the wall opened up.  I politely asked if we could move there and our waiter happily moved us over without any hesitation.\n\nOur appetizers arrived and were phenomenal.  I had ordered the Yellowfin Tuna wrapped in thick Italian bacon, stuffed with foie gras and topped with black truffle vinaigrette.  The word \"wow\" doesn't even begin to describe how amazing it tasted.  About 10 minutes after finishing our apps, the waiter brought two very small bowls of gazpacho with crostini, compliments of the chef.  Nice touch.\n\nFor the entree, I ordered the 16oz NY cut Sirloin which was a great steak.  You can probably have better at a great steakhouse, but nevertheless, this was still a good choice.  It had a nice touch of blue cheese fondue spread on top and a red wine mushroom glaze.  The sweet potato gratin side was tasty as well.\n\nDessert was the only part that was a slight letdown, but turned out to be great thanks to the waiters.  We ordered the  Chocolate Marquise Brooklyn Bridge and the Chocolate Sticky Toffee Cake.  I'm not gonna lie, I thought both were rather bland.  They weren't bad, but I was expecting something more for the price.  We didn't finish either one, but sat at our table enjoying our drinks.  I was about to ask for the check, when two waiters came over and asked us to get up with our drinks and follow them.  We were both confused, but were pleasantly surprised when they led us to a new table right by the window overlooking the lower Manhattan skyline.  They told us we could finish out drinks here and no need to rush.  I thought that was very nice of them and unexpected.  Granted, the restaurant was now at 50% capacity, but still a great touch.  To top it all off, they returned 5 minutes later with a 3 tier dessert tray filled with handmade chocolates, compliments of the chef.  I can still taste the sea salt caramel dark chocolate truffle.\n\nAmazing dining experience all around.  It's not cheap, but it is highly recommended- especially for special occasions.", "author": "James V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-09-08", "description": "The River Cafe does not need another vote but I give it mine anyway.  It seems that a number of reviewers mention the price but when you think about the elegance, the great food, the world class view it is like being in a movie it is really not all that expensive. Stick to the Pre-Fixe , avoid the liquor and take into account the free valet parking it is really not that expensive. I have been to the River Cafe a number of times [i am bragging] and have loved every visit.", "author": "jim r."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-06-01", "description": "a really good friend treated my sister \u0026 i to a wonderful evening here.  Upon entering this little garden of flowers oasis, we were instantly happy!  The smell of fresh flowers was intoxicating.  We had the price fixed menu which is totally worth it... the steak was the winner dish and the soft shell crab special app the winner.  The steak came with a potato side that looked like escargot, we actually had 5 of them... they did not charge for that :)  The waitress (short dark, latin??)  was super nice and took pics for us outside.  If youve got the HUGE wallet full of MOOLAH, this is the place to go, VERY expensive, but worth every penny. That is a nice change from being expensive and NOT worth it! i posted some pics of the steak etc..  GORGEOUS view... like no other!", "author": "Ali G."}], "servesCuisine": "American (New)", "priceRange": "Above $61", "name": "The River Café", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Water St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/C_8aEbAvcCLhiqXn9QdWSw/ls.jpg", "@type": "Restaurant", "telephone": "+17185225200"}