{"aggregateRating": {"reviewCount": 1049, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-10-23", "description": "Overpriced. Allows women in jeans but when a man tries to get a table or a drink at the bar, they tell him he needs a jacket...when asked if they have one he can borrow, they say no, yet the next guy who arrives with a woman in jeans, they let him borrow a jacket! I regret making a reservation for my husbands's Birthday, dressing up, and paying $400 for a fixed menu for 2.", "author": "Colette E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-27", "description": "This place breaks the bank, but it's absolutely gorgeous and worth it. I took my boyfriend here for his birthday, we started off with drinks at the bar while waiting for our table. It's very intimate, and tables are a little closer than I prefer, but it's a small place so I understand. The food was great; taste, and plating were just phenomenal. My boyfriend was still hungry, but I think that's just because we are used to eating monster portions, not fancy ones. I'd definitely go again, but only on special occasions.", "author": "Sabrina L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-05", "description": "Steak tartare was simply the best I've ever had.\nI had the lobster for mains and loved every bite of it.\nMy wife is a vegetarian and she was very happy with her choices. Service was excellent. Views are breath taking.\nI've heard great things about River Cafe over the years and it lived up to my very high expectations.", "author": "Damian O."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-09-02", "description": "I will start off saying this place is definitely a bit of a tourist trap and very expensive. You will spend at least 300 dollars for a couple and thats not an option because it price fix. Tourist trap and price aside, you must experience this place at least once. Location, location, location is really what your paying for. Right on the east river with views of Manhattan. The food was good but not amazing, and you must have the chocolate bridge desert. Glad I went to try it once.", "author": "K M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-10", "description": "I enjoyed the experience at The River Café, but I would not return. Two people ordering the 6 course tasting menu with a cheap bottle of wine and two coffees gave us a total check + tip of $450. \nThe service was excellent. The food was excellent. The view was superb. \nHowever, the atmosphere itself was rather lackluster. If I'm paying over $200 a person, I would expect that the chairs wouldn't look and feel like my grandmother's wicker furniture on her front porch. \nIf you have money to spend, go here. But if you're looking for something special as a once a year type outing, I would go somewhere else and have the elegant decor and atmosphere to match the price.", "author": "Chandra H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-14", "description": "Good place for dinner. Very classic. A lot of old people. The view is fantastic right next to the Brooklyn bridge. Tried the course, A lot of food", "author": "Joseph W."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-03-10", "description": "The view is what makes this place but then again you can just grab an ice cream nearby and sit on a bench or better yet go to the famous pizzeria and take a stroll afterwards. That way you won't feel rushed. The food was actually tasty but considering we were on a mission to sample New York's finest, the service at the river cafe fell very short compared to everywhere else we have been to. \n\nThe night started with more stars and quickly enough deteriorated when the host rushed to take the orders, I asked for an extra minute to decide on the entree, was reluctant to leave the table and pointed out that the kitchen was closing. At that point a suggestion could have come handier.\n\nThe live music stopped as the group at one of the few tables left. The staff went into cleaning mode all the while chatting amongst themselves. The check appeared before we had a moment to sip our tea, ironically it was left on the table with the mandatory 'take your time' but they wanted to pick it up before we finished signing it. \n\nWhen you have the rainbow room experience the day before, I felt cheated out of a possibly great dinner. \n\nI guess the main point is Don't take late reservations if you can't follow through...", "author": "Silva S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-29", "description": "We got married here.  Staff was amazing, view was unbeatable, and food was the best wedding food that I have had (unlike other brides, I made sure I ate the most expensive dinner in my life).  Our guests all loved the place.  It will make you and your guest feel very special...I heard it is a popular proposal place, so ladies, if your guy ask you to meet him there for dinner: do your manicure and wear your waterproof mascara!  Just saying!", "author": "Juan J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-20", "description": "I've been wanting to try out The River Cafe, a 1-Michelin-starred restaurant, for quite some time, and on our recent NYC trip, we were able to try them out for brunch!  This Cafe has been around since '77, and is attributed in redeveloping the Brooklyn waterfront.  Hurricane Sandy flooded this restaurant with 4 feet of water, so after 15 months of renovation, it finally re-opened in early February of '14.  For Brunch, they only offer a pre-fixe menu, in which items like Chilled East and West Coast Oysters, Caviar Service, Wagyu Steak Tartare, Duck Breast, and Waffle Eggs Benedict are offered.  There were also some chef's compliments, like the egg filled with banana flan with granola and fruits (SO GOOD) and a cranberry loaf with orange butter (yum!).  For appetizers, I had the Crisp Duck Egg (creamy spinach, duck foie gras sauce, and Sauternes pickled Spring onion - this was such a cute dish, where the duck egg was lightly battered and fried to a slight crisp, but the inside was still soft and runny - it wasn't salty at all, and it was a nice light dish, considering it's a duck egg!), and my husband had the Pear Salad (warm caramelized pear, frisee, apple cider dressing, goat cheese fondue, bacon, and toasted walnut; this salad was absolutely delicious, as it was light, but creamy, refreshing from the apple cider dresing, and the goat cheese fondue and the salty bacon chunks added a nice element to it!). We also shared the Hudson Valley Foie Gras Two Ways (classic pressed terrine and foie gras mousse, fresh rhubarb and warm griddled brioche slices on the side - this was literally one of the best terrine I've had - decadent and it had a lovely flavor; I just wished there was a little bit more of that fresh rhubarb!).  For our entrees, I had the Maine Lobster (poached fresh lobster, celery root puree, sweet and sour butternut squash, and brussel sprout leaves - a whole lobster, de-shelled, perfectly cooked, but a little too sweet with the butternut squash and the celery root puree), and the hubsters had the Golden Pancakes (buttermilk pancakes, 24-carat gold dusted milk chocolate, caramelized hazelnuts, smokey bacon (on the side), with Vermont maple syrup - this was quite delicious!  Not just any buttermilk pancakes, but perfectly griddled, and a lovely strip of literally gold-colored milk chocolate with hot Vermont maple syrup - yum yum yum!).  We were seated by Josh, who was oh-so-awesome and oh-so-cool, and our server was Steven, who had a great sense of humor :D  Both were extremely attentive, made sure that everything was perfect, and that we were having a grand time!  Even though it was a rainy day, the view was still nice, and I would love to come back for dinner, as I'm sure the Manhattan skyline would just be spectacular!  It's been quite some time since I'd had a brunch this enjoyable :D  Lovely food, great service, and a lovely view - check the River Cafe out! :D\n\n+Brunch menu is pre-fixe (reservations highly recommended!)\n+Pear Salad\n+Crisp Duck Egg\n+Golden Pancakes (ritzy and delicious!!!)\n+ask for Josh and Steven :D", "author": "Hannah H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-20", "description": "Came here for an anniversary. Great atmosphere. Great views. Great service. Lastly, the food was perfect for the price. No complaints.", "author": "Anthony Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-10", "description": "Highly recommended brunch spot with a great view. They do set menus (dinner is practically the same menu but at three times the price). You will need to make reservations. Set comes with one appetizer and one entree. I had the raw oysters (half dozen) and the steak. Set is about $50 bucks. You get a nice view of the Brooklyn and manhattan bridges. Get the Brooklyn bridge desert for a nice photo memory.", "author": "Daniel C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-04-18", "description": "First off, I can't imagine a more lovely setting for an evening out. Right by the river, right under the Brooklyn bridge, across a cobblestone street, nestled in the trees sparkling with twinkle lights, sits this lovely little cafe. Not to mention that the restaurant itself, especially as night falls, is breathtaking. It would be an amazing location for a wedding reception. The yellow-and-white striped awnings, the little outdoor deck area, the flowers everywhere, the wrought-iron portholes - transport your to another moment in time. The only issue is that they clearly overbook the small space, so that you have to navigate a very tight maze in order to get from the back of the restaurant to the front again.\n\nThe service was fine with some snafus; we had to wait 15 minutes to be seated for a reservation made a month prior, despite our special request for a window seat (again - made a month prior, the maximum window for a reservation), we were seated at a booth, we were waited on by a number of wait staff, several of whom were so inattentive that my coffee was cold by the time I got a refill, etc. You would think that for these prices, the wait staff would be better curated and the service better orchestrated.\n\nThe food was good on one end: my duck was OUTSTANDING. I shoveled it down lest I got too full to finish, lol. Outstanding, I've never had better duck in my entire life. Order it Medium-Rare and it will grace your dreams for years to come. However, the first course was tiny (an itty-bitty salad), my side dishes with the duck (a sliver of red cabbage and cracker-consistency sweet potato spaetzle) were unimpressive, and the desserts were also small and anti-climactic. It's one thing to spend a good chunk of money on an amazing entree like the duck, it's another to spend $120 on a 3-course meal that wasn't worth the $120 for what you get in terms of portion size and quality. \n\nDespite its downfalls, River Cafe was romantic and beautiful, the service was adequate, and part of my meal was to die for. My reaction is that I've had better, more filling meals for less than $120, which is why I can't bring myself to value the food at the price, or give River Cafe more than 3 stars.", "author": "Lauren S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-17", "description": "I love love love this place! Came here to celebrate one year dating anniversary with bf, and it was a wonderful experience. I had the Foie gras with scallops, and I love both the sauce and the food. The foie gras is nothing less than amazing. Bf had soft shell crab and papaya salad, which is a daily special. The crab is very delicious. The papaya salad goes well with the crab.\n\nFor the main course, I had lobster, which is literally the best lobster I have had in life. No one of. The claw meat is baked and sends me into heaven the moment I took a bite. The body is tender and juicy. The gnocchi that goes with the sauce is simply amazing.\n\nBf had the lamb, which is equally good. He had it medium rare. It's juicy and flavorful.\n\nDessert wise, you can never go wrong with the Brooklyn Bridge. The chocolate cake is on the sweeter side though.\n\nGreat atmosphere, beautiful view, romantic place. I'm considering having my birthday here too.", "author": "Ma L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-17", "description": "The tasting set is fantastic. I absolutely loved it. I have had some fantastic food before but the service was also amazing. Never had better service and that's saying a lot. I was waited for every second and I never had to call on them like I usually do at other restaurants. The restaurant should be very proud of its staff. Definitely 5 stars and definitely matched the hype.", "author": "Kuan H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-06", "description": "Very romantic spot, a Brooklyn icon.  Well worth it for a special occasion.  Also highly recommended for vegetarians.", "author": "Oliver B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-06", "description": "This is kind of a delayed review, as The River Cafe was devastated by Sandy. I came here on August 19th, 2012.\n\nI booked a reservation many months in advanced, and was promptly reminded that it is jacket required. I called in to confirm my reservation and again was nicely reminded that a jacket is necessary.\n\nI was visiting NY, and in this weekend I was doing fine dining. This place was by far my favourite place and has been my favourite restaurant. \n\nUpon arrival, my guest and I were promptly seated with a gorgeous view of Manhattan. During our meal, the sun set behind the tall buildings and it was just absolutely amazing. The vibes here are super romantic. They had a live pianist playing soothing music that really help set the mood right. The lights gradually dimmed through out the night. When leaving the table for any reason (like using the restroom), a staff member will come by and refold the napkin properly. \n\nPrior to sitting down, we walked around; so when we sat, I was a bit warm and contemplated taking my jacket off, but decided against it because nobody else did. This was my first time at a jacket required place, so I wasn't sure if jacket required meant I had to bring one, or I had to wear one the whole night. Good thing I kept it on. A Japanese business man removed his jacket when he was seated and a waiter immediately walked over to him and told him he had to keep his jacket on. \n\nFirst out, complementary carrot puree/soup with balsamic vinegar; cured meat, cheese and olive. This was okay, nothing too amazing? If anything the flavour was a bit too strong. \n\nAppetizers:\n1. Wagyu Steak Tartare (hand cut Kobe style beef prepared tableside with quail egg yolk, Cognac gelée, traditional garnish and toast points)\n2. Rabbit and Dumplings (braised rabbit in natural juices, pan fried rabbit loin,\ngarden pea sauce, homemade Brooklyn ricotta cheese dumplings)\n\nThese appetizers were pretty darn delicious, but also very filling. We decided not to have the waiter mix the waygu steak tartar because we wanted pictures first. We mixed it ourselves without using the kosher salt. It was perfect without it.\n\nEntrees:\n1. Crisp Duck Breast (white truffle honey and fennel pollen glaze, duck leg and potato croquette, organic carrots, julienne bok choy)\n2. Branzino Fillet (Mediterranean sea bass, chorizo sausage and shrimp 'stuffing', smoked tiny vine tomatoes, petite zucchini, charred lemon confit)\n\nBoth of these dishes were cooked perfectly. The duck was very tender, juicy, and flavourful. The bass was just a bit hard to get all the flavours in one easy scoop. There was a bit of work involved stacking everything on the fork, but still darn delicious. \n\nDesserts:\n1. Chocolate Marquise Brooklyn Bridge (handmade chocolate with Brooklyn \"black and white\" ice cream soda, Richter's raspberries)\n2. Hot Soufflé (lime soufflé, candied coconut flakes, coconut anglaise)\n\nI'm not a big fan of sweets, and this may have been just a tad too sweet for me, but I had tea to go with it. It was good. The ice cream soda was whatever. My +1 however, absolutely enjoyed both! :) The main reason why I got the Chocolate Marquise was so I could take a picture of it! Oh the things I pay for to take pictures of...\n\nThis restaurant has 1 Michelin star. Does it add up? Definitely.\nI would definitely come back if they get up and running again, and highly recommend it.", "author": "Kaje Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-27", "description": "Probably the best restaurant in NYC that offers a stunning view of the whole city + delicious food. My boyfriend and I came here for our 4 year anniversary and were not disappointed. We decided to do the 6 course tasting, which is $160 a person. While I'm almost positive the portions are smaller than if you order the actual dish, we were super full when we left the restaurant. With that said, the portions they give you for the 6 course meal is pretty generous. With every dish that was brought out, the hostess or manager (?) came to our table and descriptively described our dish. Also, after we finished each dish, our plates and utensils were quickly picked up and new utensils were placed in front of us. Needless to say, service is exceptional here. Our glasses were constantly full. New utensils always brought out. When we ordered our wine, they gave us a sample testing to make sure it met our taste before they filled our glass. They even refilled our wine- free of charge! If there's any expectation you have of fine dining- this place meets them plus more: delicious food and AMAZING service! A side note, they wrote \"happy anniversary\" on each of our dessert plates. Such a personal and thoughtful touch. I'm sure they do this a lot for birthdays and anniversaries, but it's the little things :) I recommend this place to anyone!", "author": "Katie P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-17", "description": "I really enjoyed the beautiful nautical themed interior (the restaurant is literally a converted barge).  This place takes pride in their jackets only policy, so come prepared if you plan to dine after 5pm.", "author": "Stephen P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-20", "description": "This is my all time favorite. I was so worry that they won't re open after sandy. Went there last week for breakfast and it brightens up my morning. Always top service and flawless food. No complaints except the price.", "author": "Wincy T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-12", "description": "Great Great Great Location!  Might have to hit up taco bell or Chicken and rice after because the portions will definitely leave you hungry.", "author": "Reyaadd H."}], "servesCuisine": "American (New)", "priceRange": "Above $61", "name": "The River Café", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Water St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/C_8aEbAvcCLhiqXn9QdWSw/ls.jpg", "@type": "Restaurant", "telephone": "+17185225200"}