{"aggregateRating": {"reviewCount": 1049, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-02", "description": "You cannot beat the drinks and the view.\n\nmy dude and I got a cheese plate and it was good.", "author": "Maria V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-04", "description": "As I planned my proposal to my girlfriend on the Brooklyn Bridge, I wanted to make sure that the entire day was special. I made reservations for lunch and asked if it was possible to personalize our table menus which I had heard about. The hostess said that the manager was happy to accommodate my request. \n\nUpon arrival, we were greeted with personalized menus, fresh flowers on the table and complementary glasses of champagne. I was blown away and so was my new fiancé . The hospitality, the kindness and the special touches made our day so special. \n\nThe food was excellent, the view was incredible and the customer service was unmatched. \n\nIf you are looking for a special, romantic restaurant, please look no further! \n\nThank you River Cafe for the most special day of our lives!", "author": "The O."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-11-24", "description": "Had been looking forward to the experience, booked ahead of time and arrived with my girlfriend early to our reservation but denied seating by the window because I was not \"dressed formally enough.\" The staff who was assigning seats seemed almost upset that I was simply wearing a jacket. Every customer in the restaurant was seated by the window, with about three window seats remaining. One seat remained empty for a good two hours. Food was well above average, amazing view, and our waiter was nice but the arrogance of the staff (both reception and seating) was pretty embarrassing. Would have just left if my girlfriend hasn't been looking forward to it for the last month. Not worth spending $360 to be treated like a second class citizen. Dress to impress the staff if you choose to dine here, because the food by itself wont do the price justice.", "author": "Joseph L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-17", "description": "One of the best restaurants we have eaten in. Awesome views and food. Had the Bordeaux and Pinot noir by the glass and the wines were wonderful. Had the shrimp for appetizer and lobster for the main entrée. Out of the world! My wife had octopus for the appetizer and sea bass for the entrée. They were fantastic too! Great pistachio and chocolate desserts as well. We had a 4-year-old with us and they accommodated her very well. They have an outdoor deck which is great for memorable pictures.", "author": "Prateek G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-09", "description": "The ambience was awesome, the service was excellent and the food was super. The view was brilliant. Would go back anytime.", "author": "Liane V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-13", "description": "I came here for a wedding dinner. The food was wonderful; service amazing; and views spectacular. Everything about it was unforgettable, from the tuxedoed waitstaff to the lamb and above all, the atmosphere. It was a truly wonderful and wonderfully unique experience that's hard to find anywhere else.", "author": "Kai M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-11", "description": "The view is simple breathtaking! Could go everyday... Just make sure you call to ask for a table by the window... Food is not the best for the price.", "author": "Ivette M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-23", "description": "I can not recommend this place enough!\n\nI was working in NY for four months and my husband came out from LA to visit for Thanksgiving.  Now, I've been out to restaurants for Thanksgiving before, and let's be honest, going to a restaurant for Thanksgiving makes you feel like an orphan!  \n\nNot so with The River Cafe.  \n\nJust 5 days before T-day I was able to book a 2:30 pm seating for our Thanksgiving dinner, soon to become known as, \"The best meal of my life\".\n\nThe service was beyond excellent.  Our waiter, (at first we thought he was the manager as he was dressed in a business suit) was warm and informative, and kept and eye on us from a far.  Always there if our drinks looked low or to check on our progress for the next course.  Everything was perfectly timed.  With the Thanksgiving seatings, I thought for sure we would eventually get rushed out after a few hours, but we stretched our meal out until 7 and were able to catch sunset during our meal.\n\nThe food was incredible.  I mean words simply won't do it justice.  Phrases like 'symphony of flavors' and 'absolute joy' come to mind but seem contrived compared to what the actual experience was like.   \n\nI had the crab trio appetizer, and for my main course I had whitefish with pumpkin ravioli and almonds.  My husband had some kind of ox-tail ravioli for appetizer, and for his main course sea bass with a shrimp, chorizo and vegetable stuffing.  Everything came with the traditional Thanksgiving sides.  Now my mother will tell you that I avoid yams like the plague, but the creamed yams with marshmallow sauce was practically a religious experience.  It was all I could do to refrain from licking the bowl!  And dessert was over-the-top.  We were *each* served the following: chocolate flour less cake made to look like the Brooklyn Bridge, a mini pumpkin tart with fresh made vanilla ice cream and crushed pistachios, a mini apple tart, a pumpkin gourde filled with creme brulee, and an assortment of holiday cookies.  We were so stuffed it was all we could do to sample each one before waddling off to the deck to take in the view and snap some great picks with the Statue of Liberty in the background.\n\nAfter we paid our bill and snuck away, our waiter came to find us, warmly shaking our hands and thanking us for spending Thanksgiving with them.  I mean my own family doesn't do that!", "author": "Kathleen L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-12", "description": "In the middle of a rainy, windy, chilly day in late April, my husband and I, visiting from California, were looking for a place to rest out of the wind and made a beeline for a bench in the lovely garden outside of the River Cafe. A woman who was organizing plants for the cafe took pity on us and invited us inside, even though at that point the restaurant had not yet reopened for lunch service. She seated us at a table in the greenhouse with a stunning view of the Lower Manhattan skyline and the Brooklyn Bridge, served us coffee and cookies, and then went about her work as we thawed out. What a beautiful restaurant, and the cookies and coffee were delicious! Thank you, Maureen--we'll never forget your kindness.", "author": "Karen M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-01-27", "description": "The 2-stars are for the view \u0026 that's being generous. Im a simple girl, Amish Chicken, Black Sea Bass or Strip Steak, gives a fair opportunity for the basics.  It's a pretentious, pompous atmosphere which LACKS FLAVOR \u0026 they don't seem to care. I've come for business \u0026 personal events \u0026 the same blandness dressed up in astucious expensive cuisine. Wine list is great!", "author": "JL K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-05-18", "description": "Great dining experience!\nLovely setting with a view of Manhattan beyond the East river. Perfect place to have great conversations over delicious food. Impeccable service.", "author": "Mo Riza .."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-03", "description": "Best views, delciious food, excellent service, great experience every time I've been here.", "author": "Elizabeth L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-17", "description": "The River Cafe is one of my top five favorites, if one can overlook the reservation staff who are pretentious and down-right mean. Who does that anymore?  They don't get a star. \n\nThe waitstaff is the best, the menu is fabulous, and well, the view is spectacular.  My darling granddaughter, Clementine, was even allowed to sleep under the table, in her bassinet of course.", "author": "Kathryn S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-10-31", "description": "The most romantic AND delicious place I ever been to ...The view is spectacular. The 6-course tasting menu was perfect. All four of us agreed that this was by far the best tasting menu we ever had. My favorite course was the branzino. It was simply exquisite. Though the perfectly seasoned steak and scallops were close runner-ups. The South African crayfish was quite special and rich. Although I can't say the dessert was the best I ever had, I did enjoy the special ice cream and chocolate cake. For some reason there is discrimination between genders for desserts. The boys were served with a lemon cheesecake and sorbet. The girls received the chocolate cake with an adorable chocolate bridge and ice cream. \n\nI can go on an on about the wonderful ambience and scene. Bottom Line: Make a reservation and request a window seat. Totally worth it. If this place can't manage to induce romance in your relationship, then I'm afraid it's time to fold.", "author": "Amy R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-10", "description": "I can't really add anything that others haven't said.  This place is special.  BF took me there for our anniversary.  We had to take an early reservation b/c later times were booked.  Come a few mins early to have a cocktail on the deck.  \nIf you're going in the summer be sure to either ask for a seat NOT near the window OR go after the sun is behind the buildings.  We had amazing views - our table was right against the windows.  Unfortunately, it was 90 degrees outside and it felt that hot inside... and we were literally being baked in our seats.  We asked the waiters if there was a way to lower the blinds and they said they were as low as they'd go.  Bring sunglasses.\n\nFood was delicious.  Service was attentive.  Price tag was steep.", "author": "Krista C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-04-11", "description": "Where do I start... Walking down Old Fulton street, reaching the ridiculous line at Grimaldi's (mind you, there is nothing wrong with waiting for 1.5 hrs for their pizza), then for a change, PASSING the line at Grimaldi's, because we're heading to the River Cafe. \nIs it all that it's cracked up to be? Yup, I think so. \n\nHad Dad take the family here for Mom's 50th birthday. The weather was great, our table perfect by the window, piano in the background - the mood for a pleasant afternoon already set. Score (!) as it is not easy to please critical Mom.  \n\nNone of us ordered the same which meant I tried 4 different appetizers and 4 entrees - as good as family dining gets. Before even that, as a pre-appetizer they brought us really really good carrot bread  in addition to our fresh rolls. Then surprise. The server places in front of each of us a plate with an egg on it, cracked on top, then pours milk into it. Quizzical subtle glances among us - no idea what it is. My brother takes one for the team and asks how to eat it. Ha, turns out you just spoon it out. It was some sort of granola but not your usual boring breakfast granola - much better. But of course granola is served in an egg! Duh. \n\nAs for appetizers. I had the seafood trio (shrimp-fabulous-tempura, tuna/avocado delicacy, dumpling), my bro - oysters (this was maybe the one thing I did not enjoy but that probably mostly due to me not being an oysters person), mom - salmon, dad - trout. Excellent.  Had to wait quite a while for our entrees which of course just intensified the anticipation and we were not disappointed. I could not be happier with my choice - branzino with tiny zucchini and ham cubes. Oh My Goodness. Also tried the salmon with mushroom sauce and the duck, which was serviced with sausages and an omelette over a phyllo pastry. Oh My. Again. I think this is what those cooking competition judges must feel like. When the contestants are all excellent. I can be a quick eater, but this time, I just wanted to take my time with each and every single bite to make the most of the taste.\n\nThoroughly enjoyable, definitely worth the price for the right occasion. Would love to go back again of course and hopefully it'll be for dinner. The day view was gorgeous but I'm sure the night one is somethin' else.", "author": "Zhanna P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-18", "description": "This was a fantastic venue with fantastic food and really good service. However when they offered their $15 cappuccinos to us they made it seem like it was on the house. BEWARE!  Do not order a cappuccino for $7.50, it was not worth it.", "author": "Dee L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-16", "description": "I don't care about the pricey pix-fix. The only words I could utter were yum, yum, yum, albeit more eloquently. \n\nA MUST TRY", "author": "Queen R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-03-16", "description": "\"Dine in Brooklyn\" restaurant week review:\n\nI had never known that Brooklyn has their own restaurant week (3/15-3/24, $20.10 lunch or $25 dinner, which is cheaper than when they do NYC RW), but good thang they do, and that River Cafe's in it! Too bad they offer the special menu for lunch only (ends 3pm), because by golly gee wow it would've been supa beautiful at night (the food and the view)!\n\nApps:\nHouse Smoked Scottish Salmon (on a blini)\nLamb Meatballs (3, with mashed potatoey gravy)\nTruffled Chicken Salad\n\nMains:\nWild Boar and Pasta (my pick! pasta's real creamy)\nCrispy Duck Breast (tender, juicy)\nGrilled Dorade Filet\n\nDesserts:\nEverybody gets the tasting trio of strawberry ice cream from the Brooklyn Ice Cream Factory, dark chocolate Marquise cake, vanilla bean creme brulee.\n\nSee my self explanatory pics. Whether a tourist or a local, you have to come here at least once.", "author": "Eva G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-02", "description": "I went for the first time 4 months ago on my birthday. Everything was excellent! At night the place looks absolutely beautiful with all of the lights in the garden. The views of the city are magnificent. Men have to wear dinner jackets. My first time ever eating rabbit. And I have to say all of the food was phenomenal. Our waiter was great. And the dessert with the chocolate Brooklyn Bridge was very impressive. Best dining experience in my life ever!!!!!!!!", "author": "McKinley J."}], "servesCuisine": "American (New)", "priceRange": "Above $61", "name": "The River Café", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Water St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/C_8aEbAvcCLhiqXn9QdWSw/ls.jpg", "@type": "Restaurant", "telephone": "+17185225200"}