{"aggregateRating": {"reviewCount": 1049, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-01-04", "description": "I would say - the atmosphere and location is the most beautiful thing about this place. \n\nI went on a date here for dinner and had my first experience with steak tar tar ... was my last experience as well. Overall the service was amazing and the food was really good - albeit I was thinking for a $300 dinner I should have gotten lots more, but I guess the more you spend the less you get? How is that?", "author": "Michelle R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-15", "description": "I need to correct myself. The 75 dollars was simply for the addition of the wine pairing.", "author": "Sebastian H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-03-30", "description": "River Cafe sits just underneath the Brooklyn Bridge, giving it a breathtaking view for the diners to experience. We came here on a night with a clear sky, so we were able to see the entire night skyline of Manhattan. It was beauuuutiful.\n\nWith that said, the food wasn't up to my expectations or its price. I've tried restaurants around the same price range, and the food was prepared much better. \n\nThe appetizers were actually my favorite part of the whole night. I started out with the Scallop Ceviche, and my boyfriend had the Rabbit with Ricotta Dumplings. Mine was very refreshing, and the ricotta dumplings are extremely flavorful. \n\nFor entree, I ordered the Rack of Lamb and my boyfriend got the Maine Lobster. The lamb was good, but not anything amazing - I've had much better lamb before. It could have been a lot more tender. The Maine Lobster was also pretty ordinary... the texture threw both of us off a bit because it was more on the chewy side. \n\nThe dessert was very disappointing. I ordered the famed Chocolate Marquise Brooklyn Bridge, and the boy ordered Caramelized Apple with Almond Tart. The presentation of the Chocolate Brooklyn Bridge was good, but the cake tasted pretty bad. It wasn't rich or moist or anything good chocolate cake should be. The vanilla ice-cream that came on the side was also unmemorable. The Almond Tart was good, but, like I said before about all the other dishes, nothing special.\n\nThe servers were all very attentive, and the restaurant actually added a piece of chocolate with \"Happy Anniversary!\" on both our desserts when we told them it was our anniversary, which was a cute touch. (It wasn't actually our anniversary though - we wanted to get seats by the window so we tried to make our night out extra special. It failed.)\n\nIn the end, I think the price range of this restaurant stems mostly from the location that it sits on. Other than that, it needs to up the quality of the food way more if it wants to be a top top restaurant.", "author": "Christine A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-18", "description": "A stellar place to dine, almost impossible to get in. If you are lucky enough to get in, you will not forget this place.  The views are amazing. Food is great. Take lots of ca$h because, you will need it.  The Brooklyn Bridge pie is truly a work of art, worth the wait.", "author": "Tough Customer C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-17", "description": "I rarely find places that have it all : delicious food, amazing service, good live music and best views. The river cafe gets expensive, especially for a party of almost 60 people like ours but it's worth every cent. I loved the food so much that I actually ate the whole steak entree included on the four- course menu, and I just DON'T eat steak or burgers. I figured that once they put it in front of me I'll just try it but I ended up breaking my rule and finishing the amazing and  perfectly cooked angus beef. Our huge party was a great success and I'm looking forward to checking out their regular menu. Maybe I'll bring my boyfriend here on a date. Nothing beats the view of Brooklyn bridge at night and their Brooklyn bridge chocolate cake.. I can't believe I haven't heard of this place before.. I should visit dumbo more  often, apparently there are great places to eat out there in Brooklyn. My mistake for loving Manhattan so much ...", "author": "Lena P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-30", "description": "We did the six course menu tasting that was delicious and the wine pairing was excellent. Each dish was amazing. First we had gazpacho (compliments of the chef), then we had Scallop Ceviche, the sauteed foie gras, Lobster tails from South Africa, grilled Dorade, and choice of dessert. For the dessert I loved the Brooklyn bridge cake. The food was excellent A+!\n\nThe ambiance was very romantic and we saw a beautiful sunset of Manhattan. The one thing that I did not enjoy was that the service once we sat down was terrible at first. The Maitre'd was great, but our waiter did not bring us a menu for quite some time. We sat there for 7 to 10 minutes looking around because there was no menu. We had to ask for a wine menu and about the six course menu tasting. The waiter did not even pay attention to us for the first 30 minutes we were there. We felt that it was because we were one of the younger couples dining that night. It wasn't until the Maitre'd spoke to the waiter that we had better service. (Service B-)", "author": "Rachael L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-10-14", "description": "Sometimes I get to go to fancypants restaurants that have $8,000 bottles of wine and fish stuffed with fois gras. Boy howdy am I glad I get to.\n\nThis place was simply exquisite. The service was impeccable, the food was AMAZING, the view was spectacular and I got a little candle on my dessert plate because hell yeah birthdays.\n\nIt ain't cheap, but I doubt you are expecting that while looking up these kinds of places to eat, right?\n\nPerfect special occasion place when you are really looking to wine, dine and be all romanticized.", "author": "Malarie B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-15", "description": "This is the 2nd time my fiance and i came here. The first time we came we were left speechless. We did the chef's tasting menu and you can tell the staff and chefs were on another level. Definitely recommend this place for a special occasion. The foie gras that they serve is a must have! On the expensive side but you get what you pay for and the ambiance is what you would expect from a high end restaurant.", "author": "H. G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-21", "description": "Amazing food, amazing city view, awazing service. Just order a glass of wine and enjoy the food...", "author": "Elinor B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-04-13", "description": "One of my very favorite dinner or brunch spots in NYC.\nI had Christmas dinner there with my partner a few years ago \u0026 the restaurant arranged to have one of their award winning florals at our window front table, for us to take home. They also ordered a bottle of our favorite champagne, which was not on the menu, it was chilling in a silver bucket stand next to our table at our arrival.\n\nLast December I hosted a brunch for seven \u0026 my guests were blown away by the superlative cuisine \u0026 the first class florals. I could not have been happier with my selection. The River Cafe has one of the very, very best views of Manhattan across the East River. I always feel so special when I'm there.", "author": "JESSIE D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-05-28", "description": "I had an absolutely wonderful dinner at River Cafe last night with my grandparents. They were visiting Brooklyn as a trip down memory lane and this dinner provided a lovely evening in a perfect setting. The place itself is beautiful, and there is a great novelty of dining in a barge looking out on the lights of lower Manhattan and the Brooklyn Bridge. The dinner itself was one of the best I've had in New York, but the service did have a few issues.\n\nThe food - we began with an amuse bouche of white bean soup with pancetta and some sort of green oil (avocado?) which was rich, creemy and smooth. For appetizers, Grandma had the oysters topped with caviar, which are served on a bed of peppercorns - very cute. Grandpa had the 'fois gras served two ways' (as opposed to the other fois gras offering on the menu) which he really enjoyed. I had the lobster tails with blood orange, which were delicious and beautiful. They were a bit tougher than necessary, but I'll forgive that because we weren't done with our drinks when they first tried to serve us, so I think they held the dishes back a few minutes.\n\nFor entrees, Grandma had the rack of lamb which was great. The mint \u0026 mustard seed jus complemented the meat perfectly. Grandpa and I both got the duck breast in truffle honey which was fabulous! Both the duck breast and the croquette of duck leg and potato were a perfect texture. It also came with some baby carrots which were lovely too. I thoroughly enjoyed the whole dish.\n\nDessert was a bit of a let down for me personally. I ordered the 'sticky toffee ice cream sandwich' which really was a sticky toffee cake and also a small ice cream sandwich.  The ice cream sandwich part was very enjoyable but the cake part was too sweet and had a funny texture. It was too spongy on the inside and a bit tough on the outside, making it seem like it had been frozen. However, Grandma's apple tartlet was much better, and Grandpa's chocolate 'Brooklyn Bridge' was the star. It's basically a chocolate mouse cake with hard chocolate bridge shapes on each side - adorable. After the desserts, there were a few little treats for the road which were also quite good.\n\nThe service was very good for the most part, especially the hostesses who helped us in and out. The table service was good, but their timing was slightly off. They brought the little soups first, then the cocktails, then the bread, then the wine list, which was sort of a funny order. Our actual waiter popped up a few times and started talking, interrupting our conversation rather than waiting for our attention. All in all though, it was a wonderful meal, a wonderful atmosphere and a wonderful setting. I am looking forward to going back some time to watch the sun go down over New York.", "author": "Colleen L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-20", "description": "Treated my girlfriend to birthday brunch here, was a beautiful event. I easily can recommend this place for a special event -- beautiful location, well prepared menu, reliable service.\n\nThe brunch menu is $55, 2-course fixed price. Paired with champagne and a dessert to share, the bill was expensive, but this is one of those iconic (albeit one of only 3 michelin star restaurants in Brooklyn) locations that you can pay a little more to enjoy.\n\nThe atmosphere was super classy -- beautiful autumnal florals in the main area and adorning the entrance, piano player throughout the meal, GORGEOUS views.\n\nCertainly a \"must do once\" kind of place.", "author": "Laura Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-08", "description": "5+ stars. This was the best experience that I've ever had in a restaurant. The service was seamless, making the whole evening an experience, rather than just a meal. The food was incredible, and the view was to die for. I cannot say enough good things about our experience here.", "author": "Helene D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-24", "description": "This is a restaurant that we kept going back to on very special occasions when we lived in New York for almost six years.\n\nIt's a very classy romantic setting, the live piano playing and Jacket Required atmosphere setting a finishing touch for the very impressive view to Brooklyn Bridge and Lower Manhattan skyline over East River.\n\nThe food is exceptional. You have to get a full menu, which will bring your total for the evening to ca $300 with wine (that is after taxes and tips). But for a very special occasion it is worth it. We used to go there for anniversaries and such.\n\nIf you are looking for a very special dinner in NYC, I can highly recommend The River Cafe!", "author": "Olli L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-05-10", "description": "River cafe... wow was waiting for this day for a long time. \nThe entrance is filled with beautiful plants and flowers! \nStaff are courteous.\nThe food was just ok.  However, presentation is what you pay for.\nThe dessert ( brooklyn bridge) looks and taste nice.", "author": "Milia M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-04-06", "description": "One of the top five meals I've had in my 28 years on earth.  The views of Manhattan from across the East River were romantic and very classy.  The wait staff was outstanding.  My fiance and I got engaged shortly before dining here, so the host took excellent care of us.  One would think that at one of the best restaurants in the country the staff would be a bit snooty.  However, they were very down to earth and friendly.  We had a great dining experience and can't wait to go back.\n\nOh yeah, and the food is incredible.", "author": "John F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-17", "description": "Possibly the most romantic restaurant in the city--with the BEST views of Manhattan. Perched on the water right under the Brooklyn Bridge, River Cafe is the classic date place. It has a beautiful, inviting garden as well. So ambiance is exceptional. My friend and I came here for lunch on Saturday; we walked in without reservations although we had to wait 10 min which didn't bother us at all. \n\nThe food was fantastic especially the Red Snapper special with artichoke puree and the Duck (specifically the duck and potato croquette--I could make a meal out of just that). Even though we were extremely full from our entrees, mimosas/bellinis, we had to order the Brooklyn Bridge chocolate dessert. It was delicious as expected. The macaroons, etc chocolate goodies that came with it were a nice surprise but not necessary. \n\nIt pains me to give this restaurant 4 out of 5 stars, but there is room for improvement on the service side. We sat in very tight quarters, and didn't get our check for a long time. We also had one server who had very shaky hands which made us nervous. We came during the busiest part of lunch (so the lack of attention was understandable but still downgraded them a tad in my book).", "author": "Vim I."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-27", "description": "I had long heard of this place but for some reason never felt overly compelled to try it out.  But when my girlfriend scheduled my birthday brunch at River Cafe, I was excited to see what this restaurant was all about.  An abundance of beautiful plants and flowers adorn the entrance way and friendly hosts quickly seated us upon arriving.  We were seated side by side against the back wall and we got the privilege of looking out on the view they are famous for-the view of lower Manhattan and the east river.   My eyes were diverted from the view when a friendly waiter came over and presented us with the menus and offered us drinks.  The full 3 course brunch was seamless and all the food was delicious.  The service was totally on point with out being over being.  I could not put my finger on exactly what, but something about these place felt very grand to me.  It is the feeling that so many restaurants try to achieve but fall very short of achieving.  River Cafe was an amazing experience for brunch and I cannot wait to try it for dinner and see that iconic shot at nighttime, to say nothing of getting to be able to experience this first class establishment.", "author": "James K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-04-27", "description": "OK this is a great place. No, a fantastic place. The view is astonishing and the food amazing.\nThe food is great too, especially the foie gras and the wild rock lobster. I think rock lobster is much tastier than the regular Maine lobster. In France it sells for a much higher price than Maine lobster so I highly recommend taking it.\nI have the duck with worked very well with the truffle honey...\n\nThe desert is quite fantastic... you HAVE to take the Chocolate Marquise Brooklyn Bridge... it's good and soooo cool.", "author": "Geoffroy D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-16", "description": "Amazing service and beautiful decor. The view of lower manhattan is a pleasure to see while dining. I dont often do high end restaurants but I see the appeal when the service and food is this good. I ordered the lamb chops which were cooked perfectly. For a nice night out with a special someone I couldn't recommend this place enough.", "author": "Marvin H."}], "servesCuisine": "American (New)", "priceRange": "Above $61", "name": "The River Café", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Water St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/C_8aEbAvcCLhiqXn9QdWSw/ls.jpg", "@type": "Restaurant", "telephone": "+17185225200"}