{"aggregateRating": {"reviewCount": 1049, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-11-06", "description": "Was here for a pre Christmas dinner with my family and it was top notch. Had the venison (it was a special at the time) and it was cooked to perfection. Stunning views and mouth watering food make this a must, although I would save this special place for a special occasion as its not your casual Friday night dining.", "author": "Brandon M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-02", "description": "Beautiful food, beautiful view, beautiful place, beautiful service - that's what brings us back time and time again!", "author": "Mark H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-04-20", "description": "And for the thirty-seventh time during dinner I leaned against my boyfriend and sighed, \"It really is a glorious view.\" \nI chose The River Cafe for my big 4-0 dinner knowing the positives -- fantastic food, stellar view, piano music, and the negatives -- touristy crowd and service that can feel a little cattle call-esque but deciding that for a Big Deal Dinner where I wanted to stay in Brooklyn, The River Cafe was the only choice.  \nIt's been years since I've been there, but luckily my fellow Elite Leslie D. checked n recently and the preponderance of 4 and 5 star reviews convinced me that it has aged well. Like me, LOL. \nDinner was sublime. There was some breed of Hungarian pig braised in Barolo for 12 hours as an appetizer special, and it was rich and tender. My foie gras two ways, paired with a glass of Sauternes, combined sweet and savory and crunchy and unctuous in each fantastic mouthful. My duck was crispy on the outside and incredibly meaty on the inside, and Joe's butter poached lobster was tender and wonderfully way to eat, a big plus when you're in nice clothes and not at a lobster shack in Maine. Joe's black and white soda for dessert came with an amazing chocolate cake and a little Brooklyn bridge made of chocolate. Superadorable! \nThere are like I said aspects of the service, particularly in the getting-to-the-table part of the meal, that are a little too impersonal, but our server was an absolute doll and was warm and friendly.    \nIt was a wonderful choice and I had a delightful evening.", "author": "Elizabeth B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-05", "description": "The great:\n- Amazing view from every seat in the house\n- Very attentive staff\n- Excellent menu\n- Lots of little touches\n- $98 fixed price is a steal\n\nThe just-okay:\n- Ordered the lobster, tasted a little undercooked\n- B/c it was a little off the main road and I was in heels, we asked the doorguy to call us a cab, which I figured consisted of turning on the light outside that said \"taxi\" - he ended up calling us a black car, which actually was not terribly unreasonable but still not what we wanted", "author": "Pam C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-08-29", "description": "What a special experience. I invited my boyfriend on Valentine's Day and it was just such a great experience. The food was great, the mood was perfect. It really was completely worth the price. The bottle of wine was amazing and everything I had, including the tar tare was the best I had ever had. \n\nThe 5th star is for the view of the city. It's breath taking!", "author": "Tone S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-20", "description": "My bday celebration! Wow! Titanic anyone? Amazing views. Romantic! Feeling of divinity and fantasy, unbelievable food, service, ambiance was perfect!! Must go. Pricey but worth every dime. Irwin Mun never to be forgotten! Thank you", "author": "Dee D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-12-14", "description": "This restaurant is everything you'd expect it to be. Came here for a celebration dinner with my boyfriend and loved everything about our experience, from the food, to the view, to the service (for the money you pay here, you better love everything). I'm not going to get into individual dishes because I'm pretty sure the chef can't screw up too badly but I do recommend that you order the Brooklyn Bridge dessert to top everything off. River Cafe is just a beautiful place to go to for a special occasion.", "author": "Lana V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-04", "description": "We went for Sunday Brunch.  No jacket required.  We did not make reservations.\n\n$55 fixed menu.  We got an appetizer and entree each with the $55.  Not bad. \n\nThe place is adorable outside and inside!  Really nice atmosphere.  Service is impeccable.  Great place for a special occasion. \n\nI ordered the Butterleaf salad.  Second best salad I ever had in my life.  Light, great portion size (not too big as to ruin an appetite).  Very very fresh ingredients.  My husband had the seafood trio appetizer.  Equally pleased.  He loved it.  Fish was super fresh.\n\nFor entree I ordered the Amish Chicken.  Not happy.  It was a bit on the dry side, and the chicken was wrapped in what seemed like a roll of chicken skin that was all fat and not crispy. The caramelized onions it was served with were a pleasure!  Very good! Not enough of them! It had a pea sauce that I didn't care for.  It was a strange dish.  \n\nMy husband had the Ranch steak which was very very good.  \n\nI would go back but not often as the menu is mostly seafood and I dont eat fish, so for me it would be hard to find something different to try on the menu as they only have one chicken, and one steak dish on their menu.", "author": "Melissa C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-08-11", "description": "I would give this place 4 or 5 stars based on attending a wedding there last year if not for my current experience:\n\nHaving really liked the restaurant, I made a somewhat last minute decision to order a gift certificate for my friends as a wedding gift. I am from San Francisco and wanted to put the certificate in a nice card before getting it to my friends. So, knowing the timing was tight I called and spoke to a young woman on Tuesday evening and asked if they could process my request and mail out the certificate ASAP so it would arrive by that Saturday to a NY address where I was staying. She didn't think that would be a problem.\n\nI faxed the request form on Wed morning with a cover letter emphasizing that I needed this certificate to arrive by Saturday (or else I would no longer be at that address) and asked that someone call me if that is not possible.\n\nI heard nothing until I called the restaurant Friday afternoon and, after some time, received a call back from the manager that processed the request. He casually said \"Oh, it went out Thursday morning I think. It should get there tomorrow or the day after\". Day after being - MONDAY.\n\nNeedless to say the certificate never arrived, I had to leave a forwarding address with the people I stayed with, and I had nothing to give to my friends. Quite disappointed by the customer service. I would have appreciated a call letting me know that they may not get it out in time so I could have saved everyone the hassle.", "author": "Anya S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-07-02", "description": "Spectacular setting and view.  Prix Fixe ($115 per person) was very expensive but I guess you have to pay for the view.  There was too much food overall, although it was all very good.  The quality of wait service declined drastically around time for dessert although they were not very busy.  We practically had to body tackle the waiter to get our bill.  Not a very classy ending to the evening, alas.", "author": "Carol M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-25", "description": "We went during Brooklyn's Restaurant Week, which was only $20.10 per person for lunch.  If it had a dinner menu, that would have been amazing because there is a great view of Manhattan from River Cafe.  \nThe portions were relatively small, especially the appetizers.  The crispy duck breast was very tasty, but the wild boar and pasta wasn't too special.  Being able to have three desserts was a plus!  However, the dark chocolate Marquise cake wasn't as good as the creme brulee and strawberry ice cream.  \nIf you get a chance to, you should go here at least one time at night.  The atmosphere and view will make an unforgettable night!", "author": "Joanna L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-20", "description": "I came here with my boyfriend 2 years ago and have yet to have a meal or experience like I had at The River Cafe. I can remember absolutely everything about it from the beautiful views down to the cognac geleè used in the steak tartare. The waitstaff was incredibly charming and warm and made our experience that much more special. I'm so glad they've bounced back from Hurricane Sandy and honestly can't wait to return.", "author": "Nicole L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-08-30", "description": "Absolutely beautiful place. My cousin had his wedding reception here last fall. They had rented out the Terrace room for the event. It was decorated perfectly. We sat and had our dinner and looked at the NYC skyline. The food was fantastic. They chose not to have dancing at thier wedding which I was dissappointed about, but we had a wonderfull time. Just awesome:)", "author": "Lindsay B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-18", "description": "I've been here twice, and the two times were night and day.\n\nMy first experience was definitely a two star review.  While the food absolutely knocked it out of the park, the service was unbelievably bad.  I will spare everyone the details, but I will say that i was more than appalled.  To the restaurant's defense, it was an incredibly packed night due to fireworks (fleet week i believe) and the exceptional view of the river/city.\n\nBut after a chat with the manager and giving the restaurant a second chance (I knew a restaurant with food THAT good couldn't possibly have service THAT bad) i have definitely come around.  The second time around the service was great and food was just as good.  the oysters were delicious, even though i normally hate oysters.  i think a restaurant is truely on a different level when they can make the foods you hate taste great.\n\nSo overall 4 stars for the amazing food, good service (second time around) and breathtaking views.", "author": "Lisa P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-05", "description": "It was a cold night in november 2008 when I was invited by my boyfriend to have dinner and celebrate my 21st birthday. A nice romantic candlelight dinner, friendly staff, great food, beautiful scenery of manhattan \u0026 the historic Brooklyn bridge...oh what else could have I asked for? By the end of the night my Mr \u0026 I headed to the outdoors to stare at the few stars you can still see in NYC hugging to keep warm and a shining ring appears before my eyes...I couldn't believe it...is it what I think it is?\n\nIt's truely the perfect place \u0026 perfect time\nIt's indeed a night to never forget!", "author": "Margarita C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-26", "description": "The River Cafe is one of my favorite places to go for special occasions. The view and overall ambiance of the restaurant is what initially won me over.  The food is delicious and the service is pleasant and attentive. My guests always compliment me on my choice of restaurant. The only problem I seem to find is that it is difficult to get a reservation at the right time, and they are booked much too far in advance.", "author": "David p."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-21", "description": "Well what can I say that has not been said before\n\nThe whole experience was beautiful (except the cliche just engaged couple)\n\nWhen we arrived we ordered two cocktails. The only problem I had was that our appetizer came too quickly. Was hoping to finish my pre dinner drink and move on to wine before this but that is minor.\n\nWe asked the gentleman taking our order for his recommendations. Turns out what we picked was right on the money. We share everything when we go out to eat myself and my fiance, and I am so glad I got to taste so many dishes.\n\nSteak Tartar, flavorful, fresh and delicious\nYellow fin tuna, wrapped in bacon,stuffed with foie gras with onion froth and black truffle vinaigrette , melt in your mouth and leaves you craving it for days after\n\nMain course, lamb with fondant potatoes, perfectly seasoned, beautifully cooked and some of the nicest lamb we have ever had\nBranzino, one of our favorite fishes, and we were not disappointed here. \n\nI finished with a cheese plate, a great selection and lovely condiments. While my other half had the sticky toffee pudding and he licked the plate clean\n\nAll and all it was a wonderful experience. So much so we sat at the bar and drank another couple bottles of wine. First ones sitting and last to leave, the way we enjoy our dining experiences.", "author": "Niamh B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-07-02", "description": "River Cafe is really nice, its on some sort of barge so its like you're on a boat on the river.  The views of downtown Manhattan and the Brooklyn Bridge are great.  We went to Sunday brunch and it was a beautiful day.  They come out with a hallowed out egg that they fill up with some nuts granola berries and oatmeal and its so yummy.  It's a fixed menu, appetizer and entree for $55 which is a little pricey for me but the atmosphere was worth it.  Food was good but nothing amazing but you're definitely paying for the high class atmosphere.", "author": "Lisa P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-11", "description": "Amazing food. Unparalleled view. Completely professional service. If my budget allowed me to eat here once a month, I would. As it is the two times I have been here, and my daydreams, will have to suffice.", "author": "Kristen P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-07-23", "description": "I've been having a business lunch here with my best customer at least once or twice a year since the late 90s.  Living in San Francisco means among other things that restaurants with a view are not all that much to write home about.  The River Cafe, on the other hand, is.  I don't know what to say to the one-star folks who've been so disappointed except maybe give lunch a try.", "author": "Bob S."}], "servesCuisine": "American (New)", "priceRange": "Above $61", "name": "The River Café", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Water St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/C_8aEbAvcCLhiqXn9QdWSw/ls.jpg", "@type": "Restaurant", "telephone": "+17185225200"}