{"aggregateRating": {"reviewCount": 1049, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-08-08", "description": "I don't give 5 stars lightly.  A restaurant absolutely has to prove themselves for me in NYC simply because there are a million options!  But The River Cafe DOES NOT DISAPPOINT!  Took my wife on a Tuesday night.  Jacket required for men which is unusual these days in NYC but well worth the effort.\n\nPrix Fix menu.  I had shrimp appetizer with rack of lamb and a lemon souffle for dessert.  All were 5 star fantastic!  My wife had a scallop app, lobster entree, and coffee/caramel dessert.\n\nMay be best restaurant experience in many years in NYC.  It's not cheap but it's not as much as many Manhattan high end restaurants.\n\nIt's our new NYC favorite!", "author": "Craig S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-20", "description": "i have lived in the brooklyn heights neighborhood for over 30 years.  throughout that period the river cafe has been  a place to take special people for special occasions. during the long hiatus after its destruction by hurricane sandy, i missed it sorely ('though being a diner person on a daily basis i only get to the river cafe a couple of times a year). i  was delighted to see it come back better than ever.  i don't know why (i do not drink so i don't run the price of the dinners up) but when i go there i am always made to feel welcome and even special. i think it's just their ethos.\n\nthe setting is unmatched by any in the city; for people who live high off the water or away from the river, it is always amazing to see the bow of a huge ship coming past very close under the bridge. the decor and flowers are beautiful, although the lighting at some of the tables can be a bit dim, a situation i would guess is necessary so that the lights along the glass wall on the river side do not interfere with the view of the bridge, the river and the city for the diners further from the windows.. \n\nthe staff and service is top drawer; no hip details here but i find real pleasure in the management's attention to detail and elegance in regard to all facets of the restaurant's operation. men have to wear a jacket; some make a face but it's kind of nice to see when one is surrounded on a daily basis by hairy legs in cargo shorts and torsos of all (and i mean all) sizes in t-shirts. \n\nalthough the portions are on the small side (except for the prime new york strip steak), i never leave hungry and this is surprising since i can no longer eat their desserts because of a medical problem.  of course i do pay extra and get the cheese plate instead. \n\n the food is wonderful and worth every cent (unless one is a vegetarian who does not include dairy in their diel, in which case, although the staff tries to be accommodating, one is in trouble). there are always lovely little extras that are served, gratis, before and after the entree.\n\nthe restaurant is very expensive (at least for an average person like me) but for me worth saving up for.", "author": "Ruth N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-29", "description": "first time here, went with my boyfriend for a belated bday dinner. we came early and had a drink at the bar around 5 then had our reservation for 6. we watched the sunset over the city which was beautiful. dinner was INCREDIBLE. the service was impeccable and the ambience was so romantic. I had the Cobia as my app, DELICIOUS and so fresh. he had the rabbit which was equally amazing. for our entrees, I had the steak and he had the rabbit. exceptional. paired perfectly with a bottle of Chianti. chocolate soufflé and sorbet plate for dessert. \n\nLet me add that I had a severe dairy and egg allergy and the waitress told me I could still have anything on the menu \u0026 the chef would work around it. my boyfriend and I agreed that this was definitely one of the best meals we've ever had. So delicious and outstanding service", "author": "Michelle M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-30", "description": "Beautiful and special as described umpteen times but completely deserved.\n\nThe food was marvelous. I don't think I can add anything to the masses of reviews (a special occasion restaurant times 10, dress appropriately). I withheld the final star because the captain seemed to be rushing us from the start. We had the menus in our hands for maybe 3 minutes and he wanted to know if we were ready to order. Then back again in about 2 minutes. Because of adding on the caviar appetizer and the wine we chose, our bill for 3 was over $800. But hear me say, absolutely worth it. So that is not my issue at all. I do wish we had not felt so oddly rushed from the start.\n\nAll that said, a memorable evening and we will return at some point to mark another family event.", "author": "Reg J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-27", "description": "It was amazing! Everything my family had was incredible. We had the sea scallops, salad, pork belly, steak, sea bas, chicken dish, the Brooklyn Bridge dessert and the chocolate soufflé. You can't go wrong with the view either!!!! I would for sure go for lunch, you get a better deal that way. Make sure you are not wearing shorts and sneakers because they will not let you in.", "author": "Catie J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-27", "description": "Wow....this was an exquisite dining experience. The food is pricey, but I doubt you will be disappointed. I brought my wife here for a date night and we had a wonderful time. The service was great.....the food was flavorful and the view of the city was breathtaking. You will need to acquire reservations well in advance. Be sure to try their signature Chocolate Brooklyn Bridge dessert.", "author": "Greg M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-11-19", "description": "Don't even bother. The owner is a real busybody who doesn't mind his own business. The restaurant looks like a bunch of kids decorated it, and you'll be shocked at the prices.", "author": "Ron M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-08", "description": "I love this place, their food is always excellent and the location is absolutely perfect.\n\nI saw this place in the Sopranos and I had to check it out. We got the roasted rabbit and tuna tartar for appetizers. For our main course, we had the black sea bass and the duck breast. I don't think my pallet is sophisticated enough to pick up all of the flavor notes, it was kind of a sensory overload. I think my favorite was the sea bass, it just fell apart and melted in my mouth. It would be impossible for me to even get close to mimicking anything they cooked in at home, and I've been cooking for quite some time.\n\nYou can't beat the view or the live piano player either. If you're a visitor, make a reservation for this place, it's a great way to experience the city. Don't forget about the dress code.", "author": "Jamie T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-07-28", "description": "The restaurant has a really nice view, and the food is good but for the prices they have i would expect something way better. The space is very limited , you have to squeeze in between tables and the service is not too good. I have definately been to better places that are cheaper. The decoration, view and welcoming service are unbeatable.", "author": "Kimberly Q."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-20", "description": "I came for dinner with my husband last night and it is such a beautiful restaurant. The views are just incredible! \n\nWe had a complimentary appetizer from the chef which consisted of polenta which was great! We didn't do the six course pre fix menu because the chef decides what we would get and my husband is super picky so we just stuck to the 3 course. For appetizers We had the crab cake and the wild shrimp and both were tasty!! For entrees we had steak and lamb, another great pick. For dessert we had the Brooklyn bridge cake and the goat cheese cheesecake. I did not enjoy the cheesecake at all but if you like goat cheese then you'll love it!\n\nOutside, it's beautifully decorated with loads of flowers and beautiful lights. Don't forget the Brooklyn bridge which is right in front of the restaurant! The customer service was exceptional! Lots of waiters who are always there- before you get to ask for a refill or for a glass of water it's already on the table. Live piano player which was a beautiful addition! \n\nIf you are ok with spending $300+ for just two people I would recommend you coming here! It's beautiful, the food is amazing and it's a great experience :)", "author": "Christina P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-06-01", "description": "The new maître d' is appalling... \n\nI cannot say much more to the young man who claimed to be the manager (it definitely was not Mr Stamford)\n\nShame on you both. And thank you for ruining a very special night for us. (Their behavior only gives credence to old rumors about about the restaurants \"anti orthodox jew\" policy)\n\nDespite remodeling/renovating/restoring after hurricane sandy... Unfortunately, the River Cafe lost all class and decorum.", "author": "S G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-09", "description": "Very romantic! With an Amazin view, this restaurant is perfect for special occasions  the chocolate desert is very good And beautiful also.", "author": "Albany S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-06-15", "description": "We had our intimate 50 guest wedding reception here in the private room to the left of the entrance. Can you get a more romantic venue? Absolutely not. Better service? Probably not. Better food? Absolutely! I was weary of the meal options when I was told that I could NOT have a tasting. They rely on their location and vista and that's what you're paying for. The passed hor d'oeuvres were just OK. The plated 4 course meal was uninspired, totally dated and just not sexy at all. The best thing was the cake and from all appearances, the pastry chef is the only one keeping up with the times insofar as deliciousness and eye appeal.", "author": "Ilyce M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-09", "description": "Anyone who doesn't enjoy this gem must have voted for Mr. 45 because the overall experience was amazing. The Steinway, scenic view, amazing food, wonderful service, scrumptious drinks and honestly for what it is their lunch prices are a steal. Highly recommend", "author": "Alex G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-12-12", "description": "2 stars for the location, bread and dessert....\nFirst you arrive in a nice lobby where a hostess take your coat. We made reservations the day before and weren't informed about the \"Jacket mandatory for the gentlemen\" The good thing is that they provided one. Wife had a bad sprained ankle, had to wear very comfy boots (she wasn't dressed up, but looked casual nice with dress and flat boots)\nWhen making the reservation, we asked for a table next to the window, given that we were celebrating a birthday. We were assured that \"all tables were next to the window and had a view\". Guess what! we were seating in a remote corner, not at all next to the windows! NO view at all! \nWe felt it was before we weren't \"pretty enough\" for the place, that they hid us. We saw at least 3 unoccupied tables by the windows, and none of them had people all through our meal.\n\nDinner: here is another thing that we weren't made aware of: It's a pre-fixe menu, at $120 (excluding gratuity and drinks). You have to choose one appetizer, one entrée and one dessert. When we looked up online, my wife wanted to order a couple of appetizers instead of an appetizer and an entrée. She usually orders that way.\nBread was good\nSo appetizers: foie gras for her, crab for me. Crab was good, tasty. Foie gras was unedible. You know how foie gras is supposed to \"melt\" on warm toast. She is French, she knows foie gras. This foie gras was undercooked, with half of it being slimy pieces of almost raw liver. Just gaggin at the thought of it. She had to test every bite, mashing it with the fork, to make sure it was edible!! half of the foie was send back, nobody asked us why!\nENtrees: strip steak and lobster. Yeah... while the strip steak was bland, the lobster was too salty! \nDesserts were good: The brooklyn bridge and some dessert with sherbet.\n\nBill was something like $350 before gratuity. We don't mind spending that kind of money, even more if the food is on point, and we don't feel like we are a disgrace to the restaurant. \nWe were so disappointed, we did a rematch for the birthday dinner.\n\nSo to sum up: if you are going to this place and want to make you have a view, wear your cocktail dress, all your diamonds and pearl, Louboutins, Louis Vuitton... or else you'll be put in a corner.\nThere is a far better view, 1 minute walk from the restaurant, Right behind the bargemusic.", "author": "Vuzg Z."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-21", "description": "We went to the River Cafe last night for our first year anniversary and we couldn't have been happier! The food and atmosphere were amazing and the service was spectacular! They went to such great efforts to make our anniversary so special. Perfect night!!", "author": "Deirdre M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-02", "description": "Initially i waited for 20 mins for my table and was slightly irritated as it was my gf's birthday, but they gave me complimentary champagne and the moment i tasted the food I was happy that i choose this place for my gf's birthday day", "author": "Shaleen A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-12", "description": "Went here last night to celebrate my husband's birthday. I don't understand the poor reviews on this site. Our meal was wonderful, the staff was very friendly and based on what I saw, every table in the room had some view of the river. Did we have a table on the window? No, but our table was situated in such a way that we still had amazing views of the bridge and river / harbor. \n\nThe bar staff make excellent cocktails and the waiter was kind and unobtrusive. The food was really good, especially the appetizer which was a special of buffalo mozz ravioli in a porcini sauce with shaved white truffles. \n\nThis is definitely a special occasion restaurant, but I'll be back to celebrate another special occasion.", "author": "George S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-21", "description": "Oh, The River Café.\n\n*stares longingly into space and makes a romantic sigh*\n\nSuch a beautiful restaurant that rests in the shadow of my beautiful bridge in Dumbo. I was once taken to The River Café for a birthday dinner and had such a lovely evening. True, it's no friend to the wallet, but the food was delectable and totally worth the triple digit price tag at the end of the night. I highly suggest ordering anything with foie gras, beef tartar or duck. Everything is impeccably arranged on its plate with a strong sense of creativity and precision. \n\nLet's face it, you can't beat the ambiance and service of The River Café or its scenery of the Brooklyn Bridge and Lower Manhattan. It's practically an aphrodisiac for the ladies. Plan your visit at least a few weeks in advance if you hope to get a prime night dinner hour booked on a weekend. For Valentine's Day, you'll need to rob a bank and partake in a Satanic ritual involving a sacrificial goat to secure your reservation. Seriously, good luck.\n\nIf you can afford to come here for meals other than special occasions, you are one lucky _______ (fill in the blank) and I hate you. Please note that even though I hate you, I would still accept your offer to take me here if asked... just putting that out there.", "author": "Leslie D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-13", "description": "A memorable great experience. Brought my mum for Brunch to spoil her for mothers day (UK version). Enter and you are into a wall of flowers, the scent was stunning.  Through the tunnel and into the restaurant proper and the first thing to hit me was again the gorgeous bouquets of flowers, spring has certainly arrived in the River Cafe. So beautiful. Everyone we met with, maitre de, bar tender, waiter, very friendly, the food was delicious \u0026 the view, breathtaking. Totally nailed spoiling my mum! Thanks River Cafe.", "author": "Kate D."}], "servesCuisine": "American (New)", "priceRange": "Above $61", "name": "The River Café", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Water St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/C_8aEbAvcCLhiqXn9QdWSw/ls.jpg", "@type": "Restaurant", "telephone": "+17185225200"}