{"aggregateRating": {"reviewCount": 1049, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-01-15", "description": "My husband and I were given a $350 gift certificate to River Cafe and we went last night. We had a good time, but if I were you, I would spend my money elsewhere. \n\nHere's what we enjoyed: The view is beautiful, and so is the restaurant. The atmosphere was lovely, and the service was excellent. They do actually have some reasonably priced, good wines on their list, which I wasn't expecting. My appetizer was wonderful (baked buffalo mozzarella with currants and ine nuts). My husband's rack of lamb was excellent and my fillet of turbot was really good. We enjoyed the port tasting dessert.\n\nHere's why I only give it three stars: All the food is prix fixe - I think it was $98 a person for an appetizer, an entree, and a dessert. All the entrees are basically small portions of fancy protein with no sides. It was simply not enough food for that much money. My husband's rabbit dumpling appetizer was unimpressive.\n\nBottom line: You're paying a lot extra for the view, the service and the atmosphere. Maybe that's worth it to you. I'm sure it would impress your date. But me and my husband would rather spend a third of that money and have a full plate of food for dinner.", "author": "Erin Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-20", "description": "Awesome place, I've been going here since the early 1980s . The view of lower Manhattan is well worth the price. Great food and good drinks", "author": "Ken R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-02-23", "description": "I heard so many nice things about this place and I had wanted to go there for a long time. \n\nService was nice, the view of Manhattan was gorgeous, and food was good. But I don't think it was worth what we paid. I felt like half of what we paid was just for the view. \n\nIt was a nice experience but I don't think I will go back.", "author": "K T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-04-25", "description": "Still not open for lunch weekdays.. And bar is not open for drinks.. So it's not like the old days..", "author": "Steen K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-18", "description": "Miserable people all of you that gave this place less than 5stars , get a life , enjoy your moment , or stay home and cook your fricking fried egg , for God Sake ...", "author": "Rodrigo N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-11-26", "description": "I was in this place one time. I very like this restaurant. They had a lot of positive tags:\n\n- delicious food\n- full bar of drinks\n- amazing view \n- great atmosphere\n- i really love them garden\n\nThe price is was ok also. Not too expensive for NYC. Great experience. I would recommend this restaurant to everyone", "author": "Kate S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-21", "description": "My husband took me here for our first year anniversary. It was incredibly romantic, sitting by the window on a stormy night overlooking the river. We had at least 3 different people wait on us, which felt very luxurious.\n\nThe food was amazing. I basically licked my plate clean each time. The best part was the dessert - they brought out my hot souffle with a candle and a little \"Happy Anniversary\" sign written on dark chocolate. \n\nIt was a perfect evening and I would totally recommend this restaurant for anniversaries, birthdays, or any special occasion.", "author": "Carol F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-24", "description": "Once we entered the driveway to the restaurant, my gf breath was taken away with all the flowers in the garden, so beautiful. I thought it was so cool that the restaurant was basically part of the Brooklyn Bridge. Valet was very courteous, and reception was welcoming and took our coats and bags.\n\nWe came in with our reservation at 8p but wanted window seat, we had to wait until 930 they said, I was fine since we weren't hungry yet, and there was nice area with tables and bartender came around with cocktails. The restaurant was very intimate, but you could feel an upscale atmosphere, very New York. The view was AMAZING, the restaurant was virtually in the water.\n\nThe food was very good, I thought it was kind of expensive, but I attributed it to the atmosphere and view. Surprisingly, we were very full from the 3 course pre fixe meal, I had the foie gras, Ribeye and goat cheesecake. They presented us with complimentary appetizers and chocolates, service was exemplary. Definitely not a place for regular dining, it's good to keep it memorable!\n\nJacket is required btw", "author": "Alexander A."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-01-25", "description": "When your shadow is taller than you are.. then you know the sun is about to set.\n\nThis is one of the most disappointing restaurant experiences I have had in NYC.  The River Cafe certainly has a great location and history; however, it is in desperate need of a shot of adrenaline and youth.\n\nTo be fair, there are some great things about the restaurant:\n\n- fantastic views\n- solid (if unimaginative) food \n- calm ambience / not crowded\n- very competent and friendly head waiter\n- reasonably priced high quality wine list\n\nThis property has the makings of a legend; however, the restaurant is inflexible and cares more about preserving outdated traditions than providing good customer service.  \n\nThis is one of the only restaurants I have visited in years that refuses to serve guests who aren't wearing jackets.  Even the highly esteemed Taillevent allows its guests to take off their jackets -- and The River Cafe is a far cry from the high standard set by Taillevent.\n\nDespite the self-imposed formality, this restaurant does not hold up to it's own air of sophistication.  In a more casual environment, I would not over emphasize the following; however, since the owner insists on adhering to needless formality, I will point out that:\n\n- wait staff served guests from both the left and right\n- after the first pour of wine, the wine steward dozed off and seemed to forget that he was supposed to watch for our approval / disapproval\n- wait staff  were uncoordinated and often asked duplicate questions \n\nIn addition to inconsistent service, the restaurant:\n\n- has an entirely expected and unimaginative menu\n- distastefully attempts to usher guests into over-priced restaurant limos for their return trip to the city\n\nThere are a lot of great restaurants in Manhattan that will work for your business.  Avoid The River Cafe and spend your dining dollars at a restaurant that deserves your patronage.", "author": "Harold S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-23", "description": "Excellent venue for a romantic night out.  Food, service and view are outstanding.  If you have a date don't hesitate to go to the River cafe.", "author": "Vinny C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-04-27", "description": "My friend had a wedding dinner here.\nWe had some Hors d'oeuvres during the cocktail hour and a 4 course dinner: Soup, 2 Entrée, dessert\nThe food was great. Staff was great. Lobster \u0026 scallop soup was excellent.\nOysters were fresh. Steak was cooked nicely.\n\nThe Valet Parking attendants were unprofessional.\nI waited 30+ mins, outside in the cold wearing high heels, for my car.\nThey kept on telling me they're working on bringing the car over.\nFinally after 30+ mins, they told me they can't find the car key... without any apologies and asked me if I had a spare key..\nIt would have been nice if I was told earlier that they couldn't find the key or at least apologized!\nI went inside and asked for the manger. I wasn't yelling but I definitely showed my irritation. Luckily the Hostess and the Manger was extremely nice and professional so I was able to calm down. I was impressed with how they handled the situation.\nEventually they found my car key from the bride and groom's car. It was strange because my friend's car was there way before I arrived.\nImagine if it was in a random customer's car and the car already left.\nTook me 45 minutes to leave the restaurant.\n\nAlso, the Valet tickets were received by the attendants but the cars weren't brought out in order. \nThere was also a family with 2 children who waited 30+ mins to get their car while everyone who came out after them got their cars. The gentleman actually had to go to the key box and got his own keys and asked them to bring the car.", "author": "Susanna K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-27", "description": "We celebrated a birthday at the restaurant and the cafe was in an ideal location to do so. The staff was courteous and kind. They accommodated our request to seat us by the river, with the views of the skyline. The food was up there as well-we got the ceviche, cured salmon, the halibut and branzino over the course of our meal, with an almond pave for dessert. I found the salmon to be a touch too salty, even though I expected it. But all in all a solid experience. I would re-visit this place, and recommend it.", "author": "Rathore V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-14", "description": "I read the reviews and agree!\nThe food is expensive and delicious!\nThe location amazing!\nThe prices higher than usual!\nBUT what a great night with someone you care about.\nMakes paying the bill a pleasure.", "author": "Brightwaters L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-06", "description": "A truly beautiful restaurant on the water. A pre fixe menu of several appetizers, entrees, desserts, which cater to every diner's whim in a beautiful, delicious, and creative way, even vegetarian. Gorgeous flowers, a water view of the Manhattan skyline with twinkling lights invite diners to linger over their sumptuous meal!", "author": "Judith M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-15", "description": "Splendid View, The Supreme Chasitiy,and a Superb Meal= I'm not picking up this tab!\n\nThis establishment is quite romantic and a divine view of the Brooklyn Bridge and New York City. Not to mention is suited to anyone-a date, a parent, a benefactor-EVERYONE.\n\nMy favorite entree was the Brazino- prepared to perfection and a savorily after taste. There Sauterne wine is also incredible-no need for a traditional dessert.\n\nLastly-come classy or you will definitely appear like an outcast here.\n\nNow you officially have the supreme touch!", "author": "Chasitiy P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-02-15", "description": "One word = AWESOME!\n\nTheir dinner prix fixe menu is pricey (according to their website) BUT I went there for a la carte Saturday lunch. I'd say the prices aren't bad for an entree. Their appetizers are pricey but they are really good. We had 4 appetizers: beef salad, pear salad, lobster bisque, and tuna tartare. For the main dish we had the lobster and then the lamb shank. I'd strongly suggest the lamb shank and avoid the lobster. I generally don't eat red meat, but when it's good - it's DARN good and i'll eat it. \n\nWe also had mimosas. It was alright but I don't think it's worth $15 a glass. \n\nAnd last but not least, the view is amazing! This place is so cute, cozy, and it's like you're literally in a boat.. Did you notice the windows on the back wall?? (it's those circle looking windows from a boat)  I can just imagine how nice it would be on a clear evening in warmer weather and they even have a patio area. It would be even better if the Hudson was deep blue instead of murky faded olive green. Hehe.", "author": "Tracy L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-08-13", "description": "Definitely NOT a place to go if you're looking for superb food. At even half the price I would say the quality / price ratio was out of whack.", "author": "David A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-03-14", "description": "Honestly one of the best meals I have ever had the pleasure of eating. Had the steak tartare appetizer, the branzino and of course the chocolate Brooklyn Bridge.\n\nYou can't beat the view either - first class seats for the downtown skyline. There were fireworks going off near the Statue of Liberty the night we ate here.", "author": "H E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-16", "description": "Wow!\nHands down, one of the most beautiful views around. One of those places that is truly special, and I am glad to have experienced the River Cafe recently!\nTheir menu is verrrrrrrrrrrry un animal-friendly (baby quail! Eek!) but they were MORE than accommodating to me and my vegan eating companion at a recent event. They made sure everything was meat/dairy/egg/etc free and it was all amazing. They checked in with me several times throughout the evening to make sure everything was acceptable with my dietary restrictions and I felt very well taken care of. It is not common to have such a highly regarded establishment be so considerate to veg/vegans and it's wonderful to know that they really do care about your experience there. Props to the staff!", "author": "margot t."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-13", "description": "The bottom line: Excellent food, amazing views of Manhattan, top notch service, a very memorable evening - pricy and worth it. \n\n----------\n\nMy friend and I were lucky to snag a highly coveted window seat. I was fortunate to have a concierge at a luxury hotel make my reservation and introduction. We were treated like royalty. \n\nI timed our arrival so that we had ample time to see the sun set over Manhattan. The weather was clear and mild and the view was absolutely spectacular. \n\nThe food was delicious and the presentation beautiful but frankly I can't recall what we had but I'll never forget the view or the evening. \n\nThis is an expensive treat that is worth every penny. If you're looking for a romantic and memorable evening you won't be disappointed.  Good luck snagging a window table though.  In all fairness, the view is spectacular from almost any table.", "author": "Jim K."}], "servesCuisine": "American (New)", "priceRange": "Above $61", "name": "The River Café", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Water St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/C_8aEbAvcCLhiqXn9QdWSw/ls.jpg", "@type": "Restaurant", "telephone": "+17185225200"}