{"aggregateRating": {"reviewCount": 1049, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-06-16", "description": "My husband and I took a 10 yr anniversary trip to NYC in early June 2010, and I made reservations 2 wks ahead for River Cafe. Here are some facts... \n*Yes it is expensive...but so were all the other 5 star places (Daniel's, Savoy, etc..) We dropped about $350 including wine \u0026 tip, which included a fixed price of $98 per person for appetizer, entree, \u0026 dessert. \n*The service is impeccable! So attentive, yet not hovering. So informative, yet not arrogant. \n*There is no finer view! Hint...if you want to take pics, be sure to start taking them at dusk. The dusk pis came out much better than the night pics, b/c you can still see the buildings. \nIf you don't want to drop this kinda cash, you could eat at one of the places around the corner and walk to the park next to River Cafe and get the view...but you won't have the romantic view while you dine. \n*The food is great, the stuff that \"Top Chef\" is made of...fois gras, onion foam, etc... we had the soft shell crab \u0026 Seared yellow fin tuna w/ fois gras for appetizers. The Tuna...what more can I say?!- I'm still thinking about it! Had the Branzini \u0026 Steak for dinner. Steak great, Branzini was ok, but I found lacking in flavor. Had the Chocolate Marquise Bridge and Apple tart for dessert. Someone in your party has to get the bridge dessert just so you can see it, and it tasted great.", "author": "Jennifer V."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-02-25", "description": "It certainly is located in a great area, and faces the city creating a romantic destination for some occasion or celebration.  It does have all the ingredients for the best night ever, including the cobblestone pull up driveway for your car.  On nice nights you can sit in the elevated garden area in front of the restaurant.  However, for me, it  just didn't fulfill all it's promises.  From the rats that were hanging out  in the garden when I went last to the food,  it was only good.  Nothing was really spectacular.  The waitstaff was decent, ambience ok, but somehow I just expected more especially from the hype and pricing.  I think the better and cheaper date night is to just hang out on the pier, if summertime get some icecream from Brooklyn Ice Cream Factory, and who cares if it dosent mix, but sit at the bar in the restaurant (which faces the same view if not better) and get a drink instead .", "author": "M F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-03-27", "description": "went to this famous (?) resto a few years ago. was a-ok compared to what i was told by many critics. i was expecting more high-end atmosphere considering a big check we ended up.", "author": "Hiro N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2006-12-28", "description": "to be fair, i've only been able to eat here when my boss has taken the company out for our holiday party, and i know the bill was extremely high.  but, we had our holiday party at this restaurant two years in a row and both times it was absolutely delicious.  the menu always changes, but there was not a disappointing moment in the entire three course meal.  if you (or someone you know) can afford it, it's worth it.  plus the view is amazing -- try going for a late lunch so you can see the sunset behind the statue of liberty.", "author": "Lily T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-25", "description": "What ambiance in this atmosphere.... you pay for it but with the price comes exceptional service, greetings with a smile and good eats!", "author": "Elisa R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-06-23", "description": "Magical - we love this restaurant. This is perfect for a birthday, anniversary or special occasion. Try to sit by the window at the water if possible. Very pricy.", "author": "meredith p."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-06-24", "description": "I haven't yet been to a better special occasion restaurant.  Yes, we know it's pricey, but it's well worth it for the right occasion.  Service was perfect, the view is legendary, and the food was great.  The only negative I could possibly come up with is that when we were there, a family came in and was seated next to us, they were all in T-Shirts and Flip-Flops.  The River Cafe is Jacket required, and I certainly enjoy \"dressing up\" to go out, but I was reminded numerous times while making my res so I found it odd that they would seat them.  But everything was wonderful and they only seemed to be there for dessert.", "author": "Andrew C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2005-11-08", "description": "Even though I am a native New Yorker, this is one of the restaurants that I always heard about but did not have the opportunity to visit. Well, this changed the other evening, and I will say that it was one of the best dining experiences that I ever had. Impeccable, but not instrusive service, wonderfully prepared food, with the million dollar view, of course! Very subdued atmosphere, piano playing in the background, very relaxing. Yes, it is on the pricey side, but well worth it. Have the Brooklyn Bridge desert, almost too nice to eat (but I did, could not finish it!). Portions are decent, not too much or too little, and the drinks, for NYC standards, are not too pricey.", "author": "Steve M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-04-05", "description": "Went here with my wife as part of our nyc wedding anniversery.  Everyone talks about the view of the river and lower manhattan.  And its true.  It is a beautiful view.  But . . . there's also the view of your fellow eaters.  We sat so close to the couple next to us that we felt like we were eating at the same table.  That would be fine if we actually knew them and had inteded a dinner for four.  But as we were two separate couples who had never met each other eanc trying to have a romantic meal for two, it was quit awkward.  Also the restaurant itself is not very becoming.  A felt a bit as though I was on one of those river boat casinos on the missippi river.  Now for the food:  my wife got the duck and the carmelized apple almond tart (I forget what she had for appetizer).  I had the diver sea scallop (that's right singular as it only cam with one scallop), the steak, and the chocolate marquis for dessert.  Niether of our appetizers were anything to write home about and my scallop was not big enough to have only one on the plate.  My wifes duck was not crispy (despite the name) and still had that layer of fat under the skin which turned her off a bit to the meal.  My steak on the other hand was the highlight of the meal.  Perfectly cooked and nicely charred on the outside.  It was really delicious.  My chocolate dessert was also nice but the apple tart was, again, mediocre.  I think this restaurant could get 4 stars if we were sitting on top of our neighbors and if the price wasn't so expensive.  For the price we paid, we expected more delicious food.  We went to several michelen-starred restaurants over the weekend and this was the weakest (Ai Fiori was nice, and eleven Madison Park blew our minds).  We will not come back to this restaurant.", "author": "David F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2007-05-29", "description": "I came here for lunch over the memorial day weekend with my mother and the views, food, and drinks were so good ! We were a smidge late because of the lovely subway, so we had to wait about 10 minutes while they cleared a table for us -- so i grabbed a drink at the bar. The Patron Silver on the rocks was soooo nice and only at 11 dollars i felt like i was robbing them. We sat one table away from the window but i dont believe it really matters, as this place is quite small and every seat is phenomenal of lower manhattan and the Brooklyn Bridge. The food was priced to what i would expect this caliber of a place would be for lunch. With plates starting around 15 dollars a plate it was more than reasonable for this NY legend. The food was really good, but i never felt that WOW factor like i have at places like the little owl and zaytinya. However this is a must if you live in NY or are visting, the ambiance alone is worth the pricetag.", "author": "Christopher T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-06", "description": "Wow... wow... wow!  A good friend of mine proposed to his wife on the limo ride to this place and told me I had to try it, so while I figured given the scenario he was a bit over enthusiastic, I went anyway.  AMAZING!  Everything from the way we were greeted to the ambiance to the food, literally everything!  My steak came out slightly undercooked and all I can say is that I could not even let it leave me long enough to be cooked a little more, it was so good, it was the first medium rare steak I had ever eaten (yes I like it a bit more towards the med / med well side, sorry, I just do).It is probably also the first time I have ever NOT sent back something that wasn't cooked to order.  Our waiter was attentive and knowledgeable and the chef sent out a few \"treats\" for our table.  Definitely request to sit by the windows, they can't guarantee it, but it is worth asking because the view is an experience in itself.  Needless to say, I am now obsessed and will be celebrating every occasion here!", "author": "Rachel G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-25", "description": "the river cafe is a great restaurant. it is right on the hudson with a great view, great food, and great service. its a great trifecta.", "author": "parker81689"}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-06-06", "description": "I always think of the \"As Time Goes By\" whenever I come here.  maybe it's because the pianist was playing that the first time i dined here.  Maybe it's because this place exudes romance for me and that song is so fitting.  Whichever the case, this place is undeniably beautiful-from great service and food to amazing views.  Surely, there's nothing that compares to watching the sunset over the Brooklyn Bridge while drinking some great wine and listening to some good jazz renditions...Whether it's to dine with parents or a lover, the River Cafe is a place that will leave an imprint.", "author": "Sasha C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-10-12", "description": "I cannot believe all the times I have never been to NYC I never went to the River Cafe.  This is the spot you take guest who have  never been to NYC and you want to wow them with the view and food.  I started with the trout which was cooked perfectly, then had the duck which was another top choice.  I ended with the cheese cake from the other reviews but should have had the chocolate cake.  WOW, make sure you order the warm chocolate cake,  I only had one bite, my companion would not share more, I totally understand why.  It's rare everyone at the table would be happy with their order but everyone was, and we all agreed it was one of our top meals in the city.  We stayed on 5th near park and the car ride home was rough with such full stomaches.  You may want to hire a car for the ride home, and make sure to leave time for a walk afterwards, get there early for drinks and to enjoy the view.  Service was top notch.  Only thing is when you have this many waiters your not sure who the main waiter is for the night.", "author": "Paige M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2006-08-19", "description": "The prices are high, the portions are small but the view is unbelievable.  If you got some money to burn don't miss this place.", "author": "Alex D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-07-28", "description": "My girlfriend and I went to River Cafe for Restaurant Week in the Winter of 2008. We both loved it.Impeccable service, delicious wine, and outstanding food. I ordered the lamb meatballs, the duck with berry sauce, and the dessert trio. My girlfriend ordered the smoked slamon with scallops, scottish salmon, and the dessert trio. We enjoyed every course. The dessert came with pineapple sorbet, a chocolate cake, and a creme brulee. We both highly recommend this restaurant. Come during Restaurant Week, great value and delicious grub. P.S My girlfiend loved the view.", "author": "mench d."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-31", "description": "Went here for Dine In Brooklyn lunch menu.  While this is no longer the hot desination of older days it still remains a special location to visit. The staff were professional with a slight but not over done formallity and although we were there for the dine in specials, as were many other diners, we never felt  anything less than being welcomed guests. Fish selections were fresh and as is proper for any seafood , prepared in a manner to enhance the dish and not overpower it.  The duck breast had a super crisp skin and was flavorful, the only improvement here is it would have benefited from a minute or two less on the grill as the outer slices were a bit overcooked. Dessert was a trio of mini offerings which covered a range of tastes and textures from light and refreshing  to the more intense and substancial.  Lastly , and most definitely a part of the meal, is the room itself.  Keeping with the theme less is more the dining area is all about floor to ceiling windows so the views of Manhattan  and passing ships can be savored.  There is clearly more drama during the sunset and evening hours, the afternoon views still offer an airy and light filled experience. Add to that the beautiful displays of flowers thoughtout the restaurant and  you almost feel like youre dining outdoors.  In fact come the warmer weather and you can have your drinks outside or dine in their side atrium for that indoor outdoor experience.", "author": "Joe B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2009-06-22", "description": "Phenomenal food and a fantastic view are in store for you!  However, food and view are not the only important aspects of a top restaurant.  If you want good service then you'll have to go elsewhere.  We arrived by TAXI and they would not allow the taxi to enter their circular drive.  So we had to walk in.  In addition, when we called a taxi to leave, we were served up a limo.  To get a taxi, one has to hail one's own by walking out of and off the restaurant's property.  Not a very nice manner in which to treat their patronage!  To boot, the wait service who took the order and served was completely stuffy and disingenuous.  My husband who never says anything ill, said \"they have a stick so far up their butts that it is rediculous\".  We were treated not with courteous regard, but rather with snooty and cold service.  For this reason, I give it only 2 stars and recommend that a nice evening is to be had elsewhere.", "author": "Marcianita R."}], "servesCuisine": "American (New)", "priceRange": "Above $61", "name": "The River Café", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Water St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/C_8aEbAvcCLhiqXn9QdWSw/ls.jpg", "@type": "Restaurant", "telephone": "+17185225200"}