{"aggregateRating": {"reviewCount": 1049, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-23", "description": "Simply awesome for a perfect night... Hands down the most romantic restaurant in NY....\n\nI was surprised that they did have vegetarian option which was reaaaaaly good. \nHad the ravioli appetizer and the mushroom entree. It was delicious...\nMy Frnd had the rabbit appetizer and steak.... Which was too good. \n\nThe service is fantastic, the food is delicious.... But it is tooo much.... I couldn't get through the desert.... We ordered the Brooklyn bridge and the soufflé ... The soufflé was highly ok....\n\nI want to return but this place is worth only a special visit ....", "author": "Kru K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-02", "description": "One of the best waterfront restaurant in the NYC. It was so good to sit  right along the Hudson River and enjoy the view. Excellent food and fantastic services！ We will definitely come back.", "author": "Lauren L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-16", "description": "I would Highly recommend this Lovely ambiance, picturesque and impeccable Service from the Front Desk  and to the  Staff especially Leigh of The River Cafe . Leigh was very accommodating and friendly on par recommendation which help us with our choices from Appertizers, Dinner and Dessert.\n\nBeautiful experience from the Brooklyn Bridge and New York Skyline.  The River Cafe place to be .", "author": "Raynille J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-06", "description": "The food here was fantastic, the wait staff was attentive, and the setting cannot be beat!  \n\nThe restaurant is on a barge at the base of the Brooklyn Bridge looking across the river into New York City.\n\nThe view at sunset would be spectacular and, if you can, I recommend taking the opportunity to walk across the bridge!\n\nIf my wallet would allow, I'd have eaten here every night of my trip!", "author": "Allison B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-16", "description": "There's always pressure for Gents to arrange a memorable evening on a day like Valentine's -- and I couldn't be happier with my experience at The River Cafe.\n\nThis place had been highly recommended to me a few times, so I set out to make reservations. Took me 2 weeks of persistence, placing a card on file, and filling out a form just in case... They're serious about their reservations!\n\nThe first details we noticed were the privately tucked away cobblestone drive-in, the attentive Valet staff directing traffic, and the well-done landscaping. Immediately sets the tone for a romantic dinner.\n\nUpon entry, staff is courteous and competent. They smile, they greet us, and proceed to seat us promptly after taking our coats.\n\nThe attention to detail on this evening was lovely. As we made our way to the main dining room, the thin corridor was lined with flowers and other decorations -- really a nice touch.\n\nIt's not until after you emerge from the corridor that you get a glimpse of the breathtaking views. A smile comes over my face as we make our way to our table. I'm already very pleased at this point.\n\nAll of the couples look fantastic, the staff is well dressed, there was a live violinist, the lighting and temperature was perfect.\n\nA glass of champagne was poured for us while we reviewed the menu. Our server Lee and his runner Shannon made a great duo. They knew just when to check-in. Not too frequently so as to smother, yet remaining attentive from an accessible distance.\n\nThe four-course meal was scrumptious. I chose the Wellington Filet Mignon and my lady the Duck. (The Duck was a better dish) Ordered a couple half-bottles of Wine, and the wine expert (the proper term slips me) had phenomenal pairing suggestions. It's probably the first time I've had a pairing suggestion be of any good use -- well done, sir.\n\nA classic night of laughs, romantic gazes, fine dining, and plenty of wining ensued all while overlooking the city skyline from what seems like an IMAX theatre view.\n\nOn our way out, the staff gifted each lady with a souvenir to take home. A nice closing touch.\n\nAll in all -- an exquisite experience! As a true service aficionado, my hat goes off to the entire team at The River Cafe. \n\nHighly recommended for a special occasion dinner of any kind.\n\nJH", "author": "John-Henry M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-10", "description": "Absolutely beautiful Restaurant. One of the most unique restaurants in all Brooklyn directly under the Brooklyn Bridge. Food is exquisite, service is outstanding.\n\nThis is one New York Restaurant I'll visit again!", "author": "Barry A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-27", "description": "Truly a 5 star experience. Came for brunch to celebrate a bday. Gorgeous \u0026 classy ambiance. Flowers everywhere. Ordered the ceviche \u0026 lobster. Delicious \u0026 filling. Pork belly \u0026 duck was ordered by bday girl. \n\nThe views are to die for!!! U dont get a skyline of manhattan sitting in manhattan. you need Brooklyn and queens for that. \n\nCocktails are so well made...lavender honey?! Yes, please! \n\nLovely experience. I highly recommend this restaurant for special occasions. Top-notch \u0026 upscale service.", "author": "S D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-07-04", "description": "Really cute environment, but food a little underwhelming.\n\nI came with two friends on a Saturday evening, and we were seated with a nice view of the river. My main entree was the monkfish, which was decent but really nothing particularly special. I tasted a piece of my friend's lamb, which was well flavored and probably a better dish. I had the souffle for my dessert, which was nice and not too strongly flavored, but overall not worthy of the price tag, in my opinion. It does have quite a nice ambiance and is great for an intimate meal in that sense, but the food just wasn't nearly up to snuff for me.", "author": "Dennis J."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-06-13", "description": "Went here for our 1st wedding anniversary.  We live nearby and have always wanted to visit. \n The view is to die for, the food is good but wasn't mind-blowing (which you'd kind of hope it was for the price).  I had a soft-shell crab app (the special) that was quite good and my lamb main was tasty, but, again, it wasn't as amazing as I'd expected.  My husband had the rabbit app and a fish dish.  Very good, but nothing to write home about IMHO.  I've had food as good at less pricey restaurants for sure.\n\nThe service was really great.  However, the cocktail I ordered off-menu wasn't quite what it was supposed to be - I wish the sommelier had made sure the bar knew how to make it.  \n\nThe crowd skews older and white - it's not a particularly hip place.  I'm glad we went so our curiosity was satiated, but I don't know that I'd feel the need to go back for a meal.  But, if you want the view then go for it!", "author": "Kristina K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-25", "description": "BEAUTIFUL place, overlooking the Brooklyn Bridge - we had a view of the Statue of Liberty.  We went for Brunch - fixed menu.  They didn't have a lot of options for my vegetarian husband but what they did have was AMAZING - a mushroom Wellington - not only did he love it, the presentation was lovely.  I have the crab and steak - I had a hard time finishing it - very good.  Service was stellar.  A beautiful day.", "author": "Laura G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-04", "description": "Celebrated my anniversary and a birthday here.  It was a fabulous evening!  We both had the chef's tasting menu and I was beyond impressed with every course.  My favorite was the scallop ceviche and the rabbit tenderloin.  The wine menu was extensive and covered wines in all price ranges.  The dessert was beautiful decorated with a chocolate Brooklyn bridge.  We had exceptional service as well.  Highly recommend this NY classic for a special night it was well worth the money.  The parking lot was hidden but once you can find it they have valet too.", "author": "Shannon K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-16", "description": "This is a place special to both my Mom and me. \n\nWe had the opportunity to dine here on several occasions during many summer months before Sandy rolled in and temporarily closed the restaurant. I can clearly say that The River Café is in my top ten memorable dining experiences. Each aspect from the valet service, to the beautiful outdoor garden that leads you into the restaurant, makes you aware that you are in for a wonderful experience. \n\nThe River Café boasts an atmosphere for fulfilling romantic and special occasions or even a corporate business lunch or dinner.  This restaurant will impress most in my opinion. \n\nMy Mom and I on many an opportunity admired the beauty of the floral arrangements decorating the entry way and throughout the restaurant, as well as the view of the luminous Brooklyn Bridge stretching over the East River leading into a wide open scenic view of the South Street Seaport...Spectacular!!\n\nThroughout our several visits, we both enjoyed and appreciated the attentiveness of the wait staff, sipped on many a glass of champagne then savored in the chefs amuse-bouches as well as a variety of different entrees that included meals of foie gras, filet mignon, lamb chops, lobster and tuna, to name a few. All of which were  served with a variety of very complimentary side dishes. And of course to end each meal there were the creative and artistic array of desserts. \n\nThe River Café is in no way inexpensive, but is one that should be on anyones must try list. If it weren't for my sophisticated, worldly and overly generous mother I would never have known how to appreciate so many of the finer things in life. She not only taught me, but so many others that had the opportunity to meet her. \n\nThis review on the 16th March 2014, is in honor of my Mom. A very thoughtful and appreciative thank you to my Mom and thank you River Café for many long lasting memories.", "author": "Pat F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-03", "description": "Unquestionably 5 stars. First there are no words to describe the view of lower Manhattan from this restaurant.  Executive chef Brad Steelman should be an Iron Chef. His food is nothing less than spectacular.\n\nWe always go for the tasting menu which often can be altered to your requests, but never disappoints.\n\nBonus... You never know who may be sitting at the next table ie: Jerry Seinfeld", "author": "Michael E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-10", "description": "My boyfriend and I love coming here for special occasions. It's a super romantic, old school kind of place. They make you feel like you're worth a million bucks from the moment you walk in. The views of Manhattan across the water are spectacular. There's always a pianist playing in the restaurant. The flower arrangements are on point and beautiful. And the food... I've never once felt bad about spending money on a River Café dinner. It's definitely a splurge but it's worth every penny. I always get the rabbit/lasagna for my first course and the lavender-crusted duck steak for my main course (which I cannot recommend enough). I usually get something seasonal for dessert (if you're there in the fall and they have pumpkin soufflé, DO IT). You can't go wrong anyway, everything about this place is divine. Enjoy!", "author": "Andreana B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-10", "description": "Amazing! The view was nice and everyone was polite. Service was great. Servers r very attentive. The menu changes seasonally. I got a tuna foie for appetizer which was absolutely delicious! Best tuna combination I ever had! A must. I got a duck for main which was good too but not like that impressive. Desserts were really good. I got apple almond tart. There's a lot of food so don't be shy to ask them to pack for to go. I didn't see anyone around me finish their food!!!\n\nTotal was abt $150 per person without drinks. What ur paying for are the view and the flowers. Great for a special celebration place. Come early so u can take ur time and enjoy the sun set bc the window is facing west. Also take time to go through the floral garden they have in the front.", "author": "K S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-27", "description": "It is fair to say that this restaurant is worthy to be a three star Michelin restaurant. Not only do they concentrate on the quality of food and the service, but also the decoration inside and outside the restaurant.\nWhen I go to a Michelin restaurant,\nI always check what kind of meat do they have. This restaurant truly provides lots of choices. They serve lobster, lamb, duck and rabbit. These kinds of meat are not very common or can not be well cooked in normal restaurants, and I tried the rabbit and the lamb. The lamb tastes pretty soft and juicy, and comes with a sweet and complex smell. The rabbit(My friend ordered it)tastes kind of fishy. I don't recommend it. \nAfter the main course, we surely asked for the most famous dessert which is the Brooklyn Bridge Cake. The sweet taste and the chocolate melt in the mouth at the same time. This surpasses many chocolate cakes in my mind. \nHowever, I only rate it four star because when I went there, they don't serve sweetbread which is an essential dish that can reflect the ability of cooking. Another reason is that the dishes lack of creation. Most dishes on the menu are almost the same style as other michelin restaurants.", "author": "Ray Y."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-18", "description": "This was THE most horrible experience my husband have ever had. We made reservations for this place  few weeks in advance for my birthday. When we got to the place they didn't ask us what we were celebrating but asked all the tables around us if they were celebrating anything. We asked to sit at the table by the window as the table was empty with no \"reserved\" sign, and they said no. 20 min later they moved a DIFFERENT party who was across from us to that same table we requested after they had ordered their food. Who does that? The food was not good at all. My husband and I wanted to leave. Due to $125 CANCELATION FEE EACH we decided to stay and pay the $130 FIXED PRICE MEAL. I was extremely disappointed on how they treated us and the food quality. If I could request a refund I would.", "author": "Mekell K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-16", "description": "Great restaurant with drop-dead gorgeous views and friendly service.  From the moment we entered the restaurant to when we left, all staff were courteous and very attentive.  Granted, you're paying an arm and a leg for a fancy dinner but we came here to celebrate our seven-year anniversary.  Anyway, reservations were for 7pm on a Sunday but we were running late and called to push back to 7:30pm. Not a problem at all! \n\nWe ordered the prix fixe menu of $115, but since we ordered drinks, etc the bill was quite hefty (about $185pp).  A wonderful meal, intimate environment, lovely company = a great night indeed.  The food was decent, but this is not for the everyday occasion, unless you make a zillion dollars.  Wonderful meal, but I wouldn't say that the entrees were absolutely divine.  We left around 9:30pm and the restaurant actually got MORE crowded on a Sunday night with people being seated as we were leaving.", "author": "Linna F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-01", "description": "This place is special.. the food is worth the price tag ($150 pre fixe), the view is quite pretty, and the service is fantastic. They give you a chair for your handbag, that says it all, lol.  It's an excellent choice for a special occasion. \n\nThey do a great job putting together fairly normal dinner choices like scallop, lobster, by adding some culinary genius flavoring magic to amuse your taste buds.  Such attention to detail and presentation! Seriously the food taste as good as the pictures look.  I was trolling Yelp prior to my dinner trying to figure out what to get, but really, just order what YOU like. If you want to eat lobster, you damn go ahead and get the lobster. There is a tasting menu option, which is a great choice the seriously undecided for just a bit more than the 3 course menu.  \nFor apps, I loved the scallops, but don't care too much for foie gras. The lobster main course was very good. Portion sizes are just perfect so you don't feel disgusting after all 3 rounds.  I must say though, dessert was hands down the best course.  The chocolate/raspberry bridge was very good.. but as soon as I tasted my pistachio dessert, I hardcore fell in love.  That was the most unique and wonderfully paired dessert I've ever had!!! I'm just salivating thinking back.......  Sigh! Other than that, I really enjoyed my expensive but delicously crafted cocktail (I got the floral one, sorry forgot the name!).  \n\nI would definitely come back here to celebrate a special occasion.  How romantic would it be to be proposed here?? Guys in serious relationships, take notes here! It's a beautiful, classy and upscale place. Valet parking and twinkling lights outside the garden. Totally in love! Highly recommend.", "author": "Christy L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-25", "description": "Reservation via opentable for a Friday evening.\n\nCoincidentally I had reservation here during my last trip and didn't go.  Instead went into some pizza joint called Grimaldi's (Juliana location)...\n\nThat time it worked out very well because Girmaldi's was Amazing and I was oblivious to the dress code at River Café.... dressy and jacket required for men.  FYI if you forget or don't have a jacket they will lend you one.\n\nThis is a spot where I wouldn't be surprised that the food would be sub par as its all about location.  Well am I wrong thinking that as the service is great and the food was surprisingly Very Good!\n\nAppetizer - Duck Foie Gras two ways.  Very nice portion, enough to share!  \n\nMain - Steak cooked at a perfect medium rare.  With bone marrow mashed potatoes, Awesome!!\n\nDesert - Was so stuffed but ordered the Soufflé.  \n\nAwesome dining experience and this dinner left me very satisfied on all levels.  This was actually a much better culinary experience than my recent visit to FL.\n\nNote the men's restroom looks so small it appears to be for a single but can accommodate 4.\n\nWhen you make a reservation request a window seat or a table with a panoramic view.\n\nThe bar is very small but the patio just outside the bar via glass door leads to one of the Best Photo opps of the BB!!", "author": "John C."}], "servesCuisine": "American (New)", "priceRange": "Above $61", "name": "The River Café", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Water St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/C_8aEbAvcCLhiqXn9QdWSw/ls.jpg", "@type": "Restaurant", "telephone": "+17185225200"}