{"aggregateRating": {"reviewCount": 1049, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-04-03", "description": "While browsing the list of restaurants participating in Dine in Brooklyn, I saw that the The River Café was offering a 3-course lunch menu for $20.12, which is an incredible deal. Being me I had to view the website to make sure that the special menu was decent and not some crappy menu that they put together. To my surprise the menu was not only decent it was beyond my expectations. I went ahead and made a reservation for lunch.  \n\nThe day finally came and I was all excited to have lunch at The River Café. Entering the restaurant, there's the scent of fresh flowers, there's the staff all dressed in white suits, and there's the view of Manhattan during daylight that creates such a wonderful atmosphere. In case you're wondering about the dress code, people around us including ourselves were dressed business casual. For lunch at least the dress code is not as strict. Now on to the food:\n\nAppetizer \n1. Lobster miso consommé \u0026 dumplings (http://s3-media1.ak.yelpcdn.com/bphoto/1Bnt0Od7bjU4TRE_3ISVRg/l.jpg), with mushroom and lobster dumplings, dashi cured shitake mushroom, fresh soybeans, and dusted miso powder. I like the Asian twist to this dish, it's cute and it works.\n\n2. Wild fluke \"tiradito\" (http://s3-media3.ak.yelpcdn.com/bphoto/GKcVKw8PFpsk_KDaEWlwzA/l.jpg), with citrus-soy ponzu sauce, fresh hearts of palm, pickled chilies, and crispy plantain. I love the presentation this dish and how it was executed. The fluke was wonderful.\n\nEntrée \n3. Tender beef short ribs (http://s3-media1.ak.yelpcdn.com/bphoto/jy9IDHJxM8I4BqSSE-rCXg/l.jpg), slow cooked in Barolo red wine, creamy polenta, braised red cabbage, and roasted carrot baton. This dish was so tender with the right amount of flavor. \n\n4. Grilled cobia fillet (http://s3-media4.ak.yelpcdn.com/bphoto/xVwocBNb0QiEiYTrl3XTGA/l.jpg), with grilled zucchini, broccoli rabe, red pepper, and aged Villa Mandori balsamic vinegar. The fish and vegetables were perfectly grilled and lightly flavored. \n\nDessert\n5. Tasting Dessert Trio (http://s3-media4.ak.yelpcdn.com/bphoto/MvFHk_ilH5jl-2Zkhw9RqA/l.jpg), dark chocolate marquise cake, tahitian vanilla bean brulée, and coconut \u0026 pineapple sorbet. What a lovely presentation of all 3 desserts. I loved every one of them.", "author": "Jin Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-24", "description": "Old-school fine dining.  Great location and view of the Manhattan skyline (hello 1 World Trade Center!) The ambiance was sophisticated and everything we ordered was delicious.", "author": "Sydney S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-10-21", "description": "I'm not sure what I did to deserve her, but my girlfriend took me to the River Cafe for my birthday. I arrived early and enjoyed a good martini at the bar, admiring the gorgeous sunset.\n\nBarkeep: It really turned out to be a beautiful night.\nPeter D: Yep.\nBarkeep: This is what Jesus was talking about.\nPeter D: I actually wasn't there that day. But that water into wine thing is quite the party trick. \nBarkeep: Yep.\n\nWhen my girlfriend arrived, the maître d' led us to a table in the back. As we contemplated the menu, the guy seated behind me got down on one knee. It was terribly romantic. Until he got to the part about \"...love of my life, blah blah blah...\" \n\nAt which point I was forced to interject, \"Hey buddy. I'm trying to have a birthday dinner over here. You're kind of stealing my thunder. Wrap it up.\" \n\nAnyway, I'm pretty sure she said yes. I mean, everyone in the place clapped afterward, but I think they were just glad it was over, so they could get back to celebrating my birthday too. \n\nI started with the foie gras laid over a caramelized apple and brioche \"French Toast.\" It was rich, buttery and delicious, and a surprisingly large portion, unlike her lobster ravioli special. Served with butternut squash and a pomegranate sauce, her appetizer was also well-executed, but with only three tiny ravioli, it was a bit disappointing. \n\nFor my entree, I went with the sirloin, medium rare, which my waiter was very enthused about. Perhaps because it costs a bit extra on top of the prix fixe. The steak was served with a red wine mushroom marmalade that I could've used a bit more of, and a russet and sweet potato gratin with bleu cheese fondue. The side came in the sort of dish that escargot are served in: solid with tiny holes for each snail (or little potato gratin thingy). Bleu cheese and beef has to be one of the best pairings on this earth; the dish was excellent, although not mind-blowing.\n\nHer branzino, on the other hand, was freaking sensational. Stuffed with chorizo and shrimp, the fish had an incredibly crispy top layer that made each bite a delight. It was flaky and juicy and exploding with flavor, all at once. It was the clear winner of the night. If I were to return, I think it is the only dish we would order again. This includes the desserts; both the apple tart and the Brooklyn Bridge chocolate creation were solid, but I didn't feel the need to finish either. \n\nThe price tag at the end of the night is fairly steep, but remember guys: that doesn't mean you owe her anything.", "author": "Peter D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-20", "description": "I wouldn't say that there's anything unique about the ingredients but food was cooked and prepared perfectly, just a little bit boring. The uniqueness is definitely in the location not the food. This is a solid five star place, they handled the wedding very well. Very well-managed given the amount of people, the kitchen handled everything very well. (I don't give 5 star reviews very often!)", "author": "Wrex T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-04", "description": "It's as good as it gets.  The Best restaurant in NYC is in Brooklyn.  What an amazing evening we had.  The food was incredible, the staff--I wanted to hug goodbye.  It's so nice when you feel so welcomed in a place--you can see and feel it in the room.\n\nThe cafe is small, food is wow, and views are INSANE.  Funny to see locals taking photos of nyc, but we did too.\n\nLOVE LOVE LOVE", "author": "Nancy E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-12", "description": "Upon arrival for dinner celebrating valentines, there was no wait at all for a table-- need reservations! The service was wonderful, was always attended whenever and the booth seats were really comfortable where I was able to sit next to my love instead of across. They do that so you can enjoy the SPECTACULAR view of the NYC skyline and Brooklyn bridge! FOOD WAS ON POINT! From appetizers entree dessert... HOLY SNAP THIS WAS ROMANTIC yet deliciously worth $$$$! Thinking of going in summer again for brunch!", "author": "Jerry H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-21", "description": "Beautiful restaurant with fresh flowers and an impressive view. Excellent service. Food is amazing 10/10. \nThe only reason I didn't give 5 stars is because of their dress code. \nMen must wear a suit jacket to dinner. \nAs my husband and I are travelling he didn't have a suit jacket so receptionist kindly allow people to borrow a jacket in this situation. The restaurant was very warm inside and quite stuffy, my husband took off his jacket and was asked to put it back on immediately. My husband was bright red in the face, hot and uncomfortable. \nIt is ridiculous that you should pay that sort of money to eat here and sit in a sweat suit against your will! \nAnyway, other than the suit jacket.. Amazing place", "author": "Sheena D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-10-11", "description": "Service was great but food was ok. Not worth paying more than $150... I paid about $160 with one drink.\nIf you could sit by the window, it's 4 stars... yes, its worth paying  more than $150. If not... paying same price sitting by the wall? Not worth it... The restaurant should change the price window side or wall side  as it will be completely different experience.  I sit all the way back near by the wall and I barely see the nice view... Being honest, this restaurant is for service and nice view...  you can eat much much much better food if you pay about $150 in Manhattan. Next time... I will make sure I can get window side sitting otherwise...I wont come back again.", "author": "M M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-17", "description": "I cannot imagine a restaurant anywhere with better views of Manhattan than this one. Amazing.\nThe food was very good...just not much of it. The shrimp starter plate was excellent and probably my favorite part of the meal. The lobster main course was also very good. My friend got the steak and it was a huge portion. Every other entree was very small. The bill ended up a lot higher than expected. Because of the high quality of the food and the top notch view, I will give them four stars, but I walked away not feeling the value.", "author": "Matt H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-22", "description": "This is one of my favorite restaurants. We got married here 9 years ago and we try to go every year for our anniversary. \nThe ambiance  is timeless and classic... The food and dessert are fantastic. \n\nOne minor detail I ordered the grilled octopus for an appetizer and it was a little undercooked for my taste. The rest of the meal was exquisite and the desserts are decadent. The service was phenomenal as usual... I would 100% recommend that you experience this restaurant!", "author": "Mia C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-05-23", "description": "Hate to do this but it's not worth the money. We didn't get the window seat we requested. Service was not friendly at all. I paid $125 for two pieces of shrimp and 3 pieces of chicken. I left hungry. Enough said", "author": "Jacqui Q."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-01-28", "description": "The food was fine, the venue was great, the experience was going very well until the Captain made an overt act of looking for the knife rest that should be at each place setting but we had three diners and only two knife rests at our table.  He just about accused us of stealing the third rest which was never at our setting.  We felt uncomfortable for the rest of the meal.  If these rests are so precious DON'T include them at the table.  WILL NEVER RETURN.", "author": "Sharon S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-11", "description": "The River Café is another coveted and highly sought after reservation in NYC. My gf and I tried to come here for lunch during Restaurant Week, Summer 2011, but were unable to get a table for two. However, tables for three were available, so we invited a friend along. So, be sure to book early.\n\nDue to the location of this restaurant, I'd suggest driving or taking a taxi. The A or C train does stop at High Street, but it's still a bit of a walk to the restaurant. In our case, it was especially good that we drove, as we had dressed nicely for this lunch and it was probably 95 degrees out that day. There was no way we'd have made the trip from Columbia's medical campus on 168th Street to The River Café by subway without arriving as a giant ball of sweat. Just be careful for their driveway tho. As I was 3/4 of the way up, some old guy decides he's going to try and pull out and squeeze by me. The valets kept waving me forward, but our cars were so close to each other and the old guy refused to back up... I was really nervous, but we squeaked by each other.\n\nAnyways, upon walking through the entrance, you're immediately swept into a very classy and upscale environment which is a direct extension of the cobble stone courtyard through which you enter. There is a little bridge that leads you into the main dining room, which sadly doesn't really have much decor or ambiance and is painted in this dull yellow-ish paint, with air ducts and ventilation shafts hanging from the ceiling. A lot of the lunch patrons were very casually dressed too, in shorts, t-shirts and jeans. I was a bit surprised, especially after reading that jackets were required in the main dining room for dinner, but not lunch. However, the view that you are afforded during lunch (and this must count a whole lot more at night during dinner) makes you forget a lot of those little things about the decor and ambiance of the room.\n\nWe were given a great table tho - right up on the windows, with great views of the Brooklyn Bridge and Manhattan. Upon being seated, our drinks orders were taken by a gentleman wearing a jacket and tie. He looked as if he'd been working here for a long time. For our appetizers, I had the Shrimp Dumplings with Lobster Consomme. The broth and dumplings were warm and flavorful. Nothing bland in this dish. My gf had the Fluke Tirado, which was also quite good. The sauces that it came with did not overpower the raw fish. Our friend had the Lamb Meatballs, with a peppercorn gravy and potato puree topped with a chip. The meatballs had a familiar flavor, but were hearty.\n\nFor our main courses, my gf and I had the Swordfish Paillard, while our friend had the Crispy Duck Breast over polenta. The swordfish was quite good and well plated but familiar in its presentation and taste. Our friend really liked her duck, tho I've never been a huge duck fan. I'll eat it, but find it to be a bit gummy compared to other meats.\n\nDessert was the same all around - a Dessert trio of Creme Brulee, a blueberry tart, and a scoop of strawberry ice cream (from the Brooklyn Ice Cream Factory) with graham crackers. All were quite good, tho the blueberry tart had a bit much pastry and crust on it.\n\nThe service was always polite and attentive. The food here looked very simple, but was delicious and well plated. You could tell that despite its simplicity, a lot of effort went into preparing it.  This would be a place I'd come back to for dinner if celebrating something. That night time view just makes you want to swoon...", "author": "John-Paul P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-27", "description": "I went with my girlfriend there for our valentines dinner. Food: it was just fine comparing to other American restaurants. Actually I didn't expect a lot on the dishes. Service: good. Ambiance: that was the primary reason we there for. Wonderful view.  Great place for wedding party.", "author": "Sardorsy L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-16", "description": "Random thoughts: Beautifullllllllll view.... The waiter was on point... Drinks were good.... Really romantic.. The food was great...The prices are just really high our food came to about $321... I nearly broke my ankle in the front on that cobble stone (ladies no 6 inch heels) ... Suit jacket required for men.. Good for Anniversaries ... Birthdays.. Proposals etc", "author": "Tonya B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-12", "description": "I think The River Cafe is the most romantic restaurant in NYC.\nI had the  rib\u0026lobster and it was probably the best I've ever had.", "author": "Hitoshi I."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-08", "description": "I kept putting this review off, so I don't think I can write a detailed review about each individual dish despite being here twice. However, I can tell you that you have not had an authentic River Cafe experience if you do not try the chocolate Brooklyn Bridge. It is delicious!\n\nAlso try to get a window seat if possible. What a great view. This is a very classy and romantic spot so if you a looking for a special place, this is it.", "author": "Shell L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-25", "description": "I had an amazing time here. I came here about a year ago and I'm writing the review now because I recently got on yelp but that doesn't change all the great things I have to say about this place! From the ambience to the food to the service, I have nothing but praise for this restaurant. The view is beautiful since it's right in Brooklyn Bridge Park and the restaurant itself is beautifully decorated with a nautical theme. The little garden in front of the restaurant is a great place to take pictures (perhaps not at night because there were mosquitos). \n\nThe service here is top notch, they come around with a bread basket every now and then in case you wanted more bread. They come across and sweep off all the crumbs after every course. We opted for the 3 course set menu and everything on the menu seemed amazing. From their menu at the time, I started with the fried oyster wrapped with smoked salmon topped with caviar and my date got the grilled octopus. Both dishes were full of flavor; I especially liked mine, everything complimented each other very well. For our main courses, I had the steak with mashed potatoes in bone marrow and my date had the lobster. The steak was melt in your mouth good and the mashed potatoes were the best I've ever had (even to this day). The lobster tasted very fresh and it came with a sauce that tasted like corn which completed the dish. In between the entrees, the amuse bouches were watermelon with feta and a tomato soup. Both were very yummy. For dessert, I had a pistachio semifreddo and it was absolutely delicious. What really wowed me was the other dessert we ordered, the Chocolate Marquise Brooklyn Bridge. It was literally a chocolate Brooklyn Bridge. It looked amazing and tasted just as amazing. The chocolate was rich but not too sweet since it was a mix of milk and dark chocolate. In the end, they even brought us some complimentary treats. \n\nA wonderful experience and I would definitely go back often if I could. I would definitely recommend this place for a special occasion.", "author": "Xiuna L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-01", "description": "Classic New York. Unbeatable views. Enchanting environment with great history. Top-notch food with perfect portioning. What's not to like? Prices may be a little steep for some, but if you've been a consistently quality fixture in the NYC restaurant scene since the 70's, you've earned the right to charge whatever you want.", "author": "Remington T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-11", "description": "Simply amazing place. Went to brunch here with my friend for some \"catch-up\" time brunch. The service was down right perfect. The food - forget about it. Truly amazing; can't wait to take my husband here for dinner. It's worth every penny and then some - MUST GO!", "author": "Jessica M."}], "servesCuisine": "American (New)", "priceRange": "Above $61", "name": "The River Café", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Water St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/C_8aEbAvcCLhiqXn9QdWSw/ls.jpg", "@type": "Restaurant", "telephone": "+17185225200"}