{"aggregateRating": {"reviewCount": 258, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2019-03-14", "description": "This place is not terrible, but not great either. \nI have been a few times for the lunch special. The food they give is pretty filling I must say. \nThe service is just alright. I always feel rushed when I am there. They rush to get your order, your food comes out fast (this is not really a complaint), and when you're on your last two bites they already have your check and a fortune cookie on the table for you. The service is like this even when it is not busy.", "author": "Diamond P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-05-07", "description": "I wish i could give this place no stars. I ordered from here I got chicken and broccoli which was 80% rice and 20% chicken and broccoli. The food had no flavor. \nI also got food for my coworker which was mainly rice. On top of that the delivery boy was extremely rude. He demanded me to tip him, who does that ??\n\nI will NOT be ordering from here again", "author": "Shabnam D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-19", "description": "This place is so fast and sooooo good. We started Game of Thrones immediately after we ordered and received our food 8 minutes into the episode. This place is an every Sunday delivery tradition now.", "author": "Madison C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-05-05", "description": "Delivery (using seamless app) was SO fast.  Had my Order within 15-20min of delivering. Food was still super hot and delicious. I've never had dumplings like these before- I ordered them steamed and they were so \"dough-y\" and good!", "author": "Lindsey D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-01-22", "description": "***Delivery Review***\n\nFriday night, looking for something quick/filling in the area that delivers. Basic Chinese takeout menu with a large list of options at slightly higher than normal prices.\n\nKept it simple and ordered the General Tao's Chicken with brown rice ($14). Food came in about 20 minutes - accompanied by various sauces, utensils, and even plates. Chicken itself is okay; a good amount of tang in the sauce yet a little too much breading. Broccoli soaks up the sauce as expected (didn't touch the brown rice).\n\nIt's about what I expected from what I ordered. Good if hankering for your typical Chinese takeout/delivery.", "author": "Shaji K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-04-18", "description": "I've ordered from here 3 times now and I can say that they get the job done. No more no less. Nothing special that I've noticed so far just your run of the mill Chinese take out (or dine in) joint. There low mein was pretty drenched in oil which was a huge turn off for me. Flavor is one thing but to completely drench the food in oil is not too satisfying. I will more than likely order here again, but that is because they're extremely close to my work and I don't want to waste time walking else where or standing in long lines. The staff are friendly too so it's nothing against the owners/management. The chefs just need to learn how to cook the food better. Will follow up if I see any changes.", "author": "John C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-02", "description": "The four stars is for the food.\nThe food is amazing here and they are fast. The food isn't greasy and its one of the best wonton soups I have had. They give you fried noodles and dip to eat. Their menu is small compared to your generic Chinese food spots. It makes sense though. Small menu means better food. YOU MUST ORDER THEIR SCALLION PANCAKE!!!\n\nThe staff is always in a hurry and a bit rude. They don't take kindly to strollers but we made it work.", "author": "Georgia N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-24", "description": "Stopped by here last night with a friend from out of town.  My favorite vegan spot on Montague (please don't ask me the name; it's morning) was closed (!!!) last night.  Lichee had veggie options on the menu, so my vegetarian friend wanted to check it out.\n\nWe got the window seat - yay! - but I don't see myself doing that when it gets cold out, unless they crank up the heat during the winter.  Staff was friendly and attentive; restaurant and restroom was clean.\n\nThe steamed veggie dumplings were tasty, but way too heavy on the dough, so I didn't finish them.  The shrimp fried rice was the best I've tasted in a very long time, so I could see myself going back there, just to get that.  Overall, great experience, Montague-street prices.\n\nI deducted a star after I read another writer's review that she got fried noodles before her meal - we did not.", "author": "Zenzele B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-27", "description": "So after driving around DUMBO in circles, trying to decide where to go after slowly realizing that it was pretty much slim pickings, we found our way back to Brooklyn Heights. \n\nWhen you're starving, the last thing you want to do is dine in and wait for your order. Surprisingly, our appetizers and entrees were delivered relatively quickly. I had the white rice with broccoli in garlic sauce alongside a side order of wings. Delicious! \n\nI'm all for great wait service, but it's a little difficult to enjoy the meal and ambiance when the staff is standing near the opposite wall and staring at you. It's okay to periodically glance over, but staring intently is a major no-no. My glass of water will not magically vanish, prompting a refill anytime soon so please feel free to tend to other diners or employee area.\n\nI always feel more at ease whenever I can glance over and watch the employees dine in on their break. It is great insight into the work culture and quality of the food.", "author": "Kristia B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-14", "description": "What you need to know: \n- This is my friend's 7-year old daughter's favorite Chinese restaurant in NYC, so I decided to give it a try. \n- Clean interior \n- Accepts credit card \n- Excellent location in Brooklyn Heights - you will be paying more than other Chinese restaurants. \n- Offers free fried noodles with sweet dipping sauce - what is this??? Only in a Chinese place in Brooklyn Heights, if you get my drift! \n\nWhat we ordered:\n- Shrimp with broccoli price $14.95 - the shrimp was horrendous, it tasted like rubber. However, their special brown sauce was good and the broccoli was cooked well. \n- General Tao's chicken $13.95 - this was shockingly good! It was crispy, juicy, and coated in sticky sweet sauce - everything General Tao's should be!\n- Roast pork lo mein $9 - this was a pretty solid dish.", "author": "Karen L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-12-22", "description": "This review is only for their takeout service. The prices are slightly more expensive compared to other take out Chinese spots. However, the food is solid and their service is great. The food always arrives early and they have never made a mistake on any of our orders. I love how paper plates, forks, napkins, and sauces are always provided for us in little zip lock bags- ensuring that sauce from the foods will not spill on any utensils. I would say this is probably one of the best Chinese take out options if you live around the area and are looking to order for delivery.\n\nChicken lo mein- Pretty standard. Not overly greasy like some of the other dishes. I would recommend ordering this.\n\nSpring roll- Delicious and fried perfectly. The outer layer has the texture of  spring roll, but the inside filling is like an egg roll. Pretty interesting. \n\nScallion Pancake- I would not recommend ordering this. The scallion pancake was too doughy. Tip: never order scallion pancake for take out, it needs to be eaten fresh.\n\nMinced Chicken Corn Soup- A must try! I order this every time! \n\nBeef with mushrooms- Delicious, their beef is tender and not tough at all. However, the sauce is very greasy.\n\nWhite rice- The rice here is not that good... It's too hard. \n\nAs with most take out spots, the sauce can be very greasy! If you are health conscious, then I would say: steer clear. However, if you appreciate well fried crispy spring rolls and saucy food, this place has pretty solid take out.", "author": "Qi G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-12-31", "description": "Good classic American Chinese comfort food. Expecting something more than this then go somewhere else.", "author": "Disco .."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-05-20", "description": "I've had many experiences at this place during my lifetime.\nFirst experience: used to work in the area. This was my go to Chinese Food restaurant. I used to dine frequently that the original owners knew who I was and always greeted me with hi how are you and a big smile. Back then I loved and ate everything on the menu; my fave was the Shrimp in lobster sauce. The egg rolls were to die for: crispy and a nice portion \nSecond experience and third, fourth etc. I used to live in the area on Orange Street. Good times good food.\nMy last experience: 5.16.18 the dreaded Jury Duty\nI passed on a case that would have lasted 5 weeks due to work, etc. Well I wasn't released early and they gave us 1 1/2 hour lunch break. Not long enough to walk to Carroll Gardens and pouring rain so I visited Lichee Nut. Nothing has changed in 20 years but the food. Yes there are lunch specials for $8 that offer a variety of options and a choice of soup or iced tea. Very cheap but the food shouldn't taste cheap.\nI was seated in the back literally next to the employee punch clock dated 1941. Why would you place that near a patron?????\nImmediately handed a menu and one minute later waiter appeared to take my order. Uh not ready?\nI was given the complimentary crispy noodles and duck sauce. The two stars are for that and that alone. They were delicious and surprisingly not greasy. I ordered chicken with black bean sauce and brown rice.\nWell surprise surprise I was given brown rice in black bean sauce. The chicken? Miniscule  diced\nChicken bits? Bites? Dots? No taste, watered down black bean sauce glop. I also forgot the one ingredient Lichee pours on: the dreaded celery. Yuck!\nThere are swinging doors like in an old western saloon you push to get to restroom.\nI took no pics because there is nothing worth capturing.\nHey Brooklyn Heights neighborhood you deserve better Chinese Cuisine. Saketumi is a step up, Andy's was meh.\nIn summary, if you want to dine in tasteless cheap Chinese food this is for you.\nSo sad.", "author": "Fawn G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-05", "description": "I think this is a better than average Chinese place. It's slightly more expensive, but consistently tasty...and lightening fast! We always choose the cold sesame noodles, General Tso's Chicken, and the pork fried dumplings. We always love it! One tip, and this seems to be more so lately, the General Tso's isn't that spicy. Best to spice it up a bit if you like it that way. \n\nWe have also enjoyed the moo shoo pork and scallion pancakes.\n\nRecommend!", "author": "Benjamin C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-02-01", "description": "Very good Chinese food.\n\nSoups are very good.  Noodles are excellent.  \n Chicken,  beef, shrimp dishes have been strong. Like any local restaurant... have to try different dishes to see which ones are you're \"go to\". Fried rice is solid. \n\nEgg rolls and dumplings .... hit the spot. \n\nMy experience with the restaurant staff at counter and  delivery service  is very good  ( + order is always correct).  If in the neighborhood go if you want above average Chinese food. .", "author": "T A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-11-28", "description": "The food is good, but I think the lunch special delivery is a bit rushed. They always tend to dump the rice on top of the dish. and delivery guys are usually not polite.", "author": "Mo G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-22", "description": "We order from Lichee Nut about twice a month. The food is always reliable and the delivery time is FAST. I'm pretty sure their kitchen must be in our closets. \n\nIf you're looking for satisfying Chinese Food , nothing over the top......this is an A +.", "author": "Thomas Q."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-11-29", "description": "I was so disappointed in their dumplings. The vegetable steamed dumplings had way too much dough and the inside didn't taste good. The fried pork dumplings tasted a little bit better so I was happy to eat those.", "author": "Lo N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-08", "description": "Great spot for Chinese! Actually went in and sat down and the wait staff was very attentive. My food came out fast and it was delicious. The wonton soup was great and served hot, and my entree was beef with broccoli and prepared perfect.", "author": "Deborah A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-11", "description": "Good food, bad attitude from cashier. Some of the staff aren't very welcoming. \n\nIf you can get over that, they serve good food without the MSG. So for people who enjoy casual Chinese but have an intolerance to MSG, this is the place for you. \n\nTheir iced tea by the way is the Lipton powdered iced tea and a lot of their stuff is pre made, so don't expect to customize your rice without veggies", "author": "Jonathan M."}], "servesCuisine": "Chinese", "priceRange": "Under $10", "name": "Lichee Nut", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "162 Montague St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/Nbj71pbUDGJsWDDhrQuo8A/ls.jpg", "@type": "Restaurant", "telephone": "+17185225565"}