{"aggregateRating": {"reviewCount": 258, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-11-28", "description": "Horrible food. Large portions of poorly cooked scraps.\nGeneral tsos= all coating, hard as a rock, covering shreds of dark meat turkey maybe? \nGinger shrimp= frozen tasteless shrimp mixed with pickled ginger from sushi place above they most likely own\nEgg roll = after removing from wax paper yellow grease poured out from the shell. Gross.\nWonton soup=broth tasted like dirty dish water\nMu shu chicken= pancakes were dry, unable to separate \nPork lomein= tasteless, hard to eat thick gummy noodles. So bad.\nNever again.", "author": "Malcha R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-10-29", "description": "My first impression of Lichee Nut wasn't great. They've got a B health rating, and in an affluent neighborhood like Brooklyn Heights where you expect more, that's a bad sign.\n\nStill, my family was set on this place for our mini (7 people) family reunion lunch. So we went. It was actually a pretty tasty time, but the service could use some help.\n\nWe ordered several dishes to share including the sesame chicken, shrimp in garlic sauce, schezuan beef with broccoli, and chicken and broccoli. All were very flavorful.\n\nMy qualms are with the service. At first they were inattentive (i.e.: it took 3 tries to get water for the table), and then somewhere mid-meal they became overly aggressive (i.e.: hovering over us and taking plates away before we were finished). It's not as if we were rowdy or stayed a long time. We must have been there no more than an hour -- and there were plenty of tables open for other guests. \n\nBetween the health grade and the service I don't think I'll be back.", "author": "Shannon G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-09-30", "description": "Extremely rude staff! Food quality is poor. Zero focus on customer experience, zero personality from host or waiters. Very sad, for such a great location to be occupied by such a horribly run business.......Enjoy!", "author": "E B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-08-24", "description": "Nothing against the people who work here who were extremely friendly but the food is awful. The meat tastes like very poor quality and it's just not good at all.", "author": "Jamie G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-12-06", "description": "ecccck greasy-tasteless-breaded syrupy-sml portions-eccck", "author": "Charles B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-17", "description": "This place is near to my workplace and they provide lunch deal with reasonable price. It's definitely the best lunch restaurant on my list. And they offer  tea and snacks when you dine in. For me, the interior decoration and the customer service perfectly portrait the authentic Cantonese dinning style. Love this place", "author": "Thisby C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-16", "description": "For a Chinese spot in Brooklyn the food is prepared fairly well. I ordered a hot and sour soup, hunan meat house special and bubble tea to be delivered. The fact that they let me pick how spicy I wanted my food was a huge plus. When the food came it was delicious. Hot and sour soup was very light and lad plenty of tofu. The hunan chicken didn't look like mystery meat and there was an even amount of meat and vegetables. As my treat I enjoyed the pineapple bubble tea. I wouldn't recommend the pineapple flavor but everything else was great.", "author": "Tamara T."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-09-07", "description": "When you arrive into the restaurant, you get an authentic and un-renovated-for-years feeling. The workers are actually nice and speak Chinese!\n\nI ordered the sweet and sour pork, while my friends ordered and shared scallops and fried shrimp. We also got some pork buns, and they were delicious. However, the sweet and sour pork was atrocious. It tasted like they literally put the pork in the microwave for like five minutes, and served it. However, it was not hot or warm at all. The sauce was red with too much food coloring. The scallops and shrimps were hot, and it was mediocre. \n\n2 stars for the horrendous food.", "author": "Ling M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-02-10", "description": "I wanted to give Lichee more than two stars, but I haven't had great experiences there recently.  I usually get take out from Lichee.\n\nThe food can be pretty decent if you are looking for standard Chinese food dishes. However, I have had a few experiences where I was disappointed with my food because it was obvious that they seemed to mix the sauces of two different dishes I ordered (eg. I ordered 1- orange chicken dish and 2- a broccoli and tofu dish in brown sauce, but both of my dishes tasted like orange chicken). I don't want all my food to be in the same sauce if I order different dishes. \n\nThe service is meh and pretty unfriendly, but fast.", "author": "Pearl W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-21", "description": "Lunch special here is very inexpensive for the area. They give you a whole pot of tea , your choice of soup, and an entree. I had the chicken with broccoli which was good with veggie lo mein that I had to add a bit of salt on.", "author": "Lynnette V."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-05-19", "description": "Ordered here the other evening - whist delivery was super quick... the food was rather lackluster. We ordered dumplings that were stodgy and very doughy with a rather tasteless filling. Vegetarian Moo Shu vegetables - which were dry and void of taste and a Sweet and Sour Chicken dish which was the highlight of the meal - a low highlight!\n\nGive this place a miss", "author": "Matt D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-25", "description": "Great neighborhood Chinese spot!\nNice sitting area and fast delivery!\n\nA few times they didn't make it as spicy as I requested but hey that's what Sriracha is for.", "author": "Raul H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-07", "description": "Ordered from here many times and the food is absolutely delicious. Their lunch menu is such a steal.  You can get a filing meal for $7. The unit reason they get 4 stars is because the couple of times I've eaten in,  their service cam feel a bit rushed. As far as dishes go,  I recommend the General Tsos and the peppersteak.", "author": "Garynn N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-25", "description": "Delicious Chinese food with generous portions. Friendly staff. Additionally, if you have your own cell phone charger, the staff has a special charging station behind their desk. You can charge your phone while you eat and do not have to worry about someone taking your phone. \n\nMy new favorite Chinese restaurant in the neighborhood.", "author": "Krista G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-02-11", "description": "Lichee Nut should change their name to EXPRESS Lichee Nut- they are so fast I commend them on their speedy service!\n\nAlthough I enjoyed the fast service, good flavorful food, large portions and convenient location downtown Brooklyn.\n\nMy Mom and I had a pretty large spread:  A seafood platter, Chicken wings, beef fried rice and chicken lo mien. We had to take the rest home because we could not finish it in one sitting.\n\nOur table was so packed I caught a couple people looking at the two of us with wondering eyes\" how are the two of them going to finish all that food?\"  But I eat what I could enjoyed my wings and beef fried rice and avoided the stares and took the rest home. \n\nGotta love the fact there are takeaway bags!", "author": "Sheri S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-02-28", "description": "Great place. Love their food, been here a few times and I liked it. However the servers rush to take your orders and they also rush to give you your check. They need to slow down a little, give customers some time to look at the menus and also eat their foods. Geshhh. Other than that, love this place", "author": "Jannaia A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-10-18", "description": "This restaurant is a hoax. TERRIBLE food. Do not go here or order from here. Nothing is good. Everything is pretty much tasteless. It doesn't event deserve the modest 3 stars it has.", "author": "Jeremy G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-05-09", "description": "I decided to try this spot out after many rave reviews from a friend. I was completely underwhelmed. The food was below decent. I've had better Chinese food at small walk in/take out restaurants in worse areas, at a way better price. To start off my bad experience I walk up to the host. I order a garlic shrimp with egg fried rice. The price on the menu is 13.95, the lady says 16 and change. I ask is there any juice with that. She states no, that's the price with tax. All in a rushed tone. I then ask her what kind of juice do they serve. She tells me they don't have juice. I ask if they have iced tea, she shakes her head all while looking down at a paper she's taking orders on. I ordered the iced tea. I ask if I can sit anywhere. She asks me if I want to sit down, I tell her yes and motion over at the empty chairs. She calls out to one of the servers and starts screaming in mandarin. Then she tells me if I'm going to sit I \"have to tip.\" I say of course! The audacity of this rude young lady. I had a few tips I spared her. Now to the bland shrimps plated in a drenched garlic sauce with big slices of onion and chopped green pepper. It was half decent in taste. The egg fried rice was ok. It was warm, not even hot. The iced tea was watered down. I finished the rice and picked out the shrimp from the garlic soup of a gravy it sat in. I couldn't even finish my plate of food. I kindly walked out after I placed a undeserved tip on the table. Two things I always remember; when I receive exceptional service and when I receive poor service. I would never step foot in there again. Can't wait to ask my friend if he tripped and bumped his head on the way in.", "author": "Avril L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-23", "description": "Some of the best Chinese food I've had.  The best General Tso chicken I've had. The best vegetarian Chinese food also. They moved from around the corner and found them a couple of years ago. My go to Chinese place.", "author": "Greg P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-08-22", "description": "This place used to be really good years ago. I don't know what has happened now. They could definitely do better in regards to customer service. A lot of the waiters are rude. They rush you to order, and practically hand you the check as soon as you finish your meal. The last two times I've dined in, my food literally was ready within 2 mins of me ordering. I would like to think that my food took longer than 2 mins to prepare. Very dissatisfied, and probably won't be returning again.", "author": "C B."}], "servesCuisine": "Chinese", "priceRange": "Under $10", "name": "Lichee Nut", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "162 Montague St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/Nbj71pbUDGJsWDDhrQuo8A/ls.jpg", "@type": "Restaurant", "telephone": "+17185225565"}