{"aggregateRating": {"reviewCount": 258, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-01-09", "description": "Steamed dumplings were good but the sweet and sour chicken was the kind that's 80% coating and 20% meat.", "author": "Richard C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-20", "description": "I ordered from here over the weekend and I was really happy with my order. My bf got the general tso chicken and I got the general tso shrimp. They both were really good and came quickly. I am really picky about the quality of my food and this lived up to that standard. I also really liked how you could pick which type of chicken you wanted for picky meat eaters!", "author": "Brenna B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-30", "description": "The spicy Szechuan dumplings might be my favorite food ever. Not joking. I only wish i lived within their delivery area. The service is always impeccable. This is a rare nice, sit down Chinese restaurant. You can have a proper dinner. Nice ambience and a even a small wine selection. One of my regular spots.", "author": "Heather J."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-08-26", "description": "I absolutely love Lichee Nut because its so damn quirky.\n\nIt's one of the best lunchtime deals in the area. You get an entree, those crackers with duck sauce, and a choice of soup or iced tea (in addition to the pot of hot tea available). It's really great shitty Americanized Chinese food. \n\nAnd in typical shitty fashion the service is super fast. Like faster than you kind of service. You can sit down and be handed a menu and if you haven't been asked if you're ready to order within the next 2 minutes I'll buy you a meal. (Ok not really, I'm broke.) \n\nIf you're dining in, they want you to eat well and eat quickly. If you're okay with that, then its a good place.", "author": "Mohammad H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-11-08", "description": "The food is amazing here, and the prices are even better. But my rating is solely based on the customer service/ satisfaction factor. The workers are very edgy, and are quick to tell you that they want their tip. Cool. But please do not go running after customers out the door and chase them down Montague Street for a few dollars. It's highly unnecessary.\nIf you want to enjoy a nice meal during lunch hours, please do not expect that here. This place gets wicked packed during lunch; to the point that you will be seated directly across a small table from a total stranger. Weird, I know. \nBut other than that, I love the free tea and the free snacks. Kudos", "author": "Cherron B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-04-17", "description": "Ordered delivery last Saturday night -- simple stuff.  Egg Drop Soup, Hot and Sour Soup and Dry Sauteed Shredded Beef Szechuan Style.  Order arrived in about 15 minutes.  Hot and Sour had 1/2\" of oil on top.   Egg Drop was like drinking the ocean it was so salty.  Beef was neither shredded nor dry sauteed, or sauteed at all -- chunks and slices with overcooked carrots and celery drowning in tasteless brown sauce.  Called to complain and was told they would check with the chef and then was told that's the way they make it all.  Threw it all away and wasted $25.  Lichee nut was the \"best\" of horrible Heights Chinese Restaurants, but now joins the ranks.", "author": "Howard A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-17", "description": "Incredible food, incredible staff, incredible prices. Seriously great pan fried noodles and great general tso's chicken/sesame chicken. My boyfriend and I come here all the time, always a good experience!", "author": "Klaudia K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-05-17", "description": "I've been eating at Lichee Nut since I was in the second grade. My guidance counselor, Ms. Tufano, treated me to lunch here after I suffered a devastating loss in a storytelling contest. I had my first taste of Moo Goo Gai Pan that day all those years ago, which sounded so grown up and exotic to me at the time. Now I don't go near the stuff. Lichee Nut is my go to spot for an unbeatable lunch special. Today it was Ginger Chicken with brown rice and wonton soup. Unlimited fried noodles and a steaming hot, pot of tea are complimentary here and I got it all for $6.50. That's how we do it in BK.", "author": "Tanya R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-07-18", "description": "Unless you're a fan of being hung up on and treated like a dog, call this place only if you care to feel like a stray dumpling that's been stepped on by the entire kitchen staff. The nasty little tart who answered the phone two minutes after-hours was so effing rude that i nearly walked downstairs to protest. What about \"I'll take anything you've got that's still warm\" doesn't appeal to 100% of restaurants? Alert God, because I just found the first.\n\nI'd rather join the grandmother in the acid lake in Pierce Brosnan's \"Dante's Peak\" than give this place my business. May there be a sudden spike in lychee futures that drives this place into non-existence.", "author": "Craig B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-07-11", "description": "I usually order from Fortune House, but they are closed for more than a week on summer vacation (I don't understand how business close entirely in Brooklyn Heights for a vacation...the vet does this, as does the Fascati Bros. Pizza...it's NYC, not suburban Pennsylvania).  But anyway...\n\nI ordered Lichee Nut online from Seamless Web...the process was easy.  I love ordering on Seamless Web.  I chose the Chicken and Broccoli and some Shrimp Fried Rice.  Delivery was expected in 30-45 minutes but actually arrived in about 20 minutes.  The food was very good, and overall I would have been very happy with my Lichee Nut experience, BUT...my delivery person was incredibly grumpy and rude.  And we didn't even really have to talk that much.  It was the weirdest thing...but the guy actually seemed really angry that he had to deliver my dinner.  So while the rest of the experience was easy and fine, I will go back to Fortune House as soon as they are back from vacation.", "author": "Krista J."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-07-15", "description": "For the summer, our office was relocated to swing space in Brooklyn, which has meant scouting around for new places to grab lunch.\n\nThe lunch specials here are okay and generously portioned.  In terms of taste -- all okay: nothing great, nothing bad.  \n\nThe restaurant itself is a cramped, slightly dingy spot down a narrow flight of stairs.  I've only gotten take out, so it's lack of atmosphere has been a non-issue for me.", "author": "John B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-03-08", "description": "I had shrimp with broccoli and my husband had sesame chicken. Nothing extravagant.  Both dishes were the worse versions of this regular chinese take out either of us had ever eaten.  I called Lichee Nut to express my dissatisfaction and the manager said they've been in business fo 30 years. And so???\n\nwon't be going back there.", "author": "Fatima L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-24", "description": "Consistently good across the board.  Quick delivery.", "author": "Koris B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-08-19", "description": "We have been ordering from here more frequently at lunch time and each time I seem to like it less and less. \n\nThe lo mein has become really greasy and gross. the chicken dishes are too chewy. and my favorite of all things, an eggroll, wasnt even that good and I threw most of it out.\n\nChinese take out is probably one of my top 2 things to eat (following pizza) but I think I will need to find a new one near work bc this place hasn't been cutting it.", "author": "Arielle S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-03-12", "description": "Service was very rushed. The waiter brought the check and started removing plates (which I was still using) mid-meal.  The duck soup was good but the duck \"meat\" consisted mostly of skin and bones (unlike me).  Prices are very low and they do a high volume - which is probably part of the problem. The atmosphere is pretty nice but the access/egress is via some very steep steel steps. I wouldn't rush back here", "author": "Carl E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-22", "description": "I got deliveries here (pretty fast as in within 30 minutes), and the food is better than average American Chinese food.\n\nPlease beaware that I am taking the location into consideration.  It is nothing compared to the wild Chinatown restaurants in Manhattan, Brooklyn or Queens, but it is my only option here in this hood!  I am just trying to be fair to them, because I am a fan until I find a better place!", "author": "Juan J."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-09-26", "description": "The food was decient love the atmosphere, the waiter could have been nicer. Shredded chicken is very good ( BF had that).", "author": "Caresse S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-02-11", "description": "This is my 2nd time trying out Lichee Nut and both times were with boyfriend. The first time was not so bad, good service...although I ordered dumplings the first time and somehow my boyfriend's dish came before mine and mine were just small dumplings. That was rather strange.\n\nOn Thursday, my boyfriend \u0026 I came here for lunch for lunch break, the food looked presentable but... Oh my god... they probably threw the whole can of salt in my egg drop soup and mixed vegetable lo mein. It was drenching in too much sauce too. \n\nThis experience has made me feel uneasy about Chinese take-out and now I probably won't go for Chinese Take-Out anymore.", "author": "Jessica D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-29", "description": "When I'm downtown and want Chinese food and it's lunch special time... Hell yeah, we're going to The Nut. \n\nWhen you walk in, prepare to be transported to China. It's packed, there are a lot of things going on at once, no one is speaking English, there is a group of Chinese men in the corner doing something with soybeans.  \n\nThis is a part of the experience. Now you're seated an have some tea an you're browsing the lunch special menu. You're shocked. That's good for the price. You order Chicken and Broccoli with lo mein because you're boring and get some wonton soup with it. \n\nYour soup comes out quick and it's amazing. You're barely done and the food rolls out. Not only is it massive but the taste is unreal. \"THIS is what Chinese people eat!\", you think to yourself. \n\nYou finish and the check appears on your table. You didn't even see the server drop it off, but you gladly pay because, hey, lunch special. \n\nYou walk outside, back in America and you check your phone and gasp. There's no way that only took 15 minutes...", "author": "Darryl D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-06-17", "description": "For some reason it has become next to impossible to find decent neighborhood take out Chinese in Brooklyn. Forget decent; this place is discusting. Any positive reviews must be fake. Everything is a goopy nasty mess of over cooked meat and raw veg. Drowned in sauce. And tasteless. Really really awful. Even the fried dumplings were inedible.", "author": "Optimist O."}], "servesCuisine": "Chinese", "priceRange": "Under $10", "name": "Lichee Nut", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "162 Montague St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/Nbj71pbUDGJsWDDhrQuo8A/ls.jpg", "@type": "Restaurant", "telephone": "+17185225565"}