{"aggregateRating": {"reviewCount": 258, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-05", "description": "I've been eating here since high school and still continue to eat here when I'm in the area. It's more out of habit than this being my favorite place. I prefer eating in the restaurant. It's got a nice setup, and usually isn't packed to the tip, so you get some breathing room when you're seated. Not the most amazing Americanized Chinese you're going to get in NYC--probably not by a long shot--but I've never had anything that tasted off or horrendous. Some plates are definitely blander than others. I think the General Tso's, the Sesame Chicken, and the Orange Chicken plates are a little gummy. The chicken is too coated and too chewy. \n\nI love the crispy noodles that you get when you eat-in. Unfortunately, I was told by a server once that you can't get them wrapped to go if you don't finish your table's bowl--at least, not without paying for them. I didn't really understand that, considering the noodles were already served on the table, but I am not one to argue about whether I can take complimentary crispy noodles with me. What I also have noticed is that I have to ask our server to bring them out every time I go there. They are complimentary, you just have to advocate for yourself! Go get the crispy noodles you deserve! \n\nI also love the tea they serve when you eat-in. \n\nI think the service is not consistent. I've had rude and impatient servers, and I've had servers who made me feel welcome and looked after. I have never waited longer than a minute or so to be seated. I don't really think the food here is very amazing either. If I'm in the area, I'll suggest hitting up my old favorite, but I'm kind of loyal to this place just because I've been with it for so long. It's not a need-to-go place by any means. \n\nCozy spot. Nice decor. I like that you have to walk down the stairs to get in. It makes it feel more special somehow. Anyway, I've always been a fan of their dumplings (of all kinds, but especially shrimp and veggies) and spare ribs, so if this review somehow managed to inspire you to check this place out, order those if you'd like.", "author": "Shazi L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-06", "description": "Quick delivery time! I've ordered many times and the food came less than 30min. And them were of course hot and very packed. Very decent American Chinese food. Reasonable price and great taste.", "author": "Sui H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-09-14", "description": "My husband and I came into the restaurant extremely hungry. I ordered roasted duck flat noodle soup and my husband ordered steak with shrimp combo. The roast duck noodle costed $8.95. It's not considered expensive in the area. The good was served in less than 10 minutes. I was in shock looking at 6 pcs of dried up roasted duck bones floating on top of noodle soup. I immediately called the waiter over and showed him the food. The waiter said:\" This is how it is. This is how this dish should be. This is not China town. You can't expect China town quality food here. What do you mean by no meat. There's meat attached to the bone. We don't make the duck here. We bought the duck from else where and recooked them before serve. It's just a little dried up. There's meat.\" I was in shock and also amazed how blind this waiter is. He talked to me like I have never eating out before and I am so dumb that I can't tell meat and bone. He tried to convince me to consume the poor quality food than offer to refund or exchange to something else. I was so mad. I repeated myself many times that I ordered roasted duck noodle and not roasted duck bone noodle. The waiter still tried to convince me that this is the quality they serve here. I have no choice but suck it up. He ended up taking the 6 pcs of bones off my dish and gave me roasted pork instead after 10 minutes of argument. The roasted pork was not any better than the duck. It was obviously bought else where and microwaved before served. I had one bite of the meat and it's so dried and not fresh . I took a picture of the pork. I should've  take a picture of th roasted duck to show the world how bad it worst. \n\nI will NEVER come to this place again. Not just the food suck. The quality of service was even worst. They didn't care about their business and treated customers like poop!", "author": "Sally C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-11-02", "description": "Full disclosure: We only had apps and one entree\n\nIt was late and nearly closing time, so everything came out very fast (a good thing). Hot tea was served at the table and service was decent - albeit rushed due to the late hour. We mostly had appetizers (with the exception of my sister, who had chicken and broccoli). The egg drop and wonton soups were well-seasoned and tasty, as were the spring rolls (or should I say spring ROLL, as I only got one, which I thought odd). I would definitely return for their scallion pancake. It was so fresh and delicious.", "author": "Res R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-01-22", "description": "I ordered chicken with white rice, and I received about 7 pieces of chicken and two spoonfuls of rice for the price of $9.25. I did not receive the amount of food that had paid for. They didn't separate the rice from the chicken and the chicken was not very good either. Very disappointed.", "author": "Emina A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-18", "description": "Decent food. This is your average, go to, neighborhood Chinese joint. Normally, this would be about 2-3 stars, because the food is middling. I would actually give this place half a star, but I can't go that low. The cashier completely turned me off to this place. Too much attitude. Just order take out to avoid the unpleasantness.", "author": "Narciso R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-12-14", "description": "I'm so taken back and appalled right now. I ordered from lichee nut for the first time because they had things I love that some chinese places don't have.  I saw the reviews about them making people uncomfortable because of tips. I told the girl on the phone to put half of it on my card so I can give the delivery man a tip. She said it was a 12 dollar minimum so I said ok so I don't have cash to give him a great tip.  My order was 20.60 and I gave 23 dollars which is a 2.40 dollar tip for 3 blocks he drove. The man banged on my door with all his might that my infant upstairs started screaming crying. If he thought banging on my door was gunna get him another 2 dollars he thought wrong. I ignored the banging because it was completely rude and uncalled for. He started non stop calling my phone then I explained I told the phone girl I had no cash he started cursing in Chinese and hung up. I will never be ordered again. That is not how u treat a first time customer or any customer for that matter.", "author": "Gianna B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-05-06", "description": "Greeting- yes\nVibe- old school\nPrice- avg.\nBR- two single units\nParking- forgetaboutit\nService- fast\nFood\nScallion pancake was tasty $4.50\nShrimp dumplings were very good\nWIGB? Yes", "author": "Hungry K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-11-02", "description": "Ribs Tougher than Tough! Shrimp Roll Hs some mushy stove inside. Good Chinese food is so hard to find! Last trip to Lichee Nut for me!!! What is this all most shrimp dishes say sliced shrimp! Really!", "author": "Sher N."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-10-30", "description": "After eating here, I'd call and suggest the owner to change their name to \"HELL\". That's how I felt after dining here, and to be more precise, so did my stomach.", "author": "Maia C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-05", "description": "Super fast orders and always exactly the way I ask for (I like extra sauce with the chicken in the rice). Always ready for takeout lunch in 10 minutes!", "author": "Nicole M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-04-25", "description": "I would give this place NEGATIVE stars if I could. \n\nI recently ordered delivery from here, and it was actually inedible. The smell was so horrendous, that in addition to not eating it I had to take out the trash after throwing it away! \n\nWhen I got in touch with the restaurant they refused to give me any sort of refund and were extremely rude. \n\nBad food, bad customer service, all around horrible experience.\n\nSTAY AWAY!!!", "author": "Tamara B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-19", "description": "Solid old fashioned Chinese. Prices are cheap, food served fast \u0026 fresh \u0026 hot. Some of the best general tso chicken isn't all weird like at some Chinese joints. Dumplings are yummy as is their fried rice \u0026 eggplant. And BUBBLE TEA \u0026 sake. Yes!", "author": "Marissa P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-18", "description": "This place is by far the most unworthy Chinese restaurant I've ever experienced. First off, they're rude! I asked for pork fried rice, hold the onions and they told me that wasn't possible because the rice is pre-made! Since when can't you customize your order at any restaurant really? But you know what, I roll with the punches and still order anyhow. I get the lunch special of chicken and broccoli with the pork fried rice \u0026 onions. Service was rather quick however, when I went to start eating my food I was astonished by what I saw. I literally had maybe 3 spoons full of rice in my plate accompanied by a couple broccolis and chicken. I've never seen such a tiny amount of food for $9.75! Never and trust! I've ordered lunch specials before from places and they've never gypped off their customers the way this place does. I'm quite pissed actually that I even spent my money on this and I beg everyone DO NOT GO TO THIS RESTAURANT AS IT IS NOT WORTH IT, NOT EVEN IN THE SLIGHTEST. You can get a whole FULL order of chipotle for less than what I paid for and be satisfied. (Chipotle is across the street from them FYI). And its flavors were mediocre at best. Don't got here, don't waste your money, don't waste your time!", "author": "Janeane S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-30", "description": "I'm not one to write bad reviews, I'm actually saddened to do so. My experience is disappointing. Not very accommodating. I ordered the lunch special and asked for plain fried rice and they said only pork fried rice was an option with lunch so I settled with brown rice without complaint. I then watch the waiter spit into the garbage pale and wipe his mouth without washing his hands and then poured us water. I was beyond disgusted and at a loss for words, completely unsanitary. I also felt rushed and uncared for, which I'd expect from a traditional NYC red Apple or any only Chinese food take out but for being a sit down I'd expect even only the slightest bit more. The food was pretty decent but I found it difficult to eat because of the spit incident, I couldn't keep my imagination from wondering what actually happens in the kitchen.  :(", "author": "Kristen M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-02-07", "description": "tldr: Service was complete SHIT and made me feel like SHIT. I will NEVER order from here again. \n\nI received extremely disrespectful service from the delivery driver that not only made me feel poorly, but made me not hungry at all anymore. \n\nAfter having difficulty finding the delivery driver, we finally met, and he was completely rude - shaking his head disappointingly and disapprovingly while muttering under his breath about why I had taken so long. I then said I was paying with card, and he went off yelling about why I had not told the card number to the restaurant. It never crossed his mind that the restaurant had not asked me what form of payment I would be paying with. His actions were completely unwarranted and aggressive. After I signed the receipt and put a $1 tip (for his extremely bad service), he barked at me \"only $1??\" It was at this point that I lost it and told him that I should not have tipped him at all for his rude and immature attitude along with his belligerent conduct. \n\nI sit here typing this angry review without even having tried the food, but honestly, I don't care how the food tastes to know that I will never order here again and tell all of my friends not to either. DO NOT ORDER FROM THIS RESTAURANT.", "author": "Kevin B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-01-20", "description": "This place is simply horrible. I'm going to keep my review as short as possible since this restaurant does not deserve any more of my time or money. Don't go.", "author": "Daniel K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-12-10", "description": "A MUST TO AVOID\n\n Today, after listening to several hours of boring testimony, in Russian! :(((( , at a court reporting office on Court Street, I searched for a quick late afternoon bite. I chose Lichee Nut on yuppified Montague Street.I must have been nuts.I walked below street level into a non-descript, half-crowded space.The waiter,who can plainly see that I'm reading the menu, asks if I'm ready to order.Suppressing annoyance I choose the twice cooked pork lunch special. The hot and sour soup is a funky tasting unusually light color. A couple of tastes and I'm done but, before that, the waiter plops the main in front of me.Seen this before. Some call it cultural. I call it rude. The twice cooked pork is nestled under an ample mound of dry and pork-less \"pork fried rice\". It consists of four tasteless thin pieces of pork studded with gross mystery vegetables. Talk about mailing it in!\n\nOne final point: I regard the term \"Americanized Chinese Food\" as a patronizing slur because it implies that round eyes don't have palate enough to recognize inedible crap. That is no defense for this restaurant.\n\n Hence the rating: NOT RECOMMENDED.", "author": "Thomas C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-01", "description": "Not a bad dinner on a freezing cold New Year's Eve!! The food tasted great and the wait staff could not have been nicer. While this place is sufficiently better (and cleaner) than the typical-looking Chinese takeout joint on your block, it may disappoint those who are dying for an \"authentically Chinese\" dining experience. It does have a full selection of all the unauthentic classics, but if you read through the menu a bit more closely you will find some true hidden gems on there that are much closer to a Chinese person's definition of Chinese food. So if you're looking to just have some decent food and be treated with impeccable hospitality, I would definitely recommend this place. It's a huge plus too that they have plenty of vegetarian options. Pictured: vegetarian chicken with hot pepper sauce (the name of this dish on the menu was kind of misleading since the Chinese says \"素宫保鸡\" which means vegetarian Kung Pao chicken which would make more sense) and mixed vegetables with bean vermicelli (素菜粉丝煲), both of which were amazing.", "author": "Qianying Z."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-10-28", "description": "Okay, so I was curious what the Chinese food was like, in this part of Brooklyn. I have grown accustomed to decent food quality in Brighton, so I expected more from BH. As you enter, you are greeted by the staff and are seated at a table, truly a restaurant experience. But that's where disappointment sets in. The prices...they're basically double of what I paid for in Brighton, and that's for the regular portions. So I ordered the usual, pork with broccoli and white rice.  What I got was, rice with small pieces of pork (compared to how much I can get in Brighton for the same price), barely any broccoli, and bunch of Chinese vegetables. Thank god for the free iced tea, otherwise it would be a 1 star review. You would think, that the owners would actually try to make quality food, at a quality price. But instead, we wind up overpaying, for the most basic food.", "author": "Vladimir S."}], "servesCuisine": "Chinese", "priceRange": "Under $10", "name": "Lichee Nut", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "162 Montague St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/Nbj71pbUDGJsWDDhrQuo8A/ls.jpg", "@type": "Restaurant", "telephone": "+17185225565"}