{"aggregateRating": {"reviewCount": 258, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-22", "description": "Had lunch special today, chicken w/walnuts with veggie lo mein instead of pork fried rice and wanton soup for $6.80. I thought food was great and the portions of chicken and lo mein were big. There was a miniscule cockroach on the top of my duck sauce which I wouldn't have seen, had I not had my glasses on. They didn't charge extra for it. Hey, bugs are everywhere. I'm deducting a star. There are probably more that you don't see.", "author": "sam s."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-01-02", "description": "When I was in my late teens Lichee Nut used to be the bomb! My first girlfriend and I used to go here all the time and we loved every minute of it. Fast forward a decade or so and the food to me is just average. It is a bit pricier than your conventional Chinese restaurant, but I must say that the staff is very friendly here. Don't get me wrong the food is still good, but nowadays with some many option good is not good enough.", "author": "Sonny A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-04-12", "description": "My bf dragged me here saying I would like it. I ended up loving it and now I drag him there all the time. My favorite food in the world is Hot and Sour Soup and I only like it a specific way and they make it perfect here! All their other food is so good and the place is intimate in itself. I recently got a job nearby so I order from there all the time now. Other than the soup I love their Orange Crispy Chicken. I would never have expected such quality food in a small hole in the ground type restaurant.", "author": "Maricel T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-18", "description": "The food is delicious, and the lunch special is obscenely cheap for what you get.  A soup, a meal, and some tea?  It's served fast and - did I mention? - deliciously.  It's the best lunch option on Montague if you like American-Chinese.", "author": "Brian M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-08", "description": "My favorite Chinese Food Delivery in the area. The are fast, reliable and make great fast food style Chinese. The Orange Chicken and Chicken Lo Mein are go to items on the menu for my boyfriend and I, but pretty much anything will satisfy your Chinese food craving. Their dumplings and meat skewers are pretty darn tasty too. My favorite restaurant for a night in filled with video games and Netflix :-)", "author": "Lindsey T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-03-30", "description": "Order out the Ginger chicken/shrimp, or if eating there try the sesame chicken/shrimp (try chicken shredded). Best Chinese food in Brooklyn heights.", "author": "Adam R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-02-10", "description": "This is your typical neighborhood chinese takeout place. They have super fast delivery and I recommend trying the 'juicy little buns!'", "author": "Kim N."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-01-22", "description": "Don't order from these guys during lunch. Or ever. I've ordered from them for dinner several times over the past 3 years. Today, I ordered through Seamless but didn't get a confirmation after 30 minutes. When I called, they acted like I was a nuisance for inquiring about my order. They told me I should have called them to place my order instead, and that it would be another 20 minutes. When I pointed out that I couldn't have been expected to know that when they were clearly available on Seamless,  the manager grabbed the phone and told me that he didn't have time to talk to me and \"Do you want your order or not?!! It's a simple question.\" No, thanks. Not ever again.", "author": "Jacqueline W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-10-16", "description": "Great prices at lunch! Place is pretty busy. I found my waiter to be a little impatient with me because I didn't order fast enough, but no biggy. Didn't find the food to be great, but it was good, and again- good prices, so I'd go back.", "author": "Jeremy D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-07", "description": "I like this place. For dinner, delivery is CRAZY fast, and they give you an option to have only white meat chicken in your dishes. Standouts were the dumplings, moo shu pork, and shredded sesame chicken.", "author": "Becky S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-05-06", "description": "Very tasty food, but my husband \u0026 I both got sick each time we ordered there. After 3 tries we gave up. Ugh!", "author": "Lola F."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-05-20", "description": "Cheap lunch, cheap taste. My meal was not fresh and tasted like it had been sitting in a pan overcooking. I wasn't terribly disappointed, but I was hoping for something better. After all their sign outside read \"Best of Brooklyn\"...well not so much.", "author": "Jacqueline J."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-02-28", "description": "First and last time stepping foot in this establishment. Decided to try this place since Andys is gone and my boyfriend and I were in a mood for chinese. The visit started off well, the place was pretty empty for a saturday afternoon..our waiter was prompt on taking our order, my boyfriend and I ordered the wonton soup ..they arrive moments after however a hair is discovered in mine after one scoop of the spoon. I show our waiter who asks if I would like the tea instead, i decline and ask for water, our water arrives and before I could take a sip my boyfriend is holding up his glass in disgust, there is a lipstick stain on the rim. At this point we decide the A was not the restaurants true standards, I call the waiter over and show him the glass, he shakes his head and says \"ok if you dont want to eat here you dont have to\"..I ask for a manager and he walks away. At this point we are gathering our items, we explain the situation to the woman at the front desk who claims there is no manager present. The woman then exhanges words with our waiter who then yells in another language and I am completly shocked! We gave him nothing but respect despite his attitude and bad service, I express this to the woman as well as request for him to speak english if he is going to address the issue. The woman then translates he allegedly  said there was no hair in the soup nor lipstick stain on the glass...by then the soup was taken however I walk to the table and show her the glass and stain. No apologies just silence as she shows him and removes herself. I have never been to an establishment where no Manager was present in addition it would be ideal for waiters to have respect especially when the customer is showing such unappetizing issues. Will stick with Nanatori where the service is fabolous \u0026 the sushi is great!", "author": "Bkfoodie M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-01-13", "description": "Lichee Nut serves up good \"fake Chinese food\" hot, fresh, and FAST.  The Chinesey chintzy decor topped the typical no-frills and the staff here was the epitome of efficiency.  Waitstaff industriously earned their wages while cashiers-slash-takeout-placers zipped through orders like accountants on crack.  My General Tso's was surprisingly still crispy beneath the viscous sweet sauce and the less-sweet-than-usual hot and sour soup was a pleasant change.  Take-out portions seem a blink smaller than average, but would I come back?  Faster than chop-chop suey.", "author": "Andrea L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-11-30", "description": "Sesame chicken is really world class.  All of the food actually is usually quite good, but is sort of hit or miss (it's much better there than delivered).  Space is not all that nice, but eating it there makes the food about 3x better than having it delivered (even if it is delivered in under ten minutes most of the time).  Highly recommend the sesame chicken.", "author": "Dan B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2008-08-29", "description": "I just can't give this place 4 stars in good conscious.  You get a MOUND of rice, and then a little of your meal.  Which, is good to fill you up on not too expensive rice... but come on!", "author": "Mike P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-08-03", "description": "I will preface this by saying I very rarely eat Chinese food.  However, it was a coworker's birthday and he wanted to go here.  He's a friend so I agreed. \nEven though I'm not a Chinese food regular, I eat it from time to time and have really enjoyed it on many occasions.  This was not one of those occasions.  First of all, the crispy noodles looked like they had been sitting on the table in a bowl since last night.  I didn't really want to eat them, so that was actually a good thing for me.  Not so good if you actually enjoy eating them.  I had the tofu vegetable soup which was actually pretty good.  I should have stopped there.\nMy main dish was the szechuan tofu.  Super greasy, overly sweet.  It didn't even seem like they cooked the tofu.  It seemed like they took a block of it out of the fridge, cut it, and dumped some sauce on it.  Except they must have cooked it because it was swimming in oil, unless that was all from the sauce.  Who knows.  I feel like grease is coming out of my pores.  I will say that the brown rice was decent (but it's rice so it's not that complicated) and I liked that they didn't charge extra for that.\nWould I go back?  No.", "author": "Ali S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2007-10-10", "description": "3.25 stars.\n\nJust ran in here one day to get take out during my lunch break.  \n\nOrdered the beef chow fun lunch special for $4.95 that came with choice of soup (I chose hot 'n sour), and a fortune cookie.  \n\nI thought the beef chow fun didn't have enough taste.  It seemed they just stir-fried a bunch of the noodles without much sauce.  The beef was tender and a pretty decent serving.  The noodles came with the usual green onions, but no onions.  Instead, I got....cabbage??!\n\nThe hot 'n sour soup was ok, but a little bland and watery.\n\nOverall, good place for their quick, cheap, lunch specials.", "author": "Junkfoodie Q."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-09-07", "description": "Llichee Nut is possibly the worst Chinese food I've ever tasted and I ate some pretty awful food in China. The dumplings were think, underdon, chewly little gut bombs with a tasteless chunk of meat. The prawns were straight out of the freezer and bore no resemblance to seafood. The sesame noodles were below room temperature (the preferred temp.) and had gobs of bottled sauce on them.  Run from this place.", "author": "Peggy H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-11-17", "description": "Better than average Chinese in Brooklyn--and it's not out in Sunset Park, either.", "author": "Jeff M."}], "servesCuisine": "Chinese", "priceRange": "Under $10", "name": "Lichee Nut", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "162 Montague St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/Nbj71pbUDGJsWDDhrQuo8A/ls.jpg", "@type": "Restaurant", "telephone": "+17185225565"}