{"aggregateRating": {"reviewCount": 258, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-03-10", "description": "Not earth shattering but just as good as any other run of the mill chinese delivery place. \n\nI wouldn't dine in though. Last time I went to pick up, the place smelled like gas and its a pretty depressing decor too.\n\nBesides, the delivery guy is awesome, he's always practicing his english phrases with me. What a trip.", "author": "dave m."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-04-16", "description": "My fav spot for spicy shredded beef with fried rice, spring rolls and veggie lo mein.  Food is soooooo quick, but good.  I eat a lil and take the rest to go for dinner!  I always finish within 25-30 minutes with enough time to spare to window shop on Montague St!", "author": "Amy W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-02", "description": "5 Stars for the food. Sesame chicken and egg fried rice are awesome\n\n1 Star for the service. They're always nasty.", "author": "GUY W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-07-14", "description": "O-I-L.  Thats it.  Now you may think I'm talking about oily food, nope! I ordered moo shu vegetable for take out.  For those who eat this dish you know it comes with plum sauce and pancakes to make the moo shu wrap.  So where am I going with this? Where was the oil? IN MY PLUM SAUCE.  I can not begin to explain how disgusted I was.  Imagine you ask  for ketchup, mustard, duck sauce or any condiment and you get it with a LAYER of oil on top. Plum sauce is not a salad dressing it is typically the texture of jam.  Its like a plum puree that you put on the pancake before you add the moo shu - its supposed to enhance the flavor not slide around the container because oil is in it. It is seriously the equivalent of having oil in your jam or ketchup.  YUCK.  Without it - the moo shu is not the same.  I bought the plum sauce back to Lichee the next day.  I braced myself for a possible confrontation.  Instead the guy behind the counter, laughed and was lighthearted, friendly even (maybe because of all the reviews saying they are mean).  But he said oh, this is dumpling sauce not plum sauce.  He sent a server to the kitchen and she came back with the same exact sauce.  Plum sauce with oil.  He lied and gave me the SAME exact oily sauce I returned, this time with less oil- less oil making a thinner layer on top.  But STILL OIL.  So my decision is to never eat there again.  The food is mediocre at best. But what stands out to me is that instead of being honest, apologetic and bringing me real plum sauce they lied and said it was dumpling sauce which shouldn't have a layer of oil on top either.  It makes me think what else they could be lying about. I don't know.  Are times so hard where they need to \"stretch\" their sauces by adding oil? So gross.  Ok - Im done - don't eat here.  Brooklyn Heights can do better. Look at the picture and see for yourself. Ugh.", "author": "Leslie B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-09-23", "description": "Basically average Americanized, fairly greasy Chinese food.  I ordered mu shu veggies, shrimp dumplings, and some kind of green bean/tofu/spicy black bean sauce special.  (dishes organized from best to worst)\n\nIf this is the best Chinese food in the area I'm going to start buying Trader Joe's stir fry and making it myself, or at least order from somewhere different next time.  It's possible that my general nonplussed-ness comes from the relatively high ratings for this place, which perhaps says more about the lack of tasty takeout Chinese nearby than anything else.", "author": "Lisa C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-04", "description": "After I moved to the greater NYC area, I began eating less and less American-style Chinese food because I had so many other options.  Thai?  Awesome!  Vietnamese?  Count me in!  I figured that I had progressed past the saucy-sweet staples of American Chinese cuisine.  However, there is a time and a place for everything.  And today was one of those times.  Convenience and air conditioning prevailed, not to mention the proximity to my workplace.\n\nI was pleasantly surprised.  Lunch specials include an entree, soup, crispy noodles, a fortune cookie, and a huge pot of tea for less than six bucks.  The hot and sour soup was excellent, with large toothsome chunks of mushroom and tofu.  I ordered the Hunan Chicken, which was tender and appropriately sauced.  And, hooray for the brown rice!\n\nThe service was insanely fast.  I sat down and got my soup within 5 minutes, and my entree came another 5 minutes later.  They have their lunchtime service down to a science.  \n\nIf/when we end up moving to Brooklyn Heights, I assume that this will become our go-to local Chinese joint.  Still haven't found one in Newark yet, probably because they are all advertised as Halal/Chinese and are sequestered behind bulletproof glass.", "author": "Carly D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-04-15", "description": "I thought it would be a great place to take my boyfriend for his birthday. Not only because of the beautiful view a couple blocks down but I remember the food being fantastic.  Boy do times change. My issue was when it was time to pay the bill and leave. We payed with a debit card ( limited)  and gave a tip using cash since are card only had a certain amount.  We gave a couple bucks thank them for the service. when the waiter was disgusted by our tip claiming this is all.  I was appalled I understand people need to make a living but others need to comprehend people come out to treat themselves and give what they can, making a living as well. My boyfriend trying to understand his accent and becoming frustrated, the waiter calls the manager and he says to us they have a family to feed . We tell them we too have a bills and responsibilities to tend to, we chose your resturaunt to spend a once deserved nice evening but you are being ungrateful for what we can spare graveling for way more than you deserve. I hate restaurants that do this and surely this was one of them. The manager and his staff are hungry hungry hippos trying to gobble up all you have for a medicore meal. Never coming here again.", "author": "Jen T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-23", "description": "There was a time, maybe about 3 or 4 years ago when this would easily be a 5 star rating from me.  However, in recent years the quality has gone down a bit.  For one the prices have gone up quite a bit, which is just because of the times and can't be blamed but it used to be sooooo cheap.  I usually get the chicken with cashew nuts, it is usually great.  There are usually pretty good dumplings, the shrimp dumplings being the best but you have to eat them while they are hot or they lose a lot of their goodness.  They have good roast pork with broccoli, usually quite oily but it tastes great, I usually mix mine with chicken fried rice.  There moo shoo isn't that good and their lo mein and chow fun are fairly generic.  The main thing that makes me come back are the soups.  They have a good wonton soup for two, full of chinese vegetables, chicken, pork, shrimp and wontons which really hits the spot.  Their crowing achievement is their hot and sour.  It is one of the best I've ever had and I could probably eat it every day, it is the perfect combination of hot and sour and their is also a little bit of sweetness that drives it home.  I've sometimes had problems with delivery and I only live a block away and I have heard some real nightmares so if you live close call your order in and pick it up or eat in.  Again, this place used to be really high quality food for good prices but in recent years the prices have gone up and the quality has gone down a bit but it is still a staple of the area and it is much better than Andy's.", "author": "Adam L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-21", "description": "Fast serving, good pricing for lunch special. If you work around this area and need to have a quick lunch, this is the place.", "author": "Sharon S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-12-28", "description": "Forgot to put 75% of the food then said that the person put it in. They only gave the chicken then said thats what I ordered. Who only orders chicken? What happened to the rice and scallion pancakes that I ordered. Instead of admitting to their mistakes she blamed me and then someone that packed the food lied and said she packed it. What happened to the food it just disappeared out of thin air???? Never will I order from this place again.Then she hung up on me Order at your own risk!!!!!!!!! Luckily I ordered on seamless and they refunded me back my money", "author": "Daiya M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-09", "description": "They have two locations both have been consistently good.  Beside Brooklyn Heights they are on 5th Avenue in Bay Ridge.  You can eat in/take-out or they will deliver.  The food is very fresh and very good.  I especially like the fact that they are not that oily or greasy and you they have a huge variety of classic dishes as well as the unusual.  \n\nI have had the Hunan Chicken, Tofu Soup, Hot-N-Sour soup, Chicken and Broccoli, Egg Rolls, Wonton Soup and Spring Rolls.  All was tasty and shared hot and fresh.\n\nThey accept credit cards which is always a plus and are very clean inside.  I recommend this place highly...you will enjoy it.", "author": "steph d."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-08-30", "description": "We ordered lunch from here today.  The food arrived in 30 minutes, and was correct.  We enjoyed it ... it's not out of this world chinese food ... but for lunch and the price, it's a pretty good deal.  Thumbs up to the cashew chicken, chicken and broc, lo Mein, pork dumplings and assorted soups.  The only negative I experienced was that the top of my soda can was dirty, and not just  a little dirty ... it made me wonder where this thing was kept and what caused it.  It was blantantly noticeable, and the person packing the order up should have noticed this.  I tossed it in the trash because there was no way I was opening it to drink.  So, my advice for this place, by all means order food, but avoid the drinks.", "author": "D A."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-02-06", "description": "Delivery is fast, and the portions are large. It's nice that they have brown rice. But the food is bad.", "author": "Lisa J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-06-11", "description": "we did delivery on sunday evening. It took 10mins - fast!!\n\nThe phone service was pretty good - i asked for \"ma fa tofu\" which wasn't on their menu - but they made for us.  \n\nMafa tofu was actually disappointing - but it wasn't on the menu. so don't want to judge by it.\n\nHot and sour soup was great\n\nOrgange crispy beef was excellent\n\nTotal $23.90 plus tip. price is pretty good too. I think we found a chinese restaurant in the neighborhood.", "author": "Grace C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-07-10", "description": "Finally found Chinese delivery place I don't dread ordering from.  Their hot and sour soup could upgrade the broth, but both the chicken in garlic sauce and general cho shrimp were solid.  I won't necessarily go there for my real Chinese craving, but I'm happy to have found this place for their delivery!", "author": "Su S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-01-05", "description": "The food here has one single advantage: it is cheap. You can easily fill your stomach with less than $10, as the portions are relatively big. However, I don't actually like the taste of some dishes, and the service is not that good. The waiters sometimes have a rude expression, and more than once the check was brought to me before finished my meal.", "author": "Rafael M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-01-18", "description": "Top of the line Chinese for lunch \u0026 dinner.\n\nDuring lunchtime. for a little over $5, you can have anything your little heart desires.  General Tzo's is perfect here.  The Hot-N-Sour soup here is just what the doctor ordered.  \n\nFor the diet freaks, they have \"Bamboo Specials\" which feature low-fat entrees with steamed veggies and brown rice.  \n\nThe dinner menu is also reasonably priced.  Came here with friends a week ago and everything was phenomenal.  \n\nI only wish they had this place like this around my work.", "author": "Max S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-10-18", "description": "I lived in Downtown Brooklyn for about 3.5 years, and when I first moved up here, this was one of the first places that I visited.  I absolutely _love_ their food!  Since I was only a pleasant 10 minute walk from the store, and Montague is peaceful in the evenings, I would frequently stop and grab food on the way home from class.\n\nThe restaurant has received a complete face lift since the first time I set foot in it, so the inside is now clean and attractive.  In all my experiences, food has been ready extremely quickly.  I can't remember the last time I've had to wait more than 10 minutes for any of the food, even on crowded days.\n\nWhich brings me to my favorite thing about Lichee Nut; shredded chicken!  My favorite is General Tso's (I know, not a real dish... but still delicious!), although most of the chicken dishes can be had in shredded form.  Basically, its just thin strips of chicken instead of large chunks, but it makes a world of difference!  Their fried rice is great, but I've never much been a fan of their spring rolls.\n\nThe pricing can also be very good, depending on your food choice.  Generally, spending $5-10 a person isn't such a big deal, and as many people have mentioned, the portions are generous.  I'm about 5'8\", 150lbs, and I usually have to split it into two meals.\n\nAll in all, absolutely best Chinese in the Downtown/Brooklyn Heights area!", "author": "Andrew M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-01-31", "description": "I only order delivery from here, but fairly often and I never have any complaints. Of course I have also never felt the need to run to the computer and Yelp about how good the food is either. So in the end it is certainly A-OK.\n\nI have tested out many dishes (chicken with cashews, roast pork with vegetables, etc.) and all of them were flavored well and were well proportioned with the right amount of meat vs. vegetables in all the dishes. The delivery service is very quick, sometimes around 15 minutes.\n\nWhen it comes to Chinese food, a lot of it is the same. Same flavor, same packaging, same ingredients. Lichee Nut fits that bill, however, they never disappoint me. I know what I am ordering and I know what I am getting. They have the delivery down to a science and something needs to be said for consistency.", "author": "Jonathan G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-03-30", "description": "One rainy Thursday night - I ventured out to Brooklyn to study (I know to study - how fun). My friend and I needed food after using all our brain power on statistics. (FAIL) Anyway, she works by this place and swears by it.  \n\nWe go in and it's fairly small and wasn't crowded at all.  We had two different servers one who was cranky and the other who was nicer.  I ordered hot and sour soup, shrimp egg roll and veggie chow fun. My friend ordered the mango shrimp special.   I liked the hot and sour soup especially since it was raining outside and I had a little cold. The shrimp egg roll wasn't too tasty and the veggie chow fun was okay.  My friend's mango shrimp special was ok too. All in all, the food was okay but the prices aren't too bad and if I'm around the area I'd go back here.", "author": "Kristine W."}], "servesCuisine": "Chinese", "priceRange": "Under $10", "name": "Lichee Nut", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "162 Montague St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/Nbj71pbUDGJsWDDhrQuo8A/ls.jpg", "@type": "Restaurant", "telephone": "+17185225565"}