{"aggregateRating": {"reviewCount": 258, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-11-11", "description": "Lichee Nut is great; I've never had a problem with the service nor the food.  Everything I've ever gotten was excellent and, needless to say, the portions are huge.  The only complaint I have with Lichee is the amount of celery they put in some main dishes.  I've had shrimp in hot pepper sauce once and the majority of it was celery and other various vegetables.  \n\nTheir steamed little juicy buns are amazing and so are their shrimp cakes and scallion pancakes.  They're also one of the only Chinese places around that still serves the homemade crispy noodles that you get with soup as opposed to the crappy thin ones many other Chinese restaurants give you, although a lot of the time they're disappointingly stale.  \n\nThe only reason why I give Lichee 3 stars is because I've had cheaper and better tasting Chinese food. Don't get me wrong, Lichee tastes great but it doesn't hold a candle to the greasy mounds of Chinese food you get from hole-in-the-wall Chinese joints in Queens.", "author": "Vaughn G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-05-11", "description": "BAD CUSTOMER SERVICE! I will not be returning!! Generally when I come to this restaurant (162 Montague Street) the food is great . More recently I've noticed that the quality of the food on the lunch menu has changed . I received food that was Luke warm and the rice side was just cold . The food that is freshly cooked is amazing . I recently had a problem with a young girl who takes orders. I ordered food from the lunch menu and I was told that there was a minimum of ten dollars for cards . I left and returned after getting money from the bank and got back on line . The lady in front of me was picking up food also . Her food , like mine cost less than $10.00. However she being older than me , and of different race was allowed to use her card without any difficulties . I felt racially profiled but this wasn't the first time. I came to this restaurant with a white friend of mine and we were stared at by the host for the duration of our stay. Since then I have never returned. This whole situation has left a bad taste in my mouth about the restaurant . Mediocre food and the girl at the front desk is not very professional.", "author": "Cherishe C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-12-31", "description": "I've been coming here for years, but this place has totally changed. \n\nThe woman working at the register was completely rude last night and my shredded general tso chicken was the most greasy I've ever has it.", "author": "Adriana B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-23", "description": "Our household has been ordering takeout and deliveries from this location since 2001.  The food is amazing, you can always expect to get the same taste in the food you order, the delivery is impeccable... almost never exceeding 10 minutes (from time of order).  Overall i believe the quality of the food is amazing, some of my family members visit just to order from Lichee Nut!  The salt and pepper shrimp is one of my all time favorites!  My son loves the chicken wings and fried noodles and my step daughter was almost raised on the chicken and broccoli... delish!\n\nHowever, I will say that the younger delivery guys do tend to be a bit ridiculous when it comes to their tips and we are pretty good at tipping.  This one guys actually had the audacity to say to me \"that's it?!\" when i tipped him 3 bucks for a lunch special delivery of 8 dollars.  I was totally taken back and lost much respect for the place after that incident... i actually stopped ordering from them for a while...but i guess someone must have called about him because months later i have not seen him again, good move by owners or management!\n\nI highly recommend this place for takeout and deliveries.", "author": "Anna J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-05", "description": "It's pretty basic but good Chinese food.", "author": "Focci L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-24", "description": "I work by here and have come here a few times strictly for the lunch special to take back to work and I get my usual - chicken and broccoli with wonton soup.  For a lunch deal, the portion was totally worth it and I felt more than happy.  \n\nQuick service; in and out.", "author": "Jaclyn C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-01-25", "description": "Go to school nearby and this place is definitely a frequent it's really good. When ordering take out they put tea packets in and I love that. Wonton soup chow Maine and every thing is awsome. A must go if your in the neighborhood......yes that was my review about a year ago but the prices have gone up so my frequency has gone down haven't been in a while not worth it", "author": "Atticus K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-12-19", "description": "i feel like i walked in to a scorsese film in the 80s. this is where a mob boss would casually eat his general tso's chicken while a fellow member would shiver in fear waiting for his moment of fate. \n\nin other words, the decor has a generic chinese-american vibe. the food; is the same. BUT, i've had worse. it's actually not bad here. just not great. if you need bad chinese take out food, this will satisfy. \n\nservice is great!", "author": "Tiffany L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-27", "description": "I've been coming here for years and I have to say I'm never disappointed.  The food is always fresh and done right. Their chicken with broccoli is sooo delicious!! If you like something on the sweeter side their Hot lovers chicken is great! Whenever you're in the Brooklyn Heights area of brooklyn and want great chinese food, you won't go wrong stopping  here.", "author": "Karina F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-06-15", "description": "Lichee Nut has been a staple of the Montague Street set of shops over here in Brooklyn Heights and I have fond memories of it from when I went to college in this vicinity many years ago.  After moving on from the area and focusing on Manhattan places to dine, I always made it a habit of trying to visit Lichee Nut if I was near the place and could spare the time.\n\nThis week I have been stuck on jury duty and decided to visit the place once again.  They take your order very quickly and generally by the time you are comfortably sipping some of the provided tea your appetizer or soup is already on the table.  I have always found their Egg Drop soup to be pleasing to the palette so I went with that today at lunch.\n\nMy main course was a standard and simple chicken with broccoli.  I knew they made it good here so I ran with that and ordered the brown instead of white rice.  It's better for you in the end (even though they seem to give you two heaping scoops of it with your lunch).  It was a healthy portion for one person, not too little and certainly not too much.  \n\nOver the years I have sampled a few of the different kinds of things they offer such as their beef dishes and other preparations of the chicken and have never had a complaint.  I enjoyed being able to visit this place once again and was glad to find how it had not lost an ounce of its luster from the last time that I remembered being there.  \n\nThe price could also not be beat for a quick and filling lunch.  $7 for one person if they keep it simple.", "author": "Ken P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-04-13", "description": "I and my friend ordered 2 dishes from the Chinese menu. I guess those are equivalent to Fire Fighter Beef and Home Style Chicken.\n\nThey flavor was a bit more authentic comparing with other Chinese restaurants cuz I could feel it that they add Sichuan Peppercorn to them and it tasted better with spicy stuff.\n\nThe environment is okay, typical decor in NYC. \n\nIt's located in court street and many non Chinese come here.", "author": "Xiongwei W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-08-01", "description": "This place wasn't bad.\n\nPros: fast delivery, excellent value - too bad I'm at a hotel with no fridge because it could've easily had 3 meals!  Yummy (but very dense) scallion pancake, haven't had one in forever.\n\nCons: steamed pork dumplings were too thick/heavy, more like pork buns.  I could only eat 2 of the 6.  The sauce on the spinach noodles was too heavy, would've been better served on the side.  They were drenched, and it wasn't what I expected - said \"sesame\" sauce on the menu, but tasted like peanut sauce.  Good, just too rich.\n\nThe fortune cookie tasted funky... very rarely do I resist the 2nd cookie, but I did.", "author": "Rebecca T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-31", "description": "Yesterday - the following are based on timestamps.\n\nI submitted an order at 6:58 from my office. I received a Seamless email confirmation at 7:00. I am looking at my call log right now and they called me from the lobby at 7:13. They are located on Montague and I am in Metrotech. When they first called me from downstairs I seriously was thinking the order had to have been mixed up. Very surprisingly, the entire order was correct. The order was for two people. We both ate it and did not get sick lol Crazy. I have no idea how in the world they got here so fast. I have placed delivery orders with them in the past and they have always taken the standard 30 minutes or less. \n\nThe lunch specials are a good deal. The rate for dinner is a bit pricey for what you get.", "author": "Michael M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-22", "description": "The best scallion pancakes I have ever had! I have only gotten two things from here. Pancakes and the Firefighter Shredded Beef, which is amazing. It's a spicy dish but it's cooked to perfection. It's never crowded when I go because it's always late in the evening or on the weekend. Waitstaff is always nice and friendly. I've been coming here for years and will continue to do so.", "author": "Mike T."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-03-11", "description": "This review is purely based on their delivery. I wasn't concerned with the length of time it took to deliver, it was their food I was disgusted by. I've eaten in this restaurant before and the food was pretty good. I decided to give their delivery a try and couldn't have been more disappointed in the food - very tasteless/bland and oily. My boyfriend and I ordered the spare rib appetizer, hot \u0026 sour soup, garlic chicken and orange chicken. The vegetables that accompanied the chicken dishes had zero flavor. I could get into all the details about how it sucked but I'll just leave it at the fact that the food is horrendous - do not dooooo it!", "author": "Shar Z."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-02-04", "description": "Spare ribs were large and juicy, maybe a tiny bit fattier than the ideal. Shrimp with red chili sauce was good but not spicy as was promised/warned. I had no complaint with the decor as some have - yeah, it's in a the basement if that bothers you. Also, I can see why someone found the service rushed, but I just wanted to have some food and get on the train so I was pleased with the fast-paced efficiency.", "author": "Josh B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-07-22", "description": "I came in here for some take out. Because that is the NYC Chinese food way. Off the bat, there were two dings against it:\n\n1. My order of sweet \u0026 sour chicken + fried rice = $9.70. Apparently lunchtime is the only time period where the food hovers around its normal cost elsewhere.\n\n2. I waited close to 20 minutes for my food. It takes 5, maybe 10, minutes at most other places.\n\nThese two dings happened right in a row, so by the end of my wait I was thinking \"Yelp has utterly failed me this time...now what to do with what remains of my break from work?\"\n\nThen, my take out FINALLY shows up in the brightest yellow bag I've ever seen. As in, \"you expect me to walk around downtown Brooklyn with that thing?\" kind of bright. But I did. I was hungry. I get back to work in a thoroughly grumpy mood (hunger tends to exacerbate such moods) and peer inside the yellow layers of plastic.\n\nWow. Talk about enough food for an army. The chicken pieces took up their own full-size container. The sauce was in a container three times the size of a normal one, and there was an entire box full of rice. Okay, not bad. The sauce was really, really good. The chicken was pretty average, but the rice! Oh the rice...it was incredibly good. I will probably eat off this meal three times.", "author": "Shea D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-08-04", "description": "This is not Chinese food.  I would even hesitate to call it Chinese-American food.  The sesame noodles were the weirdest thing I've ever seen in my life with old noodles, oily, sugary paste and a weird salad on it.  \n\nI'm only giving it two stars because my roommate likes this place.  The pros are that it's fast, has never caused food poisoning and the food is consistent in meeting expectations (it was never good, so you can't expect something good and be disappointed).", "author": "April Y."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-09", "description": "We ordered take out from Lichee Nut last night and were more than pleasantly surprised. The food was fresh and piping hot, all adjustments to the order had been carefully followed and the servings were very generous. \n\nThe best part...in the little packet with the hot sauce, mustard and duck sauce were two tea bags carefully stashed so you can get the full restaurant experience in the comfort of your home. Not only that, but the fortunes were great!", "author": "Shira R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-10-23", "description": "In an effort to leave our beloved Hing Lung Kitchen behind, my boyfriend and I decided to try Chinese that was close to our new neighborhood.  We ordered from Lichee Nut and after one bite of their dumplings they made the cut.\n\nLet me preface this review with something mildly gross. There was a fly in our large container of sauce. Dead, but a fly. Normally this would have totally turned me off to my whole meal. Just thinking about it now makes me cringe but the dumplings and lemon chicken with brown rice we ordered was so good, we threw the fly sauce away and focused on the yummy food in-front of us. \n\n6 yummy pork fried dumplings each and a lemon chicken we shared later  we were full and our taste buds happy. Our meal came to about $22.50. I had a small wonton soup left over and am eating it now (1:30am) and it's plenty delicious and satisfying. \n\nWith out a doubt this is delicious Chinese. Despite the fly I will order from here again.", "author": "Valerie V."}], "servesCuisine": "Chinese", "priceRange": "Under $10", "name": "Lichee Nut", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "162 Montague St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/Nbj71pbUDGJsWDDhrQuo8A/ls.jpg", "@type": "Restaurant", "telephone": "+17185225565"}