{"aggregateRating": {"reviewCount": 258, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-10-21", "description": "If only there were a lower rating than one star. Guess you can't place stars on harassment.\n\nFirst, I ordered food delivery for myself and my two friends. After 1 1/2 hours, I called to check in and see if the food was on its way. They said it was on its way. 30 minutes later, still no food. My friend called and asked what their average delivery time was, and the woman said 30 minutes. The food did not come after 2 hours, so we eventually called back and asked to cancel our order. The whole process was confusing, annoying, and left us without lunch.\n\nFast forward a few minutes after we canceled, and the manager called me to clear up the issue. I told him it was fine and that we canceled it, but he proceeded to argue with me and tell me that I had put the wrong address (I didn't; I've had several food deliveries and Ubers to the address I used) and the wrong phone number (I didn't; I know my own phone number).\n\nI tried to end the call and hang up, but the manager kept pressing me that I used the wrong address, was extremely rude, and said \"you're so fucking stupid.\" I hung up at that point and blocked the number.\n\nUntil he called back on another number. My [male] friend told him to stop calling this number, and I blocked that one, too.\n\nWe ordered Chinese from a different place. I won't ever go back here, and I strongly recommend that you don't go to a place where the manager harasses customers. There are a million other Chinese food options in NYC (not to mention I had been to this place before, and the food is average at best).", "author": "Jessica H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-12-19", "description": "I've never posted a poor review before, but I was really grossed out, and thought I would make a PSA for potential customers and hoping management will take note and enforce more sanitary conditions in their restaurant. I found a long black hair inside my spring roll, AFTER I had swallowed my second bite. I wanted to throw up. It was obviously not mine, seeing as I do not have long dark hair, I have short blond hair. And you know, it was intertwined with my cabbage on the third bite.  I was not able to eat anything I ordered. Poorly enforced sanitary conditions, clearly. I will not be ordering from here again.", "author": "Hallie R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-07", "description": "Super cute location, cute area!\nFood is food\n\nScallion pancake is so good!\nSake is a lil weak\n\nI like this place\nI had a crispy shrimp, good good\nBig portions!! Extra for work-lunch :))", "author": "HonestAbe R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-09-14", "description": "Waiter rudely instructed my wife to be specific when she requested in both Mandarin and English plus pointed at the name of the dish. When we got our meal her Duck noodle soup had five bones and two peaces with small amount of meat. When she expressed her dissatisfaction, he said that this is how it is and this is how they do it. When we was at the point of just leaving he then offered to change the selection of meat. Two minutes later I heard a bing and it tasted like microwave on the first bite Stiff, tasteless and unpresentable. I feel shame that this place calls them self Chinese Restaurant. The Lichee was extremely powdery No Lichee!!!", "author": "James C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-25", "description": "It was okay. The sautéed spinach left my tongue tasting purely of msg and the pork scallion tasted okay but different from last time I ate in. The meat looked a little older like it was leftovers and they just re-cooked it. Everything was edible though and I didn't get sick. The spinach tasted like what a typical Chinese restaurant would make which is always comforting just be prepared for a lot of msg in that", "author": "Ellin L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-06", "description": "I ordered takeout from here...I ordered the Chicken and Broccoli lunch special with Brown Rice, Wonton Soup and a Spring roll all for under $15. Delivery was on time....a few minutes early, in fact, and the delivery man was very pleasant. I was served more rice than actual chicken and broccoli, but nonetheless, it was still filling. The food was not overly oily and I was left with leftovers until tomorrow. I am willing to order again and try other items on the menu.", "author": "Elizabeth M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-05-28", "description": "THERE WAS A STAPLE IN MY FOOD!!\n\nWhen I called to complain the response I received was 'accidents happen. We will refund the price of the dish.'  I was shocked and dismayed.  \n\nI have I idea what else was in my food.  I stopped eating the food but was sick for three days after with severe stomach pain.  I will NEVER order from this restaurant again!", "author": "AE F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-15", "description": "I do love the feature on Seamless - where it points out the most popular food items for restaurants. Which so speaks to me as a Yelper! I've ordered the beef with broccoli \u0026 the chicken version, both excellent. The delivery is incredibly fast and I've also ordered the crispy bean curd cakes, which arrive STILL crispy. When I crave faux Chinese food delivery, this is my top choice!", "author": "Shu Jin S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-16", "description": "decided to check out the dekalb market on a saturday. the place was a bit of a madhouse but i have seen worse. had a hankering  for some katz's deli pastrami. got on line, looked up at the menu and saw $21.45 for a sangwich. yeow! katz has become a place for tourists or hipsters who have lived in nyc for less than 5 years. no thanks, to either of your stores.. instead, we headed over to brooklyn heights and went to a hole in the wall that has not disappointed us in over 30 years. is lichee nut the best? nah, but after devouring an order of lemon chicken and shredded pork with peking sauce, life was good again. afterwards, a walk to the promenade for a beautiful nyc sunset. perfect.", "author": "Joel P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-09-14", "description": "Not to great. I ordered a chicken chao men to go and barley got any chicken and the vegetables where too big", "author": "Genesis A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-05-22", "description": "Used to love them but the last few times I ordered, the dish was all rice and like 4 tiny shrimp that were absolutely not fresh, actually tasked like they went bad. So I couldn't eat them anyway, and only ate the broccoli. For the price you'd think they'd use fresh food. Also, their wonton soup has zero flavor. Don't order it or any shrimp or seafood dish.", "author": "Tiffany R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-02-03", "description": "It completely befuddles me when someone slams a place like this for not serving up authentic Chinese food. If that's what you want, you're not likely to find it here...or anywhere on Montague Street for that matter. You come here for one thing and one thing only - Americanized Chinese food. \n\nLunch specials here are the way to go. You get an entree, your choice of soup or iced tea (think Lipton mix and water), and crispy wonton strips for $6.95, which rivals most meal prices in the area and given the amount of food you get for it, this is a great deal. Dining in also allows you free hot tea, though service can range wildly from warm to dismissive, and it all depends on timing. If you choose to stay during the lunch hour, expect brusque service - choose your order within seconds, eat it within fifteen, and no lingering after your plates have been taken away. Come during the quieter hours of the afternoon and you'll find that things slow down for the better. \n\nSince my lunch hour at work falls squarely during the chaotic period at Lichee Nut, I usually get takeout. I place my order from my desk at work, walk five to eight minutes to the restaurant, and my food is usually waiting for me by the time they get there. If I were a more suspicious person, I'd wonder if these people are secretly order-stalking me or hiring clairvoyant chefs to man the kitchen. Most of the time, I'm just happy that my hangries have found a quick cure. \n\nNote: any time I come to pick up the order, the lone woman at the desk is handling dining checks, answering the phone, AND disseminating takeouts. It is easy to ream them out for the snappy phone calls (and I've been on the other end of those once or twice), but the last time I was waiting there for about a minute for my food, the phone rang once. every. five. seconds. If I had to do that for a few hours, I imagine I'd soon violate some social norms of politeness. To avoid phone fights like the ones a few yelpers have mentioned, speak clearly, know what you're ordering, and choose your order options in advance (white/fried rice, soup/tea, etc.). Yelp provides the menu online. Use it. \n\nI generally order the broccoli with garlic sauce, and if you receive any 'with rice' entree in a takeout container from this place, it's going to seem like there is a disproportionate ratio of rice to entree, but fret not. After placing several orders here, I realized they plop the rice on last, so there's usually more food buried below it; you just have to dig for it. I find my food is usually a little oiler than I'd prefer (which might explain why I always feel like I need to take a nap underneath my desk after eating lunch from the Nut). I've also ordered the fried veggie dumplings which are all right. They're served with a soy sauce blend that gave the plump morsels some much-needed flavor.", "author": "Jane I."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-01-31", "description": "They gave me undercook chicken and it's sad because it smelled so good but when I separated the wings to get a better look it still looked a lil bloody, and undercooked never again.", "author": "F. Wendia O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-29", "description": "Love this Chinese-American restaurant. Never had a bad meal and they're so quick and courteous. This is my go to for Chinese food in this area.", "author": "Allana D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-04", "description": "Food is always awesome fast service and pleasant staff. I have always ordered from there and received my food in a reasonable time. \n\nI finally went to the restaraunt and took some friends and was not disappointed nor were they. The food and service were both excellent\n\n111/47B", "author": "Sandra W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-14", "description": "I guess I got lucky this time. I ordered pork lo mein and an iced tea was gladly given to me to try(although I declined the free inclusion). The iced tea was mostly water to my taste buds with a little Splenda added so, as I expected, I did not enjoy it that much. However, my actual meal was DIVINE! The noodles were juicy and the sauce that accompanied them complimented the dish very well. The pieces of pork were thinly sliced and cooked to perfection. I ordered take out and with the crowd that was present for lunch, I would suggest you do the same.", "author": "Steffi J."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-11-29", "description": "I like the food here, have ordered numerous times. But as a pescaterian it is quite annoying when I'll order a seafood dish and I'll get chicken instead, which has happened more than a few times. May need to stop ordering from here!", "author": "Edward C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-20", "description": "Not my favorite Chinese in the area but it is pretty good. I came during lunch for the special because I was in the area and starving. You get a lot of food in the lunch special. Service can be surly though.", "author": "Andrew D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-12-13", "description": "Rude! I've worked upstairs from this place for about 7 years but have never tried it because I am picky about Chinese food and worried that I wouldn't consider it good. Today I had a craving for spicy szechuan noodles, and figured I would give it a shot.\n\nIt was 1pm on a Sunday, the door to the restaurant was propped wide open, all of the lights were on, the neon OPEN sign was lit (!) so I walked in and there was a woman standing behind the front counter by the cash register. I said \"do you have spicy szechuan noodles?\" - she looked at me strangely for a few seconds (as if she thought I was going to rob her or something -- I had on yoga clothes ...), then finally very rudely said \"We are not open yet!!\" - that was it, nothing else. I stood there for a few seconds, somewhat taken aback, looked around again and there were no signs that the restaurant wasn't ready for business (again, the door was wide open, the lights were all on, and the open sign was lit!) so I said \"well, you are quite a friendly person aren't you\" and walked out. I will never go there again.\n\nI just looked at their website and yes it does say that they do not open until 1:30pm on Sundays but then don't prop your door open and turn all of your lights on! Also, one might not expect a restaurant to be closed through that much of the 'lunch hour' even if it is a weekend. Rude. Horrendous customer service.", "author": "Jen Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-29", "description": "I absolutely love this restaurant. I have come here three times and have yet to be disappointed [knock on wood].\n\nI work around the area so its pretty convenient just to call in my order or take the short walk to pick it up. The food is usually done within 15 minutes maximum and the food is cooked to perfection. I usually stick with the lunch menu [chicken and broccoli w| lo mein] and its only 7.50!! it comes with soup or iced tea. The iced tea is really good...nice and sweet. Plus, their chicken wings are amazing. \n\nI will definitely be coming here a lot during the year I am nearby. They are not rude and they are very attentive.\n\nHOWEVER The card minimum is $10 which can be annoying if all you want is a lunch special. Go with a friend and switch who pays each time. \n\nNo complaints!", "author": "Amanda R."}], "servesCuisine": "Chinese", "priceRange": "Under $10", "name": "Lichee Nut", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "162 Montague St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/Nbj71pbUDGJsWDDhrQuo8A/ls.jpg", "@type": "Restaurant", "telephone": "+17185225565"}