{"aggregateRating": {"reviewCount": 258, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-11-20", "description": "You better tip the delivery boy 25% or else he won't deliver!!!\n\nThere's something the irks me about people who are all high and mighty about receiving high tips for simple work.  I'm all for tipping when I think it's appropriate.  I intentionally overtip breakfast waitresses, good cabbies who carry a good conversation and/or get you to your destination fast, and delivery boys who get food to you fast and/or in inclement weather.\n\nLichee Nut is 2 blocks away from me, the weather is great outside, and there's little or no traffic.  Given this, the delivery boy dumped the food on the front desk and bolted out, citing that the tip was too low.  I had no way to verify the order before I received it.  On top of that, I called the listed number several times (which is a cell phone number, by the way), and they did not pick up.\n\nI will never order from here, and I highly suggest you don't either.  If they get your order wrong, what  can you do about it if the delivery boy takes off and the company won't pick up the phone?", "author": "Jeremy D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-19", "description": "Very rarely do I disagree with yelp ratings, but in this case I think Lichee Nut has received an undeserved bad rap. \n\nThis was one of the first places I came to in NY, so I have a certain fondness for it. That being said, every time I come here the food always comes out pretty fast and tastes good.\n\nDefinitely check it out if you are in the area. The Spicy Crispy Orange Beef is good, as are most of the chicken dishes.", "author": "Rob C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-07-30", "description": "If you can handle standard greasy Chinese take-out then this place is fine.  Otherwise spend the extra $ on a cab and cross the Manhattan Bridge into Chinatown. \n\nExpect all of your main courses to be overstuffed with celery, green peppers and other super-cheap fillers while the proteins appear in small diced pieces.  Also expect the kitchen to use the same wok and oil over and over again so the chicken, pork, shrimp and beef dishes all take on the same take-out flavor.\n\nOn a positive note: the beers are really cold, they serve sake (cold beer +hot sake combo is a fave) and the fried stuff is up to par for a takeout joint.", "author": "O U."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-01", "description": "Your basic cheap Chinese place. All the regulars- Lo Mein, Hot \u0026 Sour Soup, Dumplings. Don't come here looking for anything unique, or amazing food, but if you just want a fast, delicious and cheap meal, this is it. They have very good portions, especially if you go with the lunch specials. Definitely one of my regular spots in the neighborhood.", "author": "Dan J."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-01-25", "description": "Ok food. The shrimp and spring rolls are terrible. The food comes way to quick for delivery, I'm very suspect. What I have tried has been decent but nothing to shout about.", "author": "Tracy P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-04-03", "description": "Very standard American Chineese food. Not to greasy (not without grease either). Price is a little high but I think it's the best in the neighborhood for this \"class\" of Chineese. Gets here hot and fast with an occasional (1-3 times?) lost delivery guy/order. After sampling the offerings in this neighborhood/delivery zone i've always come back to Lichee Nut, so far anyway. \n\nI have never eaten in.", "author": "G Tyler R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-03-15", "description": "ZERO STARS - I normally don't bother with bad reviews because it wastes my time with negativity, but I feel forced right now to vent.  I ordered dinner at 6:50pm on a Sunday night... Veg dumplings, veg lo mein \u0026 broccoli w/ garlic sauce. Nothing major nor difficult for ANY Chinese restaurant. I figure it should be here in 30-40 mins max and we'd be eating by 7:30p. I call back at 7:55pm to ask about the delivery. I got yelled at for using a credit card (so why is it an option), told it was a Sunday night so they're busy and because I used a credit card my food has not even left yet and it could take another hour. Are you kidding me? And you couldn't tell me that over an hour ago when I ordered so I could find a better option? Needless to say I cancelled my order instead of waiting 2 hours for Chinese food. I ordered out tonight because I'm sick, I've been cleaning all day and I have a child as well as myself who needs dinner, the last thing I wanted to do tonight was cook and wash a sink full of dishes. Well now thanks to Lichee Nut I'm cooking dinner after my daughter is normally in bed. Please work on your customer service skills. I basically got yelled at for ordering dinner on a Sunday night from a restaurant in NYC. You are a restaurant, you offer delivery \u0026 you take credit cards, please reevaluate what you can handle and don't offer what you can't deliver... Literally", "author": "Courtney F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-06-27", "description": "I've been coming to Lichee Nut Restaurant for the past few years for their lunch specials.  I usually get the hot and sour soup, and chicken and broccoli with garlic sauce, with brown rice.  They provide free hot tea if you're eating in.  Overall, it's decent for Chinese take out food.  I really like their garlic sauce-- sweet and spicy, just the way it's supposed to be.  The food is pretty cheap compared to the rest of the eateries around the area.", "author": "Helen F."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-11-29", "description": "Not the worst Chinese I have had but really nothing memorable about this place. All the dishes were mediocre.", "author": "Wesley H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-01", "description": "I asked for General Tso's chicken, super spicy. Lichee Nut nailed it. It's one of the best spicy take out meals I have ever had.", "author": "Chris R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-05-01", "description": "Steamed Juicy Little Buns\n\nNot the worst I have had, but definitely not the quality of soup Dumpling of my favorites. The wrapper was too thin on the bottom and couldn't contain the bit of soup within. The soup was a bit sparse and on the greasy side. The meat was okay, but not as flavorful as I have had. The dipping sauce could have used more Ginger to add some extra bite to it. Overall, I did not hate it but still would not recommend ordering it next time.", "author": "Cynthia M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-06-25", "description": "In my opinion, this is definitely the best chinese food in the area. Ok, scratch that. Best fast, delivery chinese food in the area. I've tried Andy's, Number 1, etc and Lichee Nut delivers consistent American Chinese food. Give it a shot; I mean, if you're ordering fast Chinese food, are you really expecting gourmet?", "author": "Brittany H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-03-23", "description": "Food was alright, ordered lunch from seamless web and it came quickly and the delivery guy didn't say anything to me. Ordered the General Tso`s lunch special which tasted like you would expect it to. Nothing was remarkable but everything tasted decent and I would order again from them. Next time I'll probably order something more authentic but I was in the mood for something fried and sweet.", "author": "Matthew R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-05-02", "description": "This is standard Americanized Chinese food. Decent food at cheap prices (about $7 for a lunch special. The staff is true Chinese with a little bit of that rude demeanor thats acceptable amongst most Asian cultures. Ordered the Szechuan bean curd with pork fried rice and hot and sour soup. Overall a decent meal. Solid 3 stars.", "author": "Lucky M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-07-31", "description": "I am on a never-ending search for good Chinese food in Brooklyn.  I visit my Brooklyn friends often and we love Chinese food.  But, we can't find consistently good places to eat.  We recently tried Lichee Nut.  \n\nI am torn with this review.  I ordered the juicy buns.  Didn't like them.  The dough was too thick and they weren't juicy at all.  I eat juice buns a lot in Chinatown and elsewhere, so I have many samples to compare these to.  The juice buns here are a no no.  Perhaps it was an off day for the chef.  Who knows.  We also ordered the spicy tofu.  Didn't like it.  In fact, it had a funny taste to it.  I can't put my finger on it, but it was just off.  We barely ate it.  Finally, we ordered the spicy chicken with vegetables.  That was awesome.  Lots of flavor.  Ate all of it.  Could have ordered a second serving.\n\nOne dish gets a thumbs up.  The other two get thumbs down.  Should we try this place again?", "author": "Mimi R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-10-17", "description": "Good cheap clean food. Quick delivery and not greasy. Tasty pork bun for just under $2", "author": "Nick W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-24", "description": "This is my favorite chinese food joint. The food is not greasy at all and the price is very reasonable. The staff are friendly and the portion is great! It is located at a great location with parking that isn't too bad in the area. I usually get the beef with brocolli and white rice.", "author": "Kind V."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-12-24", "description": "I normally don't write negative reviews but I had the worst experience at LIchee Nut last night. While I appreciate speedy service, receiving my food 2 minutes after I ordered it was a little sketchy. The General Tsos was basically large chunks of deep fried bread with no meat at all.The sweet and sour pork also looked like fried nuggets doused in what appeared to be jarred sauce. I couldn't tell you what it tasted like but my boyfriend was brave enough to try a bite and but couldn't stomach another. Unfortunately we were never served water so we couldn't wash down the taste of whatever we were served. Thank god for movie popcorn to make up for our awful dinner.", "author": "Heather L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-18", "description": "Going to this hole in the wall restaurant was one of the best choices I made while in Brooklyn Heights. Upon entering my friend and I were seated promptly and served green tea. The menu is quite expansive and prices were cheap to reasonable. The service was surprisingly good and our server was actually very friendly. The food arrived within ten minutes of ordering and was absolutely delicious. I have had my fair share of Chinese food and while this isn't the best it certainly is not even close to the worst. I also really appreciated the atmosphere of the place as it was quite cozy and inviting. I would definitely come back here again.", "author": "Michael R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-11-01", "description": "There food isn't that great, but it's good enough to keep me coming back. I am a fan of their soups.  I go there often for their soup.  In my opinion, there are not many good chinese food restaurants in the court street / jay street / MetroTech area so this one takes the cake for me. \n\nI can't say I'd continue to go here if I found better, but if you like Hot and Sour or Egg drop soup or chicken and broccoli as much as I do and are in the mood for chinese, it's a win win. Oh and the price is in line with most brooklyn chinese restaurants.", "author": "M R."}], "servesCuisine": "Chinese", "priceRange": "Under $10", "name": "Lichee Nut", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "162 Montague St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/Nbj71pbUDGJsWDDhrQuo8A/ls.jpg", "@type": "Restaurant", "telephone": "+17185225565"}