{"aggregateRating": {"reviewCount": 258, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-09-19", "description": "Great place for quick, simple run of the mill Chinese on Montague.  Staff are quick and efficient.", "author": "Edward O."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-12-08", "description": "Let me preface this review by letting you know I'm half chinese.  Within our family there is something special that has passed down from generation to generation, which is the ancient remedy to the hangover....What we do is order the greasiest dishes we can think of, and have them delivered along with 2 ginger ales.  \n\nThat being said here was my experience with Lichee Nut:\n\n  * Speed: Not long at all\n  * Price: Not expensive\n  * Food: Not so bad (except the wings, those were bad)\n  * Other:  The delivery guy hooked me w/ a free calendar...", "author": "B B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2008-11-07", "description": "Lichee is so-so.\n\nThere is NOTHING special about this place however, it is always packed around lunchtime. For lunch ($5.95), you get your dish, choice of soup/iced tea, and fortune cookie. No doubt, you do get lots of rice but only 2-3 pieces of chicken/beef/veggies?!!?!? Also, the food is oily especially the wonton soup. The chow mein is bland and full of veggies. \n\nDefinitely can get better food somewhere else.", "author": "Yoshi W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-11-25", "description": "Great lunch special.  $6.50 includes entree, hot tea and soup.  Add an egg roll and you're talking $8 for a ton of good food and fast service.", "author": "Charles G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-03-21", "description": "ive ordered from here when im in the hieghts and its good but when i order from cobble hill i get half of the food andits cold and  the dumpling are burnt if your in the hieghts they treat you well butt the rest they dont care about", "author": "Matthew M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2008-12-26", "description": "This is a place where you come in to eat and then leave. Not a place really to have a long, good talk. The servers know you're there to eat and eat only. Food is okay. I like General Tso's chicken more than the plate I ordered (chicken and broccoli). Cheap, fast, good to fill your belly, but not really satisfying. Leaves a little ugggh feeling. But that's Chinese food for ya!", "author": "Amy F."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2009-11-30", "description": "I tried this place for delivery and it was your standard Chinese food, but I won't be order from them again because:\n\n1.  The delivery guy had a fit because it took me all of 30 seconds to get to the door.  I'm on a 3rd floor walk-up with no buzzer, give me a break!  By the way - when you curse outside of my door, I can hear you.\n\n2.  They brought the complete wrong dish.  When I called to tell them they said \"okay bye\".  I wasn't sure if they were redelivering or what, so I waited around for a while.  After 45 minutes I called back and they said they would bring it \"right away\".  I asked them to just cancel it, but they refused, so I had them redeliver - I didn't want to be out the money for something I didn't even want - and then I had to dig the wrong dish out of the trash because they needed it back.  Argh!\n\n3.  The shrimp rolls were heavy and cakey.  Kind of like uncooked shrimp-flavored dough with a flaky crust.  Not yummy.\n\nSadly I won't be using this place again, although when I did finally get my order it wasn't too bad.", "author": "Lin O."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-03-14", "description": "This place is successful simply because the dishes are priced right and the portions are generous.  The kitchen is willing to make a dish \"your way\" - no sauce, no sodium, no MSG, extra broccoli, etc.  Don't expect a gastonomic experience.  It's just a place to go for chinese food when you are just too tired to cook.", "author": "Undercova A."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2009-04-04", "description": "\"Sushi\" in a tacky neon sign, displayed at the window.  Hm, good?  So, just dropped in, and saw for only $4 to $5 you get a pretty good lunch?\nNo.  I looked at this guy that ordered before me.  Would I want to eat a slimy looking soup with some type of... beef.. no chicken.. is that fish!?!  My conscience was telling me to back out.  This place is a dive.\n\nSo I left.  Maybe I'll stop back in but I doubt it.", "author": "Thea T."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2009-10-05", "description": "Mediocre, bland food.  Six of us ate dinner there, had a wide variety of dishes, from Gen Tso's Chicken to tofu \u0026 veggies to a shrimp dish.  None were memorable or particularly tasty.\n\nOn the plus side?  1) It wasn't hard to get a table for 6 as walk-ins on a Saturday night; 2) Maybe the cheapest place for a sit-down dinner in Brooklyn Heights.", "author": "Nick Z."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2008-09-12", "description": "Went here on Thursday evening with my husband. We got the front window seat. I ordered the mixed vegetables and wheat gluten with brown rice. It was delicious, fast, clean and the servers were helpful and friendly. The bathroom was very clean.\n\nOrdered the same thing from them for delivery and was equally satisfied.\n\nWorthy of a warm, midweek meal.", "author": "Nancy S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-05-22", "description": "when i'm in the area i go for the lunch special for $4.50, but this time i went for dinner, average food, average sauces -too sugary thick heavy.  Now i know why it was only crowded at brunch.  its not worth over 4.50 spending it there ..skip it for dinner.  Food wasn't gross thos just average.  And I wanted to try a taste of the wine, you know it IS a chinese restaurant and the fucking waiter wouldnt let me have a sip first.  I had to buy a glass. plus his english sucked.  when im going to a place i want to relax not teach english and struggle.. THATS WHY 2 stars", "author": "Frankie Y."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-23", "description": "one of the two chinese resturaunts worth going to from carrol gardens to the heights either go here or good fortune on henry street for rel chinese food there is know where else that comes close  the rest are quick take out joints that sell chicken wings and fench fries in dirty oil  . i been eating chinese food for 23 years and stayed up on all of the places around me and hos are the only two worth a dime trust me i would not steer you wrong we had more in the past but are long gone , they just shut down red apple on court and sackett for being a dirty place board of healh came in and shut them down ,", "author": "Francesco B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-20", "description": "Cheap, high-quality American Chinese.  It's cheap, well-decorated (if kitschy), tasty, the vegetables are fresh, and the bathroom was clean.", "author": "Jake B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-05", "description": "i enjoy this food all the time, i always walk all the way from fort green to go to get some of their food. it's a long walk but worth it and their lunch specials are good too.", "author": "joey p."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-03-20", "description": "I ordered takeout a while back and it was so yummy!  the garlic chicken and the sesame chicken were both really flavorful and great.  Will definitely be ordering again.", "author": "Jane D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-06-18", "description": "i've ordered from here a bunch of times and i've noticed there very stingy  when it comes to the chicken and shrimp. they will give you a huge bowl of rice with nooo type of meat. but today enough was enough. ive ordered chicken and shrimp with white rice and a wonton soup. the chips for the wonton soup was stale, fortune cookie was also stale, the bowl was packed up with rice which had mushrooms (im allergic too)and only one shrimp!!!!! i called back the owner answered i explained to him that the wonton soup chips were expired and they was hardly any shrimp in the bowl. then he started yelling at me telling me that i should've said i was allergic to mushrooms and that i ordered the shrimp chicken delight!!!!!! i began to get heated over the phone and explaining to him that i never ordered the delight i ordered just the chicken and shrimp. he also told me that he don't know if i can afford the meal that im relating too.  that just got me furious so i just went inside the store personally to see what his issue was..please dont buy from this place they food is stale and on top of that there very disrespectful to customers!!!!!!!!!!!!!!!!!!!!!!!!!!", "author": "Fantasia I."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2009-08-24", "description": "Normally this restaurant is a staple on the 'good enough' circuit in Brooklyn Heights, but tonight Lychee Nut has earned a permanent place in family history as the worst Chinese restaurant...ever!  Here is the true story. \nOur $40 dinner for 5 began with Egg rolls and egg-drop soup.  The egg rolls were a bit brown in appearance, but  when I bit into one, it was literally charred on the inside - I had to spit it out immediately, ungracefully.  Bleh.  Wonton Soup was suspicious, but the fried wonton strips that came with it tasted and smelled and tasted like crayons (crayons!).  We dredged the strips back out but the soup was just too awful to continue.  \nNext up: steamed pork dumplings, a mass of gooey grey mushballs.  These were impressive because the inside was bright pink pork grindings - too pink.  Subsequent extended microwaving did not cook the pork - perhaps it was fireproof.    The shrimp dumplings appeared passable (literally 'not bad') to the rest of the table, I was too afraid to try them.\nOur main course, which was still technically the appetizer because we didn't actually eat anything of substance yet: Slimy Chicken fried rice and burned-pork pork fried rice.  The chicken was cooked, but suspiciously soft: we decided it was too suspicious to eat and scraped it off our plates.  The scraped plates looked like we'd been eating steamed okra.   \nDesperate, we finished with the fortune cookies.  At this point the meal had fallen into a comedy of food disparagement.  Joining in, I bet the table that 'at least the fortune cookies would be good, as they were shrink wrapped'  luckily nobody took me up on the bet.  Instead of breaking in half, these cookies were so rubbery and tough it took a few cycles to break it open.  Our youngest gently unfolded his into a shape that resembled the ear-shaped eavesdropper from Harry Potter.  In the most poignant piece of fortune cookie irony ever, my fortune was: \n  Aren't you glad you just ate a great meal!\nTo cap it all off, we had to scrape all this 'food' back into a huge garbage bag and lug it back down four floors to the garbage.  \n\nObviously I am upset - at the food, at the huge waste of time that includes getting more food, and at my fellow Yelp raters for giving this place such a high average rating.  At best this place is just average.  \n\nDear owners: please take it upon yourselves to dramatically improve or go out of business quickly - people do not deserve this.", "author": "Scott L."}], "servesCuisine": "Chinese", "priceRange": "Under $10", "name": "Lichee Nut", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "162 Montague St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/Nbj71pbUDGJsWDDhrQuo8A/ls.jpg", "@type": "Restaurant", "telephone": "+17185225565"}