{"aggregateRating": {"reviewCount": 258, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-01-31", "description": "I've been coming here for years (11+). Only place I'll eat beef and broccoli from.  Lunch special is $6.50 and it comes with a beverage. Can't speak on anything else.", "author": "Cassie V."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-03-28", "description": "This waiter was a complete asshole and asked for a larger tip after I gave him 10 dollars EXTRA. His service was so awful that I did not even receive a glass of water when I was seated. Lastly when me and my friend were leaving he told me to \"take it to go next time!\" I am horrified.", "author": "Zayn M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-10-28", "description": "The food is good and the prices are even better, so I will probably go back, HOWEVER....\n\nThe service leaves much to be desired. I went by myself during my lunch break and they sat me right next to a group of 3 men who were to my right, and who stared at me the whole time. Awkward. Then, because they have the tables arranged such that two two-person tables are grouped together, they sat a man down at the table that was doubled with my table, to my left, so it was even more awkward. He was staring at my bill (that they gave me AS SOON AS THEY BROUGHT MY FOOD) which was awkward. At this point, all I could do was stare at my food or stare straight ahead. Let me point out that there were PLENTY OF OTHER TABLES where they could have seated me as well as the guy whom they seated right next to me to the left, so that we would have been spread out and more comfortable, but for their own convenience, as opposed to the customer's convenience, they chose to cram us all together. However, there was another woman  patron sitting alone and she didn't have to be crammed with other people so I don't even know what determines where they seat their customers. \n\nThey also questioned whether I even wanted to see the menu at all and as soon as they handed it to me they practically pounced on me to put my order in, and again, as soon as they brought the food, they brought the check (although they did not do this to the aforementioned party of 3 men seated to the right of me). They didn't even ask if I wanted anything else or if I wanted dessert. Of course, this is convenient for me because whenever I go there, it's usually for my lunch break, so the clock is ticking, but it's still not proper etiquette and gives off the appearance that they are trying to get you in and out as quick as possible for their own sake.\n\nThe waiter I've had the past two times wasn't pleasant at all. Also, in order to get by, this waiter gruffly pushed in a chair, the legs of which my foot was leaning against, as it was the chair in front of me, which effectively pushed my foot in. Even though he probably didn't realize that my foot was leaning on the leg, he could have been a little more cautious and poised about how he navigates the restaurant.\n\nIn sum, the seating arrangement is horribly awkward and the overall service is unsatisfactory, although quick. The food is decent and the prices are great, which is why I would go back anyway.", "author": "Cindi W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-11-03", "description": "Oh do you need a quick meal before your next class and craving chinese food? Happen to pass by this dumb. Don't even consider eating at Lichee! Their lunch portions are all messed up and you can tell they don't care about their guest. This is not the first time I've  been disapointed by this place and I'm sure I'm  not the only customer who has had this experience. Cheap and disgusting. Totally not worth the 13 dollars I've spent on shrimp and brocolli. With an iced tea and crabmeat wontons. This place needs a new kitchen staff and needs to feed people as if they are feeding their own family. Never ever going to this place ever again!", "author": "Jimmy J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-19", "description": "The much special is a great deal. Sitting down and eating in the Establishment is nice but be ready leave a tip because they are expecting it. The food is good. But he phone service is somewhat lousy. They are literally answering three phones at one shot. They have an ice tea that is very addicting. For lunch, food is ready for pick-up in five minutes. Any faster, you would think they had telepathy. I've had dinner there. Their scallion pancakes are on a  gourmet level. Presentation is on a gourmet level. However dinner is almost 3 times more than lunch for almost the same quantity of food.", "author": "Aunkhofmishra .."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-07-19", "description": "I stopped in here on accident for lunch one afternoon during the week. I can tell you its very busy during lunch time hours you almost feel like you need to order fast inhale your food and get out. Its not relaxing to say the least. I was alone and as most people i had to wait for a table. But then your rushed for everything you can almost feel the anxiety attack the employees are having.  Then i get the bill of course i was still eating, and they tell you theres a minimum or cash only so i had to go get cash and they act like your not going to come back!? The food wasn't worth it but its cheep so if thats what your looking for take it to go.", "author": "Brooklynbaby R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-01-31", "description": "I happened to pass this restaurant while heading to the Brooklyn Bridge Park. Overall, the food was good. I particularly like the restaurant's family atmosphere and the service was excellent. The waiters were on point with speedy service. Tonight I ate the Salt pepper chicken. While it was good to try, it will probably not be something I'll buy again. It was a bit blander than I had anticipated. A lot of other customers purchased the scallion pancakes.", "author": "Michael B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-05-23", "description": "The main reason I'm writing this is the very very bad service we received by the waiter. The waiter didn't respect us and didn't treat us properly. But overall the food is delicious. They need to fire all their current waiters and get a new better waiter, then their restaurant will be booming. \n\nThe Problems: \n1. waiter shouting at customers\n2. waiter coming to take your order right after a minute they just gave you the menu. \n3. waiter coming to give you the bill/check when you're not even finished with eating food because they wanted  you to leave quickly and let more customers to come in. \n4. when you give tips, waiter demand it in cash and at least minimum $3. \n5. waiter talking very aloud with their coworker to the point where all the customers can hear. \n\nMe and three of my friends came here to eat since we love asian foods. When we walked in around 6pm on tuesday, we saw the left side of restaurant is where all of the customers are sitting and the right side of the restaurant is empty. So when we went to sit to the empty chairs in right side of the restaurant, the waiter said \"it is for reserved only,\" in a bad way by shouting. So we were assigned to sit in the left side of the restaurant. \n\nWe sat down on not-reserved section and the waiter handed us the menu. While we sat and deciding on what to order. The waiter came back right to us right after one minute to take our order, it was so fast. We all weren't ready to order. But my friends ordered their food what they usually eat at chinese restaurant anyway. I told the waiter, I'm still deciding and come back after one minute. When I was ready to order, I called him over and ordered my food. \n\nThe food came at our table. The food looked delicious and it also tasted delicious too. The waiter gave us check when we are not even finish eating. They wanted us to leave quickly so more customers can come in. \n\nwhen we were standing up to leave the table, the waiter said \"shu shu shu shu\" by pushing us slightly, so we talked among our friends saying how rude that is when we were leaving. The manager or the person who is at cashier witnessed and heard our whole leaving the restaurant situation and yet didn't even do or say nothing. HOW DISAPPOINTING.\n\nDelicious food but very very bad service by the waiter. The worst service me and my friends have ever experienced in our  whole life.", "author": "Ten N."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-04-12", "description": "Ok, I'm a Californian.  I'm visiting.  Perhaps you folks here have a different lingo, like when we say \"Excuse me\" you say \"Go fuck yourself\".  However, when I order chow mein, I expect there to be NOODLES in it, for Christ's sake!  I had 80% broth, onions, green veggies, the meats, and a handful of small slivers of clear noodles.  Did I miss something in the time zone difference?  My brother, who has been living here since 2007, also seemed equally puzzled, but he thinks Panda Express is the pinnacle of good Chinese cookin', so his opinion is not worth much.  \n\nIf so, good, let's all laugh at the idiot from California.  Suffice it to say that on the left coast, chow mein means a shitload of noodles, thick and yellowish/brown with a handful of carrots/celery tossed in!", "author": "Andrew P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-08-22", "description": "This menu is just too easy to have fun with: \"Steamed Little Juicy Buns\", \"Pu Pu Platter\", \"Yo-Yo Chicken\"...\n\nAnyhow, my experience with this place was through a delivery order. Got to love the ease of seamlessweb.com menu ordering websites. However, when I entered everything into the website, it said they didn't deliver to my apartment; which is only 0.7 miles away. I called to clarify, and after only giving my address number  to the nice gentleman over the phone, he completed my street address. Ok, now I am good to go...except that after giving my order and being told it would take 30-45 minutes, it took an hour and 20 minutes. (stomach growls)\n\nOnto the food:\n\nI got the steamed little juicy buns and they were indeed little but not juicy. I do like my buns juicy! (add your dirty quip here)\nThe roast pork entrée was fair. A bit liquid-y but fair. I was hoping the roast pork to be more of a roasty and succulent nature. However it was your typical thin slices of barbeque pork with the bright red outer layer. Some pieces were nice and fatty, but most were nothing to write home about.\n\nThe hot and sour soup had good flavor. It was a bit lacking in the quantity of chunks of ingredients. There were pieces of tofu and meat here and there, but for the most part, the soup was just liquid.\n\nThank you for the drug baggie of sauces and fortune cookies. How nice!! However, I would have appreciated some utensils next time as well.\n\nFair overall. Slow delivery (ordered on a Saturday night), fair food but nothing great. Prices were great! Will likely give it another try and see how it is...", "author": "Eric Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-24", "description": "This is my go-to Chinese restaurant in my area of Brooklyn.  I order from here weekly (for the last 5 years) and have never been disappointed. My food is always delivered within 40 minutes and piping hot! My favorites are the Buddhist Feast, Hot \u0026 Sour Soup, and Stir Fry Shrimp. I'm not sure why Lichee Nut only has 3 stars when they are exceptional. I wish I could give them 10 stars!!!", "author": "Angela S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-09-06", "description": "To be honest, it is not good Chinese food. The staff here is nice but might not go there again.", "author": "Joanne J."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-04-01", "description": "First Impression: I love this place! \n\nUsual Platter: Shrimp with Walnuts \u0026 brown rice. New fave: Beef and Broccoli with White rice and lemons on the side. \n\nOverall Review:  \n\nAtmosphere: The place is very well decorated: The mahogany tables, wood paneling and the tea kettles on every table make it feel like such a comfortable place to dine. From the hours of 11AM to about 2:30 PM the place us buzzing. Seating is limited and you might end up at a small table right next to other diner's but the atmosphere is so fun that you don't mind too much. \n\nFood: The portions are decent. The taste in the food isn't as flavorful as the Chinese food I usually eat but it might be because the food is healthier.  Their shrimp are really small but good.  Each table has chips with a small bowl of duck sauce, and a tin kettle of hot tea. The flavors go very well together and its a great snack before and during your meal. \n\nService: The servers for the most part rush back and forth and aren't exactly attentive or sweet or anything, but they bring the food pretty expeditiously \n\nThumbs down for: The majority of the servers do not understand English very well. The servers are very fast and sometimes they walk away when I haven't finished explaining my order. \n\nThumbs up: The ambiance. The table and platter presentations. The Owners (husband and wife I think) very sweet couple who take the establishment seriously. The delivery comes fairly quickly. \n\nI dig \"Lichee Nut\"", "author": "Kassandra O."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-06", "description": "Decent Chinese food w generous portions! Also, they sell coffee flavored bubble tea goodness! (Beware: if you attempt to walk with the super flimsy cup, you WILL be doused from head to toe in bubble tea...that is the reality of the lids inability to contain the bubble tea inside the cup). Also the young guy waiter can be rude in an extremely comical way. Not sure if anyone else except me will find it funny.", "author": "lena p."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-12-07", "description": "I just called here to place an order for delivery, and afterwards I told the man that I would be paying with card. After him rambling on the phone I asked him to repeat himself, he shouted at me,  \"I'm too busy to put in your card number, call back later.\" And he canceled my order.  Very unprofessional, and rude!", "author": "Jessica D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-18", "description": "Alright, I need to come to the defense of this place. Lichee Nut is not reinventing the wheel... there are no special ultra-spicy Szechuan specialties or Kung Pao pastrami. They provide what I like to think of as Chinese comfort food... essentially the same types of dishes I was eating off Chinese menus since the 1980s (Sesame Chicken, Beef and Broccoli etc.). \n\nThere's several places like this in Brooklyn Heights, and I think Lichee Nut is the best. The food is affordable, and it always arrives INSANELY fast and is hot and freshly prepared.\n\nIt's what I look for in a cheap neighborhood delivery place, so it gets 4 stars from me.", "author": "Ben A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-08-15", "description": "Litchee Nut has been my go to Chinese restaurant for over 25 years. My favorite dishes are tasty, satisfying and consistent.  My out of town guests were always pleased. Until last week. I ordered in as usual and was  shocked over how awful the food was. The egg rolls were dry and missing ingredients. The sauce was watery on the beef dish. They explained that the cook was new. Not even a sorry nor an offer to pick it up and refund. Never mind the ugly physical space. Never mind the now poor food.", "author": "Ken R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-12-27", "description": "Good lunch specials and fast delivery. While pricey for chinese food in comparison to Chinatown, the ingredients are fresher than neighboring places. I had the broccoli chicken, and string beans - all decent.", "author": "Jess W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-01-09", "description": "If it was possible to give this restaurant zero stars that is what I would have rated them.  Food is inedible.  I wouldn't recommend this place, there has to be better.  Meat in won tons is hard grizzle, chicken in dishes (you have to pay extra for white meat chicken) is disgusting.  Management is a joke, stay away from this place....", "author": "Heather F."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-12-26", "description": "This place doesn't have enough one star ratings.\n\nAfter walking around with a friend of mine for an hour trying to figure out what to eat we decided on this place realizing we had a craving for Chinese (originally I wanted Thai - he didn't). I'm only in Brooklyn for the week house-sitting for a friend and I don't know the area well but I remembered seeing this take out menu left out for me in the apartment.\n\nWhen we sat down I didn't really know what to expect. I saw a good amount of people in there and thought it couldn't possibly be that bad. BOY WAS I WRONG! After being seated our waiter came over about 10 minutes later and then impatiently took our drink order. He brought over two glasses of waters. I took a sip and thought I was drinking seltzer. It was disgusting. I noticed that our water had bubbles in it from dirty glasses. I stuck to the tea.\n\nWe ordered our food and again the water impatiently took our order with a straight face. The food came out in mere minutes. This raised a cautious flag in my head. \"How fresh is this food?\" I asked myself. I had the Szechuan Bean Curd and it was absolutely disgusting. Less than halfway through I realized that my food was served on a dirty plate. Every so often when I looked around the restaurant our waiter was looking at our table smirking. Odd... I also had the Steamed Veggie Dumplings which were bland and rubbery and also served on a dirty plate that was obviously scrapped to give the impression that it was cleaned but it wasn't.\n\nMy friend actually enjoyed his Beef Fried Rice even though, to me, it looked pretty gross. I couldn't tell if this was also served on a dirty plate but I had a good idea that it might have been. My brown rice also tasted burnt. And now I sit here with a little bit of a stomach ache and a queasy feeling. I'll never recommend this place to anyone and I'll never go back. This has truly been my WORST experience with Chinese food. I almost don't even want to review this for the 1 star that it gets. It really deserves none. By the end of the meal a different waiter was hovering around our table and as soon as we placed the tip down he came over, while we were still sitting, picked it up and left to the kitchen.\n\nI don't understand how this place gets average or even above average reviews.", "author": "David M."}], "servesCuisine": "Chinese", "priceRange": "Under $10", "name": "Lichee Nut", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "162 Montague St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/Nbj71pbUDGJsWDDhrQuo8A/ls.jpg", "@type": "Restaurant", "telephone": "+17185225565"}