{"aggregateRating": {"reviewCount": 258, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-16", "description": "Very good. Super fast delivery and the delivery man was actually friendly! A rare find in this town. Everything was perfectly cooked, good flavors and nice and hot.", "author": "Sydney O."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-10-30", "description": "Submitted order on Seamless: 7:33p\nCalls placed to restaurant to enquirer about delivery: 41\nCalls answered: 0\nReceived food: 8:54p\nDelivery guy explanation: \"No English\"\nCongrats Lichee Nut on distinguishing yourself from a pack of bad Montague Street restaurant as absolute the worst.", "author": "Alex B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-04-19", "description": "At relatively cheap cost, one can satisfy their Chinatown cravings right here in Brooklyn Heights!  I recently tried their moo shu pork and found it to be nearly perfect, almost a revelation...  Probably the best moo she pork I've ever had!  Then again, I don't order it frequently, so that bold claim I just made probably doesn't mean much.  Their scallion pancakes are also good.\n\nThe service is friendly, but they are sometimes slow bringing the food out and providing water refills.  However, those are only minor annoyances to me.", "author": "Jaszon S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-22", "description": "Delicious food! Great lunch special. Love the chicken and broccoli with garlic sauce.", "author": "Lauren J."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-06-08", "description": "Food was mediocre. Ordered three times form here...should have stopped at the second time to be honest. Delivery was slow and food lacked flavor. Will not be ordering again. Had better Chinese food at shanty looking Chinese food spots.", "author": "Karim A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-03-30", "description": "Delivery guy was incredibly rude and the food was terrible. Possibly some of the worst Chinese food I have ever had. My girlfriend threw up from the dumplings.\nSteer clear of this disgusting restaurant\n\n-her husband", "author": "Alicia C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-01-01", "description": "The scallion pancakes are boss, the steamed dumplings, ribs, potstickers and fish cakes you should skip, pork fried rice and cheese/crab wontons are alright, but stay away from those bubble teas! - tasted like really sweet baby formula with super hard (not chewy) tapioca.  Decent take out though a little on the pricey side for the quality you get.", "author": "Rachelle R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-05-20", "description": "Changed the management... Not good they have not told it... The recipes changed. Service is friendlier but the other recipes were better... Miss it.", "author": "Paloma D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-01-04", "description": "5 or so years later I decided to try it again to see if things have changed. How is this place still in business? Ordered the general tso chicken with white rice. Simple right? Not. Rice was soggy yet again, and the chicken? Hard, bland with a soggy/mushy texture and overly sweet sauce. Yuck. Never will I ever come back here. I have yet to try a worse chinese spot in nyc than this place.", "author": "Jacob R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-01-02", "description": "I'm back to boycotting this joint.  I like the food but too many of the staff remain too mean or disrespectful.  So eh, for now.", "author": "Curtis J."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-12-30", "description": "Very mediocre...literally worse than Chinese fast food. Returned the lemon sauce fried chicken and shrimps to the kitchen and asked them to add tao's sauce. And it's still pretty disappointing...", "author": "Yanni Y."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-07-02", "description": "Lichee Nut is an old standby for whenever I'm visiting my sister and brother-in-law in Brooklyn Heights, and while it's not gourmet by any stretch, its full of the humble charm that defines the neighborhood.\n\nVery warm and comfortable lighting, with a soft wood decor--along with those cheap red ribbons and banners that every Chinese restaurant seems to have. There are a few small flies flitting about fairly consistently, though; not enough to bring the health rating into question, but it can be bothersome.\n\nI order their pork bun appetizer pretty regularly--which I shouldn't, because it's as filling as a full meal. The outer bread melts slowly in your hands, as does the pork while you chew. Their veggie dumplings are surprisingly good too; most vegetable dumplings tend to have a stringy quality. They also don't come apart and lash at your lips, like the incomparable but murderously hot dumplings at Prosperity. They're dense and satisfyingly chewy, even if the taste is a little flat. \n\nIt's the entrees that bring Lichee Nut into the realm of comfort food. Portions are generous, and even their eggplant with garlic sauce is as filling as their meat-centric dishes. My favorites are their General Tso's chicken and shrimp. Avoid dishes that try to do too much, however. For example, the Phoenix and Dragon promises a lot: tender chicken and succulent shrimp merging in a yin yang of Schezuan and sweet-and-sour sauce, along with veggies and mushrooms. The chicken ends up overpowering the shrimp--and the plate has more chicken than shrimp, perhaps in acknowledgement of this. I found myself resorting to the shrimp for a break from the chicken, and the taste of the chicken was only amplified by my dissatisfaction with the shrimp. But the veggies were great as always (the bell peppers are consistently crisp), and the mushrooms were perfectly complimented by the Schezuan sauce. \n\nLichee Nut is always a relaxing experience with a decent group. Don't go alone for lunch if you're uncomfortable being watched, though, because the staff hovers insistently--especially if you like to sit with your food for a while before taking care of the check.", "author": "Nick M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-06", "description": "Second best pork fried dumplings I've had in Brooklyn.  Perfect dough to pork ratio.  The Diced Chicken with Hot Pepper Sauce was too hot for me! but then again I am no warrior when it comes to spicy food.  I generally don't really like walking downstairs to eat.  I personally prefer to eat above ground (just my personal preference), but I totally forgot I was underground at Lichee Nut, I guess the dumplings are just that good.", "author": "Russell J."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-12-30", "description": "Food is extremely bland and watery. The dumpling skin is just way too thick. Was one of the worst places I ate on Montague street. Never coming back again.", "author": "Syed A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-12-14", "description": "The food is decent, but over priced. The staff is nasty which is why I'm giving them one star. Called to complain about being over charged, told them I didn't want anything in return but I just wanted to make them aware of the situation and the guy on the other end began yelling at me. I will never return, if you want decent Chinese food for a better price, go to Great Wall on Henry St. Same quality food but cheaper with much less attitude.", "author": "Danielle G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-13", "description": "Very kind owners \u0026 staff, super helpful when I called \u0026 visited their restaurant.  I don't crave Chinese food often but when I do this is where I go in Brooklyn Heights.  Thank you again!", "author": "Ben L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-21", "description": "12 minutes from my Seamless confirmation email to my doorstep.\n\nPiping hot. Not greasy. Egg drop was better than the anonymous cornstarchy stuff you often get. Egg roll super crisp and tasty. The home-style chicken was spicy enough to satisfy my urge for heat. \n\nDefinitely a step above most neighborhood joints, in my opinion. But Chinese food is so personal. I think that if all my orders turn out as well as my order tonight then I've found MY go-to spot in Boerum Hill.", "author": "P M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-11-30", "description": "I ordered delivery from them and I ended up having to throw most of the food away because there were hairs in the food. So I can't rate the food but if I could give the hygiene less than one star I would.", "author": "Justin O."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-14", "description": "I used to order from here frequently when my mom worked in the area and I would come visit her. I remember always loving the chicken with broccoli. I came here this past weekend, the food was just as good as I remember. I tried the sesame chicken lunch special which is such a great deal. Iced tea rice and chicken all for 6.50. The only downside is the place was empty but like other reviews it felt rushed. We barely started eating when the check was placed down on the table. That didn't let us feel rushed though. I would come back it's cheap quick and good food.", "author": "Lucia C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-04", "description": "I'll amend this later, when I've tried other things from their menu, but they get 5 stars JUST for their fried rice. I've had the shrimp fried rice, and the chicken fried rice and both were awesome. It wasn't that cheap, hard yellowish rice that you get from regular Chinese spots. It was so good and well made. And their service is speedy.", "author": "Sonjay M."}], "servesCuisine": "Chinese", "priceRange": "Under $10", "name": "Lichee Nut", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "162 Montague St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/Nbj71pbUDGJsWDDhrQuo8A/ls.jpg", "@type": "Restaurant", "telephone": "+17185225565"}