{"aggregateRating": {"reviewCount": 258, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-01-09", "description": "I love Lichee nut. Their service be it delivery, take out, or sit-in is great. They are quick and their food is some of the best in the area in terms of chinese. \n\nI go there consistently.", "author": "Jose C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-03", "description": "Before I moved to Brooklyn, trips to visit my boyfriend in Brooklyn were always filled with the anticipation of ordering from Lichee Nut at some point during the weekend. Why? Their sesame chicken has to be the best sesame chicken I've ever had in my life. The crunchiness to sauce ratio is perfection--no soggy chicken here! And the taste is wonderful. Now that I live here I see more sesame chicken in my future!", "author": "SM R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-06-22", "description": "So I've been here twice.  The food is pretty good.  It's hard to find good a good sit down chinese restaurant  in Brooklyn. They serve you tea and crunchy noodles with duck sauce before your meal arrives.  But the staff is kinda pushy, like they are in a rush for you to order your food.  That's the only negative.", "author": "CANDICE H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-05", "description": "The best worst Chinese food in the area. If you're looking for American-Chinese food in the area then check it out. Prices are cheap and portions are large.\nServers are constantly trying to rush you out for some reason, even though the place is always empty.\nThere isn't much else to say...don't go out of your way for it but if you live in the area it is great and cheap.", "author": "Darren G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-29", "description": "It's awesome to find a American Chinese restaurant that's local and worthy of repeat business. The veggie dumplings were great, as was the chicken and broccoli (the dish by which I judge all Chinese restaurants). The decor is very much no-frills, but the staff was very accommodating and there were many people eating there, which says a lot.", "author": "Alyssa S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-20", "description": "Very good food and service. We recommend it. Gary (North Carolina)", "author": "Gary J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-04", "description": "I always find them friendly, and the food is always fast and fresh. Favorite item by far is the \"Vegetarian Chicken with Hot Pepper Sauce\" off the specials board (not sure why it's not on the regular menu yet--it's been on the specials board forever). I've only ever gotten take-out so I can't speak to delivery or eat-in. My go-to Chinese in BK Heights.", "author": "Todd H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-10-05", "description": "I have been living in the area for going on 4 years and this is the only Chinese food I eat.  Whether I get delivery or eat in, it's always above average.\n\nHighlights:\nGreat lunch time special, very quick but borderline rushed.\nDelivery is ALWAYS very quick and the food is piping hot when you get it.\nThey have never messed up my order, and I tend to be a picky Chinese food order-er.\nThey take credit cards over the phone, which I love because I never have cash.", "author": "Sarah G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-12-21", "description": "This place is authentic in a very weird way -- it is a faithful representation of an inauthentic style.\n\nSome background:  I moved to the US from Taiwan when I was 11.  Everywhere I went in the US, people treated me to their local Chinese food places, which always had food that tasted like nothing I could remember from Taiwan.\n\nFor a while I thought it was a regional thing -- Cantonese cuisine is not very authentic in Taiwan either, and back then the Chinese in America were overwhelmingly of Cantonese descent, and the Chinese restaurants in the US were similarly almost entirely of Cantonese derivation.  But then I talked to some kids of Cantonese descent, or who have been to Hong Kong, and they told me all this stuff is nowhere to be found over there either.  As an adult, I traveled in China quite a bit, and I can tell you that nothing I had anywhere in China tasted anything like what has been concocted in the States.\n\nIt was in this way that I was introduced to the style of cooking known as \"American-Chinese.\"\n\nDo not confuse that with \"Chinese-American.\"  The word order makes a difference.  \"American Chinese\" food was invented in America by Chinese immigrants or their descendants based on American appetites and tastes and locally available ingredients.  Over time, it evolved into its own style that uses Chinese cooking techniques but which has little semblance to anything you would find anywhere in China.  In fact, it is so different from anything you would find in China, it has been \"reverse-imported\" to China -- there are lots of \"American-style Chinese food\" recipes on Chinese websites, and it's all stuff like sweet and sour shrimp (basically shrimp breaded and fried and then served in a sweet and sour sauce), that originated in the US.\n\nThis place makes stuff like that.  The \"Chinese food\" you would see in a strip mall in the Midwest.  The \"Chinese food\" you would see at a takeout window at a truck stop in the middle of nowhere.  The \"Chinese food\" that is made from five gallon drums of soy sauce, oyster sauce, and MSG.  It is faithful to such recipes even today, when many people have been exposed to \"real\" Chinese food..\n\nThough I do not endorse the style, eating it is an act of nostalgia for me, because it reminds me of the old days, when hardly anyone in America knew what the hell real Chinese food tasted like, and this is what I would end up eating when I went out for Chinese -- in the last twenty years, most Chinese places have ended up being taken over by recent Chinese immigrants, who would proceed to cook something like actual Chinese food.  This place, however, has stayed true to its roots, and is authentic to its style -- American Chinese food.  Once in a great long while, I would stop in for a quick stirfry (which is almost always chunks of meat battered and deep fried before being tossed into the stir fry wok with some chopped vegetables and some kind of nondescript brown sauce made from soy sauce and corn starch) and indulge my nostalgia, but would get the hell out pretty quick, because the whole place also smells of stale frying grease to the degree that I do not understand how this place's ventilation system passes code well enough for them to stay open.  However, to some degree, even the smell reminds me of all the takeout-only places I've eaten at, and so is oddly enjoyable to a degree, but I really can't take it for long.\n\nIf you are from some part of the US where you grew up eating this stuff, and either prefer it or would like to enjoy a few flashbacks to your earlier years, I believe you would like this place.  If you want actual Chinese food, try another place, or just hit Manhattan Chinatown -- a fifteen minute train ride or a twenty minute walk over Brooklyn Bridge from this place would put you on the southern edge of old Chinatown, on the Manhattan side of the Brooklyn Bridge.", "author": "Frank L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2010-11-21", "description": "Horrible. Food, service, everything. I wouldn't eat this food even if it was $3. And ditto about the delivery boy comments. Another ethnic restaurant in NY that doesn't deserve your time or money.", "author": "Alex D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-09-02", "description": "Oh my sweet delicious Asian glory. \n\nThis place is my new fave take out (or walk to, if I'm feeling healthy).\n\nI don't have much to say other than, I'd give up my first born for their scallion pancakes and Schezuan Dumplings. \n\nFact. \n\nBottom Line: Best pan-Asian I've found in Bay Ridge so far...\nEnjoy! \nc.", "author": "Carly D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2009-10-24", "description": "I got the fish filet with black bean sauce.  Maybe it's because I got it delivered, but boy does this blow.  The fish, was seemingly fried beyond oblivion, is it possible to overcook fish this much?  The sauce was meh, and vegetables same.  The only reason why this place got any stars was for its hot and sour soup.  It wasn't amazing, but it definitely got rid of my craving for the stuff.\n\nDid I mention that they brought me this huge bag of food, but when I went upstairs, I then realized that there were no napkins or utensils.", "author": "Minh L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-11", "description": "slightly better than your average Chinese take out joint for around the same price. not too shabby.", "author": "S W."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2008-10-06", "description": "I've only been for lunch.  And it's weird at lunch.  They have a really cheap lunch special, which is why I assume they're always packed around then.  But the food is....okay.  Any other neighborhood and it would just be a take-out place.  It's really not very good.  With your lunch you either get soup (which is pretty good actually) or Iced tea.  From a mix.  \nStrange place.", "author": "Kyle H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2009-05-18", "description": "Okay, wtf?? The Lichee Nut location in Bay Ridge apparently changed hands but when you call, they don't tell you this.\n\nI am writing this as I sit here eating it ONLY because I was starving and too hungry to call and re-order.\n\n1) The food is crap, oily and flavorless, especially the veggie dumplings and the noodles with vegetables.\n\n2) They screwed up my order--I repeated three times--not fried.  Tofu came fried\n\n3) The sauce on my noodle dish is like sugar, salt and oil.  Does not even taste like Asian food.  So gross.\n\n4)It no longer comes with the bizarre (albeit delicious) little container of what seemed like coleslaw.\n\nOkay, that's it.  Just be forewarned.", "author": "Amy R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2006-02-05", "description": "This place is pretty darn tasty and not very expensive either, a combination that is very hard to beat. \n\nMany items on the menu are Lichee nut flavored, which is a good thing as it adds an interesting twist on the standard chinese food. Admitedly their menu isn't anything special, but it doesn't need to be. This is the sort of place you go to on your lunch break, or stop by while exploring the neighborhood and have a nice meal on the go. \n\nTheir iced tea is quite tasty (though occasionaly a little sweeter than you would like it, hint... let the ice actually melt). The regular hot tea is plentiful and free and it makes a great compliment unsweetened to their sweeter dishes like the general tso chicken, or the sweet and sour dishes. \n\nOverall a good place to go, good and quick service, tasty food, low prices, good location. Can't really think of any negative things to say about them.", "author": "Eugene D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-06-16", "description": "Lichee Nut is basically at the level where actually good American-Chinese food starts. I mean, there will always be a place in my heart (and arteries) for bad-good Chinese food, such as cheap buffets, or just about any Happy/Dragon/Garden/Lucky/Golden-named place with illuminated menuboards. But the food here is actually pretty tasty and surprisingly will not make you feel like you're going to die about ten minutes later. I usually stop by here for the cheap chow fun lunch special. Egg drop soup and spring rolls are pretty standard, but the chow fun is nice and light and not too greasy, which is a rarity.", "author": "Galvin C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-11-06", "description": "i have been going to this place for  over 20 years and tonight was the worst food i have ever eaten  the service was terrible the food was cold  and the waiter was rude  you have lost a loyal customer i will never come back", "author": "Will B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-05", "description": "I ordered from here last night and had a really satisfying and delicious meal. The veggie lo mein was perfect and the general tso's chicken (I got it with white meat) was some of the best I've ever had. This is all-around good American-Chinese comfort food. The delivery was really fast, too.", "author": "Rocco H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-10", "description": "If you are looking for \"American\" Chinese food this is your spot. The food is delicious and very reasonably priced. If you are looking for top of the line swanky place then go somewhere on the Bund in Shanghai. this place is priced well, good taste and quality food. What else could you ask for when you're craving Chinese?!!", "author": "Megan A."}], "servesCuisine": "Chinese", "priceRange": "Under $10", "name": "Lichee Nut", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "162 Montague St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/Nbj71pbUDGJsWDDhrQuo8A/ls.jpg", "@type": "Restaurant", "telephone": "+17185225565"}