{"aggregateRating": {"reviewCount": 16, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-19", "description": "Great Chinese food with an American flavor! Exceptional fast food without the bells and whistles. Don't let the exterior and interior fool you. \n\nCame here two days in a row and will keep coming back.  One order can be split into two meals, that's how generous the portions are. The fried chicken is great. Why pay $15 bonchon next door when $5.5 at this restaurant would satisfy your fried chicken craving?\n\nEveryone speaks Mandarin or Cantonese. I'm not sure if they speak English. I suggest you read the menu and point whatever you like to order. Easy peasy and no stress.", "author": "Jolly H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-07", "description": "I moved to the area less than a year ago and given how much its gentrifying, uts hard to find me something close to resembling good ol' real legit chinese takeout -- I mean like legit, they got singapore maifun here! It looks rundown, but hey, thats how you know they been around long enough to stay on top of the changing neighborhood.\n\nDO - Come here to satisfy your chinese food cravings and good portions to boot!\n\nDO NOT - Come here for a date, unless you dont mind smelling like grease and loving the food.", "author": "Cristobal T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-27", "description": "Just the best fast Chinese food you can find around jay st metro tech area. I can't live without their fried chicken fried rice", "author": "Lorraine T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-09", "description": "The food was reasonably priced and the portions were comparable to most oriental cooking establishments. The cleanliness of the seating are is less than desirable.", "author": "Lucas C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-21", "description": "They have a huge pot of stewed potatoes and rib tips in a black bean sauce which is so delish. I could just devour the gravy over some hot white rice. \nThey serve a lot of homestyle dishes so, ask about them but, expect it to be cooked fresh and take a little longer.\nThe lady who takes my order is always so friendly and smiles a lot which is a good thing.\nNot, a fancy spot but, great food and service. Portions are huge.", "author": "Papilindo C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-15", "description": "The food here is really good!!!i ordered the general tso chicken for lunch and I must say the taste of the spices and the crispness of the chicken is delightful! This place is only cash and it comes with a free drink! I'd give it 5 stars but there was more crunch than chicken.", "author": "Jacky M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-05-12", "description": "Chang Heng is located a block away from where I work. Chang Heng is your typical Chinese take out restaurant with an exception. That exception is that they serve bubble tea. The bubble tea are pretty good and most of their smoothies are fresh fruit. \n\nFood isn't great quality. You can't really expect much from a take-out restaurant. I typically just come here for bubble tea, nothing else. The staff here are very friendly. \n\nTip: CASH Only", "author": "Jessica D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-02-12", "description": "Finding a good Chinese restaurant outside of Chinatown in Manhattan is like looking for a needle in a haystack. I've ordered from Chang Heng and received mixed reviews both on service and food. \n1st attempt: Ordered pork with string beans over white rice around 1:00pm and waited 15 minutes before my food came out. I'm sure they coated the pork with tons of cornstarch because it tasted so smooth I thought the meat went bad. There was a lack of chewy meaty texture you normally get with fresh meat. Either the meat was bad or they marinated it way too long. I give this meal a 5/10.\n\n2nd attempt: Ordered sesame chicken over white rice around 3:00pm. Yes, it was a very late lunch for me. Placed the order over the phone and was ready 5 minutes later. Who eats lunch at 3pm?!? To my surprise it was actually good. The batter was not too thick or thin, it was just right with a good crunch. I give this meal a 8/10- that's a very high rating for someone that grew up around authentic Chinese food. \nPrice: $6-$7.50 very reasonable w/ 1 soda can or a small soup.\n\nCASH ONLY!", "author": "Ko L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-06", "description": "This Chinese take out restaurant is more modern unlike the usual Chinese restaurants. It actually looks clean. Food is typical, does the job for lunch.", "author": "Tina W."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-04-29", "description": "Nika and I went to this super sketchy Chinese takeout place one night. We both were craving Chinese and saw a menu outside and decided to go in. The restaurant doesn't have it's own sign but it's right next to the \"Dining Room\" and \"Super Taco [or something like that]\". I had originally thought it was a part of the Super Taco restaurant. When we went in, the only menu they had was pasted on a wall and even that didn't have a name. We actually had to ask what the name of the restaurant was. The cash only restaurant had decent pricing but when it came to pay, the two different clerks told us two different prices. One of the cashier barely spoke English and had a hard time understanding us. The lo mien and chicken and broccoli with fried rice was a bit greasy and lacked taste. I am sure there are other places around Dekalb/Jay Street that make better food.", "author": "Andie B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-03-04", "description": "Seriously, this place is the worst. I've been to a gazillion Chinese restaurants throughout NYC and this place is among the very worst. Remarkably bad.", "author": "Anthony P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-22", "description": "Best General Tso I've ever had! crunchy and gooey the best. During school months call about 20 minutes before and pick up. orders are made to order, fresh. Service is great too those ladies are so nice and friendly!", "author": "Anais P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-10-25", "description": "No frills, No thrills. It's your typical Chinese take out place except they look like they care about how clean their place is. It doesn't remind me like someone took a crap on their walls so that's a good thing! \n\nI've come here twice and gotten their lunch specials. Their lunch specials offer a variety of typical Chinese takeout fare and comes with white rice or brown rice and drink or soup for $6.50. Price is okay but it will cost you 50 cents to a dollar to ask for fried rice which is standard at most Chinese takeout places.\n\nI got sweet and sour chicken twice. The first time was really good but the second time felt like a mini-disaster. The actual chicken pieces were small and was mostly the fried batter, it looked like I ordered a dish of Rice /w Chicken rather than Sweet and Sour Chicken if you know what I mean. It felt like 70% rice and I was still hungry after the end of the meal.\n\nThe saving grace about this place is their bubble tea at reasonable prices!", "author": "Eugene K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-27", "description": "+1 star for being the best Chinese food in the area by far.  Thank you for being so close to work.", "author": "Agapito G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-02", "description": "Small space, Big surprise. I've been there for countless times, but just never get tired of it.", "author": "Yifei S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-04", "description": "One of the best places in the area to get a good cheap vegetarian meal. All the staff is very friendly. The wait can be a bit much sometimes, so I generally try to avoid rush hour.", "author": "Noah F."}], "servesCuisine": "Chinese", "priceRange": "Under $10", "name": "Chang Heng", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "54 Willoughby St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/cIHXBZLiD5jIj_3ABjTrJg/ls.jpg", "@type": "Restaurant", "telephone": "+17184889288"}