{"aggregateRating": {"reviewCount": 170, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-02", "description": "this location could get really busy in the lunch time,so make sure you order your food online:)", "author": "Baina M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-24", "description": "Great place for a quick bite. I've been here many times but never knew about their upstairs seating. It's spacious, quite, ideal for a relaxing lunch.", "author": "Jason R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-05-16", "description": "Nice brand but terrible customer service \nI regret to stop by never again... The corner Burger King has better customer service:)", "author": "Joseph S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-04", "description": "I've finally tried out Panera Bread for the second time in my life! Any way, I've been much excited that Panera opened near my new office and school.\n\nI came here to pick up lunch for myself and my co-workers and amazingly the line wasn't long and the wait for food wasn't either. Efficient customer service and good quality of food. The staff here are so nice, friendly, and generous.\n\nI really didn't know which soup to get, the first one that caught my eye was the creamy tomato soup and I did a \"you pick 2\" special. So my sandwich was the Asiago roast beef. The sandwich was small and extremely colorful. I totally forgot to take a picture, will do next time I have their sandwich. I really enjoyed the texture of the roast beef because it was light and soft. \n\nThe staff here are very accommodating because they gave free Italian bread and even small bags of croutons. I must come back here to try more menu items. \n\nThank god for Panera Bread!", "author": "Jessica D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-06-14", "description": "Sunday afternoon, order of 2 cookies and 2 iced chai drinks require a 20 minute wait?\n\nWhy do we have a staff of 6, with 4 on break including the manager in the seating area.\n\nKhalil is not meant to be a one man show.", "author": "Shayan K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-10-01", "description": "I'm so glad Panera Bread came to Downtown Brooklyn.  The food here always taste fresh, even late nights and evenings. The staffers are genuine and friendly. And the place is pretty clean and well kept. \n\nThe soups are so good! The bread is fresh! The drinks are refreshing! \n\nThis place is great to have around, especially when they have a good staff and their food is so consistently on point. \n\nThe Mac \u0026 Cheese w. Italian bread on the side and the tomato soup are my go-to's!", "author": "Kassandra O."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-10", "description": "I love this Panera as well as the people who work here, who are always so nice to me when I come in and take their time preparing your order, so it doesn't appear rushed etc. The wifi here could be faster but I love how much space exists upstairs for people to spread out and et work done or just eat. I have a feeling many people don't know about the upstairs space, which is great for the few looking for good study/work spaces in BK.", "author": "Morgen B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-09-26", "description": "After today's negative experience from this location, I DON'T recommend coming here before closing time. At least I won't. Come during breakfast or lunchtime; any time, but the hour within closing. I'll probably just head to my previous locations instead though when I have a craving for my Pick Two combos.  Please re-train your Monday night's staff. \n\nI love Panera Bread, for their Pick Two combo meals. I never had an issue with any of my orders, but today was my first negative encounter. I've been an avid customer at this location for the past year since starting school nearby and the customer service has been great, but not today. The visits before this location were always at the Manhattan locations or during the afternoon at this spot. Today, I ordered through my Panera app on my phone once I got out of class around 8:40PM, thinking they close at 9PM so I should hurry in case there is a line before closing. I was unable to create a Dine In order so I ordered a Rapid Pick Up, which would be ready in 10 minutes after my order submission.  I ordered my usual Pick Two combo - the usual BBQ chicken salad and a mac\u0026cheese with the French Baguette on the side. Once submitted, I was already close by, only a few stores down. As I walked in towards the Pick Up counter, the female server asked the area if anyone was waiting for a rapid order, I notified her I did and she saw that my order just came in \"0secs ago\". She commented under her breath, \"I was about to say...\" she didn't seem to happy about it. I wasn't expecting it during that second, no rush. I just walked in, so I could understand if it was not ready yet, but she wanted to notify a previous rapid order customer they ran out of sough dough bread. She then goes on to create my order. The male server working with her said there isn't any more mac\u0026cheese after my order and that he \"didn't want to go upstairs to get it\". \n\nAs I waited, my order was ready at the counter a few minutes after. I went upstairs to eat it before heading home for the night. To my surprise, the mac\u0026cheese was VERY cold. It was ALWAYS hot and ready to eat on my other visits.  This time, the mac\u0026cheese was cold as hell, the cup was warm to the touch but if you dug into the food, it was cold as hell. I knew right then they only \"heated\" it up for only about a minute or maybe 30 seconds from the fridge. Stupid me; I was really hungry after a long 9hr school day, so I didn't want to go back downstairs and create a scene.  Despite the cold mac\u0026cheese, I turned to my salad, thinking that can't go wrong, BUT that didn't taste the same as how it used to be either when I do order from here. There was only a dab or two of BBQ sauce on the lower left side of the salad instead of the few DRIZZLES I used to get on the ENTIRE top of the salad. Is it because it's almost closing time that your work ethics can be so half-assed? Would you guys want your food to be like mine today? Pretty sure no one does. Rude on the \"cooking\"/food preparation aspect. Also, I didn't have the french baguette side bread in my rapid pick up bag. I left about 10 minutes after my meal. It was suppose to be my dinner; overall, what a disappointment. I've came here before after class around the same time on other weekdays, but the service was never like today's.  \n\nSo why only 2 stars if everything was great every other time before this? Minus 1 star for attitude, minus another for food preparation and accuracy. Minus another because like the rating says \"Meh, I've experienced better\" and I have.", "author": "Kaycee C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-10-01", "description": "This location is sooo sloowww. Customer service otherwise is very hit or miss, and the quality of the food is not always the best. I just waited 20 minutes for a salad with wilted lettuce and really bad chicken. This is close to where I live so I would really like to go here, but I think this was the last time.", "author": "Elizabeth D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-10-18", "description": "The standards at this location have dropped considerably. \n\nI frequent it because its near my job and very convenient. What drew me in was the breakfast egg soufflé that used to be impeccable. However here are my major gripes:\n\n1. There is always a long wait for them to make a sandwich... Doesn't matter how simple and they don't always have the right bread on hand.\n\n2. The eggs in the sandwich, particularly the 'Mediterranean Egg White' sandwich are consistently rubbery and bland.\n\n3. To my surprise, when I ordered their 4 cheese egg soufflé last week, it was STALE. Call me crazy, but I went back that afternoon and got the clam chowder soup... Again, STALE.\n\n4. Ordered a Pumpkin Spice latte, with whipped cream a few days later, only to be told they don't have any whipped cream in the entire store. Really? To top it off, the beverage was VERY sweet... I couldn't finish it. \n\nThey need to get it together. Think I will take a break and try them again in a few months.", "author": "M C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-01-12", "description": "The worst Panera I've been to. Staff is unprofessional and don't know how to work the cash register. When i asked for extra croutons an employee laughed like it was a joke...very immature. Whole ceasar salad half full with only 5 croutons inside box.  Cheap with dressing and it looked like someone threw the dressing cups in the box...this place lacks customer service. 3rd time at this location and it sux each time and I won't be going back. ..five towns location is so much better.", "author": "Octavia W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-08-10", "description": "One star? Sadly yes. The fact is, I love Panera. I've loved it when it was St. Louis Bread Co and only existed in Missouri. I was very excited to hear they were opening locations in NYC. So why 1 star?\n\nThe corporate employee that decided to open locations in NYC clearly didn't do his/her research good enough. The entire concept of a lunch place here is about getting people in and out fast. Fast being the crucial element. \n\nPanera's in the Midwest take their time. Life is slower there. Sadly they have the same mentality here. Meaning you will be waiting a LONG time to order then another a LONG time to get you food. \n\nThey clearly didn't bother to alter their business processes to fit the need of their location. At noon on a Monday lunch, there is only a single checker standing next 5 empty registers. The employees preparing food are lackadaisically assembling sandwiches and salads. Frankly, I were the manager here, I'd be ashamed at my restaurant managing skills. \n\nSo, one star. Great chain as far as chains go, but this location is ridiculously mismanaged.", "author": "Stephen V."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-01-14", "description": "Absolutely horrible for the following reasons: \nThey unnecessarily put an egg in my salad.\nThey kicked us out early.\nAnd worst of all, they played Black Country music the whole time. \nI do not recommend going here unless you go with someone amazing.", "author": "Arthur S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-28", "description": "I went here this morning around 11:30am. I was really excited to have seen how empty it was. My order was taken instantly and I got my food instantly. What I loved about this place was the upstairs dining area, and how quiet and peaceful the atmosphere was. I Initially went to hale \u0026 hearty to deal with this craving that I was having for cheddar broccoli soup. (Happens to be a frequent craving of mine) However, hale and hearty didn't have cheddar broccoli soup as they said only occasionally do they have that type of soup on their menu. (It varies day by day) Thank you Panera bread for having a steady menu and for always being my \"go to spot.\" I recommend that everyone try's Panera's CB soup!", "author": "Nia S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-10", "description": "This was my first Panera visit in years and the first time ever I ordered breakfast. I'm glad I did. I was roaming aimlessly on a Sunday morning, looking for sustenance when I say Panera. So I went right in. In a rare move, I ordered something that did not include meat: the avocado and egg white sandwich. And I enjoyed it. A lot. They used fresh avocado and real eggs to make my sandwich. I washed it all down with a large hazelnut coffee. It was good coffee. \n\nWhat a lovely way to start my morning.", "author": "Sophie F."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-09-23", "description": "So I decided to go in for a tuna sandwich. They didn't give me my pickle with my order and there was barely tuna on my bread. I'm used to going to Panera Bread filling up my own drink. Not here. Maybe it's because of all the school children it services. There's one bathroom for women and men. They need to do better. I eventually got my pickle though. I'll think twice before I come back.", "author": "Justine B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-08-29", "description": "See this is hard because I usually enjoy my visits to Panera bread. However this location was different. They need a crash course in hospitality 101. I never used the mobile app, seeing it was lunch time and I knew it would be super crowded I opted to use it. I ordered, it said that it went through and my order should be done in 5-10 minutes after the order was placed. I gave it 15-20 minutes since I work in the same industry I know orders get bumped unknowingly. I was parked in a bad spot so I sent in my sister, she comes back out with a frown saying \" they're saying you never put in a order. Surprised I go in myself and one of the staff is going on about my sister saying \"she didn't come back, I don't know\" I said hi I sent my sister to pick up a order I made online. Now there's no more chatter just wide eyes, smirks and snickers. A team member wearing a purple shirt asked me my order while looking at the KDS screen and started to nodding while going over an order on the screen. Now if my order was never made... Well how is it on the screen??? 10 minutes later I was handed my order with no apologies for waiting on food I had already ordered and waited for.", "author": "GwenDy M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-07-10", "description": "Was such a bad choice especially since there are so many good choices in this area. Stay clear from this place. Super commercialized, the sandwich I had was just bread there was hardly any meat inside. I love corn soup and the one they had was very watery and bland. Do yourself a favor and go to shake shack and get a double burger, or country hill chicken much better choices.", "author": "Maurice R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-05-15", "description": "cant go wrong with soup and sandwiches", "author": "Kerry L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-07-03", "description": "The Good.\n\n-The Panera Fairy left some coupons under my pillow, and we received the following for $6: two breakfast sandwiches, an iced coffee and a loaf of sourdough bread. \n-It was a filling, decent meal.\n-The sourdough bread is actually pretty good. Not SF good, but good.\n-This place is huge. If it's seating you're looking for, there is plenty.\n\nThe Bad.\n\n-That would have cost us about $15 normally. \n-All of those items can be found cheaper and better at non-chain spots nearby.\n-The breakfast sandwiches, while fine, are unmistakably mass-produced.\n\nThe Ugly.\n\n-That pressed bread covered in asiago is in no way a bagel. Bread shaped like a bagel does not a bagel make.", "author": "Peter D."}], "servesCuisine": "Sandwiches", "priceRange": "$11-30", "name": "Panera Bread", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "345 Adams St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/tRhAilT3G39TSIQxx_l0-w/ls.jpg", "@type": "Restaurant", "telephone": "+17186430345"}