{"aggregateRating": {"reviewCount": 170, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2019-02-18", "description": "Good location in downtown Brooklyn and easy to get to. Easy to order via web/mobile and pick up or through the Panera kiosk if there is a line. \nStaff is friendly and doesn't take too long to pick up order except during the height of lunch at times. Dining inside - there is seating upstairs after you pick up your order. \n\nBagels are ok - tried many of them and still favor the cinnamon raisin and the cranberry walnut. This location you still can get preserves for free as Manhattan locations charges 50 cents plus tax.\n\nPastries have changed and gotten smaller - usually get the bear claw now since the pecan braid has shrunk. Soups are good.", "author": "Winny L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-05-17", "description": "I absolutely hate this Panera Bread. Every time I go there's a problem. Either it's a too long of a wait despite ordering ahead, food missing from my order or giving me the wrong food. \n\nThis is the last time I will order from Panera. Last week I ordered my usual salad, the Fuji apple chicken. I do make substitutions and have add ons that cost extra. In total my salad comes up to about $12. I go back to work to eat it and the bowl is half full and none of my add ons (which I paid extra for) are in the salad. I paid 12 bucks for a bowl of spinach greens.\n\nI tried to call and email customer service and as expected I did not get a response. So frustrating and disappointing, I will not return to this location. I'd rather go all the way to Union Square.", "author": "Keisha F."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-03-11", "description": "I love Panera, I really really do. However, since moving to Brooklyn, I have not been impressed with this location at all. Today annoyed me enough to write a review.\n\nI ordered on the app (which is amazing by the way) at 1.11 and it said it would be ready at 1.21- great. I get there at 1.20 almost exactly and have to wait for another nearly ten minutes. It wasn't ready until 1.28. I ordered ahead for the sole purpose of not having to wait there because I only had a short break before my next class and I still had to wait for almost ten minutes.\n\nThe real kicker? I get to school and am now eating in the middle of class instead of before- and I find that there's no spoon. Not sure how I'm supposed to eat my soup now- or whoever checked this bag actually checked it. \n\nEveryone that works there always seems unpleasant and annoyed. I'm really not thrilled with this location at all.", "author": "Jordan M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-05-22", "description": "Always a great place to visit for breakfast. The floors are clean, and the place is well ventilated. My avocado egg white spinach sandwich is on the money every time. The service at the counter is pleasant and the person who give you your order takes the time to wish you \" a great day\". The price can be a little too much. However the flavor and freshness of your order can't be denied.", "author": "Grace S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-02-07", "description": "I love panera bread. My kids love panera bread. This location is close to my job and here and there I get to indulge in some panera salad. I had the pick 2. Broccoli cheddar soup and the Cobb salad. I love the dressing in this salad. Staff and management are nice and friendly. Place is clean", "author": "Ana L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-05-25", "description": "For the last 4 day I ordered off of Uber eats I selected a set time for my order first 2 days great yesterday 30 min late today they didn't even process my order I called the store manager he didn't know what was going on then have to call Uber eat to see the status of my order I never bread do you need me process it mind you I placed my order at 12 o'clock to be here between 145 and 215 at 2:35 they still have not processed my order missed my whole lunch hour now I have to wait until I get off to eat", "author": "Erica R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-03-08", "description": "For convenience since I work in the area, ordered a cuban sandwich and I have to say it was a very sad sandwich. Taste wasn't bad but just sad. One slice of ham, 2 small thin piece of pickles and a quarter size of shredded pork. Just sad! For $11 even sadder", "author": "Alicia C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-28", "description": "I love Panera bread. across the board the food and beverages are great. I tried the lobster roll. I didn't expect much because this is not a seafood restaurant but i was greasy surprised. It was flavorful and savory. I would defiantly recommend trying it.", "author": "Samantha L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-01-20", "description": "I've never had an issue here. The food is good, there is a nice variety of items ranging from healthy to indulgent, and it always tastes good. You pick two (salad/sandwich/soup) is a good way to go because you can get a combo that's pretty filling. I usually order through the app and pick up for takeout and it's always been accurate and my food is fresh. On my last trip, I used a coupon which was great and I got another coupon for a future order.  There are a bunch of food options downtown but this one is fairly good.", "author": "Suriyati B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-04-13", "description": "Terrible! They are always out of ingredients including most breads. Isn't it called Panera... BREAD? Also this location needs more hands on deck in the preparation area. \n\nPros: Staff were friendly and helpful.", "author": "christina m."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-12-27", "description": "Panera Bread has slid into the category \"average,\" as so many franchises do. Maybe it is the very definition of a franchise. This one on Adams Street in Brooklyn is shabby inside, with unattractive décor, and the carpeting upstairs is a triumph of hideousness; also, the upstairs room smells strongly of air freshener. \n\nOur green goddess salads were average. Surprisingly, Panera seems to have difficulty executing a serviceable baguette. The one we got today was very heavy and dense, with a kind of shellacked exterior.", "author": "jg k."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-04-30", "description": "They ran out of chicken? I came here for broccoli cheese soup. That is the only reason I came after seeing the bad reviews. I ordered a chicken sandwich to go with it and she told me they ran out of chicken. Odd. I suppose I shouldn't be surprised. This location is not particularly clean and the staff moved very very very slow. My order took 20 minutes and there were only two other people in the store. Don't recommend", "author": "Terra P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-10", "description": "My favorite Panera Bread location! Their lemonades are sooo addictive . I love their bacon Mac and cheese and salads. And the pick up and go masked the process so quick. Especially when I'm on the run to get my lunch.", "author": "Nick S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-11-21", "description": "The chicken was disgusting in the pasta. It was uncooked, raw and unseasoned. It gave me stomach flu. The broccoli cheese soup was very grainy and you can taste the flour that was used. The place was very low maintenance and dirty. Please DO NOT go if you like your chicken seasoned. \nPositive review: good WiFi and lemonade.", "author": "Rose S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-04-15", "description": "The staff member, Jasmin, who took order was borderline rude and seemed to hate her job. She should either improve her attitude or go look for another job that doesn't involve customer service. Food though was good and Panera is always reliable anyway. The staff is just off-putting.", "author": "Joseph L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-06", "description": "I decided to give Panera bread another try. My final convlusion: What a rip-off!! I feel cheated. I got 1/2 a sandwich, roasted Turkey with avocado,  for $6.99! Are you kidding me?  Unbelievable a place would charge $6.99 for a 2 bites sandwich. Can't understand why people would pay this much for a very 'normal' tasting sandwich! Never going back to Panera bread again.", "author": "Jeff H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-03-19", "description": "The self serve kiosks were not working with no sign posted. Unfriendly counter staff when reporting the issue with the kiosks not recognizing credit card swipes. When I got my caprese sandwich, it was a complete disappointment. It was one paper thin slice of mozzarella cheese and two paper thin tomatoes with some arugula and pesto. I felt like I was eating garlic bread. Can't believe that I just paid $14 for that sandwich and a drink.", "author": "J R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-13", "description": "Yesterday was my first time even going to a Panera Bread in almost ten years, and I must say, I had a pleasant experience overall. \n\nI went in yesterday for lunch and ordered their Pick 2 special where you can choose two items from sandwiches, soups, and salads. I ordered 1/2 turkey sandwich and 1/2 Thai chicken salad that came with a side for $10. Even though the place was busy due to the lunch rush, the woman that took my order was very patient with me as I picked my items. \n\nWhen I got back to work, I realized they forgot the chicken on my chicken salad. After a quick phone call, the manager told me I could come back in to get my whole meal free tomorrow due to the mix up. He was very friendly and very helpful in remedying the situation. When I went in today, everyone was equally as patient and friendly as yesterday even thought the spot was even busier with the lunch rush. \n\nI'll definitely be going back to this location for lunch. You get a large amount of food for your money and the staff are friendly and attentive.", "author": "Chey O."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-08-28", "description": "This review isn't so much for the establishment as it is Panera as a whole. But don't think that this particular location  would've gotten much more stars from me anyhow. The service is lackluster and the employees could care less. I go in this morning to order an oatmeal maybe wait about 5-10 mins for it and finally I see it being prepared. Imagine my surprise when I saw the young lady pull the oatmeal out of a microwaveable plastic  shove it in a cup and then try and give it to the other employee to make it. I thought this company stood on how fresh their products are. How SWAY ?? ! Now I'm here at work choking this tasteless microwaved in a plastic oatmeal covered in sugar and \"fresh\" blueberries just saying \"Never AGAIN\"", "author": "Andria A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-12", "description": "This is my first time at this company's establishment.  It is 12pm.. Nice flow of customers... Not too crowded. The female manager is very active in customer service and ensuring that things are flowing smoothly... \nOnly negative, i asked to know what soup was on the list at register and instead of telling me, cashier pointed.. so I had to take out my glasses to read it.. would of been. I've if she just told me as opposed to pointing. I felt that wasn't customer friendly..\nOther than that... It's clean.. Quick service,  food is warm... nice flow of movement .  And they have a kiosk for faster service.", "author": "Catore I."}], "servesCuisine": "Sandwiches", "priceRange": "$11-30", "name": "Panera Bread", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "345 Adams St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/tRhAilT3G39TSIQxx_l0-w/ls.jpg", "@type": "Restaurant", "telephone": "+17186430345"}