{"aggregateRating": {"reviewCount": 170, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-03-23", "description": "I have been to many panera locations. The food at this location was subpar. The chicken and wild rice soup was much too salty, as was the asiago roast beef sandwich. I am hesitant to return here for anything other than coffee or a baked good.", "author": "Jess W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-05", "description": "Regardless of what other people say, the workers are really nice, well the cashiers anyways. The food is really good, and the plating is fantastic. I also love the decor and the view from the upper level seating. I recommend eating here!", "author": "Stephan R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-13", "description": "I love Panera but this location kind of sucks :(\n\nSo far, every other Panera that I've been to, whether I am out of state or anywhere in NY,  ALWAYS has a few of their super convenient kiosks. However at this location they do not, i repeat do not have any kiosks at this time and am unsure of when they will be getting them. Huge let down, because if you're anything like me, you love customizing the heck out of food items and going up to the register will cause you to draw a blank on your custom order. [insert sad face emoji] I guess to remedy this, I would say if you have to come to this location order online but then that brings me to my next complaint. I don't know if it was just today but they were out of a couple of add ons that i wanted. They also forgot my addition of caramelized onions ---maybe they were just out of stock and didn't let me know? My sandwich was also a teeny weeny overdone but the crispy bubbling cheese was a nice surprise, especially since my sweet onions were missing. Looks like Mr. Panini maker saved the day, who would've known!\n\nAll in all, it wasn't a bad experience. If they would just keep their inventory stocked,add some kiosks, and not keep the panini on the griddle for too long as to not dry out the wet ingredients on the sandwich then they would be fine. Oh and as for the seating, i love how intimate Paneras seating arrangements are in general. It kind of feels like a library that you're allowed to eat in. There's always this sense of calm and quiet that everyone automatically gets so its never noisy and annoying, it's very peaceful. This locations seating upstairs is a little more open than i would like(annoying introvert comforbilities)but there are some stick to yourself seating options for people like me who like to get lost in their own thoughts while eating.", "author": "Kat T."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-11-06", "description": "The only reason I go to this Panera is because it's close by and the seating area on the second floor is really great (and the amount of outlets), but otherwise you could definitely find a better place to go eat around here for a similar price. Usually understaffed, and the staff they do have there is either inexperienced or over-worked. Often don't have the stuff that you want (i.e. chicken instead of turkey, no bread bowls, etc.). Otherwise the food, when/if you get what you ordered, is the same quality as any other Panera.", "author": "Josephine T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-15", "description": "I love Panera and I'm happy to welcome this location to the area.  As always, the sandwiches, soups, and salads are delicious and the prices are a liiiiittle too high for my taste.  \n\nThe servers here are really generous with the baguette that comes with soups--seriously at my suburban home location they give me about three inches of bread, but the rowdy servers at this location gave me half a baguette!  \n\nThere is also tons of seating, though you do need to trek up a rather long, narrow flight of stairs to reach it.", "author": "Maeve C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-25", "description": "Staff is nice, the venue is a good size. I would advise to go really early or really late. Rush hour and lunchtime seems to create a bum rush of people in lines going out the door.", "author": "Sochima U."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-05-26", "description": "So it's Friday, it's lunch time and a co worker and I were HUNGRY! I mean we were \"no breakfast, stomach growling\" hungry. So instead of ordering in again, I suggested Panera. \n\nI have mixed feelings about my meal. I paid $13 for a cookie, sandwich (that came with chips, I like that) and a black cherry smoothie. The smoothie was AWESOME! I finished it before my sandwich was ready and got wicked brain freeze! Worth it!\n\nGot my sandwich that looked pretty big when it was wrapped, but when I opened the wrapping looked really small. Hate the fact that I said \"No Onions\" and saw large chunks of onions. It was tasty but it wasn't anything to write home about. \n\nThe cookie was delicious. That's all I have to say about that (in my Forrest Gump voice). Too little food for too much money.\n\nMaybe next time I'll try breakfast there. I know I'm going back for the smoothie!", "author": "Al E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-01", "description": "Downtown Brooklyn's new Panera Bread is kind of like my old Mickey Mouse t-shirt (stick with me here). It's nothing cutting edge, unusual or controversial...it's comfortable, safe and wholesome. \n\nThe bread is good, as are the cookies and salads. In fact, I'm sure I've ever had anything at Panera that wasn't at the very least decent and edible, and at the most absolutely delicious.\n\nThough it's a chain (usually found in the burbs), this Panera offers something unusual....friendly service and an upstairs seating area that allows you to escape the hustle and bustle of the city....right in the middle of the city.", "author": "Shira R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-03", "description": "I work in the nearby area and stop in sometimes for lunch. I am always relieved to see that the lines are nowhere near as long as the ones in Midtown Manhattan. \n\nThe cashiers here are super friendly and I was hooked up with a Panera card that they randomly load with a \"surprise\" every so often. I have gotten a couple free items through the bakery as my surprise and their pumpkin muffins are soooo good.\n\nI really like their Asian sesame chicken salad best. The other day I did try a ham and cheese sandwich but didn't really love it. I wasn't aware it comes minus condiments and didn't think to pick any up. But their bread is always fresh and great so a sandwich there can never be bad. \n\nAlso, I love the option of the you pick 2. you can pick 2 out of a salad, soup, or sandwich. \n\nI'll definitely come back.", "author": "Arielle S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-16", "description": "Staffs are friendly and there's a lot of seating upstairs! Love the big dome window upstairs that let in ample natural light for reading.", "author": "Jessica T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-12", "description": "A Panera Bread and a Shake Shack less than a block away from my office, I can't complain about that!\n\nYou walk in and you can smell all the baked goodies. What's not to love ? As soon as you come in there is a nice dining/lounge area. All in all this is a welcome addition to downtown Brooklyn area. Panera is pretty awesome and I now can have my Cream of Chicken and Wild Rice fix whenever I want!", "author": "Eugene K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-04-13", "description": "Near Jay-Metrotech\nThe you-pick-2 saves my life\nService has been fine", "author": "ReviewHaiku F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-15", "description": "I refused to come back to new york city until there was a panera bread in a borough that didn't start with a q (...or an s... or a b-r-o-n I guess. oops.), and now there are like 2!\n\nanyway, I just walked by 15 local cafes that I should probably be be supporting (some of them were very likely local and/or organic and/or fair trade, etc. etc.), but I can't resist the 'u pick 2' with frontega chicken and greek salad that I've been eating since high school... throw in unlimited refills on some decent ice coffee, free wifi, and an upstairs seating area where I can get some work done and there's really nothing better. in life.\n\nI even passed up a shake shack?! when did that get here?\n\nonly downside was the frontega was a little soggy, but that happens about 7% of the time at all paneras. and yes, I have the pathetically large sample size in my past to know that.", "author": "Jake D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-03-29", "description": "I LOVE panera. I was so happy when I found one by my school. I saw a cockroach on the stairwell to the upstairs seating once. It was disgusting but I figured it's okay it's a food place it happens. I came back another time I ordered my food and on the side I asked for an apple. I get my food and when I look at my apple it was dirty and disgusting. They CLEARLY DROPPED IT ON THE FLOOR AND PUT IT BACK ON MY PLATE WITHOUT EVEN BOTHERING TO WASH IT!!!!!!!! I should have spoke to a manager that day. Needless to say I haven't been back since that day and I will not go back to this dirty location.", "author": "Lina P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-21", "description": "If line is not too long, I don't mind stepping in for my favorite Mediterranean veggie sandwich on tomato basil bread.", "author": "Pluto G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-02-22", "description": "I have been to this location several times as it is close to school. Sometimes the service leaves a lot to be decided. One day I waited 40 minutes for a sandwich in front of the kitchen and there were only a handful of customers. Employees and the manager were talking and didn't seem to agree where everyone was gonna work. I didn't complain because I really liked my sandwich and because I had an special request on my order. \nToday I go in and I ask for the Cuban panini, which is an special request because it is not on the menu anymore. I told the cashier that I always get it anyways because I don't mind they don't have the pickles anymore. She gave me an attitude and complained that the panini I wanted wasn't on the menu. I told her I know that, and I know you don't have it in the menu because you don't have pickles and I want it without them. She asked me when was the last time I got it and I said a couple of weeks ago because people always do it for me. Well she said I don't know the ingredients of the sandwich because I wasn't here when it was available. Really? So how do you know the whole thing so well? Anyways I asked her to ask other people, she didn't move and ignored me. So I went to the back and asked the manager in the kitchen if he could tell me the ingredients so I could tell the cashier and he said he didn't know them.  He didn't seem to want to help me and so I left and I don't think no will ever come back. \nI don't know all the ingredients because they are not listed when I get the panini and I was just missing a couple of them. I know that if someone offered their help we could have make it work together, but no, nobody tried to help me.\nI cannot believe these employees cannot remember the ingredients of something they used to serve a couple of months ago. I worked in the food industry more than 5 years ago and I can still remember the ingredients of the food I was serving. What a lack of customer service this location has. However, there are other locations that would treat me the way I deserve as a loyal paying customer. Good luck coming here!", "author": "H. F."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-02-26", "description": "I scheduled an event in their community room two weeks ago. When I happened to call the night before to order food for the event the Manager got on to tell me that there was no way that we could have the event the next morning. Would not honor the reservation, or make any adjustments. This left me scrambling to find a new location, and then having to cancel the next morning. 40 people had to be contacted, and only half were found before they arrived onsite. What a mess, and what a terrible situation. Never again.", "author": "Stephen S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-10-25", "description": "I fell in love with Mediterranean breakfast sandwich.  The staff is friendly and they make decent suggestions. I'm just glad there are more options in downtown Brooklyn.  I recently ordered a turkey cranberry panini and chicken noodle soup. After bugging this poor girl with specifics...86 this, add avocado no spread... She took my order with a smile and I left my piping hot meal.  Although the panini was delicious they forgot the avocado which they charged extra for.  So I called and the manager who apologized and offered a free meal on my next visit.  I was surprised and delighted.  \n\nThe good is:  location, good seating, free wifi and good food.  Just check your order before you leave. If you're order got messed up, call.  Don't be nasty, let them try to win you back :)", "author": "Johanna J."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-02-20", "description": "I ordered vegetarian sandwich and there is a really bad piece of lettuce in it, so disappointed and and will never go there!", "author": "Jasmine M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-03-27", "description": "So this just up opened a few weeks ago and they stay pretty packed for lunch.\nStrange set up but a welcome addition to an area in need of better food options.\n\nI honestly wasn't impressed though.  The food was mediocre to me.  I had a half chipotle chicken sandwich and the tortilla soup.  the sandwich was tasty, I think, and the soup was mehh.  The best part about this meal was the fact that you could get an apple instead of a side of BREAD to go with your meal....and it was a good apple :-)\n\nIts also nice that they have options for the calorie conscious...which I can be...at times.\n\nThis was my first Panera experience and I may give them another try, chalking this one up to me ordering the wrong thing?", "author": "sarah e."}], "servesCuisine": "Sandwiches", "priceRange": "$11-30", "name": "Panera Bread", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "345 Adams St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/tRhAilT3G39TSIQxx_l0-w/ls.jpg", "@type": "Restaurant", "telephone": "+17186430345"}