{"aggregateRating": {"reviewCount": 170, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-03-27", "description": "Let me start by saying I've been waiting for Panera to come to NY! I've loved it since I lived in New Jersey. BUT I will not excuse this Panera because it's in NY and \"busy\" my french onion soup was great but my bread was a stingy piece off the butt end, and my greek salad was frozen -__- I don't want this location to give Panera a bad name because I love it so much! But they've gotta step it up. Im happy it's closer than the Long Island locations.", "author": "Courtney R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-20", "description": "FINALLY A PANERA NOT IN THE MIDDLE OF NOWHERE (aka the suburbs). I frequent this panera since I work a couple of blocks and here are some secrets you might not know, you can call ahead so you dont have to wait on the ridiculous line. Get a panera card so you can get nice freebies like a free smoothie, pastry and the list goes on and on. If you cannot decide get a you pick two so you can have some soup or salad and a sandwich :)", "author": "Tassamai S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-21", "description": "Love this Panera bread. Granted it opened very recently, it's really clean and love the atmosphere there, great place for a study group or just some alone time studying.. really cool place to hang out. Despite the many Panera Bread's I've seen this is the first I've tried (so not real) but must say the mac and cheese is pretty awesome and healthy.. not your usual Kraft mac n Cheese.", "author": "Lola O."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-03-18", "description": "Nothing special. Had the 1/2 sandwich + 1/2 soup + apple. Soup and sandwich were mediocre, and apple wasn't ripe.", "author": "Universal R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-09-01", "description": "Nothing worse than coming home with your to go to find the one thing you went to Panera for missing. Grrrrrr.  What's a bread bowl with out the actual bread bowl.  Learn from my mistake, check your bag before leaving!", "author": "Elena T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-27", "description": "Patronized this Panera on many ocassions and have always had a good experience as far as courteous and prompt service as well as tasty delicious delights.\nBreakfast: Asiago Sandwhich...very big sandwhich with lots of flavor with a hot cup of hazelnut coffee\nLunch: Chicken Cobb Salad with Avocado Salad...very clean and crisp ingredients with tons of flavor\nLate Lunch/Early Dinner: Roasted Turkey Harvest Wheatberry Salad...very healthy with fresh tasty ingredients.\nSOUP: New England Clam Chowder in a bread bowl....VERY GOOD TEXTURE AND FLAVOR...so good and nice size portion...can't wait to go back for another one...\nThe many times i have been here the management staff have been hands on with execution of taking orders to getting the orders out to the customers.\nThe last few time they even came upstairs and asked the customers how everything was and if there was anything else they needed.\nDEFINITELY RECOMMEND AND WILL BE BACK.", "author": "Chino P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-24", "description": "I love grabbing a coffee to study upstairs, as it is usually quiet at night. The large seating space makes it the perfect locale to relax with a coffee in Downtown Brooklyn.", "author": "M S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-09-28", "description": "I went here for lunch as it is always packed so I thought I should try it.  They have a \"pick 2\" menu for lunch that everybody gets with consists of a 1/2 sandwich and a cup of soup.  It is for a reasonable price, but when you add a drink it is around $10.  I guess soda is $3 there, whatever, I thought I went to wait in the back where you get your food.  When I got my plate, The 1/2 sandwich was so tiny and the soup didn't look like it was in a cup but a ramkin, it was such a small portion!  I ate the meal and left hungry.  Expensive \"snack\" not enough for a lunch.  Dissapointing.", "author": "Lee K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-18", "description": "I had no idea a Panera even existed in Brooklyn, but I was quite delighted to see it. Came in just to grab some coffee before heading to my next food destination. This Panera is a lot nicer than the one in Chelsea, but it also resembles a library. It was so quiet I swear I could hear the man across the room chomping on his salad. I think the fact that it's so close to Brooklyn Law makes it a top destination for law students to study here hence the library-like environment.", "author": "Cindy X."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-11-17", "description": "I give this place 2.5 stars. I came here with some co-workers after a meeting. We all got the \"pick two\" lunch option. They serve the salad in these huge bowls, which only highlights how small the half salad option is. We all got three completely different salads, yet they all seemed to come with the same dressing. I got the vegetable soup. THere was an odd ring of oil floating on top of the soup (why oh why?). Despite this, it was served hot and tasted pretty good. My friend had half the grilled cheese, which s was inedible. Part of the problem was it was served on a napkin (were they out of plates or is their food usually served on napkins?). The cheese had bubbled over and the whole sandwich was stuck to the napkin and wouldn't pull off. I wanted her to exchange it for another one but she was shy and refused (choosing sadly to throw it away instead). If I was in the area again I would look for other options.", "author": "jill w."}], "servesCuisine": "Sandwiches", "priceRange": "$11-30", "name": "Panera Bread", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "345 Adams St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/tRhAilT3G39TSIQxx_l0-w/ls.jpg", "@type": "Restaurant", "telephone": "+17186430345"}