{"aggregateRating": {"reviewCount": 170, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-26", "description": "Great Service, freshly Prepared food, awesome atmosphere!\nLove this place! The staff was wonderful, the cheese Danish was out of this world, my wife had a blueberry muffin, and she said it was the bomb!\nThanks Panera Bread, for making our first time experience a great one!", "author": "Verlon G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-12-11", "description": "I love Panera. It's been one of my favorites for years. When I saw that there was one here, I was SO excited.\n\nThis is the worst Panera I have ever been to. Every single experience I have had here is unnecessarily terrible.\n\nFirst, they never have what you want. And if they do, its over-priced and it take sthem forever to give you your order. \n\nSalads are half the size of what they should be, they aren't even seasoned correctly. The soups are overly salty, and the sandwiches are way too thin for the price that I am paying for.\n\nTheres limited seating, and one time when we tried to go upstairs because there was no more seating downstairs, we got yelled at by a worker who said we couldn't go up there. Then another worker said we could, so we just went back up... only to get yelled at again. Anyways the guy finally let us through and we saw that there were already people up there eating!! I still have no idea why he wasn't letting us up there...", "author": "Dominique H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-07", "description": "At lunch time, there's always a line out the door just to order, and then you have to wait in another line for the food to be ready. Skip it all together and order online. It's usually ready in 10-15 minutes, even when it's really busy.", "author": "Sarah S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-02", "description": "This is the best Panera location in the city I've visited. They're fast, knowledgable about the menu, and the outdoor seating seals the deal.\n\nThey've never run out of things when I've been (like some other locations have) and the upstairs seating is a refreshing break from the sometimes obnoxious neighborhood crowd.", "author": "Katrina S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-03-03", "description": "Poor service and the food is just ok compared to other locations. The staff (including management) always seems underprepared and overwhelmed no matter how many customers they do or don't have at any give time. There are always long lines, even at slow points and there's a long wait for your food which may not be correct. The bathroom has to be opened by a manager which they do not have the time to do so someone is always waiting for the bathroom, making a huge commotion in a small space.", "author": "T F."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-03-09", "description": "If this is what NYC Paneras are like, you owe it to yourself to try them in the NY \u0026 CT suburbs. Dirty floors, sticky handrails (ew!), latte to stay served in paper cup, no bakery item promo with meal... I guess since there are so many good indie places \u0026 food trucks, there's no motivation to do better.", "author": "E R A T."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-06-22", "description": "First, I ordered for me and my awesome co-worker. We received the food and all, upon opening the bag we noticed a burnt like smell. We saw that the bread was burnt, but I decided to eat around the burnt edges of the bread. My co-worker decided to eat the whole thing and ended up with a stomach virus. I figured this was because of the burnt bread.\n\nFast forward to next week, we decided to order again and the bread wasn't burnt but after eating our meal, we felt sick. My co-worker vomited this right after he ate. I filed a complaint against this location and have yet to hear back.\n\nThis is what I ordered the first time Bacon-Turkey Bravo Sandwich.\nThis is what I ordered the second time: Bacon-Turkey Bravo Sandwich and Green-Goddes Cob Salad.\n\nPlease avoid at all cost at this location.", "author": "Karim A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-06", "description": "Went here last night with my coworker and loved it. Service was great and in a timely manner. The prices are pretty reasonable. Awesome upstairs seating that's spacious and great area to study or relax while you dine. Can't wait to go back for the third time.", "author": "Jessy L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-11-10", "description": "I've been to many panera bread locations and this one just had to be the worst. The lines, the layout the people that work there. Usually when I go to a panera location I feel at peace, this location there's a feeling of rushing and attitude it makes the atmosphere tense. I understand they're rushing because of the line but it seems to devalue the quality of the food . I got my food ( cranberry turkey flatbread) and I ate it because I already paid for it. It tasted raw. And I didn't even bother going back there were so many people waiting for their food. \n\nDon't see myself coming to this location again.", "author": "Jennifer R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-12-17", "description": "The food's okay- it's expensive for what you get. So I expect to get exactly what I ordered, however today I got \"to go\" and when I got home I noticed the soup cup wasn't filled up, not even 3 quarters of the way. It's either lazy, cheap or both. But I'm kind of over panera and their cheapness. Not going back.", "author": "Tiffany R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-01-31", "description": "PROS:\n-This Panera is close by my new job.\n-The woman who took my order was incredibly sweet and helpful.\n-Even though the line was crazy long, it went by quickly.\n-I had a coupon. Who doesn't love coupons?\n-It's Panera.\n\nCONS:\n-This place is a madhouse.\n-Carbs. Carbs. Carbs. (Damn you delicious bread!!)\n-They didn't fill my soup up all the way. Come on people.", "author": "Katie H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-10-28", "description": "This is the only Panera I've found downtown BK and it's also unfortunately the worst at rush hour.. On several mornings, I've come here to get breakfast and there would only be one person at the register.. For the past few days, it's been a young lady name Alex.. Feel so bad for her.. She is very sweet and tries to get the line moving as quickly as she can but understand that she is just one person.. Meanwhile I see several staff just standing around.. Why can't one of the managers put two to three more ppl on register.. This morning was no different.. The manager on duty (warren : think that's his name). Seemed clueless to the amount of ppl on line and to add more bodies to the register to move things along quickly.. Although the food here is pretty good which is why I keep coming back to deal with this nonsense but wish they would get a little more organized..", "author": "CJ D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-15", "description": "For my 28th birthday, I received a Facebook e-gift card for Panera Bread. I have always wanted to try the franchise, and this was my opportunity. I walked into this location, ordered a Chipotle Chicken Panini, and went home. \n\nBased on my hunch, I decided to look for the ingredients on their website. I had already taken a bite when I read the following: all-natural, antibiotic-free chicken, applewood-smoked bacon, smoked cheddar, tomatoes and ancho-chipotle spread all grilled on our French Bread. I was very upset and immediately called this location to complain that the ingredients were not listed on their menu and I was unaware there was pork in the sandwich. \n\nSidney was very understanding and asked me to return to the location for a replacement sandwich which I did receive hassle-free. I thought he was very professional and dedicated to customer service. The staff was very polite as well, even as it neared closing time, which can sometimes cause the opposite reaction. \n\nThe replacement sandwich, Frontega Chicken Panini, or Smoked and pulled white meat chicken, mozzarella, tomatoes, red onions, chopped basil and chipotle mayo all grilled on our Focaccia. I liked it! \n\nGreat location in downtown Brooklyn, near multiple bus and subway lines. Be mindful of the surrounding courthouses and colleges which could result in lunch hour gridlock. \n\nMy only recommendation to the brand is to either adjust the overhead menu to include the ingredients or offer customers the hard copy of the detailed menu to better inform customers of the selections.", "author": "Kristia B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-09", "description": "They actually messed up my order again for the Fuji apple chicken salad. Instead of forgetting the apples this time, they forgot the chicken! The only reason I'm giving them 4 stars is because the manager was very helpful and polite about it. I told them that there was no chicken in my salad and the manager made me a new one and also offered a free drink while I wait for the salad. He hand delivered the drink and the salad to me and apologized for the inconvenience. This is how a manager should be when they make a mistake in order to maintain a loyal customer base.", "author": "Tina W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-17", "description": "Honestly, I am an adamant panera bread goer. Although it is not extremely cheap, you definitely get bang for your buck. The quality of the food is definitely worth it and they have healthy options which is always a plus. \n\nTHIS location specifically is by the BK District Attorneys office, and \"in the middle\" of fulton street mall. The line was RIDICULOUS but it went by so fast....the line looped around to the door but I was ordering 10 minutes at most after. They are so efficient and to make it even better, my food was ready less than 5 minutes after ordering. I ordered a soup and half a sandwich. The food was good and it was not sloppy and rushed. \n\nI will definitely be going back frequently since I work in the area. This is now a new favorite spot.", "author": "Amanda R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-09-17", "description": "Now I don't expect to be treated like a VIP at a Panera Bread but I have been to about 10 different locations all over Brooklyn and Manhattan and have always received decent service....until I came in here. As I walked in there was one person ahead of me in line, and 3 people at the register completely not paying attention..it took about 3 minutes for someone to call the next customer, the girl who took my order kept looking down at whatever she was reading and not even looking at me, asking me to repeat myself several times... The girl who handed me my drink didn't know how to acknowledge my thank you either. \n \n Heres the BEST PART, usually Panera Breads packed around 4 PM but this place was pretty damn empty, with only about 3 people waiting for their food, the employees preparing the food were serving a grilled cheese which they forgot about in the toaster... as they remembered about it they grabbed it out burnt and said to each other 'CAN WE EVEN SERVE THIS?' then they proceeded to scrape off some of the burnt bread off one side and flip it over on the plate after giving each other a smirk. This kind of customer service doesn't deserve anyone's time or money when there are many other decent places around to grab lunch.", "author": "Kayla D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-06", "description": "I've been going to Panera Bread for the last 7yrs when I'm in the mood for gray soup. Having discovered the place while living in Santa Monica (it was across the street from me) in love with their bread bowls. Once they opened this brooklyn location which is not far from me now I've made it a point to come when ever I'm in need of a good bowl of soup. Especially during the winter. The staff is friendly and fast but most of all the soup (I've had most) are amazing.", "author": "yolanda c."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-07-15", "description": "Classical music played on the second floor with not too many people on the second floor makes this a very peaceful place to have breakfast before a court appearance in Brooklyn.\n\nThis could also become expensive, but the ingredients in all of their stuff seem very \"organic.\" Still overpriced, though.\n\nFood: the menu consists of many things that look good. I only had a bagel and coffee, but they were both very good. \n\nService: excellent. \n\nDecor: very clean and peaceful type of place. Feels almost like a law school library with classical piano playing. Almost.", "author": "Marcus C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-03", "description": "Food is always great. My suggestion is to always order ahead online because around lunch time, it is chaotic. When I do that, I am in and out in a flash.", "author": "Kelly K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-07-02", "description": "I came for lunch with a colleague - just to try something new. Im not really one for chains, but if you work in downtown Brooklyn, its either that or really shifty-looking places. Ronda - was super friendly and kind when she helped me decipher the menu options - she asked if I wanted a drink and I had said no but she handed me a cup any way... score.\n\nMy colleague ordered the combo with the Mediterranean flatbread and a greek salad, I had the thai flatbread and the broccoli cheddar soup. The thai flatbread was odd - the first thing I noticed was the hummus... which isnt really a thai thing. Once I got over it, it was pretty tasty - and under 300 calories to boot. I thought the soup satisfied my disgusting craving for not-real-cheese... and only another 300 calories so I cant complain. I liked that they had both carrot gratings as well as big(ger) chunks of broccoli in the soup. Overall, for under $10 for lunch, it was a decent option!", "author": "Heather H."}], "servesCuisine": "Sandwiches", "priceRange": "$11-30", "name": "Panera Bread", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "345 Adams St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/tRhAilT3G39TSIQxx_l0-w/ls.jpg", "@type": "Restaurant", "telephone": "+17186430345"}