{"aggregateRating": {"reviewCount": 170, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-10-22", "description": "This review will only cover the food that I ordered since I didn't have a negative customer service experience like many others. The chipotle chicken panini was just okay. They pretty much just slapped everything together and heated it up (I watched them anxiously prepare my food) I enjoyed my tomato soup and baguette though! Maybe next time I'll try a different sandwich.", "author": "Xenia M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-12-26", "description": "This place is just a pure mess!! I was excited when it first opened up but now I loathe coming in here. It's just the closest one to my apartment and my daughter loved the food so I go still come!  This one is just ghetto as all hell!!  The people that work in here are just miserable and unfriendly and that's putting in politely. Food takes forever and some of it isn't even hot when you get it. If I could give this place 0 stars I would. Panera your a great little quick food place but your hiring sucks at least in this location.", "author": "Julie B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-04-25", "description": "As a big fan of Panera, I find myself visiting this location often. Conveniently located in downtown Brooklyn where you'll see your diverse crowd of college students, white collar employees from office buildings, and locals from the court houses. \n1/5 for service.\nOr the lack there of. Cashiers make me feel like they're doing me a favor to put my orders in. Trust me I would've been happier with a kiosk like they have for McD's now. \nI scanned my bf's Panera points card and the cashier have the nerves to tell me that it'll come out under his name. Obviously I'm not going to dwell on that, but it's a little example of which can be easily resolved if staff was trained properly and asked for my preference.\nThe order pickup counter where the guy was flirting with a fellow customer as my friend and I await our order. Well at least they didn't screw up our orders. \nThe only saving grace was my usual delicious Sierra turkey. We both tried some of their new menu items, but none can live up to the Queen. All hail SIERRA TURKEY on focaccia. \n30 min limit on their wifi use. There are people hanging out upstairs who are not even patrons, management has a lot of catching up to do", "author": "Yannie E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-26", "description": "I really like this establishment. I've never been to this one in down town Brooklyn but I must say. I  do believe I will be returning soon. The staff was extremely friendly and on point with service. Our food took a little long but the young lady that was fixing our lunch offered free pastries while we waited. That was really nice and they where extremely good. The up stairs dinning room was a great place to have a peaceful lunch. I will be back soon. Thank you Panera!", "author": "Jasmin O."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-14", "description": "First time at Panera Bread. I ordered two \"you pick 2.\" I order a italian sandwich with chicken noodle soup and a tomato mozzarella sandwich with broccoli cheddar soup. The cashier Maria spoke to me with nasty attitude. As I waited for my order to get called, I waited and waited and waited and waited. I was curious why my name wasn't getting called or being shown on the display. Out of curiosity, I checked the bag on the counter that had been there for the past 30 mins and looked at the order receipt, there was my food. The cashier that took my order MARIA, took down my name wrong. I said GABE, and she put DEEM. I then left and when I  got back to the office, my order of tomato mozzarella sandwich, had no mozzarella. Very disappointed since it was my first time there", "author": "Gabriel A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-17", "description": "The music sucks who's on the aux and the broccoli cheddar soup coulda been better the hair in my soup didn't help either sorry not sorry.", "author": "Riley C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-01-31", "description": "I usually love Panera Bread and all of its warm sandwiches and cozy environment.  I used to always go to the Astoria location when I lived in the area.  Unfortunately, this location needs serious work.  Slow long lines and stressed out employees. It seems that everyone hates their job and takes it out on the customer before they can even place an order. The delivery service is also RUDE and should be avoided at all costs.  \n\nI enjoy Panera Bread but cannot recommend this location. Not worth the wait and the hassle.", "author": "Cherrelle D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-10", "description": "If i can give this place a no star i would. Disgusting the way they keep their salt and pepper packets. It was rotten and old, i don't even know if it's been there for years. The silver spoon looked so stained, i had my soup with a plastic spoon. Service sucks and i noticed how horrible and lazy the staff is. They do absolutely nothing. Never come here ever again!!!! Fair warning to all", "author": "Bhumi P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-01-28", "description": "Still trash, still slow as ever. I've bean waiting 20 minutes for 1/2 a salad to go. Half asalad It's only 6 other people behind me, yet they are moving slow as molasses. 1 cashier and other workers just walking around looking STUPID. Ghetto af", "author": "Amira A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-05", "description": "It's Panera, so you know the drill. The one thing that I like is the self service ordering system when you walk in. It's great \u0026 shows you all the ways you can customize your order (which I never knew was possible), so that was nice. Food came fast and was very fresh. Can't complain!", "author": "Naomi Z."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-07-18", "description": "Ordered a Turkey and Avocado BLT along with a Green Passion smoothie. Smoothie tasted like green apple sauce and BLT was lack luster. After eating half of the sandwich I inspected the rest and I discovered that the avocado was half rotten. The lettuce was also red from spoilage and unappealing. I frequent the Panera at Gateway Mall and their food never falls to this level. The quality control at this store is lackluster. I won't be coming back. They did move quick during a lunch rush so one star for that.", "author": "Tateanne L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-04", "description": "Love their hazelnut coffee \u0026 the avocado breakfast sandwich. The location is prime real estate now \u0026 the space is spacious \u0026 comfy. My favorite part is ordering online \u0026 picking up within 10 minutes", "author": "Esmeralda C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-11-20", "description": "Panera Bread is always a favorite, but my experience at this particular location was sub par. I came at 8pm, my boyfriend and I were the only ones in line. We were looking up at the menu displays debating what to order and I asked the cashier whether this location offered the deal of \"buy a coffee, get any bakery goods for 90cents\". (I was at a midwest state last week and the Panera bread location there had this sweet deal). She rolled her eyes and scoffed as she judgingly said no. OK, that's fine, but why the attitude? \nI ended up getting a coffee anyway... but it was cold... I didn't even drink half of it before tossing it out.\nThe food is great, however, as expected. Highly recommend the autumn squash soup!!", "author": "Lucy M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-18", "description": "This location can not make an order right to save its life. Don't ask why I keep coming here, every time they mess up my order.", "author": "Rachel B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-27", "description": "So impressed! We ordered huge sandwiches instead of breakfast sandwiches by mistake. The manager saw that and came over, got us correct items and gave us a refund!", "author": "Eileen K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-12", "description": "I just love Panera overall. This location does need some work in the cleaning and neat keeping department. I don't like having to carry things up the stairs but it is the city. I just use the kiosk because the lines can get pretty big here. I like that there's a quiet room. No problem with the food ofc!", "author": "Mary M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-04", "description": "I work close by so it's very convenient for me.  I love, love the cinnamon crunch bagel with reg. cream cheese. ORGASMIC!!!\n\nWhat I do not like about this location is that the coffee stations. So I get ice coffee and I use half \u0026 half which is on one table, then I have to walk around to another side to get the actual coffee and ice. SMH it's retarded.", "author": "Paula M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-10-04", "description": "Sloppy AF... I've never been to such a disappointing Panera! They're always running out of shit and taking it upon themselves to substitute things for you. Like how do you run out of bread?! It's in your name! The employees are all rude as well and one legit walked by me today saying \"I hate this fucking place\" lol. The cheddar broccoli soup is usually fine but the sandwiches are always sloppy and subpar. They'll either forget the dressing or put too much on as well. Oh yeah, and they're SO slow!! I waited almost 20 mins for half a sandwich and a cup of pre-made soup. Get your shit together.", "author": "Meghan S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-10-06", "description": "\"You may need a pre snack\"\n\nThis location is very nice and clean buuuuutttttt the major problem is that the food service is way to struggle. Don't get me wrong; the staff is nice and profession but they move like molasses in January. I have been here only on Sundays and I would hate to experience this Panera Bread with 3-4 times the amount of people. \n\nOne huge tip: Order your food online and pick it up rather than dealing with slow service. I should not take 20+ minutes to order and make a salad with a soup.", "author": "Kwame S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-08-31", "description": "I came in for an early lunch and ordered cream of chicken \u0026 rice in a bread bowl, and afterward a frozen cafe mocha. The location is clean and spacious if you include their lovely upstairs dining area. Very nice for studying or unwinding or quiet conversation. The effect is somewhat spoiled by screaming kids, but that can't be helped. There are 2 single serve bathrooms that are damp, but clean enough. Prices are typical Panera price (so fast food cost +$1 or $2), which is reasonable considering it's in the NYC area.\n\nThe lady behind the counter seemed befuddled and unenthusiastic. Like she wasn't sure what exactly to do and didn't care to find out. She said the chicken \u0026 rice soup wasn't available until Wednesday, and when I pointed out today *is* Wednesday she said it still wasn't available. I asked for corn chowder but she said it was summer seasonal and it was no longer available. I didn't bother pointing out it's still August, the autumnal equinox hadn't occurred yet, nor that there were several giant banners advertising for the corn chowder. They did have my third choice: tomato busque. They didn't ask what side I wanted so I got more bread with my bread, and there was no one to ask to swap it out. Soup was luke warm and the bowl wasn't pressed in, so rather than a full bread bowl it was still fluffy with only a few meager ounces of soup on top.\n\nDespite this, I ordered a frozen cafe mocha to go afterwards. It sounds petty and trivial, but they gave me an *iced* cafe mocha.  Considering I paid $4.79 for it, and had no time to wait for them to make another it goes from trivial, to kind of a big deal.\n\nSo minus one star for poor customer service, and minus another for poor food preperation and incorrect order.", "author": "Dane A."}], "servesCuisine": "Sandwiches", "priceRange": "$11-30", "name": "Panera Bread", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "345 Adams St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/tRhAilT3G39TSIQxx_l0-w/ls.jpg", "@type": "Restaurant", "telephone": "+17186430345"}