{"aggregateRating": {"reviewCount": 170, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-07-19", "description": "I'm glad that there's finally a Panera that I can get to.  While the staff is friendly and the store clean, I would have to say that not all the food is up to par with the usual Panera standards I expect.  That being said, the price is a bit high for the food that you're getting.  If the food was more like the Panera I'm used to, then its easier for me to justify paying for it, but thus far, I've been pretty disappointed with my sandwiches. For example, they cut the sandwich in 2 halves for you but my sandwich was poorly made, only one side had a banana pepper and where there should have been 2 slices of tomato there was only one. It just looked like a bad sandwich. \n\nWhile I've been unhappy with the sandwiches, this is still one of the better food options near the area. The salads and soups are pretty good and I love the fresh fruit they provide with your meal. I do wish that they would either change their pricing or produce better quality food.", "author": "Red J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-05", "description": "I go here a few times a month now because well, that hazelnut coffee can't be beat and their you pick 2 is an awesome deal. I like almost everything I've had there including their salads. I like my veggies just fine but I'm always skeptical about salads. But theirs are good! Get their rewards card and they randomly give you rewards like a free coffee/pastry or $2 off.", "author": "Maimuna I."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-07-27", "description": "You can never go wrong with the tomato and mozzarella panini sandwich (which is what I always order at any Panera Bread)! However, there always seems to be a slight hiccup at this place and it has to do with timelines of the orders: we had two people who came after us, get their orders before us!", "author": "Amina-Louise J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-09", "description": "Clean and quick service. The cashier was friendly and nice. Reminded me to register my Panera card. Will go again. Its hard to write reviews on chains because they are pretty much the same outside of the customer service experience.", "author": "Lola O."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-02-26", "description": "Good food. However, the Adams street location is very poorly managed. \"Rapid Pick-up\" is only a phrase, not practice.", "author": "Val O."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-10-18", "description": "Food is typical Panera Bread, however  the staff is a hit or miss. This location gets pretty busy.", "author": "Sa K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-04-15", "description": "Typical penera, snadwhichs, salads, soups. The staff at this place seems to hate their lives. I over hear them complaining, even though the lunch rush is expected daily.", "author": "Sara M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-05-21", "description": "Really don't get what's so great about this place. I've had desserts here before and they weren't all that. I also ordered their ice tea, which tasted like something I can make myself with a cheap teabag and some water. Lines are also long, but at least the servers are usually nice. Can't speak for their sandwiches, but not really a fan of their dessert/sweet menu items.", "author": "Tamanna R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-01-14", "description": "I'm not sure if it's the staff's fault, or if they just don't have enough resources. I ordered a simple turkey sandwich and they said they were out of turkey....at noon on a Thursday. I guess they weren't prepared for the lunch rush. They ended up getting my order wrong anyway though, which wasn't a huge deal to me, but my friends who had ordered at the same time as I did got their food 15 minutes after me. In fact, other customers who ordered 10 minutes after us got their food before my friends did. Not going back here.", "author": "Chester C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-08", "description": "I am and will always be a big fan of Panera. I am just thrilled that there is another Panera near to frequent. The staff is friendly and the store is clean. Love the fact that it is a multi-level place. Nice to tuck away and hide for a little bit while enjoying some good eats.", "author": "Tony C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-01-18", "description": "I really like this location. For more seating go upstairs. I really like their salads and soups. Their panini's are pretty good too. I really love their walnut and honey cream cheese!", "author": "Sheri A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-02-26", "description": "The lines to order food were too long and the wait for food was even longer. The service other wise was good, and the food was good too. Not much to say except their french onion soup is delicious.", "author": "Elizabeth F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-17", "description": "Friendly staff and tasty varied selection. This place is a great addition to the area. Healthier and pricey options.", "author": "Dennis L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-10-02", "description": "I had the sweetest cashier Shanayd who was very helpfull but the food was the worst from all of the Paneras that I ate at.", "author": "Daria V."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-06-01", "description": "After 17 mins of waiting at 10:50 am, they lost order. No apology, nothing. Overhear employees arguing in back room. never again", "author": "Mike P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-08-16", "description": "Good soup, coffee and sandwiches. The cashiers suck. They have the worst attitudes and the manager is also a jerk. It's very busy at lunch and they are prone to mess your order up, always check your food before you leave they have been known to leave the meat of your sandwiches or salad.", "author": "Tracy P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-23", "description": "I love this Panera. Great location, lots of seating, quick and friendly service. And I just love the food. Plus they have pretty darn good coffee as well!", "author": "Heather S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-10-06", "description": "really disgusting. \n\nHarvest turkey salad had brown pears (not from the balsalmic vinaigrette). Lettuce was pure iceberg. They forgot my pecans. The cherry balsalmic vinaigrette tastes like it came out of a sno-cone syrup bottle (i'm sure they just added almond extract to regular balsalmic vinaigrette. so nasty.). Dried cherries were pitch black and look like they were harvested by the Pilgrims in the first thanksgiving. ....Shall I continue?\n\njust gross overall. the quality of the turkey meat seemed fine tho. but doesn't neutralize the disgustingness. will go to shake shack next time. \n\nThe sourdough bread that came with it is perfectly fine. thankfully. I bought a loaf of bread here and it was fine. maybe it comes here as pre-made dough from the factory in kansas and has enough preservatives and polyethylene vacuum packing to not rot before it gets baked here? \n\nno comparison with this location and Pret a Manger. there's always been quality consistency there. i know what i'm getting when i go to any Pret. They just don't have free wifi and seating for studying.", "author": "Catherine L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-25", "description": "Their salads are really really good. I had the fuji chicken apple salad. What a yummy treat. It came with fresh bread and I had a lemonade. The only thing that i don't like is the seating situation. It's downtown Brooklyn for God sakes. Everytime I went there, I had to sit with a stranger. It sucks. I have also tried their pastries and I have to say that they are good.", "author": "Coco B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-04-27", "description": "I ate at Panera Bread today with my mom for brunch, the service was ok, it could have been much better and way more attentive.\nI ordered my meal with the cashier (my mom paid for it...thanks mom...ur awesome) he was nice in the beginning of the transaction, but by the middle of it he seemed annoyed and it showed, I sensed a lot of attitude coming from his part. When it was time to receive the cappuccino I had ordered with him, he delayed my drink and made a customer's drink that had ordered after me. \nI don't know if i'm bugging or maybe over exaggerating...But if you take a persons order and proceed to go make drinks, shouldn't you make the person drink that you just took the order from? Yea, im not over exaggerating my drink should have been in my hand in the time it took him to make the other gentleman's drink, and especially before my food was prepared and had to sit on table while I waited for a CAPPUCCINO. Other than that everything was pretty good. GREAT SANDWICH.", "author": "Timothy Q."}], "servesCuisine": "Sandwiches", "priceRange": "$11-30", "name": "Panera Bread", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "345 Adams St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/tRhAilT3G39TSIQxx_l0-w/ls.jpg", "@type": "Restaurant", "telephone": "+17186430345"}