{"aggregateRating": {"reviewCount": 170, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-18", "description": "This is for Panera Catering.\n\nWe ordered catering for a party of 30 family and friends, and it was great.  The food was delicious and they provided more than enough plates and plastic silverware.  One of the sandwiches I had asked for had to be subbed for another as they didn't get a delivery of an ingredient, but their manager gave us a couple bags of chocolate chip cookies as an apology (and they were very popular with my nieces and nephews!).  \n\nOverall I would definitely use them again to cater a lunch meeting or casual party.  While the regular staff in the store seemed apathetic the catering manager was energetic and helpful and really went above and beyond to make it easy for us on a hectic day.", "author": "Megan P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-07-05", "description": "So this is the smallest Panera on Earth, I'm convinced. There are literally five tables here. I came here on a Sunday evening so it was pretty dead, but I can definitely see it becoming a madhouse during rush hours.\n\nBesides how tiny it is though, it's pretty nice! Relatively quiet and definitely clean. If you're looking for a nice, peaceful place to do work or just chill, you could definitely do worse.", "author": "Robert S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-16", "description": "I love planets bread. All locations the food has been consistent. This one tends to get really crowded, but they handle big crowds well. I've never had to wait a long time for my food to be ready. A lot of people work in the area and take the food to go so seating has never been a problem for me.", "author": "Lucia C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-10", "description": "The lobster rolls are the best.  Panera lobster rolls are filled with lobster meat and are quite tasty.  This is my summer go to lobster roll spot.  Love it!!", "author": "Erika H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-02-12", "description": "Although Panera is a chain, I have had some good experiences at other locations and the food is generally good...BUT, this location seems to not care about the quality of their food. It seems that every time I come into this location they are out of at least one ingredient of every item on the menu. I understand if they run out late at night but usually chain-restaurants are prepared for the demand and should have all the items on the menu. Also, the quality of the food is not at the same level as other Paneras and the bread on the sandwiches is always stale. Overall, I go here when I am desperate for a healthy(ish) option but I have become accustomed to the low quality.", "author": "Wade C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-12-23", "description": "Good location, more spacious than I realized\nconsidering their second floor. The staff is \na real plus here from the lady at the counter\nwho took good care of us to the servers who\ncame and got trays. Not a bad little spot in the\nhustle and bustle off Fulton Street Mall.", "author": "Christopher S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-09-18", "description": "This Panera is vastly inferior to other Panera locations. The sandwiches are always sloppily made, with ingredients that don't looks as fresh as they should. The employees all seem angry that they have to be there. Today, the woman who took my order, Ivony, according to my receipt, mumbled her way through the entire interaction. I had to ask her to repeat herself multiple times. \n\nSeriously, avoid this Panera if you can. There is a Potbelly just a couple doors down, a Hale \u0026 Hearty about 2 blocks away, and a delicious Shake Shack right next door. You can do way better for lunch than Panera in Downtown Brooklyn.", "author": "Allison S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-03", "description": "Yay Panera!!\n\nAs I've said before in other Panera reviews- I LOVE their cinnamon crunch bagel.  So when I stopped off in Borough Hall last week for an errand you can imagine my excitement when I saw signs for a newly opened Panera. \n\nThe shop is set next to Shake Shack (which is excellent.  bagels and burgers and milkshakes.  oh my!) and is convenient to get to from the train.  They had my favorite cinnamon crunch bagels so I made sure to order up a few and the gal who took my order was adorable and sweet and gathered my goods quickly.\n\nOverall a good first trip.  Next time I'll be sure to order something a bit more substantial and sit for a bit.\n\nSo glad to have Panera in Brooklyn!  :-)", "author": "Alyssa R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-11-13", "description": "I expected more from Panera today. I understand it's not a weekday, and there's no major crowds, but the place  WAS busy enough that basic things like cold drinks shouldn't take as long as they did. Another person serving food would have helped.\n The tuna salad had too much", "author": "T E."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-07-26", "description": "Eh, not the best lunch spot.  I ordred their Steak Salad, and was expecting something totally different.  It was a cold salad (felt like eating roast beef), but I guess that was just me and my expectation.\n\nMy friend had the lobster roll and she thought it was eh.\n\nALso their plates are a bit heavy (especially witha  big salad) so keep that in mind if you haven't been working out (balancing a heavy plate going up the stairs can be a bit much).\n\nWhen you are done, they actually put you to work - you have to separate your bowls, plate and garbage...TOO MUCH WORK for a leisure lunch!!\n\nDon't really need to come back.", "author": "Joe M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-08", "description": "I lived on this daily for finals time, summer lunch breaks and my entire summer studying for the bar. The fresh bread bowls with my hot and creamy Broccoli Cheddar Soup and the Low-fat Blueberry Smoothie.\n\nShout out to Abigail! She is an absolute Doll (always greets with a smile and pleasant  positive attitude; and she always get my order right!) which is not common for customer service in NY. The bakery is also pretty good (chocolate chip cookies are fresh and delicious)\n\nPlus, with the Panera Card you get routine discounts and FREE treats! and the card is free to sign up for.", "author": "Danielle E."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-04-26", "description": "Back when I was a young whipper snapper and I was raging as an undergrad, our college town got a Panera.  Boy did we think we were fancy.  Saving all of our work-study coins meant we could dine at an establishment that served sandwiches on ceramic plates. \n\nNow that my palate is a wee bit more refined, I realize that Panera is 1 notch up from what we were served in the dining commons.  It's nice to have an alternative to fast food, especially around Fulton Mall, but really the food is pretty mediocre I ordered the Asian Chicken salad that was just a box of romaine lettuce with a few slivers of almonds and a tiny bit of chicken and a whole cup of salad dressing.  Really bizarre.   If you need a quick sandwich or salad just to refuel then this is your place to pop into.", "author": "Donna A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-22", "description": "I really like this Panera. Its really close to my school and always has good deals.\n\nThe staff is very friendly and accommodating.   They give great suggestions. \n\nEverything I eat here is usually fresh and very tasty.  Having coupons is great you get to try more of their food.\n\nGet the my Panera reward card.  I have gotten so many free desserts and drinks and best of all its free.", "author": "Laura C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-01-14", "description": "I usually come here late afternoon, since its near my job. To be fair their service is pretty decent.  A few days ago, i ordered a small chicken salad that should have include avacadoes in it, but to my surprise, not even 1 piece. It was too late to go back. Had they told me they ran out of avacado i wouldve ordered something else. I doubt ill ever be back", "author": "H L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-10", "description": "This is my spot for breakfast. I will Neva eat from dat food Cart that's in front. They have fresh labeled time food items. The cashiers are cool. The line was quick! Only con they can't warm up my muffin.", "author": "I C Y U N V S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-08-01", "description": "A bit pricey for lunch, but then again, I did order a lobster roll and soup combo. The lobster roll was a bit flavorless but did have a good portion of lobster in it. I just wish the lobster was sweeter and the roll was toasted and buttered. The summer corn chowder was also just okay. Very thick and had more flavor than the lobster roll, but nothing too memorable. \nMy friend had the steak salad which he was unimpressed with and disappointed that the steak was served cold like cold cuts (I don't blame him). Overall, it was a very filling meal, but not worth coming back for the flavor or the price. I will stick to Potbelly next door for my yummy sandwich cravings!", "author": "Cynthia M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-08-08", "description": "The food is not good here. I've been disappointed with their sandwiches (the steak one in particular) and salads. And now, their yogurt parfait! Paid $4 for a cup filled halfway with drippy can't-believe-they're-passing-this-off-as-yogurt yogurt. Gross.\n\nCome here only for coffee!", "author": "Haj da P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-03-09", "description": "It seems whenever I come here for Lunch I experience a problem. Usually it's The Coffee that is not fresh. Several times the Wi-Fi has not worked. I called Technical Support and they could not help me in time.\nWhen i complained to Corporate I was told that this was a franchised location which they had no control over. Shortly after that I received an arrogant response from the Franchisee. It's no wonder that I'd rather go to Starbucks.", "author": "Bruce S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-18", "description": "This could have been a 5 start, but I personally prefer paneera for breakfast only. Being a vegetarian, except I eat eggs, I do not find much lunch options and the one they have is extremely expensive.\nOh well coming back to this location. In morning the lines can be long at time because of all the college students and ofcourse we, the office people, but I have never waited for a really long time to place my order or pick it up. The service is pretty fast and on busy morning they have multiple people on the registers. The best part of this location is their coffee. I must say even with all the traffic and people spilling and making a mess the coffee is always fresh and the coffee station is always clean. I am a big fan of this locations coffee, I actually skip Starbucks for it.... Yew that's correct, their coffee is soo good. Also they have a whole upstairs where you can sit talk on phone take a conference call or just chill and enjoy the free wifi. \nIf you are looking for a spot for those extremely hot or cold mornings, in downtown Brooklyn this is the spot. You always find a seat and because the seating is upstairs the walking in and out traffic doesn't disturb you.", "author": "Pam K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-01-08", "description": "This Panera SUCKS. Service is slow. They never get my order correct. They are always out of something. This time they were out of two different kinds of mayo, including plain, the bread was as hard as a rock and frankly inedible. Same with the cookie. They should close this location. I'll never order from it again.", "author": "Paul B."}], "servesCuisine": "Sandwiches", "priceRange": "$11-30", "name": "Panera Bread", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "345 Adams St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/tRhAilT3G39TSIQxx_l0-w/ls.jpg", "@type": "Restaurant", "telephone": "+17186430345"}