{"aggregateRating": {"reviewCount": 170, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-29", "description": "I so love the fact they put a Panera downtown Bk.The staff here are very friendly and move at a fast pace to get you out in aa timely manner with your food.My favorite here is the broccoli cheddar soup inside the bread bowl omg mouth watering.", "author": "Shorell S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-03", "description": "Love this location. I love their salads. This location is better then the one in GateWay Mall. I love using using the kiosk its better then standing on the lines.", "author": "Shade B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-25", "description": "This is a pretty nice location that tends to be hard to find.  When I patroize in the morning it's not very busy but lunch time sure can get crowded.  I like Panera just up the hill from John Street and the other famous Brooklyn attractions.", "author": "John S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-02-25", "description": "Don't bother going to this Panera if it's after lunch. They repeatedly run out of menu items and on more than one occasion have not even had the bread as a side item option. No bread. From a place with \"bread\" literally in their name!", "author": "Brent R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-11", "description": "I was taken care of by Donovan and wow did he show out on behalf of Panera Bread!!! They forgot something in my order so not only did they replace it but they also gave me something for having to make a whole other trip back. THEN I dropped what they gave me on the train steps, and he still replaced it. If you're having a bad day or just need some amazing service, go sit and spend lunch at this Panera and see Donovan! He'll cheer you up!", "author": "Keilah J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-28", "description": "I always try to get lunch here if I'm in the area and want a nice place to sit down while eating. The service is quick and even though the wit can be 5 to 10 minutes it's quick and if you have a complaint the manager is always around to help. There is seating on the second floor that is nice and comfy. Workers are quick to clean up and help with anything. Food is usually good and reliable", "author": "Jared T."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-25", "description": "There was a large piece of plastic in my sandwhich. Almost swallowed it. Never received a call back from the restaurant. Won't be going back.", "author": "Clint C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-11-27", "description": "So, I was craving for chicken noodle soup since I had a cold. I ordered it online for express pick up. The order was suppose to be done in 10 minutes and why am I not surprised that it would take longer even though it's Sunday. I waited for an additional 5 minutes before one of the worker asked if anyone was picking up an order. I told him I was and he looked for the order behind the counter. I thought it was suppose to be at the pick up station. This was confusing. As for the food, it was mediocre. I would come back just for soup.", "author": "Cristina L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-26", "description": "WHY NO NAPKINS IN 2nd FLOOR DINING ROOMM??? They only give you two napkins with meal. So if you're in dining room and find you need more you have to walk down a long flight of stairs, make your way through the line of people waiting for food and getting their beverages in order to get \"more napkins\". MAKE ACCESS TO NAPKINS EASIER IN THE DINING ROOM OR I'M NOT COMING BACK.", "author": "Todd P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-01-29", "description": "I walked in, got in the line, order my coffee and had to wait 8 minutes to get it! The store was empty, i was the only order at that moment.\nPlease train your baristas to know the difference between a latte and a cappuccino. Train your staff to know and understand what a sense of urgency means and what customer service is all about. Clearly the barista was not even interested or concerned about serving the correct item. She even called another person to come and finish the order. I dont think i will come back to this location.", "author": "Daniel M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-28", "description": "Friendly employees, great food, and fast service. Highly recommended. Clean environment as well.", "author": "Ashley M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-02-13", "description": "The place itself is not bad; I ordered bacon, egg and cheese sandwich the other day which was over-toasted and dry; also they charged $1 for scrambled egg (should not it be included in price?).\nOverall, the prices here are below average, so it's a descent spot to grab a snack sometime.", "author": "Nick M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-07-12", "description": "The service is horrible. One word to describe the restaurant and staff is ghetto. Its unfortunately they are ppl of color because they have no sense of urgency. They talk about eachother. They hate their jobs. Make no sense to use rapid order or order on the kiosk. Because your food is never ready. They go back and forth on who is not doing what right in front of the customer. Their uniforms look horrible. They get my order wrong 90% of the time. The general manager said he will follow up and he never does. Like I need to stop visiting this location.", "author": "Maylin S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-03-17", "description": "WHO: party of 1\nWHAT: (Deets) toasted chocolate chip bagel (tasted very \"end of day\"), I liked the butter tho \nWHEN:  9:20pm-ish 3/16/17\nWHERE: take away\nWHY: free daily bagel for the month of March\nHOW: car/ bike/ public transportation B38, B41, B52, 2/3/4/5/A/C/R trains\nBATHROOM: roomy (2 stall, separate gender)\nSERVICE: cordial, slow \nBOTTOM LINE: I'm granting an extra star on this review because of the previous service I received here. Everyone deserves a Mulligan.\nTIP: go early for bagels, order ahead", "author": "Minah M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-09-14", "description": "They're slow.  For their location and considering their lunch rush time it's ridiculous!! They should have more manned cashiers. As for the food, not as much as I usually get when in the City or out of state. \nThis place a quick for breakfast if before 8:30. ... but I won't be here for lunch. \n\n\nAnd they run out of food fast!!!", "author": "Danyelle R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-21", "description": "Came here for lunch with my mom and daughter.  Mom \u0026 I both had Caesar salads and my daughter had the grilled cheese.  The salads were really good, not the best I've had but very good.  I'm a crouton lover and wish there would have been more--there were 3 large pieces in my bowl.  The grilled cheese sandwich was \"alright\" as I'm told.  Her preference was one cheese instead of two sandwiched in one.  I thought it looked like a lot more bread than cheese and was not worth the $8 price tag.  They were really busy--but seemed extremely organized.  The gentlemen distributing orders helped me bring a tray up so I did not have to make two trips.  This was unexpected and much appreciated.  We all had agave lemonades (sooo good) which were sweet and tasted better once a bit of the ice in my cup melted down but that's not a complaint--very good drink selections--some on the sweeter side, some on the unsweetened side.  Can't wait to try more menu items!", "author": "Margarita G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-02-04", "description": "Man this Panera is bad. I keep making the mistake of coming back here. The food is fine but I have waited up to 30 minutes for my food after ordering! Unreal. Staff is not friendly. Heard several employees arguing with each other and not working. Employees are usually on their phones. Do not recommend this place.", "author": "Brandon M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-12-07", "description": "If you want to go to bathroom then you always have to ask someone to open the bathroom door for you, and they have to open it with their key!!!! And when I ask for it it takes way too long. None of the employees and managers have a good attitude at all!!!!!", "author": "P P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-10-04", "description": "The cashier, Tajhan, was very polite and even offered me a rewards card to use for future purchases.  The negative feedback is that I won't use that rewards card at this Panera Bread location because the food and atmosphere is no bueno. I had a $15 gift card and since this is the closest Panera to me I used it there.  But I've been to this Panera several times and most of the staff always seems disorganized and disinterested. The young kids that work there do a lot of loud cross talk with each other. And after an older man asked and waited for six or seven minutes to get the bathroom key, I had to signal one of the staff to get the key. There are always literally too many cooks in the kitchen, and the food is...Meh.  I ordered a soba noodle edamame bowl, which sounded good.  But when I got it home, it tasted like a subpar microwave meal.  Odd taste and texture to the noodles.  And the Greek salad was nothing special -- Trader Joe's has a Greek salad that tastes better for half the price.  The best part of the meal was the multigrain roll. So even if the customer service was better, based on the handful of times I've tried Panera's food, I will stick to Pret, which is friendlier and fresher.", "author": "Tracy H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-06-23", "description": "Shame on this location. I usually love Panera, but try to avoid this location if you can. Quite crowded and the staff seems to be on edge. My mother order a tomato mozzarella flatbread. There was almost nothing on it! One tiny sliver of cheese, two extremely thin slices of tomato and barely any greens. Not even enough for a child. When we asked where the rest of it was and why there was so little, we were told it was all there and dismissed. \n\nAs someone who's worked in customer service and the restaurant industry for years, that's completely unacceptable. \n\nNever going to this location again.", "author": "Kristen K."}], "servesCuisine": "Sandwiches", "priceRange": "$11-30", "name": "Panera Bread", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "345 Adams St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/tRhAilT3G39TSIQxx_l0-w/ls.jpg", "@type": "Restaurant", "telephone": "+17186430345"}