{"aggregateRating": {"reviewCount": 229, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-15", "description": "I really like this place. I went twice for dinner and wasn't disappointed although I was weary both times based on other reviews. I can see how some of the lower star reviews make sense. However, this place certainly doesn't deserve 1 or 2 star ratings.\n\nI do believe the menu is a bit overpriced. But a couple bucks, a couple bucks there. I suppose this is a norm for NY so no sense in whining over that. It was empty both times I went, which again, not entirely sure why. \n\nThe service is good. Both times, we were greeted and attended to right away. The staff is not overbearing and constantly checking in.  Its nice and quiet in there which is a nice change compared to the buzzing places nearby. The mood is a romantic. The music is awesome! \n\nFood is yum! I had the lobster ravioli twice. Lobster stuffing was deelish and the ravioli dough itself was a thin delicate shell of pasta. Not obnoxiously bready. We had the spinach and gorgonzola appetizer which was amazing. Mussels were on point. And for an entrée, the filet of sole, or some sort of fish (I cant remember). It was crusted with onion and a nice crispiness on the outside. \n\nAll in all I'll return to Bevacco.", "author": "Rheem A."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-06-21", "description": "The food was great, but the service was unbelievably rude.\n\nWe went at 5 PM on a Friday and although the place was empty, the host told us he was hesitant to seat us because he needed the tables free at 6. I had to convince him that we would be done by 6. Nothing like being put on a deadline when eating out.\n\nThe waiter misunderstood our appetizer order - no problem, that happens - but when we corrected him once the wrong food came out, he sighed and rolled his eyes and claimed that we weren't clear enough when ordering. OH I'M SORRY.\n\nDon't bother, there are better, cheaper, friendlier places for Italian food.", "author": "D B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-18", "description": "Despite some of the poor reviews here, I have been to Bevacco several times for brunch, lunch and dinner, and I enjoyed them all. It has really nice industrial kind of decor and it's roomy so you don't feel squashed like some NYC restaurants do. \n\nI once had an appetizer I didn't care much for. It was one of the specials  - a strange mashed potato soup with spinach. The husband liked it though. What I loved was the duck, pasta and pizza. Brunch the one time I had it was a short rib sandwich, and it was very tasty. Dessert I recommend is the chocolate mousse, so good! Anyway I guess it's a hit or miss kind of spot, but I've been hitting!", "author": "Angel S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-12-02", "description": "We slipped in here today for lunch while in Brooklyn. I can't say the food was bad, but it was overpriced in my opinion. I had an Italian burger (panini) and my wife had a prosciutto panini. Both came with a very bland and very dark green salad. The sandwiches were great, I would eat either one again. But withe them, a coke for my wife and a beer for me, our bill was $42!  Kinda steep in my opinion. \nThey had some nice looking entrees starting at around $22.\nLike I said, not bad food or service, just average. Priced for above average though.", "author": "James B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-03", "description": "My brother and I stumbled upon this place after walking across the Brooklyn bridge. I had the shrimp gnocchi which were absolutely fantastic. My brother had the grilled vegetable panini and he devoured it. The poor waiter was alone so service was a bit slow, but he was very nice and professional. A great find!", "author": "Noemie S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-05-24", "description": "What a disappointment!\nThis is a lousy restaurant with poor management and slow service. \nFood mediocre and inconsistent, not to mention sneaky over charges on drinks.\nIf you are looking for a warm and pleasant dining experience STAY AWAY!!", "author": "H Mari G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-10-16", "description": "Bevacco has what it takes to be a very good restaurant, and perhaps it's just getting its sea legs.  The food has some hits and some misses. The space they renovated so nicely has a kiss of death history, but on a Sunday night, they almost filled their large room.\n\nFirst, the gripes: \n\nOur food took forever to get out of the kitchen. They waiter apologized several times, and tried to manage our expectations.  They should have comped us a drink or dessert.\n\nOne of the salads was meh, and the duck was overly fatty and not interesting.\n\nThe positives:\n\nThe saltimboca was quite good. The fried bronzino was decent.  My scallops with black ink tempura was tasty, and interesting.  \n\nNice wine list and the prices are reasonable.  The decor is pleasant, and the service attentive.\n\nI'll try them again in a few weeks because they are so close to home and I wish them well.", "author": "Matthew P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-11-15", "description": "We wanted to go to the recommended noodle pudding but got there late and there was a wait of an hour, we were hungry so headed up the street where we came across this place. It was pretty empty which we knew was not a good sign but we were hungry and not super fussy do we decided we would take a chance.\n\nWhen we entered the host asked if we had a reservation which was a fair question but when we said no he made a point of going to check his book, the place was empty and it didn't fill up. \n\nThat aside the service was good, both fast and attentive. The pasta was \"fine\" as was the pork, pizza was good but my Americano Burger was beyond vile. It was not a burger, it was a pressed panini sandwich made with ground beef that was soggy and oily, somehow it managed to be both disgusting and bland at the same time. I was disappointed in myself for eating as much of it as I did.\n\nThe food was meh to bad and the service was meh too good so it's a bit of a meh wash. Two stars.", "author": "Uno M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-10", "description": "I can't figure out why this place is always empty. I have been a few times and have never been disappointed. The service has always been fantastic and the food is good too.", "author": "Alyssa R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-22", "description": "I didn't have high expectations for this place going in, and not for any particular reason.  One of my dining companions grew up in the neighborhood and didn't really express any enthusiasm about the place which perhaps accounts for my perspective going in.\n\nThe appetizer, fried calamari was good.  It was definitely fresh and well prepared but the real standout was the Sliced skirt steak, potato croquette, black truffle sauce, radicchio flan.\n\nThe steak was very tender, flavorful and well-cooked.  I want to go back just for that and I don't even live in the area, though if I did I would probably be a regular.", "author": "Bryant R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-21", "description": "I honestly didn't have high expectations of this place based on Yelp and when we walked into the restaurant at 7:30pm on a Saturday, it was rather sparse.\n\nHowever, my experience at Bevacco was a great surprise! The place did fill up a bit as the night went on and it wasn't too crowded/loud. We got the goat cheese plate and radicchio salad. Neither appetizer wow-ed me, but both our mains were really good! My company got TAGLIOLINI AL POMODORO, and the sauce was really tasty (especially with the homemade focaccia and goat cheese starter). I got one of the pasta specials which was fettuccine with scallops in a light cream sauce. Every bite was heaven! Usually I find that I get bored of pasta and its sauce after maybe the 10th bite, but the first and last bite of this dish was wonderful. The sauce wasn't heavy at all either.\n\nService was pleasant, atmosphere was charming, and prices were right (except for maybe the wine). I'd come back!", "author": "Pam H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-17", "description": "Had a pre-show dinner here with my boyfriend last night and it did not disappoint! Granted, we did arrive on the early side, but even as the crowd picked up, the servers were quick and attentive without hovering too much. The food came quickly, and was superb. The specialty cocktails are old-fashioned, charming, and very strong. \n\nWe started with the broccoli rabe and feta cheese small plates, which they serve with focaccia. He had the daily pasta special of spinach ravioli, and I went for the Saltimbocca - pork tenderloin with prosciutto, sage, truffled mashed potatoes, and grilled asparagus. It was all divine. There's so much more on the menu I'd like to try (especially some of their homemade pastas!), so I definitely plan on returning!", "author": "Adrianna B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-23", "description": "I suggested we end our dinner outing by taking a stroll and finding a place to settle in for dessert or a nightcap. My co-workers agreed to something sweet but no drinks. Ugh, Lame!\n\nSo there I was left to come up with the place to have dessert. One block over and up from where we had just wrapped up our family style dinner was Bevacco and I'm really glad I had a craving for tiramisu.\nWe all agreed to share one serving but our really nice server suggested we also try the Bomboloni. I wasn't familiar with the dessert so I had no idea what to expect. \n\nFirst off, the tiramisu was absolutely delicious. I ate most of it. But the Bomboloni was way beyond what I was expecting. It was a warm custard filled donut surrounded by raspberry drippings. We all agreed that I should eat most of it and I did.\nDessert= 4 Stars!", "author": "Robert M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-03-24", "description": "Great location in Brooklyn Heights ~ with a unique twist of industrial and historic elements the appearance is inviting.\n\nThe food and drink menu could be viewed as difficult to navigate for someone who is not an expert in an authentic Italian menu. The bar tenders were neither inviting or helpful which leads one to believe that a big empty restaurant is never a good thing. Once the food and drinks arrived they were good - noting over the top - but good. \n\nRunning in for a quick glass of wine - sure, an evening out, I would recommend the wine bar across Cranberry Street.", "author": "Stephanie G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-08-07", "description": "With the new Tuscan Gun chef, the menu doesn't seem that expansive or unique but so far the dishes have tasted good. except, when you eat there the portions are a nice size, when you order takeout its about half the pasta where you're left still hungry.\n\ni will also say that we happened to be dining when there were 3 families with kids maybe between 2-5 yrs old that were either screaming or running amuck in the place. With the din/echo of the restaurant, it wasn't exactly pleasant or relaxing dining. Some wood floors or or walls might help the sound absorption. Some discipline from the parents might help their unruly kids.\n\nEven before Bevacco switched chefs, something felt missing or off at this restaurant. maybe it needs even more time.", "author": "Clarita H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-08-13", "description": "I truly enjoy this place and what it offers in choices of pasta...now only if staff had the same respect and attentive behavior. The struggle was real.", "author": "Cindy K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-12", "description": "Came here last night for a friends birthday party, it was so quiet for a Friday which was surprising. Especially since the  service and food was great. For apps we shared, fried calamari - crispy and perfectly cooked, the meat and cheese plate (great size for 2-4 people), olives, and some beets. The bread was also this great foccacia with high quality olive oil. \n\nFor the main course I tried the black pasta with shrimp. It was fantastic, good flavor, a good amount of shrimp and the portion wasn't overwhelming so I could still have dessert. They also let us bring in a cake (and didn't charge us to slice) unlike most places in this city. I certainly want to come back here again and try some other dishes.", "author": "Lauren G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-28", "description": "Had a fantastic meal at Bevacco last night!  My girlfriend and I heard that Gabrielle Corcos was taking over the kitchen and we had to check it out.  \n\nThe food was delicious.  We started with a seared scallops appetizer, which was one of the best scallop dishes I've had in my life.  The scallops were cooked perfectly -- a deep sear while being succulent and sweet on the inside.  The scallops were placed over a vibrant pea puree and were topped with pieces of fried zucchini.  Perfection!  \n\nMy girlfriend had the pappardelle with duck ragu, which was rustic, comforting, flavorful, and surprisingly light.  I had the porchetta and loved it.  The crispy, salty and herby skin on the pork was ridiculously good.  But the potatoes really did it for me.  The skins of the potatoes were crispy while the inside was soft, roasty sweet, and almost buttery.  \n\nOverall, we loved the food and the staff was very helpful, friendly, and accommodating.  The wines recommended by our server were spot on and went perfectly with our dishes.  We'll be back!", "author": "Joe S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-01", "description": "Went for brunch, which they recently started serving.\n\nFood was great, service was friendly and prompt. French toast was inexpensive at $6! The atmosphere is pretty sharp, save for the orchestral movie theme muzak. Though it does make fun for on the spot trivia.\n\nBut a Bellini was $10. What the what?\n\nSounds like they have service/manager issues at dinner. But we will be returning for brunch for sure.", "author": "John M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-06", "description": "This is the Brooklyn gem you've been looking for. Not sure if things have changed since the previous reviews, but I did not experience what some others are claiming. \n\nWhat I did experience was a well portioned delicious pizza. My friends and I got each of the pizzas on the menu and shared, so I'll tell you right now the prosciutto is the best (never enjoyed prosciutto until now, guess I just had to put it on pizza).\n\nOn another night I had the bevacco burger, medium rare. Perfect burger to bun ratio. I've yet to go through everything the bar has to offer, but the list is diverse. Ace cider went great with my Margarita slice.\n\nFriendly smiling service that never felt intrusive. The waiter did have to check on 2 drink items to see if they had it, but we enjoyed the atmosphere so much, it hardly mattered. Candles were put at our table come dessert time, very nice touch, but I can't remember if that was due to evening setting in, or because we ordered dessert. \n\nThis place has such a nice look with the wide industrial style Windows, complimented by the surrounding mirrors; even the restroom has a unique look! Easily the best atmosphere on Henry Street.\n\nWhen you're done walking the Brooklyn promenade or pier, and you're looking for a relaxed, upscale environment that won't break the bank, you head to Bevacco. If you and your date can't choose between Burgers or pizza, you head to Bevacco. If you finish a walk across the bridge, you just earned yourself a trip to Bevacco. A Brooklyn must.", "author": "Jon N."}], "servesCuisine": "Italian", "priceRange": "$11-30", "name": "Bevacco", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "60 Henry St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/81ry7bSsEkxWQel3tctGRg/ls.jpg", "@type": "Restaurant", "telephone": "+17186241444"}