{"aggregateRating": {"reviewCount": 229, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-09-01", "description": "So don't shoot me down, cause I admit it freely, I am a Manhattanite and do not venture all that often to this side of town.\n\nWe came here for lunch on a weekday as part of a work event, so it is completely understood that the place would be empty. A large earthy Italian feel to the place, all hard surfaces so I suspect it gets noisy at night if busy.\n\nHad absolutely no complaints about the food, the fresh cheese and tomatoes were awesome and I had the spinach gnocchi in a brown butter sauce, which while it looked a little blah, tasted just awesome. Oh and the char-grilled octopus was full of flavor. So all up, very happy with the food.\n\nDownsides, don't order coffee, it had to be the most over-extracted espresso I have tasted in years. Horrible. Overall though I would go back, if I was in Brooklyn already.", "author": "Paul D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-08-07", "description": "I so want to like this place. My wife and I heard that Gabriele Corcos was the new chef and we were excited to give it a second chance.\n\nSo first we ordered takeout. We both got the TAGLIATELLE AL RAGU and it was delicious. The portions were small for the price ($15)  but the flavor was spot on and exceeded my expectations.\n\nSo then we dined in and this is where it fell apart for us.\n\nFirst, the restaurant is very very loud. It was probably a 1/4 full and it sounded like a High School cafeteria. It wasn't that people were talking exceptionally loud it is simply the acoustics of the space. From the floor to the ceiling to the walls to the table,  everything is a hard surface, not a single soft space to absorb sound. The tables next to us were empty and I still couldn't here my wife talking to me.  It was the first time I ever asked her if she would like to get our meals wrapped up to go - it was that uncomfortably loud.\n\nBut we were there for the food and sadly that didn't go so well either.\n\nTo start, we split the Grilled Calamari and Grapefruit salad. The flavor was quite bland with only 4 small pieces of grapefruit and barely any calamari. They compensated with a lot of fennel and baby greens but that really wasn't why we ordered that salad.\n\nMy wife ordered the PAPPARDELLE  with DUCK. She thought that it was quite nice and enjoyed the generous amount of Duck. However, she pulled out a handful of small bones from the pasta as she was eating - that sort of ruined it for her.\n\nI ordered the PAN ROASTED CHICKEN with POLENTA. The best I can say is that it was pedestrian. The plate was ugly, a huge pile of polenta with a piece of chicken in the middle. The chicken itself was dry and chewy and the polenta was unmemorable. If I was severed this at a friends home for dinner it would be nice but this was BEVACCO with a new chef and it left me underwhelmed.\n\nAt the end of the day, we would say that the pastas are the only things that we liked. We will probably try it again because everyone  has an off night and there is nothing more I would like to do than to update this review with 5 STARS.\n\nWe are truly rooting for you.", "author": "kan L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-09-28", "description": "\"It LOOKS like pizza\", I said as I took another bite of possibly the least flavorful pie I've ever had. It reminded me of the free pizza you get at dive bars like Crocodile Lounge... only it wasn't free.\n\nDecent service, nice atmosphere... WORST pizza out.", "author": "Andrew F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-04-06", "description": "This place is super adorable from a decor standpoint and has an amazing bar with an art deco ambience and a beautiful marble slab that was custom installed to wrap around the hipster bar tenders as they mix and shake.\n\nThe dinner menu looks great with homemade pastas and lovely antipasti. We love the ricotta dish. Heavenly. I found that the entrees are hit or miss. A homemade beet ricotta ravioli was a home-run, while their saltimbocca was just so-so. For $20/entree I want everything to be more or less stellar.\n\nAnd now for the service. Absolutely atrocious. It took a million years to get a server to even give us menus. The terrible service went on all night.\n\nLove the decor, love the menu, but the execution leaves something to be desired.", "author": "Lily A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-01", "description": "The food here is outstanding, and very reasonably priced. I live in the neighborhood and have never been here because it's always empty. I have no idea why. 4 of us all ordered different things, along with a couple of sides and appetizers, and everything was just amazing--steak, tuna, pork, lamb pasta. \n\nThe reason this doesn't get 5 stars is the service. The manager was great and the server was attentive, he was just not very professional. Casual comments and conversation that you just don't want at a fine dining establishment. Looks like from the reviews the service is this place's downfall. Sort that out guys, because I want you to stay in the 'hood!", "author": "Allison P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-04", "description": "We were there super early since we all skipped lunch and there was seating available everywhere. The weather was pretty bad as well.\n\nService was decent but we were expecting bread and olive oil that never came. Our water was always filled and we had an extra bottle at the table. My friend ordered and fettuccine bolognese. The pasta was and sauce were great. I'm always a fan of pesto and never had the broccoli rabe pesto so I gave it a try. It was flavorful and filling and green just like I like it. You can still see the pieces of broccoli rabe in it. There is a friend calamari, zucchini, and orange peel dish which was lightly breaded, good amount of saltiness, and hint of citrus. The pizzas looked great.... maybe next time!", "author": "Helen L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-01-31", "description": "We decided to go here spontaneously because the wait for Noodle Pudding was too long, and Bevacco takes credit cards and we didn't have any cash. Unfortunately a very large party of 10+ drunk people came in about 15 min after us, so our server was pretty frazzled, and didn't pay much attention to us. The olive oil served with the bread was particularly delightful, but the actual entrees were just ok. My boyfriend had the gnocchi with handmade sausage, which was delicious, but came in a fairly small and plain portion, just a heap of stuff on a plate, no sides, no presentation flair at all. I had the salmon special, over carrots, potatoes, shaved almonds, and a green-goddess-esque sauce. The salmon was great, but everything was drenched in salt - I could literally only taste salt on all the sides. And I wished there had been more almonds on the dish, that was a really nice touch. My portion was also pretty small. For dessert I had the red wine poached pear with marscapone cream, which was absolutely phenomenal - best bite of the night by far. \n\nWould love to go back to try the cocktails / booze selection, which looked amazing, but will probably stick to the bar (and maybe that poached pear deliciousness again).", "author": "Sam C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-12-13", "description": "This was a disaster brunch. Clearly the kitchen was on autopilot. The food was not even mediocre- it was just plain bad. Lazily prepared. The breakfast panino arrived lukewarm and whatever bacon-esque meat was on it was fatty, stringy and limp. My friend ordered the salmon benedict and they brought him one w Canadian bacon and he accidentally ate some before noticing- and he doesn't eat pork. The waitress was nice but considering the place was empty (we were her only table), you'd think she might have caught the kitchen's mistake. They took it off the bill, but still....really not okay. Nothing bugs me more than places that clearly don't want to offer brunch but feel like they have to and then do a half-assed job with an uninspired menu. I literally ate half my sandwich and lost my appetite.", "author": "Katie V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-06", "description": "Been here twice and would go back. Food was flavorful and high quality, gourmet and still satisfying as Italian food can be. I've had the goat cheese ricotta; squid ink tagliatelle with shrimp, artichokes, and a mint cream sauce; branzino in a tomato sauce; short ribs and polenta; and for dessert, espresso panna cotta, tiramisu, and the wine-poached pear. Superbly decorated with an Art Deco feel and spacious.", "author": "Svetlana T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-19", "description": "My brother recommended I take my main squeeze, cuz she speaks Italian and knows a lot about the food. \n\nSo, the wine list is good, the food choices are fine, the servers on point (though stylistically, wasnt really feeling the two that were there) and the taste works, but like, it didnt blow me out the water. Maybe I'm a bit spoiled growing up with a bunch of guineas.\n\nI dunno if I would come here again, but I did enjoy my experience.", "author": "William C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-23", "description": "Had a really nice celebratory lunch here. Loved the atmosphere, the pasta, and the service. We all had different pasta dishes and they were all delicious. Pasta is homemade and the serving size is perfect. Calamari was a great appetizer (and comes with some fried zucchini too) and cappucinos were delicious! Our waiter was fantastic! We loved it here and would definitely come back next time we're in the area.", "author": "Lena L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-31", "description": "Went for dinner on a recommendation. Glad we did. Our table of four did a lot of ordering and everything was exceptional. It was our waiter's first night of working on his own and Marquis handled us like a seasoned pro. Very knowledgable, presented all options very well, and served us perfectly. We had the pleasure of sitting at the bar prior to being seated and the bartenders were having a ball while hustling drinks and interacting with all the customers. Michael was particularly impressive in his abilities.\nWould highly recommend this place as a local, fun, and fabulous dining destination.", "author": "Louis C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-10-09", "description": "I have to upgrade this one more star.\n\nCan't bear the thought of the friendly bar staff being stiffed because of the poor wait staff.\n\nI've been back to Bevacco since my original review, but just only at the bar.  And those guys there always do right by me.", "author": "Ming O."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-10-31", "description": "I had to update this place went so far down hill. The last few times I was there I had an order go wrong, and the waiter blamed me, though he wasn't writing down the orders. Once is fine but I stopped coming by after the third time. Too bad, this place used to be nice.", "author": "Vincent T."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-12-16", "description": "Probably the worst brunch I have ever had. The Bevacco kitchen staff clearly does not care about the food--the eggs florentine and an egg sandwich which my friend and I ordered were perhaps the sorriest dishes I have had in awhile. Bland, uninspired, and cold. Worst still, I had ordered my eggs florentine dish with smoked salmon but instead I was served ham, which I do not eat. Unfortunately, as the meat was buried under the eggs, I didn't realize that I was eating ham until a few bites into the meal. The waitress was incredibly apologetic and sweet but it's still a rather awful mistake. Avoid this place.", "author": "Toby G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-04", "description": "Great food in Brooklyn Heights!!! I live across the street and have never had a bad meal here. They have a very diverse menu from pizzas to burgers to paninis to pasta to gourmet entrees. Their burrata and salmon tartare appetizers are great. Love the fish entrees as well as their ever changing homemade pasta options (specials). Low key, never very crowded, great for groups. They even have a good sized bar, with lots of selections.", "author": "Dara B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-16", "description": "If you're looking for a glorified Olive Garden, this place isn't it.\n\nBut if you want old-world contemporary Italian that isn't outrageously priced, come here. The food is more northern than southern, so you won't find your typical saucy lasagna that you find in immigrant Italian-American joints with recipes that haven't changed in a hundred years. Instead, you will find the best of modern Europe with a fresh take on traditional ideas. That includes rabbit, steak, branzino, and other land and sea fare.\n\nPastas are freshly made and cooked al dente (but you can ask for it softer if that's your preference). The meats are organic, i.e., grass-fed beef, free range chicken, and produce is local. Some items are imported like olive oil. As of the summer of 2012, pizzas are $11 or $13. Pastas range $9 to $15.\n\nTwice, I've ordered the skirt steak with spinach instead of the potato croquette. They have no problems making substitutions. It still came with the radicchio flan which just melts in your mouth and is a pleasant accompaniment to the steak.\n\nThe pecorino and pear appetizer is rich and complex with just the right amount of sweetness to complement the cheese. Their version is baked, yet mouthwatering.\n\nPrevious reviews mention the \"high\" prices and that if this place was in the west village it wouldn't survive. I disagree. You pay for the ambiance, the attention to details such as the push button light switches in the bathrooms, the Edison bulbs in the light fixtures, the outlet covers, and replacement of a step with a wheelchair-friendly slope. But you also pay for the quality of the food. You can't get grass-fed steak for less than $25 in a place with this kind of atmosphere. Maybe you can at a hole in the wall.\n\nThe banquettes are comfortable. If you're lucky, and on a romantic date, you can get one of a few corner tables where the banquettes wrap around. I came here when I had fatigue and got to relax at one of these corner tables. It was comfortable but not loungey, so much that I didn't want to leave.\n\nAs for the service, there must have been improvements, because so far for the 5 times I've been here the service is as good as Jack the Horse around the corner. This is fine dining if you want it right here in Brooklyn.", "author": "Kiai K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-07-26", "description": "I have been there twice.  Very few tables were occupied.  The food is pretty good and well made.  Ingredients are fresh and they take care in the preparation.  The sauces were delicious.  What I love is the décor.  This place is amazing.  I like the industrial, old world feel.  What it's missing is plants.  Sitting there, both times, I see this place with big leafy plants to round out the edges.  The venue reminds me of old Havana with the openness and the fans. If they added the plants, got some classy Cuban music and changed the menu to Cuban cuisine, it would be outstanding.  There would be no need to compare it to Noodle Pudding because it would be in a league of it's own.  Ok, so that's probably not going to happen but a boy can dream.  In any case, it's worth a visit.", "author": "K C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-07-21", "description": "A few of my friends and I decided to try this place on Thursday night since we showed up way too late for Syfy Movies with a View and that ruined the attempt at a movie/picnic. Since one of my friends is a vegetarian and another has a palate that only includes hamburgers, Greek food, and pizza, we settled on this restaurant since it had options for the more adventurous eaters among us as well as the more conservative. \n\nOur vegetarian ordered the VEGETARIANA (housemade gluten free tomato gnocchi, asparagus flan, eggplant croquette, Parmigiano Reggiano fondue), and the portion size was incredibly tiny for its \"secondi\" classification and $19 price tag. It seriously looked like an appetizer, but somehow he claims he was full by the end of it. I can't attest to the magical powers behind this dish, but I'm skeptical that that appetizer-looking dish was doing more than just teasing his taste buds. \n\nOur other picky eater chose the MARGHERITA PIZZA (tomato sauce, mozzarella) and said it was very good. Again, due to his strange dietary restrictions, I can't really recommend their pizza or not, but I can say that the portion size was actually plentiful. \n\nMy foodie friend and I split the PAPPARDELLE (housemade papardelle, white lamb ragu, asparagus, truffle oil) and the ANATRA (roasted duck breast, pistachio mashed potatoes, red onion marmalade, blueberry port reduction). The PAPPARDELLE was reasonably sized and pretty good. They use the super skinny asparagus, which is slightly disappointing because I actually much prefer the fat ones, but I'm just being picky. The papaerdelle was cooked well, the ragu was good, the truffle oil was subtle but you could taste it. \n\nThe ANATRA was super tiny. There was a palm sized, thin cylinder of mashed potatoes in the center with two small pieces of duck on top. This easily could've passed for a heavier appetizer just like the VEGETARIANA, and again, with its $25 price tag I thought they were kidding. The pistachio mashed potatoes were okay, I couldn't even find the red onion marmalade, and the blueberry reduction didn't work with any of the flavors on that plate, so it seemed superfluous and an overall poor decision. \n\nFor the portion sizes, the food is terribly overpriced. Also, our waiter was just weird. I can't really explain what about him was so off-putting though. When we walked in, the place was empty but we decided to give it a go since Yelp rated it well and we were starving. I really think Yelpees are sometimes too liberal with their 4 star ratings because seriously guys, this place was not worth it at all. 1.5 stars, but I'll round up because the food/experience wasn't awful.", "author": "Alex S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-13", "description": "Great vibe, decor and location.  Large space.   Excellent service.  Food was just right and well priced for the hood.  Nice wine selection.  Give them a try.", "author": "Kristopher D."}], "servesCuisine": "Italian", "priceRange": "$11-30", "name": "Bevacco", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "60 Henry St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/81ry7bSsEkxWQel3tctGRg/ls.jpg", "@type": "Restaurant", "telephone": "+17186241444"}