{"aggregateRating": {"reviewCount": 229, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-01", "description": "This place is a hidden GEM - definitely my favorite restaurant in Brooklyn Heights. Great spot for a date or family dinner. The Cacio e Pepe, Duck Carbonara and the Parmesan Crème brûlée appetizer are all UNREAL. Drinks are also fantastic - the Fulton's Bounty and Tarantino are my personal favorites. Seriously high quality food and great atmosphere.", "author": "Gabrielle K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-18", "description": "Bevacco is a fantastic restaurant in a great area of Brooklyn, right across the Brooklyn bridge. The ambience was great and the staff was warm and welcoming. We had an unbelievable meal complete with drinks, appetizers, pizza and pasta and dessert with coffee. The lemon aoli sauce served with the calamari was heavenly! The meatball was awesome. The goat cheese appetizer - OMG!! We also loved our assortment of pizzas - thin, crispy crusts and great toppings. It was no ordinary pizza. I didn't have any of the pastas but those that did loved them. The butternut squash tortellini was a huge hit! For dessert we had the chocolate cake and the pear torte. The cake was gone in a heart beat and the pear torte was amazing!! Seriously, one of the best desserts I have ever had in my life! Coffee was great too! The whole experience for our party of 10 was perfect!!", "author": "Kerri B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-28", "description": "Last night my boo treated me to dindin here. It's a small place with a U-shaped bar at the center of the room and seating all around the wall's edges. To the rear on the left as you walk in is the access to and from the kitchen, storage, and bathroom areas. \n\nWe had a reservation for 5:45pm (a tad early as we had an event later that evening). There was barely anyone there, as far as eaters go. Our server was kind and possibly bored, so we got great service, especially with water refills. :) \n\nWe got to sit at the rear right corner, which was really nice because I love sitting next to my boo vs. across from him. :) \n\nWe ordered a starter and two entrees. The starter was the \"Parmesan crème brulee, balsamic reduction, grilled sourdough.\" It was really tasty. They also brought out small bread pieces with olive oil to dip as part of the gratis. Both were delicious. We dipped our sourdoughs into the parmesan creme brulee, but there was plenty more cheese left over, which we then dipped the scrumptious small bread pieces into. It might be wiser to spread it on your bread slices instead.\n\nMy boo had the \"Roasted duck breast, fingerling potatoes, kale, blueberries, pistachios.\" He ate every last bite. It looked and smelled good. I didn't try any of the duck because he ordered Medium instead of Well, so perhaps another time I'll revisit to try it a different way. \n\nI got the \"Organic salmon, roasted radicchio, fennel, orange, almonds, shallot vinaigrette.\" The salmon was tasty along with the orange bits. The roasted radicchio was too bitter and salty for my taste-buds! The fennel was pretty good and the skin of the salmon was on top of the fish -- I recommend you (the customer) move the orange bits away, peel off the layer of the skin (very fishy) and then mix and mingle the fish with the orange bits. There were barely any almonds on my dish (I only saw 2 almond slices), so it's a bit tricky for me to comment on that tidbit. \n\nWhen we started to finish up our meals, the space became more and more occupied by clientele. We looked at the dessert menu. There were some eye catchers, but we didn't order anything. \n\nWe got the tab fairly quickly upon request, and it was paid via cc and we didn't have a long wait for the return of the check! \n\nHappy eats!", "author": "Ronit M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-11-26", "description": "I came here to have dinner with my boyfriend. The food was good but the service we got was horrible. When we finished our meal we exited through a curtain and about 5 seconds later walked right back in because my boyfriend decided to use the bathroom before we left. I went to wait by the bar and the same waiter who 30 seconds prior had brought us our check came to me and in a very nasty way told me the public bathroom was across the street. He then ran to the bathroom and shouted at my boyfriend who was inside the same thing about the public bathroom being across the street. I understand that random people should not be going in to use the bathroom but this same waiter had just served us. As a paying customer of this establishment we should not be treated this way. I will not be returning and do not recommend this place to anyone. This is no way to treat a customer.", "author": "Vanessa G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-03-26", "description": "Check your bill\n\nI've read on other restaurant sites that you have carefully review your bill. The polite and obsequious waiter added a 20% gratuity without my asking. \n\nThe food was delicious and the house wines were good. It is a quiet restaurant, which I prefer, so much that I wonder how they stay in business. Every time I have been there or walked by, there were just a few people. \n\nThe food and service would have warranted a better rating. The distrust over the bill takes away from the value.", "author": "Jay C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-12", "description": "Sunday late brunch was a total treat at this restaurant today. The design was relaxed \u0026 elegant. Quite a combo. Marble tables, bentwood chairs, penny tile floors. The staff gave us an easy welcome and our pick of a table. We hung out for an hour or so, enjoying steak, eggs and smashed potatoes \u0026 Eggs Benedict. It's the kind of space that invites you to spend hours talking. Check out the W/C. A marriage of carefully picked objects with the same DNA: waste basket, electric socket cover, soap dish...you get the picture. \nThank you, Bevacco!", "author": "Perry C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-10-18", "description": "Honestly...I don't know if there was a single thing I liked about this place...\n\nMy friends and I were supposed to go for pizza somewhere a few miles away but since they were absolutely packed, I did some searching online to find another place we could try out. This was on a Saturday night. Originally we were going to go to Noodle Pudding but they were full too so we walked down a block since this place seemed like there wasn't a wait. Totally regret my decision and should've just waited somewhere else. \n\nService wasn't great. Seemed annoyed pretty much the whole time. Food, don't even get me started. It was disgusting and way overpriced. I had the porkloins with asparagus and potatoes. It was so salty and had such a strong taste of sage that I just ate the potatoes and asparagus, which I basically spent $21 on. My friend got the pizza which was a safe bet for her and I think I should've gotten as well at this point. $14 though? Don't even get me started on my other friend's octopus appetizer which came with 5 burnt pieces and some weird sides which was also $14...wish this was a joke to be honest. \n\nTo top it all off, the bill came out to $53. My friend wanted to charge $14 on her card. The server said it was declined which didn't really make sense. She called the credit card company today asking why it wasn't working since it was already activated. Turns out it wasn't declined, it was actually charged 4 times, $14 a pop and then on top of that the next day there was a random charge from an online site...Lol this place is a complete joke. Do yourself a favor and find another place to eat, even if you need to wait.", "author": "Shirley W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-24", "description": "Had the Grass fed beef, veal \u0026 pork bolognese, spinach tagliatelle, parmesan and it was excellent! Beautiful restaurant, great service and wine served without judgment. Can't wait to return on my next trip to NYC!", "author": "Letty E."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-04-23", "description": "Bad experience\nOld bread\nSavorless pasta\nAntipathetic service\nAnd expensive.\nDefinitely we don't recommend", "author": "Fernando A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-16", "description": "As a European living in California we are very demanding quality of food wise. We went there twice in a row this week and the service has been excellent whatever the shift was. Emma, our Russian waitress has been dedicated and pro. The Negroni cocktail is prepared like in Milan! Food is delicate, tasty. Softened atmosphere. Kids are welcome. Perfect!", "author": "Franck C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-01-18", "description": "BLah! Hated the place! Pizza was not that great but my friends chicken panini was really good. Our server Alex was super cute and helpful. Thanks Alex you are the only good thing this restaurant has to offer!", "author": "A K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-05", "description": "We stopped for brunch after attending Plymouth Church just around the corner. Both the omelet and the baked egg were wonderful. Great atmosphere watching folks stroll by on their way to Brooklyn Bridge park. Service was timely, knowledgeable and attentive.", "author": "David S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-09-26", "description": "Avoid at all costs. There's a reason why Noodle Pudding (awesome place and 1 block down) has a line out the door and this place is completely empty on a Saturday night. \nTerrible service. Absurdly overpriced. Tiny portions and poor quality. To top it all off there was a vague sewage-like smell throughout. \nIt's comically bad but what pains me the most about this review is that the location is amazing, the white marble bar is beautiful and the ambiance should be that of a restaurant that doesn't treat its customers so terribly. \nThe bar staff is a joke and would rather gossip at one end of the bar instead of asking you for refills - guess that's a problem they never have to worry about since most people want to get out of there as soon as they can.", "author": "Larry L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-02-07", "description": "This place is explosive.\nNot the food, or the atmosphere.\nNo, the electricity outlets.\nMy sister tried to charge her phone and the moment she plugged her charger into an outlet and suddenly sparks flew.\n\"Oh it happens all the time.\" Is basically what a waiter told us.\nAfter extracting the charger, it was entirely burnt out.\n\nElectrical fiasco aside, service was mediocre at best. But for what you pay for, the food wasn't all too great.\n\nUpdate:\nI've been meaning to get back to this.\n\nWhile the electricity incident has jaded me, I think I had left out something.\n\nWhile the food honestly didn't wow me in terms of taste, I concede that both desert orders we had were elegantly plated.\nThe food really was pretty. Maybe I was just a little disappointed that it didn't taste as amazing as it looked.\n\nAlso in fairness, the ambiance was quite relaxing. I can imagine visiting again if I'm in town for a cup of coffee (which isn't on the menu).\n\nI now only suggest that the metal plating covering the outlets be sealed off or replaced. If a similar incident were to occur in the future (\"oh it happens all the time.\") anybody unfortunate enough to have been in contact with the conducting plate could be severely electrified.\nIt seemed like a fairly nice place to be honest, and I'd hate for somebody to attempt a lawsuit. The world is full of sharks, after all.\n\nAfter all said, I'm giving this place 3 stars instead of the originally intended 2.", "author": "A P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-09-24", "description": "Let me start with saying, ever since we moved to New York, we haven't had any bad Italian food, regardless whether it's a nice establishment or a corner restaurant in the neighborhood. So when we moved to Brooklyn, and we walked by this cute place, I automatically wanted to try it. \n\nWe came here on a Saturday around noon. The place was not busy when we stepped in. The host/owner/manager? greeted us promptly, and sat us by the window. I really liked the dark wood interior and how it contrasts with the light floor and ceiling fans. I wanted to love this place. \n\nWe ordered calamari, Bucatini, and Tagliatelle. Calamari came out really quickly, in retrospect, it should've been the warning sign...I had one bite and it was the chewiest and the most stale calamari I've ever had. It tasted like they used some old calamari from last night (or last week), refried it, and put it in front of me. At that point, I wanted the pasta to be really really good so I can like the place. We waited, the waiter came over to clear the plates, refilled our water glasses twice, then we waited more, and more. And close to 50min later AFTER they took away the calamari, finally came the pastes. My Bucatini was too salty to the point that's almost inedible, and believe me, I love sodium. The problem is there's WAY too much salt in the pasta, and it has WAY too little of everything else. Salt was the only flavor on the plate, nothing else. My husband's tagliatelle came out with watered down sauce on the plate, where you can visually see the water below pasta. BIG NO NO. \n\nIn short, I had my first horrible experience with pasta here. I'm starting to think that a 3.5 in Brooklyn is really the equivalent of a 1 or 2 in Manhattan, because, let's be honest, you don't have a lot of choices around here.", "author": "Lu H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-29", "description": "Very good place, near Bklyn bridge. \nand good service! There is a nice Italian waiter who is enthusiastic and kind to Chinese!!", "author": "Qu B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-24", "description": "Great atmosphere. Great food. Great drinks. Can't ask for much more. My favorite spot in Brooklyn Heights.", "author": "Mike C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-01-02", "description": "We've tried this place a couple of times since we live in the neighborhood. This last time was terrible, mostly due to the service. We came in with 5 people and sat at the bar, this was during the day and the place was empty. \n\nWe were all freezing so we wanted warm drinks, preferably alcoholic. The bartender was Italian, didn't speak English very well, and he didn't know what a hot toddy was. I asked him if he had hot water and he said no. Meanwhile someone who appeared to be his boss was sitting next to us at the bar drinking hot tea. Hmmmm... I don't get it. \n\nWe then proceeded to order regular cold drinks and I watched him as he accidentally poured a double shot of simple syrup into my friend's drink. It was obvious that he had made a mistake and we were waiting for him to dump the drink and make a new one. NOPE. He continued to make the drink and of course it turned out WAY too sweet. \n\nHe was just rude and very unaccommodating. We won't be back, specially since we've already tried their dinner and it's just overpriced and meh tasting. If you're looking for Italian food in the neighborhood I would try River Deli Cafe instead.", "author": "Gabriela M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-09-10", "description": "The food was decent... but the service was not. Six of us went out for dinner to celebrate a birthday, and the waiter could not be bothered. My mother is in a wheel chair and they argued with us about tables. They never refilled the drinks or asked if we wanted anything else. The order was incorrect, and still couldn't even spend 2 mins at the table to apologize. Really disappointing.", "author": "Jordan F."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-10-11", "description": "This place has been around for quite a few years and every time I pass by even during prime dining hours, there are always very few diners in what is a very large space for Brooklyn Heights. I've always wondered how they've stayed in business this long with so few customers, and discovered today that it's definitely not the food or service keeping this place afloat. \n\nI had a Bevacco burger, apparently made with Pat LaFrieda, grass fed beef, but it is was paper thin and tasted no better than a fast food burger. I think La Frieda should stop supplying this place -- tarnishing the name. My friends had baked eggs which lacked any seasoning and some ingredients mentioned on the menu, mainly tomatoes... This is an Italian place, right? No tomatoes? My wife had a salad with the dryeat, thinnest chicken I've ever seen. So, food is an F. \n\nService sucked. Anything you typically associate with bad service -- slow, unfriendly, indifferent, possibly spat on your food -- it's all present here. No need for elaboration. \n\nSo what's keeping this place in business? That was the topic of our entire meal, and we're convinced that this place has to be part of some money laundering operation because it certainly doesn't have the food, customers, or service to warrant a restaurant that has been around this long. Just a guess :)\n\nFor families out there: NO changing tables in the restrooms.", "author": "Edward K."}], "servesCuisine": "Italian", "priceRange": "$11-30", "name": "Bevacco", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "60 Henry St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/81ry7bSsEkxWQel3tctGRg/ls.jpg", "@type": "Restaurant", "telephone": "+17186241444"}