{"aggregateRating": {"reviewCount": 229, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-03-02", "description": "Here's a clue, my dear waiter: if you see a plate that's barely been touched going back to the kitchen, ASK WHY. Do not simply drop the check on the table without a word. \nWe live across the street from this handsome, spacious restaurant, and after our disappointing first visit (right after they opened over a year ago) we wanted to give them a chance to get their act together before posting a review. So we've been back a bunch of times, as a couple and with guests. We've sampled most of the menu over this time, and the only items that are consistently good here are salads and pastas. That's it - anything else ranges from just passable to awful. Brunch items are uniformly terrible, they clearly don't like eggs. Saltimbocca was overcooked, tough and a tiny portion for a rather high price. And good pasta does not include lasagna; that was the untouched plate that went back. The lasagna was clearly made a long time ago and reheated in a microwave, coming out so mushy,bland and covered in gloppy cheese that it tasted like a school cafeteria meal. An Italian restaurant that can't make proper lasagna - that's a first. The other pastas are pretty good. There's a small wine list at highish prices, and a nice selection of beer at very high prices ($7-$23).\nAs you might have guessed from the opening of this review, service is not their strong suit. I've never seen it more than half full and they certainly have enough people milling around, yet it always takes ages to get water, order, get your drinks, and get bread. The staff specializes in not looking at the diners as they rush through the vast dining room, and you often have to flag them down. I can't imagine what it would be like if it were full. But there's little danger of that, since they certainly don't make you feel welcome. It's a great disappointment, we were hoping they'd improve and we could become regulars because the place has so much potential. But instead they remain an amateurish, incomplete effort. After a dozen second chances, we're done.", "author": "Zando E."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-11-12", "description": "As a 30 year resident of Brooklyn Heights and patron of it's restaurants, my husband and I  were never impressed with its menu variety but decided to revisit Bavacco last night. The reception we received from the host was obnoxious and condescending. Because we failed to see the \"please wait to be seated\" sign, we were marched over to the sign like disobedient children and reprimanded. Considering the fact that only three tables were occupied, where we sat and how that was accomplished should not have mattered. I guess will never know if they improved the menu", "author": "Carol R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-14", "description": "was there last night for drinks and this place is fantastic. such a great addition to the neighborhood.\n\nwe only went for drinks but must go back for dinner. i had a cocktail called \"smile\", and if you like spice and tequila, this will be your must have drink. it was DELISH. dangerously so. even my bf, who does not like to drink that much, said, \"oh yes, this is good. i could have that.\" i ordered another one with regular tequila and it was just as good. my bf had two lake placid beers, we sat at the corner of the bar and talked, and then headed out into the cold. \n\nthe bartender was fantastic and it wasn't that crowded, which i like, but know that this is not a way for restos/bars to survive. so do yourself a favor and stop by!", "author": "Kenna T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-10-01", "description": "For the first time I saw this place packed.  Not spilling over with a jammed bar full of people waiting but rather a full house on a Saturday evening.  Unfortunately they were I'll equipped to handle the crowd despite the highly publicized DUMBO Arts Festival.\nHostess forgot about us in the bar. Apparently he was joking when he offered to buy us a drink while we waited.  Once seated in took 15 minutes to get water.  We ordered and our drinks came in a timely fashion however we waited almost an hour for our food.  We were not offered bread and had to ask for it as we were drinking wine and were expecting to have our food sooner.  We got 4 tiny slivers for the three of us to share.  Surprisingly the last meal to arrive was a salad.  Go figure?  Not terrible food, just decent.  There aren't many quality places in the area so I think folks think it's better than it is.", "author": "Lauren T."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-01-31", "description": "This restaurant is middling. It's trying to be old-meets-new, but misses the point on so many marks. First, the service has been pushy or overwhelmed the two times I've been here.  Second, it's trying to be too many things at once. They have antique light bulbs and marble tables but it feels like they are forcing this look. Just because you have antique design does not mean they have a good look or a comfortable restaurant. Third, the food is fine. I've had some bites that were good, some that were boring or mis-cooked. I think they need to work on their execution a bit more.  The pizza was mediocre.\n\nI feel like they could do better and I hope they improve as time goes by.", "author": "David G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-12-12", "description": "Skip brunch here unless you're Ok with lunch items. The few egg items on the menu are sub par. The lunch/dinner stuff holds its own - and the weekend bartenders are a blast to shoot the shit with. As someone else said - put this restaurant in the Village and it wouldn't hold up - but in a desert of decent options, it stands out in Brooklyn Heights.", "author": "S B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-12", "description": "Very very good!  I suspect Bevacco will go toe to toe with Noodle Pudding because both restaurants offer Italian fare.  However, Bevacco takes credit cards and it is roomy: two big plusses in my book.  The service was top notch and the menu has something to please almost every palate.  The spinach salad with pear was enormous and the foccacia bread was super crispy and delicious.  My H had the buccatini and has not stopped raving about how delicious it was.  My son had the \"gnocchi\"  and like it but, be forewarned, it did not look anything at all like gnocchi-  it was pyramid shaped.  Bevacco is classier than Oh My Pasta and is much cozier.", "author": "Undercova A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-31", "description": "Kudos to Bevacco! Wonderful food. The blending of flavors and textures was superb! Every dish from appetizers to dessert was well executed and delicious. The wine list and their suggestions were spot on. Thoroughly enjoyable. Staff was attentive and friendly without being overly so. It was clean, beautiful and charming!  We were able to relax and dine without being rushed, in the Old World tradition and the price was very fair for the quality and freshness of the food. We enjoyed 4 courses, all excellent. A short walk from the Brooklyn Bridge train stop. We followed it with a stroll on the bridge.A great NY experience. *****", "author": "Pamela K."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-05-01", "description": "the food is soso and the service so not good though", "author": "Liao L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-24", "description": "Really enjoyed our experience at Bevacco.  We had a party of 4 on July 23, 2 of the members being vegitarian. We tried the eggplant, the Saltimbocca, chicken stuffed w prosciutto and fontina.  The eggplant was good, but the other 2 items were fantastic!  The Saltimbocca was thinly sliced pork and prosciutto with sage and truffled mashed potatoes- really delicious!  We also had 2 salads,  the Bevacco and the Siciliana. The radioccio in the Siciliana was unique, fresh and tasty.  Our party loved Becacco and would highly recommend it.  And it was reasonable- which is a huge plus!", "author": "John T."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-05-24", "description": "I've been coming here every now and then since they opened a couple years ago. Unfortunately, they seem to have really gone downhill lately. There seem to be very few if no customers eating here anymore. Locals in the neighborhood don't recommend this place. Service, food and atmosphere earn one star, max.", "author": "Sue Anne A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-02", "description": "My wife and I came to Bevacco as we are looking for a great venue to plan a privtae party in the Spring. On a busy Friday night we were seated pretty quickly. The decor and spaciousness of the restaurant is a huge plus. Can't remember what our appetizer was called in Italian but I highly recommend the app with Spinach, Fried Egg Yolk and Parm Reggiano fondu sauce....PLATE CLEANED.....\n\nMoving onto dinner....I had the Filetto di Manzo which was cooked to a perfect Medium temperature and the polenta was amazing as well. My wife had the Bronzino and it too was perfectly cooked.....PLATES CLEANED....\n\nFinally we decide dto split a dessert, the stuffed Italian doughnut with creme was served warm and a very good size as well...PLATE CLEANED\n\nThe service was great throughout and the prices are very reasonable considering the quality. Great addition to the neighborhood!", "author": "John S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-12-31", "description": "Gnocchi was different but delicious!! Duck was super tasty and branzino cooked perfectly. You MUST finish your meal with the cream filled donut. Ridiculous!!!!!", "author": "Liza S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-07-28", "description": "Bad,bad, bad!  Literally just eaten here, or had a few bites of the food as was so bad didn't actually eat it!  The carbonara was the driest pasta dish I have ever eaten and cold.  The place at 2pm on a Sunday was empty, and I mean totally empty.  4 of us had  2 starter 3 pasta dishes 1 burger 2 deserts and 7 drinks, bill was $200!! And they had already given themselves a $30 tip, for none existent service and very very poor food.  The cheese anti pasti was sweaty and dry (if that makes sense).  The creme brûlée desert was disgusting whoever made it should never make it again.  It had sunk (how?) and had also split, so was a congealed cold mess, yuk!  I live locally and had heard there was a new chef (I've eaten here a few times and never had a really bad meal) so thought I'd give it another go.  Let's just hope the new chef wasn't doing this shift, because if he was there is no hope of this place staying open!  Unfortunately even if he wasnt I won't be going there again, just left an empty place in both my stomach and wallet!", "author": "Kathy C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-10-20", "description": "I recently had dinner at Bevacco and I was not impressed by the service.  My table was not checked up on throughout the meal, nor were water refills offered.  The dishes are also a bit pricey.  I had the Gnocchi Burro e Salvia.  It was okay, but I prefer the gnocchi with butter and sage at Noodle Pudding.  I also had the calamari, which was pretty pricey ($15) and was nothing special---not much flavoring.  However, I must admit that the complimentary focaccia bread and olive oil were tasty.", "author": "Felicia M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-24", "description": "My husband and I have eaten at Bevacco's at least 5 times now, and we love it. The menu is interesting--and the food has always been delicious.  We also love the staff. And, as a longtime Brooklyn Hts resident, i'm happy to see that the owners didn't scrimp on the renovation, yet came up with something simple.", "author": "anne e."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-20", "description": "We visit our daughter and her family in Brooklyn Heights often. We have spent 12 weeks or so in the Heights over the last five years and eat in restaurants daily on these visits. We had the best meal we have had in Brooklyn at Bevacco. We took our grandchildren-aged 30 months and 9 months-and the staff were very kind and patient with them.\n\nWe are big fans.", "author": "Bob M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-22", "description": "This is a great neighborhood spot.  The food is fantastic, the atmosphere is laid back, and the bartender makes a good cocktail.  The last time I went I had the black tagliatelle, which was delicious.  Definitely worth the trip.", "author": "Kelly M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-10", "description": "Brunch at Bevacco was very good. Among the highlights: expansive brunch menu, the food itself, the atmosphere and the service.  Portion sizes were very good and despite a wide array of offerings everything was fresh and good.  Among the items we tried were the gnocchi, pizza, skirt steak w/eggs, grilled veggies and lasagna.  The staff helped us with selecting and didn't rush us either prior to, or after our meal (although we continued with drinks during both times).  The skirt steak was a standout for me with someone who understands this cut definitely responsible for the marinade and prep.  Loved having such a wide selection of choices.  Combined with the other positives this place is worth a visit.", "author": "Kevin B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-18", "description": "I really like Bevacco. Food is good, wines delish, service is mixed. But I'll go back soon in hopes that they've read comments on yelp and are responding to them. Good luck!  I want you to make it.", "author": "J L."}], "servesCuisine": "Italian", "priceRange": "$11-30", "name": "Bevacco", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "60 Henry St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/81ry7bSsEkxWQel3tctGRg/ls.jpg", "@type": "Restaurant", "telephone": "+17186241444"}