{"aggregateRating": {"reviewCount": 229, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-03", "description": "We have been walking past this place for months. I was never tempted to go inside.  I'm so glad we did. It was such a nice surprise. The waiter let us sample some wines before we decided on a glass. We had the ravioli special with pesto. Amazing.", "author": "Megan P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-14", "description": "We wandered in on Saturday night - first time there. The place was full, but they found a table for us. We started with one of the appetizer specials - an panzinella salad topped with burrata mozzarella. It was incredible - tasted like summer! So fresh! My husband ordered one of the pasta special's - a red based sauce with beef cheeks. I had the stuffed gnocchi. Both were amazing!!! My husbands mother was from Italy and was an amazing cook, so he knows his pasta. He thought his dish was one of the best pasta dishes he had ever had. Most of the pasta is made on-site. Entrees beyond the pasta seemed pricey, but we will continue to go there for a bowl of pasta and a glass - or two - of wine. \n\nOnly negative - a bit noisy. But a negative that is totally outweighed by the fabulous food!", "author": "Lindsay F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-12", "description": "We had dinner there on Saturday evening and it was one of the best dinners we've had in a reasonably priced NYC restaurant. \nOur salads were fresh, and had the real smell and taste of local organic produce. You just don't get this kind of flavor from non-local greens. The dressing was delicious, applied just the way I like it, evenly on the bottom layers, none on the top layer. \nOur main dishes were delicious, pasta not over-cooked, vegetables fresh and herbs and spices nicely done. My companions had pasta with shrimp and mushrooms; I had pasta with eggplant and tomatoes. Service was prompt and friendly.\nThis is a high-ceilinged restaurant, and it doesn't play loud music, so there is the potential for a conversation with your table mates. \nHIghly recommended!", "author": "Elizabeth V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-17", "description": "Bevacco is a relaxed and comfortable yet beautiful and sophisticated dining establishment.  We came late on a Sunday night after a movie on the recommendation of a discerning friend and were completely delighted and plan to bring friends when we soon return.  We ordered two of the specials, broccoli and artichoke ravioli and the grilled fish with asparagus and sauteed spinach.  Both dishes were superb with beautiful fresh ingredients and tender and delicious pasta.  We left room for the house made chocolate semifredo and we almost ordered a second it was so good!  The service was friendly and attentive and the kitchen highly efficient as we were served within 10 minutes of ordering!  Also, must mention the 'bee's knees' cocktail - lovely!  We are looking forward to coming again!", "author": "Nancy B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-01", "description": "After reading prior reviews, we cautiously came here last night, and it was quite a good experience.  Waiter was knowledgable and attentive, food was very good and promptly delivered.  Fare was a bit more American Traditional than Italian, so its not apples to apples with Noodle Pudding, but a good complimentary competitor.  Decor could be warmed up a bit, but overall a good experience.  Whenever i'm in the mood for a $$$ meal, i'd consider coming back.  Overall I give it 3.5 with the half point bump to 4 to negate some of the reviewers with negative nancy only credibilities...", "author": "Clavius L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-10-18", "description": "Gorgeous interior and super friendly staff. The apps were first-rate--especially the mixed meats plate. The pasta with lamb was the best thing we ate, but the saltimboca was dry and uninspired. However, a simple meal will set you back $100, and for that, there's no excuse for the bumbling, inept service. We watched other tables around us get foccacia and tomatoes as the \"table bread,\" but never got ours. We asked to share the pasta as a first course, but it was brought out with the main courses. In the end, they threw out two plates of food because of their mistakes. And 20 minutes after our mains plates were cleared, still no one had asked if we wanted coffee and desert. By the time they finally did, we just asked for the check.", "author": "Heidi A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-25", "description": "Bevacco deserves more business. It's terrific. The ambiance is sophisticated, subtly updated old-school Italian, with a white penny tile floor and dark wood fittings, real candles (not LED candles) gray walls, and shimmering mirrors on the back wall that reflect light. Cocktails are impressive--the mimosa at brunch was made with real orange juice, the Dolce Vita is made with muddled strawberries. At brunch we had an outstanding artichoke frittata, and at dinner--I can't recommend the Buccatini with garlic enough, it is sublime, utterly craveable, and absolutely delicious. I hope the neighborhood will support this place, it is so much better than the mediocre blue pig \u0026 co. that were in the space before.", "author": "Luke C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-10-25", "description": "My girlfriend and I had the most amazing time here last Friday.  It was that perfect atmosphere of romantic and yet not cheesy.  The food was out of this world good and the wait staff and manager were attentive and friendly.  I can't wait to come back for an evening out.  Hands down the best Italian place in all of Brooklyn and possibly all of NYC", "author": "Andrew C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-28", "description": "Had a delicious dinner the night after Christmas at Bevacco with my parents.  We all loved our dishes (special: lobster salad, saltimbocca, potato crusted branizo and tiramasu). Michael took very good care of us and can't wait to go back and try more of their dishes!  Its a very beautiful space and I can see myself hanging at their bar for cocktails.", "author": "Lindsay M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-07", "description": "My husband and I had a very nice dinner here over the weekend. We have lived in the neighborhood for 12 years and it is filled with hard to please old-timers that are constantly looking for a reason to complain or to be comp-ed a meal. Just take a gander at the Brooklyn Heights Blog, and you will see what I am talking about. My guess, a lot of these folks wrote some of the bad reviews. Perhaps it took them a month or so to iron out the details, but given our experience, they seem to be on the right track now.  \n\nIt is refreshing to have a restaurant like this in the neighborhood.  They are doing a decent job with a more modern flare than is available in Brooklyn Heights. We found the service to be quite prompt and congenial. The interior is well designed and lively.   I had a skate soup with black squid ink paste that was really good. The flavors were well balanced. It was so nice to try something that wasn't the same old thing you get in every other Italian restaurant.  My husband had the rabbit, which he loved.  \n\nThe food was very good, esp for the neighborhood. Which has been providing us with crappy restaurants for years. I presume because the old farts that have lived here are used to huge bland portions (ee gads, spice!) served fresh out of the microwave.\n\nThank goodness some younger people are moving here (for the Heights that means under 50). Hopefully that will mean more stylish and tasty restaurants like Bevacco.", "author": "Amy B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-03-10", "description": "Despite bad reviews here and elsewhere, we gave it a try. The restaurant is attractive and nicely designed. Many of the dishes on the menu sounded appealing - it was even hard to choose. However, in the end, it was one of our worst restaurant experiences in recent memory. Bottom line - there are too many really good Italian options in the neighborhood and surrounding neighborhoods to even consider returning to Bevacco again. I even gazed forlornly at some of the bustling Italian places on Montague street on the way home. Here are the highlights:\n\n- the waitress was willing to accommodate several special requests for our two kids, most notably a side of steamed string beans (as they appeared elsewhere on the menu)\n\n- My daughter's pasta didn't show up with the rest of our food - we had to ask 3 times where it was and it finally showed up 15 minutes later (it was quite tasty once it did - the crispy garlic buccatini)\n\n- the side of string beans was revolting; beans not fresh and overcooked and mushy (we sent them back)\n\n- The dirty first course dishes sat unattended for an eternity - until we flagged the one busboy to take them away\n\n- Our entrees took forever to arrive - we were on the verge of leaving when they finally showed up\n\n- The \"gnocchi ravioli\"' which sounded appealing was a gooey mess, the branzino was passable but came with a side of salty, oily spinach and flavorless vegetable \"flan\"\n\n- We complained to the manager and asked for the check; he was apologetic and told us \"the story\" that the chef \"knew the beans were bad, but sent them out anyway\"\n\n- The check arrived with the returned beans, a Sprite we didn't order, and no items comped on it - I showed it to the manager to correct and he did ultimately remove some items\n\nOverall, a real disappointment, and not worth the $75 we still had to spend. One star for nice decor and decent pasta .\n\nAlso - the staff spent the entire night arguing in the back. They clearly have some operational / interpersonal issues to work out.", "author": "ted t."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-05", "description": "I've stopped in here a couple times for drinks and snack at the bar, so this is only review of the bar, but given the neighborhood I'm a big fan of this place.  It's probably a 3 start joint in another neighborhood with more choice when it comes to going out, but in Brooklyn Heights it gets 4 stars.  The staff (at least at the bar) is great; helpful, knowledgeable, and good conversation when you want it.  Love the comfortable design of the place as well.", "author": "Catie B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-27", "description": "Wonderful food and beautiful place.  Salads are great (radicchio, pistachio, fennel and orange esp. good), fish, pasta, and other specials always good and often interesting, great wine list--this place is elegant but retains a comfortable neighborhood feel.  Best restaurant in the neighborhood and great bar as well.", "author": "Jane P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-04-27", "description": "About a week after  Bevacco opened a friend and I ate here \n\nMy friend prefer a duck that arrived like pie es of leather We called th waiter over and asked him to have the chef taste the meat. nothing was done  when the bill arrived we were charged for the uneatable duck\nwe never have gone back", "author": "Anton N."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-02-21", "description": "Bevacco is a perfectly serviceable Italian restaurant in BK Heights.  I'm a big fan of Bar Tano in the Slope, so knowing that the same owners are behind Bevacco gave me the push to try it.  The cocktails are excellent, the service is okay--nothing amazing, but not bad--the food is hit or miss.  Some dishes are delicious and perfect, some are just all right.  The first time I went they had some delicious bread and tomato sauce at the table that I could have eaten all night.  So this is a good, solid choice if you're in the neighborhood and want some decent eats.", "author": "M M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-14", "description": "We went to Bevacco for dinner the other night with 6 other couples. Granted, like other reviewers have commented, the service was slow. However, our drinks at the bar were excellent and our waiter couldn't have been more congenial and attentive. I highly recommend their pepper infused tequila cocktail. Everyone was very happy with the food. Wine was great, albeit a bit pricey. We enjoyed the scallops appetizer and beet salad in particular. the Tiramisu was delicious. atmosphere was great. we'll definitely go back again.", "author": "Becky G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-10-29", "description": "The place looks great.  They did a wonderful job renovating the space.  The food was good but portions small.  Salad and main course came out one right after the other - maybe a bit fast.  Dessert was delicious but it took forever for the coffee to join the dessert.  I would try it again but would probably go to Henry's End or Noodle Pudding first.", "author": "Ronni R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-07", "description": "My gf and I went there on a whim and were very pleased with the place.  The atmosphere was very pleasant, the service was good and our choices proved to be delicious. I really splurged and had the Rughetta ($14) and the Galletto Al Mattone ($22), whereas my gf had fish (Branzino $22).  The wine recommended by the waiter was very nice as well. Will definitely return.", "author": "Michael S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-06-13", "description": "Just had such a horrible experience at Bevacco. Maybe it was because we didn't go here for brunch or cocktails which other people seem to have enjoyed but I can tell you I will never step foot in this restaurant again!\n\nNot only were we told that they were \"out of pizza\" (hello you are an ITALIAN RESTAURANT!), only to watch people who were seated after us order pizza and have it arrive before our food BUT the food we were served was absolutely horrible. The calamari was beyond salted, the egg on our salad was pungent and in general everything was a serious disappointment. Our waiter was full of himself and ignored our first drink order, instead coming back to suggest something more expensive.\n\nI have lived in this neighborhood for a long time and the places in this location rarely survive for long. I have seen much better places suffer a terrible fate at this location and I can only hope this place will suffer the same fate. I have NEVER returned food or complained to the management of an establishment but I certainly should have this time. \n\nSpare yourself and try the wine bar across the street, they have a much better selection or wine and food and you will not be disappointed or walk away with a hole in your wallet for a below par experience!", "author": "S F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-10", "description": "Good cocktails and good pappardelle with lamb ragu. Also the bar is big enough to eat dinner and have a laptop out at the same time.", "author": "Noah S."}], "servesCuisine": "Italian", "priceRange": "$11-30", "name": "Bevacco", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "60 Henry St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/81ry7bSsEkxWQel3tctGRg/ls.jpg", "@type": "Restaurant", "telephone": "+17186241444"}