{"aggregateRating": {"reviewCount": 229, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-10-28", "description": "Gave this place a try after our original plans fell through. Service was VERY bad. One waiter that speaks little to no English. He was the only one serving the whole restaurant and going to assume there is only one person in the kitchen because it took forever to get food, when received it was not close to what I asked for (once again, huge language barrier) food was very basic nothing to rave about. Would not recommend!", "author": "Jerrica J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-11", "description": "I came here on an extended lunch break during my dreaded jury duty. There isn't a lunch menu... The prices are the same as dinner.\n\nI was alone, so I sat at the bar. The one waitress/bartender was very friendly. I had a glass if rosè (lunch wine, don't judge) for 13 bucks and a pasta plate for 14. With some helpful explanation from the bartender, I ordered the pasta made with squid ink with a white sauce with shrimp and artichoke. The portion was perfect and the dish was delicious.\n\nI imagine it would get pricy for dinner depending on what you get, but for a small splurge I as able to get a nice lunch.", "author": "Jennifer S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-16", "description": "Had dinner there on Sunday!! \nIt was delicious. The atmosphere is old world \u0026 beautiful. The waitstaff friendly \u0026 professional. The food is very creative Italian \u0026 the pasta I had was excellent. I am looking forward to going back \u0026 trying other dishes. Reading menu, it was hard to pick a dish. We all enjoyed our dinner.", "author": "Geraldine G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-07-08", "description": "I'm updating my review - I'm not sure what the owner is thinking, but there's an incredibly high turnover at Bevacco and they changed the chef.  I don't see any of the original staff, and everyone seems to be lost because they're new.\n\nWhat I'm most disappointed with is the stupidity.  We have been to this restaurant at least a dozen times, and have ordered the same salad - the Siciliana: raddichio, fennel, pistachio, olives and oranges.  It's seriously amazing - honestly one of the best things on the menu.  We were so excited about it, we sat down and ordered right away, not even looking at the menu.  Now, I get that you changed chefs and you're changing menus, but if that's the case, CHANGE THE NAME OF THE DISH!\n\nThe new Siciliana salad is lame - soggy mesculin greens with a few thin pieces of fennel, no joke TWO olives and a few pistachios and it wasn't even dressed well - my husband's salad was dry and mine was a creamy soggy mess.\n\nWe never turn food away, but this was an exception.  We explained ourselves, said we didn't want the salads or anything to replace them, and left.  End of story.  The bartender and manager seemed really apologetic and nice about it, but there's no excuse for lame salads like that, I'm sorry.  I can only imagine what the other food is like.\n\nI don't think we'll venture back anytime soon - maybe for a night cap on the way home, but certainly not for the food.", "author": "Rachelle R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-18", "description": "Would love to say this place is perfect given that the service was impeccable and the ambiance is nice, clean, spare, quiet and comfy. But while my wife's salad was delicious (particularly with the extra chicken added on the side) my zucchini pasta with pesto was beyond lousy--it was tasteless. If that really was pesto on there well, maybe the basil just wasn't up to par but this was the most bland, tasteless dish I've ever experienced. Even lots of salt didn't improve things. I wish it had been better but it wasn't. But like I said, the service was great and maybe I just ordered wrong (though the waiter highly recommended the dish.) Be wary.", "author": "daniel w."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-21", "description": "It was one those evenings that we wanted to try nice Italian food with friends over drinks. Unhappy to write that we were satisfied with the flavors and the ambiance of this cute place!\nI would definitely go back with friends or alone as it is a live bar restaurant where everybody seems to enjoy themselves. \nKeep it up guys!!!", "author": "Yorgos A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-09", "description": "Beautiful interior, great channeling of Northern Italian art deco style. I've only been at the bar here. Excellent food as well and a nice, relaxed atmosphere with a great bartender too.", "author": "Alexander G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-22", "description": "Four stars for the neighborhood. Great drinks and friendly staff. Food was always good - not great, but it's improved and is a tasty option for Brooklyn Heights.", "author": "Navin C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-06-04", "description": "If I could give no stars, I would. First time here and I had the worst time last night. Came in around 10:15 and got seated, handful of open tables were available and the crowd at the bar started to diminish. A waitress with brown hair and bangs took our order. Appetizer came out first instead of the drinks. Not once were we checked on in the extra 30+ minute wait for the entree. Waitress was absolutely clueless and could not keep up with the demand of service in this place, she was terrible.  The couple next to us had two dishes while we were still waiting for our entrees. Finally we were checked up on us as we were ready to leave, only to be told it'd be an extra couple of minutes. No. If the food takes a certain preparation time, let us know. OR if there is a delay in the kitchen, LET US KNOW. We left money on the table to cover drinks and the app. Didn't want to wait any longer for the food. Never, ever am I returning here. Waste of time.", "author": "Mika W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-05", "description": "This place falls between 3 and a half and 4 but because they were quick in service I ran with 4. The inner decor and mood is quiet and soothing. The bartender plus waiter were amazing conversationalist, if you're looking to spend a quiet night with the one you love give this place a shot. Got the Americano Burger and well it was alright, different yes but good mind you this was my first Italian restaurant. I'll likely stop by here again one day.", "author": "M S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-07-12", "description": "I walked past here quite a few times and ultimately came here for after-work drinks. The cocktail, cranberry something (with vodka) was cloyingly sweet. I ended up enjoying tito's and soda instead. It's got a great standing area for cocktails (for a group) and the food smelled really really good.", "author": "Shu Jin S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-06-03", "description": "My fiancé and I have been coming here for brunch more often these days and while he loves the chicken sandwich and I enjoy the italian benedict (with prosciutto, burrata, and roasted tomatoes), the service is always super flow and order gets messed up at least every other time we come.  It's a bummer we've decided to dine here less because the food really is good!  Oh well, I'll plan to try their bar next door, which is new to the neighborhood, Binc.", "author": "Michelle R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-07-04", "description": "if I could give 0 stars, I would. I came in with a group of friends, some of whom were black and some who weren't. The manager didn't realize that our group was together and blocked the black people in our group from entering, telling us we couldn't even buy a drink at the bar or go to the bathroom, even though the bar wasn't full. she then directed us to go to the space next door and get served/use the restroom there, but we we were in waiting, she came and blocked our path. she was completely unprofessional and rude.", "author": "Evelyn K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-29", "description": "Place was great enjoyed the food waiter came and checked on the table to often. Good thing and bad thing sometimes. Drinks and deserts were the best. The strongest drink we ever had.", "author": "Gledis M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-28", "description": "My girlfriend and I went to Bevacco this past Friday for an early dinner. We were surprised how empty the restaurant was- the interior is well decorated \u0026 lit but we were a little nervous due to the lack of patrons. \nWe ordered our food with the waiter (tomato gazpacho special, Bronzino entree, and Pasta a la Norma. Each dish we ordered was DELICIOUS! They also served some focaccia bread while we waited for our soup which was also great- the olive oil is very good.\n\nMy gf and I just moved to Brooklyn Heights, but we will certainly be back at Bevacco. \n\nThanks so much to the friendly staff.\n\nTom Chaves", "author": "Thomas C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-08-29", "description": "Stay away.  There are much better Italian restaurants in Brooklyn Heights than this one!\n\nFirst, on an August night, this place was hot and humid.  No air conditioning, and no open windows made an uncomfortable dining atmosphere.  There are ceiling fans but they are moving at such a slow speed that no air was detectably displaced. \n\nOur waiter was incredibly rude and neglectful, leaving us to wait 20 minutes after appetizers were cleared from the table to even order entres.  The same happened after entres were cleared, before we were given the time of day to order coffee and dessert.  We even had to wait quite a while to get the check!\n\nThe food itself is just OK at best, and sometimes down right gross.  I ordered the duck and pasta special which was so disappointing.  It looked like someone plopped some canned cat food on top of dry noodles, and it didn't taste much better.  Even my husband, who is not a picky eater, hated it.  The ravioli dinner was mediocre, but was also skimpy on its serving size.  The ravioli themselves were small, and there were only 7 or 8 of them on the plate.  The portion was better suited as an appetizer.  The dessert left a lot to be desired too.  Their lemon apple torte was cloyingly sweet, and way too gloppy thick from cornstarch.  Their tiramisu was BLAND and didn't seem to have any liquor flavoring the cake layers.  \n\nThis place doesn't do anything to warrant their hefty prices.  I would never eat here again, unless I heard they got a new chef, or new management.", "author": "Ash M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-10-16", "description": "I just want to start by saying I don't really write reviews online, but I was so bummed out by one of the servers here, 2 days later here I am writing one.\n\nI came here for a friend's wedding. They had rented out the entire restaurant, and I was sitting at a table that had 2 extra guests join, as what happens sometimes at weddings. We were all in a good mood, celebrating, and then the waiter came. \n\nHe took everyone's order at the table, and when he got to the end of the table to take me and my date's order, he just walked away. He came back a minute later to refill another person's glass of wine, and then looked at me and my date and said \"this table was only set for 9.. I guess you two wanna eat\".. \n\nIt was so rude, the whole table was a bit shocked, and his attitude didn't change much after that. I tried to make a joke out of it. I held up my name card and said, \"well, this is me, so who here should we kick out?\" He just remained in a bad mood. \n\nWe all ended up having a good time, but it wasn't thanks to this guy. Our busser wound up taking better care of us than our server.. \n\nMaybe he was just having a bad night, but it ruined a big part of this place for more than a few of us..", "author": "Boo R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-11-18", "description": "I brought my child here for a quiet weeknight dinner because she loves ravioli. We shared an inoffensive if generic calimari appetizer and each ordered a pasta; tagliatelle for me and ravioli for her. Both portions were grossly undersized, especially for the price. The order of cheese ravioli featured a whopping three pieces of ravioli, most of which was just extra wrapper rather than filling. Neither dish was remarkable and both left us hungry. The appetizer, two undersized pastas, and a couple of soft drinks came out to around $75 after tax and tip. I can understand the pastas being a bit smaller if they expect you to order an entree as well but at those prices, it was absurd that we couldn't get enough food to satiate an 8-year old's appetite.", "author": "Jim C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-05-24", "description": "Not a wow. The pasta we ordered (squid ink) was awful and not what the server described. The pizza was mediocre but there are tons of fantastic pizza places in this neighborhood so there's no reason to go for that. The best thing was the French fries. Odd for an Italian restaurant...", "author": "Austin H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-04-28", "description": "Hoo boy, does the service here suck.\n\nFive of us walked in on a Sunday afternoon during which the place was mayyyybe 1/8 full. Meaning, practically empty. We stood for a couple of minutes at the door before someone behind the bar asked us how many of us there were. Then she proceeded to make a couple of drinks and walk around the whole restaurant with them, glancing at us every few minutes. WTF? So you were just trying to make weird small talk with us, lady? Finally, a kind busboy saw us and led us to a table. Really, we should have followed our gut, though, and just left.\n\nWe were seated next to an open door with a serious draft blowing through. Keep in mind that it was unseasonably chilly that day. When we asked our waitress if it could be closed, she told us that \"someone said it was warm in here\" and just stared at us. Really? Which one of the four people in here complained about it being warm in a place with ceiling fans blowing at full speed?\n\nAlso, my boyfriend ordered a cup of tea and had asked if they were pots of tea. I don't know about you, but it always irks me when restaurants only serve pots of tea and then charge three or four times what a cup of tea would cost. Like, how much does the extra hot water really cost, guys? Anyway, the waitress said no, they were cups of tea. Sure enough, he was brought a pot of tea, and called her on it, and she just sort of scowled and shrugged and went \"oh\" and left. I know the tea itself is not a huge deal, but the attitude IS.  \n\nMy gnocchi was delicious, but forgettable. I wish the service were forgettable too.", "author": "Sybil K."}], "servesCuisine": "Italian", "priceRange": "$11-30", "name": "Bevacco", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "60 Henry St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/81ry7bSsEkxWQel3tctGRg/ls.jpg", "@type": "Restaurant", "telephone": "+17186241444"}