{"aggregateRating": {"reviewCount": 229, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-31", "description": "New Date: June 27th, 2019-\n\nWell here we go again, back at our favorite place celebrating my best friends brand new chapter in life - 30 years old. When we decided to go back we said we would get the same dishes we ordered last time - Salmon and Clam linguini because they were absolutely delicious. \n\nThen I saw the Chicken Piccata and couldn't help myself, had to try something new ::insert mind blown GIF:: Little did I know the chicken picacata would turn into my new favorite dish here. The chicken was beautifully laid on a bed of greens, potatoes and a mouth watering lemon / caper sauce. That sauce was so good, not one drip of it was left behind. Only reason I didn't pick the plate up, put it to my face to lick the rest of the sauce is because I actually have some table manners. Lol \n\nThe clam linguini was just as good this time as it was the last. This place never lets me down. The service is good and chill. Great location just minutes away from the Dumbo water front.", "author": "Yani O."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-04-14", "description": "This place was a bit of a disappointment. It's very fancy and upscale-looking but the meal left something to be desired for sure. \n\nThe raspberry spark drink was not \"topped with Prosecco\", as the waiter suggested, but rather dunked in Prosecco - I like bubbly a lot but this was bordering on excess. The Bevacco breakfast I ordered came out a little cold (especially the potatoes), the bacon was nearly unchewable, and the salad was BUTT NAKED aka no dressing at all. I was pretty disappointed.\n\nBut we may have spotted Andrew Rannells here so I guess that was cool.", "author": "Kristen L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-12-18", "description": "Quick update: \nHad yet another enjoyable meal here. Ordered the duck breast and it was so tasty. Fettuccine w ragu was also tasty (fettuccine was very soft, almost like Chinese noodles. I didn't mind it- just not used to it in Italian fare). \n\nDessert was super underwhelming, but I forgive you. Got the molten lava cake. It came w a scoop of ice cream. It was ice cold. The cake too. No gooey molten chocolate lava in the center. Just more cold chocolate cake. Oh well. Gotta get this fix elsewhere. \n\nOne last thing: We came by for a really early meal and the restaurant had just a few tables filled. They were mostly families w young children, and a table w a patron using a wheelchair. I'm only mentioning this bc they're very helpful and accommodating w seating arrangements. I know all restaurants \"should\" but some places seem to be great at making ppl feel like a nuisance. They're not like that here so 3 thumbs up!", "author": "Kay W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-24", "description": "Literally walked past this place on our way to Dumbo. Got in early, had a long and wonderful time. Excellent cocktails, amazing parmesan \" creme brulee\" starter, followed by an excellent Bolognese and steak. Complimentary limoncello finished off the evening. Looking forward to a return trip.", "author": "Jim R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-05-14", "description": "Nice brunch place in Brooklyn Heights, surprisingly easy to find a table last time we checked it out. Good range of options on the menu, and the usual assortment of wine, prosecco and cocktail. Worth going back too, kids friendly. || Update: also worth going for an aperitivo before dinner. make sure you try their marinated olives, perhaps accompanied by a strong Negroni cocktail.", "author": "Massimo P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-19", "description": "This is a great neighborhood restaurant.  We love the ambiance, low key vibe and the food is delicious.  We also had a great experience today hosting a party for our family in celebration of our son's baptism brunch.   It couldn't have gone any better.  The staff were incredibly flexible (especially in dealing with a few wild children), personalized requests were always accommodated and the food was even better than expected.  We had a bit of miscommunication with Amy in booking the date but she more than made up for it and hosted a wonderful event.  She was very supportive and professional in preparing for the party that turned out perfectly.  Thank you for helping us create such beautiful memories.", "author": "Jessica J."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-05-05", "description": "it started off really good until halfway eating I found a live slug/slimy insect in my food. I've never been so disgusted and grossed out in my entire life. Clearly they don't wash their lettuce/salads very good at all. Definitely never going back. I'll attach a a photo as proof.", "author": "Casie M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-09-06", "description": "Very cute restaurant with a charming interior design. Stumbled in on a whim after walking around the neighborhood for quite some time. We got a nice corner table and ordered the meatball appetizer and a pizza. The meatball over polenta was delicious and if you do eat here I would highly recommend it. The pizza was lacking in flavor and I wouldn't get a pizza from here again. Service was not great even though the restaurant was empty.", "author": "Eric G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-14", "description": "I came here with my girlfriend last night, and we found very friendly staff, perfect atmosphere and the best food in New York! \nThe executive chef Steven Flyn know how to prepare a really Italian food! \nFor start we took an crema brûlé, which I give 6 star form 5, then a special gnocchi al ragù of lamb (never ate so good home made gnocchi even in Italy)and a spaghetti with clams! \nIf you gonna pass by you just MUST stop in bevacco for a great dinner or lunch q, and you'll be surprised about how magic is this place!", "author": "Vasiliy L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-03-03", "description": "Ok...... We first came to Bevacco the night it opened. We tried it many times over the years....It was so bad that I had to write a review about 3 years ago. (It was awful.) We waited 3 more years and decided to try it again. We live about a half block away....,,First of all, the service ranges from non-existent to poor. Nothing has changed. The last time we were in, the food was awful. Today, it was somewhat better. We spent about $80 for two glasses of wine, a small portion of mediocre pasta and a mediocre burger (better to go to the nearby diner for a burger). How does this place stay open?", "author": "Ronald B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-04-10", "description": "Service is non existent! After the waiter got my boyfriend and I water they disappeared and never returned or check up on us. We waited for 50 mins and the food never came because the chef \"changed shifts\". Terrible! Don't come here when you can find a cheaper place where your food will actually come out. Don't waste your time or money here.", "author": "Omgzsarah01 .."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-19", "description": "Bevacco was a great place to spend New Year's eve. Although they had New Year's eve specials, there was no requirement to order off of the special menu. The restaurant was festively decorated and had a relaxed, casual, yet romantic atmosphere. Seating was very comfortable as we had a nice corner table that didn't make us feel stacked upon others. My partner and I had drinks and shared the homemade pork sausage and mushroom pizza. The pizza was pretty good, a bit wet but overall tasty. Staff was also very friendly and attentive. I really enjoyed spending New Year's eve at Bevacco. It was a great low-key evening and a perfect spot to visit if you want to avoid the exorbitant pre-fix menu.", "author": "Rebecca L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-08-28", "description": "How does an Italian restaurant make bland pizza? I came here on a Sunday night with a huge party and Bevacco did a horrible job of accommodating us. Management was also very unsatisfactory, the food was so bland and the waiter not even 2 star service. \n\nAfter a beautiful night of family and friends gathering near the Brooklyn bridge for my surprise proposal (still in shock) we had dinner reservations here. We entered the very dark, unwelcoming and empty restaurant at around 6:30pm and were immediately greeted by a less than friendly staff. I really would not recommend this place for a big party or the food (just don't come here). \n\nFor one, what is a restaurant without tartar sauce? BEVACCO \nWhat is a restaurant with pizza that has very bland taste? BEVACCO \nWhat is a restaurant that has unfriendly service? BEVACCO \nWhat is a restaurant that has unfriendly management? BEVACCO? \n\nNo one likes to dine with large parties and I understand that. Before ordering, we asked the waitress if we would be able to break the bill up into 2. One for the soon to be bride's family(ME) and one for the soon to be groom's family(my now fiancé) we were told that this would be possible until after eating when the bill came and the manger acted as if it were a problem. \n\nAlthough I had the most perfect proposal surrounded by family and friends, I really did not enjoy this place at all. Nonetheless, I was still grateful that everyone came out and surprised me the way they did. But this place has a lot of things to work on. FYI i've had better tasting pizza for $1 compared to the horrible $19 pizza and disgusting fried calamari here. \n\nMy word for anyone looking to come to this place would be to skip it.", "author": "Amber B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-03-24", "description": "service was horrible. we had to wait over 30 minutes for our food, and they got our order wrong the first time. food was subpar and the waiter was rude and basically avoided our table. we had to yell across the restaurant to get his attention.", "author": "Hanna H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-20", "description": "Very chic spot.  Great location and service was great.  4 stars due to food being quite salty", "author": "Nan C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-10", "description": "We just finished a phenomenal dinner here. We started with the wild mushroom and also the beet salad and then split two entrees: the lasagna and the spaghetti squash, both on the pasta menu. The spaghetti squash was excellent but the lasagna was unbelievable. Delicious meat sauce and many thin layers of pasta. We would definitely come here again for a special occasion!", "author": "Laura M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-20", "description": "Very nice place and clean. Food came out very fast and my server was very nice. I will definitely come back again and refer this place to anyone I know.", "author": "Oli D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-28", "description": "There's a review posted below where someone is complaining about 20% gratuity being added to their bill. Obviously this Individual didn't read the menu and/or didn't speak with the staff here. On the menu it very clearly states that %20 gratuity is automatically added with parties of 6 or more. \n\nThe food as well as the service was excellent. I was checked on regularly and my glass was never empty. I feel as though the food is rather expensive but you definitely are getting what you pay for. Will be coming back again.", "author": "Harley H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-03", "description": "Bevacco serves tasty Italian in Brooklyn Heights. Perfect for brunch with the parents, a dinner date after the park, or cocktails with your girlfriends, Bevacco has a versatile menu and space. The classy metal work, mosaic tile floors, marble tabletops, leather booths, and a U shaped bar with tall stools evoke a New York Gilded Age ambiance. At night there's candles and mood lighting, in the morning plenty of sunlight through the lovely windows. It can get a little loud here when the restaurant is at full capacity, otherwise its a lovely intimate space. \n\nService is good here, not super friendly but definitely efficient and on top of things. Staff are excellent about managing table turn over and on a Sunday evening, it did not take long for them to refresh a table and have us seated. Our waiter took our order quickly and food comes promptly. \n\nI've been here for brunch and for dinner. I've ordered:\nRaddichio, orange, pistachio salad\nKale, pine nut, ricotta salad\nMargarita pizza\nProsciutto pizza\nBaked eggplant \nLamb ravioli\nTruffle fries\nPear almond tart\n\nI pretty much love everything on the menu. I'm especially thrilled here with the salads - and I hate salads so that says a LOT. The flavor pairings are very intentional to give you a mix of flavors and textures and every single ingredient is fresh and well dressed. The pizza is good (but its Brooklyn, so its on par with the other fine pizza establishments in the area and the caliber you'd hope for), the pasta portions are just right and definitely quality over quantity. The pear almond tart is excellent and the fries perfect for snacking. I absolutely love how many vegetables are available on the menu and the star treatment Bevacco gives them. \n\nThe cocktail and wine menu appear extensive. I would definitely see Bevacco being a hit with the after work gossip girls. \n\nPrices are on the higher end for an average Saturday night dinner, but considering the area and the ambiance I would argue they're fair. With a more sustainable menu and the classier ambiance, you're going to pay more here than at Noodle Pudding, and rightly so.", "author": "Suanne L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-06", "description": "Went here after walking all OVER Brooklyn with my parents and boyfriend... we walked 8.7 miles and had the best day, and Bevacco was a great way to conclude it!! We started with the burratta with pesto and some tomato thing that was incredible and the roasted carrots with almonds and creme fraiche on top--both delicious. My mom and I got the salmon, which was FANTASTIC!!!!!! My boyfriend got the roasted duck breast and loved it, and my dad got the quinoa dish that he was very pleased with. \n\nA quaint spot with cool, Brooklyn-y vibes!", "author": "Paige H."}], "servesCuisine": "Italian", "priceRange": "$11-30", "name": "Bevacco", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "60 Henry St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/81ry7bSsEkxWQel3tctGRg/ls.jpg", "@type": "Restaurant", "telephone": "+17186241444"}