{"aggregateRating": {"reviewCount": 229, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-09-07", "description": "Damn that espresso I had there really gave me a jolt of energy.  I came here after eating lunch in the area specifically for some mid-day coffee.  When I stepped inside, this place had a 1950s type feel to it.  There were a few antiques placed around the restaurant, and I thought this was a place my grandfather would have come when he was younger.\n\nI loved Bevacco's 1950s vibe it had going on.  Even though the place was empty when I arrived, I still enjoyed myself here.  They offer what seems like a delicious menu, but be prepared to shell out some dough for a more upscale-type meal.\n\nWant a quick espresso with another? It will only cost ya $5.", "author": "Brian S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-20", "description": "The Siciliana Salad, my favorite!! All the dish are fresh and very tasty! \n\nBut don't go a way without try the amazing Bomboloni!!!", "author": "Nico Z."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-27", "description": "Lost in brooklyn heights? \nGo here! Sexy, open late,\nAnd that pear tart? YUM", "author": "ReviewHaiku F."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-11-04", "description": "I can't believe I'm actually reading good reviews of this place.  Living in the neighborhood and hearing about the owner's other restaurants in Brooklyn, I had been anxiously waiting the opening of this restaurant.  My boyfriend and I walked by a few nights the week it first opened and it looked very crowded, which I took as a good sign so we decided to have dinner there the first Saturday night it was open.  Bad idea.\n\nWe walked in at about 7pm and were told there would a small wait and to have a drink at the bar.  The bartender came over to give us menus and that was the last time he paid us any attention.  There were about 5 other people at the bar and two bartenders so I didn't see what the problem was.  I did notice that the bartenders were responsible for bringing the drinks to the tables (what??) which would've slowed service down but he rang up checks and washed glasses, never taking our drink order.  When the owner (I think) came to tell us our table was ready, he told us to settle up at the bar.  We explained we'd never been served so he called the bartender over who looked shocked and annoyed.\n\nWe were seated and at least 5 minutes went by and not one of the many waitstaff came over to see if we wanted water, etc.  So I flagged down one and asked for water (by this time we were dying of thirst).  She proceeded to walk by us another 2-3 times, never bringing us water.  So we decided to leave.  The owner was apologetic and explained it was the first week and that he had no idea it would be so busy.  This I didn't buy AT ALL because anyone who lives in the 'hood knows that on a Saturday night at Noodle Pudding the wait can be an hour.  He offered to buy us a drink at the bar which we accepted and I said I would try again when they had ironed out the kinks.  That should've been it.\n\nThen came the hard sell, both from him and the bartender.  They said \"why not just eat at the bar.  Where else are you going to go on a Saturday night?\"  With that  we left, walked over to Henry's End where we were seated immediately, had a fabulous meal and a bottle of wine for $120.  I doubt I'll be back - maybe to meet a friend for a drink but doubtful for a meal.", "author": "Jennifer C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-10-12", "description": "Fresh made pasta and sauces, accompanied by great choices of meat. It all felt very authentic Italian and good. I had the Rigatoni with a creamy tomato sauce and my husband had the Pesto Gnocchi. The sauce was light and well balanced by the prosciutto and the peas.  Both were delicious and good size portions so that we could order a starter and dessert to share. Glad to find a place with non American portions. The dessert disappointed me, I am very particular about Tiramisu and this one was just not quite it, too creamy. Also not impressed by the overpriced mediocre wine. \nService was good and fast, very friendly staff", "author": "Carolina M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-08", "description": "Great restaurant. It was crowded but still the service was good and we had an amazing prosciutto pizza!", "author": "Sebastian G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-05-29", "description": "My family, my girlfriend, and I had just come off of the Brooklyn Bridge in search of a good place to eat and we decided to stop by this place for some Italian Food. Immediately upon walking in, the atmosphere had an aesthetic appeal but one of the waiters immediately killed the mood upon slamming the door on my girlfriends back without a single apology exclaiming that they needed the door closed right away. After this, we were already hesitant about staying but we persisted. Upon sitting down we had outside drinks upon the table and instead of kindly asking us to put the drinks away, the waiter snapped at us and said that they needed it removed of the table immediately; at this point we were kind of frustrated with the service. I ordered the Lamb Ravioli which was good but felt and tasted very simple at the same time. Also, it should be noted that the fountain drinks were extremely syrupy and sweet, and upon asking for a refill, the waiter charged us for a second soda. My mother ordered a pizza with my sister which was regrettably bland and was basically crust with marinara sauce. Finally, my girlfriend ordered the Risotto which was most likely the only decently good thing that we ordered. Overall the atmosphere was nice, but while the food was decent at best, the service was definitely in need of an upgrade. The next time we visit Brooklyn we most likely won't be visiting here again.", "author": "Dante S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-07", "description": "I've been here twice since it opened in November. Both times the service, atmosphere and service were all excellent. \n\nLast night we were served by an excellent waiter named Claudio. He was informative and charming. Our first course was an arugula salad with mozzarella with cream inside... deliciously rich and unique. We were told it's a traditional dish of Naples. For our main courses, we shared the Fettuccine alla Bolognese and the Branzino. Both were excellent. Our food was accompanied by a bottle of Vermentino di Sardegna \"La Cala\". This light white wine was an excellent value at just $23.\n\nBevacco is a nice addition to the Heights. It's a classy place for a date or business dinner. \n\nThe only drawback was that it was a little chilly inside.", "author": "Korye L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-04", "description": "Enjoyed a wonderful dinner last night. Started at the bar with some yummy drinks served by a vivacious young lady named Shana. When seated for dinner Marco took the time to explain the specials and any questions on the menu. The caprese and scallop appetizers were fantastic and the saltimbocca for dinner was delicious! Highly recommend it. Topped off with an array of desserts and a nice dessert wine.  Nice safe area and just off of the Brooklyn Bridge.", "author": "Donna P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-14", "description": "Bevacco is a bit of a sleeper, lucky for me if not for them.  There's not a huge hipster scene here, not mostly anyway--they're all at the much over-rated Jack the Horse.  Their mixology quotient is high and they take car in making cocktails and making them strong enough.  Soup is almost always delicious.  The other evening I had a salmon dish that was perfectly prepared, absolutely yummy.  The service, as far as I'm concerned, is friendly, knowledgeable, and responsive.  I live very close to it and have been in Bklyn Hts for many years.  The new restaurant phenomenon in the North Heights on Henry St, in this most provincial of neighborhoods, is a welcome one, an Bevacco , though newer than some and not an instant hit, is one of the best!", "author": "perry w."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-06-08", "description": "Service was horrible. The manager was so rude. Would not come here again for their mediocre food (which I felt was undercooked). Portions are small and overpriced. Bathrooms were somewhat dirty for a \"classy\" establishment.", "author": "Gideon G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-02-29", "description": "I'm  not sure how these people are giving BEVACCO such amazing reviews. YUCK.\nThe place is gorgeous, but the food is boring. \n\nThey have a bunch of items on the menu that have the most ridiculous ingredients that you think they'll have to be delicious, but they're terrible. Risotto with scallops and licorice was the special last night and the server described it as \"peculiar\". LOL I'll say.\n\nI just think this place is trying too hard. Their cocktails are listed in Italian with such abstract ingredients you can't possibly imagine what they'd taste like.\n\nThis place is no competition for NP at all.", "author": "Sarah S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-03-29", "description": "Brunch on Saturday.  Service super slow.  Coffee was served then had to wait five minutes to get milk md sugar brought to table.  Coffee tasted like water.  Poached eggs were overdone NOT poached.  Pancakes dry.  Overall just a bad dining experience.  I would not be able to rcommend the place.  They really need to get their act together.", "author": "Christina M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-20", "description": "Went for dinner here unplanned but the roasted chicken dish was AMAZING!! the farro was pure bliss! I would go back to Brooklyn just to eat the roasted chicken dish again and again!", "author": "Jackie R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-30", "description": "I just ate here with a friend last night, and I'm surprised that it wasn't more busy than it was! The food was delicious, and the service was great. I had the orecchiette and broccoli rabe pesto and we shared the mozzarella and prosciutto appetizer, and they were both great. The mozzarella is homemade. :) As other reviewers have mentioned, skip noodle pudding if you're in the neighborhood and in the mood for a sit-down Italian place.", "author": "Emily H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-06-17", "description": "Much much better then when we tried months ago. I think they got rid of the terrible manager and hired someone new.... Made a world of difference. Better waitresses and food more seasoned.", "author": "Optimist O."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-02-23", "description": "We recently had dinner at Bevacco and brought a party of nine with us.  They quickly sat us and handed out menus.  Water was served...lukewarm with no ice. We had to ask for ice.   \n\nCroutons were put on the table in lieu of bread..that's all I can do to explain what they were.  Mind you, delicious, but perplexingly small portions for a table of nine.\n\nI ordered lobster ravioli as my meal and was shocked at the skimpy bowl of 5 raviolis I was served....for $18.  I'm not saying they weren't good, just that I wish I was warned that it was a small portion.\n\nEveryone liked their food, but we all agreed the portions were skimpy and expensive.  We all pretty much left hungry and headed to get ice cream elsewhere.\n\nMy husband and I ate lunch there at another time and totally enjoyed our short rib pannini.\n\n We'll most likely return...that is if we're not that hungry.", "author": "Susan A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-25", "description": "The reviews seem pretty mixed.  My experience was very good.  Great cocktails, well presented and tasty food and a great space. I will be back!", "author": "Rachael B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-15", "description": "We bypassed the usual favorites in order to go to Noodle Pudding . We live in Boerum Hill so we were unfamiliar with any newer options. Both Noodle Pudding and Henry's End were mobbed or at least the older crowds outside would suggest.  we wandered again passed this beautiful, pristine restaurant and decided to go in. My first thoughts were that there must be no a/c to have kept the crowds away but we were greeted with a cool breeze from the ceiling fan and A/c and a beautiful dining room.  as one who believes the filament bulb has been abused as decor, the ginormous mirrors and gorgeous bar and candlelight made it most inviting.\n\nI've read the reviews and am surprised about the emphasis on the poor service ( which we did not have). I kept thinking about the new restaurants in our neighborhood  Rucola and Colonie and the idea of being squished into a table and barely spoken to during  the meal if only to take an order after a two hour wait. I could only wish to have such a big, beautiful restaurant with attentive service in our neighborhood for a casual, well priced dinner. \n\nWe shared calamari which was plentiful and delish then had the buratta panzanella special which was so generous I could not finish. Dinner was squid ink tagliettele with shrimp and artichokes which again was ample portioned and well sauced . My husband had the bevacco salad and the saltimboca which he enjoyed. Shared the donut which was devoured by my guy so in theory it was not shared. \n\nVery much looking to going back especially in the cooler months.\n\nI mentioned to one of the owners that while we enjoyed everything and will be back, I had never heard of the restaurant before and we live 15 minutes away.  It's certainly a much better experience than most of the restaurants in cobble hill.", "author": "aimee m."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-09-03", "description": "We had a large party on a early Sunday evening.  The place was dead...maybe one other table.  For tacking on 20% gratuity, I guess they know they are getting it so can not,worry about good service.  Come on.....can't you give us more bread (its cheap enough)  and fill our empty water glasses without being ASKED?  Menu had changed since last visit.  The food sounds nice on menu but was so boring.....no flavor!  Bla asit could be.  Desserts were pathetic slices off some big commercial pan of tiramisu that was purchased at Costco?  Not going back.  It's sad, cuz it could be a cool place.", "author": "Monica H."}], "servesCuisine": "Italian", "priceRange": "$11-30", "name": "Bevacco", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "60 Henry St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/81ry7bSsEkxWQel3tctGRg/ls.jpg", "@type": "Restaurant", "telephone": "+17186241444"}