{"aggregateRating": {"reviewCount": 229, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-30", "description": "This place was AMAAAZING!!! Incredibly delicious, friendly and WONDERFUL staff, yummy wine, and all around wonderful place. We had 6 in our group on a Monday night, it was a little slow inside, but we had NO issues with inattentive staff like other reviews have mentioned. \n\nAtmosphere: We ended up wandering aimlessly into this place and were pleasantly surprised, I was originally drawn to it for the awesome lamps they have inside and the overall design of the place. This is truly a gem of a spot and a must if you're in the area, steps from A line off of High St and close to the Brooklyn Bridge.\n\nFood: There wasn't one thing we tried we didn't like -- and we had a lot of the menu (there were 6 of us). To start I HIGHLY recommend the Tortino di Pecorino e Pere (pear torte), it's melt in your mouth delicious! For pasta the Gnocchi Ripieni and the Pappardelle. YUM! \n\nAnd don't even get me started on the desserts. Just trust that you won't be disappointed *cough*Bombolone*cough*. :D", "author": "Jessica G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-09-27", "description": "Great ambiance with cute appeal. Went on a Saturday night around 8:00 pm. The restaurant was under staffed and a few tables of 4 were seated before us even though they walked in after. Ordered a pizza and the crust was burnt but the rest was ok. I think on a good night this place would be great and the prices were good too.", "author": "Marie W."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-08-03", "description": "I did not have high expectations as I have lived in Brooklyn Heights for well over 2 years and this had been the one place we have yet to try out, mainly due to the fact that it is strangely dead most of time. I pass by here alot and always wonder how they manage to stay in business, when I see such few people eating inside. \nSo on a nice Saturday evening, we head to nearby Noodle Pudding, but it's loud and we have to wait a little too long for a table, so I say what the hell let's finally try Bevacco. \n\nThere is no wait for a table obviously, but lets move on. The service was so-so. Our waiter was nice but when we asked for explanations of menu items and whether we could substitute one sauce for another he looked seriously PUT OUT and almost politely annoyed.  Service was initially attentive but seriously waned when we were done, with out meal; bring us the bill already. I hate it when waiters disappear after serving the main course. \n Oh the food, Well Kinda -meh.  Wine is grossly overpriced  15.00 for a glass of mediocre pinot noir.  Pizza was nothing above what you could find in California Pizza Kitchen. I loved the bread on my Veggie Pesto Sandwich but that was about it. It was   served with some terrible non salted potato chips as a side dish.  We foolishly ordered the appetizer special for the night, a raw kale salad with chunks of avocado in a tiny baked mozzarella cheese  shell.  This was just NOT GOOD and very small. \n I don't know how else to say it.    So I have now experienced Bevacco, and was not surprised by it's lackluster-ness.", "author": "Tara K."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-07-16", "description": "My friend and I decided to have lunch at Bevacco, since the line for Grimaldi's was literally around the corner and not moving at all.  We should have known that something was amiss when we were literally the only table in there. \n\nThe service was incredibly slow and inattentive. As I said, we were the only table in the place, so it should have been no problem to get a little attention.  It took forever for the waitress to come over to take our order.  Mildly annoying, but I'll let it slide.\n\nAs for the food and beverage, not the greatest.  My salad was interesting.  Radicchio, orange segments, pistachios, olives, fennel, and balsamic vinaigrette.  It was pretty good, definitely different.  But the pizza that we ordered was incredibly bland.  One should never have to salt a pizza, but we did. In addition, the cocktail I ordered tasted slightly off, not sure what that taste was.  And they did not mention that an iced tea refill would be an extra charge, but it was. That was a little ridiculous. \n\nOverall, I don't think I would return.", "author": "Lisa P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-02", "description": "This is exactly what I want from a neighborhood eatery - great food, fantastic service (not pushy, not smothering but attentive and knowledgeable) and lovely ambiance. \n\nWay better than Noodle Pudding since the food is better, it's possible to get a table, and you can hear the person next to you.", "author": "Rebecca O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-11", "description": "Such a good find! We ordered calamari to start, super light batter, saltimboca, the seafood pasta which has was homemade and the arugula salad with chicken. Everything was incredibly fresh and delicious! Drinks and dessert were on point. The wait staff was super attentive. Will def come again.", "author": "Jenn K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-09-26", "description": "I live down the street from this place and have been here before. The first time I went with my family right after I closed on my apt, the food gave me food poisoning.  Then they re-did the restaurant and I went back with my girlfriend to give it a try and the service was awful but the food was great this time around. I'm not going there to make friends with the staff so I can care less if they are rude as long as the food is good and I don't have to wait and inconceivable amount of time to receive it. Now last night I walked in with my girlfriend to have dinner and was not acknowledged by a single member of the staff. I stood there in the middle of the restaurant for 5 min. It seemed that the staff was actively avoiding making eye contact. There were several available tables for two and a bartender literally 5 feet from the entrance that also didn't acknowledge the two new customers walking in to the restaurant.  I tried to get a waitresses attention to ask who I can speak to about seating and she ignored us as well. It is appallingly to me that an entire staff can either not notice or refuse to acknowledge 2 customers coming in. Never going back.", "author": "Dylan L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-08", "description": "I'm between a 3 and a 4 on this one. I ordered a pasta on special and it was just ok. However, I think if I had ordered from the regular menu it would have been better...\n\nThe pros:\n-Very light and airy feel. Overhead fans, high ceilings, calm music- it almost feels like you are walking into a spa\n-friendly, fast and attentive service\n- seated right away\n- wide aisles- great space for bringing strollers (we had our 6 month old with us and they were really accommodating and welcoming. At the same time, it still came off as am adult space that wasn't over run with kids)\n- Calamari appetizer was pretty good and so was the flourless chocolate cake \n\nCons:\nThe only thing that went wrong was that the past dish was \"fine\", I wouldn't say it was good.\n\nSince everything else was on point, I would go back and try it again. If the food doesn't meet the \"good\" standard next time then I would drop rating down to 3 and probably only go back if I needed a place that could easily accommodate strollers.", "author": "Phoebe C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-09", "description": "I have had multiple meals at Bevacco.  My favorite dinner dish is the Paccheri alla Norma, which is  a pasta dish including eggplant and tomatoes.  I have also had Sunday Brunch at Bevacco.  One of my favorite things about this restaurant, aside from their great food, is the atmosphere and the staff.  You will find that the restaurant staff members are very friendly and the cozy ambience at Bevacco will make you want to stay long after you have had your last bite.", "author": "Smita D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-12-10", "description": "Skip nearby Noodle Pudding and come here. This classy and romantic Italian spot nestled in Brooklyn Heights does one thing better than any other place in New York: it makes it so you don't have to go to Italy. Every pasta dish has a texture unlike any restaurant - thick, homemade, fresh, and riddled with garlic, seafood, and marinara in a light, yet indulgent way. Hit signature dishes include the asparagus avocado salad with hard-boiled egg, the branzino with spinach and pink peppercorn sauce, and the crispy and sensational bucatini aglio e oglio with toasted garlic and thick al fresco, homemade pasta. Complete the Bevacco experience with their cream-filled Il Bombolone doughnut, and you'll be back for brunch the next day - guaranteed.", "author": "Bonnie G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-01-17", "description": "I am not one to write a bad review, but I left Bevacco disappointed. My boyfriend and I wanted to go to Noodle Pudding down the street, but since there was a 45 minute wait we came to Bevacco. I found it odd that there were only a few tables occupied compared to the size of this place on a Saturday night. We went in anyway and were immediately seated. The waiter told us the specials which all sounded great and I ordered the paella which was a special for the evening. I love seafood and have never been disappointed as I was with this meal. The dish looked appealing, but I had one mussel and noticed how fishy it tasted. I had another and realized that all of the seafood on my plate smelled and had gone bad. I am not one to send back food, but I was not going to get sick over this plate. We let the waiter know and he apologized and took the plate and did comp the meal, but if it wasn't for my boyfriend asking if I wanted to try something else, I probably wouldn't have been asked for another meal option. I had honestly lost my appetite at this point and just picked at my boyfriend's plate. I'm surprised a place like this is still open in Brooklyn Heights. Needless to say, I will not be back.", "author": "Daniela Q."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-09-01", "description": "Meh... Is it clean? Yes. Is food decent? Yes, kinda. Is it \"good looking\"? Yeah sure, it's quite new. But do not expect a mind blowing meal - well actually not even a good meal, cause all the food me and my friends had for brunch was pretty tasteless. Even the interior decoration: it looks kinda of a wannabe but doesn't get that close to NYC standards as far as places I'd definitely suggest for eating something out. Oh, and it's a bit pricey for what you get.", "author": "Roberto S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-02", "description": "We had a deliciously good time at Bevacco!  To start our waitress was an absolute pleasure and gave us a great wine recommendation. Then the appetizers. The inslata di polpo was some of the best octopus we've had. It reminded me of fresh from the Adriatic sea octopus I've had in Croatia. Now I don't have to take two planes to enjoy that kind of quality! We also had the caprese di burrata; yummy fresh milky cheese with heirloom tomatoes. For an entree we had the seared scallops with a butternut squash puree and a pea puree topped with fried zucchini. The plate was beautiful to look at and had the taste to back it up. The richness of the scallops with the sweetness of the puree and saltiness from the zucchini was a perfect bite. Though we were full we couldn't pass trying the dessert. The fragole was a delight with its sweet cream, strawberries and crunchy crumble. It was the perfect end to a great meal.\n\nThe staff was friendly and attentive, the food was amazing, and the atmosphere was lovely; all in all a great experience. We will definitely be back with friends!", "author": "Shop D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-04-20", "description": "Just got done with Easter dinner here. Was here a while back and it was great. This time, the food was great, however the service was a fucking joke. An absolute joke. One disgruntled ass of a waiter that did absolutely nothing. Water? Ha! \n\nIn the end, the busboy was the waiter and was great. At least he cracked a smile and I was happy to tip him directly.\n\nWatch out for this place.", "author": "Justin D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-22", "description": "love drinks , love service , love food !!! try chicken salad !!!! mmmmmmm\nalso Siciliana salad is really something... atmosphere very lovely - music from 80ies and not too loud so you can actually enjoy your party and conversations . great place to meet with your friends .", "author": "Dee A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-08-13", "description": "What the hell was the manager thinking ???\n\nThe food wasn't bad and we had a good waiter. Everything was fine until we were signing the check when the manager came to ask us to leave because he needed our table !!! And he insisted ... My husband told him to back off, which he finally did and even offered us a round, shouldn't he have started with that ??? Anyway we left telling him how rude and unprofessional he was... Never ever again !!!", "author": "Francine W."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-08-13", "description": "Though the food is fairly good here and they offer organic wine, some of the staff is very rude which is off sets the good ingredients in their menu.\n\nI heard they recently changed ownership, I hope this changes the overall feel of the restaurant.", "author": "Karuna S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-18", "description": "I think it's more of a 3 1/2 star place but since I don't have that option I give them the benefit.  The place is beautiful; amazing marble bar that must have cost a fortune. The menu is a bit limited for me and the place just seems to be missing something that I can't quite put my finger on.  The food and drink have always been very good.", "author": "Scott C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-10-30", "description": "Unfortunately, I did not like this place. I walked in and no one greeted me. I was simply handed the full-price menu, despite the face that it was happy hour and I was sitting at the bar counter. I asked which wine was on the happy hour menu, and the guy held up a bottle of wine without a verbal explanation. It was corked with one of the plastic seals which told me it had been open for a few days. For some reason, I tried it anyways, but not before encountering another problem. I ordered an aperol spritz, which I assumed would be the same price as \"aperol\" listed in the aperitif menu because drinking aperol straight would be gross, and it is never served that way in Italy (this place calls itself an Italian restaurant.) I just returned from Italy within the past month, and I assumed bevacco would be able to replicate the delightful aperitifs I had in Venice and Rome. Well, I thought wrong. I watched the bartender make the cocktail. He made it improperly and unsurprisingly, it didn't taste at all the way I remembered. I then tried the wine, which had the off taste of wine which has been opened for a few days. I expressed my dissatisfaction to the manager, who knocked down the extra $3 I had been charged for adding seltzer water to aperol but was otherwise unhelpful. A dissatisfying experience. I have no desire to return. Take your business to the authentic, hospitable Italian establishments like queen Italian by court street.", "author": "Christine M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-03-25", "description": "Had reservations at Bevacco. This was my first time here and me and my friend wanted to try something new and different especially in a different neighborhood. After reading mix reviews, I wanted to try for myself, since the restaurant did have pretty nice decor and a decent menu.\n\nThe food we had was pretty good. Thespis was  decent size portions. I know someone was complaining about the portion served, but I thought it was just right. We started with antipasti- meat and cheese, you can't go wrong. next was my arugala salad- I love Arugula, even though it's simple, I love peppery greens. I ask the waitress what she recommend between the lasagna and short rib. She recommended the lasagna, so I had that and my friend had the papadelle with lamb ragu and truffle oil. Both dishes was tasty and really good. Not wow, but very well done. The only draw back to Bevacco was the service. The waitress hardly came by to ask how everything was. It was a little busy but not packed so I wouldn't think she was overly busy.\n\nOverall, I thought it was good, and price was good- I would come back to try the brunch.", "author": "Mash P."}], "servesCuisine": "Italian", "priceRange": "$11-30", "name": "Bevacco", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "60 Henry St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/81ry7bSsEkxWQel3tctGRg/ls.jpg", "@type": "Restaurant", "telephone": "+17186241444"}