{"aggregateRating": {"reviewCount": 229, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-06-09", "description": "Absolutely horrible! Cannot believe I saw a review on here to bypass Noodle Pudding and come here! I ordered the Melinese and but into hard chicken. Almost threw up!!  The waiter was no where to be found. We had more conversation with bus boy!! Never again!!!!!!!! Ever!!!!", "author": "Ronnie T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-13", "description": "I arrived at Bevacco this past weekend not really expecting anything than other than your usual corner Italian restaurant, but what I got was much much more. We were greeted with kindness and welcomed in to a dining room that could be described as both modern and classic. Bevacco is headed by rising star and culinary guru,Chef Chiara Zago who will soon be shedding new light onto the menu after her recent takeover as head chef. I ordered the specialty of the evening which was a tagliolini pasta with crab dish that kept me wanting more. The pasta was cooked to perfection and topped with crab that was both sweet and juicy. I was told that the dish may find its way onto a new menu that Chef Zago will be revealing in a few weeks time. The menu will be bringing on a modern twist to classic Italian fare which is sure to delight even the most sophisticated palette. I give this place two thumbs up, and I look forward to returning to Bevacco to experience Zago's latest of culinary creations!", "author": "Robbie G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-19", "description": "Was there for Fathers Day Brunch. Regular menu, party of 5. Been wanting to try it for a while.  We had some meatball appetizers which were very good and salmon app, which was enjoyed.\nAs for main courses we had braised short ribs which were fantastic, steak and eggs which were great, and a rigatoni carbonara, which was just ok.\nService was a bit slow at first, but it was busy.\nMy biggest complaints are that I took the trouble to make a reservation a few days prior and they didnt have it... But they did seat us promptly.  The noise level was high, tile, marble, mirrors, nothing to absorb the sound.\nId def go back though.", "author": "Robert R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-06-10", "description": "Bevacco's food is OK, but not up to Noodle Pudding or Sociale. The management is another story. My wife and I went for a Friday dinner and told our server that we'd like our martini's filled to the top. They are stingy with their drink portions. We had the usual half filled glasses and then found to my shock that they uncharged us $3 for each drink for the \"extra\" vodka. No mention of this beforehand. I complained the the manager, told him we are regulars and we believe the charge is unfair. We stormed out after having our night ruined by this guy who cheated us out of $12.\nMy wife then complained and she was told by the owners how sorry they were and were planning on changing the floor manager that they would send us a gift certificate. 3 weeks have passed and no gift certificate. \nSo, they cheated me out of $12 and then did not follow through on their promise. I'd rather give my money to ethical people, not the owners and staff of Bevacco. Try Colonie, Noodle Pudding, Jack the Horse Tavern, Henry's End, or Sociale. But stay away from these people.", "author": "John G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-11-14", "description": "Food was really bad and room was extremely noisy even though it was less than one-third full.\nI went there for a dinner and was extremely disappointed beyond words. We ordered a fish and pork dish as our main course. both were lacking of any flavor. The branzino dish was totally  \"blah\" with no taste whatsoever .the  pork special featured  extremely dry meat \u0026 the pastry crust was underdone \u0026 underdone at the same time. quite a feat. calamari as an appetizer was decent. \nTheir price is no bargain - for 2 persons with a glass of wine each, at $ 150.00. At that price, I highly recommend you go to Saul's at Smith St instead.", "author": "Michael D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-27", "description": "I am normally a harsh reviewer, but I think people aren't coming down too hard on a new restaurant that is just getting its gears turning.  It is very difficult to properly staff a restaurant this size - one that is going to fill up during weekends but be much slower on week nights.  Combine these ordinary staffing difficulties with the inevitable challenges of getting a new enterprise going, and you should expect some unpredictability in the service.\n\nThe Saturday night I went, my girlfriend and I had only a short wait for a table, and the owner (Peter Sclafani?) gave us friendly attention - coming by a few times to make sure we were happy.  I felt like ordering red meat, which, I know, is not the best way to judge an Italian restaurant, but I was very happy with the result.", "author": "A L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-04", "description": "Pleased to say that things have improved here. Waitstaff better. Service better. Brunch is really nice. Can you imagine? I actually kinda like it now.", "author": "Keith K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-01-27", "description": "Bevacco is a wonderful Italian Restaurant. Katie, the new bartender, is wonderful. The staff is welcoming, the food is delicious, and the atmosphere is comfortable. I look forward to dining here again.", "author": "Marquis W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-08-06", "description": "Great Italian food and great service in a very nice place! The Salmon Antipasti was great! The only thing I really disliked is that they charged me the tip of 20% automatically! For only a table of three! The tip is a \"Gratuity\". I would have left it no doubt but when it's charged on my check already it certainly bothers me! It was a sour closure...", "author": "Rafi R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-01", "description": "This is one of our top 10 in NYC. Worth the drive to BK from Queens. My favorites are the Siciliana Salad and the Bucatini. But I have never had a mediocre dish of food here ever. Ambiance is very nice and the cocktails are AMAZING. Grace cocktail is my favorite.", "author": "Jennyjoon S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-07-26", "description": "Mediocre at best. No flavor--basically food placed together on a plate. Service and atmosphere were nice, though.", "author": "Naomi R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-04-06", "description": "We went during the dine in brooklyn week and got the set menu. We went at 12 and the food took almost one hour to arrive! I guess their kitchen staff had some miscommunication but there was only 3 of us in the restaurant the entire time! There was also only one waitress so when other tables started coming in an hour later we were almost ignored. The food is ok - nothing spectacular. The space is good but I wouldn't come here if you are on a lunch break!", "author": "Alice L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-11", "description": "Best place to eat at the bar in Brooklyn Heights. Everyone who works there is friendly, it's got a great vibe, and the food is awesome. Make sure to try the tiramisu.", "author": "Lillian W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-29", "description": "Tried Bevacco for the first time last night.  We noted that there's a new executive chef (Chiara Zago) in town.  We arrived very early, so the place was quite empty; people started trickling in from 7:30pm onward.  We had a warm wild mushroom salad with burrata, the paccheri alla norma, a pizza bianca, tiramisu, and panna cotta.  The warm wild mushroom salad was impeccable.  The paccheri was very nicely done, with a perfect bite to the pasta, and a lovely, rustic sauce.  Those two dishes were the highlights for us (and one of us is a fussy Italian) -- it felt like we were having a home-cooked meal.  The decor was welcoming as well.  The pizza bianca and tiramisu were also good.  The panna cotta was a little bit too dense for our tastes.  We enjoyed our meal very much, and will be coming back.", "author": "Mika L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-04-15", "description": "I have had some very good meals here, and I appreciate the warm, casual vibe. The food is higher end Italian, but doesn't feel fussy. However, the service can be slow. I recommend it--for lunch or snacks, especially--if you're in the area.", "author": "Kara B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-12-19", "description": "Noodle Pudding was closed for a private event so my friend and I stopped by Bevacco instead. We were smitten the moment they put a plate of focaccia in front of us. The best part was the garlic-infused olive oil. We couldn't stop snacking on it and our waiter was nice enough to keep refilling our plate.\n\nI think the portions are amazing for what the prices are. I could barely finish my lamb ragu pappardelle--possibly because I couldn't stop eating the focaccia. It was a really simple dish--just pasta, lamb and asparagus--but everything they used was so fresh that it tasted amazing.", "author": "Wendy W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-23", "description": "Stopped in for a drink...fantastic mixologist at bar! Visited with bar staff \u0026 customers-so helpful \u0026 pleasant we decided to have a snack-delicious Antipasto Dello Casa w/cheese that literally melted in my mouth combined w/an amazing porechetta \u0026 proscuitto!  Then the wonderful aroma wafting from the kitchen urged us to try the Pappardelle. It was the most unique blend of flavors- excellent homemade noodles(just right thickness \u0026 cooked to perfection) combined with an excellent lamb ragu entertaining asparagus bits \u0026 truffle oil(no plain'ol red sauce here!) Ended with chef's homemade chocolate truffles. Best people \u0026 food in weeks! I figured if some of the bar staff \u0026 customers were speaking Italian, we were in the right place. Highly recommend! Very reasonable!", "author": "Renee B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-04-08", "description": "My co-workers and I went here for lunch during Brooklyn Restaurant Week. The atmosphere reminds me of a European cafe (lots of marble). The service was good and the menu selection was admirable. I had the mixed green salad followed by the chicken with potatoes. The potatoes were on the salty side but were not terrible. Dessert was delicious. We shared the molten chocolate cake (yum!) , the pear soaked in wine (interestingly different) and some apple pie type concoction (also yum). I definitely be back if only to sit at the beautiful bar up front and sip some wine.", "author": "Ola F."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-09-18", "description": "Why doesn't this place deliver? \n\nI walk past Bevacco at least twice per week during family dinner time (5-7pm) and see that the restaurant is close to empty. The primary demographic of the neighborhood is young families. I don't understand why the restaurants on Henry Street, that don't seem to be profiting, don't deliver. I've asked, and they claim that they offer \"pick up\". If I'm going to leave my house, during my children's dinner-bath-bed time, I'd probably pick up from Al Mar or Noodle Pudding. DUMBO and Brooklyn Heights are in desperate need of good restaurants- that deliver...There are several local parent web sites, like yahoo groups that could help advertise Bevacco DELIVERS!", "author": "Honest Foodie G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-01", "description": "Brought my family in for dinner yesterday and food was amazing.  I've been dining here for months and if you are looking for very high-quality italian food, then look no further.  I highly recommend the buffalo mozzerella and proscuitto as well as the assorted meat and cheese platter.  Eggplant parm is better than grandma's and skirt steak is always cooked to perfection.  Ambience is lively yet romantic and staff is very attentive to your every need.  \n\nBon appetit!", "author": "Edward B."}], "servesCuisine": "Italian", "priceRange": "$11-30", "name": "Bevacco", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "60 Henry St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/81ry7bSsEkxWQel3tctGRg/ls.jpg", "@type": "Restaurant", "telephone": "+17186241444"}