{"aggregateRating": {"reviewCount": 229, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-01-04", "description": "Service was horribly slow (despite a less than packed house). And the staff really did not seem to notice or care that we had waited over an hour for some pretty simple dishes. Food was decent but nothing special.", "author": "Ron M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-03-26", "description": "Bevacco is fine.  Unfortunately, that's all it is.  I've had two different dishes on different occasions and both were good; not bad, not outstanding, but decent food.  The issue is that the prices aren't for decent food.  And the atmosphere isn't worth the price either.  It's noisy, the floor is tiled (the linoleum looks very strange), and it tries to be both a romantic spot and a family restaurant rolled into one.  There are 50 other spots in the Brooklyn Heights/DUMBO area I would recommend before here.", "author": "Lucas F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-15", "description": "Best dinner I've ever had!!! Even my fiance who is the pickiest eater loved the gnocchi.  I ordered the special zucchini flower sandwich, gnocchi and tuna fish entree with the most delicious homemade donut as a dessert.  I can't wait to go there again!  the staff was superb!", "author": "Nancy S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-03-06", "description": "Had my Father's birthday party here last night.  It was a group of 14.  I called a week in advance and spoke to the owner.  He took my reservation right away and I was happy that he was willing to accommodate us as Brooklyn restaurants tend to offer only prix fixed meals for a group of that size.  When I asked if they can make a cake for my father, the owner said yes.  I asked the price and said he didn't  know.  Then I asked him to get me a price before I confirm and he said while laughing  \"I'll tell you the price when you are here\".   I decided to bring my own cake because when I told him I didn't expect the cake to cost more than $40-$50, he laughed. \nWhen we got to the restaurant we were seated right away, however, we only had 1 server instead of the 2 he promised.  And while she was working busily, she certainly didn't go out of her way to make it a special evening. Also, as we were ordering our drinks, the server advised us that they were out of the Pino Grigio, Chardonnay, and the Chianti... really?  I was the one who ordered the $9 Chianti and the server tried to upsell me the $15 per glass of Red.  Then to make matters worse, the diet coke was flat.  They tried to fix the machine but  that was unsuccessful.  No appologies...nothing....just business as usual. \nFood - The salads were good. The bread was great. The pastas were excellent.  The other items (steak, cornished hen, fish) were all mediocre. Clearly, this is a pasta place.  \nA positive... they did not charge us a serving fee for the birthday cake we brought.  Maybe that was their way off appologizing but it would have been nice for the owner to come out and say hello and see if everything was ok...Afterall, I just brought 14 people to his restaurant, (9 people who wanted to drink) at 5:00 on a Sunday....not a very busy time.\nBottom line..If they keep up their \"I don't care attitude\" and being neighbors with Noodle Pudding, Henry's End  etc.. this newbie is going to have a tough time.  I don't think I would choose to go back... especially if I can get into one of the others.  When I go to Noodle Pudding, Ari always makes me feel like family...Here I felt like an inconvenience.", "author": "M R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-15", "description": "My wife and I had dinner here and we were very happy with our meal. I loved the lamb ragout pasta dish. The pasta was fresh and prepared perfectly, I was tempted to lick my plate! The scallop appetizer was superb. My wife had the octopus special and oohed and aaahed with every bite! We finished with the chocolate raspberry cake and lattes which was orgasmic! Service was excellent and the wine by the glass was very tasty! Will definitely come back.", "author": "Danny C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-11-03", "description": "Firstly I have to say I am local and in this area we need good restaurants.. My husband and myself have gone to bevacco several times since they opened, with some mixed results... The food was always tasty and when issues arose like forgetting to put our order the manager stepped in and it was the reason we returned again... This is one of my husbands favorite brunch spots, we like to eat at the bar.. And we know exactly what we want, easy customers really... We just went and discovered the change in the chef..  And they no longer do the egg pizza so sad it was amazing.. But we ordered other food expecting the same good quality and great taste as before.. But what a disappointment.. On top of that we were a party of four, the waiter took it upon himself to add his tip... Now according to the menu they will do that for large parties but for four people and we discussed with him that we had been there serval time before the new chef and still he took this liberty.. We will not be returning and we have spoke to other locals in the area and they are equally disappointed.. Why can't we get good restaurants in this area.. I hope yelp publish this review so bevacco can address their issues and improve their service and food..", "author": "Scorcher M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-08-02", "description": "Am sad that I have to write a very disappointing review of Bevacco.  Like others, we were excited when Gabriel was brought in as a new chef.  We were so excited in fact, that we immediately made a reservation.  We are fans of his TV show mostly because his cooking seems so fresh and exciting.  We hoped he would bring a new menu and a reinvigorated front of the house.  But this was definitely the case.  The staff was disinterested to say the least.  Our waiter seemed as if he wanted to be elsewhere.   We started with cocktails which sounded good but were very (very!) sweet.  We didn't finish them.  Our appetizers arrived without bread even though the table next to us (seated long after we arrived) received bread.  Our app was calamari and it was very pedestrian---something you could easily order in a chain restaurant.  My wife's papardelle was very al dente almost to a point of being grossly undercooked.  My muscles were tasty, but seriously small.  So far, not so good.  The waiter never returned to see if our food was ok or to just check on us.  We could understand this had the restaurant (8:30 on a Sat night) not been 80% empty.  We decided to pass on dessert but I ordered an espresso which did not include biscotti even though a nearby table ordered an espresso and did receive biscotti.   We thought Gabriel would be bringing in an entirely new menu.  This was exciting.  But this seemed to not be the case.   Maybe in days or weeks to come it will get an overhaul.  Unfortunately, we won't be around if this happens.   Whoever is running the front of the house needs to pay attention to the floor.", "author": "robert s."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-06", "description": "Brooklyn Heights is not known for great restaurants, but Bevacco on Henry Street is a wonderful exception.  The food is great and I eat here whenever I am in the area visiting my son and his family.  The pasta is fresh, cooked to order, and I have not had a dish that I (or my family) have not enjoyed.  The wine list is also fine; my favorite is an organic Italian red that costs only a bit more than $30 for a bottle. The tre chocolati desert is out of this world.  The restaurant is also attractive and unusually spacious, without the crowded feeling one often finds, tables cheek by jowl with other tables and dinners.  The acoustics are great, so that you can both eat and talk well without having to deal with the high decibel noise found in many restaurants. On top of that, the staff and the owner are incredibly friendly and welcoming, including to children.  It has become one of my favorite restaurants in the city.", "author": "William M."}], "servesCuisine": "Italian", "priceRange": "$11-30", "name": "Bevacco", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "60 Henry St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/81ry7bSsEkxWQel3tctGRg/ls.jpg", "@type": "Restaurant", "telephone": "+17186241444"}