{"aggregateRating": {"reviewCount": 50, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-02-06", "description": "Food here is too damn sweet! Lower the amount of sugar/sweetener in these recipes  jesus. After one meal here I feel like I just swallowed a gallon of syrup. Not to mention the food was also way too oily.", "author": "Darren K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-16", "description": "Damon at this location was incredibly nice, he kept things very efficient when the line was long and accommodated a very annoying order of mine with ease. I really appreciated him taking the time to make sure my order was correct, even though it was unusual. Thank you Damon!!!! This five star rating is because of you", "author": "Beatriz M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-23", "description": "This place is the S***!! Food is amazing . I am so picky / hard to please when it comes to my food. Not one complaint..trust me when I say I will ALWAYS come back", "author": "Britt S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-27", "description": "This Panda Express just open a little bit over an year ago. The American Chinese food is amazing here since they have so many different options to choose from. The only small problem is the lines are long and the staff do not work fast enough to accommodate everyone. Besides that, I would definitely recommend eating here if you are around the area of searching for a Panda Express in the city.", "author": "Shivam K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-17", "description": "This was my favorite go to spot after a hard day of work but tonight was different. When I arrived Andy took my order, however I felt Andy didn't give me enough rice despite it being closing timing. Not to mention I order a bigger plate which cost about $12 after taxes. After my plate was made the cashier wasn't attentive to me, I had to ask multiple times for sweet and sour Sauce. I'm highly disappointed because after I tried Panda Express for the first time I was hooked. This location maybe the problem because the food is still great. I still recommend Panda Express but not this location.", "author": "Melquan O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-17", "description": "The store manager, Stacy and your other exceptional employees that work at this particular Panda Express continuously provide their customers excellent customer service and display a very positive strong work ethic too. I greatly appreciate the service I receive and intuitively observe the other patrons receiving too.", "author": "L.Celeste B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-04-16", "description": "The Panda Express that I've tried in VA, NC, and even in airports have given better portions for the same price than the one here. Severely disappointed in that. Quality of food is quite consistent with that of the others I've tried. As authentic Chinese food as Taco Bell is for Mexican. It's my first time seeing a Panda Express in Brooklyn and here's hoping they stay and maybe get a bit more generous with the portion.", "author": "Brandon J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-07", "description": "As a Californian who grew up on Panda Express, I could not contain my excitement when I saw this location opening up! I seriously checked every week to see if they were open! Sure, this isn't \"really\" Chinese food, but if you're expecting authentic Chinese food at a place named Panda EXPRESS, you're playing yourself. If you're looking for something more authentic take the subway couple stops into the city and go to Chinatown. But if you're looking for a quick fix on that orange chicken and walnut shrimp, you know where to go.\n\nWhen I first moved to NYC I was so excited that there were so many Chinese takeout places but honestly, nothing compares to Panda Express. Sure, there are maybe 5 good take out spots in ALL of the city combined, but you KNOW what you're getting at Panda Express. I swear, they do take out best AND it's convenient, fresh and delicious! At this location, you can see them make the food right in front of your eyes. The service is great, it's never too crowded (at least in my experience) and the place itself looks clean AF. I recommend the walnut shrimp, orange chicken, beef and broccoli, and the black pepper chicken. You can get a side of noodles, fried rice or steamed veggies! Honestly, the best Chinese take out in the area, but again, I might be a little biased :).", "author": "Maria J."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-09-08", "description": "For the price you're paying, it's not worth it. The portions they give out is less than any fast food Chinese restaurant.", "author": "Jacky M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-03-30", "description": "First of all, this is Americanized Chinese fast food, so there's no way I will directly compare this Panda Express to the authentic Chinese food you can find in Chinatown or Flushing. This chain location has also just opened, so it's understandable that consistent service/quality control may take some time. That said, this was a disappointing experience.\n\nThe food at this dedicated Panda Express location seems to taste better/have better quality (comparatively) than the Panda Express in malls back home. (Or has it just been THAT long since I've eaten General Tso's cousin, \"orange chicken?\") The location in the heart of Fulton Street is also convenient. The service is friendly, and seating is readily available.\n\nHowever, the service was extremely slow and non-adaptive. Waiting in a very short line (post-dinner rush) was like watching grass grow. The restaurant appeared properly equipped by staff, but it doesn't appear that these well-meaning employees have learned or been trained to operate and communicate as a team. There was not a single committed cashier, so I must've waited 10 minutes as the second person in line (so that the person who appeared to be a cashier could help the sole customer in front of me literally sample the entire restaurant and add to or edit his order again and again at the cash register). The people waiting behind me seemed pretty angry and frustrated as well, but maintained their politeness. By the time I took my order home, my food was more soggy that I would've liked.\n\n$12+ and extremely slow service doesn't bode well for a business when there are other more affordable and less time-consuming FAST food options or dedicated sit-down Chinese restaurants that offer a more authentic product. \n\nWith the wealth of superior food options in Brooklyn, I'll probably wait a couple of months before considering coming back and re-evaluating. Hopefully, by then, I can update this review to reflect an improvement in the customer service.", "author": "George S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-18", "description": "I came by today for lunch around noon. My experience is nothing like the previous couple of reviews - portions were plentiful and delicious. I do wish this place was bigger to accommodate the current long lines it has.  Shout out to the young lady who made sure she packed my chicken and string beans to the brim. \n\nI will say this - employees seem like robots. They utter the same thing to each customer. Have some personality!", "author": "Jeremy Q."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-02-10", "description": "Real bad hospitality, all personal super rude, kitchen looked dirty! I wonder what Andre, Peggy or Dough would have thought?", "author": "Carlos G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-13", "description": "This place is fantastic. The food is good and the staff is super friendly. You can see the staff cooking in front of you, and you can see how well staff cleans equipment, so that is a plug. \n\nThe location is quite small though and it seems popular to the point that there is a line... A very long line, which tends to go rather slow.\n\nIf you stop by here, be sure to try their Orange chicken.. I think it's the best thing on the menu. It's strange though that Panda doesn't seem to carry soy sauce, or did I miss that? You can also find goodies in the front, such as: sauces and panda plushies, haha.\n\nOverall, good place, but I wish it was a bit bigger. I don't enjoy being in a crowded line :(", "author": "Jonathan M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-21", "description": "Service is great, food is good, I ordered Angus steak, honey walnut shrimp and five flavor shrimp for $15.", "author": "Cathy L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-05-29", "description": "Great Americanized chinese takeout mall food.  I used to goto the malls for Panda Express.  Love their sweet and salty soy based glazed meats served with rice.  Only complaint I have is that the meats doesn't seem as smoky as they used to be.", "author": "John C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-09-23", "description": "Horrible! Young teens working there most of them with little or respect or class. Most of the food sucks!", "author": "K C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-11-15", "description": "This place is trash . First of all the line was so big for such a small place so they need more space because I cannot imagine a line in colder weather. Then they have barely any seating area. Then my orange chicken was kinda raw in the middle. Then my beef from the beef w/ broccoli was only cooked well from one side. Everything is super oily. It just sucked", "author": "Yulissa C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-06-01", "description": "I never knew a Panda Express even existed here. I'm glad they have a little variety now with a newer franchise on this strip of stores. The service was just good- speedy and friendly experience. I ordered the orange chicken bowl. No complaints.", "author": "Shannon C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-15", "description": "This is my gazillionth visit lol. I walked into the Panda Express location and the customers were being served quickly and friendly. The employees also said to everyone \"Welcome to Panda Express\" while cooking! Really good. Other places wouldn't even bother greeting while cooking, they will shut themselves off to just cooking, so that was really nice. When it was my turn to order, I was greeted and asked what I wanted. They prepared it quickly and I left excited to eat this delicioussss food lol. Highly satisfied customer over here! Give these people a raise lol!", "author": "Shari R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-22", "description": "I Have always been a fan of Panda Express but this Location is truly something- every single staff member is super friendly, and quick to offer a free drink if the wait is long. I remember it would be super busy and a bit chaotic when it first opened but i was blown away with how friendly and patient the employees were!", "author": "S S."}], "servesCuisine": "Chinese", "priceRange": "Under $10", "name": "Panda Express", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "423 Fulton St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/GrhRCX_Q9vGVVWlTM2Sn5w/ls.jpg", "@type": "Restaurant", "telephone": "+17182463898"}