{"aggregateRating": {"reviewCount": 50, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-04-16", "description": "I first have to say i knew what to expect from Panda Express seeing it on long island. I WAS getting a bowl of rice with honey walnut shrimp. I have to say if i am paying extra for an entree. DO NOT SHORT me on the food. I still wanted it because i was hungry. So the girl who was SUPPOSED to ring me up. She took the 2 plates after my bowl. When i informed me she skipped me. She told me that the other cashier will take care of me. FIRST OFF THATS CRAP!!! SECOND, ITS SOOOOO disrespectful. I will NEVER come back bc the portions are not correct. PLUS, the customer service. If the manager reads this, i will gladly tell her the day and time i was there. I didnt have time to voice my displeasure. So I am taking it to yelp. Plus i will see the manager tommorrow. So STAY AWAY!!", "author": "Giselle C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-02", "description": "I never write restaurant reviews, but the staff at this location is excellent! They are quick and friendly. Great customer service and clean environment. A+++", "author": "David K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-20", "description": "I had to wait for my teriyaki chicken to be cooked, and while I waited the server I believe her name was jing y gave me a free soda for having to wait!! That was wonderful!!", "author": "Chevon C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-22", "description": "It was an amazing expeomace really liked the services and the food is amazing he shrimp with walnut is extremely good will Be going back today to get another one!", "author": "Ricardo H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-10-09", "description": "I have never been as disgusted as I have when I went to this restaurant. It was actually quite busy and they were backed up and very low on food so I was waiting for food to be prepared. While I was waiting for the food the young man that was manning the wok dropped the utensil he was cooking with on the floor. Instead of washing it off our grabbing another utensil he went back to cooking with it. I walked over to the cashier and asked her to speak to the manager she said she was the manager on duty I told her what had happened and she just said \"oh\" \u0026proceeded to do nothing about it. The young man finished cooking the food \u0026 the food, made with the utensil that had fallen on the dirty floor, went into the steam table line . I stood outside waiting for a friend. It had been about 10 minutes before the manager made her way over to say something to him. By that point the food had already been served to people. I think this is gross and disgusting and I will no longer eat at any of the panda express restaurants... And urge you to do the same.  If this is how they run their restaurants then I do not want to spend my money there! Absolutely unacceptable!!", "author": "Lailah L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-17", "description": "I've always walked past this chain store thinking it would be greasy mall style Chinese food.   I checked out the website and really enjoyed the founders story and commitment to quality.  What's made me a huge fan and repeat customer was Jayda who ensured that my first impression, even though I came in near closing , was an amazing one. thx", "author": "Mark A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-11-21", "description": "I had the orange chicken but it didn't have any orange flavor. just a sweetened version of sweet and sour sauce. portion size was not worth the money. if it wasn't free i wouldn't have eaten there.", "author": "Denise R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-14", "description": "Damon \u0026 Jayda made the experience great and inviting! They made sure to put the fortune cookie in my bag since some people forget to.", "author": "Keyara D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-13", "description": "I have gone to several Panda Express so I know what the regular portion are, however at this location it seems management has told them to provide half portion of what is ordered. You pay full price but Receive half of the order.  What's going on here ?", "author": "S C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-01", "description": "this place is so clean and the food is very fresh. the staff is so amazing and nice. i felt i was in the south with the service. it's chain chinese food so it's not authentic but the service and cleanliness is on point", "author": "Shirvana S."}], "servesCuisine": "Chinese", "priceRange": "Under $10", "name": "Panda Express", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "423 Fulton St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/GrhRCX_Q9vGVVWlTM2Sn5w/ls.jpg", "@type": "Restaurant", "telephone": "+17182463898"}