{"aggregateRating": {"reviewCount": 50, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2019-05-17", "description": "As you all can probably tell, I like Chinese food a lot. Yes, I am always on the lookout for some good chinese food and I can definitely say Panda Express is known for good dishes. My favs are the sweet fire chicken, kung pao chicken, chicken teriyaki, and fire shrimp. I however was not a fan of the lo mein so I just stick to their fried rice as my side. I always get the plate which comes with two entrees and a side for ten dollars plus tax. Oh, and don't forget the chilli sauce and plum sauce on the side.", "author": "Serina J."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-04-02", "description": "Fast and reliable. Not the best Chinese food ever but it gets the job done. I will say they have a good amount of entree options.\n\nPro tip: spend the extra and get the walnut shrimp", "author": "Kelly S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-06-06", "description": "Why spend $18 on Fenty lipgloss when you can just grab some Chow mein from your nearest Panda Express for half the price! Kill two birds with one stone. An oily stone. Your shiny lips will be all the rave and you'll be fed. \n\nAside from my noodles swimming in a sea of canola, my veggie spring rolls were pretty good.", "author": "Racquel B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-05", "description": "I was hungry so I may be wrong but this (I call it) American-Chinese food was the bomb! (Ques the FBI because I mentioned that word). \n\nI was in Fulton (Mall) approaching a BK branch for a combo when I looked up and saw Panda Express with a big old \"A\" posted on their window. Why not, I shrugged. \n\nI didn't have any idea how it worked but joined a queue like an old pro. Apparently there was a lunch special but no one told me about it until I placed my order of fried rice and Shanghai Angus Steak (310 calories). \n\n The server then informed me that would be $1.25 extra. Huh, extra for what? What's going on? I didn't even get an initial price but I'm getting an extra one?  What's happening here? Allyuh mad or wha? \nI told him it was alright. I mean, food was already in a box, I was hungry and what not. \n(Edit: I checked online and understood better. See pic).\n\nThe food is cooked in front of you but you select from their display/warmers. Staff was quick as we moved along. After paying I found a seat in the tiny dining area and dug into the most satisfying meal. The steak was soft with enough chew, the sauce just right and my rice could have been had on its own. This is the first time  I actually finished a large meal (portion) all at once. \n\nThe toilet too was clean and the grey color complimented the black motif of the restaurant.\n\nI think I just found my new lunch spot whenever I'm on Fulton. Even if I have to pay $1.25 extra **inserts upside down smile**\n\nThe End.", "author": "Freeyah-Knycky C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-08", "description": "I was the only Asian person there haha!\n\nIt was my first time having Panda Express and I've always seen people eat it on YouTube so it has always been on my bucket list. I told the person behind the counter that it's my first time here and she was extremely nice and told me how to order, and what the most popular items were.\n\nI went for split sides (noodle and rice) and their most popular item orange chicken and Beijing beef. \n\nIt was okay, it reminded me of your typical Chinese fast food. I paid like $12 for it though, whereas I could have spent less at a non-chain Chinese restaurant.", "author": "Alice X."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-27", "description": "The food here is so fresh. The orange chicken I had was so delicious warm and crispy. They have brown rice option apart from the fried rice option which I got the regular brown rice and for a container it was soo filling. There are long tables by the window and it's communal sharing which I don't mind.", "author": "Cate L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-03-16", "description": "Food was good. Employee was crap. This lady was ringing me up and when I asked for a bag she told me they had no more for the day. I said \"oh what??\"Then she followed up with \"yeah customers don't read signs.\"\nCan't read your sign when the door was held for me. She didn't have to be an ass about it when I never made a big deal out of it.", "author": "Simon M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-11-05", "description": "I'm just going to keep this simple and short. This place is obviously just a fad. I made an online order for pick up and had to wait an additional 20 minutes past my pick up time for my food. To be fair it was a busy lunchtime and this place was packed. However, there were many employees that didn't seem to know what they were doing and they left one of the registers for the online orders abandoned. In the middle of a lunch rush this would seem like bad business. It is. I thought one of the customers who made an online order was going to flip the cash register in anger because his order was so late! I'm no punk, but I was just a lil'  scared. \n\nThe food: This food was not worth the wok it was sautéed in. I had the sesame honey chicken with fried rice and it was obviously that they use low quality ingredients. The rice was too soft and sticky but at the same time had a little weird crunch to it. (Strange but true) the chicken tasted like bad fast food or as my 4 year old would say when he gets bad fast food, \"Not real chicken Mommy!\"  It was just, ehhh. \n\nNeedless to say coupon or no coupon. I will not be returning unless they learn how to get it together.", "author": "Alison S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-02-21", "description": "When i went in this panda express the service was extremly slow.  The servers were also confused about whos meal was whos.  They were out of Orange Chicken and Teryaki Chicken!  The server skiped me and took the persons beyond me order.  I was telling they that i was skiped and they ignored me!  They said to wait.  I was waiting for 5 minutes so i decided to leave.  DO NOT GO TO THIS PANDA EXPRESS LOCATION.", "author": "Henri D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-08", "description": "I actually really like this location, always well staffed. Online ordering available. Everyone I've interacted with has been friendly.\n\nThe food is what you would expect, almost everything is fried and overly sweet. The nice thing about this chain is you know what you're gonna get quality and flavor wise vs. rolling the dice with one of the side street Asian places. The sweet and sour sauce is some of the best I've tasted. \n\nFor the money you get a lot of food. I order online and walk in past the line, let the cashier know I'm there for an online order and give them my name, and leave like a Panda Express VIP.​", "author": "Scott B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-24", "description": "I always hit this place up every now and then. I like the fact everything is made fresh right there in front of you. I also like the idea of receiving a sample prior to purchase (a star within itself). More restaurants should participate in this practice.  \nIt's a nice clean establishment,  friendly service where they explain all ingredients in each meat/side.  \nI really enjoy the reasonably price lunch every time I come here.", "author": "Teniqua K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-12-22", "description": "Today my husband and I decided to try Panda Express for the first time. We ordered some food and after some time it arrived. We  sat to eat, but quickly realized there were no utensil. My husband walked over and politely asked for utensils. The cashier let him know they were getting some out. We waited after 10 minutes I came over to ask, where in the cashier quickly and harshly told me \" I just told your husband its coming.\" Her tone was annoyed  as if we were bothering her.\n\nEventually the utensils were put out uncovered that means no plastic wraps in a cup in front of the register. I even attached a picture. We were not alerted, when I noticed I saw a kid playing  with the utensils while their parents paid the bill.\n\nWe found this to be quite unsanitary. We asked for  the manager who was named Kiara. When asking for the manager the young cashier smiled sarcastically and laughed  with the other associates and servers in the front  in a belittling way said \" Of  course I'll get the manager.\".  Kiara the manager  was not very helpful harshly claiming this is how it had always been, making us feel as if we were wasting her time.\n\nYou could get better customer care  at a gas station bodega. Avoid.", "author": "Briana V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-12", "description": "This is the best Panda Express I have ever been to i. my life. Sure the line is always long as hell BUT they have the kindest employees. One day I had my dog with me so I called in to juts ask if there was a way I could get food since I couldn't bring her in. Their angel of an employee let me order over the phone, came outside and help my dog for me while I went inside to pay and get my food, and then returned her to me. I don't know her name but I would die for her.", "author": "Abby C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-03-05", "description": "The food was great, customer service was okay. I ordered orange chicken, chow mein along with honey walnut shrimp and I did not regret it. Food tasted better than I expected and I will be frequenting there again.", "author": "Sarrah R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-18", "description": "What a great concept! I loved the design of the space, low prices, and the assembly line that ensured the line of hungry customers kept moving. I liked the menu options, allowing me to choose the size of my meal, number of entrees, and size of my side order (full or half - allowing me to get 2 for 1). \n\nYour choices are as follows: bowl (1 entree and 1 side) starting at $8, plate (2 entrees and 1 side) starting at $9.10, or bigger plate (3 entrees and 1 side) starting at $10.60. The side orders are chow main, fried rice, mixed vegetables, white or brown steamed rice.\n\nMy combo was the orange chicken (their signature dish: crispy chicken wok-tossed in a sweet and spicy orange sauce) with a half order of fried rice and mixed vegetables. I ordered the bowl, which was really a box for less than $9. I did not like the flavor of the orange chicken, but would definitely opt for something different next time like Kung Pao Chicken, Black Pepper Chicken, or even Sweetfire Chicken Breast. \n\nSeating area is fair, but given its proximity to academic institutions and high traffic commercial corridor, you might have to opt for take out rather than dining in. Overall, I had a great experience.", "author": "Kristia B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-02-22", "description": "SAVE YOUR TASTEBUDS AND DO NOT GO TO THIS PANDA EXPRESS. I have been here and another Panda Express in NJ. This Panda Express ruined the Panda Express experience! I almost never set foot in another Panda express, until the NJ Panda Express saved me. \n\nThis Fulton Panda Express is disgusting! On their grand opening, there was a different price shown on their menu fliers and on their board on the wall. The staff noticed and decided to charge the larger amount instead. It was a $3 difference. Disgusting! \n\nWhen I finally got the food, it tasted like flavorless card board. It's a damn shame to all Asian food! I am Asian myself, and I can't believe that this restaurant was giving out tastless and stupid non-Asian food and passing it off as authentic. The chefs along with the entire staff were all BLACK. No one was Asian except for the airhead stupid manager who didn't speak English that well.", "author": "Cal C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-14", "description": "BOTTOM LINE: patronize this business location, repeatedly \nWHO: party of 2\nWHY: hunger \u0026 a previous very positive prior experience at this location \nWHAT: (Deets) walnut Shrimp, orange Chicken, teriyaki chicken...all hot and delish and ample portion sizes\nWHEN: after 10pm 8/14/17\nWHERE: dine in\nHOW: car/ bike/ public transportation \nbus trains\nBATHROOM: did not use\nWIFI: yes\nDRESS CODE: as you like\nSERVICE: Cheryfia, Damon \u0026 Quentin were welcoming, pleasant \u0026 helpful throughout the visit. They were engaging, accomodating, detailed and respectful of our time and patronage. I truly enjoyed this experience and will surely return to this location, and possibly others. \nTIP: unlimited tastes, try EVERYTHING", "author": "Minah M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-16", "description": "I went to Panda Express for take out. I ordered their new steak \u0026 shrimp dish with Lo mein. I was absolutely HEART BROKEN to find POTATOES (NO...ZERO chicken!) good amount of steak but as a diabetic...when I choose to splurge I should get what I want! Had I known my dish would have potatoes rather than chicken I would've ordered steamed veggies rather than lo mein or just a different dish!", "author": "T F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-04", "description": "Love the orange chicken and broccoli and beef. So glad they opened in bay ridge. I always go here when I'm shopping in the area for American Chinese food cravings. The food is fresh and they are super nice.", "author": "Sandra N."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-11-01", "description": "My third time giving this place a try. Welp, third time is not the charm. With the exception of the honey walnut shrimp, everything I have had from here is on the same level as frozen food meals.  This actually reminds me of the frozen PF Chang meals. The saving grace for this place is the honey walnut shrimp. That honey sauce they are tossed in is sooooo yummy. Not too sweet, just right. I like they way it is fried and there's a whole shrimp in the batter, not minced shrimp meat. I would truly skip anything else here, most particularly the chow mein! Next time I go, it would only be for the shrimp.", "author": "Mickei M."}], "servesCuisine": "Chinese", "priceRange": "Under $10", "name": "Panda Express", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "423 Fulton St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/GrhRCX_Q9vGVVWlTM2Sn5w/ls.jpg", "@type": "Restaurant", "telephone": "+17182463898"}