{"aggregateRating": {"reviewCount": 309, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-09-18", "description": "I really wanted to like this place. I live right around the corner from this place and it would have been a great place to take friends and family, but this place is a disaster in the worst kind of way.\n\nThe dining area is cozy enough, dimly lit, romantic and with airy open windows. But that is where the charm stops. \n\nI came here one Sunday night with a dear friend to enjoy food and to catch up on life. My friend was in the mood for fried calamari, but much to our dismay, they did not have any. That is a no-no. But we were forgiving and opted for the Melanzane Ripiene which is eggplant rolatini with cheese fondu and tomato coulie. This was a great dish. The eggplant tender, juicy and lots of cheese. It was quite a mouth awakening dish!\n\nFor the entree, I ordered the gamberi alla griglia. This is a grilled shrimp salad with meslun, corn and avocado. Also very good. The shrimp was very fresh and grilled to perfection. \n\nNow, what really annoyed me was the service. The waiters either were lying to me or they couldn't get their act together. You see, I have a weakness for sweets and after eating our meal, I was very interested in dessert. I was originally told by one waiter that the chocolate mousse cake was NOT made in-house, and that the ricotta cheesecake was made in-house. So we had the ricotta cheesecake. Then, another waiter, came by and told me that all cakes were made in-house. OK, now which one is it? Can you get your story straight? So when I told the second waiter he was lying to me, he proceeded to bring out the whole ricotta cheesecake to prove a point. I have no idea how that was necessary. \n\nAlso, my friend and I lingered for a bit to talk and chat. She noticed that someone in the back was smoking  cigar. She was not happy about that. \n\nOverall, the food was decent, but the service was pretty shady and I am really not sure where they source their food. That always has me a bit skeptical. And if I am paranoid about a place, I doubt I will return. You lost my trust and well now its hard to regain it...", "author": "Vivian H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-12", "description": "This restaurant is so cute and the food is wonderful. The owner, Guisseppe, was so nice! Service was a smidge slow but we weren't in any rush so it didn't matter. Wine was delicious (in the sturdiest wine glasses I've seen in a while...bravo!) and all the pasta is made in house. The portions are perfect size and the pasta was cooked to perfection. The prosciutto bruchetta special was delightful as well. I'll definitely be back!", "author": "Mckinna K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-04", "description": "This place is truly a gem in a weird area of Fort Greene. My boyfriend and I came here  for a reservation on the night before Thanksgiving.  We were greeted and sat promptly. \n\nThe dining room was beautiful and cozy. The lighting was dark enough for a romantic  ambiance but light enough to read the menu. I like that the menu came on a board with \"rustic\" details and writing. There was an amazing selection. \n\nThe service was efficient and fast. The waiter was so courteous.\n\nThe Cabernet Sauvignon was delicious. Im used to house wines being watered down and bland but this one was the best yet. \n\nThe tomato concoction that accompanied the bread was to die for. The fried zucchini and Calamari appetizer was great!\n\nWe ordered the specials of the  Sole Filet and Grilled Calamari and The Shrimp Linguine in Basil Pesto. It was amazing.\n\nI will be coming here again definitely!", "author": "Amber C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-18", "description": "Good food, and good wine - felt like home. Simple, old school charm.", "author": "Rupa G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-10-14", "description": "We were there the other evening and the food was OK (we've been there before) but we were a bit put off by the customer service.  It felt like we were in a diner--every few minutes the wait staff were trying to take our orders when we'd barely sat down, taking our plates when we'd barely finished, asking what we wanted for dessert when we were still having wine.  We were trying to have a nice romantic conversation.  I finally just asked the waitress to stop, \"Please, you have a lovely restaurant, but I feel like I'm in a diner.\"  I don't think she understood.  But they left us alone after that..  \nI hope they read this.....it is an easy thing to fix.", "author": "Ann Marie M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-08-07", "description": "I've passed by Caffe e Vino many times on my way to and from the train station and always wondered if it was worth a shot. I took my girlfriend there one night for dinner. we dressed somewhat nicely however after sitting down and seeing people in board shorts, polos and baseball hats quickly realized we were a tad overdressed\n\nThe atmosphere at first felt very rustic and Italian until Rihanna started playing over the PA. The music selection was a very mixed bag leaving me feeling confused about the restaurant's character.\n\nOur server was just nice enough but was not outgoing in any way. After we were served and the bottle of wine had been poured he stood outside talking to friends, and then the kitchen staff until I walked past, which made me think maybe he'd forgotten we were still there. When he brought the check there were no pleasantries and he hardly said a word to us. When we paid, there was a \"cash tip please\" note in the check books, which we ignored, leaving our tip on the credit card receipt.\n\nThe food sounded amazing on paper. I ordered a dish which included big rigatoni, italian sausage and a reduction. The portion size was a bit small for what I paid for it and I could swear they used ground beef instead of italian sausage. The plating and presentation was nothing special either.\n\nMidway through the dinner while we were left to our own devices by our server a young couple came in, had a bottle of chardonnay, a full meal and desert, which was \"on the house\" and left before we were able to get our check. We were able to surmise later that the man was friends with the owner/staff.\n\nAll in all it was a pretty poor dinner experience and I can't recommend anyone go there. In fact, if a friend were to mention they were planning a trip I would go out of my way to dissuade them.", "author": "Sam H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-15", "description": "Classic, home style Italian food at its best. Our meal was delicious from start to finish. They serve the bread with a tomato flan, which is basically a delicious tomato spread, and it was addictive. We shared the mushroom polenta as an appetizer, it was super flavorful and rich WITHOUT feeling heavy, not sure how they accomplished that but kudos. For mains, we had the rigatoni with eggplant, mozzarella (fresh cubes of mozzarella), and tomato sauce, a classic and done perfectly. We also had the spinach gnocchi, very good as well and huge portions. \n\nCute restaurant, and pretty good (slightly hover-y) service. Definitely would trek back here from Manhattan just for the tomato flan.", "author": "Cat S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-11", "description": "This one of my favorite places! I always come here. It is perfect for brunch, dinner, and after hours. I enjoy bringing family, friends and neighbors here. It is simply wonderful for special occasions. They have wonderful menu to choose from. The specials are great. The menus that are designed for occasions like Valentine's Day are superb! The staff and owner's recommendations always accurate.\n\nThe service is just excellent! There is always a warm and inviting feeling. You are welcomed by a pleasant greeting every time. The staff deserve a gold star for congeniality. \n\nThe location is conveniently accessible to all the transit lines, a short walk from our home, the theater, park, shows, shopping and more! The food is delicious and we will continue to return.  Our friends and neighbors have thanked us for introducing them to this restaurant too!", "author": "Lebleena L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-25", "description": "Very attentive waitstaff, and very delicious food. And comically large glasses of (good) wine.\n\nI had their steak special - an arugula salad and garlic and rosemary sauteed steak - and it was very good. The torta della nonna is the creamiest I've ever had - though it was unlike the one my nonna makes, it was still delicious.", "author": "Robert L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-05", "description": "The only thing I have to complain about is the times are incorrect online, it says they open for lunch at 10am, I made a reservation on open table for 11:30 and I got there 11:30 and they weren't open! Anyways, I called to ask about times and was told they opened at 12, I waited a half hour until they did open. The decor and atmosphere were great, you're greeted by a really kind guy who is the waiter and I'm assuming is the owner. There were three other tables and we were served quickly, to start we had the gamberi alla griglia which was a mixed greens salad with shrimp, avocado and corn, wonderful. My fiance got the salmon which I'm assuming was amazing since he finished it all up in a matter of minutes! I had the delicious panino romano with grilled chicken, guacamole and bacon. \n\nNow my favorite part. Dessert. Everything on the menu sounded AMAZING but it was a chilly day so we decided to go with the warm apple tart (although it did come with vanilla gelato). It was warm, flaky, perfection.\n\nOverall, service was friendly and attentive and the food was very authentic and delicious, great portions and not too pricey.", "author": "Merlina R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-21", "description": "I wish I could give 4.5 or even 4.75, but the few things that weren't fabulous were not bad enough to take a whole star away.  \n\nOn the whole, our meal here was completely outstanding. All of the food was delicious and well prepared, the wait staff was attentive and helpful, the ambience of the restaurant was perfect for a pre-show date-night meal. \n\nWe each had a glass of the montepulciano (sp?) which was delicious.  \n\nWe started with the fried calamari \u0026 zucchini. It was fried to perfection and the zucchini was a nice, unusual addition. I didn't love the sauce to start, but it grew on me, and we ended up finishing every bit of it - using the bread when we had run out of calamari and zucchini. \n\nWe both had pasta specials - my husband ordered the ravioli and I had a penne like pasta with pancetta and tomatoes and garlic. They were both fabulous. \n\nFor desert we had the tiramisu and the panna cotta. We both tend to be purists when it comes to these deserts. They're classics for a reason. Don't mess with them. Here, they were DIVINE. They got them exactly right. The tiramisu was creamy and not at all boozy. The panna cotta was rich and creamy and vanilla-y. It was supper yummy. \n\nThe things that were not fabulous: the bench along the far wall was actually pretty uncomfortable, my after dinner latte was not particularly good, and while the restaurant itself is very nice, that part of Dekalb is not the nicest neighborhood, and there were lots of less then awesome smells wafting through the very nice open front of the restaurant.   But everything else was so wonderful, these felt like very minor issues.", "author": "Rebecca R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-02-23", "description": "Let me preface this; it was Valentine's day which of course is super busy, so I understand a restaurant may not be at it's best.  That said, I've got to assume a restaurant would be prepared for it as it's one of the biggest nights of the year for them...  #1 The place was arctic cold, I mean, it was below 50something degrees inside, and it was jam packed with people.  We're spending good coin tonight (over $200), I think we deserved some heat.  #2  Servings were tiny, this is Italian food not some type of boutique experimental 6 course tasting meal.  The meatball dish was literally two small meatballs, no pasta, just sauce.  And they didn't taste like there was much meat in them.  #3 Sorry, no bread, \"we ran out of bread\"... Huh?  Then we see a couple next to use (who came in later) get bread with their dish (maybe it's proprietary  dish bread?).  All in I'd never go back, this is NYC and there's a ton of good Italian food around, and you don't need a winter parka to sit inside them.  And bread isn't some type of rare \u0026 expensive commodity.", "author": "CD P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-23", "description": "This was the highlight of our recent trip to New York on the weekend (at least in terms of food).  And let me just say, I am now a huge fan of ricotta cheesecake.\n\nOur basically perfect meal started here as we had booked tickets at the BAM theatre about a block away.  Looking for a place to eat, Yelp said this was the highest rated place in the area and I can see why.\n\nThe service was great.  They were polite, they were quick (everything we ordered was brought exceptionally fast) and they were attentive (someone always filling our glasses without us needing to do it ourselves).\n\nLikewise, the food was great.  The missus and I both ordered a daily special of a pasta with brown sauce and it was quite flavorful.  (Small nibble was that the missus' portion was larger than mine but what are you going to do - for sure I don't need the extra calories!).  For dessert, I ordered the new love of my life, ricotta cheesecake!  OH MY GOD was it good.  I love cheesecake and was dying to have real New York Cheesecake and had never had this type before and it is now my new favorite (or at least the way they did it).  The missus had a chocolate mousse cake which was also quite nice (like portugese chocolate mouse).\n\nTo add to all that we both ordered red wine and the amount they gave was quite generous (which I always find is a nice touch).\n\nFinally, to top it all off, as we had said we were first time visitors to NYC, they gave us a nice after dinner drink on the house.  \n\nSo, all this taken together made it the highlight of our trip for food and I really recommend it, especially if you are going to be seeing a show at the BAM Theatre since you can eat a great meal before the show.  But I would go out of my way to go there again regardless.\n\nOne little tip is that this place fills up fast.  We got there just before 6 with only 2 other people in the restaurant and within 30 minutes it was pretty much full.  This was on a Friday night so a reservation may be warranted.", "author": "Jeff H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-06", "description": "Have been going here ever since they first opened. Would highly recommend if looking for quality Italian cuisine.", "author": "Alejandro F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-04-17", "description": "It's a good idea to check your receipt and take cash.  Three of us went there to eat prior to going to the Harvey theater. Tables are close together   We were the first ones there with a 4:30 reservation and the door was locked when we arrived but they opened it for us. The waiter didn't know what the specials were yet-said the cook was working on it. Later, he told us the specials which included veal scallopini. The salad was very good. Two of us ordered the veal scallopini and what we were brought was a veal roll. We were surprised but thought that might be their version. However, 2 celebrities that they had squeezed in sitting next to us got what actually looked like veal scallopini. When it came time to pay the bill, there was a note to remember the gratuity and please pay in cash. We put down a credit card. We were told their machine was not working and it would be at least 20 minutes to get it going (it was 20 minutes before the performance). Fortunately we were able to come up with the cash. We also noticed that they had already added the gratuity to the bill so the note to remember to give a gratuity would trick some people into adding more cash. Having now reviewed  other reviews out of curiosity, I see they got the same story about the cash. They should state it up front when you make a reservation so that you are prepared. Food was fairly good but not getting what we ordered, being asked for a gratuity when it had already been added and telling us a story about the credit card machine not working all add up to never going there again", "author": "Betsy B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-11-24", "description": "Former CEO of company I am interviewing for: \"I picked this place for you to have your dinner meeting; I thought you'd know how to work around an Italian menu.\"\n\nYou sir couldn't have been more correct!  Are we even more so connected based on our love of food?!  I pray we are...I pray. \n\nKeeping this in mind while maintaining an air of poise and professionalism, I truly had a wonderful experience here and hope to visit again incredibly soon under much less stressful terms.  While that being said, let's get down to the nitty gritty dirty details:\n\nWe started with a two orders of fried calamari, which were perfection on the inside out.  Lightly breaded and crispy - just they way God intended it I'm sure.  And how cute!  I see little traces of zucchini in here as well!  You delight me!\n\nMy entree was exactly the same as my interviewer's to be on the safe side - papardelle caffe e vino and I couldn't have been happier.  I really had to control myself to not shovel (you ALL have this problem when you taste something so amazing).  The mushrooms in their masala-like sauce was really worthy of bread dipping, but I will save that for the next time I come here with my beau that's for sure!  \n\nThis was all washed down with a tiramisu, which for $7 was really a generous piece.  Not sugared to death, and really smooth.  \n\nThe service was absolutely flawless; never had my water glass less than half full at all times.  The host and waiters were very accommodating and gracious; I hope that remains consistant.\n\nI know you're wondering...\"Did you get the job?!\"  I'm still waiting for the final result. :)", "author": "Jaclyn C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-06-05", "description": "Last night I had one of the best meals I've ever had at a Italian resturant. But check your bills people the gratuity is added to your bill, with a comment box at the bottom of the receipt with a suggested tip and space to include another tip. A bit pricey but the food is good. Almost forgot we we're a party of two. I gave them 2 stars because of the bill.", "author": "Natasha B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-02-15", "description": "This was not a good place for Valentine's day. It started off with a 20+ minute wait for a table (despite having reservations), a changed menu (despite checking beforehand what would be available), and confusion among the busboys and waiters as to who was taking what order.\n\nThe food wasn't good. Edible is perhaps the best way to describe it. \n\nTo top it off, the check came with a tacky request (written on a post-it) to tip in cash! \n\nSorry, you might be ok not on Valentine's day, but there's no reason to try this place again.", "author": "Alex E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-07", "description": "Darling is just the word for this little restaurant.  It's not very big, but the flavors of the food was good.  My daughter looked this up on yelp and we walked over from the Aloft Brooklyn - will not do that in heals again, but it was not a far walk - around 15 minutes and worth it.\n\nUpdate:  just as good as the first time.  Tonight I had spinach gnocchi with butter and sage.  It was so tender and flavorful.  Owner is so nice!\n\nWe had the calamari and polenta for starters - the calamari was tender and the polenta was flavorful (I forgot to ask what the sauce was that complimented the polenta).  For dinner I had the linguini Con Gamberreti (pasta and shrimp in garlic and olive oil), which was good, but my daughter had the Paccheri  Alla Toscana, which had awesome flavor!  The third attendee for our dinner had previously eaten so she only had salad (what??)\n\nOur waiter was very attentive and promptly answered our questions.  This was just the ticket after a very busy day - nice and quiet and delicious.  I would definitely go again as this is a hidden gem.", "author": "Kendra L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-31", "description": "Found this little gem on yelp. We wanted some Italian food from an authentic mom and pops joint in our neighborhood. That is exactly what we got. Every thing was perfect from the bread to the wine! My wife ordered a dish with mushrooms  and truffle oil and it was outstanding! I can barely remember what I had because her's was so good. \n\nIts nice to see a little tiny restaurant with barely enough seats turn out some really good and authentic food.", "author": "Joe S."}], "servesCuisine": "Italian", "priceRange": "$11-30", "name": "Caffe E Vino", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "112 Dekalb Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/7NZ_1HM1SMNHCZU82Z7TBA/ls.jpg", "@type": "Restaurant", "telephone": "+17188556222"}