{"aggregateRating": {"reviewCount": 309, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-03-07", "description": "great buttered mussels\nsome fire safety issues\ngeriatric crowd", "author": "hailey h."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-20", "description": "My mother (in from out of town this past weekend) and I went to a movie at BAM and afterwards headed over to Caffe e Vino because it popped up on the iFriend as being close and serving fresh pasta and that's what she said she wanted for dinner.  Bless you Yelp and bless you Caffe e Vino for providing the most delicious gnocchi a girl could ever hope for!  Like fluffy little clouds of savory delights!  My mother's fettucine special with tomatoes, mushrooms, and bacon was equally excellent.  And we started with the calamari and zucchini, which while not mind blowing, was lightly battered, fresh, and well prepared. We shared a lemon panecotta for dessert and it was very reminiscent of a cake my mother used to make often, so that added a nice familiar touch to the meal.  The place itself is darling - very cozy and rustic, perfect for a cold day.  The waiter referred to us as \"bellas\" and you can't go wrong in telling my mother she's pretty, it will always win you a smile (and let's be honest, same goes for me).  They were also attentive, prompt, and efficient, without being overbearing or hovering.  I would highly recommend going to Caffe e Vino before or after any of your BAM related events (of which I feel there should be many since BAM itself is also great.)!", "author": "Meghan W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-05-09", "description": "This small little hole-in-the-wall restaurant is worth making the effort to find. The food is delicious, and tastes fresh, and the service is really excellent. It's small but cozy with a sweet little garden in the back (we'll be back to check that out!), but far and away what makes this place worth coming to is the staff. Excellent food at a good price is fine, but on Mother's day, the owner made an extra effort to help out a family who didn't have reservations anywhere. He didn't have to; the place was plenty full! The food, the prices, the ambiance, and most especially the service, is what will keep us coming back and bringing friends!!", "author": "Hannah S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-30", "description": "This small neighborhood restaurant within walking distance to the Harvey Theater makes for great pre-theater dining. The menu is interesting and the food doesn't disappoint. The Insalata di Rucola is delicious and big enough to share as an appetizer. The grilled salmon is beautifully prepared with fresh vegetables. There is a nice choice of pasta dishes and wine. The restaurant is noisy but we were still able to converse. If you are seated close to the kitchen -- you really feel the frenetic energy of this friendly staff.  Overall, highly recommend this restaurant.", "author": "Nancy F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-04-27", "description": "Simply delicious! I've heard good things from friends but finally stopped in with my boyfriend last week and we both agreed that the food was amazing! Even the bread and tomato aspic was great. The service was friendly \u0026 very knowledgable on ingredients and what wine to complement our dinner. I felt like I was back in Florence!", "author": "Marta S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-11-23", "description": "The gnocchi with sage is one of the greatest dishes I have ever tasted (and I'm 65 and have been all over the world). The papparadelle with wild mushrooms is also amazing. They are incredibly friendly, too. I've never been there when it was crowded, but once they had a special salad with Gorgonzola, and I asked if they could make a Gorgonzola sauce for the gnocchi... REALLY good!!", "author": "Toni S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-06-24", "description": "Great little place for Italian food. I've passed it numerous times walking down Dekalb, and you wouldn't necessarily expect a place like that next to so many convenience stores and other corner shops. But as soon as you walk in it feels like an authentic Italian place with a lot of character. The food was great- I had the salmon and it was very flavorful. Also, the owner is really nice, he came over and chatted with us during/after our meal. The staff was extremely very friendly and attentive. Also, we used a restaurant.com coupon so it was even better getting $25 off the whole meal that wasn't even that expensive to begin with. Definitely plan to go back!", "author": "Davi H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-06", "description": "We love our Italian place around the corner! Already brought various friends and my parents there and they all loved the cozy atmosphere - a little like in Italy indeed - and, most important, the food. Go for any pasta which states \"home made pasta\" on the menu and you cannot go wrong. Usually a main is more than enough but you can always have one of the great salads for starters. I especially love the fagioli e cozze with mussels, rosemary and white beans (sounds weird but tastes deLIcious) and their pasta with Italian sausage. Usually a main is more than enough but you can always have one of the great salads for starters. The one with peas and pancetta is amazing too but preeeetty heavy, schedule in a food coma nap afterwards. For dinner they serve, as already mentioned in previous posts, a tomato paté which tastes great. The focaccia bread is great too though a bit oily. I feel they do not bake it freshly every day, so it can turn out a little hard sometimes. Other dishes we (or our company tried): fried calamari - I am not a huge fan but the rest liked it, salmon - very good. We had the Primitivo once which was a great choice. Espressi are good too - double up for just a buck extra! Oh, and treat yourself with their limoncelli - yummie!!! We already liked Noodle Pudding in Brooklyn Heights - but honestly, Caffe e Vino is even better foodwise.", "author": "Maj H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-03-02", "description": "What a great choice for dinner.  We were visiting New York and wanted a small, local Italian restaurant with good service and personality -- no chains, no tourist magnets.  Caffe e Vino was perfect.  It has maybe six or so tables.  The wine selection was modest, but excellent, and our food was very good.  What really set Caffe e Vino apart was the excellent personal service.  The waiter knew we had a show to make at the BAM, so he made sure we received our wine, food and desert without delay, but without making us feel rushed.  I heartily recommend this place.  This is my first yelp review; I created an account so that I could place this review.  I hope the review doesn't sound too positive!  I just can't think of a bad thing to say about the place.  Even the bathroom was great!", "author": "Walton P."}], "servesCuisine": "Italian", "priceRange": "$11-30", "name": "Caffe E Vino", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "112 Dekalb Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/7NZ_1HM1SMNHCZU82Z7TBA/ls.jpg", "@type": "Restaurant", "telephone": "+17188556222"}