{"aggregateRating": {"reviewCount": 309, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-05", "description": "We had a great experience at Caffe e Vino.  The restaurant is a small, neighborhood place with an easy going elegance.  We were a party of 8 celebrating our daughter's graduation and had a reservation at 4 o'clock on a sweltering afternoon.  The restaurant was cool and comfortable and the staff was friendly and attentive.  Everything we ordered was delicious and the wines were great.   We are happy to have found such a lovely restaurant so close to BAM and downtown Brooklyn.  We will be returning soon!", "author": "Nancy B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-01", "description": "This was the best experience I have had at a restaurant in a long time! I knew about this place because I work at Brooklyn Hospital but I knew nothing about it..I didn't Yelp it first either and im kind of glad because I was able to form my own opinion w/o any prejudice. \n\nSo we walked in and were seated right away...the host was corteous..the place is small but very cozy and nicely lit. We started with the fried Calamari w/fried Zuccini app it was crispy light and delicious!  For Entree I ordered the shrimp with linquini olive oil amd fresh basil...My boyfriend ordered the steak that came with fresh perfectly seasoned spinach...both were YUM! And the portions were just right so u have room for dessert. \n\nWe ordered the Tiramisu and Chocolate Mousse...light, smooth, creamy, Yum! I have to say I was a little embarrassed because we literally ate everything that was put in front of us and cleaned our plates! Lol\n\nIf I had one critique it wud b that there cud be a bit more menu options..but other than that I really liked this place and will definitely be back.", "author": "Tamara H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-14", "description": "This is a hidden gem of Fort Greene. The service is friendly and the food is delicious, all for a reasonable price. Love the steak and the shrimp pasta. If they have scallops those are also delicious. Highly recommend!", "author": "Erin C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-20", "description": "Such a cute, nice and cozy place for a simply good meal. I love the atmosphere and how it manages to be intimate on such a busy sidewalk. Went there for Mother's Day brunch and they were really nice. One of the waitresses even held a family's baby so that they could eat in peace and several people kept checking on us. Food and decor is 3 stars but because of the service I'm giving them 4!", "author": "Sha M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-12-03", "description": "Got there on a weekday 45 min before closing time and the food was still very delicious! We had the chicken stuffed with spinach and cheese dish (came out smoking). Really flavorful, and filled with different hints of something (sorry my palate fails when it comes to naming herbs).\nAlso had the shrimp lemon vinaigrette salad. The shrimps were the main star, the salad was tangy and salady. After reading a previous review about how salty things were I was a bit afraid because I tend to like foods with low sodium content. But no worries everything was a perfect balance. Service was prompt and friendly.", "author": "Helen L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-13", "description": "Our go-to pre-BAM spot. Warm, attentive (but not overly attentive) service that far outweighs the occasional error. Delicious, reasonably priced food. Our favorites: the house pappardelle with mushrooms and the extraordinary ricotta cheesecake. Oh, also the complimentary \"tomato flan\" and focaccia.", "author": "Frank E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-25", "description": "What's not to love?Charming italian hospitality...yummy food and good prices.  Good thing I'm close enough to be a regular", "author": "Nap T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-26", "description": "I grew up in an Italian family and have eaten at Italian restaurants all over the world and my meal at Caffe e Vino was one of the greatest Italian meals of my life. Every step, from the Tomato flan (!!!) to the salad, to my veal and ricotta meatballs was mind-bogglingly delicious. And the service is absolutely impeccable. Warm, gracious, yet very courteous - the right balance between friendly and formal. If you're a foodie who's looking for an Italian meal that will knock your socks off, check this place out. You'll not be disappointed.", "author": "Jack j."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-18", "description": "Salmon Alla Griglia was prepared in just the right way. The chocolate mousse cake is amazing. We went there very early, around 5 for dinner. The place was empty but started filling in as we finished at around 6. The space is nice. It's located right across from a hospital with a nice garden to look at while eating. The best part is the bread and tomato spread they serve you to start your meal.", "author": "Erica S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-09", "description": "Took my gf here for her birthday before going to see a show at BAM Harvey theater.  As usual was cutting it close with the time, ordered two apps, two meals, bottle of wine, and had looked forward to dessert.  The service was great, the waiter who may have been the owner as well helped us through the menu, wine \u0026 specials.  After finding out we were running late he expedited our order, but cancelled our spinach souffle bc of time.  He was extremely attentive to our needs, always refilled our class before I reached for the bottle.  The tomato flan with fresh baked bread was to die for.  The Insalata Di Rugola was fresh \u0026 delish, I ordered the Fettuccine Al Ragu' Di Vitello, which was over the top goodness, and my girlfriend had the ravioli of the day, sausage \u0026 fennel....sooooo good.   All the pasta is made fresh, but he portions aren't the largest and the price could sneak up on ya.   We loved it so much and wanted to try their homemade ricotta cheesecake, plus the waiter seemed a little disappointed that we had to rush through, so after the show we went back.   We I highly recommend this hidden gem especially before a show at BAM...but give yourself some time to relax and enjoy!", "author": "J L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-15", "description": "THIS PLACE IS A GEM!\nI work in this area and after I long day, I wandered in and right away I was taken care of and all my needs attended to. The owner was warm and hospitable and a native of Naples and the ambiance of this tiny hideaway reflects that, the decor being authentic and comforting without being cliche or pretentious. The wine was delicious and I was given a recommendation based on my loose description of what I was in the mood for and the owner was able to expertly pick just the one I wanted despite my own lack of knowledge when it comes to choice wines. The prices were reasonable and the food was beyond delicious.\nThere are Italian places all across the city but this place in particular just feels like home, which isn't a feat many commercial establishments can pull off. The proprietor is warm and attentive and sincerely interested in your tastes and your needs, the food is delicious, and after a ten hour work day when I wasn't sure if I should face plant in bed without a meal or just grab a quick bite to eat so I didn't have to cook for myself- I was treated with a huge smile and a comforting meal and it made it unforgettable and what I think true Italian food is really all about.", "author": "Esther K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-13", "description": "Lovely Italian food close to BAM\n\nVery happy with our first visit here last night. Owners/staff were super attentive. There were some good wine options but we opted for an Italian beer on tap that was light, highly drinkable and a really good deal. \n\nNow ... about the food ... The Insalata Di Finocchio (fennel, arugola, olives, orange slices \u0026 goat cheese) was perfect: bright, tangy and perfectly seasoned. I was beyond happy with my choice in entree: homemade pappardelle with fresh wild mix mushroom = earthy, sweet, and unctuous. The taste and texture of the papardelle was amazing! My friend had one of the specials of pork in peppercorn sauce which was also really delicious ... but back to my papardelle ... YUM! This dish was definitely worth going off the diet for the night :)\n\nReally enjoyed our meal. Love how close it is to the park and BAM. Service was really punctual and we even had time to take a stroll before heading to our play. Big props to this place and we'll be back!", "author": "Alexandra G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-07-28", "description": "Me and my girlfriend went here this past Sunday for her birthday and absolutely loved the food. It was recommended to us by a friend of mine and i was definitely pleased! \n\nWe tried the mussels for appetizer and it started our dinner in the right foot... i love it that they were not stingy with the amount of mussels either. \n\nI had the Salmon and it was cooked to perfection. The veggies were also cooked perfectly (I dont like it when its too soft or too hard). My girlfriend had the Mushroom pasta and wow! that sauce definitely stood out from any pasta i ever had. \n\nWe are actually going back again this Friday to bring 6 of our friends to try it out... THAT'S HOW GOOD IT WAS! \n\n\nMy friend also said their Ricotta Cheesecake is GREAT! We didn't get to try it this past Sunday but i will not let it pass me buy this Friday though. \n\nUPDATE: I finally got to taste the Ricotta Cheesecake last week and it is definitely a WOW! factor. It was very light compared to traditional cheesecakes and i couldn't get enough. \n\nI want to thank the staff there for their hospitality, they were great! We got the ricotta cheesecake, chocolate cake and biscotti's free in the end of our meal. we were so stuff from all the food and they were gracious enough to throw that in since i told our waiter that it was definitely something i wanted to try.", "author": "Arvee E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-18", "description": "Got to the restaurant about 9 30. No reservation, but the waiter was able to find us a cute table by the kitchen no problem. He assured us that all the ingredients were fresh. Boy, was he spot on!\n\nStarted off with a basket of foccacia bread and a plate of tomatoe pate that was to die for. Excellent consistency and texture, light and a pleasure to the palette. Alton Brown would have creamed himself. He recommended a good glass of inexpensive red wine (nero d'avolo) and salad (pear and walnut). Both were excellent recommendations, and complemented the sea bass and creamy polenta specials very well.\n\nMore on that: the sea bass special was actually a delicious variety plate of froi de mere. Shrimp, mussels, grilled squid, sea bass with the skin intact, as well as a selection of grilled vegetables. The creamy polenta was in an exquisite caramelized mushroom sauce. We were left soaking up the sauces with the remaining foccacia, more out of sheer gluttony and admiration, rather than as a result of inadequate portions. Although my girlfriend and I split the meal and were definitely satisfied at the end (I had already eaten meatballs, spinach and mash from park slopes' Russo's earlier that afternoon. More on that in my profile).\n\nMesmorised, we decided to try out the desert. We got the puff pastry apple tart with vanilla ice cream. Excellent. Although, I will be honest, not as good as the vanilla gelato and dark chocolate torte at Olea. But we are not really desert people anyway. Oh, and we also received complimentary desert biscotti, and we definitely have no apprehensions in confirming, as others have suggested, that it was indeed excellent.\n\nOverall an excellent dining experience, definitely enhanced by the coziness and tasteful decor of the space. I don't want to cheapen my good word, but this was the best Italian food I have had in a long time. Excellent service. The waiter was very helpful, recommended some excellent dishes, and was actually quite charming.\n\nI'll definitely be going back soon sometime in the near future!", "author": "Alex D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-10-31", "description": "Love, this place!\n\nThis place has wonderful ambiance, a warm wait staff and killer food.  The mushroom parpadelle is delicious and craveable.  The desserts, particularly the ricotta cheesecake and best panna cotta ever (drizzled with a nice aged balsamic!) are wonderful and the ambiance and location (right across form Fort Greene park) make it perfect for a both a pre/post BAM dinner or the beginning of a wonderful night out with friends,", "author": "Erica H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-10-12", "description": "Went again at 10pm and they were just about to close. Even though we would be the only one there, they kept the restaurant open for us!\n\nService was amazing and they didnt make us feel rushed at all!\n\nItems to get:\n\nCalamari Fritti E Zucchini lightly fried crispy calamari and zucchini served with spicy sauce \n\nCozze Caffe E Vino steamed mussels in butter and garlic sauce   \n\nFettuccine Fagioli E Cozze homemade fettuccini with mussels, cannellini beans, chop tomato, rosemary in garlic and oil \n\nThe only item we didnt like as much was the Fettuccine al ragu' di Vitello home made fettuccini with veal ragu. Felt like the noodle was too hard (which was odd considering how soft the other noodles were)", "author": "lex s."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-13", "description": "Good wine selection by the glass and appreciate the classy elegance amidst a poor selection on this part of dekalb.  I've been here several times for lunch, when the weathers nice the outdoor tables in the back are really nice, although I think it was under construction so it will probably be even nicer this spring.  The food is consistently tasty, peroni on draft.  Last night I had the trout special with mussels, the cream sauce was deliciously rich and tasted like the ocean.  The bread comes out with tomato flan which is fun light spread for the bread while you wait for appetizers.", "author": "Suzi G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-08-10", "description": "Loooooooove this place.\n\nSo small, cute, cozy, warm, relaxing, and DELICIOUS!\nHome made pasta and home made ricotta cheese cake.\nIt can't get better than that.\n\nPlus, the poeple work there are super nice.", "author": "Kay H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-02", "description": "I had a wonderful dinner here last week. My husband and I walked in off the street. The waitress was clearly stressed because there was a very large party being seated in the front but she was friendly and quickly showed us to a table in the back room which is charming, romantic, and intimate. I love that there was no music playing- so few restaurants do this but the absence of music, or at least loud music makes it feel more like you're at a friend's place. Anyway, I ordered a glass of wine and the fennel salad and the pappardelle with mixed mushrooms. The waitress apologized when she came back around ten minutes later with both courses. She said the chef was very stressed with the large party- I guess he wanted to get both dishes out of the way so he could focus on that. I was like, no problem! Better than having to wait longer for a dish! The salad was fresh and delicious and the pappardelle was HEAVENLY. Thinking about it now is making my mouth water. They also had my favorite kinds of wine on the by-the-glass menu including Nero D'Avola, Chianti, and Montepulciano. For the quality, the prices were very reasonable. Service throughout our stay continued to be friendly and prompt. I hope to come back next time I'm in New York. What a find!", "author": "Rebecca S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-03-01", "description": "I decided to try to give Caffe e Vino another try.  Fool me once, shame on you; fool me twice, shame on me. I had no idea there was a BAM event, but i guess I was unlucky as i came in just as the theater crowd was leaving.  The staff was hustling to clear tables, but multiple people pass me multiple times.  I made eye contact with them multiple times, but no one stoped to ask me if I'd like to be seated.  The staff even had  time to leave their tasks to make sure the door was closed after each person enters or leaves!  \n\nAfter waiting for about 10 min to see if someone is going to even make human contact with me to see if I'd like to be seated (despite now multiple tables being available), I finally made my way up to the cashier and ask \"How long do I have to wait to be asked if I'd like to be seated?!\"  Before I could even finish asking my question, the man behind the register interrupted me and said that they weren't seating anyone for 20 minutes because they needed to clean up.  Um... the tables of theater-goers had left for the theater were already being cleaned (in the 10 min that  was waiting) .  Absolutely unacceptable.  I turned on my heel and left.  \n\nShame on you Caffe e Vino.  If you can't handle the pre-theater rush, HIRE MORE (MORE QUALIFIED??) STAFF!!!!  This was not the first night that BAM had an event and you've had the pre-theater crowd many nights before!  How can you not learn by now??", "author": "N L."}], "servesCuisine": "Italian", "priceRange": "$11-30", "name": "Caffe E Vino", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "112 Dekalb Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/7NZ_1HM1SMNHCZU82Z7TBA/ls.jpg", "@type": "Restaurant", "telephone": "+17188556222"}