{"aggregateRating": {"reviewCount": 309, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-18", "description": "Good food and good service, complemented by an excellent wine list, make this Fort Greene Italian restaurant worth a visit.", "author": "Reid F."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-07-18", "description": "I'd read good things about this Cafe so when a friend visited from outta town, I thought it would be a good idea to eat there at about 3pm on a Thursday. When we arrived, there were two ladies and a man in the entire Cafe. The fellow who attended to us said, \"no you can't sit here\"; I asked \"why, are these reserved?\". His response was sit here by the wall. \"There's no one in here, I don't like this seat\". Well, that's where you can sit. And when I asked to sit in the back patio, he said there was none - though their website says different. I asked if he wanted us to leave and he shrugged. The older man/chef was standing by listening to the entire conversation as we turned and left.\nHow I wish I hadn't taken my guest along. Needless to say, I won't ever attempt to step in here again.", "author": "O A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-22", "description": "Charming little place. I don't know if the a/c was out, but the doors and wide windows were open to the street. So, it was rather warm inside.  The food was excellent, however.  We started with the bruschetta. My wife had the linguini with shrimp which was very light and flavorful-not too much garlic and seasoned just right. I had the lasagna which was good, also-seemed very authentic with veal, but wouldn't order again. Just personal preference. The owner/host was very friendly and attentive.", "author": "Les L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-21", "description": "The service is excelent and the homemade pasta is better than little itally. Ahh the cheesecake is wonderfull experiece. Really a good meal. Enjoy", "author": "Armando B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-02-22", "description": "LOVED the tomato olive oil spread that comes with the foccacia. Great calamari and tried the special, a spicy pork sausage with a cream sauce. Would definitely go back after a BAM performance.", "author": "Lorelei D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-02", "description": "Eureka. Impeccably prepared and tasty without an ounce of pretense. If I still lived in Brooklyn, Id be a regular. Salad greens amazingly fresh. Sauces were tasty but never heavy. And the service was sweet, without any of the theatrics that so many places throw in to scream out: \"THIS IS FINE CUISINE, IN CASE YOU DIDN'T NOTICE! \n\n\"The food spoke for itself, never over-presented or over-designed.  This is one of those great places with high end cuisine that still can proudly qualify as a neighborhood place. \n\nDon't miss the Filetto Di Maiale Al Voldostana, Anywhere else, this is the kind of dish that would be swimming, drowned in oil. AT Caffe e vino, it was incredibly moist, without being drenched.\n\nOne last word about the friendliness: The relaxed almost whimsical friendliness here wasn't some conspicuous strategy. It was simply wonderful staff.", "author": "Steve G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-04", "description": "The food is amazing! :D Service was great. We took the outside seating on a lovely summer night. The bread comes with a pinkish butter-thing that's tomato based. Try it! It's delicious. The bread itself was already nice and flavorful, but the spread makes it unique. \n\nI went for the large pasta thing (not sure what they are called. . . but they are large tube shaped pasta) with Italian sausage. Typing this makes me hungry all over again. Hmmmmm. The sausage was prepared more like a meat sauce than actual chunks of sausages. The pasta came with a salad right on top of it. Thanks for making me feel better before I dived straight into this cheesy and meaty goodness. Hmmmm.\n\nSince we went on a weekend we couldn't use the yelp coupon. But we were still very satisfied with the meal and its pricing.", "author": "Judy L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-15", "description": "Caffe e Vino catered an event for us and they were absolutely incredible. Giuseppe was very accommodating and made planning an event much less stressful. Outstanding service and the food was incredible, everyone was raving about it. Would certainly recommend this place to everyone.", "author": "Nathalie I."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-08", "description": "What an absolutely lovely restaurants and dinner. Not only beautiful atmosphere , one feels like you're having a fine meal in a beautiful Wine Cellar, the food is exceptional. The manager and waitress was so attentive, constantly checking how everything was going. Portions were generous, the calamari is out of this world, served along with zucchini on the same platter. Overstuffed myself but also ordered the pork for dinner, it was joined by broccoli and a potato. The bread, with tomato pate was equally terrific. A lovely evening. I highly  recommend visiting this very fine restaurant, just blocks from all Subway Lines and right near both BAM and BRIC.", "author": "Jan Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-22", "description": "Took my date to this little gem in fort green. \nThe spinach ricotta gnocchi (third one down on the right side of menu) are like pillows of heaven that melt in your mouth. \nMy date got The rigatoni with sweet sausage and balsamic sauce with arugula and he says it's \"man food pasta\"\nHighly recommend for intimate setting with close friends and first dates", "author": "Reetu S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-01-17", "description": "I went to Caffe e Vino last Sunday before a movie at BAM. I had been there once before, a year or two ago, and enjoyed the mussels (no longer on the menu).  This time I had the ravioli special, stuffed with cod and in a tomato sauce.  I asked the waiter if the fish was fresh or salted, and he said it was fresh.  No way.  The stringy texture of reconstituted salt cod, which can be wonderful if prepared with care.  The ravioli were undercooked, both the filling and the tomato sauce (straight from a Campbell's Soup can?) were extremely bland.  Foccacio was cold.\nWith a new chef and new kitchen staff, Caffe e Vino could be a nice neighborhood restaurant.", "author": "amanda S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-14", "description": "This is for delivery only:\n\nthey were really late for delivery and we ended up calling the restaurant about four times to see what was going on.. their delivery guy apparently disappeared so the host was making the deliveries himself... although we were frustrated because we had plans, we felt so bad for the guy.. and he even added a cheesecake to our order for free so everything was pretty much forgiven.\n\nThe food didnt disappoint. My husband got the veal meatballs which he says were amazing (i didnt try it because i dont eat veal) and i had the calamari which was pretty delicious. The free cheesecake was freaking delicious. It tasted nothing like cheesecake; more like a milky custard but was freaking delicious. \n\nDefinitely ordering again but hopefully they found another delivery dude.", "author": "Jane K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-03-20", "description": "First off don't trust anything from the website; there's no 5 course dinner for $25, it's 3. The waiter didn't even know they had a pre-theater menu and when we showed the manager the website he said it was wrong and was rude about it. \n\nThe appetizers were decent. But then more than half the meals were cold! The steak was overly salty, nothing special \u0026 the most expensive! \n\nDesert was the last straw. We got the apple tart \u0026 it was completely burnt on the bottom! Apparently it was the last one and the manager never said a word.\n\nThe one star is only for the appetizers and the server was at least friendly.", "author": "Shannon N."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-12-13", "description": "Food and service were both great.   I will happily go back. \nHowever,  when I examined the bill at the end,  a 20% gratuity had been added.  I was only with  6 people so it's not like we were a difficult large party where adding a tip would be standard practice. \nNo where on the menu did it say that a tip would be added nor did our waiter let us know.  And on the leather bill holder was a post it that suggested tips should be paid in cash. \nWe loved everything about this place but were left with a very bad taste in our mouth.", "author": "Reid V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-21", "description": "My guy and I had dinner at Caffe E Vino last night. It was our first time there and we were not disappointed. The atmosphere was warm and cozy, perfect for date night or an evening with friends. The staff is friendly and inviting. We were greeted with smiles and a welcome and told to sit anywhere we would like.  We had calamari for an appetizer with shrimp linguini and salmon and vegetables entrees. Everything was seasoned perfectly even the vegetables. The food is very good. And I almost forgot we had a very nice bottle of wine. We had a great evening and we will definitely visit again.", "author": "Sharon F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-26", "description": "I was invited here on a Saturday night for a surprise birthday dinner, and glad I've been introduced to this little gem of a restaurant within walking distance of my apartment. We were a party of 14 and they took very good care of us.\n\nThe Malbec was perfect and the tomato paste that comes with the bread was divine! I ordered the Fettuccine and Mussels and loved the homemade pasta, the mussels - of course - and the tomatoes. The meal was wrapped up with a lovely slice of ricotta cheesecake, light and fluffy. Yum!\n\nThe only thing I found a little odd is that when the bill showed up, we were told that they will only swipe two credit cards, and no more. But It wasn't a big deal to run and grab cash nearby.\n\nI'm taking the advice of fellow yelpers and using the Yelp deal and taking advantage of the Yelp check-in on my next visit!", "author": "Shu Jin S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-29", "description": "Came in for lunch with a friend on a Sunday afternoon a few weeks back.  We ordered a fried calamari appetizer and had some panino sandwiches.  The calamari was perfectly fried and very delicious.  The panino sandwich (I had the prosciutto) was what I was looking for (NOTE:  These are panino sandwiches, which is basically a traditional Italian sandwich that is NOT grilled pressed).  We then finished off the lunch by trying  a couple desserts.  My friend had the tiramisu, and I tried the ricotta cheesecake.  Top notch stuff for sure!\n\nThe service was very friendly and extremely attentive.  I look forward to returning, especially to try dinner service.", "author": "Jaszon S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-29", "description": "The restaurant is awesome, the food is tasty und the service very good and polite. \nThe cheesecake was very creamy - the best one ever!!\nAlso the restrooms are absolutly clean.", "author": "Fenja V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-10", "description": "The food was incredible but it was pricey. My boyfriend and I were the only customers\nseated the entire time (it was a Monday night). If the prices were more reasonable, I would return more often. If money is no object, the food and ambiance are worth it.", "author": "Liz C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-01-15", "description": "Today a colleague and I decided we would give this place a try. At 11am we tried to enter the restaurant to grab a bite to eat and catch up , but the business wasn't ready to receive us. A man was in there wiping tables down an hour after the business SHOULD have opened. Instead of welcoming us inside and offering us a table he simply said they weren't open yet. \nNot my fault you guys don't have it together. We went to Cammareri down the block and didn't leave there unsatisfied or unwelcomed.", "author": "Francesca B."}], "servesCuisine": "Italian", "priceRange": "$11-30", "name": "Caffe E Vino", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "112 Dekalb Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/7NZ_1HM1SMNHCZU82Z7TBA/ls.jpg", "@type": "Restaurant", "telephone": "+17188556222"}