{"aggregateRating": {"reviewCount": 309, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-15", "description": "Our go-to restaurant for a quiet, romantic night out in Fort Greene. Delicious food, great low-key atmosphere, good service, surprisingly good music. Not too many vegetarian-friendly options, but the homemade papparadelle is so good that we never minded too much.", "author": "Beth K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-28", "description": "Excellent!! Great service, delicious food, good wine list.  Have been here a few times and have never been disappointed.  A hidden jewel on De Kalb.  From the opening complimentary tomato mousse to their delicious desserts, simply mouth-watering.  The portions are just the right size making it easy to have a three or four course meal without feeling stuffed!!  Excellent!!", "author": "Helene B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-30", "description": "Twice I have gone to Caffe e Vino because I had a craving for broccoli. Yes broccoli. And it is perfect there. It's a simple thing and it's delicious. Still has a nice bite to eat and perfectly seasoned. I am eating it now and wish I had bowls more of it. Can't wait to try a full meal there.", "author": "Rachel E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-24", "description": "Cozy and quaint place with fantastic homemade pasta. Papardelle was extra thin so it didn't feel too filling. Fresh mushroom sauce was outstanding, the veal ragu was also great.  \n\nAppetizers were also excellent. Fagioli and salsiccia with canellini beans was salty and kind of creamy, beet salad had a nice lemon zest to it.\n\nDefinitely going back to this neighborhood gem.", "author": "Matt M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-09-03", "description": "The wait staff was really friendly until I mentioned the Yelp Deal. I never get why restaurants promote their business via Yelp Deals, Groupon, etc if they're going to be mad when you use it. Any-who, my friend and I ordered the Fried Calamari and Zucchini and Panino Romano (grilled chicken breast, guacamole, and bacon). The \"panini\" was not a traditional panini. It came with a very small bunch of fresh greens in balsamic on the side of the plate. The flavors were good; however, the bread was very dry. The amount of guacamole needs to be increase as to make the sandwich more moist. The calamari was salty and not of the best quality, but the sauce was spicy and flavorful. The zucchini was sweet! P.S. the waiter completely forgot to give us the complimentary bread before the meal.", "author": "Shari S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-09-03", "description": "Hmph.  I live a block away from this place and was trying very hard to like it/make it my new go-to spot.  Unfortunately (even with the $10 for $20 Yelp promotion that was running) this place was not worth my time or money.\n\nI will say that the waitstaff is very nice and it felt like a family run establishment (leading me to be very nice, despite my growing disappointment); however, this just doesn't seem to be cutting it since my table was the only one in the restaurant at 7:30pm on a Friday night (yikes)\n\nWe started with the complimentary bread and garlic jello-like stuff.  It was actually pretty good, and I optimistically ordered the antipasti and fried calamari to start.  Calamari was very good - fresh and lightly breaded.  Antipasti...could use some work on the presentation, and while the meats were good, the cheeses seemed like they came from my fridge back at home.  \n\nThe main courses were where this place really fell apart for me and made me want to never come back.  My arugula salad was not dressed at all, and I could literally taste the staleness from it having sat in the fridge too long.  My date's fettucine with ragu sauce had noodles that were also stale and sticking together in clumps.  Maybe it was a tough night for Caffe e Vino, but I won't be back to test it again...", "author": "Christina Y."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-07", "description": "Amazing service and food. I have been here three times and each time I loved what I ordered. The atmosphere is also very nice, cozy and romantic. I would recommend this for a special occasion dinner like Valentines Day.\n\nPrice is a bit high for Brooklyn, but I guess that is to be expected these days.", "author": "Amanda S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-29", "description": "We had a really nice dinner here on Friday night. We had a reservation for 7:30, and this cozy little place started filling up fast. I noticed everyone was greeted with a \"Buona Sera!\" and, if they didn't respond to the Italian, a nice \"How are you this evening?\" The service was good, especially since they were packed. And we didn't feel rushed at all. We ordered the spinach budino to start, which was a savory spinach flan in a tasty buttery sauce, great on it's own or with the warm bread from the bread basket. I had the paparadelle with mushrooms. The home made pasta was perfect, the mushrooms creamy without being too rich. My husband had the fish special with was nicely cooked. We had room for the panna cotta (barely) which was silky perfection. The staff got it just right, friendly and attentive without being overbearing in the least. We'll definitely go back.\n\nA", "author": "Amanda R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2010-12-29", "description": "The place is very quaint and pretty. \n\nHowever, the service and food was below par. \n\nMy husband ordered the steak.  We were so busy talking, that when it turned up we realised the waiter had not asked how he would like it served. It turned up rare and bloody. Meat was fatty and chewy and he left nearly all of it. When the waiter collected our empty plates, he ignored the fact that my husband had left all the meat on the plate. Steak came with a few rocket leaves and nothing else. \n\nI had the seafood linguine. Shrimps were cooked well, but the pasta itself came with nothing than a bit of oil and some zucchini. Very disappointing. \n\nToo expensive in my opinion for the less than mediocre food.\n\nThe restaurant was FREEZING cold. Yes, there was a blizzard outside, but everywhere we had been that evening was nice and warm. \n\nStaff were really not interested in providing good service. \n\nOnly nice thing was the decor of the restaurant.", "author": "Sam H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-17", "description": "Brunch was very good, I had baked eggs, my gf had a frittata, both were tasty, and well prepared. Great service, nice decor, the place was clean and neat.", "author": "Diego Z."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-20", "description": "Had dinner there last week and was very pleased by the quality and fast service. The place was packed and the energy of the staff made the experience perfect!", "author": "Sal M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-03", "description": "Came here for brunch on New Year's Day after reading the great yelp reviews.  We actually missed the proper brunch, but had brunch items off the lunch menu.  \n\nHere's the short review:  Everything here, even the water, is amazing.\n\nThe five of us ordered various delicious egg-related dishes, omelets and benedicts and can't remember what else.  Each came with yummy breakfast potatoes and well-dressed salad and was priced around ~$10.  The tap water was, for some reason, exquisite.  Coffees were rich and well made (americanos \u0026 espressos). We also ordered a ~$30 bottle of sparkling that hit the spot as well.\n\nThey gave us free biscotti with our check too.  Highly recommended.", "author": "Dave R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-19", "description": "My wife and I celebrated our 10 yr anniversary here and we couldn't have picked a more perfect place.  We were married in Italy and this kept the tradition going strong.    Each dish was better than the previous, from the fagioli app to the home made fettuccine.    Even the limoncello was superb.   The wait staff was phenomenal and helped make our night even more special.", "author": "Paul E."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-05-21", "description": "Possibly one of the most disappointing meal I've ever had.\n\nOk, perhaps it's not fair that I start off my review with that. I was very hungry at the time and was craving Italian food, so it just made the meal that much worse.\n\nAnyway, the place is cute. My friend and I went for an early dinner and sat outside. The bread and calamari appetizer were delicious, so I was expecting an even greater entree. I got the ravioli of the day which was stuffed with crab meat and something else that I can't remember, and it ended up tasting like a chinese spring roll drenched in pasta sauce? It was just so...bad. I didn't understand. My friend got the gnocchi, and it was so chewy and horribly flavored. \n\nI definitely would not recommend coming to this place. I ended up paying $30 for one of the worst pasta dishes I've ever had in the city. Majorly disappointing. There are so many other restaurants to try in the area. I suggest trying out one of those.", "author": "Maureen D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-09", "description": "Excellent food and outstanding service! Often difficult to find these days but very evident at Caffe e Vino. My wife and I were town for a short visit to attend a wedding and considered several other options, only to land at this wonderful little spot...twice the same weekend. Next time in town, we'll visit again!", "author": "Rick E."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-02-14", "description": "I agree that Caffe e Vino deserves a 4 star rating for their food. My roommates and I thought our entrees were delicious but I would never come back to this establishment again. No amount of good food will wash away the taste of discrimination. This is a great example of how a restaurant with solid cuisine can lose business due to poor customer service. \n\nThe three of us decided to have a girls night out for V-day and found Caffe e Vino on yelp. Yelp also advertised a $10 for $20 deal on the webpage which we purchased. We arrived a few minutes early for our 7pm reservation and we were seated at a make shift table next to the door. It was literally a picnic table with a white table cloth over it. Every time a patron left, they would knock against our table or us and a gust of cold wind would blow into our faces. The door never closed completely so one of my roommates was a doorman for a good 30 minutes before the finally moved us to a table inside. At one point it was like a clown car, 35+ people must have left the miniscule restaurant at the same time, each of them letting in the winter wind. One guy even knocked over all our glasses. I wished one of us said aloud what all of us were thinking - \"Let's go somewhere where they'll appreciate our business.\" At 7:40pm we were finally moved to a different table. Common sense says, \"Don't put a table where there is a lot of foot traffic.\" DUH.\n\nAlthough the owner/manager and the servers were apologetic, I noticed there was big discrepancy in the way they treated us. We are three younger casually dressed females and I felt we received sub-par service as a result. The bread we were served at the first table was stale. They never offered to take our coats even though I saw them offer that service to the other customers. What irked me was how the parties that arrived after us were seated before we were able to switch tables. We requested another table maybe 5 minutes after sitting down and realizing the situation. It obviously wasn't a priority for them even though the three of us had been sitting there for half an hour. \n\nThere were many opportunities for the management to make it up to us - maybe a complimentary dessert or glass of wine but they offered nothing. In the end, we were told our Yelp deal was not valid on Valentines Day (it never mentions anything of the sort on the certificate). Needless to say, I lived up to their expectations of being a lousy tipper tonight.\n\nEDIT--2/20/12:\nSo someone messaged me claiming to be a \"regular\" and threw a few insults at me calling me lonely and sad. Well I have one thing to say to that. How about the management here, improve their customer service skills instead of creating fake Yelp accounts to attack customers??? By the way, your English is poor, in person and in writing.", "author": "Vanessa T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-12", "description": "I walk pass this place like everyday. Mostly because of a busy work schedule. I get the usual 1 hr for lunch and I usually go for the quick bite and back to work routine. I've tried almost every restaurant on that particular block except for this one. Little that I know that this place serves excellent food. I had the ravioli with spinach and walnuts and a special sauce when I went there. The waiter was great and the atmosphere was so relaxing. Yay to me because I have a new to go spot for my 1 hr lunch break!", "author": "Keron J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-02-23", "description": "Instead of going to No.7 http://www.yelp.com/biz/no-7-brooklyn#hrid:fWF8_SjtdiyMTgpLYhwxbw, I decided to see what Caffe e Vino was all about and finally check it off the long-belated to-do list.\n\nAwesome.\n\nNot quite as good as Locanda Vini e Olii http://www.yelp.com/biz/locanda-vini-e-olii-brooklyn#hrid:jWB7WBPV5smxd0o68JTB7w, but if you don't want to trek all the way over to the Bed-Stuy border of Clinton Hill, Caffe e Vino will more than suffice.\n\nThe Arugula Salad was superb: earthy, zesty, refreshing, and appetizing.\n\nThe Stuffed Chicken was ridiculously good.  Just go and order it right now.\n\nThe Rigatoni and Eggplant dish really hit the spot, cooked al dente with big chunks of fresh mozzarella.\n\nYes, and Chocolate Mousse was very very very satisfying.\n\nNo doubt, my caloric intake was off the charts, but it was definitely worth it.", "author": "Arthur O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-05-29", "description": "We did the fennel salad, the eggplant rollatini, and the pasta special (homemade fettuccine, spinach, artichoke, sausage, roasted cherry tomatoes).  Frankly, the food and service were both flawless; I wouldn't change a thing.  Portions were an appropriate amount of food.  Prices were a bit high, but I thought it was easily worth it.", "author": "Jimmy O."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-04-04", "description": "The decor and restaurant was beautiful, intimately lit with candles. The host graciously greeted me when I arrived early, and the service was wonderful for the most part. Unfortunately, the food was meh. For the area, I guess it's a decent tiny Italian joint, but I've had better. The sundried tomato spread they served with the bread before the meal was better and tastier than my entree. My friends and I all ordered pasta dishes and they weren't particularly memorable or flavorful, even with the handmade pasta. The benches against the wall make for tight uncomfortable seating for people with ample rear ends. The desserts took a while to come, but the lemon marscapone cake was to die for. Overall, an okay experience but not sure I would go back.", "author": "Queenie M."}], "servesCuisine": "Italian", "priceRange": "$11-30", "name": "Caffe E Vino", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "112 Dekalb Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/7NZ_1HM1SMNHCZU82Z7TBA/ls.jpg", "@type": "Restaurant", "telephone": "+17188556222"}