{"aggregateRating": {"reviewCount": 309, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-11-20", "description": "Ate here before a show at the BRIC with a party of seven. Incredibly skimpy servings. Not incredible flavors. What really ticked me off is that when they gave me the bill, it wasn't itemized and the tip line was left blank. I didnt know they had added an 18% gratuity and subsequently I added another (20%) tip. They didn't bother to make me aware of this and I only figured it out later. Everyone in my party agreed the portions were really small especially for what they charge. -- Wow, just read other reviews for this place that all describe the tip scam they run. Pretty despicable (and dumb) for a restaurant...", "author": "jeff w."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-04-09", "description": "Went last night with a party of 5 and ordered family style.\nThe service was great..the food was cold.\nHonestly..the food came out and was cold...I didn't know that could happen anymore.\n\nWe had : \nEggplant involtini- good if it were HOT.\nSalad with pears and blue cheese- pretty good\nBeef carpaccio appetizer- no flavor\nMushroom papardelle- sauce could have been from a can\nLasagna- yuck\nSpecial ravioli- again good but COLD\nStuffed lamb chop- fatty and full of grissle so no-not good at all.\n\nToo many other good places to try so will not be back.", "author": "Juliana S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-10-02", "description": "Great brunch spot - luckily found this on Yelp before seeing richard III\n - Right around the corner from BAM\n - Food is excellent \n - Our waiter was apparently clairvoyant, my finicky father described some obscure food interests and they made something specifically for him that he loved!  Big thumbs up for this place.", "author": "Gerri D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-15", "description": "il cielo Italiano! Found this cafe on yelp while on a business trip and couldn't be happier. Truly felt like I was back in Italy! Romantic ambience, personable service, amazing food. The salmon was flown in fresh!!", "author": "Sarah B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-18", "description": "Homemade pasta, cozy decor, lovely staff.  We walked in early for dinner after catching a matinee theater performance at BAM around the corner.  We were seated immediately in the back dining room, which had a beautiful skylight.  We had the calamari app - light and crispy - and the pasta specials.  The tomato sauce on a plate of homemade broccoli \u0026 ricotta ravioli was light and surprisingly creamy.  My partner had spinach linguini with pancetta and peas, which disappeared quickly, so I think it was pretty good.  Also, the tiramisu was incredible.  A great little spot for a date or a pre/post-theater dinner.  Definitely on our favorites list!", "author": "Jennifer R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-26", "description": "Great Italian food and excellent service near BAM. You will get to the show sated and on time. Make sure to make a reservation or you risk bring turned away.", "author": "Sarene S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-22", "description": "Cozy \u0026 romantic atmosphere. Definetly feel a different vibe when ur walking outside trying to find the place.\n\nOrdered the Buffalo Mozzerella for appetizer. Really good!\n\nHad the Linguini with clams and my friends had argula salad and salmon. Pretty good. You could feel the food wasn't rushed in preparation.\n\nSurprised at the well-cooked shrimp and salmon. \n\nWould definetly go back =)", "author": "Aaron I."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-17", "description": "Delicious homemade Italian food at a great price. Super cute space - warm and inviting. Would definitely recommend the pasta with veal ragu, as well as the meatballs. Minestrone soup was fantastic. The food also does well as takeout. Highly recommend this great neighborhood spot.", "author": "Mark K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-28", "description": "Everything we wanted. I wished I could have stayed longer but my pasta came out in ten minutes and we ate it unusually fast because it was authentic, home made and delicious. Our waiter was courteous and forgot nothing. After so many disappointing experiences with expensive restaurants in the area, it's nice to find a place that gets it right.", "author": "Danielle L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-21", "description": "This is one of our favorite Italian restaurants with a real Brooklyn feel.  It's a small, intimate place, perfect for date nights or small groups.  Everyone is so warm and friendly there, making you feel comfortable during your time there.  Every pasta we have ordered has been fresh and rich in flavors.  Our favorite dish is the balsamic reduction pasta, but we've also had their gnocchi and other dishes.  No doubt that whatever you order, you will love!  We'll be back again and again!", "author": "Melody L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-04", "description": "It was a great meal and great service. We got there early before our reservation, but were sat promptly. The door was an issue on a cold January night, but that is okay because the food made up for any discomfort. This was a great dinner for our family from out of town.", "author": "R B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-09-25", "description": "We are so dissatisfied in our meal.  My family and I ate there today and as an Italian American I can tell you the owner thinks he can fool his customers.  My husband and son ordered paninis and they were not served warm pressed,  instead the meager amount of one slice of prosciutto and store bought mozzarella was placed on a cold piece of day old bread.  I asked for burrata cheese and the pompous owner tried explaining what burrata is.. hello if I didn't know I wouldn't have ordered it but then explained to me that he doesn't have any burrata only fresh buffalo mozzarella.  Suddenly he leaves the restaurant and comes back with a bag and just like that he has burrata.  Problem is that burrata is supposed to be served FRESH and at room temperature so one can appreciate the soft texture.  This was bought from a nearby deli therefore not homemade and the consistency was cold and way way overpriced.  As I stated earlier the owner thought we just fell off the turnip truck and I would never go back there.  Also a very strange mildewy smell hits you in the face and remains as you fine.", "author": "Teresa B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-11", "description": "I live right around the corner from this place and have probably passed it a million times without ever thinking of eating there. It is in a weird location by the hospital and a bodega and random take-out places. \n\nHowever, last week my friend suggested that we try it as I was in the mood for Italian food. When we arrived every table was occupied except for one (lucky us). When our waiter asked us if we were going to see a show at BAM, we realized this was a popular pre-theater spot.\n\nThe menu had some really tempting choices and then when we were told the specials we were even more overwhelmed with decisions. \n\nWe started with wine by the glass which was surprisingly good as I find most by the glass wines to be pretty awful.\n\nWe then split a calamari that was out of this world. It wasn't greasy at all which I truly appreciated.\n\nI then had the Mushroom Pappardelle...Yummy\nMy friend had the rigatoni and was already talking about bringing her husband back.\n\nI love this place and Italian is my favorite so I will be back and I hope it is as great as the first time. I would go back just for a glass of wine and the calamari!\n\nAlso great service!", "author": "Kendra J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-18", "description": "Nice italian about a 5-10 minute walk from BAM.  Not standard menu but variety with some different and interesting dishes. Food was very good to excellent. Narrow space with front and back rooms. Very cozy.  Good service.", "author": "David B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-02", "description": "I came here last year with a few friends and loved it, so I had to go back when I travelled to NY this year.  It is a smaller restaurant with a candlelight atmosphere, which adds to the whole experience.  Appetizers to dessert everything was awesome.  They started off with a tomato paste thing with bread.  We had the spinach souffle which was also very good.  The main entrees at the table were veal, steak and pasta... all were delicious.  We ended with tiramisu and chocolate muse cake and dessert wine on the house. \n\nThe waitress was extremely helpful and both visits, they allowed us to hang out for a bit after the meal.  Must go when in NY.  It's worth the subway ride over!", "author": "Trisha G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-19", "description": "Overall very strong and tasty Italian food. I had ordered the gnocchi (at 7 pm on a Wednesday night, mind you) but they were already out. I was instead recommended the spinach ravioli which was delicious but was a whopping $16 or so for only four large pieces which I found pricey. Their tiramisu dessert  was, however, delicious.\n\nVery friendly wait staff though they follow the European practice of not bothering you until you ask for the bill (which is nice but a little difficult when you're trying to get the bill and they're nowhere to be found). \n\nThe ambiance of the place is also nice. Overall, everything was good, I just found their prices steep, especially for a Brooklyn restaurant.", "author": "Zo-ee C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-02-21", "description": "Visiting a friend in Brooklyn, we were searching for a nearby family-style establishment to get our carb on before a night of drinking. My dining companion was intrigued by the photos of Cafe e Vino, as well as the $10 for $20 yelp deal.\nSo, we made our way there last Sunday evening.\n\nFirst thoughts: I dig the dim candlelight, brick walls, and plethora of Italians dining there-- we were the only Americans, so I knew the food had to be good.\n\nA Yelp check-in also promised 10% off the wine list, but wine by the glass was pricy, so I opted for a beer instead. Points for having Peroni on draught, even though it's actually not that good.\n\nWe opted for a chicken and spinach dish and a rigatoni with sausage. My entrée (the latter) had a unique flavor (balsamic added an interesting dimension to what might have otherwise been a pasta in meat sauce), but I would have liked larger pieces of sausage.\n\nWe were in no hurry to leave, but the service could have been speedier-- specifically when we had asked for the check, and then, after payment was made.\nBut, our delay was rewarded when we were delivered two glasses of Prosecco, on the house. Lovely, and much easier to swallow at a $0 price tag than the menu's $11!\n\nAlas, my Yelp love can't be won by bribery (but the free wine was very nice). \n3 stars. Come for a lovely romantic meal, but be prepared to splurge a little; my stomach would have left happier had I ordered an appetizer too, or dessert, or both. Burp. Yum.", "author": "Allison R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-02-21", "description": "False advertising. Got the Yelp promotion, $10 for $20. Me and my roomies decided to have a girls night out, on V-day. I thoroughly read the terms and conditions of the deal and nowhere did it say that it excluded any holidays, perfect!\n\nSo, we get there and they seat us directly by the door. There was a lot of in and out, as there were a lot of guests. It was really cold that night... so you see where I'm going with this. It was really miserable and freezing. When guests left, the door didn't close all the way so I had to keep closing the door behind people so that our menus wouldn't go flying off and so that we wouldn't turn into icicles. One guy that was leaving actually knocked down all of our glasses. They brought us bread, that was a little less than room temperature to begin with, so with the cold air coming in, it was even worse. The tomato flan was actually pretty good. \n\nAlmost an hour later, after being told about 6 times that they would.. they finally moved us. While our experience improved almost 10 fold when we got to the new table, and the food by itself would have been a 5, the overall experience was crap.  To top off a horrible dining experience, when it was time to pay... they told us that we couldn't use the deal, although the terms made no mention of any restrictions and CLEARLY says that the restuarant was not allowed any add-on rules. I plan on reporting this to yelp and getting my money back. \n\nHonestly, this place has potential to be a 5 star (food alone) but with the lack of customer service they showed... I don't plan on ever going back. There's simply too many other Italian restuarants in New York City to choose from. Get it together Caffe e Vino!", "author": "Marla B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-28", "description": "We (parents \u0026 I) arrived early on Thanksgiving day - 4:30pm - and had the place to ourselves along with the attention of the wonderful waiter. We started with appetizers--sausage and sautéed spinach and pumpkin soup specials, and the antipasto--and then moved to fish stew in a tomato broth, veal meatballs (which were delicious but only came with 2) and amazing homemade eggplant and goat cheese ravioli (also a little on the small side, about 6). The meal finished with dessert, of biscotti tiramisu and chocolate torte cake, and cappuccino. We highly recommend Caffe e Vino. A romantic spot, especially if you are in ahead of the crowd, or just a lovely, small spot where the Italian food is impeccably prepared.", "author": "Ben K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-10-02", "description": "My boyfriend took me here on our first date. Let's just say that all the dating rules went out of the door because I ate like a horse and had NO shame about it either. That is how good the food was.  I even ordered desert . Don't judge me.\n\nThe place is tiny. I am sure it is a place that you pass by all the time and do not even bother to go in.  I consider it a hidden gem.  If you are the claustaphobic type I still tell you to give it a whirl because it is worth it. The waitstaff was sweet and made you feel comfortable especially if you are not too familiar with Italian food.\n\nI ordered the ravioli and for desert tirumasu. Both are to die for. I can't recall what my boyfriend ordered and frankly I didn't care because I was too busy eating. \n\nI seriously believe that the food here bought my boyfriend a second date.......okay not completely but by alot........", "author": "Lady k."}], "servesCuisine": "Italian", "priceRange": "$11-30", "name": "Caffe E Vino", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "112 Dekalb Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/7NZ_1HM1SMNHCZU82Z7TBA/ls.jpg", "@type": "Restaurant", "telephone": "+17188556222"}