{"aggregateRating": {"reviewCount": 309, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-12-07", "description": "Had a fun group dinner here to celebrate with some friends. \n\nThe complementary focaccia could be a bit more herbaceous, but it comes with a very flavorful tomato basil flan, which adds a great bit of flavor to the bread.\n\nWe had bruschetta, polenta con fungi, and calamari. All three tasted very good. The calamari was very nicely seasoned, especially after the waiter added the fresh ground pepper. Polenta was a nice texture, not too firm or liquid, with savory notes from the mushrooms. The bruschetta had some very nice burrata, which was very silky.\n\nI ordered the Filleto di Maiale, which was also overall quite good. Strong garlic flavor in the spinach and a good pepperiness to the scallopini. The dish wasn't particularly surprising in anyway, but a solid meal.\n\nFor dinner, we had the tiramisu and panna cotta. Both were very good. The tiramisu had a rich coffee flavor, and the panna cotta was memorably good because it was actually quite subtle in its sweetness, with a texture almost similar to the burrata. Very silky, which was made even more prominent by the restrained use of sugar. Highly recommend giving that a try.\n\nThe venue is very rustic and quaint. Low lighting and very warm. Staff was also quite accommodating of our group. Had a very nice time.", "author": "Mike L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-05-28", "description": "I was really craving handmade pasta and deferred to my brother for suggestions in Brooklyn. He recommended checking a place in Fort Greene he was meaning to check out. Once we arrived, he realized Caffe E Vino wasn't the one he was thinking of, but we checked the reviews and people seemed to be pleased. Perhaps my first red flag should have been the Comic Sans font on the wine list on the back. The server was polite enough and efficient himself, though it took about half an hour for the entrees to arrive. The sauces and seasoning on the pasta dishes were tasty, though the pasta itself was lacking in the two dishes we had.\n\nSalad - Fairly basic combination but fresh ingredients. Overall, the flavor profile was not well balanced, leaning towards too bitter and acidic. Goat cheese is already tangy, it really needed the orange slices to bring it together. I would suggest adding nuts to round it out.\nGnocchi - The texture was off, which I believe was due to the size, being shaped too big. Gnocchi shouldn't be so large that you have to slice through it. Cutting through it stuck to my knife and revealed an inner texture too thick, gummy, and undercooked akin to mochi or glutinous rice based dishes Asian cuisine, and unfortunately as unassertive in flavor as well. The gnocchi were bland and the flavoring lied heavily reliant on the cheese and herb piled on top.\nPappardelle - The noodles were inconsistent in texture and thickness. The mushroom sauce was tasty, though rich and heavy.\n\nI liked the complimentary tomato flan, which I found to be the most enjoyable part of the meal, and the bread, though it was on the stale and dry side. Overall, I found the meal to be unremarkable given the price point and stiff competition on the scene. The pasta dishes were a miss, and combined with the wait to get served, I'm unlikely to return.", "author": "Truc N."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-02-12", "description": "Never order delivery from here - the pasta sat so long it stuck together, the chicken was cold and chewy, and the cold antipasto appetizer I got was either sitting on the heating rack or tied into a bag while the other food was still hot. The cheese melted, the olives were half cooked, and the meat also appeared half cooked. I had to throw the whole thing out right away due to the smell. Very disappointing, especially for the price. Restaurant blamed GrubHub for the slow delivery (took close to 2 hours), but I was told since it sat for so long my food was remade. I seriously doubt that based on how it came. When I contacted GrubHub about the issues, they stated the restaurant refused to issue a credit or refund.", "author": "Erin C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-02", "description": "Came here on a Friday afternoon for lunch and ordered linguine with shrimp and zucchini which came in and an olive oil and garlic sauce that was really tasty. My friend got the gnocchi which I tried - it was pillowy heaven. The food also came out super fast...we're talking MAYBE 5 minutes. So that was a nice touch especially since we were starving. We both basically licked our plates clean even though the portions were really generous.\n\nThe vibe is your usual quaint Italian restaurant with little bits of flair brought over from the motherland. Food is tasty and the service is good, plus the location makes it easy to get to from multiple areas. I'm definitely going to come back and try something else!\n\nThere's a black hat with white writing over by the kitchen that says 'cash only', but that's not true. They accept credit card (even American Express).", "author": "Naomi Z."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-09-24", "description": "Pretty mediocre Fort Greene spot. I have passed the restaurant for years and always noticed that it was full so decided to check it out. In my opinion, the food was average and the prices were expensive. I went as a group of 4, we got 2 pastas, 2 fishes and 3 glasses of wine and our meal came out to over $40 pp which is fine for a good nyc meal, not this was just okay. There are much better Italian places in the area - la rina, forno rosso, etc. so I'd recommend trying one of those next time", "author": "Rachel M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-17", "description": "I appreciated such prompt and professional service in a quaint and rustic environment.\n\nOur young gentleman server made a thoughtful wine recommendation to pair nicely with the fish special. \n\nThe homemade tiramisu and espresso were the delight finale to the wonderful symphony of flavor that was our meal.\n\nNiles an I will be back.", "author": "Frasier C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-17", "description": "Great pasta and better service. Been coming back every few months for the past year and a half and I've always had a great time. \n\nThe sun-dried tomato spread and bread is among the best free appetizers I've had in recent memory.", "author": "Steven P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-15", "description": "This is an Italian place with good pasta dishes. The food is good, but the place may not be the coolest one, is more a classic one, and the service is sometimes too slow.", "author": "Julia S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-23", "description": "The food here is so divine! Not your average Italian restaurant. Every item here tastes like it's made from recipes that have been passed down for generations. I loved the bread and tomato butter so much that the waiter kindly brought me an extra portion, for no charge, just to take home. I have never had a tomato butter like that before. The ricotta cheesecake is to die for! I could've eaten an entire cheesecake, it was so good. This place left me drooling and wanting to eat more (unfortunately, I ate my fair share and my stomach was soooo full by the end). \nThe atmosphere is so rustic and you feel like you have stepped into a little Italian world. \nThis place is so fantastic and so worth the price. I highly recommend eating here!", "author": "Renuka J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-21", "description": "The ambience and decor here is so rustic and chill and the specials were all very delicious.  The only reason I don't give it 5 stars was everything was just a bit salty for my taste. Great date spot. Cash only.", "author": "Allana D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-11", "description": "Really cute Italian spot in Brooklyn. Excellent service and great food. You can bring your own bottle for a corkage fee. I came with three people and we had:\n\nCalamari fritti e zucchini\nLinguini con gamberetti\nFettucine al Ragu di vitello\nRigatoni con melanzane: I normally don't like eggplant because it gets super mushy however this was cooked perfectly\nTiramisu", "author": "Jessica K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-02", "description": "This place is awful.  Totally not worth the prices AT ALL.  I was thoroughly disappointed with the food, service, ambience, EVERYTHING!  They also forgot our wine and then charged us for it.  Bread had to be asked for, then given reluctantly.  Ugh.  Food was subpar at best.  Certainly not worth $20+ per pasta plate.", "author": "Reya H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-21", "description": "Second time we've been to this gem. Convenient for a pre-show meal near BAM, everything about this restaurant pleases. The staff is super friendly and helpful. The ambiance is wonderful and the meals are excellent. We had the salmon and branzino for our mains, starting with a wonderful broccoli soup and spinach soufflé. The torta della nonna capped off an exquisite meal. Absolutely recommend it and we'll be back next time we're in the area.", "author": "Gary S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-11-06", "description": "Had dinner there with a friend before the hockey game. If you're going to the Barclay Center you have to try this place. Especially if you're driving since there are 2 parking lots within 50 yards. The food was great, so was the wine and the staff are a delight. I will be back.", "author": "Donald M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-18", "description": "Great atmosphere. Small but quaint interior. Authentic Italian cuisine sauces were perfection. I have the shrimp fettuccine and it was excellent. If I lived here I would go back often.", "author": "Guy J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-17", "description": "Talk about hospitality! We've been wanting to try this place since we moved to the neighborhood and finally did on a chilly January night. The service was so kind and thoughtful. It was truly a pleasure. Not to mention the food (loved the pork and the ricotta cheesecake!)", "author": "Leigh W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-11", "description": "Great find! Everything was delicious. You can't beat fresh homemade pasta! Everything was super fresh and authentic. The desert was great as well.  For sure I will\nbe back.", "author": "Steven S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-06", "description": "I organized a celebratory dinner for a bunch of high school students at this place and I really have to commend the restaurant for handling it so nicely. They were very easy to communicate with and get a quote from over the phone. I had spoken to Guisseppe initially to inquire about pricing, but then actually made the reservation with someone else (Guisseppe was on vacation) and there were no problems honoring the price/menu/etc. that Guisseppe had initially quoted, which I find to sometime be an issue when planning something for a group with multiple people in an establishment. They called to confirm day off, and didn't ask for a down payment/credit card in advance which was nice. Initially we had asked for the private room in the back, because we expected that we might be a little noisy and didn't want to bother other patrons, but apparently something in the back room broke the day of our event and they set up a table for 22 people in the front dining room without any problem. They had a couple other couples come in for dinner while we were there and I noticed that their food came out quickly, despite us being there. I felt that their pricing was fair, and I appreciated that they got the bill right. The décor is very old Italian restaurant, nothing to write home about, but fine. Service was very friendly and pleasant, they got everyone's order right, and food for 22 people came out in a reasonable amount of time and basically all at once. They lose a star for the food itself, it was just fine. We did a menu of soup or salad and chicken or vegetarian pasta. They brought bread out at the beginning of the meal and it was GOOD. It came with a ??red pepper?? butter that was very tasty. Frankly I could have happily eaten a loaf of the bread. The salad was fresh, the soup looked good but I didn't get a chance to try it. The chicken was very plainly grilled and came with plain veggies but no starch, I feel like I have made better chicken breast at home though. The pasta was nice, it had eggplant, tomatoes, and cheese, and I noticed that they modified it for some of the kids by not adding eggplant without any issue. But thinking that the pasta here was made in house, I think I expected the pasta itself to be a little better. Honestly, I would try this place again, because I really appreciated the service and my guess is the food would be substantially better if not being bulk ordered; but, if the food was the same for a normal dinner I probably wouldn't come back a third time.", "author": "Nicole B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-20", "description": "Great family Italian restaurant in Ft. Greene.  We have been here several times and have never been disappointed -- great quality food.", "author": "Scott T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-25", "description": "Best Italian I've enjoyed in a long time! Ravioli of the day was perfect. Nice ambiance. Delightful cheesecake and coffee.", "author": "Vicki T."}], "servesCuisine": "Italian", "priceRange": "$11-30", "name": "Caffe E Vino", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "112 Dekalb Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/7NZ_1HM1SMNHCZU82Z7TBA/ls.jpg", "@type": "Restaurant", "telephone": "+17188556222"}