{"aggregateRating": {"reviewCount": 309, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-17", "description": "The French toast is to die for. It's filled with strawberries and perfectly textured cream, and it's crunchy on the outside. Also the table bread is remarkable. Great for large groups! Service is super friendly!", "author": "Krishnan M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-04-21", "description": "Went to this place last night Friday April 20th a friend suggested it because it was some what close to Bam, we all felt like we just got played, hustled, we were taken for suckers it's the type of place that you would be told by the hotel if you were in Italy to stay away from because it's a tourist trap, let me explain first off not the friendliest staff, also no place to hang your coat, the waiter tells you the specials I had the chicken parmesan. special I didn't feel it was necessary to ask the price since the most expensive chicken dish on the menu was 14.00, the food arrived we were a table of six they brought a dish that we did not order they got the order wrong, but the waiter insisted that the guest was wrong and this is what she ordered, to save time to get to our show she took the mistake, as I was still enjoying my very small chicken cutlet and yes to be fair it was tasty, the waiter started clearing the table really I thought maybe they needed the plates, we finished up and got our check, we were shocked at the price of our bill , were we in Fresco ? upon further review we saw the specials prices my little chicken cutlet was 35.00 yeah 35.00 for chicken parmesan, so was the fish special, it came to 65.00 a person splitting the bill 6 ways, so my meal was an appetizer of the smallest plate of Calamari ever a Chicken parmesan that I could get in any pizzeria in NY, and a diet coke, and even the diet coke was one of those little six ounce bottles, but reviewing the check further we realized it wasn't going to be that much a person because they added a 20 pct gratuity, that they didn't bother to mention. All in all it was OK food on Dekalb Ave. in Ft. Greene, but I think they are sneaky and took us for fools, I will not be back.\nI would like to end by saying this is my first time ever writing a review on yelp, I am not the guy that runs home to complain on yelp, I had previously worked many years in the service industry I know what it's like to wait tables, I am lucky enough now to spend more time being waited on, I treat my server with respect, I over tip, some of my favorite places I even tip my regular waiter with an envelope of some cash for Christmas, so you see I am not your average yelper who may have had his feelings hurt and wants to be vindictive, I would much rather be doing anything else than sitting here hitting buttons on my iPhone, but I just felt like they conned me and took advantage. Seriously steak on the menu is 19,00, but a little chicken parmesan. when called a \"Special\" is 35.00, that's a b.s. move that is played by sneaky shady restaurants, my next trip to Brooklyn will not include a stop in this place, just not nice.", "author": "Doc D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-11-08", "description": "We decided to have dinner here before a show.  The establishment honors a BAM discount which was nice.  \n\nFood was ok.  We shared a pasta as an appetizer and that was the best thing we had.  Our entrees were extremely salty to the point that we could not eat them.  \n\nMaybe they just had an off night but with so many other great restaurants in the area, I will try a different one next time.", "author": "Suzanne T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-04", "description": "My wife and I had a most incredible evening of delicious Italian food in an intimate, quaint atmosphere. Every course was a new culinary delight. We happened upon it by doing a search for restaurants near our hotel and were very pleasantly surprised. Would certainly recommend!", "author": "Steven F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-17", "description": "what an amazing find.  my wife chose this restaurant to eat at before our NYC half Marathon.  authentic Italian was amazing.  I had the linguini with shrimp in garlic and oil.  my wife had paparadelle with mushrooms in a brown truffle oil sauce.  we also had calamari appetizer which was phenomenal and light.  the foccacio bread with sun dried tomato butter was great as well.\n\nnext time in area we will have to try the fennel salad and other delectable dishes", "author": "David R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-26", "description": "I walk by this place everyday on my way to the subway.  I have always wanted to try it so my wife and I got a baby sitter and wanted to stop at a few places and have some wine and appetizers.  This was our first stop and we were quite excited.  We entered and were pleased with the ambiance of the place but our excitement diminished when we told the waitress we just wanted drinks and appetizers and her annoyance became visible, she even rolled her eyes at us.   The bruschetta was appetizing bit was a very small portion.  When the waitress brought us our check she sat it down, did not utter one word to us to thank us for coming or to warn us that our bill was cash only.  I searched the restaurant and did not see any sign indicating such.    My wife went next door and got cash from an atm.  We gave a 20 percent tip but will NEVER return.  We proceeded to Dino down the street and received amazing service.  Do yourself a favor and bypass this place and go straight to Dino", "author": "Bryan B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-08-23", "description": "Ok food, but nothing that will have me coming back for more. Ragu parpadelle was unimpressive; the pasta was overlooked. All of the dishes were very bland. I think it was the first time everyone at the table had to use the salt shaker at the table.\n\nPrices are basically Manhattan level, which I would not have expected for the location and ingredients used (both in amount and quality).\n\nService is fast, which was a plus, but upon examining our bill, the 20% gratuity was already included. It's not that we would tip anything less, but I think it should still be up to the discretion of the customer. I do not like establishments that practice this.", "author": "Erin D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-26", "description": "Rude waitress, mediocre food.\n\nThe only reason to go here is its proximity to BAM. The service was not only inattentive, but the waitress was rude, When we asked for the check she didn't acknowledge us, so when we asked again, she shot back with \"Yeah, I heard you.\" Very limited wine selection by the glass and they seemed not to know anything about the wine or perhaps just didn't want to be bothered. We should have known it was a bad sign when we asked where the wine was from and the waiter sad \"the big bottles.\"  We won't be back.", "author": "v s."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-08", "description": "I had a major pasta craving, so I looked for the closest place to Atlantic/Barclays and Caffe e Vino was the winner. \n\nThis is one of those Italian restaurants that I have been wanting to go to for years, but never had the chance. I find that Italian restaurants are so hit or miss. Either they are just bland pastas with red sauce or they are flavor filled and unique, but it's hard to tell which is which since they are so ubiquitous in this City. \n\nThe homemade spinach/ricotta gnocchi w/ brown butter sage sauce is unbelievable. It literally melts in your mouth. I have never had anything like it. The last time I had memorable gnocchi was in Venice. I have only been here once, but I still remember each bite of that dish. \n\nCaffe e Vino is completely under the radar, but takes you by surprise. \n\nThe calamari was also lovely, as was the rugula salad which had a zesty and fresh lemon dressing.", "author": "Fazeela S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-18", "description": "Huge fan- I came here a couple weeks ago on a surprise date and it was perfect. Its a small cozy authentic italian spot. We were seated as soon as we arrived and they even asked us where we wanted to sit [booth or table] even though they were a little crowded.\n\nWe ordered spinach soufflé and calamari for appetizers and they were both really good! The calamari was a big dish definitely enough for two. Thereafter I ordered the spinach and cheese ravioli in herb and butter- DELICIOUS!!! It was absolutely perfect I felt like I was back in italy. My boyfriend ordered the salmon and it was cooked to perfection. It is hard to find a spot that makes salmon well and they are definitely one of them.\n\nFor dessert we got the creme brûlée and the tiramisu both of them were phenomenal. We finished both of them with our lattes and had no regrets. \n\nI would highly recommend people come try this restaurant if they are looking for authentic italian food; especially since its so hard to find.", "author": "Amanda R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-26", "description": "Fantastic ambience, small, inviting, friendly and relaxing restaurant. Food was just enough and incredibly tasty. The wine menu was affordable, and the Cabernet was just right with our meal. Try the lasagna or the apple tart, both unlike anything you've tried before. The service made us feel like we were eating at grandma's.", "author": "Juvenal M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-31", "description": "I am so happy to have found this gem tucked away in an un-assuming building across from my university! I came here during lunch time and ordered a vegetarian panino (be advised, as another Yelper commented, these are not the grill-pressed paninis you get at chain delis, these are the real deal.) It came with buffalo mozerella, basil, broccoli, and other veggies on the side of an arugula and spinach salad. The sandwich was made on the spot (again, unlike your garden-variety -- pun -- vegetable panini at delis that have been sitting out since who knows when...) \n\nThe panino was delicious, fresh, full of robust earthy flavor and completely satisfying. Service was outstanding and I felt as though I were dining in an expensive Village restaurant, for only a fraction of the price and minus the snootiness. \n\nBeing largely a wine bar (figuratively, this place is cozy in a lovely way) they offer an extensive wine collection. I opted out of this, having work and school remaining for the day I figured that would be a bad idea - but certainly it is on the menu for my next visit!", "author": "Michael W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-18", "description": "Food is great. Friendly and warm environment. \nI ordered ragu fettuccine which was nice. \nIt was made with veal. \nPlease notice They accept cash only which made me give them only 4 stars.", "author": "Ali S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-29", "description": "It was incredible pre-theater meal with friends. Everything we ordered: pastas, ravioli, branzini, mozzarella, and octopus was fresh and delicious. Wine was spectacular, service was outstandingly friendly and efficient. Cheesecake was one of the best we ever had.  And to make this experience absolutely unforgettable, the star of our play, Jeremy Irons, was dining there too!!!!", "author": "Daria L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-28", "description": "Such a wonderful surprise to find this restaurant near BAM.  The food was fresh and reasonable. Shared a delicious veal lasagna entree that had so much flavor. Authentic food and perfect low key atmosphere. Felt like I was in the village.  Will definitely be back as difficult to find a comfortable restaurant in the area.", "author": "Teena M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-03-25", "description": "Midi food. Nothing special. They are super business in Sat night and just provide a normal service quality. Note they charge you a 20% after tax tips even we are just two people in the check automatically if you are using a card. Our food only 65 while they charged $14 tips . So ridiculous", "author": "Sharron H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-24", "description": "We have been here a few times as we live in the neighborhood and have been impressed each time with the quality of the food.  Located on an unassuming block across from Brooklyn hospital, it looks like any other italian restaurant in the neighborhood.  However, we've quickly discovered it's much more than that!  The food is fresh and made from scratch, the wine list is varied, and the restaurant is small but adorned nicely.  As for favorites, the Fettucine with Veal Ragu is out of this world and is a must-try!  We've also enjoyed the Papperdelle Caffe Y Vino (has some mushrooms) and the salads have all been fresh and the perfect size to share.  The staff is friendly but not overbearing and it's definitely a slow moving vibe so be sure to come early if you have evening plans!\n\nTip:\n-They accept Open Table reservations to plan to make one if you hope to not have to wait as it can fill up quickly!\n-Take a stroll in Fort Greene park (a block away) after your filling meal!", "author": "Amanda B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-27", "description": "Cozy environment, good staff and the quite tasty food. I enjoyed the cheesecake. Will be back", "author": "Michelle S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-07", "description": "Caffe e Vino is a rustic, authentic, Italian restaurant in Fort Greene, and most likely going to become one of my new neighborhood staples. I came here for a Brooklyn restaurant week dinner with a friend. The dining room is charming, full of lovely details, and the servers are friendly, warm, and accommodating.\n\nWe ordered:\nFoccacia and tomato flan (actually this is free, but its good enough to note)\nPolenta with mushrooms\nYellow pepper soup\nStuffed chicken\nSalmon alla Griglia\n\nEverything was delicious. The tomato flan is creative and an execellent way to showcase the rustic bread. The polenta was amazing, with strong truffle flavors and a smooth consistency (but it is very filling!). The soup was tasty, but not as memorable as the polenta. And the mains were well executed, not overcooked, and a good portion size. \n\nThe price point is a little high for an average night out, but a great price point to bring your visiting relatives or a first date. The quality to value is good and I most definitely will be back!", "author": "Suanne L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-06-11", "description": "Total shame on them for accepting cash only and adding mandatory 20% gratuity (on post-tax amount). Beware, unlike other cash only spots, the prices are not lower than places that accept credit cards. Yeah, go pocket the card transaction fees and taxes. I hope the IRS will investigate this place as there must be some tax evasion activities going on.", "author": "Simon T."}], "servesCuisine": "Italian", "priceRange": "$11-30", "name": "Caffe E Vino", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "112 Dekalb Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/7NZ_1HM1SMNHCZU82Z7TBA/ls.jpg", "@type": "Restaurant", "telephone": "+17188556222"}