{"aggregateRating": {"reviewCount": 309, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-06", "description": "The bread and tomato spread you start with are absolutely incredible! Reason enough to try this place out.  From there it does NOT go downhill. Really fresh seafood, and great pasta.  Everything is spiced and flavored perfectly in my opinion.  Great service too!", "author": "Miriam P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-02", "description": "Great spot for pre BAM dinner. The staff was so welcoming that our party of 5 felt like family. Got an array of 5 pastas, all superb (although the lemon zest in the special ravioli was a bit weird). The house chianti by the glass was a winner. Annnd the price was right. Had the ricotta cheesecake for dessert... Smooth,creamy and good. Loved the restaurant; especially our beautiful round table in the back dining area. Candle lit and lovely. Don't miss this place.", "author": "G L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-04", "description": "Casual, charming, and excellent food. We had tomato flan, spinach souffle, red snapper, yellow pepper soup, and tiarimisu. The tomato flan was particularly wonderful and the yellow pepper soup was a perfect liquid manifestation of yellow pepper flavor.", "author": "Kenny E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-28", "description": "the food is spectacular - home made pasta, fresh herbs, tender meats, good wine, etc. the ambiance is intimate but comfortable. It's good for a casual dinner with friends or date night.  And the hostess and waiter were attentive without being overbearing.  One of the best dining experiences I've had in the neighborhood.", "author": "Danielle N."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-03-05", "description": "ate here a year ago and while the seating was sardine-like, the food and service were good. unfortunately, other than the tight seating, this place has gone down the proverbial hill. the food was mediocre and not hot enough. the service was AWFUL! the wait staff did not bring bread to our table. never came to check on anything. had to be asked for an extra plate and grated cheese enough times that the food got nice and cold. check was shoved at us. the service was not only poor, it was rude! will never return.", "author": "Flo S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-10-21", "description": "I met a friend for a quick lunch in this cozy spot and was blown away!  My vegetable panini was seriously one of the most flavorful and delicious sandwiches that I have had in a long while.  Gooey fresh mozzarella with mouthwatering tomatoes and basil in between the butteriest (is that a word?) and crispiest bread ever made this a VERY memorable experience.  I cannot WAIT to go there for dinner.  Additionally, this adorable place is the kind of setting that can work for multiple gatherings, whether it be a date, a girls night out, or anything in between (and multi-functional stuff always resonates with me.)  Wow!  What a pleasant surprise!!! I will most definitely be back!", "author": "Joolz M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-13", "description": "Love this place and here is why; the service is stellar and the food is amazing. The proprieter is involved in the dining experience in the most positive way. Not intrusive mind you, but trying to create a special dining experience. They are all about creating a vibe and maintaining it throughout your time there. We had a seabass creation with mango and calamari on top. This was something I never had anywhere because the food is not mainstream. They will actually create something different  on the spot and tailor your dish to whatever your preferences are. Now that's Italian food at the highest level. We followed up our fish dish with a pasta dish of linguine and since I did not want clams and preferred shrimp, there was no issue creating an entirely new dish combining ravioli from another dish I wanted to sample. How about that! They could not be nicer here is all I can say. You almost feel like a family member by the time you leave. And did I add they never rush you! \n\nThis is a great pic if you are going to BAM.  Three blocks away on Ashland Place so it's a great pic prior to any BAM movie or event. The only reason I did not render five stars is the seats are wood which can get really uncomfortable. Other than that it was great!  Would come back again and cannot wait to do so.", "author": "Michele R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-04", "description": "This place was a few doors down from our apartment in NY.  100% legit New York City Italian... the food is great, wine selection is diverse, and the guys are from the home country.  They can always make a good recommendation for dinner, or what kind of grappa to get with dessert.  It is a bit small, but that is a positive, to me.", "author": "Zach W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-06-19", "description": "A nice dinner spot, conveniently located near BAM and the Theater For A New Audience. Simple, well-prepared Italian food in a rustic, comfortable setting. I would certainly go back again if I were in the area.", "author": "regina j."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-19", "description": "First of all let me begin by saying that most things Italian cause a slight buckle of my knees, and please believe the food is right at the top of that list. I orderd the calimari and zucchini dish and a salad and I really enjoyed every bit. This place is really small and intimate and on the rustic side. I recommend it for a low key night out.", "author": "Steve B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-05", "description": "My husband and I live close to this restaurant and it is definitely our go to place for a delicious meal and cozy, romantic atmosphere. The food is delicious, very generous portions and fresh pasta. I have tried many things on the menu and I am never disappointed. The staff is friendly and make us feel at home every time we go. On occasion they give us complimentary biscotti with coffee. \nI always recommend this place and it is the first place I take out of town guests.", "author": "Kelly T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-03-21", "description": "I've ordered take out here 2x in one week -- that's how good it is.  I had the Malfatti Burro e Salvia \u0026 the Linguini Con Gamberetti...both absolutely delicious.  And last but not least, the cheesecake is amazing... The owner was nice enough to show me the outdoor garden that's open when the weather is nice, and it was really lovely.  \n\nI would definitely recommend this place to anyone looking for great Italian food :)", "author": "A L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-10-11", "description": "2 polenta/mushroom/truffle oil appetizer, 2 spinach ravioli, 1 apple tart, 1 chocolate truffle, 2 glasses of wine = $81.65 including tip. I don't know how people rated this place only two $$. It's definitely in the $$$ range. Romantic atmosphere, pleasant service, a little pricey but very enjoyable.", "author": "Sharon C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-23", "description": "Had the Insalata di Rugola (with pears), Salmon Alla Griglia (fantastic!) and a glass of prosecco.  Great food \u0026 wine, attentive and courteous service, rustic decor.  perfect for romantic, candlelight dinner (seated in the back).  \n\nI would have rated 5star but the bill was astronomically high.  Other Yelpers have noted they include gratuity but not on our bill.  They also accepted our $10-for-$20 Yelp promotion.   \n\nNote the neighborhood is definitley not as upscale as the restaurant itself, but it's only two blocks from BAM and they worked with us so we'd catch the 7:30 curtain.  Wish we had time to try a dessert ...", "author": "Usha L P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-02-20", "description": "This place was good, but I don't understand what the hype is. My mom and I ordered out from here and maybe we just ordered the wrong entrees? It was all hot and fresh, but it just tasted like regular old italian food to me, nothing special.", "author": "Leigh F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-07", "description": "i ended up here out of convenience, as a lot of cute little brunch places in fort greene don't take reservations, and i don't like to wait for an hour and a half to sit down.\n\ni always walked by caffe e vino on my way to the Q, and it looked kind cute, plopped down in the  middle of a not as gentrified section of ft, greene.\n\nbrunch is good, but a little on the expensive side. the interior is cute and exposed brick/tuscany style...and it seems it has a back area in the summer! it's small and cute, and tables are packed in a little but just enough to not encroach on personal space. annnnd they have  a coat check, which is super convenient on a  very rainy day.\n\ntook my parents and sis here and they enjoyed it!\n\nthe coffee is good, the waiter was nice and service was prompt. i did think the red overhang sign in the front was in a cheesy typeface, and as a designer i was like ehhh, but i am happy i tried it out. the wild mushroom linguine was awesome, eggs benedict were great, and and my parents liked what they got.", "author": "Hannah L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-09-28", "description": "yes the tomato flan and the spinach souffle like appetizer were tasty, but the room was insanely loud during the pre-theater rush. the malfatti/spinach gnocchi were meh- don't hold a candle to Al Di Las. the ricotta veal meatballs were a bore. lots of better options in ft greene", "author": "Pam G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-20", "description": "The restaurant was a great place before the theater (BAM).  They accommodated 10 of us easily and graciously. The food was very good and the serve was wonderful. We all enjoyed ourselves and had just a short walk to BAM afterwards.", "author": "Victor B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-10-13", "description": "I live in the neighborhood and have been wanting to go here for a long time.  Now that I have, I will definitely be back.   My girl friend and I split the Fettuccine Fagioli E Cozze and both really enjoyed it.  For entrees she had the Salmon and I had the pork tenderloin special.  Both were very good.\n\nOverall, the food was great, the staff was very friendly, and the bill was very reasonable.  I really enjoy all of the Italian restaurants in the neighborhood (Romans, Dino, etc) and I think Caffe E Vino totally stands up to them.  The only difference is that it is cheaper!", "author": "S J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-12", "description": "Probably the best service I've experienced in New York.  No joke.  Very friendly, helpful and respectful.  The food was good too.", "author": "Ryan T."}], "servesCuisine": "Italian", "priceRange": "$11-30", "name": "Caffe E Vino", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "112 Dekalb Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/7NZ_1HM1SMNHCZU82Z7TBA/ls.jpg", "@type": "Restaurant", "telephone": "+17188556222"}