{"aggregateRating": {"reviewCount": 309, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-02-24", "description": "Last night I needed to find a quick bite between work and an evening event at BRIC. I made a reservation here and planned to spend about 30-45 minutes dining. When I arrived, there was one person seated at a table for two, and another table of four men. All other tables were completely empty. \n\nI asked the server for one of the tables along the right wall away from the door for two reasons:  a.) The cushioned bench is much more comfortable (I have herniated discs) and b.) It was freezing and blowing rain outside, and he wanted to seat me directly in front of the door. He said no, I had to sit near the door because the other tables were \"reserved.\"\n\nI went to the ladies' room and when I came back, I asked again not to sit in front of the door. I said that I was not comfortable there, and also, I hate to have my back facing the door. He said no, again. I told him that I was very uncomfortable, and might not stay. I asked him to come back in a minute so I could Google to see whether there was somewhere else nearby that I could go to instead. He said, \"Fine.\" He would rather I leave than let me sit where I wanted to?\n\nA minute later, a couple without a reservation came in, and guess where he sat them? That's right...along the cushioned bench where I'd asked to be seated. I said \"Excuse me,\" and he brushed me off and tried to ignore me, but I stopped him anyway. I said, \"Did you seriously just seat those people without a reservation at the table where I asked to be seated?\" Keep in mind now time is ticking...I was so aggravated but didn't have time to find another restaurant. \"Well, there are two of them and only one of you,\" he responded. \n\nMan that drives me crazy! \"What difference does that make?\" I asked. I'm so sick of single diners being discriminated against. There were two seats in the crappy table in front of the door; they very well could have sat there too. Anyway, he finally said \"Go ahead, sit where you want.\" Remember, there were multiple tables that were empty and much more comfortable than the one he'd sat me in.\n\nI finished and left long before the couple who'd had no reservation, and no one came in and had to wait because I was taking up a table. There were still several free tables when I left. \n\nWhat I can say though is that the owner/manager and a second server who took over for the first one did a great job. The service was perfect from that moment on, and the food was fantastic. I am just tired of crap customer service which seems to be a problem everywhere these days. That first server really needs training.", "author": "Lisa M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-23", "description": "Outstanding, creative, traditional elegant Italian food in the most relaxed atmosphere.  Elegant attentive and reserved service.  Windows open to the street tonight, with a soft warm summber breeze, Italian classical music in the background, nice bottle of Chianti.  Wow.  \n\nAnd most importantly, CONSISTENTLY excellent.  Have been five times, and every time was a five star experience.\n\nWe came as a family and had six dishes, wild Marsala mushrooms with rigatele, meatballs with spaghetti, bolognese, crispy calamari with lemon and a little spice, fresh green salad with a light dressing,  boogenese and for desert a fabulous light vanilla pancetta. Dark foamy decaf to top it off.", "author": "Jedidiah B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-12", "description": "Stumbled upon this place last night and had to leave a review because my husband and I had such a wonderful experience here. I was being very particular (all I wanted was a nice glass of red wine, dessert and *ambience* damn it) and my husband was getting cranky. \n\nWe walked all the way from the Promenade through a couple of neighborhoods, and even into (and out of) a couple of other restaurants before we saw this place from across the street. As soon as we walked in I was sold. It was so cozy and warm. The same lovely gentleman greeted us at the door, seated us, and served us. We ordered 2 glasses of wine, nothing mind blowing but just exactly what we were looking for, and had the ricotta cheesecake and chocolate mousse cake. \n\nY'all. That ricotta cheesecake.... I could have wept. And the chocolate mousse cake was just as good. We split the two generous slices and I was sad when they ended. The service here matched the vibe of the restaurant itself-warm, unassuming, authentic (and prompt). You almost forget you are being served, it was unobtrusive yet you always had everything you needed. The perfect late night wine and dessert experience. We didn't have entrees as we had already had dinner but I would love to come back and try those too if they're half as satisfying as the dessert and the service.", "author": "Erin B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-12", "description": "FANTASTIC!!! Not to be missed. We sampled most of the appetizers and every single bite was astonishing. I had the special ravioli and refused to share. My crew had the fillet mignon  special of the day and they practically licked their plate. My mother had the pork and was a happy happy camper.\nFor wine we had an exquisite bottle (ok we had 2) of rose. And finally, my favorite course, desserts:-) we tried the cheese cake, chocolate mousse, pear tart and panda cotta, all equally decadent.\nI highly recommend this authentic Italian restaurant. Everything was superb, especially the service. Ask for owner Giuseppe, he'll make you feel like a star:-)", "author": "Anna d."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-07", "description": "Date night here in the summertime was truly utterly amazing with the fantastic service emblematic of old school Brooklyn Italian places of times past, kept alive. The menu is rich and changes over time so frequent diners won't bore. The lamb over thin linguini is a clever dish. The bread beforehand is toasted right with real butter. There's a deep wine menu with knowledgeable staff to help you pair it. The location just 3 mins East of the DeKalb Ave station is very convenient and safe across the street from a hospital entrance. We shall return in the winter for the warm interior design with exposed brick \u0026 plumbing.", "author": "Richard C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-11-24", "description": "PLOT: Family get together: local Brooklyn with out of town Texas visit\nCAST: Father and son, mother and girlfriend\nRATING: eh...\nCOMMENTS: It started off well, but in the end, either Cafe de Vino or Yelp were misleading - we did not receive the 10% off Yelp coupon since it was for their \"wine selection\" which apparently only applies if you order a bottle of wine. So - don't come here if you thing you will get 10% odd your wine and you order it by the glass. And - always show your \"Yelp coupon\" **First** before ordering - there's always terms and conditions..", "author": "Mark H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-28", "description": "Been here a few times since 2009 but more frequently now since I work in the hood. \n\nIt's a nice ambiance to get away from work for lunch.  The mushroom pappardelle had amazing flavor, I think about the dish often!  Didn't care much for the lamb ragu pasta, lacked finesse. \n\nCalamari appetizer comes with fried zucchini also which was a nice addition.", "author": "Thy L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-01", "description": "Nice local spot. To have a cup of Joe. Service was great menu had lots to choose from. If your in the area definitely stop by.", "author": "Felix M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-01", "description": "This place has simple but great Italian food, especially if you're trying to go to BAM afterwards. They offer a BAM members discount I believe, and they're very good about bringing you your food quickly if you mention what time you have to be at the theater. \n\nI love love love love LOVE the tomato flan and foccacia that they bring you before the meal - it alone is a reason that I come back again and again. The rest of their menu is delicous, though I've gone about 4 times now and I'm starting to feel fairly limited by the brevity of the menu. But the food is cooked so well that it's hardly a complaint. In the past I have enjoyed their spinach gnocci, their salmon with grilled vegetables, and the pasta with eggplant and mozzarella. \n\nThe atmosphere is great for a date or quiet dinner. And I only have good things to say about the service - they know what they're talking about, and they're always very friendly and accomodating.", "author": "Lee S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-15", "description": "Wish we'd found this place sooner.\nThe decor is really cozy and intimate, i.e. you're not rubbing elbows with strangers or overhearing awkward conversations on first dates - score!\nThe food was excellent - the handmade mushroom pappardelle was to die for. The service was great as well.\nWould definitely recommend!", "author": "Jade D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-10-19", "description": "Our first experience with Italian food in Brooklyn and we couldn't have picked a better place! Thank you Yelp for your awesome deal that popped up while we were walking around in the BK and then decided to swing by this gem of a restaurant. :)\n\nThe ambiance is very cozy and romantic. When we got there on a Thursday night, there were seriously only a few tables still open. Thank goodness I made our \"reservations\" about 10 min earlier when we were inside of that Aeropostale store down the street. :P\n\nWe started off with the complimentary bread and tomato flan. Yes, I said it...tomato...FLAN! OH to the M to the GEE whizzz that shizz was the SHIZZNIT!!! The flan itself was like a nice creamy tomato paste that complimented the soft, garlicy bread so well. I seriously would give this place 5 stars alone for that flan. \n\nFor my entree I decided to go with the Garganelli della Casa which consisted of homemade garganelli with italian pancetta, peas and cream sauce. The pasta was probably the best pasta I've ever had...why? It wasn't too heavy and it felt very homemade. The sauce went really well with the garganelli. It was the first time I've ever had garganelli and boy oh boy did I enjoy every bite. I licked my plate clean baby! Oh yeah, I also had a glass of their Cabernet Sauvignon and it was pretty delish too, especially for only $7-$8 a glass. Not too shabby.\n\nThe SBBF had the Linguine con Gamberetti which was linguine shrimp and zucchini drizzled in garlic and olive oil. He had me taste a piece of the garlic cloves that were on his plate and it was bomb diggity delish! He said it was one of his best experiences with pasta as well. \n\nService here is decent. Not too pushy with the right amount of attentiveness. \n\nWe will surely return here one day, Yelp deal or not.", "author": "Michelle V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-25", "description": "Absolutely wonderful! Intimate and cozy, the owner is gracious and welcoming and the food is just like your grandmother's Sunday dinner! We will be back! My new go to place in Brooklyn!", "author": "George G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-06", "description": "As is common now a days one often forgets to feed when there's a day of art on the agenda. \n\nSo after meeting friends, and on my way back home I decided to dine solo and found  this spot via the app. It is quaint and just the perfect size if you are fearful of or intimidated by the prospect of eating alone. I got a small table and settled into the perfect and quiet lull of the space and it's ambience. \n\nService was fast and impeccable. I was waited on by Giuseppe, who was warm and friendly without being over bearing. They brought fresh bread and a tomato flan/spread which was rich and delicious dressed with some olive oil. That was followed by a light starter summer salad with fresh pepper which was crisp; the green beans were yummy.\n\nFor the main I had the Pappardelle Caffe E Vino which was delicious and perfectly cooked. The texture was right, not soggy or hard but just aldente to soak up all the truffle sauce. I guess you can say it had a kind of decadence. I accompanied all of this with the Rosso Toscano Castello Di Meleto . \n\nFinally I had the panna cotta. Don't waste a minute considering an alternative. It was creamy, luxurious and the vanilla bean shone bright.\n\nAll of this for $50.00! To me that's a great deal. \n\nA warning however this is a cash only joint.  Highly recommended if you are in the fort green area and looking for a relaxing place to feast.", "author": "Holly B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-26", "description": "Amazing food and service. Visiting for business, wanted some great Italian and found it!!  Polenta appetizer was amazing, lasagna...perfection and the pana cotta was to die for. I'll make the trip back here anytime I'm near the city!!", "author": "Chris C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-06-05", "description": "Waiter at this restaurant was very disrespectful to my girlfriend.  She had a simple question about a menu item, and he gave a snarky reply, AND didn't know anything about the food.  \n\nThen, had the nerve to tell us that they were too busy to prepare take out food for us, and said the only option was to sit down.  We work in the hospital across the street, were dressed in scrubs and white coat, and were obviously working a long night, and he turned down our business.  Seriously rude!\n\nThumbs down x 100.  Will be spreading the word around the 750 employee hospital that this place has terrible service.", "author": "Richard L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-11-11", "description": "Service here is top notch- had dinner with a friend here the other week. The owner came up to us and formally introduced himself. \nThe service pretty much made up for the cold food. All of the dishes had the potential to be amazing but weren't warm at all. Or they were oddly warm in the center but cold on the outter edges, leading me to believe that it was not fresh, or left out too long. \n\nI would give this place a second chance solely because the customer service was so amazing and the attention to the individual was nice and very neighbor hood like!", "author": "Natalie D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-17", "description": "Small, cute little Italian restaurant. Atmosphere was very cozy. We were greeted immediately as we walked in and seated right after.  The wait staff was very attentive and super friendly/accommodating. \n\nGrowing up immersed in Italian culture and cuisine, my standards for Italian food are very high. With that being said, the food was excellent!! Homemade pasta cooked to perfection- not over done or under cooked. We also shared the fried calamari and arugula salad as an appetizer. \n\nQuote of the night: \"Gnocchi were little tiny pillows of delightfulness.\"", "author": "Stacey H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-25", "description": "We had a reservation for 4. We were seated promptly. The bread and tomato flan came immediately. The bread was amazing, the tomato flan was just okay - I'd read reviews calling it otherworldly so I wanted to like it but it wasn't on that level.\n\nMy son had the stuffed chicken, which he liked very much. I had the linguini with shrimp and that was perfect. My friend had a special of the day that he said was fantastic. My daughter had the spinach and ricotta ravioli which she said tasted like frozen ravioli (and indeed during the menu readings, our server did specifically point out which menu items were made in-house, so it leads me to believe they could rely on frozen for some items). I took a taste of her ravioli -- I agreed. It was tough and thick, not like the pasta the rest of us enjoyed. \n\nWe also ordered calamari and the gnocchi for the table to share as appetizers. Both were out of this world. OMG, that gnocchi -- so soft and fluffy. \n\nNOTE: there were other things we might have ordered, but there were a good 5 or 6 things on the menu that they'd run out of. To be fair, we were the last table of the night on a busy Sunday. \n\nDesserts: After reading the great reviews about the cheesecake and the tiramisu, it was super disappointing that they were out of both. We settled for the panna cotta with balsamic reduction, which was fine, and cannoli, which was quite good. \n\nThe service was great, they were helpful when we needed to plug in a phone and didn't have an outlet near us or the wall plug (we just had the USB cord). \n\nThe thing all the other reviewers say about the CASH ONLY :) note that arrives with the bill? They weren't kidding. Apparently they do it every time, and every time, they tell you their machine is broken. Glad I'd read the reviews and brought enough cash.\n\nIn summation, the food was mostly fantastic, the service was excellent, next time we're in Brooklyn we're likely to go again (and bring cash).", "author": "Angie A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-24", "description": "We had dinner with our company worker here and it was one of the best dinner we've had in a long time.  Food and service was spectacular", "author": "Idalia N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-07", "description": "After Philip Glass last night, I was taken here for one of the best meals I've had in a long time.\n\nWe started with a bottle of Barbera and the mussels which were the appetizer special of the evening. They were deliciously served with artichoke, tomato and focaccia bread on the side. \n\nThen I had the spinach and ricotta ravioli which were also on the evenings specials. There was an option of sauce and I went with the cream and walnut sauce, as recommended by the server. My date had the Tri mushroom pappardelle which was delicious. The serving size was perfect.\n\nWe finished the evening with espresso and the (best cheesecake ever!) ricotta cheesecake. \n\nService was impeccable, the cloth napkins were lovely, the atmosphere was quaint. We lingered until closing and were not even rushed out, as closing time was approaching. I felt as if I was back in Europe.\n\nI will definitely return to this wonderful restaurant.", "author": "Charlou M."}], "servesCuisine": "Italian", "priceRange": "$11-30", "name": "Caffe E Vino", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "112 Dekalb Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/7NZ_1HM1SMNHCZU82Z7TBA/ls.jpg", "@type": "Restaurant", "telephone": "+17188556222"}