{"aggregateRating": {"reviewCount": 309, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-02-17", "description": "Amazing staff, amazing prices. Food was fantastic. Absolutely suggest this place as an after spot if you've gone to BAM.", "author": "Emme S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2008-12-12", "description": "Bottom line-MEDIOCRE.  I loved the rustic decor, HATED the techno music, loved the bread and dip, and the meal went way downhill from there.  We had mussels, a caprese, a pasta and a fish.  The caprese was bland and awful, and i'm not sure how that is possible,and  the mussels were dry and in a typical white wine sauce that was improperly salted and seasoned.   As for the pasta, it was overcooked but the vegetables were fresh, and the sauce was not bad although it needed another flavor element.  The fish was obviously pre frozen and tasted fishy, which overwhelmed the dish.  The service was friendly.  Overall, this place is yet another failure to join the pantheon of bad italian restaurants in fort greene.", "author": "Luke D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-01-18", "description": "This place was amazing! I walk past it twice a day, on my walk to the subway every morning and my walk home every night, but never ate there until last night! The food was amazing, which all began with delicious homemade rosemary bread and this tomato sauce flan thing to dip it in! (best bread i've ever eaten!) - I then had the homemade linguine with the veal sauce, again AMAZING! perfect portions, ambiance was really nice, but best of all the staff were brilliant! They we all so sweet, and happy to be there, and at the end of the night, both my boyfriend and I were helped into our coats by our waiter. It felt very 'Good Fellas' in a way, but very warm and welcoming. I will definitely go back as soon as possible! I also noticed a back yard; looking forward to spending some summer nights there!", "author": "Ana K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-03", "description": "This is one of my favorite restaurants in the neighborhood.  Caffe E Vino is the perfect place to bring a date, catch dinner before seeing a show at nearby BAM, or enjoy a dinner with friends or family.  Specializes in northern Italian cuisine, and usually serves a decent variety of specials.  The portions aren't monstrously huge like at some restaurants, but are usually just the right size to leave you feeling full. The prices are also extremely reasonable, and the ambiance is really nice: rustic, hardwood floors, soft lighting, but casual atmosphere.  I usually order one of the salads and last time I had the fettuccine al ragu, but the chocolate cake won me over. The service is sometimes a little slow but the owner came by to chat with us one night - overall, a friendly place and a fantastic find.", "author": "a m."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-12-03", "description": "Really wish I could have discover this place a lot sooner.  I ordered delivery from this place and was above expectations.\n\nI didn't remember the entree names as they were both special.  One of them is Cod and one of them is Steak.  They were both amazing.  Even the vegetables that was served with the steak was good.\n\nDelivery was quick and in good temperature when it arrived.", "author": "Loretta H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-11-27", "description": "Amazing lunch deal!  The food was delicious, portion was HUGE, and service was perfect.  I had an omelet with potatoes.  They even brought me two baskets of bread although I was dining alone.  They left me to eat and do a little reading after my meal, which I appreciated.  The ambiance was nice, like a rustic old-world Italian den.  Great place.", "author": "jane s."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-20", "description": "wonderful little restaurant at the edge of fort greene. nice ambiance makes you forgot about the hustle and bustle of dt brooklyn. bread was awesome. portebello mushroom appetizer was great- crusted on the bottom with arugula on top and sweet bell peppers. home made fettucini was done perfectly with the veal sauce. i'm definitely going back often.", "author": "Jeffrey T."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-11-22", "description": "i needed to get to a happy place fast but caffe e vino did not help the process.\n\nso. you know, when youre tired and hungry EVERYTHING tastes good?\nyeah. that didnt happen when we stopped in for a late dinner. when im in super duper cranky pants mood, i wont say much...but my face will tell you what im thinking. \n\nafter a long, exhausting day it was time to eat. it was around 10:30 and the dining room was full. after a short wait there was a table ready for us.\nthey were super friendly and accommodating- 1 star for that.\n\nthe calamari/fried zucchini app was good. not over cooked and tasty. \nthe entrees, oh the entrees. lets start at the top:\nthe ravioli special: pumpkin ravioli, the stuffing was tasty but there was way too much dough. almost reminiscent to a wonton with too much wrapper.\nlinguini with shrimp in garlic and olive oil: ehh. something so simple but something was off. shrimp was overcooked, but that happens.\nthe chicken scaloppini stuffed with spinach and mozzarella: i dont know what happened. i know it was late and maybe whoever prepared it was tired and couldn't control their arms and how much salt was added. but when i say it was salty, it was SALTY. after i took the first bite everyone at the table knew that something was wrong. i was cursing underneath my breath and got angrier. the saving grace to the dish were the veggies, the sweetness of the carrots helped the saltiness of...everything else. \n\nokay. so 1 star for the niceness. and half a star for benefit of the doubt, it was late maybe everyone was tired. but thats no excuse!", "author": "Cassandra M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-02-15", "description": "My husband and I were celebrating our first Valentine's Day as new parents. Normally we stay home on Valentine's Day because we have had some bad experiences with restaurants that we love adding tons of tables and offering \"special\" menus that are higher priced and less selection. Let's just stay we shouldn't have strayed from our usual plan...\n\nMy husband surprised me by getting a babysitter and taking me out to dinner. He did all this research to find a place that he thought would be special and really enjoyable for a rare night out. We were really excited, but our excitement was gone the second we were seated at our table. \nThe restaurant was so packed with additional tables you had to maneuver a maze to even get to your seat. The tables were probably a couple of inches apart. I'm all for intimacy on Valentine's Day, but with my husband, not two other couples on either side of my table. The misery didn't end there. The table we were seated at was right by the front door, so every time anyone came or went I got a huge gust of cold air in my face. We were asked within minutes of sitting down by our waiter if we were ready to order. We hadn't even gotten water or looked at the menu. When it was clear that I was going to be freezing all night, my husband asked if we could be moved to another table where we saw the couple paying the check. The manager said no problem. We waited patiently. Within minutes of them leaving the manager had seated other people there with no regard for our request. When my husband asked him politely why we didn't get moved, he said one moment and he was going to move us. Needless to say the move never happened. We waited almost 45 minutes before deciding no food was worth this experience and we left. \nInterestingly enough in those 45 minutes of freezing and not eating at our table, we made friends with the couples around us and they all felt the same way. They kept saying how the food was really good, but it didn't matter that night because the experience was so miserable. They ALL had their coats on while eating. The guy to my left had a huge pipe on his leg under his table. It was almost comical, if I wasn't so hungry. \n\nI am always disappointed when a neighborhood restaurant decides to put greed ahead of their overall reputation. All the reviews we read were so positive...saying things like how nice the people were and the food was so good. I was really disappointed that I didn't get to enjoy what all these people were talking about. If the owners had just stuck to what they apparently do so well, they would have gained steady and loyal customers in my husband and I. I really don't think the owners cared about their customers  last night and, in turn, I'm not sure I can care to return and give it a try.", "author": "Abby M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-01", "description": "I found out about this place through Restaurant.com and came here with a friend.  Absolutely everything we had was delicious.  The pre-dinner bread and spread gave us an idea of what we were in for--we devoured it!  We then split a portobello with mozzarella appetizer special, which was also very tasty.  I had a pasta special that was great, and we split the apple dessert, which was flaky and warm.  The place had a nice ambiance, as well.  The servers were very attentive to us at the beginning of the meal but then seemed to disappear.  This is the ONLY thing that is holding me back from a 5-star review.", "author": "Danielle S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-12-19", "description": "This a Dekalb gem. My pumpkin soup and pappardelle with mushrooms were perfection. We went on a double date and we stayed the whole night - eating, drinking, talking. They never pushed us out and actually gave us some treats on the house at the end. I personally loved the service style - the waiter had to man a lot of tables, but he touched based at the right times. Great place for a date, double date, or dinner with your parents as long as they don't mind small restaurants. I will be back!!!", "author": "Sona R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-19", "description": "This place has fantastic food!  Come here for true Italian hospitality and charm.  Don't be fooled by this block, restaurant is tops!", "author": "Mark E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-07", "description": "Wonderful place!  Food is very consistent and delicious!  I always try their fish and chicken specials and am always very pleased.  They really work hard making sure the quality of their food is high.  Excellent value and very nice people.  Great as delivery as well.", "author": "Liz S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-11-15", "description": "Cozy and romantic.  Service was quick and pleasant.  The food was really good especially the parpadelle with mushrooms.  Definitely a repeat.  Highly recommend reservations if you want to sit in the front room.  They tried to put us in the back which had no ambiance or atmosphere.   Told them I made the reservation based on the front room so they gave us a table which was for 4 but we were 2 which was very comfortable.", "author": "Marg M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-27", "description": "Our welcome was warm and gracious, the service solicitous.  Chewy, flavorful made-in-house focaccia immediately cued us that we were in for Italian food, not Italian-American.  The special of pasta and bean soup was flavored with rosemary, the beans and pasta cooked just right.  My husband had the trout which came with shrimp, calamari, and sauteed fruits and vegetables.  My homemade pasta (all pastas are homemade) with mushrooms was so yummy and comfortable that I ate the whole plateful and had no room to try one of their desserts which looked delectable.  The coffee is made by the cup and is a perfect ending to a meal accompanied by their crisp, homemade biscotti.  This is a small gem of a restaurant.", "author": "Toni T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-14", "description": "A delicious dinner.  The maiale was delectable, as were the beautifully buttery malefatti.", "author": "Jonathan S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-06", "description": "yummy!  i will definitely return.  i thoroughly enjoyed the fennel salad, crab meat ravioli (today's special) and the macchiato hit the spot.  thanks to the s/o for recommending this!!", "author": "c m."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-12-19", "description": "I attend most events at BAM and never consider having dinner anywhere else!  I love the food, the ambience and the service.  The food is always great, the service wonderful...it is my favorite Ft. Greene eatery!", "author": "LARYSA M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-03-04", "description": "The reason for my 2 star rating is not because of the food, the food was actually pretty good although a little pricey for this area.  I was not happy with the way how we have been billed for the dinner.  We had a restaurant.com voucher of $25 which states that it can be used for dine-in of $50 and above with 18% gratuity included.  When the bill arrived the gratuity included was well over 20% and then the manager told us that their credit card machine wasn't working and if we could pay in cash.  I saw another table which was the only table other than us paid with credit card.  We didn't feel like arguing with them but definitely did not enjoy our overall dinning experience because of this.  Overall, I think the food is decent but pricey if you don't have any special promotions like Groupon or Restaurant.com vouchers but be careful if you do use one of those for the inconsistent billing practice.", "author": "Iris G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-05-15", "description": "My cousin accidentally bought a gift certificate for this place on restaurant.com, and rather than let it go to waste, we decided to make an adventure out of going to Brooklyn and using it. We went on a Saturday night, and made a reservation to be safe (though it seemed like we didn't even needed to make one). The interior is very cozy, and the food was delicious (I had the involtini di pollo, and she had the salmon alla griglia), but the service left a sour taste in our mouths. The waiter seemed to not care about my cousin's gluten-intolerance, and did not offer any suggestions for good items on the menu that she COULD eat. Moreover, he never stopped by to ask how everything was. The food may have been great, but the rudeness of our server was enough to deter me from ever wanting to dine here again.", "author": "Austin P."}], "servesCuisine": "Italian", "priceRange": "$11-30", "name": "Caffe E Vino", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "112 Dekalb Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/7NZ_1HM1SMNHCZU82Z7TBA/ls.jpg", "@type": "Restaurant", "telephone": "+17188556222"}