{"aggregateRating": {"reviewCount": 309, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-06-04", "description": "The food at this place is pretty tasty but a bit heavy on the butter. The service was rough around the edges to say the list. The loud opera music was corny. The CD kept skipping too. A CD!!!  I am not going back. It was also kind of expensive.", "author": "Felix E."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-03-26", "description": "No idea how the food is, but I do know that it's only 1/2 mile away from me, but they told me that it's too far for delivery.  I thought that was pretty ridiculous.  o_O", "author": "Salem S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-27", "description": "Six adults + a 2 yr old. Staff could've have been nicer or more accommodating. Oh, the food. Just terrific! Pastas all done perfectly. Sauces unique. Didn't get into other entrees but that's for my next visit. Fair pricing. Go for it!,", "author": "Jeffrey B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-03", "description": "My husband and I ate there on New Years Eve...and it was every bit as good as the previous 4 or 5 times we'd been there.  Gnocchi was light and delicious, which is so much better than other restauants are able to accomplish. Service is always great.  I've never had a complaint...okay one...it can be cold if you're seated by the door in winter.  It's all good.", "author": "Kathleen A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-09-30", "description": "I was so impressed with this place that I brought a friend from London to dine with me. Again, it was delicious and truly one of the best Italian restaurants in NYC! This time we start off with some Italian beers and the amazing Fried Calamari. Crispy, fresh and a nice portion to share. The accompanying sauce is just done right.\n\nThen, we had the polenta with truffles. OMG!!! This dish is to die for! No kidding. It is smooth, creamy and flavorful. You MUST try this dish.  Next, we were ready to order our mains, my friend opted for the home made pasta with mussels in a light sauce. Since I had such a great experience with the home made pasta with pancetta in a creamy sauce, I decided on the home made pasta - again! Yeap, that's right...it's that good!!!!\n\nNeedless to say, we both finish everything, down to the last slurp of the sauce. More Peroni's were ordered and then it was ready for a pinch of their delicious dessert. We tried the Italian cheese cake again. And again, it was right to make this dinner experience complete......\n\nFort Greene has a gem to excite and satisfy your gastronomic craves - be there whenever you can.", "author": "Fork U."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-11-12", "description": "Friendly service, good homemade pastas.  Albeit, a limited menu.  I felt my dish was a bit on the greasy side and a tad too salty, but otherwise good. Would try again with another dish.", "author": "Amy H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-02", "description": "This place is always very warm and welcoming! this food is always fresh and delicious!Ii love there pasta dishes. I highly recommend.", "author": "Michaella W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-15", "description": "Delicious food with excellent service.  Great panna cotta. Wine list is adequate. Great ambiance.", "author": "Jan B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-30", "description": "The food was fabulous, and I enjoyed sitting in the back room, which was a little less cramped than the front.  Food arrived quickly, and was extremely tasty.  Only disappointment was that the fish special, although tasty, was what I would describe as \"frugal.\"  The fish itself was a surprisingly small portion.  After removing the skin, only got about six bites.  The only up-side was that there was more room left for one of their fabulous desserts!", "author": "Felini S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-11-14", "description": "The service was incredible. Attentive, knowledgeable, friendly. \n\nWe had the $25 four-course prix-fixe pre-theater meal that is available to BAM members. I had the polenta mousse, penne with mozzarella, stuffed chicken, and biscotti. My man had the greens salad, giant rigatoni with balsamic, the veal, and a chocolate mousse cake.  \n\nThe food was fantastic, and memorable. The polenta mousse was a perfect rainy-day treat, and the chocolate cake also stood out for its smooth and creamy richness.\n\nBest of all, our water was filled automatically, we got new silverware after every course, and everyone at the restaurant seemed delighted to be there. I always ask for recommendations, and the waiter made a great (and affordable) wine choice and was very knowledgeable about each dish.\n\nOne other thing that I liked is that the [person we assumed was the] owner greeted most guests by name. It was filled when we left, and seemed like a popular place.\n\nWe left feeling like royalty. it isn't dirt cheap, but for the level of dining, it is actually a good value.", "author": "Just M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-09-06", "description": "After having frequented this spot four times now, I have to say, cafe vino offers one of (if not the best) meals you can possibly find in Brooklyn. Giuseppe, the owner, is one of the nicest guys you will ever meet. Every dish I have ordered has been beyond compare. The parpadelle with mixed mushrooms will slay you. All pasta is made in house and it shows. We've had four different bottles of wine here as well, and they've been fantastic selections. The deserts that I've had (apple tart and chocolate mousse) were delectable. In addition to the stunning courses, the service provide by Giuseppe and his crew (Marco and Adill) is warm, welcoming, and so personal, you feel as if you are \"part of the family\". I honestly can say that this place has earned my loyalty for years to come. Nice guys, great food, excellent decor. You can't beat Cafe VIno.\n\nPlus, every time I come in, they offer me a shot of limoncello or desert on the house. Such hospitality.", "author": "jay k."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-02-02", "description": "WARNING: GRATUITY INCLUDED ON ALL CHECKS!  Okay, sorry about the yelling caps, but I had to make that clear.  I picked up the yelp deal for a pre-BAM dinner with my husband.  The food was good.  I had the pasta with mussels and they were delicious and briny with no fishy flavor.  Service was fairly prompt, but we were still rushed to get to our show.  The bill came, and we were good coupon holders and tipped on the pre-coupon price.  But when we got home, I noticed that they had included the gratuity for a two person table!  This means our waiter got an 18% tip on the pre-coupon total and a 20% tip on the pre-coupon total plus his 18% tip.  \nGranted, this was my fault for not checking the bill closely, but if you're going to include a gratuity for a table of 2, please mention it or put it on the menu or something.  \nI just called to complain and the manager offered us a comp the next time we come in, so I might go back just to see if they follow through.  I'll report back.", "author": "Teresa I."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-06-07", "description": "I am not a foodie, but it was not good. The fettuccine was overcooked, except where stuck together in a lump. The veal ragu was bland. Garganelli with pancetta was marginally better, but too heavy and neither pasta tasted particularly fresh.\n\nAt the end of the night, the waiter apologized and informed us that the credit card machine is down. Any other decent restaurant would offer to make a card imprint. They asked for cash.\n\nCute place, but disappointing experience.", "author": "Joe S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-16", "description": "Great place.  Food, decor, staff are all superb.  A few very good pastas.  Wine is decent, but haven't found anything great yet.  This is certainly one of the better places in the area and a must try for anyone nearby.", "author": "Jon Z."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-09-07", "description": "Amazing place.  Loved the staff and Johnny (the owner) makes you feel like family.  The veal meat balls are amaZing coupled with the amarone wine.  Also, don't ignore the specials.   No corners are cut as they deliver fresh and talented cuisine.", "author": "Quinlan E."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-06-27", "description": "Went to dinner here with a group of friends.  The service was decent but I ordered the special pasta for the day (linguine and vegetables) and it was like swimming in the ocean with my mouth open it was so salty.  They were very kind and took the dish back to make me another, but it just had no seasoning when the dish returned.  The cream of broccoli soup was alright, but not great, as was the tiramisu.  The ambiance was nice though...very romantic with dim candle lights and dark wood.  Wouldn't recommend this place based on what I had tonight though.", "author": "Monique B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-03-08", "description": "Terrific across the line. Excellent menu and great food. Service is first rate and customers are actually made to feel like family. The owner/host is the reason for this. Whenever I'm in the area, this is the place I will go. You won't be disappointed in the ambiance, service, and especially,  the food. My friends and I have never been. Check out the desserts, too. Oh, and very reasonable, especially when considering the quality.", "author": "Joe B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-18", "description": "They hold up well against any of the high end Italian restaurants at half the price. A tating bargain.", "author": "Anthony A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-01-05", "description": "Wow...best service I have ever had in NYC.  Food is amazing.  Absolutely blown away.", "author": "Scott W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-02-17", "description": "Worst experience I ever had in NYC, staff was exceptionally unfriendly, this can ruin even the best meal.", "author": "Hannah L."}], "servesCuisine": "Italian", "priceRange": "$11-30", "name": "Caffe E Vino", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "112 Dekalb Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/7NZ_1HM1SMNHCZU82Z7TBA/ls.jpg", "@type": "Restaurant", "telephone": "+17188556222"}