{"aggregateRating": {"reviewCount": 309, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-04-14", "description": "I was brought to Caffe e Vino because my friend heard good things about this joint. So we went. The atmosphere was nice not pretentious at all, dim lights,candle lit tables, very cozy and warm,the food very fresh, I asked for my salmon to be \"rare\" - it was cooked to perfection and really fresh! And the salad was superb too! The service was very good. We also fell in love with their wine selection.\nCan't wait to go back!", "author": "jessy j."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-10-24", "description": "Excellent!  Flew in from San Francisco last night and what a great meal!  To start, the tomato flan and their homemade bread was great.  The calamari and zucchini appetizer was fresh and delicious.  The pan seared fish with citrine sauce was one of the specials last night and it was amazing.  My wife had a very good shrimp linguini (all their pasta is homemade).  To top it off,  the waiter recommended the creme brulee. I told him we just flew in and that I really was craving NY cheesecake and asked if theirs was good.  He brought us both \"on the house\" what a treat!  The cheesecake was delicate and smooth and the creme brulee was perfect!  Excellent service and a great atmosphere!", "author": "Jeff S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-08-11", "description": "MEH! Atmosphere was nice, service not so great, food OK - my friend's food was probably 3 stars and mine gets 1. Mussels did not taste fresh and dishes were bland and nothing special. I don't really get the 4 stars. I've had better Italian just about anywhere else - try Graziella's or Il Porto. \n\nAlso, the waiter mumbled that they did have happy hour but did not elaborate (we were there very early, 630 or so)... we got 4 glasses of house wine between the two of us, only to find out when we got the check that they were $10 a piece. happy hour? hmm?", "author": "A B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-21", "description": "Caffe e Vino is our go to neighborhood Italian spot. The food is always delicious and there are always a variety of specials so we never get tired of the food. The tomato flan served with the bread is addictive and their ricotta cheesecake is out of this world. My husband and I love this spot so much we decided to have our rehearsal dinner in their back room. The staff was extremely flexible and helpful to develop a menu that was perfect for our event!", "author": "Michelle C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-12-14", "description": "Great little Italian spot.  The owner is super friendly and a very charming place to take a date or a group of friends.  Food is fresh and great.", "author": "Nicole M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-12-09", "description": "This sweet and romantic restaurant is a gem!  I had dinner there on Saturday night w/a small group of friends and we were thrilled with the delicious (the Polenta App and the Gnocchi was exquisite!) food, ambiance and very attentive staff!  Don't pass this place by.  I felt as if I were transported out of the country!  I highly recommend this wonderful restaurant!  And the Cheese cake.............the best!", "author": "France G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-08-28", "description": "Fantastic!\ni must say that i am giving this place 5 stars with a caveat - in the category of cute local Italians this is the best. It may not be Jean Jorge, but for what it is, it's perfect.\n\nThe meal starts with a great twist on your basic bread service - instead of butter or even olive oil, we were served a little tomato flan to spread on our crusty wheat and soft focaccia. Great, light spreadable and tasty.\n\nI had the muscles in brown butter sauce and HOLY COW!! This was really too much for one person don't get me wrong, it was a great dish with toasted bread and shelled muscles in a garlicky-butter sauce (like a burre blanc) but after eating the flan, the muscles and (i guess 1/4 lb of butter) were a lot for one and i finished it anyway...eep.\n\nThen i had a house made pasta (beautifully made hand rolled penne-style pasta - wow) with crispy bacon, arugula, tomatoes and a butter garlic sauce and just a drizzle of what had to have been a 12year balsamic on the plate just for some sweetness.  Really amazing, i just couldn't finish it after all the butter and flan.\n\nWe also had a gorgeous musclin salad (with fresh baby spinach, corn and avocado) and grilled shrimp - perfect light and simple.\n\nAnd we had a Caprese salad with teh same great balsamic, a very fragrant basil oil tomatoes and Buffalo Motz which was a little harder than i like it, but this is no sin...\n\nThey finish with some house-made almond biscotti for the table (nice closing touch) and the owner cam eover to introduce himself (another nice detail.)\n\nService was great, friendly knowledgeable efficient and well timed and the open air main dining room (and garden) are great\n\nIf you're in the area (or not) - stop in!! It's really worth the visit.", "author": "Furyk C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-02-15", "description": "There's a good reason why they tell you to tip in cash -- if you pay by credit card, they might (purposely?) overcharge you on tip, in the hopes that you won't review your credit card statement or won't remember what you really put down.  They tried that on me.\n\nThe food is decent, nothing memorable in my opinion, just pricey Italian food. \n\nAmbience might be nice for a date, though.", "author": "Jordan P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-02-13", "description": "The ambiance was charming and intimate. The service was warm and attentive. The menu offerings were very attractive. However, the dishes lacked execution and a skillful hand. The cappuccino was hotter than the sun, which was not a pleasant conclusion to the meal.", "author": "Matthew A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-13", "description": "Amazing food, nice people! We got some amazing complementary biscotti.\n\nLoved it!", "author": "Laura O."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-09-01", "description": "I really wanted to like this place, seeing as how it's so close to home but it was one of the worst meals I've had in a long time.\n\nIt was quiet for a Friday night. Decor looks pretty tired.  Speedy and competent service throughout.\n\nBread basket was stale and the tomato flan instead of oil or butter was pretty gross. Terrible gelatin/jelly texture with some watery tomato stuff.  Way too much gelatin.  Olive oil would have been much better alternative.\n\nI had salad to start: it was fine.  Small-ish portion and the dressing was over salty but edible.  How hard is it to make a salad?  OH had the mussels. The appetizers arrived so quickly I was surprised. Clearly those mussels were not freshly made.  And of course they arrived, de-shelled.  I would doubt that the dish was made from fresh mussels. Sauce good but the mussels pretty chewy.\n\nI don't eat pasta a lot and so I really look forward to it when I order it.  Bit of a treat.  I ordered the fettuccine with ragu.  I was so disappointed: I may as well have stayed at home and made it as I would have made a much better dish.  The pasta was pretty well cooked (over al dente but I don't mind that much) but the fettuccine were so thick that they were incredibly chewy. So much so that I began to feel I was eating cardboard.   I might have chewed on regardless had it not been for the terrible ragu.  The ragu was incredibly bland and greasy.  It was such a heavy dish with the thick pasta and bland ragu.  It really should have been a bread \u0026 butter dish to a restaurant like this but they got it wrong. OH had the garganelli.  Left most of it. Chewy and bland.\n\nWine was reasonably priced but my glass of merlot wasn't great and it was served almost at body temperature, which isn't good.  It was so warm it became almost fizzy.  Oh, and there was no a/c and on a hot summer night, that was uncomfortable. \n\nI used to live in Italy and maybe that makes me more critical of Italian food (and I do think that a lot of American Italian restaurants are kind of stuck in a time warp where everything is 1966).  Going by these dishes, the cooking here is not good.   There are lots of positive reviews for this place that I'm surprised I disliked it so much. I'm not a massively picky eater and I firmly believe that you get what you pay for, but Caffe e Vino should be able to turn out better food than they did for the price.  In fact the should be able to turn out better food at half the price.   Maybe we caught it on a bad night but .......   \n\nWe won't be back.  There are so many other good places to eat nearby that there's no need to come here ever again.", "author": "Steven R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-25", "description": "Cozy little Italian restaurant just outside of Fort Greene Park.  Service was attentive and friendly and the food was authentically Italian - I could imagine an Italian grandma cooking in the back.  A great neighborhood option.", "author": "J K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-13", "description": "Came here for lunch on a weekday. The place was not crowded which was nice. The atmosphere of the restaurant is cozy and authentic. I ordered the spinach ricotta gnocci which was perfectly cooked and full of flavor. The sauce was rich and buttery and the little pieces of gnocci were super tender. My coworkers ordered linguini, rigatoni, cannelloni, and salmon. Everybody seemed pleased with their dish. Caffe e Vino does pasta the correct traditional way. This place is a good find in a Brooklyn area where options are limited. I would come here more often if it weren't for the massive food coma that comes after having pasta for lunch.", "author": "Tiffany T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-08-26", "description": "I am sitting at cafe y vino after a wonderful meal with my wife.   We shared a tasty pasta dish with mushrooms (the papparadelle) and a bacon wrapped pork loin.  Both dishes were exquisite.  Wonderful textures and flavors!   The staff and decor also hit just the right notes.  I really recommend the place to my friends and neighbors.  Come and enjoy.\n\nNow i am going back to my cheesecake!", "author": "Chris S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-05-13", "description": "On our way to another restaurant, we passed by Caffe e Vino and because I was hungry and didn't want to walk further we stopped here.  The menu looked good and on Monday nights they have a $23 prixe fix menu.\n\nHowever, I got the pasta caffe e vino (basically a mushroom parpadelle) because...hey, they named the dish after the restaurant! It must be good.  Now, I'm usually a meat-person so would typically get a dish with a protein; however, this dish totally changed my mind.  It was awesome.  It was a cream sauce and the mushrooms were cooked perfectly.  I highly recommend this restaurant if only for this dish.  It's the only thing I tried and would be happy only ordering that in the future.  (I had a taste of my friend's gnocchi and it wasn't my favorite).\n\nThe service was pretty good too, although it would have been nice if they brought out the bread sooner.", "author": "Jordan S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-09", "description": "This is our go to place for special occasions and romantic nights out. It's dark, cozy and intimate. The staff works hard to make you feel special and the food is amazing. Always great wine selection.  We are busy parents of three so when we go out ambiance and comfort are just as important as great food and this place is it for us consistently. Going back tomorrow.", "author": "Irene G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-06-08", "description": "It's review has nothing to do wit the food but rather one thing that really ruined the experience for us. My wife and I live in the neighborhood and have been here many times...we decided to bring my in-laws here for my mothers b-day and To share some big news with them. The food \u0026service were great (as its been every time we've visited here). When the bill came they added a 25% gratuity for a party of 5 without notifying us (it isn't stated on the menu either) along with a blue post it asking for a cash tip. Totally sleazy and in really bad taste...ruined the experience and needless to say that was the las time my wife and I will spend any money there. It's really a shame because we love the food.", "author": "K L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2008-08-05", "description": "This is a welcome addition to a random block of Ft. Greene....They have outdoor seating, friendly staff, extensive menu...and most importantly, thumpin dance beats!!  Lol.  It aids digestion?  \n\nAll of the dishes are good...my only complaint was that my gnocchi was too buttery rich.  Yes words I never thought I'd say but I actually ended up wiping the sauce off each little dough blob before putting it in my mouth.  \n\nSo get your butt over here!  Def one of the better local Italian options.\n\nP.S.  For lunch they also have paninis.", "author": "Joan C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-08-26", "description": "My friend and I were looking for a nice place to sit and eat before the MTV VMA show last night. I saw this place here on yelp and figured we'd give it a go since it's so close to the Barclay's Center. I was optimistic about it since many were impressed with the quality of the food. Honestly, the food was quite good, but the service and atmosphere are not the best. The waitresses were very nice - can't complain there. The place, however, is not air conditioned - or at least it wasn't last night. The door and large bay windows were open to a road with lots of noise and heavy truck traffic - not exactly conducive to a calm, cozy dinner.  Their music selection had us confused as well. It's odd to hear 60s - 80s top hits in a rustic Italian restaurant. Just doesn't match. The tables are also extremely small. Hard to fit appetizers and a main dish for two people on them. You're basically forced to finish a course and have the plates taken away without the option of pecking on it all during the meal. My vegetables also came 5 minutes after I had already been served my entree. Strange, yes? Lastly, their credit card reader went on the fritz and no one in the restaurant, including the manager (who had been lounging on a chair the entire time ?!?!) knew how to fix it. Had I not had my debit card with me, we would have been washing dishes for a few hours... I had to leave the restaurant, go next door to a shady shop with an ATM and pull out enough money to pay the bill. Probably won't be going back... Shame - it's actually a cute place.", "author": "Marisol G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-10-19", "description": "Hidden Gem !!\n\nThis is a wonderful Italian restaurant and not your typical American -Italian place you find on every other block - this is the real deal - homemade pasta, sauces, and amazing ricotta cheesecake. The staff is professional and very attentive - your glass is never empty and you're never rushed. Cozy dinning and during summer an outdoor garden.", "author": "Laura M."}], "servesCuisine": "Italian", "priceRange": "$11-30", "name": "Caffe E Vino", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "112 Dekalb Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/7NZ_1HM1SMNHCZU82Z7TBA/ls.jpg", "@type": "Restaurant", "telephone": "+17188556222"}