{"aggregateRating": {"reviewCount": 309, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-26", "description": "I can only speak for their brunch. It is great. Great price (I think 12.99) for a drink (mimosa, proseco, wine...), an entree, and coffee with biscotti. The bread they bring out is amazing. I usually don't like \"fluffy\" bread, but this had an amazing olive oil taste with a little salt and cheese. Not greasy or overly airy. I had the spinach salad with goat cheese, bacon and eggs, and my husband had 2 poached eggs with hollandaise sauce over ham and some salad type thing (I really can't remember what he had since I was too busy wolfing my salad down). The poached eggs were PERFECTLY cooked. A place with bad poached eggs makes me sad. The food was well flavored, not heavy or greasy, and fresh. Definitely a great brunch place. \n\nThe atmosphere is very nice. The interior has a great rustic Italian feel and even though we were the only people there (it was about 12pm on a Saturday), it didn't feel awkward. I really don't like it when the servers hover because they have no one else to attend. Our server was very attentive and pleasant. They also have a back room as others have mentioned, which I think would be a great place in the summer. If I lived in Fort Greene, I would definitely be going back.", "author": "Hyunmi K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-07-12", "description": "Cafe E Vino was an \"ok\" experience. I would like to warn you that if you're looking for a restaurant to fill your stomach up, this is not the right place. The servings are pretty small. They start off by giving you some cheese bread and butter. Two for each person. I ordered a pasta dish that had italian sausage ($15). The serving was extremely small and the sauce was a bit too salty. My brother ordered a fettuccini ($15). The fettuccini had a unique taste from normal ones and the amount was decent. DO NOT ORDER SOFT DRINKS. They gave a 234ml bottle for diet coke ($3) with no refill. Way too expensive imo. The ambience is nice with some relaxing music playing, but the whole Italian theme is slightly broken when the server says \"bon a petite.\" I don't know if Italians say that phrase a lot, but the last time I checked only French and Frenchaboos (French+weaboo) use it. To sum it up, if you're a poor student like me don't go here.", "author": "Charles C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-09-19", "description": "We have just moved into the neighborhood. We had lunch at this place because of all the positive reviews. The food was good indeed (though not spectacular). The reason for the one star is not so much that they added \"gratuity\" to the check themselves already (which I find a total turn-off, not unique but rare for a 4 person table), but the height of that gratuity: they added $10,00 to a $49,40 bill (that is TWENTY PERCENT). I suppose he thought he could rip off some passers-by, instead he lost four potentially very loyal customers from around the block. Shameless, don't go there.", "author": "Frank M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-21", "description": "this has become my pre- or post-BAM standard. Good food, delicious homemade pasta, good wine list, nice and comfortable ambiance, and my Florentine boyfriend feels very at home here. Instead of butter for your bread they give you a delicious \"tomato flan\" spread. There are multiple vegetarian entree choices - even the specials, sometimes!", "author": "Mary V."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-08-13", "description": "HORRIBLE! Had a party for 25 people and was roundly ripped off for wine not ordered or consumed. mediocre food. STAY AWAY - THIEVES!", "author": "Michael S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-03-22", "description": "This place is very expensive the portions were very small food was good.  My girlfriend and I ate here and the bill came up to 140 for that I could have eaten at Balthazar.", "author": "Christopher F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-08", "description": "Went here with two friends for lunch before I left after a weekend getaway.  Food was PHENOMENAL; each of us ordered a different pasta dish and they were all tasty in their own right.  The cappuccino is strong and delicious and the portions were quite generous.  Used a Yelp $10 for $20 coupon which made it very reasonable.  I will be returning upon my next trip to New York.  I wish I could give 4.5 stars; I docked them .5 star because it was quite dark!", "author": "Lisa H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-06-12", "description": "Yelp led me astray on this one.  The ambiance was superb.  The service attentive, but too aggressive.  The food was underwhelming.\n\nMy boyfriend and I were in the mood for Italian and found Caffe e Vino on yelp.  It's in close proximinity to my apartment and I had walked by a few times and was curious to try it.  We made reservations via yelp shortly before we arrived at the restaurant on a Saturday night.  There were two vacant tables and we were promptly seated.\n\nAmbiance: \nAs I said, the ambiance is superb.  It's exactly what you'd what your neighborhood Italian eatery to be like... it is small, intimate, with a slightly rustic feel.  The lights are dimly lit and candles provide a nice glow.  Excellent.  From there, however... my satisfaction with my experience comes to a screeching halt.\n\nService:\nThe waiters are attentive and polite.... but a little pushy.  I felt like I was being rushed.  I initially ordered a glass of cabernet and shortly thereafter my boyfriend and I decided we wanted a bottle instead.  I called the waiter over and asked to see the wine list.  He returned and handed it to me and stood over me waiting for me to choose.  I felt so rushed and slightly intimidated and ordered a bottle of cabernet.  Had he walked away and given me a little space, I would have likely ordered something else... but with him bearing down on me the way he was... I felt very uncomfortable and rushed. I'm not sure exactly what it was... but they were a little too aggressive and their tone of voice a little too gruff.\n\nFood: Please pass the salt.  \nYea... that sums it up. The tomato flan served with the bread was very tasty.  I adored the texture and flavor.  The bread was also very good... very soft, yet hardy.  We all know that breadservice can't carry any restaurant.  We shared the Fresh Mozzarella.  No complaints, but it's hard to get it wrong.  I had the Veal Ragu for my entree.  I cannot begin to tell you how much salt I shook onto that plate.  My arm was tired at the end of the night. To make matters worse, the salt shaker is the tiniest little thing with the tiniest little holes.  The meal was very bland and underwhelming.  I appreciated the fact that the pasta was freshly made, but I wasn't the biggest fan of the texture.  I prefer my pasta a bit more al dente than was served at Cafe e Vino.  My boyfriend had the Bacon Wrapped Tenderloin.  This was just okay.  There was nothing special about the tenderloin.  It's saving grace was the sauce.  It's served with vegetables, not the potatoes au gratin that was listed on the website menu.  I really wanted to skip dessert because I didn't want to give this restaurant any more of our money because I was so disappointed with my experience.  There was an Apple Tart on the dessert menu, however, and I couldn't resist.  I should have resisted.  The underside of the pastry was definitely undercooked.  That just ruined it for me, frankly.  \n\nHighlight:\nMy boyfriend is a huge Knicks fan.  He's been a fan since he was 7 years old... or something like that.  Anyway... shortly after we arrived, Herb Williams walked into the restaurant.  My boyfriend spent the whole night ogling him and trying to eavesdrop on the conversation at his table.  The boyfriend got a picture at the end of the night which made him really happy.  Perhaps Cafe e Vino redeemed itself in this small regard, but not enough to compel me to return.", "author": "Tanisha C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-05-11", "description": "Definite yum.\n\nMy boyfriend and I shared the raw beef, then I had the meatballs and he one of the specials--pork loin wrapped in bacon.  All three were a+. Minus the potatoes in my vegetable medley which weren't cooked enough--the rest of the veggies were great.  As was the tiramisu and the cappuccino. \n\nPlus! the service was incredible.  Literally, non-stop polite and attentive staff during the entire meal.  I'm talking they were filling up my glass of water as soon as it emptied--even though I ordered tap over pellegrino.\n\nWill definitely return.", "author": "Rebecca L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-06", "description": "A wonderful place to eat, relax and enjoy friends.  We head to Cafe Vino after the LIU games.  The food and wine help us forget our losses and celebrate our wins.  Either way great ending to the day.  Excellent service and food.  Highly recommend.", "author": "Stuart D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-09-13", "description": "Had great brunch here today. Friendly Service and good food but was a bit turned off that we were charged for coffee refills. Fisrt time that has ever happend to me. I would give 4 stars if it wasn't for this", "author": "david l."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-12-09", "description": "Delicious food!! I was recently in Rome on vacation, and I must say - this is up to par and beyond the restaurants I ate in in Rome. Everything is 5 stars - the ambience (quaint, romantic and cozy), to service (the owner, Giuseppe, talks to everyone and serves everyone personally), and the FOOD (fresh, rich, homemade, authentic, wow!). Must-have are the Linguine Gamberetti and the Sicilian cheesecake. I will happily go back again and again:)", "author": "Bettina B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-10-30", "description": "I walk by here everyday on my way to and from the train, and I always wonder why it's not packed. I think it's just because it's new, so until it hits Pequena like waits (which I anticipate any day now, judging by the recent friday night crowd), I can drop in anytime and be seated by the owner, who greets me personally. \n\nThis place is a really wonderful restaurant, consistently outdoing itself in quality and service. As Furyk C. mentions, the tomato flan is a great way to start the meal. In apps, the calamari is delightfully light and crunchy, charcuterie interesting, and salads well dressed. Every entree I've tried is \"good\" to \"really good\" and all are *very* reasonable. I've tried a few of the wines on the list, and while I haven't been blown away, I really enjoyed a frizzante white with our shrimp/seafood heavy dinners. \n\nI really can't say enough good things about this place. I'm glad to have it on the block. It's humble and great, not too pricey, and has really stunning girls in it - kind of like the neighborhood. A perfect Ft. Greene restaurant.", "author": "Jesse W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-06-22", "description": "We've come the conclusion that there are two caffe y vinos: the one when Guiseppe is there and another entirely different one when he is not. My family and I have been eating here for over 3 years now. For the first 2 years Giuseppe was always there and the food and service were always excellent. And the last year or so he has been there less and when we eat there when he is absent, so is the service. The food is always amazing, they're great about giving  complimentary drinks or desserts. But when it comes to asking about another drink or refilling your coffee or in last nights case, delivering your check they consistently drop the ball. Bottom line is I won't go there anymore unless he is there because the poor service outweighs the good food.", "author": "Anon P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-08", "description": "I LOVE the ambience of this place - cozy, rustic/modern, romantic. By far the best Italian I've had since I moved here. AND I WOULD KNOW--- I'M ITALIAN!", "author": "Char A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-12-11", "description": "I'm afraid that until they play more suitable dining music (not Eurotrash techno) and paint over the god-awful \"mural\" on the back deck I won't be able to rate this place any higher than 3 stars.\n\nAnd I'd like to, because the food is actually pretty damn good.\n\nAnd they do a great brunch. If you're into brunch.\n\nEDIT: Bumped up one star. The last couple of times I've gone for dinner they've played nice, ambience-enhancing music. Looks like they took the hint after the 50th person asked them to turn the techno down/off. Good on ya!\n\nGood food, charming ambience and impeccable service. For a place calling itself \"Caffe e Vino\", however, they could certainly use a nicer wine list.", "author": "Ryan J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-08", "description": "Charming.  Absolutely Charming.  Caffe e Vino's warmth flows through its service, it's food, and its ambiance.  A friendly face opens the door, happily bringing people to tables, and the wait staff understands the food and wine.  There are two seating areas, one in the front (smaller tables with romatic dim lighting), and one in the back (larger tables with the ability to host a bigger group of guests).  And the food!  Oh the food.  The complimentary tomato flan was strangely delicious.  The gnocchi and it's cream sauce were like little pillows of dough that melted in the mouth.  The ricotta cheesecake (WHAT?!) blew my mind.  There was little here to complain about, give it a taste.", "author": "Erin G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-18", "description": "Came here on a whim as my boyfriend and I were seeing a film at BAM and wanted to check out a new place for dinner close to the theater. We were both really pleasantly surprised. I will dream about that tomato flan until I return. Our entrees, the pork and stuffed chicken, were very good and so reasonably priced. The ambience is upscale enough to make you feel like you're kind of fancy, but really unpretentious and comfortable. For all of the terrible experiences I've had in Brooklyn with shitty service from people who couldn't care less, this was an experience I was waiting for. So attentive, really friendly, and classy service where they actually take away both your fork and knife between courses instead of putting your dirty ass utensils back on the table, which is what I experience most often. We will definitely be coming back, and will highly recommend to friends.", "author": "Ali C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-07-14", "description": "Nothing special, but good food, nice environment. Was nice with a group of 6 of us.", "author": "Pamela P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-08", "description": "Their homemade pasta is the best I've ever had. The sauce and noodles were both perfect.", "author": "Sandra K."}], "servesCuisine": "Italian", "priceRange": "$11-30", "name": "Caffe E Vino", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "112 Dekalb Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/7NZ_1HM1SMNHCZU82Z7TBA/ls.jpg", "@type": "Restaurant", "telephone": "+17188556222"}