{"aggregateRating": {"reviewCount": 309, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-05", "description": "Great neighborhood Italian standby, close to the new residential buildings around BAM, and never crowded, perfect for dropping in last minute without having to worry about waits or hassle, or cold nights in the middle of winter when walking down Dekalb is out of the question. \n\nFast, attentive service, excellent specials, meatballs are delicious, and the prices are very reasonable. It's surprising that it's not more crowded, actually- if this was in the WV or even Cobble Hill it would probably be full every night.", "author": "Trip O."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-12-31", "description": "The service was good and most of the food was tasty.  The menu is a little hard to read because of the printed background.  I was a little shocked that they added the tip for a party of five, and then on the signature receipt had a space for tip.", "author": "Janice H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-11", "description": "Our first experience with Italian food in Brooklyn and luckily we saw that there was a Yelp deal so we decided to pop in on this quaint little spot and see what all the fuss was about.\n\nLet me just start this with this statement: The Tomato Flan spread is the bomb and it's a free starter with some rustic yeasty bread. I mean the bread itself was good on it's own but when you added this tomato flan it was like a whole other experience all together.\n\nNow that I am writing this review a year later, it's hard to remember what I had but I do know that I enjoyed the meal immensely. And when we are back in NYC and mostly staying in the BK we'll definitely be heading over to eat at this amazing spot!", "author": "Brad C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-01", "description": "This lovely gem of a restaurant has quickly become my favorite to frequent for dates with my guy. The food has consistently been superb as well as the wine selection. Always a joy to eat here and feel the love.", "author": "Laura M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-03", "description": "This is a nice little inexpensive spot (~$80 for 2 dinners, 2 desserts, 1 wine (glass), 1 appetizer). The food was great and tasted authentic.\n\nThe waiters/servers were very friendly and helpful. The ambiance was a plus as well. It was not to loud, or too crowded.\n\nI loved the bread and tomato flan spread. I ordered the meatballs. They were as soft and tender as a baby's bottom. But, as good as they were, the Paccheri was AMAZING. I wish I could've switched plates.\n\n\nThey lose a star because it was absolutely freezing in there, and I would have liked a larger meat:vegetable ratio.", "author": "renje g."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-12-09", "description": "My new favorite in Fort Green.  Going there once a week on average, sometimes more.  Very friendly owner/manager.  Food is delicious.\n\nI am addicted to the ricotta and veal meat ball.  Have them every time.  \n\nAlways have great specials.  The only drawback is no liquor...  only have wines.\n\nThere is a great mix of clients, a great Fort Green neighborhood restaurant.", "author": "Olivier L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-03", "description": "A very good friend invited me here for lunch. I had the Pappardelle with Mushrooms and my friend had the Rigatoni with Eggplant. The pasta is homemade and the presentation was outstanding. We had the house Cabarnet, the serving was big. The cheesecake was out of this world...I could see someone coming here just for coffee and desert. Enjoy!", "author": "Izzy M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-25", "description": "A cozy, genuinely Italian place in an area not far from BAM but which is characterized by few other viable options. I'd call it a hidden gem. The food was very good and the prices definitely reasonable. Try the branzino, and their fennel salad. The service was a bit on the slow side, but that just leaves you more time to appreciate what you are getting. The only thing I didn't like was the automatic inclusion of a 20% tip on the bill. Not kosher.", "author": "Massimo P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-28", "description": "Nice ambience. Had seafood fettuccine and it has generous amount of very fresh seafood. The homemade fettuccine tastes great. Strongly recommend.", "author": "Joy Z."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-05", "description": "4.5\n\nA gem in a neighborhood full of mainstream restaurants with presumably the best complimentary bread in the city and tiramisu!\n\nCame here for dinner on Saturday after reading stellar reviews on Yelp before hitting a bar.  We shared a bottle of white wine and the arugula salad for our starter but before the salad arrived, we were served complimentary foccacia bread. Fluffy and doughy at the same time, the bread was especially tasty when dipped with the tomato hummus like sauce.  Soon after our pasta dishes arrived, spinach and ricotta gnocchi and linguine with shrimp.  While the gnocchi was an absolute delight, perfectly cooked more al dente with the right amount of depth and chewy goodness, the linguine was too mild and plain and didn't deserve to be in the menu (hence the minus .5 star).  \n\nAll is well because we ended the evening with the best part of our meal, the phenomenal tiramisu.  Very light and not too sweet with the right amount of mousse, espresso flavor, mascarpone cheese/ladyfingers, and bread, it was a dream to consume. One ingredient that was perhaps too subtle was the liquor, still, it is probably the best tiramisu I've had in New York.  \n\nCharming space, fast and friendly service, and overall amazing food, it's a wonderful spot for any occasion and for any parties.", "author": "Mona L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-17", "description": "We came here for dinner because they accept open table reservations and had pretty good reviews. I actually really enjoyed the food. The service was good but a little on the slower side. Overall pretty good dinner place", "author": "Ifigeneia D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-17", "description": "The bread and house spread were awesome. The polenta and mushroom appetizer was good. My SO's pasta with sausage and a balsamic reduction was amazing. The cheesecake was light and delicious. My homemade spinach fettuccini with clams was the weak point of the night, sort of mushy and bland. Nothing to be upset about and hardly enough to ruin a great night! Would go back.", "author": "Zack L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-15", "description": "A cozy Italian place close to BAM with terrific food and outstanding service. On my one visit, the pasta dishes were cooked to perfection, the ricotta cheesecake was awesome, and even on a very busy night (Valentine's Day), the service was friendly and attentive. And, as many Yelpers have noted, the tomato flan that comes with the bread is addictive. A couple of good beer choices on the drinks menu, and a nice wine selection - the house Chianti was excellent.", "author": "Mark H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-02-29", "description": "It's ok - definitely not 5 star. I went for a pre-BAM meal based on the promise of a great prix fixe menu. Supposed to be $25 for soup or salad, choice of 3 mains, tiramisu or biscotti. We get there and asked for the menu and was told \"oh, we don't have some stuff on the menu, so we aren't offering it.\" That's kinda bullshit. First of all, usually the prix fixe is like the most basic menu items which you don't run out off, and second of all, if you don't want to offer it, just say so. Our meals ended up costing a lot more than $25 per person.\n\nFood was good, but I guess if I'm going to pay $20 for chicken in Brooklyn, I'm expecting it to be really really good, and maybe accompanied by a carb? It was dry, salty, and the few accompanying vegetables were mushy. My aunt got the pasta special which was 4 homemade cheese ravioli for like $21!  It's creative Italian food in a homey setting, but nothing was AMAZING and everything felt a little overpriced ($9 for a pile of mesclun + parmesean shavings...) Most frustrating was that the second our salads were removed, the mains came out and they were all super dry and probably had been sitting under heat lamps for a while.\n\nMaybe I need to go back when I have more time and am feeling spendy, but the lack of the promised prix fixe, the high prices, and the aggressive timing of food were a big turn off.", "author": "Lila C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-02-27", "description": "My wife and I decided to have dinner there based on the overall good reviews. To be honest, the food was good, especially the tiramisu we had for dessert.\n\nThe whole experience was spoiled when we got the bill: they had included a gratuity of more than 20% ($14.00 for about $68.50). On top of that, they had put a handwritten note asking us to pay in cash *and* to include a tip, which was suggested to be 18%. I then offered a occasion to the waiter to \"fix\" this situation by asking if they meant to include the gratuity and if it was different from the tip (they knew we are French). But the bill came back with the included gratuity...\n\nGoing through the reviews, it looks like this is a recurrent practice of theirs, SO BE WARNED!", "author": "Alexandre B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-20", "description": "This is place is perfect for a sit-down dinner. A great refuge from the wintry cold! The waiters are kind and the pasta is fresh and perfectly Italian!", "author": "Maria L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-03-23", "description": "Fish was off. I ordered Sauvignon Blanc but got Chardonnay. Heat was oppressive. The place and the people are well meaning but there are so many other eateries near BAM. I won't be back.", "author": "Will E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-01", "description": "We had a lovely dinner at Caffe e Vino. The restaurant is warm and adorable. It has a very rustic feel to feel to it which felt even more perfect on a cold, winter night. The house wine is quite good so it's no risk to order a glass. The bread was really delicious and was served with a sun dried tomato spread (yum).  I would say that my only complaint would be that the chicken--I ordered the Stuffed Chicken, was on the dry side and another in our party wasn't a great fan of the night's special Ravioli. I still give it 4 stars - everything was tasty and the service was good. It's definitely worth going.", "author": "Marcia R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-21", "description": "We came here because of their proximity to BAM. We left full satisfied and happy.\n\nFirst let me say that 6:45 pm on a Monday night results in great attentive service.  There was only one other table for two that was occupied.\n\nThe food was sublime. Canneloni beans with sweet sausage appetizer was yummy delicious. Clams with\"toothy\" pasta was just right.  Pork tenderloin in bacon was not of this world. \n\nAll in all a great dining experience. Can't wait to go back!", "author": "Elliot P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-02", "description": "Warm and cozy on a cold winter nite just as promised.  The tomato flan was yummy and the mozzarella served with prosciutto is probably the best I've had anywhere, which is saying something as we often go face down on this dish whenever we travel to Italy.  The mozzarella was buttery and luscious!", "author": "Howard B."}], "servesCuisine": "Italian", "priceRange": "$11-30", "name": "Caffe E Vino", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "112 Dekalb Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/7NZ_1HM1SMNHCZU82Z7TBA/ls.jpg", "@type": "Restaurant", "telephone": "+17188556222"}