{"aggregateRating": {"reviewCount": 90, "@type": "AggregateRating", "ratingValue": 2.5}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-03-20", "description": "I didn't go in here during a major rush hour but the bagels I found to be pretty solid. The prices were maybe a tad high for Brooklyn but nothing out of the ordinary. If you're looking for an easy, quick bite to go or sit-in...I don't think Bagel Cafe on Atlantic is a terrible option.", "author": "Peter D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-03-10", "description": "\"Hot Corned Beef Sandwich- French white bread, hot corned beef, melted Swiss cheese, sauerkraut and side of coleslaw and pickles\"\n\nReality- dry white bread, two slices of bland corned beef and a slice of non discriminate cheese. Should have walked out when the guy making the sandwiches started reading the board. I wouldn't pay $3 for this sandwich, much less the almost $10 it actually costs.", "author": "Danielle P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-11-30", "description": "I used to get breakfast here until they started filling in their fresh juice cups with regular store bought pasteurized juice. So don't get their $4.50 fake \"fresh juice\". But their bagels are alright. Also, as everyone said, way over priced.", "author": "Yuri E."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-05-14", "description": "Average food with terrible front end service.  Very slow cash register with some staff not really seeming to care.  Not worth my wait but if you aren't in rush it's ok. (but just ok)", "author": "Jim C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-08-05", "description": "Shouldn't take 25 minutes for very simple egg sandwiches to come out of the kitchen. Nor should they make excuses for the delay and then dismissively tell us that we \"didn't wait that long.\"", "author": "Pricilla C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-02-19", "description": "SLOW AND OVERPRICED!\n\nWent here last weekend to get to breakfast sandwiches and tuna on a bagel...bacon/egg/cheese/whole wheat bagel.  I have 2 major problems with this place...my order took over 20 minutes, and tuna on a bagel cost $7.  Even where I work in midtown Manhattan, tune on a bagel with lettuce and tomato costs $5 or $5.50.  This place is a welcome addition to the neighborhood, but at this speed and prices, I won't be going back.", "author": "Justin S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-17", "description": "I just moved in the neighborhood and I love this place.They have a lot of seats and it looks really clean and The staff is really friendly and their salads are fresh and prepared right in front of you!", "author": "Sarah R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-20", "description": "Seriously it's a good place for lunch next to my job! Great selection and even better quality! I come here everyday for lunch and it's always busy but the guys at the register always remember my order and there is always a table (even if I have to wait for a table it's usually 1-2 minutes) near a sunny window so I can people watch during my lunch break! It is strange some reviews are so bad...", "author": "Rost B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-02-16", "description": "Two tofu cream cheese bagels (3.75 each), both with tomato slices (.50 each) should have been 8.50 plus tax. My total came to 11.44, and when I questioned their math I received the most unprofessional of responses. The customer service at this place is inconsistent at best. I'd rather walk 10 blocks to get a bagel rather than walk around the corner to give this place my business.", "author": "B P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-22", "description": "This place is really good, i was so hungry and i got a Bacon, Egg, and cheese. This place is AMAZING they deliver quickly. This place is must go to place for lunch and dinner. I noticed people writing bad reviews i cant understand WHY. This place is simply amazing.", "author": "Boris Z."}], "servesCuisine": "Breakfast \u0026 Brunch", "priceRange": "Under $10", "name": "Atlantic Bagels Cafe", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "200 Clinton St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/kfGZi903n-q6MaZiJjGiPg/ls.jpg", "@type": "Restaurant", "telephone": "+17182549000"}