{"aggregateRating": {"reviewCount": 90, "@type": "AggregateRating", "ratingValue": 2.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-17", "description": "First bagel shop in Brooklyn I've been too doesn't disappoint. Respectable smoked salmon sandwich. Vibe is just that if a neighborhood deli but at least the bagels and cream cheese are up to par", "author": "Jiho S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-01-01", "description": "Completely inept. After a debacle today never going back. Orders frequently wrong and today finally left after waiting 25 minutes for one sandwich. Horrible,awful service.", "author": "Meredith H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-11-05", "description": "Atlantic Bagels has the worst customer service I've ever experienced. Even though their bagels are pretty good, the staff is extremely rude and delivery is always slow. And just for that, I will never order from here again.. much better options in Brooklyn Heights!!", "author": "Jackie H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-25", "description": "They make a pretty mean bagel as the name might lead you to believe. A toasted bagel with cream cheese will knock your socks off.", "author": "Dominik D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-11-25", "description": "Waited 45 minutes for a simple egg sandwich on a bagel. Multiple people received their food before me, and one woman was especially upset after it appeared they had gotten her order wrong three times. The line wasn't even that long, and bagel cafes are supposed to be quick and efficient. The food itself was decent when we finally got it, but the wait time was just flat out ridiculous. I probably wont be back for a little while.", "author": "Mitchell W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-23", "description": "Atlantic Bagels gets your morning going with delicious breakfast sandwiches and coffee. The bagels are soft and whatever spread you desire it's done well. I love when turkey bacon is an option anywhere. The French toast could use a little more perfecting but the fruits added gave the breakfast plate lots of color. You can take your items to go or enjoy it right there at one of the tables that tends to seat 2-4 people. The open window layout pours the sunshine in, making your morning that much better. I would highly recommend Atlantic bagel for your morning takeout style grub.", "author": "Mia K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-07", "description": "Stopped by here for breakfast and everything was very average. I got the ham \u0026 cheese omelette which was $8 and came with 2 slices of toast and fries. Nothing really stood out to me, the cheese on the omelette was a bit too much. Unlike the previous reviews, I didn't find the service slow (I came around 12pm), but the food wasn't bad and wasn't great.", "author": "Emily F."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-01-20", "description": "the bagels are good, but the service is a disaster. I have been putting up with the service because my daughter likes to stop in on Saturdays but after today I am DONE. the cashier is the same person making the coffee (while a huge line to pay builds up) and they won't give you your food until you get to the register - which inevitably means that they give you the wrong food. Employees regularly tell you that it's someone else's fault when you ask them to replace your incorrect order with the correct one and then the whole saga starts anew. not worth it. at all.", "author": "Alisa G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-12", "description": "Very fresh bagels. I always get the bacon egg and cheese on a plain bagel and am always satisfied. They have many different cream cheese and bagel options.", "author": "Danny R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-12", "description": "I found my everything bagel with sausage, egg and cheese to be delicious along with my coffee on a busy weekday morning.  Everyone was extremely courteous and the service was quick and efficient.  I would definitely recommend Atlantic Bagels as a top Brooklyn bagels spot.", "author": "Lori K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-04-24", "description": "Disrespectful and Rude. \n\nI went in there today, April 24th, at 8:10am to order a bagel with scallion cream cheese. As it was being made the guys behind he counter referred to me as \"Chinito\" even though I am not Chinese. Then when my bagel was ready it was handed off to the girl at the counter who looked me right in the eye and then turned around to do some nonsense with the espresso machine. I waited incredulously for a full minute before asking about the status of my order. The guy who made it checked in with the counter girl who simply said, \"Uh huh.\"\n\nTerrible terrible terrible.", "author": "Phil M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-04-22", "description": "Very good bagels, made just the way I like them.  Not too doughy, with very crisp exterior. Delivery takes a long time, but the food is fresh. The nova is good, but was cut a little too thick for my liking.  We ordered the chocolate chip pancakes for the kids, and there was way too much chocolate.  Coffee is ok, but a little light for our taste.", "author": "Bob S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-12-29", "description": "Good food and coffee. But very disorganized and rude. You have no idea if they know you're waiting for something or if they are even making it", "author": "Kara M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-12-20", "description": "This is my update. Flattened bagels are excellent. My kids took 3 doz back to Atlanta. The service is abominable--slow and incorrect. I called with an order for 3 doz bagels, sliced. They call me on the due date to make sure I am coming in. I arrive, the bagels are not sliced, nor are they put together in bags. Next time I order by phone, they repeat the order.  I picked up the correct number of bagels and they were sliced, but the incorrect mix.\n\nTo get what I want, next time I'm in Brooklyn I would go in and write down for them what I want, in clear block letters.", "author": "Vivian O."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-10-13", "description": "I usually skip this \"cafe\" whenever I'm in the mood for a bagel because of the following: \n\n1. They work with no sense of urgency and will make you wait longer than necessary even for the simplest order. \n2. Coffee sucks. \n3. Everything is overpriced \n4. The quality of the pastries they serve is questionable\n\nAll in all, I've had more unpleasant run-ins than positive here. Kinda wish they'd shape up because there's potential here.", "author": "Adriane C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-11-14", "description": "Friends and I ordered breakfast from this place. When our delivery shows up, my sandwich is missing. \n\nCall up the shop, they're extremely unsympathetic and say they can't do anything about it..they'll send my sandwich when the delivery guy gets back. Alright, whatever, it happens I get it.\n\nDelivery guy shows up an hour later (been two hours since I originally ordered) with my sandwich. It's the WRONG sandwich. Can't trust ordering from this place again.", "author": "Dave V."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-07-21", "description": "I have been here over 50 times since it is in the neighborhood and is conveniently place along my walking routes. \n\nDoes this place mess up your order a lot? Yes. Is the system terrible? Yes. Is their coffee good? No.\n\nBut their bagels are delicious and decently priced, so you know what I keep going back even if they get my order wrong...because even if it isn't what I asked for, at least it tastes good!", "author": "Reid W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-20", "description": "My husband and I recently placed an order for a brunch that we were preparing for a small group of family. The food was excellent! The bagels were fresh, the lox was outstanding, and the omelets were delicious! What most impressed us was the customer service, excellent. Every request was accommodated down to the delivery. We will continue to order from them. Five stars all the way!", "author": "Jane L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-08-09", "description": "We live right next door and we (used to) come here a lot. I love the bagels - they're made fresh every day and are nice and crunchy on the outside and nice and soft on the inside. \n\nHowever - I have to echo the comments from the other reviewers: the ordering system here is absolutely disastrous and any order other than an untoasted bagel with cream cheese takes an obscene amount of time to be made (sometimes 20+ minutes!). I try my best to never write any negative reviews on Yelp because I know it's hard out there for small business owners but I've had such a consistently terrible experience here over the last ~6 months and ~15 visits that I have to make an exception here.\n\nWe've stopped ordering anything here except for plain bagels to go, which we then toast and prepare for ourselves at home. The system at the cafe is just too slow and not even worth bothering with. This place has a lot of potential and their bagels are great but they really need to fix their ordering system (or lack thereof) and speed up their food preparation.", "author": "Kevin L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-12", "description": "As soon as you walk in the aroma is amazing. This was one of the freshest bagels I've ever tasted.  The service is fast.  This has definitely become my spot for breakfast every morning.", "author": "Jeff F."}], "servesCuisine": "Breakfast \u0026 Brunch", "priceRange": "Under $10", "name": "Atlantic Bagels Cafe", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "200 Clinton St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/kfGZi903n-q6MaZiJjGiPg/ls.jpg", "@type": "Restaurant", "telephone": "+17182549000"}