{"aggregateRating": {"reviewCount": 90, "@type": "AggregateRating", "ratingValue": 2.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-21", "description": "Came for Friday lunch with a Groupon ($12 for $24 worth of food).\nThey have a very wide selection of bagels, salads, paninis, omelets (mornings only), sandwiches, pastries, and drinks. \nGot the $8 Roma Panini (grilled chicken, cilantro, onions, mozzarella, chipotle mayo between two flatbreads), which was served with nacho chips + spicy salsa. Great combination of flavors, but the bread was soggy, not crispy, even after they grilled it. Maybe it's because I left it in the container for several minutes before eating.\nAlso got the $10 Belly Lox on an Everything Bagel with Scallion Cream Cheese. They didn't skimp on the cream cheese and they put plenty of salmon. The everything bagel was perfectly seasoned.\nThe lemon poppy seed and cranberry jumbo muffins ($2.50 each) were also good.\nIt's fairly large for a deli with plenty of seats, and they made my order very quickly. I would definitely come again!", "author": "Cynthia Z."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-08-09", "description": "Arrrgh. I try...I try so hard to like this place. I've been trying to make it the bagel place I want it to be by sheer force of will like a Jedi mind trick. I want to live on a block with an awesome bagel place so so badly. Today I have finally realized I just won't win. \nFirst of all it always seems like a struggle to buy something here. I found out they are listed on one of the ordering apps so I thought I could beat the system (or lack thereof) by placing an order from my living room and going to pick it up in 20 minutes. The first couple times that seemed to work ok. It probably took me longer overall - but it was less time in the place watching other customers wander around trying to figure out how to order and get coffee and pay. Its sort of like a natural disaster, you just get a feeling of solidarity and want to stick around and help people. But the last 3 times I placed a pick up order it either didn't go through, no one checked the online ordering system, or it may have been misread as delivery. I was asked to call my house to see if my sandwich was there before they'd make me one. I was kind of expecting a free soda or cookie or something for my trouble but nothing was offered. \nSecondly, don't order the sandwiches here. An $8 turkey club is 2 slices of bread, 3 slices of turkey, a thin slice of American cheese and that hard, dry food service bacon that was cooked days ago and preserved. Its more like big chunks of Baco-bits than bacon. With the gatorade and chips, the total was $14. They only have one brand of chips (a 'fancy brand' like Kettle River or something) and they aren't bad...but I can't get Doritos and Utz Party Mix when I am in the mood. But there's an entire shelf of individual servings of breakfast cereals like you would get at a Super 8 in the morning. I don't get it. \nThe staff is always really nice (one of the stars is for them.) And I think deep down they want to make me a killer sandwich. But I always feel like they are scared to throw on an extra slice of meat - like the owners will catch them and fire them for having sympathy for a repeat customer. They don't set the pricing and they didn't create the insane ordering system or do the buying from suppliers. $2.75 now for a large drip coffee? That's Starbucks pricing. At a deli.  I have toyed with the idea of buying the $15 for $20 deal but I am convinced there will be some way the owners won't let me redeem it like it will only be valid on Tuesdays from 2-3 pm or something.\nI will also give them one star for their bacon, egg and cheese on bagel which isn't extraordinary in and of itself but its my go-to hangover food and I am just happy to not have to walk the extra block to get it. \nBut generally speaking, there's something odd about this place. Prices are too high. Food is not good. Options are not robust. Service is not fast. And its still there. Its like the whole place \"fell off the back of a truck\" if you know what I mean. \nI am done trying to have a bagel place on my corner. Go to the deli counter at Key Food or that bagel place on Court Street. Everything will be twice the size at twice the speed for $2 or $3 less per order.", "author": "Christine T."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-14", "description": "This place is a disaster. I've been coming here for years, and despite consistently incorrect orders, overpriced not-so-great bagels, and slow service, it was the original cashiers and three deli guys, most who have since moved on, and the coffee that kept me coming back. That changed today. I went into the restroom to wash my hands before eating, and they were out of soap. I told the cashier who seemed to ignore me or not hear me, so I repeated it to the deli guy. He said: \"If it's out then we don't have any more.\" I asked if he could get someone to change it or if a manager was present. He said no one else was there and they didn't have any soap. He handed me my wrap which he may have made with or without gloves. I stood there uncertain what to do thinking how can the employees even wash their hands if there isn't soap? I suddenly lost my appetite and asked for a refund without touching my food. Disgusting place and apathetic employees. It's worth it to walk a few more blocks to Court Street Bagels.", "author": "D P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-06-25", "description": "Service is so bad in the 10-15 times I've come and the stuff is average. I wanted it to work out Bc its on the block but frustration at every step. Ordering, cashier and always 4-6 workers who don't care", "author": "Peter K."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-12-03", "description": "Yah know, it's a bagel out of a mid-rage deli in New York. In my opinion, about 80% of those taste pretty much the same and this place falls firmly in that very average but totally acceptable camp. What knocks this down a few stars is that when the server asked if I'd like sugar in my tea, I didn't expect she would DUMP  SEVERAL HEFTY TABLESPOONS WORTH of the powder into my drink before handing it back to me. Holy crap.", "author": "Laura H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-04-01", "description": "Coffee warm,wheat bagel they forgot about it had ask for it that's a lot of money and a place kind  not neat", "author": "Lisa T."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-07-07", "description": "Bagels are nice, but anything other than cream cheese over priced - $6.95 for bagel with plain ham and butter", "author": "Julia H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-09-07", "description": "Overpriced, poor service for street vendor quality food and coffee.  Bagels are not much better than supermarket.", "author": "Peter C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-08-17", "description": "Wow, this place is awful.\n\n1.) Everything on their menu is overpriced, and you can get better quality everything at Court Street Bagels (on Amity and Court), including regular priced coffee.\n\n2.) They tried to overcharge me twice for a breakfast sandwich. It had been listed as $5.50 and on two separate occasions they tried to charge us $9.00 for each. \n\n3.) It also took them 30 minutes to make the two sandwiches, and when I politely checked in on the progress of our order, the cashiers were curt, dismissive, gave me looks, and acted like I was bothering them. The guys actually preparing the food are nice (unlike the cashiers) but are not necessarily competent.\n\n4.) When we finally got our sandwiches, the bread was stale.\n\n5.) They are indisputably racist. 13 people after us got their orders before us and this African-American couple in front us. Both of us had to wait until the line behind us died down and had to ask about our orders. And all they ordered were two bagels with cream cheese.\n\nDo not go to this place unless you feel the need an arm and a leg on a horrible experience. You're in Brooklyn, there are so many better options. It's worth it to walk the extra two blocks.", "author": "Adam C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-17", "description": "I eat there all the time when I'm in New York. Friendly people and great bagels of all types. They also have all kinds of other things from croissants to knishes.\n\nThey open at 6am, which is hard to find in that part of Brooklyn.", "author": "Andrew G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-01-08", "description": "This place is down the street from my sister's apartment, so we decided to give it a try. All I wanted was a breakfast sandwich (bagel with egg, sausage and cheese), but they had a credit card minimum, so I ended up also getting an order of home fries. I'm not complaining, I love me some home fries haha. Everything came out fairly quickly and the employees were friendly. They have a large variety of different types of cream cheeses and lots of different bagel flavors as well. All the food I got was yummy and seasoned well. I would definitely come here again if I lived in the area.", "author": "Sam Y."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-04", "description": "Great bagel shop with fresh bagels, a multum off cream cheeses, with breakfast and lunch specials. Had a whole wheat everything with scallion cream cheese and it was delicious. The only reason they lost a star was because they skimped on the cream cheese - could've added more. Will come back if in the area though!", "author": "Lukasz K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-03", "description": "This place is great. I go here almost every day. The food is always fresh, the staff is friendly and accommodating, and they have almost everything you could think of. \n\nFor a place to grab a quick bagel or deli-style sandwich in the neighborhood, Bagel Cafe can't be beat.\n\nTips:\n-- First, order on the left end of the counter, then pay at the register while they're making your food.\n-- By default, the bagels are somewhat lightly toasted, so ask for extra toasted if you like it kinda brown and crusty. They're totally happy to do this.", "author": "Larry L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-27", "description": "I work and usually hang out by the Clinton street area as all my friends live here.  This place hasn't disappointed me yet.  I had their Italian specialty sandwich and I was very impressed compared to other big places I been in the city.  Their staff is extremely friendly and work very fast.  Whenever I order delivery to my office their deliveries are extremely fast and they definitely know how to pack up their take out.  Highly recommend weather your looking for quick good breakfast lunch or dinner.", "author": "Alex B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-02-25", "description": "Fail Cafe or Bagel Fail???  BOTH!\n\nThis place took over the spot for the short-lived \"Montreal\" Style bagel place. Note to those people: We're New Yorkers, so selling Canadian bagels is going to work as well as a \"New York-style\" Poutine shop in Quebec. Anyway...\n\nI'm sure the rent on this place is outrageous...and the prices match. As the rule with almost every bagel shop...don't think of it as a deli. So never order a sandwich. $9.75 for \"Italian\" sandwich - for which they didn't have the right bread...used terrible salad dressing, and was so meager, they used 1 slice of each meat.  I cannot comment on the bagels, but they seem to be made on premises. I would only go there for a bagel if in the hood...and even then  - La Bagel Delight or Court Street Bagels is a better option. Don't know if they'll make rent on bagels alone.  $17.15 for this joke a sandwich, chips, and a Naked juice. I don't know why I paid it. \n\nI'd like to see something good in this space - I feel it can only be a legit restaurant. The only redeeming quality is that is has seating, and a few people were in there working/studying. Grab a slice or two at My little Pizzeria for a better quick lunch.  I feel bad as the only people they might be ripping off are the LICH employees - and they deserve better. \n\nThis place will close by summer.", "author": "Allen P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-04-23", "description": "This is a basic deli-style spot.  Not sure why all of the previous Yelps about this place are so negative. It's not more expensive than a lot of local deli/cafe spots that I know of. There's ample seating and it looks like the bagels are made on the premises. There are tons of options too. They also have smoothies and some bakery items. Have they reinvented the wheel? No way. But is it godawful? Absolutely not.  However, be sure to inquire what exactly is going onto your sandwich.  I personally ABHOR mayo and it wasn't listed on the ingredients list of my Veggie sandwich.  I got my sandwich to go and didn't realize until I got back to the office that it had mayo smothered and melted into the bread.  Ick!  I didn't feel like going back to complain, but I will definitely keep in mind for the future.", "author": "Joolz M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-01-13", "description": "Horrible customer service- I've never written a review online before but making a point of it here. They make mistakes and have absolutely no sense of how to apologize and make it right with a customer. Extremely shortsighted - always better to keep a customer than lose one especially over nonsense.", "author": "Amy H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-04-18", "description": "I think this place has decent bagels, but do NOT go here if you're in a hurry.  I've been a handful of times (when they weren't particularly busy) and if I ordered anything other than a bagel with cream cheese, it took at least 10-15 minutes to get my order.  For a shop like this, quick service is important.  If you're looking for a spot to relax and take you're time, then this is it.", "author": "Sara C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-10-15", "description": "I tried to give this place a chance, I really did.  Ordered a couple of times (delivery) and almost every time they either get something wrong or overcharge.  Even by 50 cents, it is still overcharging.  Rolls with butter toasted, come soggy.  Salads come with butts of the onions inside.  Bagels with NO butter come with butter.  Enough already.  I give up on this place.", "author": "Christina K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-24", "description": "I'm very happy to have this place just around the corner from my house. It's clean,  beautiful and has everything I can think of. No need to stick to same breakfast every morning! One more everything bagel please, toasted, with cream cheese, lox and tomato!", "author": "Michael R."}], "servesCuisine": "Breakfast \u0026 Brunch", "priceRange": "Under $10", "name": "Atlantic Bagels Cafe", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "200 Clinton St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/kfGZi903n-q6MaZiJjGiPg/ls.jpg", "@type": "Restaurant", "telephone": "+17182549000"}