{"aggregateRating": {"reviewCount": 90, "@type": "AggregateRating", "ratingValue": 2.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-12", "description": "Being from Long Island, I have high standards for bagels. Standards met here!  Classic tougher outside texture, soft fluffy soft inner (even though I order scooped!) Good lox portion on bagel, convenient location, and decent deli coffee. Now I want another bagel!", "author": "Alexandra S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-04-08", "description": "I ordered a bacon egg and cheese and they decided to put red onion in it . I ordered the sandwich on a plain bagel they sent it to me on a everything bagel. I was pretty upset by this because the delivery already took an hour and half. I live nearby so I walked back to fix my order but all of the employees were ignoring me and when I got frustrated one of them just started laughing at me and started antagonizing me after I asked him whats so funny. He was talking back at me like he was going to fight me or something. He started talking about me right in my face to the other staff and saying he wasn't going to take my order etc. I just wanted a refund at that point and all of the employees were ignoring me which just made me more frustrated so I asked for the manager who was very old and spoke little to no English.  She had the nerve to ask why I even ordered through seamless if I live close by? I come here a lot because it's convenient and I know the guys that work there, they know my order. Usually it's an okay experience but I didn't recognize any of the new staff and they were awful. This place started off pretty bad, got a little better and now it's terrible. Don't order from here it's over priced and the food isn't worth it.", "author": "Devon L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-11-26", "description": "This place is just way too overpriced. It doesn't matter if I'm just getting an egg white on a bagel, it should not come out to $6. Even with it coming out to that much, I would expect it to be THEEE best bagel I have ever eaten. Nope. It was just subpar, and even better, they still skimp out on the ingredients. The only time I'll ever stop here is if they participate in a Groupon deal where you can save some money.", "author": "Tiffany M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-10-16", "description": "I would give them a negative star if I could. Waited over 30mins for a bacon egg and cheese. Seriously it's not even that great. Bagels are hard and not fresh. Sandwiches take forever. And the staff just stands there. Not good.", "author": "Cindy M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-24", "description": "This place isn't terrible. I'm giving it four stars because the bagel actually tastes very good. I went for a classic nova scotia bagel with the works. Paid about 10$, but it's worth it. \n\nOne star off because the line system is very confusing and they didn't offer any napkins. I mean, I would go back. They also had very delicious and fresh looking muffins and desserts there.", "author": "Emmy K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-10-31", "description": "This place charged me $5 for a bagel with cream cheese (a dollar extra to get two kinds of cc) and then the bagel came out with the SMALLEST most anemic amount of cream cheese I've ever seen.\n\nConsidering this is the only place I have ever been to that charges extra for two kinds of cream cheese (I didn't ask for more cc, just one kind on each side) I am extra frustrated that I got such a skimpy amount.\n\nThere are like 1,000,000 better places to get a bagel in NY", "author": "Kallie C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-25", "description": "HUNGRY?! The right place to get your belly full and enjoy a peaceful and warm atmosphere especially when It Is so cold outside! Hello \n\nI come here all the time and Being honest I got dissapointed by the reviews on Yelp in general. Frankly speaking, Some of them are just not fair. I am not afraid to say that as I am a Regulah' at this place and I have never had any kind of problems with my orders there and/or any misunderstandings with the staff. And yeah, my coffee is always hot unless you will ask for a cup of iced coffee. \n\nI visit them 3-4 times a week and I just ordered my favorite Traditional Nova Scotia sandwich with lox. And every time I order the sandwich I get so much ingredients on it so I even keep a half of my sandwich for the next day as my lunch at work.\n\nOf course, you can buy  bagels and sandwiches almost everywhere nowadays but I compared how much lox comes with their sandwich at this place, and another bagel shops, where I used to buy the same kind of bagel with lox, the result is that you are getting much more lox, which you can even have on the side and use It for your second bagel or sandwich at home. And they cut the slices right in front of you. So you know what you are eating and paying for.\n\n  The main concern is that I pay a couple of extra dollars and I am getting at least twice more than at the places around the neighborhood. Where some places have lox sandwiches for 6.50 and all you get is just frozen, preprocessed 2 sometimes 3 small slices of \"fresh\" lox fish. Seriously. That's where you get,dissapointed.\n\nWhat about their staff - friendly, positive people who really take care of their customers. For instance, I ordered some food from them last week and my cinnamon raisin bagel with butter was missing when I asked them about it they made me another bagel with butter toasted fresh and offered a cup of coffee because of that, It  Is so nice of them. Then, my bagel was found and I got 2 bagels and a cup of coffee for the same price just because they didn't want me to feel dissapointed.\n\nNo one place has done this for me in the neighborhood ever.", "author": "Russ R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-02-19", "description": "They got it together! This place was a disappointment when it opened. The space had been some sort of medical office but is much better suited to food, so when a \"Montreal-style bagel\" place was said to be coming in, it seemed like a step in the right direction--and some competition for the very chic Mile End in Boreum Hill.\n\nBut this place's bagels just weren't any good, and for a businesses with such a highfalutin menu, it was a drab and ugly spot. But worst of all was the wait. This is a bagel place at the corner of two busy streets, but if you ordered anything, you'd wait so long that you might feel like you have to ask at the counter to make sure they didn't forget about you. Even if you just ordered a coffee!\n\nI don't know why I ever came back here, but after a brief shutdown awhile back, they seem to have figured out who they are and what people need them for. This is now a solid bagel place, with no mention of Montreal. The place still looks like a lunch counter, but that's what it is, and that's what's right for this spot. Best of all, they no longer take forever to do what they do.", "author": "John S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-12-10", "description": "Two stars only because the bagels are decent. Otherwise.... come to Atlantic Bagels ready for slow or botched service. Here's a sample of things that have happened when I've been at Atlantic Bagels: \n\n-They forget about my order in the back and it takes 20+ minutes to get a toasted bagel with cream cheese.\n-The workers start arguing with each other while I'm in the midst of ordering and when they do finally pay attention to take care of my order someone in front of me orders two coffees and a pumpkin cheesecake, and since only one clerk handles the register AND drinks AND dessert orders she has to take each cheesecake slice out one at a time for the customer to decide what they want.\n-A long line of people are waiting to pay or put in their drink orders and there's only one clerk working the register. Another clerk is standing at the other register counting coins. \n-I leave with my order, open up the bag and it's the wrong order.\n\nWith so many people (sometimes 5 or 6 at a time) working behind the counter you'd think they'd figure out how to get bagel orders out the door without so many mistakes and delays. Rarely happens.", "author": "julianne h."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-03-25", "description": "This place is expensive but i mean look at the area its in. So this happens to be the place where we order from during the week just because its on the way on Atlantic Ave. The guys that work making the food are cool and very helpful. The young Asian girl at the register is kinda lost. Like she doesn't know what's going on and gets overwhelmed quickly. So the 1st time we ordered the bill was about $22 and yes this was for breakfast! All we got was 2 breakfast sandwiches of sausage, egg and cheese on rolls and 2 Gatorades. Can you believe this??? Then our 2nd time we ordered an Omelet wrap with a side of home fries and a plain bagel with strawberry cream cheese small coffee and a Gatorade....$18!!!! The omelet was good it had spinach, mushroom, tomatoes and cheese. The home fries were OK(not great) and the plain bagel was eh. Plain bagel tasted a little like onion(maybe it was kept of cooked next to the onion bagels). Not favorite and don't think we'll be ordering from here anymore.", "author": "Veronica R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-12-17", "description": "Stay away! Not only did they not give a straw with the smoothie but a bagel sandwich with no actual bagel just the meat. More then ten dollars for just prosciutto meat that wasn't even cut thin. How this took longer than an hour to get here is beyond me.", "author": "Mer T."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-08-08", "description": "Wowza, this place is pretty awful! I live around the corner from it and was super excited to have a bagel place nearby. I ordered a bagel with butter and it was TERRIBLE. \n\nFirst of all, the bagel itself wasn't very good. Maybe i'm a bit of a bagel snob, but come on. Secondly, they used FAKE butter. It tasted like some disgusting magraine spread or something. I literally couldn't eat it - it tasted so full of chemicals and it kind of melted into the bread (even though the bread wasn't toasted..) and gave it a funny color. \n\nI also ordered an iced coffee when I was desperate last week and just the coffee came to $5 - how is that even possible? Disappointing that they are this way but hopefully something better will come to replace it.", "author": "Allison J."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-05-27", "description": "I live in the neighborhood, and keep wanting to give these guys the benefit of the doubt to support local businesses...but every time I go in there it's just MAJOR disappointment after disappointment.  \n\nA simple cup of coffee...I always order large, and am charged a different price each time I go in there.  And on more than one occasion, they've given me a medium-sized cup - and when I tell them it's not the large, I get disbelief until they actually pull out a large-sized cup and can visibly see that they've given me the wrong size.  And it is always borderline cold.  Really?  It's coffee, the easiest thing in the world to not \"F\" up.\n\nI've tried getting carry-out desserts from them - slices of red velvet cake, carrot cake, cheese cake.  And every time, even though they pull from what looks like a relatively new/fresh cake, it's stale as ever.  As we speak, I just got a slice of what I though looked like fresh carrot cake from them, and the cake is actually CRUNCHY...stale as the day is long.  Completely inedible.\n\nI've ordered sandwiches from them a few times, and for the price they are remarkably bland, boring, and uninspired.  \n\nI feel lousy giving such a bad review to a local joint...I really want to like these guys so much.   But given the surrounding competition, these guys need to step up their game big time.  They're in a prime location and could do SO much better...but even 1 star feels generous.  \n\nHope they read this and take heed!", "author": "Lola F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-11-15", "description": "Bagels are solid and cream cheese very yummy, but service is really hit and miss. They get overwhelmed easily and then it can take a really long time to get your food. Quality is also very inconsistent, too much cream cheese, barely any. I would recommend checking your order before you leave.", "author": "Neetu M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-17", "description": "Close to our place and very friendly staff.  Once you figure out the ordering technique (go to left of counter, order, get a number/bag with price, pay, wait for number to be called) it's pretty chill.\nWhat I like are the bagels. Montreal-style I believe. Little smaller that the mega-bagels I'm used too and that is a good thing for me. Lots of options, smoothies are solid too.", "author": "Adam G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-04-30", "description": "They have tofu spreads. Bagel with tofu is same price I pay in park slope / gowanus. A little smaller but acceptable.\n\nAgree with rest of reviews - expensive in general, but it's cool they have everything.", "author": "Dan E."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-09-19", "description": "Not the freshest bagel at 12 on a Saturday. I was sorry I didn't get it toasted. They also got my order wrong the first time. Disappointed", "author": "Elizabeth R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-10-19", "description": "This place used to be my default bagel spot. They're open at 6, have tofu cream cheese, and make some decent bagels. Though I never dine in, there are tons of seats available that present it as a good contender for a casual breakfast date. Unfortunately, there were a few things that eventually made me part ways with them for good. \n\nFirst, I totally agree with the yelper who talked about the disastrous ordering system. I usually got my bagel with tofu cream cheese in the early morning hours, which was just fine, but I made the mistake of coming a little later in the morning a few times recently. Just trying getting to the counter was a bit hectic as I had to meander around the folks who randomly hung around the glass display. Did they order yet? Are they waiting? Are they in line? I felt like I had to ask that question a few times before I could reach the front, and then to get my order in was chaotic as I tried to catch the eye of one of the busy counter guys. It wasn't terrible, but it could have been more organized. \n\nI always order the same thing at any bagel place - toasted sesame bagel with plain tofu cream cheese. I don't mumble, I don't have an accent, and my hunger usually makes me overenunciate and overproject, if anything. If you didn't hear me or you don't remember my order, I'm happy to repeat it for you. But the last three times I visited this place, I would open my bagel order at work to find that either they gave me the wrong bagel, it was untoasted, or most recently (the most egregious error of all), filled with real cream cheese and salmon. As someone who's been trying really hard to adhere to a vegan diet for nearly two years, taking a bite of that bagel and discovering half a piece of fish was an angry affair. One might argue that I should have looked first, but I don't think it's a good thing for an establishment if I always have to distrustingly check my food over before I start eating. \n\nThe servers here are generally efficient and I have no complaints about the service as far as general courtesies go (though order accuracy has obviously been a thorn in my side). I've had the coffee a few times and decided I should never assault my taste buds with it again, unless I'm truly desperate for caffeine. People have already mentioned the prices. I thought 3 and change for a bagel was standard until I found my current favorite bagel joint on Montague, which offers my same order for a little over half the price, with bigger bagels to boot. If you live nearby and you're really jonesing for some breakfast or pastries (they've got an entire display case dedicated to cake slices, sweets, and muffins), I would feel comfortable recommending this place. But as for me, I've found my greener and cheaper bagel pastures and you probably won't see me here again.", "author": "Jane I."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-02-03", "description": "This review is based on visiting this place once on a Saturday. I bought two bagels (unsliced). I got home about an hour later and they felt and tasted tough and stale. \n\nMaybe had we eaten them sooner they'd be better but my experience with good new york bagels has been otherwise.", "author": "Evelina R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-02-21", "description": "OK-looking food, terrible service\n\nI stopped at this establishment earlier today and saw some interesting-looking items; ended up ordering about $12 worth of stuff -- after the personnel behind the counter were good enough to attend to me and interrupt their terribly pressing conversation.\n\nSo far, so good -- until the time came to pay. I had been told that $5 was the minimum for a credit-card charge and, in any case, was planning to purchase more than enough to qualify. No one had bothered to tell me, however, that the credit-card machine had been playing up; though the cashier tried two different credit cards of mine, one of which had worked about 15 minutes before, in a different establishment, neither was \"going through.\" Only then did the same kind soul who had filled my order bother to mutter something about how their ISP was supposed to send someone to check on the problem. \n\nGee, wouldn't have checking their equipment before filling my order have made more sense? At least, unlike some I know, I put the items I'd been planning to purchase back on the counter, instead of walking off with them. That they've lost my business (and lost me as a customer), as well as wasting some of what they'd prepared, serves them right for their inattentive, rude, clueless behavior.", "author": "Maria P."}], "servesCuisine": "Breakfast \u0026 Brunch", "priceRange": "Under $10", "name": "Atlantic Bagels Cafe", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "200 Clinton St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/kfGZi903n-q6MaZiJjGiPg/ls.jpg", "@type": "Restaurant", "telephone": "+17182549000"}