{"aggregateRating": {"reviewCount": 90, "@type": "AggregateRating", "ratingValue": 2.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-22", "description": "My go-to spot for a quick bite in the area. Food is consistently good, and the place is clean. Service is mostly good, and always prompt. We've also gotten breakfast delivered to the office for morning meetings, and it was always on time, and the same good quality as ordering at the counter.", "author": "Marie P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-12-11", "description": "The food here is actually pretty good.  I haven't met a bagel sandwich that I've not liked.  My review is for the service.  I dined here recently and noticed that they removed all of the prices from the boards on the wall and when I got to the register to pay for my turkey reuben on an everything bagel, the lady wanted to charge me $10+ dollars, claiming it was a speciality sandwich and the only way to ring it in was to list it as \"pastrami\" which tacked on additional cost.  I didn't even order pastrami!  Y'all, a turkey Reuben is turkey, Swiss cheese, sauerkraut, and Russian dressing!  You're telling me that there is no way to ring in a turkey sandwich? Lol \n\nAfter looking at the menu prices online I realized how insanely absurd the up-charges were.  I guess what was so frustrating is the complete lack of concern and inability to articulate why!  For Brooklyn, $12 isn't a lot for a sandwich but it's the principle.  And put your prices back on the wall.", "author": "Jen D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-04-26", "description": "This place should be shut down immediately. I ordered from them yesterday and did not get my salad order right. I wrote a review on Seamless and they must have seen it. I was just stating the truth - missing items i.e. protein of turkey and replacing kidney beans with chick peas (uh, should have checked with me first if I had a food allergy)?\n\nSo here's the CLASSY thing they have been doing to me all day is call me, I block their # and call them to stop. They denied any of it,  how else would I have your # to call back, stupid???!!! \n\nFor a so called 'business', you are VERY TACTLESS and own up to your mistakes. I hope they shut this place down!!!", "author": "Gnar L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-04-20", "description": "This review is about the delivery service.  I ordered at 6:45 am and my delivery came   at 8:25 am, an hour after it was supposed to.  An interim phone call to the place revealed that \"it's out for delivery\" but no real concern.  And the order took another 40 minutes after I called.  They don't seem to understand that they are in a competitive, customer service business.", "author": "Jared H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-19", "description": "Been coming here for the past years.bagels and food are always fresh and workers are very polite... just the perfect spot to go to..", "author": "Estefany M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-19", "description": "My first experience Atlantic Bagel Cafe was very pleasing I will recommend this place to my colleagues and Friends as everybody was friendly and polite the food was fresh and prepared quickly I was very surprised", "author": "Christian M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-09-15", "description": "The food is super mediocre. La Bagel Delight has WAY better food (way better bagels). That aside, the service is my real problem with this place. I live nearby so I have a habit of going (at least to get coffee) 4-5 Times a week. I decided today I'm never going back because of how rude most of the staff are. \n\nMy suggestion is La bagel delight if you want a bagel, and Brooklyn Heights Deli for sandwiches.", "author": "Charles H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-04-04", "description": "I ordered a bagel toasted everything with veggie cream cheese. Got a small \"fresh\" OJ that tasted just like tropicana OJ and ended up paying $9 and change. So hoping to be a good bagel, it turned out that the bagel was just warmed up and not toasted. And because of that you could tell that the bagel was at least 2-3 days old. Disappointed on the food quality. Overpriced for what they're selling. I don't recommend", "author": "Soni S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-20", "description": "Great food.. i love their fresh bagels.. and the staff is very nice.. great atmosphere, very nice place to have breakfast with family and friends..:", "author": "Enrique S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-14", "description": "Great bagels, and good cream cheeses. The counter service is fast, and they have ample tables for siting an enjoying the casual breakfast. They run a special one night a week on bagels after 5pm - a good deal for take home bagels.", "author": "Darryl R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-01-09", "description": "Solid NY bagel shop with nothing new to report. They serve gagels, sandwiches and a few things in between. There is ample seating and it's relatively clean. The lack of prices on the board was a little annoying, but I walked in with a clear idea of what I needed to rev me up that morning: a lox bagel with all the fixings. It was about $16 for a lox special and a bagel with butter. The man taking my order was attentive and friendly. I took my order receipt to the payment counter and the young woman took her time finishing her texts before helping me, groaned when the credit chip machine took a little while to connect and handed me my receipt without a glance or a comment.\nThe lox bagel itself was well balanced. There wasn't too much of any one item. I had a crunchy onion, slightly salty capers, and an even blend of lox and cream cheese. I won't seek out this shop but I don't see a reason to avoid it either. Convenience is key for us NY-ers.", "author": "Julianne B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-09-02", "description": "Pretty good. Nice staff. Not sure they understood my order I had to clarify it several times and it was incorrect when I received it. I think they tried so I ate it. I wanted my ham on the side not on the bagel. I got both??? I am used to a saltier creme cheese so there's was too bland for me. The texture was smooth not whipped. Good bagels but I will look around. Coffee was good... but I will check around.", "author": "P M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-10-14", "description": "It was my second time coming here today, and it will probably be my last.  The food is okay, not amazing.  I am not a bagel fanatic, but the plain bagel with butter they included was really nice.  Might come back for just that.\n\nOrdering was a bit of a mess.  I waited in a small line of people, and was confused where to actually order and which of the 5 guys behind the counter would take it.  After 3-5 minutes where I keep thinking someone should be taking my order and I am looking from person to person......they ask some lady who just walked up a second earlier for her order, and I am thinking \"Really.\" So I feel I have to get a touch pushy to order.  Annoying. \n\nFood took average amount of time.  When it came out from the kitchen, it was in a plastic covered container.  One of the guys who seemed like a manager started pick at the food.  He was wearing one glove, and using that hand maybe he was just putting stuff into place, but threw away one item.  I don't know, but I didn't really like it.  A second later he answered the phone with the same gloved hand.  Not sure as I didn't stick around to see if he changed it, but I don't think so.  I ate the food anyway as I know this is common.  But I figure the less employees to touch my food, the better.  \n\nThe price was different this time than the last time when I ordered the same thing.  Not sure which one was the correct price, but I hate that.", "author": "Michael C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-05-21", "description": "Meh, I love bagels so it's hard to disappoint me on that front but the service is a bit slow, it's a little pricey and both times I've come here it's been hard to tell if they even know I'm still waiting for my food.\n\nFor a point of reference on prices, we got a ham egg and cheese bagel, sausage egg and cheese bagel, and a salt bagel with cream cheese and it was $14. A little much, but no complaints on the food itself. The bagels are crispy on the outside but still soft on the inside. Really good. I tried the scallion cream cheese before and really liked it as well. The coffee could definitely be stronger.\n\nI'll come back for sure because it's convenient, but I could stand to find a cheaper place with better coffee.", "author": "Kaley R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-04-14", "description": "The bagels are good, but we will never waste our time or money with this place again. AWFUL customer service. They sent the wrong order and then refused to refund or replace it. If they don't have what you order they just decide what to send you instead. Staff is rude and inept. WILL NEVER ORDER FROM HERE AGAIN.", "author": "Rosanna M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-05-11", "description": "Ehhh the service is very very slow like everyone else said...the food was simply ok...it's sorta like the place where you go because it's the only one available...price is also pretty darn high...questionable if i'll return.", "author": "Tyshawn W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-05", "description": "Atlantic Bagel\nNY Brooklyn Heights\n11am Easter Sunday 5th April 2015 \nFour Stars\n\nThe aroma in thesis place was great. The place took a while to make our bagels. I had an everything bagel with Bacon, Egg, and Cheese. I checked in with Yelp and got 25% off. The bagel was seasoned on both sides. It was toasted with butter. The eggs were real. The bacon was thin, crispy, and salty. The cheese was melty. It was wrapped in foil so it was still warm while I ate it on the promenade.", "author": "Leonard L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-23", "description": "Fast and fresh bagel spot. They have a large selection of different bagels and spreads. They also make breakfast platters and sandwiches. I love the bacon cream cheese, olives cream cheese, salmon cream cheese, and scallions spread on any kind of bagel. Great spot!!", "author": "Camille G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-02-17", "description": "Absolutely my favorite bagel place. Bagels are hard on outside but soft in inside! Good selection of other foods and spreads. Only reason I have given a 3 is the service. Cashiers consistently are rude and mess up my total or overcharge. Shame they don't have better service.", "author": "Jessi B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-01-21", "description": "Not great, they skimp on cream cheese and charge too much for mediocre bagels - it's worth the walk to Montague Street.", "author": "Richard S."}], "servesCuisine": "Breakfast \u0026 Brunch", "priceRange": "Under $10", "name": "Atlantic Bagels Cafe", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "200 Clinton St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/kfGZi903n-q6MaZiJjGiPg/ls.jpg", "@type": "Restaurant", "telephone": "+17182549000"}