{"aggregateRating": {"reviewCount": 31, "@type": "AggregateRating", "ratingValue": 2.0}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-01-15", "description": "It's amazing what a little paint can do. \n\nNow is this place a bit grimy?  Yes.  Are the employees rude at times?  Oh yes.  Are the patrons sketchy looking? Unfortunately, yes. Do they skimp on the lettuce?  You bet.\n\nYet, as my backup, backup fast food place when I'm not feeling Subway and don't feel like eating Chinese food but I didn't bring food from home during my nighttime lunch days, this is the spot.  \n\nThey just painted a few weeks back and cleaned things up a lot and guess what - it actually looks and feels better. You no longer are taking your life in your hands walking in there and don't have to prey that you don't catch something.  That said, the price of the Veggie Burger meal went up and when I ask for extra pickles I'm charged for them even though it's supposed to come with them. But whatever.  The new BK fries are also pretty better. Who'd a thunk it?  \n\nThis is no culinary experience, but its Burger King, the second redheaded cousin of fast food so get what you get - and hopefully its at least edible.", "author": "Curtis J."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-04-20", "description": "Man this is really a terrible place to be.  While this particular BK is clean, the service is absolutely horrendous.  Staffed by employees who seemingly only care about gabbing and joking with each other and flirting with male customers who wink and say, \"this boy is hungry,\" it'll take more than a few minutes for your order, which is already prepared and waiting, to be bagged and handed to you.  Five of the 7 visible employees were laughing and chatting while the young lady at the register made eye contact with me and then proceeded to continue chatting while SHE TEXTED ON HER PHONE.  At long last, I gave my order.  And then I waited even longer for the flirting and joking to subside.  I don't know what the hell I was thinking to have BK to begin with, but I learned my lesson.  I will never return.", "author": "Hooney H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-05-13", "description": "terribly under staffed, these poor employees are forced to work incredibly hard to take care of dozens of thankless customers on their own. truly greedy corporation. and they charge for extra sauce, i paid for it but was disgusted. its not about the money but about the principle.  A perfect example of brutal greed from a multi billion dollar corporation. An awful and depressing experience.", "author": "Rince S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-03-01", "description": "Deserves less than one star ! Recently renovated this dump from all the junkies that hang out here ! But while they was doing that the should of renovated their employees attitude, ordered  10 pieces of nuggets ! Thinking I was receiving complementary sauces ah noo ! You have to pay extra for everything !! Which sucks because now I rather head to mcdonalds and forget about my burger cravings ! Keep it up Burger King no wonder you guys are losing customers", "author": "Kimoralee K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-11-18", "description": "I like Burger King, This is one closet to my job.  I enjoy the breakfast and its more reasonably priced than MC Donald's. The staff are a hit or miss. It can get crowed in the morning and during lunch time. They keep it clean and I appreciate the A rating.", "author": "Tracy P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2010-12-18", "description": "Worthless employees.\n\nHorrible \"food\" (even by fast food standards).\n\nWaste of time.\n\nThe problem with working on the weekends near the Fulton Mall area is that this BK is one of the few food options available (especially after the Arby's shut down after what, two weeks of being open?).\n\nHATE this place. It's the lesser of evils on this strip too if you can imagine that.", "author": "Shea D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-01-16", "description": "Horrible service. Especially since it is located downtown, you would expect quick service. Only reason I go is because its right next to my job. But every single time I'm waiting minimum 5 to 8 minutes. Call it slow food not fast food.", "author": "Gabriel M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-08-30", "description": "I stopped going here a while ago because the workers were just so slow and rude and the place did look pretty grimy. The workers are still pretty useless, but the food does come out quick, tastes good, cheap prices and they cleaned up the place a lot since the last time I came here. Is this place going to be on rotation? No. But I have to give it credit for improving!", "author": "Cynthia M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-05-29", "description": "Slow servicing: 2 people serving as cashiers and one for delivering orders to customers; this formed in a long line inside.The food here is not as good as the other branches that I've been to.", "author": "Henry L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2009-03-15", "description": "I agree with Alissa.  This is the worst BK I've ever been to.  I'm not even sure if there's ventilation in the place.  Something tells me the smoke in the place has been there for years.\n\nThe service is REALLY slow.  And the chicken fries are -- well I never knew that a BK could screw up the damn chicken fries.  They were like charcoal pretty much.", "author": "Victor S."}], "servesCuisine": "Fast Food", "priceRange": "Under $10", "name": "Burger King", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "417 Fulton St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/xQ1oHSgtyv9MMo2-nMNt_A/ls.jpg", "@type": "Restaurant", "telephone": "+17183300854"}