{"aggregateRating": {"reviewCount": 61, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-04-16", "description": "All I can say is that the atmosphere is breezy and fun, and the staff were cool. We got the cuban sandwich, and you should too. And the corn, duh.\n\nThe service was not so great. It took foreeeeeeeever, even with almost no one else in the place. And it's a little pricey for a take-out joint.", "author": "Joseph D. S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-11-14", "description": "As stated by others, service does usually suck here but maybe since it's a take out spot service isn't meant to be a strength. The \"cashiers\" often times seem irritated or annoyed or preoccupied and somewhat upset that I just have to disrupt their convos with my need for tacos and rice. Not always but often. Good place for a quick bite.", "author": "Desi M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-03-02", "description": "Easily the most bland, dried-out food every time I go here.  Across the street is okay, built on a scene. But To Go has no scene, and can't even get flavor right. Usually I'd give a more detailed and specific review but I can't because...the food....it's just....blah...and uninspiring. The chicken fingers and the corn helped salvage this review, and most meal attempts here.", "author": "Josh A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-07", "description": "Much faster wait than Habana Outpost across the street. You have the option of takeout or chilling on bar stools along the wall. $10 credit card minimum.", "author": "Gordon M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-28", "description": "Love this place my best friend and I usually hang out here after work, the mojito and the fish taco is amazing", "author": "Daniela F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-03-02", "description": "First I want to say the cashier working today (Wednesday) was really friendly and attentive I ordered a chicken taco and a steak taco. The chicken was grilled, I wouldn't expect that kind of chicken in a taco. The steak taco was yummy, flavor was good. I enjoyed it, will more than one next time. I also ordered the chorizo with rice and beans plate, it was alright. It was all cooked good, flavor was good, chorizo didn't blow me away. Not bad though and wait time wasn't bad either. I actually got green salsa as a side. A bit bland and watery for me. Not a bad experience.", "author": "Saidy R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-07-02", "description": "Having lived in Southern California, i've had my share of good tacos so I'm here to judge and judge I will.\n\nFor starters, they don't accept credit cards.  They'd rather extort more money out of you by using their convenient, yet surcharge happy, ATM outside.  But that's ok, it's painted in their signature green and blue colors so that can hopefully distract you from the deception.   There is no reason an establishment shouldn't accept credit cards in this day and age, so that's one star lost.  When they first opened, they swore credit cards were coming soon, but alas they're established and still no progress.\n\nAs far as the food.  It's mediocre.  Seriously, if you think the food here is good, put on a pair of sneakers and walk over to Maya Taqueria on Vanderbilt, you too will see why Habana is a disappointment.   I've been here a few times and given them a chance, i've had hole-in-the wall tacos that beat this place.", "author": "Fozz M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-28", "description": "The place is small with stools along the wall to sit. Looking for a restaurant that can accommodate families close to Barclay's my husband and I decided to go to Havana To Go. At first he was skeptical since there were no tables but once the food was out he changed his mind. He got the cheeseburger,  my youngest got a grilled corn and myself got the steak platter. Oh boy my children who are used to white rice LOVED the flavor of the yellow rice and the black beans so much they almost ate all of mine. The corn was devoured and so was the rest of the meal. I also had a cafe con leche that was delish! We will be coming back!", "author": "Karina A."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-03-04", "description": "I ordered the Cuban sandwich which could of been good if it wasn't dripping in oil. My daughter had pork taco.....let's just say everything was in oil. Will come for the drinks in the summer and the corn thats it!!!", "author": "Rhonda H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-04-12", "description": "Ordered on seamless. Our order didn't arrive and people on the phone were rude when we called to check the status. Made excuses and hung up on me.", "author": "Billy V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-09", "description": "I've only ever been to the takeout counter across the street from the real restaurant. It's great: they have stools to sit in. The food is amazing. The rice is so delicious I could eat tons of it. The quesadillas and tacos are good. I love the colorful atmosphere and friendly vibe.", "author": "M. R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-01", "description": "Amazing corn!  Try the corn!\n\nFriendly and helpful staff.", "author": "Jon F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-02-15", "description": "Came in to order takeout. Staff was very friendly. Food was prepared quickly.\n\nFish Tacos were pretty solid, though they serve them on single TINY corn tortillas that fall apart if you don't eat them immediately. Tacos lacked enough toppings to accompany the large piece of fried fish in the small taco. Flavors were great.\n\nRice and Beans seem to have a bit of extra sweetness that I don't quite like. Seems like they add sugar to the black beans.\n\nFried Plantains, how can you go wrong? They were fabulous.\n\nYou can go here, it's good. I give 3 stars because it's pricey for what it is. Who really loves overpriced Mexican food? NO ONE.", "author": "Ryan N."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-04-11", "description": "Nothing spectacular about Habana on the go...  Space is incredibly small and there is always a crowd.  Have been to Habana dozens of times and what brings me here is the corn!  They have gotten sloppy with service but as demand rises service decreases.  Hubby enjoyed his magarita and fish taco.  Fish was bland but the toppings saved it,  same with my pork taco.  Super dry but the toppings made it tasty.  Currently waiting for a 2nd corn!", "author": "NarleyNelle M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-04", "description": "The major drawback here is that they're cash only, which can be a mild to major annoyance. I had the Cuban sandwich, and it was tasty and the price was right.", "author": "Kimberly W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-23", "description": "Wow! So I usually never write a review for anything, but I just had to share. I ordered through GrubHub earlier today, and I requested that I wanted extra sour cream on the side. I ordered a steak quesadilla, chicken quesadilla, and 2 orders of corn. We received an email stating it would take about an hour to get to the house. We live about 1 mile away. When we received the order, it took about 20 min from when I placed it. Awesome!! It did not include the extra sour cream however.  We shrugged it off because it was just extra. How about I just received a phone call from Habana Outpost saying they were sorry for forgetting the sour cream, and they were going to credit us for one of the orders of corn. I'm so amazed! I couldn't believe it! I think they are my new favorite delivery place!! Also, the food was amazing!!! I would definitely recommend this place to anyone who is looking for delicious food!", "author": "Danielle A."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-08-25", "description": "Ordered the Avocado and White Cheese burrito.  Asked for it without onions and tomatoes.  Hardly any cheese, and NO avocado.  Really bland.", "author": "Joanne N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-18", "description": "This is good for people who live in the area and want a quick bite to eat. The fish tacos and corn are the best items on the menu.", "author": "Kai N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-22", "description": "That is some corn. The corn is amazing. The Cuban sandwich is pretty decent.", "author": "Chester P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-20", "description": "Prices here are fair.. I ordered delivery from here 2 times, the 1st time the food was very taste and not too dry, but the second time wasn't such a pleasant one. They got my order wrong, (I had the roast pork entree) and they gave me black beans instead of red beans.. The roast pork had much flavor but was incredibly dry!!!!!!!", "author": "Jada D."}], "servesCuisine": "Cuban", "priceRange": "$11-30", "name": "Habana To Go", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "690 Fulton St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/IzzLEpnLZFFKmMwQpejqIw/ls.jpg", "@type": "Restaurant", "telephone": "+17188589500"}