{"aggregateRating": {"reviewCount": 61, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-03", "description": "Oh Habana! Before Yelp existed I would visit your corner store location in the Village, very often. I was even more excited you ventured out and came to Brooklyn at another corner property. Then you opened the backyard and put a truck outside to serve your famous Taco's, corn on the cobs, and the platters with rice and sweet Moses chicken and pork. Oh and how could I forget Margarita night!\n\nNothing has changed, I love their food then and now. They've branched out more and opened another corner location across the street from the backyard location. Brilliant!\n\nTry it all, I promise you won't be sorry. Food gets 5 , service gets 5  and cleanliness 5 . \n\nNo this is not a place for a first date, but maybe a 3rd or 4th. Even better to come with friends that love Cuban food as much as you do. \n\nBon appetit fellow yelpers!", "author": "Petrina R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-12", "description": "Habana To Go is located directly across the street from Habana Outpost in Fort Greene, Brooklyn. The vibe is relaxed, and though the place is small and can feel claustrophobic at times when its full, there is a great atmosphere and character to the place. Another plus about Habana To Go is that they take cards, unlike its neighbor across the street, Habana Outpost.\n\nThere is one sweet leather booth in the back and when Habana Outpost is full and I need a Cubano, I go to Habana To Go. I always go with The Cuban Sandwich, extra chipotle mayo, and maduros (sweet plantains). I don't think my order here will ever change.", "author": "Charles R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-10-14", "description": "Definitely a cool concept and atmospherically fun! I ordered a chiken quesadilla with guacamole. The chicken was cooked so well but I was disappointed with the entree as it was the bare minimum of chicken and cheese. I was expecting more inside the quesadilla or at least on the side-lettuce, salsa, and etc.", "author": "Ashley A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-02", "description": "Please come and visit this place on your next trip to Brooklyn! I picked up my lunch at the \"to go\" spot, only to discover the actual restaurant across the street.  \n\nThe actual location is like stepping into Cuba, the colors are beautiful and they have this spacious out door seating with a food truck attached. The food is fresh and worth every penny.", "author": "Pier-Angeli H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-05", "description": "This place is pretty great. It's just a small little to go place and you can \"do as you please\" with your drinks so I love it! I got a frozen margarita and took a nice stroll to the park. They were absolutely delicious for just a to go drink. I was so impressed and I can not wait to go all summer long! \n\nI give this place a 5/5 because the staff is friendly and the drinks are delicious! I'll definitely need to come back to grab some food.", "author": "Riley M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-03-16", "description": "It's a quick location to visit while the outdoor location with more seating is unavailable. The drinks are good and the food is ok.", "author": "Alexus P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-11-13", "description": "I have been here once before a few years back when they just opened. The food was just okay and here we are years later and the food is still just okay. During my last visit I decided on the spicy grilled chicken quesadilla combination. The  quesadilla was slightly flavorful with stale pickled jalapenos on the side (which I could not eat) with a side of yellow rice and beans. The beans and rice were bland and kind of cold. They could have warmed it up at least. Overall, I would not go back, but I would try Habana Outpost across the street which I believe is the main location.", "author": "Serina J."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-08-28", "description": "Very interesting outside spot!  The food was ok.. nothing to brag about. I don't think I will go back unless I was passing by and need a quick drink.", "author": "Kayon N."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-11-28", "description": "Initial plans were to eat at Havana Outpost. They're closed on sundays. Was not at all disappointed. Food was great. Drink was satisfactory. Service was fast. Must revisit for more.", "author": "Toi P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-15", "description": "Habana To Go is a common stop for hubby and me to pick up some savory, spicy goodness. With a fast cook, affordable eats, and delicious food, its an obvious neighborhood fix for fast food. \n\nI am a fan of the tortas more than anything else. The cuban sandwich is the crowd pleaser. I love the eggs and chorizo torta and make them add avocado. The elote mexican corn is also a crowd favorite. I've also gotten the steak burrito and its solid. The frozen margarita is super popular here.\n\nService is okay. You order at the counter and call you when its ready. There is a step up into the  very narrow restaurant so not really wheel chair friendly. You can manage a small stroller and eat in the back booth if you have littles. I have no idea if there is a restroom, since we eat and run when we are here.", "author": "Suanne L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-11-20", "description": "Thanks but no thanks.\n\nPlaced an order to go, took forever. Guac was stale and brown in the bottom of the cup.", "author": "Rose G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-25", "description": "Been here a couple times. Today had the eggs burrito, and added guacamole - great option for vegetarian. I was ravenous and it tasted so good!", "author": "Judy Y."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-29", "description": "The only reason why we came in here was because we were looking for the Biggie mural, \u0026 it was right on the side of the restaurant, we took our picture and went in and got a frozen margarita cause it was hot AF today and boy oh boy was the Margarita good. The best part about this place was they had frozen margaritas, daiquiris \u0026 mojitos we didn't know which one to pick but the cashier let us taste test all three and we ended up with the margarita best choice hands-down. We also had a fish taco but it was nothing to write home about, I would have to go back for more items on the menu,  right now the four stars are for those frozen drinks.", "author": "Kendall R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-06", "description": "Love Habana To Go. When I'm up for the walk, I go in and get beef empanadas, corn, rice, and if I'm in the mood for a splurge, a frozen mojito. It can be hard to find a place to sit when it's crowded, but the food is really yummy, it's a cute spot, and the food is ready relatively quickly.\n\nI'm JUST outside of their delivery zone, which is either tragic or a good thing because I'd order delivery from them all the time if I could.", "author": "Meghan W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-09-11", "description": "The food is fine but the service is horrible. Honestly...they are so nasty. What is sad is that delivery is horrible so you have to go there to pick up food. Basically they force you to deal with the horrible service. \n\nI would order so much more if they were just...nice.", "author": "Heidi O."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-23", "description": "I feel like the food has gotten better here. I used to only come here when it was warmer and take my food to the park. It was satisfying, but not amazing. Now I think it's very good. The quality has improved somehow. I love the summer outdoor location across the street as well.\n\nThe one weird and annoying thing is the menu is not Cuban. It's like the owners said well, let's do Cuban food, but we have to throw in burritos to appeal to white people. Never saw a burrito in Cuba, it's not the borders of Texas/Mexico/California. (But let's be real, Cuban food IN Cuba is not great since food is subsidized and withheld by the government, don't travel there expecting an unbelievable meal like what you get at a Cuban restaurant in NYC.) But still, why burritos?! This is why when I went to Spain, the white people I traveled with expected burritos, not every Spanish speaking country is Mexico! I digress, food is good, flavorful, not authentic, but then it would be bad.", "author": "Bea L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-28", "description": "I stopped into this place before an event at Barclays Center. I was starving and wanting something familiar and solid to eat. I came in and got a chicken and a shrimp taco - both delicious, full of flavor, and surprisingly filling. I also got a frozen margarita which was not light on the alcohol and reasonably sized. The place is tiny and has a cool vibe. It's really just to stop in to grab a quick bite and go. There are a few seats throughout the place but it's not a full-fledged sit down restaurant. Definitely will stop by any time I'm in the area for a quick bite.", "author": "Sara S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-05", "description": "The Elotè is delicious and affordable!\nSuper creative space, anywhere you look.\nStaff very friendly. Fast service.", "author": "Marium A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-02-27", "description": "Worst customer service ever. EVER. I got the incorrect food item and they wouldn't make a new item and their reasoning was \"a manager wasn't present\" I bought tacos for 10.50 and they were filled with guacamole, bad lettuce, and awful salsa and I called, complained, and got a \"sorry manager isn't here, but you can come and buy another 10.50 item\".", "author": "K C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-19", "description": "If I could give zero stars if I would.  As a patron of Habana Outpost for years I have usually received good customer service. This last time, however,  the CUSTOMER SERVICE  was horrible.  I ordered a takeout of a Portobello sandwich; when I got home, there was no Portobello mushroom just cheese and sauce.  I then had to head to work, but after work, I went back for a refund. Usually a simple process anywhere else, Habana Outpost, instead of giving me the refund for their mistake, they told me they had to review the \"footage\" of the grill for me to receive a refund. After being treated as a \"liar,\" I will never go back to that Habana Outpost ever again.\n\nUPDATE:I got not only an apology from the manager at Habana but a gift card as well. I appreciate that they heard my complaints and took steps to remedy them. They have gained me back as a customer", "author": "Sibongile T."}], "servesCuisine": "Cuban", "priceRange": "$11-30", "name": "Habana To Go", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "690 Fulton St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/IzzLEpnLZFFKmMwQpejqIw/ls.jpg", "@type": "Restaurant", "telephone": "+17188589500"}