{"aggregateRating": {"reviewCount": 61, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-13", "description": "Good choice when the real Habana accross the street is closed or overpopulated. Festive atmosphere. The servers are always nice. I always tend to get the frozen Pina Colada (not a to go good choice because of the alcohol). Foodwise, they have a lot of reasonably priced choices :the fish taco for 3.50, tostones for 3.75 (big portion by the way, I got full just off of that). \n\nOverall just a good to go spot for a quick meal.", "author": "Annie T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-26", "description": "AMAZINGGGG FOOD!\n\nI highly recommend the cuban sandwich , mexican corn and plantains ! \n\nyou will be coming back for more !", "author": "Rose R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-06-26", "description": "I was craving a Cuban Sandwich and Mexican Corn. What could be better than getting the two most popular dishes. It's very good at the Manhattan location, so I thought the Brooklyn location would be good as well. \nThis location is more of to go or on the go. Be lucky if you are able to grab a stool and eat. This place gets crowded easily.\nFood takes a while to come out depending on how many customers are in here. \n\n1. Fish Tacos- Beer battered catfish, shredded cabbage, pico de gallo, salsa verde, and homemade salsa negra. \nThe Fish Tacos were decent. Nothing to rave about. Grab some hot sauce on the side to add more taste and flavor. \n\n2. Grilled Corn Mexican Style- \"Their Specialty\" \nGrilled Corn with cheese all over the corn. Only the best tasting corn ever!!!\n\n3. Cuban Sandwich- (Voted Best in NYC) fresh roast pork, ham, swiss cheese, pickle , chipotle mayo, on a hero bread. \nReally disappointing to me. Came out very cold. It was barely toasted. Cheese wasn't melted. It was like an ordinary sandwich you would get at a local deli. The really good Cuban Sandwiches will make you think it is the best in NYC. Not this one. \n\nStick with the Manhattan location or just get the Mexican Corn.", "author": "Alan L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-12-30", "description": "Taco are so yummy.. My Favorite tacos are the steak and shrimps! Service was good to us!", "author": "Glisett F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-11", "description": "wow! Jennifer at the counter and Ovideo who manned the grill were awesome! theyre the winning combo and i love the energy, synergy and dexterity with which they discharge their duties. came in here and completely forgot i was having a bad day before entering the restaurant , the chicken sandwich and pina collada was on point . theyve stolen me from my other fav. spot!", "author": "Oris K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-22", "description": "Nice spot with a cool staff.  Always a lot of great random throwback Spanish tunes playing in the background when I go here.  A great place to go when you want something quick.  Some people don't care for it but I always say it beats McDonald's.", "author": "Joaquin G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-02-04", "description": "I usually go to the solar power Habana Outpost on the other side but considering its not the season, the TO-GO spot is the next alternative. I've had nothing but great experiences and tasty bold flavors at the outdoor location so I assumed all would be the same. \n\nMy friend offered to pay for our meals since my birthday was the day before. I vouched for this place based on the restaurant on the other side. The decor looked the same, the staff was very friendly and inviting. They entertained our questions about the menu and ingredients etc. Everything was checking out. I came up to the register asking how long the location has been around, embarrassed that I didn't notice this TO-GO spot had been here for almost 2 years?! I live nearby, guess I wasn't looking at that side of the street whoops!\n\nI ordered a Chicken Chipotle burrito and my friend order the Fish burrito. They also ordered the classic corn on a cob. \n\nTiming wise our order came out with a typical waiting time, not too fast that you think they prepped everything ahead AND not too long for one to get impatient.  So\nin that regards the line was sufficient.\n\nMy friend was so hungry they happily ate the corn as we walked to the train. Ate almost half their burrito, hungry to satisfy a craving/appetite but was rather lack-luster. We searched the bag for any hot sauce or condiments to kick it up a notch (but nothing was packed, not even napkins). They were starving so they kept eating in hopes to reach the fish, but half way through they finally got a bite and were disappointed by the protein.\n\nWe ended up going back to make a complaint. They explained that it was not meat as they feared (pescatarian) but in fact was what they ordered, \u0026 perhaps they didn't like the \"beer-batter\" and/or it broke up oily and in pieces. \n\nI value \u0026 appreciate them handling the situation VERY WELL! Thank you! They offered to make them something else but they didn't feel confident trying anything more so they refunded their money. \n\nI waiting until I got home to eat my burrito, they ended up picking up something else to eat. \n\nOn the otherhand, my meal was superb, my chicken mole burrito was yummy! The flavors were locked in, had that roasted, mesquite smokey flavor one expects of \"mole\". The layering of the burrito was on point...lettuce, tomato, etc all wrapped tightly/compact. Tortilla wrap was soft and easily to handle without any mess. It had the combination of warm flavorful meat to the crunch of the fresh veggies and garnish. Although I wish I had some sauce to add to the flavors, the chicken mole burrito tasted great as is.\n\nMy first experience here isn't going to write me off from returning, perhaps the fish isn't as good as the other options...that's all. I can recommend the quesadillas, as I saw plenty of orders being prepared and served while we waited for our order. \n\nI definitely like their margaritas, and their burritos are good perhaps it just wasn't the quality I was expecting from the restaurant, after all it is a TO-GO place.\n\nNext time I will try tacos, quesadillas or the famous Cuban sandwich! I also should have ordered a corn on the cob too! \n\nUntil next time HTG!", "author": "May M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-25", "description": "This is a savior when across the street is too packed with sightseers and girls looking for husbands. \nThis outlet serves it's purpose. You can even grab a quick margarita (no flavors)  \nNot many seats by the way....it is takeout.", "author": "Anna K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-12", "description": "The delivery can be a bit slow so I keep to just picking it up. Much faster that way. The food is amazing! Do your mouth a favor and get the Sloppy Jose burrito.", "author": "Samuel B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-28", "description": "Tasty food, and reasonably priced. I had the mole chicken burrito and a Sol beer. Burrito was grilled on the outside which is nice. My friend had the Cuban sandwich which I want to get next time; it's supposed to be great.", "author": "Sam L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-19", "description": "Small spot with amazing food!! I voted for the best Cuban sandwich. Also the skirt steak is cooked to perfection and was on the table in less then 5min. COOL SPOT!", "author": "Omar F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-08", "description": "Great place to go solo or with a group. The food is really good, the rice needs some salt; but it's understandable to add yourself. The prices are good just if your getting any seafood it will be a bit more. I would definitely recommend this place to others.", "author": "Chaniqua T."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-06-22", "description": "Had the tacos and Cuban sandwich of which the taco was more tasty. The sandwich I must say I've had better. My only problem were the churros we got at the end. They were super greasy and if that wasn't enough it tasted like fish. Cross contamination much? It tasted like the used the same oil they fry fish in. Had to throw them away cause they were quite nasty.", "author": "Laura M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-11-15", "description": "The service at this corner sandwich joint was good, however the Cubano sandwich which as the sign in the window said was \"voted the best cubano in New York\" was not the case.\n\nThere was way too much meat in it for my taste and it did not seem like the bun was grilled which is how all of the cubanos I've had have been prepared. This review is based solely on this experience.", "author": "Steve R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-08", "description": "I ordered the chicken mole everything came on time and was very delicious.  I wish that the portions were a little bit bigger the food was so good it was more like a large snack though.  This is great if you're trying to watch what you eat or if you're on a diet and don't want to eat too much.", "author": "Mary L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-06-18", "description": "This is for the TO GO side: the tacos were decent.  The chicken was not tender (probably a bit over grilled) and did not have any dominating flavors except the garnishes.  The fish (beer battered catfish) was good but light on the portion.  The steak tacos had more meat and had more flavor.  The Mexican corn was a bit dry but decent.  The beverages come in very small cups (over priced for $3.00!) BYO -drink!   Beer is $5.00 - single selection (Sol Beer).  I may try the sit down Habana Outpost across the street.", "author": "Carlos P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-11-19", "description": "The food was okay. Not worth the hype. I can from Indianapolis and have had better Cuban sandwiches.", "author": "Chanta E."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-10-25", "description": "Used to get delivery from here all the time but I found that the service decreased drastically with each other.\n\nI just placed an order for lunch and it took over 1.5 hours for the food to be delivered (average delivery time is usually around 15-20 minutes). When I called to inquire why it's taking so long, the person from Habana To Go said they received \"four orders at the same time\".\n\nProtip: If you can't handle four simultaneous orders, you really should not be in the restaurant business.", "author": "Stella S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-10-29", "description": "So I went to \"Habana to go\" and I didn't have any cash so I had to go use the ATM but I don't want to use the ATM that they have out there because it charges the fee.  Had to walk around to my bank that's over on Flatbush so I get back here it takes me like 15-20 minutes and my order is still not ready..... I should add that I only ordered a burrito and the people that got on line after me had gotten their food... if I call on the phone ahead of time I still have to come in and wait for my order to be made???? Foods ok.", "author": "Michael P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-10-26", "description": "Having tried Habana across the street, I figured I would give their \"To Go\" a try. Upon entering, I approached the cashier who takes my order on an iPad, so I assume they are high tech enough to take credit cards. They don't. There is no reason any place should not accept credit cards. I had to take away a point for this, especially because the cashier told me they have received many complaints about this (and still haven't remedied the situation).\n\nI also have to take away another point because of their limited guacamole/avocado add-on. I couldn't just order my burrito with guac, I had to order an entire side of it (which didn't even come with chips). \n\nThe food is good, but this place is alright if your standards aren't that high. They also serve drinks that look interesting. I probably would only come back if I am in desperate, desperate need of an overpriced burrito.\n\nUpdate: the lady cashier here is incredibly rude. If you think maybe she's having a bad day, she's not. She's consistently rude.", "author": "Amanda G."}], "servesCuisine": "Cuban", "priceRange": "$11-30", "name": "Habana To Go", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "690 Fulton St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/IzzLEpnLZFFKmMwQpejqIw/ls.jpg", "@type": "Restaurant", "telephone": "+17188589500"}