{"aggregateRating": {"reviewCount": 24, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-09", "description": "My fiancé and I were in the area so we walked in without a reservation. Luckily there were seats available by the bar!\n\nWe loved everything that we ate! Standout dishes were the pickled shrimp and the crispy tuna bake. I really enjoyed the fresh tomatoes with the shrimp and the tuna bake was deliciously rich with a generous serving. Can't wait to come back to try the rest of their menu.", "author": "Dhaval D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-03-31", "description": "The dishes here are dainty looking, but well executed. Nothing too sweet, nothing too sour, nothing too rich. It just all kind of works together to deliver an avant garde seafood experience.\n\nAnd I use the term experience because that's what this is first and foremost. The food itself does not impress in pictures and certainly not when you put the price tag next to the description.\n\nHowever it's a great place to spend an evening with a friend or partner. You will remember the conversations and you will remember the experience.", "author": "Thomas M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-02-09", "description": "KenScale: 8.25/10\n\nNew York City is already saturated with seafood restaurants, some of them excellent and others more or less in the solid to pedestrian range. So long as the quality of ingredients is there, it is difficult to mess up the seafood and who wouldn't want a giant oyster platter or some whole roasted fish for a dinner get-together? Perhaps for that reason, with the exception of fine-dining institutions such as Le Bernardin and Marea, you don't see a ton of seafood centric restaurants that experiment with different ingredients and techniques for a unique take on the bounties from the sea. Enter Alex Raij and Eder Montero, the husband-wife duo behind a collection of excellent Spanish restaurants like El Quinto Pino and La Vara. They have opened a new seafood restaurant last year in Brooklyn, right next to La Vara, this time not bound by Spanish culinary traditions. My wife Jun and I dine with my ex-co-worker's couple (her husband is a big foodie) from time to time, and the husband said he was dying to go to Saint Julivert Fisherie last year so I went ahead and booked a table in January. As with my previous experience at other restaurants from the couple, Saint Julivert was a very satisfying experience, with plenty of dishes that should grab your attention.\n\nThe menu at Saint Julivert consists almost exclusively of small plates for sharing. The portion size (especially compared to the price) could be an issue if you came to the restaurant looking for a roasted whole fish; on the flip side, for that reason we were able to order many dishes to get a sense of what the kitchen was trying to accomplish. I can tell that the kitchen is not afraid to combine ingredients in an unexpected way or use parts of fish that do not first come to our mind. The pig ear terrine with kombu and oysters on top, which Eater critic Ryan Sutton spoke very highly of, was indeed a great dish to start with. I absolutely loved the way the chili oil gave life to these ingredients whose textural combination between the meat and the shellfish turned out to be quite interesting. I was giddy that no one else in the dining party was eager to try it so I ended up eating most of this beautiful dish. You don't often see the collar of Hamachi fish outside of Japanese restaurants, and Saint Julivert shows why it should be used more often. The flesh (which Jun graciously skinned with intense diligence) was quite delicious with jerk seasoning. Squid carbonara with parmesan and spicy squid ink was also an interesting dish using thinly sliced squid as the noodle, while everyone also approved the skate that came with sherry and dry chili that gave a nice spicy kick. The best dish of the night, my ex-co-worker's husband and I both agreed, was the crispy tuna bake (which also happened to be the largest dish we had ordered from the menu). It may not look much different from a fish casserole, but the addition of tomato, turmeric and curry leaf gave this dish an entirely different outlook that was quite rich and delicious. With all the seafood dishes we had ordered ending up being winners, it was perhaps not too surprising that the only dish with mixed reactions was the lone meat dish available on the menu. I thought the prego sandwich with local beef tenderloin was solid; Jun said she was disappointed as there was nothing special about the meat inside. For dessert, Jun and I split budin with Cuban bread pudding and mezcal ice cream. The bread pudding was pleasantly soft, but the ice cream's flavor (neither of us is much of a tequila/mezcal person) was a little bit too overpowering.\n\nGetting a reservation at Saint Julivert can be a challenge; it has quickly become a neighborhood favorite and the dining space is relatively tiny, so always best to book in advance although you can also try your luck at the bar. There is full bar with some cocktails using interesting ingredients; the wine list could certainly improve, though, with no glass options that jumped out at me. The intimate and cozy vibe of the restaurant is another plus to a dining experience at Saint Julivert. If you are looking for a fresh perspective on how seafood can be smartly done, I highly recommend Saint Julivert. There will be at least a couple of dishes that will surprise you.", "author": "Ken S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-04-05", "description": "Super cool atmosphere, service was great.  A lot of cool interesting dishes but I didn't enjoy all of them.  The whipped mackerel is one of my favorite dishes! The pickled shrimp wasn't that great, the shrimp tasted frozen and for this price point it should be much better.  Overall I enjoy it.", "author": "Lola F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-12-07", "description": "Get the surf and turf which had seared short rib and tuna.\n\nThe barnacles are good but they really squirt and would probably be better in a pasta or chowder. \n\nThe pig ear terrine and octopus carpaccio were also very good. Super tender and well seasoned. \n\nI wouldn't get the sorullitos again. Too salty and mushy for me.\n\nThe prego sandwich could use more flavor, but the beef was pretty tender.", "author": "Diane Z."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-06", "description": "This is a GREAT addition to La Vara. I love going to La Vara but they're always very crowded and it's hard to get a reservation before 10 PM unless you make it a few days in advance. Saint Julivert is like the seafood version of La Vara. The dishes are just as creative and delicious. If ever I can't get a seat at La Vara, I would happily come here instead. \n\nTheir menu selection is a little smaller, but there's some great items on there!\nMy favorite was the hushpuppies, you must not leave without trying these babies. I also liked the pig ear, and the tuna bake. The octopus carpaccio was my least favorite, I just found it too oily. \n\nIf you're a mezcal fan like me, you have to try to mezcal ice cream, it's delicious!", "author": "Judy Z."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-03-09", "description": "Four stars for food and cocktails. 0 stars for having a ceiling so low coming up the stairs from the bathroom that a 5'10\" person could crack their skull so hard they see stars. Also 0 stars for the bug that crawled out of the food and then needing an explanation for why the dish was sent back... anyhow an oddly contradictory experience at a restaurant that is very good but had some definite wrinkles to iron out.", "author": "Peter V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-01-05", "description": "Saint Julivert was preceded by a bit of hype. I was excited by its \"world traveler\" approach to seafood. I can confidently say it lives up to the hype...for the most part. \n\nEach dish was a puzzle. The sardines with vanilla butter were brilliant and delicious, but a bit novel. The pig ear and kombu terrine would have been the best dish of the night if it wasn't a bit too salty. The risotto and tuna bake were both nostalgic but overly greasy. The mussels were perfect, but a bit pricey for what we got. The whipped mackerel WAS perfect. Period. One of the best apps I've ever had. A consistent theme throughout the menu was flashes of genius marred by slight technical imperfections.\n\nThe service was unfortunately a low point. It felt intentionally unintuitive, perhaps because we were the last table of the night. However, it wasn't bad, just not in keeping with the ambition of the menu.\n\nI would certainly come back, but I find myself concerned that the flashes of genius will become untenable and fade before the imperfections are corrected. I hope that doesn't end up being the case. Ambition like Saint Julivert's deserves attention, even if it sometimes slightly misses the mark.", "author": "Brendan C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-18", "description": "Everything was on point.  Standouts were the mussels with carrot, pimenton aioli, the anchovies with vanilla butter, kanpachi kama (amberjack collar) with jerk and lime.  \n\nThe scallops with shiso and salsa macha.  It was good but they went a little sauce heavy which overpowered the scallops.  The pozole was very good too.  \n\nFor dessert we ordered the mezcal ice cream and bread pudding.  \n\nThe menu is laid it very well.  Drinks were great. I had The Wheeler and my date had a couple of glasses of great wine.  Service was great.  Food was delicious.  Can't say more other than I will definitely be back to try more of the menu.", "author": "Emily L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-07", "description": "Wow, this place is great! We wanted to try the entire menu and ended up sharing 5 dishes between 2 of us. Portions are on the small side, but it was the perfect amount of food. Favorites were the sorullitos and the pickled shrimp. Risotto is also excellent. Get key lime pie for dessert!", "author": "Amanda B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-12-29", "description": "Great first experience here. Walked in on a Friday around 8:45 and was seated at the bar immediately. The tables were already booked up for the night, but the bar has plenty of space for walk ins. \n\nThe drinks were delicious. I got the Puerto Escondido. I was a little worried the beet would overpower everything, but the smokeyness of the mezcal and sourness of grapefruit both came through. \n\nHere's the food we ordered:\n\nWhipped mackerel: Smokey and creamy. The dill adds a great freshness to the dish. \n\nPickled shrimp with deep fried saltines: tasty, but I was expecting and wanted a little more acidity in the dish. Loved the fried saltines. \n\nOctopus carpaccio: super simple dish executed perfectly. The octopus is sliced extremely thin, plated beautifully, drizzled with delicious olive oil, and topped with the perfect amount of spice to give it a little kick.  \n\nSpiny lobster risotto: Well cooked rice. Very yummy. A bit simple.  Not bland but I wanted a bit more punch. Considering it's the most expensive thing on the menu, I wanted more out of it. \n\nTuna bake: my boyfriend's favorite dish of the night. It was like a delicious warm tuna salad. Sounds weird, but was great. Very rich in flavor. I liked the crispy burned bits of pasta on the top. \n\nPrego sandwich (with oysters!): this was my favorite dish of the night. The bread had a delicious, garlicky, spicy olive oil on it. I was expecting the beef to be chewy, but it was extremely tender and juicy. The fried oysters added the perfect crunch, contrasting the softness of the beef and bread. \n\nThe service was excellent. The bartender was extremely helpful picking out dishes and checked in on us often. \n\nNext time I want to reorder the mackerel, octopus and prego. I also want to try the squid carbonara, hamachi collar, and scallops.", "author": "Brian F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-26", "description": "I'd been looking forward to this opening for a while since I'm a fan of La Vara next door. It was a totally different experience and definitely delivered. Service was friendly and helpful, and the ambiance was modern without being loud. Rhum agricole is featured on the menu so I went with a coconut ti' punch (super refreshing) to start and switched to an easy-drinking orange wine after (really nice list). As for food, everything we had was delicious, but I have to recommend the skate and the tomatoes with vanilla mayo in particular. There's a lot more I want to try so I'll definitely be back.", "author": "Jesse M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-04", "description": "Small plates are small, but everything was delicious. Get the (loosely in order):\n\n- octopus x 5\n- surillotos\n- pickled shrimp\n- fluke\n- tomatoes\n\nTuna bake is not worth it. Drinks and wine are great, as well as service. Also the panna cotta with sorbet was very unique and really delicious. Would love to try everything!", "author": "Lindsay M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-25", "description": "Small neighborhood spot with delicious dishes best for sharing. Friendly, attentive service. Good for dates.\n\nMost of the seating is bar seating with some table tops that can seat I think 4 to 6. We got there at 6:15p and there were plenty of seats available but this place will be packed very soon once word gets out in the NYTimes.\n\nThe two of us shared:\n\n- Hushpuppies: this was our first snack served and thought it was good. Crisp exterior, soft interior, served with a mildly spicy mayo. It paled in comparison to everything else we had after.\n- Pickled shrimp with crackers: holy shizz, this was so good. Must order.\n- Mussels escabeche: another must-order dish packed with flavors. I soaked up the sauce with the bread.\n- Octopus carpaccio: very tender and flavorful\n- Tomatoes with vanilla mayo: heirloom tomatoes with tomato juice, vanilla and mayo. The vanilla is very subtle and adds the most surprising flavor, balancing out the salt. My husband hates tomatoes and loved this dish. Def order it.\n- Risotto with eel and mushroom: rich, flavorful dish if you want something heavy. A nice contrast to the lighter cold dishes we had. We were very full by this dish but we had one more to go.\n- Prego sandwich: crunchy ciabatta bread slathered with garlic butter and spicy mustard with tender slices of beef. A simple sandwich with great flavors. \n- Panna cotta with grape granita: it was ok. Wouldn't order it again.\n\nFor cocktails we had:\n- Puerto Escondido: mezcal, beets, grapefruit and jalapeno. So good.\n- Verandah Punch: rum, cognac, rye, lemon. So good.\n- Glynwood: rye, manzanilla, lime, cider. Good but I liked the other two more.\n- The special cider of the night. Try whatever the server recommends. \n\nWe will make the trek from Manhattan to Cobble Hill again for this gem.", "author": "Agnes C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-12", "description": "A must go restaurant from the owners of the much lauded La Vara.\n\nExcellent service--best fish collar ever.\n\nCan't wait to return soon!", "author": "Harry S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-12-31", "description": "Pros: The food is very good. Innovative and unique seafood dishes.\n\nCons: The space is weird. There are only hightop seats and some of them are awkwardly arranged. Also they dont have a winter vestibule and its a very small restaurant so when the door opens the whole place gets cold instantly. \n\nSome of the dishes are extremely small and overpriced. The Pezole was $21 in the hot section but was basically a small appetizer. It has a few tiny shrimps and pieces of avocado.", "author": "K. G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-26", "description": "This is an amazing gem in an out of the way location. We are from seattle and seafood is as much a part of our diet as coffee. \nOur family took us here and it was truly phenomenal.\nService was great. The food fresh and innovative and so good.\nI want to go to their other places.\nThis is a must and highly recommend it\nBTW the manager is so nice and the staff are so friendly,", "author": "jeffrey r."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-03", "description": "The brilliant and creative couple behind this latest addition to their restaurant \"group\"\nhave another hit on their hands! With a nod to Spain of course, but going way beyond this time...Saint Julivert is a gem, a secret thrill, a giddy surprise. Charming service and really good food...enjoy!", "author": "Stephanie P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-11-18", "description": "One of the coolest place. I ate fabulous food with nice drinks also the services were appreciable. I would like to go again.", "author": "Himesh P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-11-30", "description": "I would have given this place a five if the portions weren't so small/pricey. Everything was delicious. The stand outs we're the shrimp with saltines, the mussels and the incredible Prego sandwich (a must have).  Very nice atmosphere (feels like an episode of black mirror) and great service (ask for Cait she's awesome!).", "author": "Brad H."}], "servesCuisine": "Seafood", "priceRange": null, "name": "Saint Julivert", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "264 Clinton St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/sV7FB0tghX1Vpg0AS1lgQQ/ls.jpg", "@type": "Restaurant", "telephone": "+13479873710"}