{"aggregateRating": {"reviewCount": 24, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-11-07", "description": "I landed in this conceptually reworked restaurant at the southwest corner of Cobble Hill Park. Where do we start? Oh yes, the decor is lovely and the restaurant was recently reviewed by the NYT's or so my spouse told me. All seating is high foot stool seating, elevated off the floor, ideal for drinking, but if you're having a fancy meal, which I would consider this restaurant to be, then those back breaking un-relaxing stools just don't cut it. Ok, moving on, I won't comment on the prices of the entres and mains, because when your food experience crosses over to the aesthetic, and you are served a plate of food that requires patience, delicacy and nuance to enjoy we've just traveled into another stratosphere of eating. You  can fill in the blanks, but suffice to say the food is delicious, thought out and visually /minimalist plated when placed in front of you --but enough of the good stuff. Guys for a local place joint you need slightly deep pockets to eat here, yes, the affluence base here can sustain this, and I do have big bone to pick, those wine pours, does the word miniscule sound about right? At $14 for 4oz, if that, it just don't cut it! It's an insult to serve three fingers worth of wine and call it a pour. If you do decide to go the wine route, do the math on a bottle, the markup is atmospheric. Word to the wise order a full bottle, as the selection is sensitively put together, and your fish dishes will thank you for it, even if the new and slightly less than experienced waitress won't.  Enjoy.", "author": "Gif A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-03", "description": "Close your eyes and pretend for a moment that you are on your favorite trip by the sea, where you have wandered all day and you are hungry as ever for something memorable and authentic. And you stumble upon a glowing place on a quiet corner and start with a cocktail filled with promise. And then one by one, food comes out that delights and fulfills your tired day. Comforting, refined, delicious. This is the place I have always wanted in my neighborhood.", "author": "Melissa J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-26", "description": "Great food and service. Tips to the owners: lower the light level, play some music, and get some bigger plates - the tiny plates are way too small to eat comfortably.  This will take it to the next level.  Nice work !", "author": "Alex F D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-29", "description": "My friend and I went for dinner shortly after they opened. We had some amazing cocktails and a great dinner. The skate was particularly memorable.", "author": "E S."}], "servesCuisine": "Seafood", "priceRange": null, "name": "Saint Julivert", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "264 Clinton St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/sV7FB0tghX1Vpg0AS1lgQQ/ls.jpg", "@type": "Restaurant", "telephone": "+13479873710"}