{"aggregateRating": {"reviewCount": 8, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-11-25", "description": "Solid pizza slices and salads.\nFast, friendly, service.\nReasonably clean and comfortable.\nThis place is good, but nothing exceptional.", "author": "Charles S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-11-28", "description": "I ordered stuff shells and asked if they had Parmesan Cheese in a packet to go. The cashier advised they didn't but if I wanted It to go It was 50 cents or I could open the bag and and put It on my food. I don't understand how you run a business and charge people for simple things that go with your order. I walked out and then realized I should have addressed the manager, so I called back and of course he was not in. I will never eat here again", "author": "Dina E."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-09", "description": "Passed by this place many times and decided to try it out. They have a good selection of pizza ready to serve They put it in the oven to heat up. It was actually pretty good. Staff was nice. Kinda small shop, but it is a good grab and go spot.", "author": "Mr. P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-03", "description": "The steak subs!! Soft bread finely chopped onions and lots of mozz on a soft Italian hero. Yummyyyyy. The mozz sticks are good too! The delivery came on time. The delivery guys was nice too and the prices were reasonable 6$ for a medium steak sub. I'm in!", "author": "Kimberly H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-03-31", "description": "I ordered from this restaurant on grub hub. The only reason I am providing this one star because my cheese pizza did arrive quickly. However, it tasted HORRIBLE. I don't know if the person that prepared it didn't wash their hands after using the bathroom before preparing my pizza or not. It was so bad. I called the restaurant and spoke with someone and they immediately said \"no one else complained\". \n\nWhat?!?! I'm pretty sure that I didn't ask about anyone else's order. So after describing how bad my order tasted, she offered to replace the pizza. I agreed to a replacement, but I am still waiting on it. As the person on the phone was mumbling horribly when I was speaking to her, I'm hopeful that she didn't assume that I was going to the restaurant to pick up that order, as I clearly told her I ordered DELIVERY on GRUB HUB. I'm never going to spend another dime here.", "author": "Whitney T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-05", "description": "I've eaten here many times (work right by there) and I've never witnessed any of the complaints below. Foods always tastes good and I get what I paid for. They started selling fried and baked chicken too which I love cause I started getting sick of eating pizza everyday haha. People there are nice, but I usually just pick up food and head back to work.", "author": "Samuel B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-07-06", "description": "This USED to be my go to place for salads if the place on Hanover was crowed.\nBUT no more since I just witnessed my grilled chicken being placed into the container with the guy's bare hands! One hand had a glove which he picked up the chicken pieces with BUT then he ALSO used his other BARE HANDS to pick up the chicken bits. After seeing that and alerting the front counter cashier, I just couldn't eat it. She said if I saw it then I should report it to her...which I did, so I told. I hope that changes and quickly!", "author": "Shaynee D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-23", "description": "good custome made pizza ready in ten min. sandwiches were hand made. alot of soda and juice options behind the counter", "author": "Kathy N."}], "servesCuisine": "Pizza", "priceRange": "Under $10", "name": "Angelica Pizza", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "332 Livingston St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/ubDSHkgDiqJ5qXo8U2IjjQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188522728"}