{"aggregateRating": {"reviewCount": 317, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-21", "description": "This place has awesome Chicken Tortilla Soup and I was  regular while staying near by there at an Airbnb. That said, I have no idea why on earth they don't take credit cards. It is so weird when businesses don't. Five stars if they took cc's.", "author": "Laura P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-06-21", "description": "Food is ok, service is shitty. They made very clear they don't want children there, which is weird because Fort Greene is a very family friendly neighborhood. By-the-way we did not go there at peak time it was Tuesday probably around 5pm. The restaurant was empty when we got there, the two waitresses were pretty much just looking at each other. One of them was more welcoming the other had a frown the whole time we were there except when she brought the check and expected a good tip. I so hope they don't share tips. It'd be very unfair.", "author": "Polly L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-26", "description": "Everything here is delicious. Brunch and dinner is very flavorful, very homely feeling. The waitresses are hip. The drinks are strong. The breakfast burrito is amazing, as are the regular burritos and the stuffed peppers.", "author": "Josh A."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-03-19", "description": "The food was fabulous, but the service was horrible. My husband,  10 yr daughter and I dined here last night (3/18/26). When we arrived there were many open tables, but the waitress pushed 2 of 3 2-rops together right outside the bathroom. We dint realize it was the bathroom at the time or we would have refused to sit there. At the least she could have pushed the remaining 2-top into the corner. No one brought us chips and salsa although every other table was eating them. We wanted to order dessert, but the had \"run out of flan\" and only had key lime pie.  What kind of Mexican restaurant doesn't give you chips and salsa and runs put of flan at 5pm on a Friday night. We'll know better next time because the food was perfection. The millenia waitresses are idiots.", "author": "Lisa S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-08", "description": "Pequeña had such great service the night I came in. They accommodated our large group in their not-so-large dining area with ease.  Everyone from the restaurant we interacted with was calm and attentive.  Though I'm sure the great company I dined with was a part of it, the staff definitely helped make the night.\n\nAnd just as impressive was their success in making veggie enchiladas worth eating.  The texture and flavor were both done well.\n\nI only wish that you could mix and match different kinds of tacos (though I didn't ask, maybe they'd be up for it, but it's not on the menu at any rate).  \n\nI'll be back!", "author": "Carl B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-05-03", "description": "Great Food, I mean I really like it here.  However, I don't tolerate disrespect.\n\nI like Tex-Mex, and the atmosphere is nice. I like the decor.\n\nI was there last night with my girls, and there was a woman and her guy there.  The waitress accidentally spills a drink on the guy, and he gets up and yells \"f***\". I mean I get it.  He never yelled it at her, but i would be upset too if I had 16 oz of water on my lap.  The waitress never apologizes.\n\nLater the girl with the guy walks up and states that she felt that the waitress should have apologized and that the situation wasn't handled properly.  I mean the waitress, who I later find out is the owner, didn't handle it well in my opinion.  She seemed more irritated than the guy.  All I hear next is the waitress say she is the owner, has never seen the couple there before, and pretty much kicked the couple out.  WTF!!!  Who on earth kicks a customer that they spilled water on out! \n\nI am starting to think that restaurants are forgetting to add quality customer service to their menu.  You can not treat people that way.  I like this place, but man, I would never want to be treated that way. So that event has ended my chapter there...", "author": "Veronica A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-31", "description": "I love Pequeña and can't believe I've never posted about it before. The food is pretty great (favorites are enchiladas with red sauce, chicken quesadilla, guac, and you must have the rice and beans) but probably my favorite thing of all time is the frozen coconut margarita. Honestly, I dream about it. I very much believe the food to be more delicious than other places in the area (including Habana) and the drinks are much better, too.", "author": "Elisa R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-10-27", "description": "Our food took a long time getting to the table and once it arrived it was mediocre.\nThe chicken in my avocado and black bean salad was so dry I had to drink water to get it down my throat. I have to say I think it was the driest chicken I have ever had. Also, I can make a better chicken tortilla soup at home. It was thin and boring.", "author": "Hannah M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-18", "description": "Deliciouso! This is the spot to be if you're hungry for a full meal of Mexican. It is cash only so remember that. I went there a few times already. The black beans are filling. The sour cream goes well with them. All the dishes are recommended.", "author": "Cindy J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-04", "description": "Favorite place in the neighborhood, I'm generally here a few times a month for breakfast on the weekends. Everything is delicious \u0026 the staff is great. I only wish they took credit cards.", "author": "k m."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-02-23", "description": "\"A-OK\" indeed.\n\nCame here with the ladyfriend last night and suffice to say that we were neither disappointed nor bedazzled by this spot -- $13 for an entree is probably right down the runway for mexican in this neck of the woods. I found the portions to be generous but thought everything could use a bit more seasoning, sauce and spice\n\nHighlights include the margaritas and atmosphere -- though very small it was certainly cozy and hip -- great tile decorations on the walls. I'd sit inside if you can to enjoy that.", "author": "Pete S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-05-10", "description": "Pequena made me so sad today, until 2013 they have had open barriers for their outdoor sidewalk seating, which allowed me to bring my pet without violating health codes in NYC. This spring they installed bamboo fencing to block the outdoor seating from the street, and the manager politely asked me to keep the dog outside of the outdoor seating.\n\nI have been a regular for 3 years, and have been bringing my dog since I rescued him last summer. Pequena is a favorite spot for lunch, and we bring friends for dinner weekly. Unless they change the configuration of their fences, I can no longer tie my dog outside (without seeing us he yelps). I fret that the new fencing will deprive Pequena of my patronage and me of their excellent mushroom torta (offered only at lunch). Today I felt unwelcome, and got my food to go. it took 35 minutes to get wrapped for me.\n\nFortunately for me, there are a number of other restaurants in the neighborhood with open barrier outdoor seating, where my dog will be welcomed to be tied outside, or even sit with me. True, NYC health code penalizes 8 points on their evaluation and can cite restaurants for having dogs. However, only 3 restaurants were cited for dogs in exterior locations in 2012, vs. 24 for having dogs inside. In a dog friendly neighborhood like Prospect Heights, many venues are appreciative of dog owners and quietly allow well behaved canine customers.\n\n5 stars for food, 1 star for my sad service experience today. Averaged 3 stars.", "author": "Shaun F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-19", "description": "Great, tiny Mexican restaurant just off Fulton. We loved the guacamole and chips, and the sprinkle of chile powder and pepper on the chips really enhanced the flavor. \n\nI wasn't very hungry, and they offer all of their entrees in appetizer sizes, which I enjoyed. The vegetable tostada had lots of roasted veg and just the right touch of queso fresco. \n\nThe restaurant is very small and cramped, but the atmosphere is fun. The space is decorated with Mexican folk art, some of it hanging from the ceiling. Overall a pleasurable experience.", "author": "Gayle E."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-02-16", "description": "I signed on yelp just to comment on what happened to us in this establishment called Pequeña (as other reviewers noted, probably as a reference to its size, although I believe it should be called \"Pituca\", as a reference to its snotty service staff), since really it's one of the few times I have been treated with such a bad attitude by service staff in my long experience traveling around the world for over 15 years now. Not being from the USA, I especially appreciate the general culture and attitude of Northern American hospitality towards the customer. Not so in this place!\n\nWe arrived to this place on a weekday in January around 8pm surely bringing a lot of hunger. When we entered the place, it was rather full, so we agreed to take a stroll for 15 minutes to get a seat closer to the entrance; the reason being that my partner has a skin condition which gets really bad with the heating being directly in her face (as was the case in pretty much all areas of the establishment). The stuck-up waitresses not only wouldn't allow us to sit in the empty outside area, they started making fun of my partner behind their backs. In fact even some customers enjoying their meal at that time thought that this behavior was completely uncouth.\n\nAfter returning to the establishment exactly a quarter an hour later - even more hungry - to be seated at the place we'd agreed on, they had allowed themselves to seat another couple at this place telling us that they didn't assume we'd be back and that they have to keep the place busy. After we explained the situation, the couple was even willing to relocate (not having an issue with the heating system, which per se they wouldn't turn off, even though other customers clearly seemed to be more than warm enough), however the staff started to ignore us. We were basically \"forced\" to leave since the bad attitude, the inflexibility and the unwillingness to make us feel comfortable as paying customers and serve us food at this place were predominant. We were left baffled, hungry and to a certain degree irritated.\n\nFortunately enough I write reviews for respected travel magazines, so I can make sure that as few people as possible reading or hearing from me will ever commit the mistake of entering this place with its impudent staff, where obviously the management does not care about the wellbeing of potential customers. If I could give it a zero star rating I would.", "author": "Roberto N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-06", "description": "The food here is outstanding and at a great price. The service isn't great, and the restaurant is pretty small, but I would definitely recommend for great food at a great price as long as your not looking for an upscale dining experience. My favorite is the shrimp tostadas. The pitchers of margaritas are great too and you definitely get your money's worth. The full size portions are huge. I don't think you can wrong with anything on the menu!", "author": "Alyssa P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-28", "description": "There's something about the nachos here. I believe every table ordered them, as did our waitress. They're delicious - the chips stayed crunchy; the avocados and black beans made them hearty; they're definitely a meal in themselves. I shared nachos with my friend and we had margaritas (those we could handle by ourselves). The margaritas were pretty strong - I definitely felt something after the first one. Also, service was good and atmosphere was cute yet intimate.", "author": "Lauren W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-07-27", "description": "I really like Pequena, I do I do, but it is total white people mexican food (am I allowed to say that????)\n\nI live in the Historic Wallabout District aka Fort Greene aka other side of Myrtle aka the Navy Yard. Delivery cut off is Park Avenue. There is only ONE MORE BLOCK OF ALL OF BROOKLYN THAT DIRECTIONS. Don't be f-cking prejudice and get hip to gentrification you brohemian scum.", "author": "Luv2 L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-04-21", "description": "You've got to be kidding me, right? \n\nNo free chips and salsa starter.  Tsk tsk tsk.  AND what is up with the rice?  It's literally just plain yellow rice with no seasoning.  You're going to charge like $5 for what tasted and looked like minute rice?\n\nWait staff was so-so.  B/c it is so small, they do shift the tables around and they do seem a bit stressed by manuevering through the space...wait, what space?  Oh, and they never checked up on us.  I was going to ask for salsa for the lame bland rice but they never came by.\n\nThe food was so-so.  Overall, disappointing and certainly NOT worth the prices they charge.", "author": "Anne H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-11-11", "description": "3.5 stars.\n\nThe dish star and highlight of our ordered meal was my Enchiladas Verdas. They were Soft Tortillas stuffed with Stewed Pork, Shredded Chicken, and Cheese (you have to specify one of each). The entree is topped with cheese then baked in green salsa (also aVailable in spicy red). As a main course, it comes as three enchiladas with rice and beans. \n\nThis is where ordering on the phone got a little messy (not to mention they tried to send us to their other location claiming it was closer)...I wanted everything topped with cheese including the rice and beans (then baked of course). And I do mean topped, I wanted it to look like a Mexican lasagna when it got to me. After much back and forth, they did not understand the concept (sadness) and we compromised to a side cup of cheese.\n\nHousemade Chips and Guacamole were fresh and tasty.\n\nChicken Tortilla Soup  was a spicy soup with shredded chicken, tortiila chips, corn lime and cilantro - it was rather weak (chicken-stocky-kinda-soup) with large unappetizing chunks of everything.\n\nMay order from them again.\n\nKing of BK", "author": "Will C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-16", "description": "I've been here a couple if times and I will be back. It's a cash only spot joint.\n\nThe chips and fresh guacamole is great. The fried fish tacos on the corn tortillas were fire. I wish there was some cilantro.", "author": "Rahim R."}], "servesCuisine": "Mexican", "priceRange": "$11-30", "name": "Pequena", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "86 S Portland Ave", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/KWpvOOon8kcWehPXnMptDw/ls.jpg", "@type": "Restaurant", "telephone": "+17186430000"}