{"aggregateRating": {"reviewCount": 317, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-10-06", "description": "So I must start off by saying I love Pequena. I really do. I just want them to fire a particular waitress who is so spaced out she has given us consistently poor service on more than one occasion, today being the worst by far.  When my partner and I lived in Park Slope we were regulars at the one on Vanderbilt, so when we moved to Ft. Greene we were so excited that there was one even closer! Since I got pregnant eight months ago I've consistently craved Mexican food, and being from California, with parents who live in Mexico, I'm a bit of a snob when it comes to South of the Border cuisine. \n\nWe especially love the brunch, the Desayuno Mexicano with chorizo makes me happy, helps the weekend feel like a weekend and soothes my baby's cravings. So today, after my delicious prenatal massage when my partner suggested brunch there I was thrilled. Then we get stuck with the space cadet and what could have been a leisurely brunch turned into a couple hours stuck in a chair wondering what was going on.  She actually forgot to put our order in, and never came to check in on us, even though it wasn't crowded with only a few other tables full and another waitress on duty.  We had eaten all our chips and salsa and gotten thirsty again after depleting our drinks. We kept looking around for her but could not make eye contact. I saw her standing around and just staring into space a few times but not looking our way and too far out of range to comfortably call for her. Finally she came close enough and my partner got her attention and she of course got the 'whoops!' look on her face and went to the kitchen. A short time later we got our food, smoking hot, and clearly just put together, but then she had to leave and walk down the block to get my seltzer water??? why is it on the menu if it's not in the restaurant?\n\nAfter we had eaten, still with no further check in, we were more than ready to leave as my back was starting to ache again from the straight back chair. We asked the other waitress for the check and when our girl came out with it, my partner asked her to wait a moment so she could give her the cash and get change more quickly. She walked away! My partner was annoyed and so we left without paying much of a tip, something we NEVER do! I guess she earned it.  \n\nThe food and service are better at the one on Vanderbilt, and it makes me sad, I want to just walk around the corner for my weekly Mexican fix, but now I'm wondering if we need to just head over to Vanderbilt.", "author": "Sydney K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-24", "description": "I've been here several times. Always delicious authentic Mexican food (well-priced too!) Small place, so not suitable for larger parties, but great for date night!", "author": "Rachael G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-07-01", "description": "Why did I eat the salad? Why? I saw what she did and so did my girlfriend.. but we ate our salads anyway. Why would we eat our salads after watching the waitress remove tissues/bandages(?) from her toes (while sitting on a chair near the door) and then promptly walk into the kitchen and bring us our food..? Why did we eat our food and not say anything! It was just too insane to comprehend at the time. \n\nSo beware of anything foot related that might be in your food next time you eat here.", "author": "Adam S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-23", "description": "Very limited seating, as the name implies.  Go on an off night.  If you have to go on the weekend, show up early or expect to wait.\n\nThe soft corn tortillas are the real thing, no wheat here.  The Pico de Gallo is similarly authentic.  Cilantro for the win!\n\nI had the Fish Tacos, which were fantastic, and accompanied by very well done rice and beans.  All fresh, perfectly spiced, hearty and filling.  Throw in a margarita or two, and you've got perfection.", "author": "Alan M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-05-23", "description": "My husband and I ate here recently. I had been here once before a few years back. I remembered it being good, so I suggested we have dinner there before going to our show at BAM. We both ordered fish tacos. The smell of fish as she placed the dishes down was revolting. The food was definitely not what i remembered it to be.", "author": "Marianna C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-09-20", "description": "They recently changed over their waitstaff, and the new girls suck. The food is still great when your waitress isn't screwing up your order. In addition it seems they do not assign tables to their staff, everybody helps everybody. This is a chaotic way of doing things. I was consistently interrupted in mid conversation to be asked by a second and third girl the same thing I had already answered once. Not to mention one of the girls was so soft spoken and the restaurant so loud and busy, I couldn't even hear what she was asking me. The only thing more annoying then servers who never come to your table to see if things are ok or your drinks need to be refilled, is waitstaff that are at your table every 3 minutes asking the same things over and over again. \n\n\nOld Review: An old roommate worked here and turned me on to them 3 years ago. I'm still a huge fan. For NYC, this is cali quality mexican food. I order from here once or twice a month during lunch time. Yummy. I just love it.", "author": "Heather L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-22", "description": "Little restaurant decorated with dia de los muertos stuff makes this fun spot to sit and eat. The menu is pretty standard fare. But the food was quite tasty.\n\nI had sauteed fish tacos. They were very saucy. But mighty flavorful. The fish was flaky and cooked perfect. The salsa and guacamole that top the tacos was very good. \n\nThe rice and beans are somewhat bland. But whatever. I could have ordered this a la carte. That may have been smarter.\n\nI will also mention that the service is somewhat nontraditional. They treated us well, but I imagine that it could have been a bit disastrous. Oh, also, its Cash Only!", "author": "Tom D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-04-21", "description": "I'm very conflicted about this place. I LOVE Tex-Mex, and their food and cocktails are both delicious and reasonably priced. That said, they cram way too many tables into a tiny space, and the staff is cold and unpleasant. I tend to go out of my way to be nice to waitstaff, because I empathize, but most of the time I've been in there it has just felt a little hostile. I haven't been in about a year, though, so I'm going to give it another try soon and will update my review accordingly.", "author": "Adam S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-08-20", "description": "I reeeeeally don't get it.  Came for brunch.  Did not choose this place myself.  Everything felt...really dirty -- the walls, the floor, the table, the chairs -- and it smelled weird inside.  The food was so greasy.  The service was aggressively average.  Ugh.  Never again.", "author": "Eva C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-06-07", "description": "I came here as a surprise for my partner since she loves Mexican food \u0026 I read tons of good reviews so I kinda had high expectations. I was sorely disappointed w the service. We were seated close to one of the registers, had one of the servers hovering near us but gave us no greeting, water, or menus until I asked about ten minutes later. Then, the food took a normal amount of time to come out \u0026 it was great but it was lukewarm.", "author": "Madison D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-06-04", "description": "I just moved to the neighborhood and was very excited about the fact that there were two Mexican spots by me.  After enjoying Habana Outpost for the first month in the new hood, I decided to give Pequena a shot.  The interior was cute and cozy.  I liked how it was festively decorated.  My margarita was good.  And the pork tostada with rice and beans were pretty good too.  But the picadillo poblano relleno was very watery and bland.  And the fried fish tacos were very dry and bland.  I guess I could have left somewhat satisfied with the part of the meal that was good, except for the fact that my boyfriend and I waited 30 minutes for the bill.  Not planning on coming back to pequena.", "author": "Alice K."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-02-26", "description": "Bummer, I've tried Pequena three times now (Brunch, Lunch and Dinner).  Three disappointing meals, unfortunately.  It's such a pleasant place, with really nice staff, but the food has been unremarkable each time.\n\nI still need to try their fish tacos, so I'll likely give them one more shot, but until then, sadly, they get just a two-star rating for having ok salsa/pico de gallo, nice service and being the closest mexican outlet by my house.", "author": "John R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-30", "description": "Friendly enough service (compared to the vanderbilt ave location),  delicious cocktails (I can't say enough good things about the frozen raspberry margaritas). food is always consistent and portions are large enough to share.", "author": "Natty B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-12-14", "description": "Amazing brunch - Jordan S \u0026 I sought out Pequena as our refuge from the cold. The place is tiny, warm, and super friendly - perfect. We ordered two things and shared them, because we share everything -  kitchen stuff, clothes, magazines - one day we might even go halvsies on a baby. A Swedish orphan. But anyways...\n\nWe ordered the Pan B (potatoes, beans, bell peppers \u0026 eggs) and Huevos Racheros with chorizo, both were delicious and distinctly different. The potatoes were really wonderfully spiced and complemented the beans perfectly. I could have gone for a little less bean and a little more of the bell peppers \u0026 salsa, but the beans were not overpowering. Top that with a perfectly fried egg. Yum. The Huevos Rancheros is drenched in a reddish enchilada-like sauce, the color of Tapatillo but not spicy. I also got a Mexican Hot Chocolate which was more like steamed milk with some chocolate flakes thrown in, but it hit the spot as we sat cozy at the window bar, watching the rain bluster outside. \n\nEverything was so tasty that we almost asked to look at the dinner menu while still eating our brunch. Loved the atmosphere and will definitely be back, especially since all that deliciousness was under $25... cash only.", "author": "Colleen L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-07-09", "description": "Best Mexican Food in Brooklyn?\n\nOkay, here I go again with the dichotomies  in my reviews; Pequena is without a doubt excellent, popular and scrumptious Mexican food, but is it the best in Brooklyn? And how does one define best anyway?\n\nGuacamole  and house-made chips were really good, the fresh lime Margaritas, Mmmm, and  Pork Shoulder Enchiladas Verde, succulent. But does this make it THE BEST? \n\nWell from a traditional standpoint and from a standpoint of the fact that true native palates are probably more inclined to be at Taqueria Tepango on Myrtle and Classon than at Pequena, then I will still have to tip my sombrero to Tepango, but did you catch the part about the fresh lime Margaritas??? Gringos and Gringas looking to party down Mexico way, or at least near BAM will not be disappointed and should probably give the edge to Pequena. Just be prepared for a wait to get a table.", "author": "Alessandro R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-20", "description": "My wife and I come here often.  It's solid Mexican food, generous portions, at a reasonable price.  It's not gourmet.  In fact, it may not even be particularly authentic.  That said, it's very consistently good.  The staff is friendly and quick (I mean, they've got a small kitchen in there, too).\n\nThe brunch is also totally solid.  Again, good prices, good portions, good service,  good food.  You really can't go wrong.  No, it's not going to get a Michelin star.  Thankfully.  \n\nAnd the frozen margaritas are one of the few reasons I earn money.", "author": "Lars M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-15", "description": "I will be totally honest, I was quite surprised how much I loved this Pequena joint. I was here for brunch one Saturday and it was surprisingly not crowded, although every other spot on the block was, so I was hesitant but hungry. The chips and guac were great and my breakfast burrito hit the spot. My friend had one of the skillets and loved it. Will definitely make a point to come back again!", "author": "Brooke S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-02-15", "description": "If I wanted crappy food, I'd have preferred a to have at least had a sloppy Cancun-style night at Gonzalez y Gonzalez.  Pequena is pretty much the equivalent of Tortilla Flats (see review), but the crowd doesn't suck quite as much.\n\nMaybe I could have ignored the bland food if I had at least been a bit tipsy.  Oh wait - the server decided to ignore our side of the restaurant, so I was left sober as well.", "author": "Michael B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2010-06-02", "description": "Worst dining experience ever!!!\n\nThis place is truly a \"hole-in-da-wall\" with sub par service.\nThe only thing that's remotely palatable about Pequena is their breakfast burrito which they only serve on Sat/Sun.  I dine out a lot, way more than I would like to admit; and I especially love small quaint neighborhood eateries but unfortunately Pequena doesn't fit this description at all.  I live in the area so I felt compelled to try it out a couple of times, each time leaving grossly disappointed.  The food sucks, drinks are watered down and the service is deplorable, not to mention there are flies everywhere!!!\nConsidering there so many other great options in the neighborhood they will definitely never see me again.", "author": "Sam H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-10-11", "description": "Good food with large portions at reasonable prices in a tight but friendly space.  Note that this place can get very crowded.  In terms of location, the restaurant is around the corner from BAM.  \n\nAs for the food...Pequena's refried beans have a delicious, smoky flavor from the poblano peppers, and the guacamole is solid.  The shrimp fajitas are made with good-sized shrimp in a flavorful (but not too spicy) sauce.  The flan was yummy.\n\nOne note for celiacs: The chips and tortillas (in addition to the taco shells) are made from corn.  The waitress was very understanding when I told her that I had a wheat allergy and pointed out the items on the menu that I should avoid.", "author": "Jonathan G."}], "servesCuisine": "Mexican", "priceRange": "$11-30", "name": "Pequena", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "86 S Portland Ave", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/KWpvOOon8kcWehPXnMptDw/ls.jpg", "@type": "Restaurant", "telephone": "+17186430000"}