{"aggregateRating": {"reviewCount": 317, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-16", "description": "Great authentic Mexican at reasonable prices for the area. Fresh guacamole with homemade chips are really good. Good date spot small intimate with all this beautiful Mexican style paint and art all over. Definitely hit it up.", "author": "Zach K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2008-09-20", "description": "To break it down as simple as possible from what I saw in the night I went there...\n\nThe service was great.\nThe sangria was strong.\nThe margaritas were good.\nThe food was not original, but still good.\nThe atmosphere was nice and fit the theme.\n\nMy only complaints are that it was a bit small of an area to sit in so I was a bit uncomfortable from where I was (this was also because I was the third person at a two seating table).  As well the pitcher in which the drinks were served could of been a bit bigger. We only really got 3, maybe 4 glasses out of each one.", "author": "Kyle M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-11", "description": "Pequena is one of my favorite local restaurants! The food is delicious, and the place has a great vibe. \n\nThe chips (they have this great spicy rub) and pico are fantastic, and of entrees, I think their enchiladas are best. The beans, rice, and guac are all solid, so really you can't go wrong here. \n\nIt's sometimes quite crowded (it is quite pequena, after all) but the decor is really fun and the vibe cool. Plus, although things used to move slowly, it's clear they've recently hired more waitstaff because there are new faces and much faster service.", "author": "Miriam G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-02-09", "description": "I like Pequeña because it is delicious and satisfies 2 picky neighborhood eaters.  We're here about once a week and dinner never disappoints.  Extra points for accommodating waitresses, thanks!", "author": "Misa M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2010-01-11", "description": "I dunno, you guys. I know y'all love this place and whatever, but I don't get it? Is it cute? Is it hip? I don't know. But I do know it's not tasty not even a little bit and it's too expensive for what it is. Thumbs down.", "author": "Amy D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-11", "description": "As much as I dislike Mexican food, BL always manages to get me back into Pequena for a bite before a BAM performance. I like the Fish Taco and the Margaritas are good. Come early. This place is always packed. Brooklynites always know great Mexican food.", "author": "Elmer S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-14", "description": "I can't help it, I love this place.  I literally find myself daydreaming about the black bean and sweet plantain quesadilla.  Sure, the rice is bland and they only take cash, but the spicy salsa and fun vibe far than make up for it.", "author": "Suzanne W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-13", "description": "Seriously authentic and very fresh. Prices were very reasonable too. For a small  little joint with somewhat awkward seating it was delectable.", "author": "Carla C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-04-18", "description": "the service at pequena is horrible !!!!!!!!!!!!!!\nthe waitresses and the manager have such terrible attitudes !!!\nif you want a pleasant dining experience, i strongly suggest not going to this restaurant.", "author": "roni D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-03-05", "description": "Seriously good. \nCute little (very little) place. \nBlack bean and plantain quesadillas are super tasty... better washed down with margarita. \nI love to take out-of-towners there as a less touristy meal out.", "author": "Ian A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-23", "description": "Pequena's chicken tortilla soup is the best I've ever had! The broth was rich, clear, and clean with generous hunks of avocado and refreshing bits of tomatoes, corn, red onion and sour cream... What really stood out was that the chicken in the soup was shockingly tender and moist- not dry or rubbery like many other places. SO GOOD\n\nI also had the sauteed fish tacos that were simple and delicious. You can really taste the ingredients, nothing overpowered by sauce although it could use more salt. Rice and beans were average, portion size is great!\n\nI went on a Friday night, place was totally packed. The hostess and staff were incredibly personable and friendly accommodating our large party of 6. I'll definitely be coming back if not just for the soup alone!", "author": "Erika C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-05-23", "description": "They get the stars all for their huevos rancheros.  They need more wait staff because you can wait a long time for service (whether you order out or eat in).  The seating is tight but cozy and the chicken salad and sampler plate are good menu picks.", "author": "Rhonda W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-04-30", "description": "pequena indeed.  \nit probably fits 20 patrons.  tal vezzzzzzzzz. \n\nbecause of it's small space, expect to:\n- get cozy with your dining neighbors (im talkin maybe 6 inches of personal space. tot)\n- wait at moe's (the bar next door) until they call you on your celly when your table is lista\n- not be allowed make any substitutions on your meal (small restaurant = teeny tiny kitchen)\n- pay in cash monies\n\nthe workmates had food envy for the leftover veggie enchilada and vegetarian black bean soup i packed as today's lunch.  as well they should - the food was delicious (not to mention cheap, ~$30 total for 2 peeps).", "author": "Pearl O."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2007-10-01", "description": "**bias switch on**\n\nYeah 4; a cute little nook, small, so small in fact that we ended up using the window as an extension of our table so that we could have a place to place our drinks. But listen, the appetizer platter was gargantuan; the guacamole was fresh and tasty, even the home made chips were crisp and tasty (a word that I'm not tossing around; it WAS tasty; it retained a clear taste of parsley and olive oil embedded in the corn), and we didn't even noticed at which point of digestion our stomachs had assimilated this as the ONLY course of the evening; needless to say, when they brought my again-gargantuan platter of chicken fajitas, I cursed in protest since they were delicious and I couldn't even finish 15% of my plate. MiG kept reassuring me, but I felt guilty; perhaps I should have **dare I say it?** taken a doggy bag??!! No. Never. I don't believe in re-heated food, and apparently neither does MiG; her mushroom tacos, which the waitress told us were going to be prepared again due to the fact that they were cold, magically reappeared on our table in a count of 10.... a microwave parlor? perhaps, but nevertheless, Pequenia does in fact stay true to her name (means small in Spanish feminine) in terms of location, but NOT in terms of food. The platters are simply gigantic; this is the kind of place you come when you are totally famished or after fasting. \n\nOne last observation, hanging in the wall there were several Mexican skeletonshttp://www.ghostdroppings.com/images/photodroppings/PileOfMiniSkulls.jpg ; just like the ones you see in Frida Kahlo's paintings; they have always reminded me of black magic and creepy portents, this day was no exception as our small White Sangria Carafe kept refilling itself magically even after we had served ourselves several glasses (great sangria btw)... but hey, if portents are bent on making me drink, then by all means you little devils; replenish my Carafe to infinity for all I care! \n\n**bias switch off**\n\n**Special thanks to MiG for pointing out (much to my embarrasment) that we had in FACT drank Sangria NOT Mojitos; I blame the devil urchins and their black magic though**", "author": "Javier M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-24", "description": "the name is no joke, this place is tiny.\n\nhowever, the food is so good. i could probably eat every meal here and not ever feel bad about it. (but that might be because i love tacos and would put guacamole on everything if i could.) i had both brunch and dinner here and it was excellent. \n\ni also highly recommend the margaritas. i had coconut both times, no complaints whatsoever. \n\nit definitely gets crowdy, and that stretches the service to its limit, but i have no real complaints about that. there's indoor seating, counter, and a little outside type jam. \n\nmost importantly, it's cash only.", "author": "Erin R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-03-22", "description": "Pequena's excellent enchiladas come with a lot of sauce (red AND green, if you want it), but not too much. I usually get the half plate and a side of rice and beans instead of the meal because it's only one less enchilada but still really filling and about 5 bucks cheaper.\n\nThe service is the other reason I love going here. Incredibly friendly and attentive wait staff!\n\nI wish they took credit cards! I would come here twice as much!", "author": "Lynn K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2006-09-06", "description": "I agree with Christine.  Yucky! This place is always crowded, and I don't understand why.  I had a date here, and it took alot to prevent me from wanting to gag.  The chicken tacos were inedible.  Chockfull of grease.  At least I had a margarita to choke it down with. My roommate from San Diego has also eaten here and has the same opinion as me...nasty gringo shit.", "author": "Jasmine M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-09", "description": "I love this place!! The food is great and so are the people. Good sizes and good portions. I've had bad luck with their lunch delivery though, that's why I didn't give them 5 stars. For some reason the food delivered for lunch was not up to par.", "author": "Angelique S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-11-30", "description": "I don't like to give bad review, so this is hard for me. I will also say up front that coming from Colorado, I have a different reference point for what constitutes good Mexican and Pequena, mi amigo, just ain't it. I ordered the chili relleno, or maybe it was pork enchiladas, it doesn't matter cuz it was COLD! I mean El Dia de los Muertos COLD. I didn't even want to send it back to heat it up because it wasn't good anyway. They do have some things going for them: the decor is fetching and the guacamole is actually quite good. I could see myself going back for just that and perhaps a margarita. You know, stick to the COLD things, since that's what they do best.", "author": "Mavi G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2007-07-02", "description": "Really wish I could give Pequena more stars cause I love the colorful coziness and the strong margaritas, but the food isn't consistant enough.  I used to love the chicken tortilla soup but it seems to be more oily and less flavorful these days...and the quesadillas are not too hot. The black beans and plantains are always super yummy though.  And I like the fish tacos too.", "author": "Amber S."}], "servesCuisine": "Mexican", "priceRange": "$11-30", "name": "Pequena", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "86 S Portland Ave", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/KWpvOOon8kcWehPXnMptDw/ls.jpg", "@type": "Restaurant", "telephone": "+17186430000"}