{"aggregateRating": {"reviewCount": 317, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-01-24", "description": "Decent fresh food with good prices.\nAmazing things come out of the tiny kitchen.", "author": "Zee P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-18", "description": "Since moving to New York a year ago, I haven't had much luck with places I've just stumbled across-- places I've read about or heard of through word of mouth have served me best. Pequena was a welcome exception to this rule. \nMy friend from out of town and I were walking around looking for brunch when Pequena popped up. The menu had good prices, the dishes sounded yummy, cute decor, and they had brunch cocktails.\nIt was very small but there was no wait when we got there around 1pm and we sat out on the patio. I was disapointed when I realized they serve Bloody Marias (tequila) instead of Bloody Marys, but the waitress assured me they were good, so I tried one and actually really liked it. My friend tried the limeade rum (they make their own limeade) and it was tasty too. To eat, I had the omelet with chorizo (and veggies and cheese) which came with potatoes and toast. The only very minor complaint I have about the food was the potatoes were kind of oily. But overall the food was very good.\nI'm surprised, and its kind of a bummer, that other reviewers have been so down on the lunch and dinner (I guess I won't try those), but I would definitely go back to Pequena for brumch.", "author": "Lia B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2008-09-19", "description": "What is up with faux-Mexican food in NYC? It has all the rustic decor of a Tijuana gem (with the outdoor/indoor dining experience and lack of A/C) but the food is not Mexican...and not even good in my opinion.  It's not awful but the ends definitely don't justify the means.  Perhaps I'm a bit anal when it comes to Mexican food because I've had GREAT experiences here in Brooklyn (try New Mexico Place in Bushwick) but this place is just a gentrified rendition of Mexican food.  I'd rather eat somewhere else.", "author": "Ashley N."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-09-02", "description": "I gave this place a second try around the time a former colleague went on maternity league. I have had nothing but good experiences since then. When in the Ft. Greene area, and looking for Mexican, I head here. For some reason, the kitchen here is MUCH better than the location in Prospect Heights. Give it a try.", "author": "L L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-12-19", "description": "Boo. Totally not vegetarian friendly. And, they would absolutely not do any special requests like do a soft shell taco instead of hard shell or not put sour cream on something. It was bizarre.The food was good, but I've had better. And what's the deal with no chips and salsa?", "author": "Jackie D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-10", "description": "best salads and amaaaazing appetizer sampler plate! LOVE IT!!!! cheap and big portions! great guac, refired beans, plantains, salsa...", "author": "Tam T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-04-19", "description": "Yum Yum Yum. I don't know what I would do without Pequena. They are my go-to takeout in Fort Greene. Not many days go by between orders. My favorites are the tostadas, tacos and black bean salad.", "author": "Alyssa M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-08-10", "description": "Surprised to see the relatively low scores for this place, though it seems like most of them are for the cramped space. We sat right down with three at 7:30p on a Monday. The food was REALLY good and REALLY cheap. Guacamole had a lot of flavor, though not much kick. The chips were very thick, a characteristic I like in my guac vehicle. Pork enchiladas verde -- meat was lean but tender, subtle; the sauce was both sweet and had plenty of seeds in it, giving me warm-belly for the next hour. The appetizer version (2 enchiladas) was plenty; I think it was $7 or so. I was much less impressed with the picadillo relleno of my friend, though I just had a bite. In the end, this place rates favorably with any of my beloved stuff in Austin. In the absence of complaints, five stars.", "author": "Ben L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-11-24", "description": "This is a total comfort spot my girlfriend and I often visit, even after she moved out of the neighborhood. Excellent enchiladas, great decor, small and cozy feeling. I hesitate to give the 5th star because it's a Mexican restaurant that doesn't give free chips, but the portions are large enough that perhaps chips would be too filling.", "author": "Albert P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-03-13", "description": "I have mixed feelings about Pequena. For brunch, it's great--the chilaquiles specifically. Very tasty and authentic. However, I just went there for dinner and it was mediocre at best. My friend and I split the black bean dip, which was satisfying in a gooey, cheesy way. The pork enchiladas were exceedingly bland--it was as if there was no salt or any seasoning at all in them. The dinner was reasonably priced but underwhelming. I'd say thumbs up for brunch and thumbs down for dinner.", "author": "Ami W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2007-06-28", "description": "This Cuban place is adorable, tiny, and delicious!  Margaritas from scratch (no mix!) and black beans and plantains are soooo good, and seemed healthy.  I'm planning to go back often.  Crowded and small, but accommodating staff and pretty chill patrons.  Easy on the wallet too.  Maybe we got off well having vegetarian dishes though, after reading people complaining about greasy chicken.  Well, that's what you get for eating meat :)", "author": "Michelle C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-30", "description": "I love dating, cause it's an excuse for me to wander the streets and stumble into little gems.  This was just one of those occasions.  We stumbled on this place after passing up the Outpost for being too crowded and frankly having faux margaritas.  I was craving a real marg and that's just what I go. I'll admit we had to wait a little bit, but they took our number and gave us a call when a table was ready.  Warning, this place is smalllllll, do not bring a big party here.  Just for the two of us it was snug, but frankly I'm inclined to call it cozy.  The aforementioned margs came in a  carafe and were delicious, fresh, icey, awesome.  We ordered the side sampler which had great plantains(and I'm picky), decent gauc though I've had better and some great refried black beans and pico.  For dinner we shared the pork enchiladas(yum) and fish tacos.  Service was friendly and attentive and we had an overall lovely time.  I'll certainly be back for those margs and that sampler plate(an excellent combination).", "author": "Aislinn H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-11-29", "description": "So, I've long been a fan of Pequena (they had me at fresh lime margaritas, and they're black bean and oaxaca cheese baked in a skillet is unbelievable).  However, I've never been there for brunch until this weekend, and it was awesome.  I had the cheese enchiladas and a breakfast margarita (it's never too early), and my boyfriend had an omelet with chorizo.  So delicious.  I'm definitely putting Pequena on the brunch rotation as well as lunch and dinner. :)", "author": "Lindy P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-02-05", "description": "3.5 stars. A dandy 1-2 punch with Chavella's.", "author": "Jeff M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-19", "description": "Really good margaritas, delicious shredded chicken, wonderful chicken tortilla soup, fantastic Mexican decor meets long lines and sometimes gunky food.", "author": "Sara W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-04-28", "description": "First review ever and it's not a good one!  I've been to this location numerous times and I recall like one good service experience.  Granted, I much preferred Bonita but, sadly, that closed years ago.  Anyway, we tried getting a table at Pequena on Tuesday and it was a full-on disaster.  Yes, it was busy and I'm sure the staff is overworked and underpaid; however, they need to at least greet folks upon arrival.  Literally, I stood in the middle of this little place and had the staff walk around me for like 5 mins.  I'm a big boy and hard to miss.  They were clearly not interested in acknowledging my mere existence.  I'm not going to even mention the time I ordered for delivery and they screwed up the whole order and basically refused to send a replacement.  I guess the food is fine.  Certainly nothing very special (again, no Bonita).  The shocking thing is that my service experience at Pequena in Prospect Heights has been uniformly great.  Folks, you can do better.", "author": "Andrew G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-10-25", "description": "Stay away - I ordered a shrimp avocado black bean salad which arrived with no avocado and 3 black beans. They refused a refund and instead delivered a replacement salad which was absolutely tasteless. Worst take out ever.", "author": "Anonymous B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-03-28", "description": "With all the options Brooklyn has to offer, I think I've gone to Pequena for the last time. My first experience here was delicious, but it has gone downhill since then.  The plantains were leathery, eggs were barely cooked and I can't really think of anything nice to say otherwise about the food; it was slightly above edible. Ironically, the overall friendliness of the staff has greatly improved since my last visit, so it pains me to scratch this one off the list. And their Bloody Marias are delicious which makes it even more of a bummer that the meal was so mediocre.", "author": "Jill P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-08-09", "description": "the food can be wonderful or slightly disappointing depending on how busy they are when you go... i recommend a tuesday or wednesday at 6-7pm. the fried fish tacos are lovely when they are fresh out of the kitchen. but honestly, their vegetarian fare is actually the most consistently gorgeous. i also think they do a pretty decent chicken tortilla soup...but i always order it without the 'tortilla' because their chips tend to be abnormally thick. yep, thick.", "author": "BethAnn F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2008-05-25", "description": "Can you say Fake Mexican?  I can, particularly after a visit to Pequena.  Seriously, when I asked for extra hot sauce I was handed a bottle of Tabasco, no joke.  That said, the food is pretty tasty, if a little bland, and the portions are large (I like the chiles rellenos, very filling).  The margaritas are a bit light on tequila and heavy on lime, so unless you prefer heartburn to a good buzz, you may want to stick to beer.  \nThe restaurant is small and cramped (not at all unusual in this neighborhood), and you'll definitely have to wait around for a table on a weekend night, but they'll take down your phone number and give you a call when your table is ready, very cool.\nWhile definitely not the best or most authentic Mexican I've ever had, I know I'll eat here again, so that's saying something.", "author": "Michael J."}], "servesCuisine": "Mexican", "priceRange": "$11-30", "name": "Pequena", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "86 S Portland Ave", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/KWpvOOon8kcWehPXnMptDw/ls.jpg", "@type": "Restaurant", "telephone": "+17186430000"}