{"aggregateRating": {"reviewCount": 317, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-09-19", "description": "i used to work 5 blocks away and man are my hips glad i changed jobs (even though i really miss my coworkers!!)... the guacamole is awesome and my black bean and plantain quesadilla is awesome. too much black beans/red sauce if you ask me (my quesadilla always got soggy bc i always forgot to ask for no sauce). but still quite quite good and filling. \nCASH ONLYYYYYYY", "author": "Gemma S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-10-17", "description": "Very good guacamole, good sautéed fish tacos, terrific service, and just a nice atmosphere for a meal with friends.", "author": "John N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-12-07", "description": "the place is comfortable, tiny but the food was great for its price. Recommended for casual, but a nice dinner. If you want to keep it light you can have a light meal and a beer for around 10-15 bucks.", "author": "Rebecca B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-03-29", "description": "Pequena is the source of THE BEST fish tacos in New York that I have come across.  They're margaritas are great, guacamole tasty, and their chips are homemade (the way they should be.)  Small and charming, it's perfect for a quick bite or some lingering quality time.  Having grown up split between the east and west coasts, Pequena holds a special place in my heart.  In a city known for amazing cutting edge cuisine, it's amazing how little vaguely decent mexican there is available.  All the more reason to shout out for joy that Pequena is here!\n\n*If you're around during weekday lunch hours, check them out.  The prices are lower AND include a side of guacamole.", "author": "Kristopher N."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-10-23", "description": "Meeeh, so-so service and the food left better food to be desired.  The chips tasted a bit stale and instead of getting spicy chipotle salsa, we ended up with the less-than-stellar pico de gallo; when this mistake was brought to the waitress' attention, we were advised we could mix in the chipotle paste ourselves.  wow-you couldn't just mix it and bring it back the way it was supposed to be?  I suppose i give them credit for not wasting food when correcting an order....i can only imagine them saying \"just pull out the chicken and we can bring you the steak to insert back in the burrito.\"  Waited about 25-30 minutes for tacos--did you have to kill the chicken first?  I don't mind the wait for GOOD food, but when I was brought two sad little tacos, I was underwhelmed.   I'm not sure if the staff are overwhelmed or I hit a bad night, but I've had better service at Chipotle- and frankly, better tasting food too.   Bottom line: edible, but needs some work. Buy a burrito from Trader Joe's and call yourself wise.", "author": "Tricia L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2007-02-10", "description": "Very boring, uninspired Mexican. Why is it always so crowded? Surely we can do better in Fort Greene. You're much better off at Castro's on Myrtle Avenue.", "author": "Josh H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2007-08-31", "description": "when i bring my friend from mexico here i am slightly embarrassed BUT i still love their brunch.  \"pan b\" and huevos rancheros are gorgeous!  the women who work here are good at what they do and i do really like the fact that they will take your mobile number to call you when a table opens up.  my only negative response is you should not come here if you are already starved.", "author": "christine r."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2008-08-27", "description": "Not as good as in California but it'll was not bad.  The people there were nice.  the food was ok.  I had the chicken taco.  There could have been more sauce, onions and a lime.", "author": "Chris F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-24", "description": "yum factor rising! fantastic tortilla soup - so super salty and tasty. portions are appropriately large. decor is nice. cash only.", "author": "julia r."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-05-29", "description": "On the positive side, the meat and tortillas are higher quality than you might expect.  However, they are clearly resting on the fact that they are basically the only game in town when it comes to credible Mexican in Fort Greene.  I ordered pork tacos for delivery and the three tacos were placed unappetizingly right on top of the beans.  This makes the otherwise good tortillas mushy and messy to pick up and eat.  You might expect that they'd add some contrasting crispness or flavor to the meat filling but you'd be wrong - no lettuce, cabbage, onions, or any fresh vegetable other than a bit of guac.  Very very bland. On top of that they forgot to include any salsa of any kind. Basically they are getting pwned by Loading Dock in terms of taco artistry and flavor.  If they were to step it up they could do a lot more business in the neighborhood.", "author": "Gabriel L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-11-20", "description": "The refried black beans are an addiction.  I would eat here multiple times a week, if I didn't have an \"eating out\" limit!", "author": "Shane B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2008-03-16", "description": "I think Pequena is pretty good. I thought the guacamole was awesome and my meal (black bean and plantain quesadillas) was great too. There are definitely some cons about the place though like the fact  that you can't make a reservation, the restaurant is extremely small, and the margaritas are weak, but other than that it's good and I would definitely go back.", "author": "L S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-16", "description": "corn tortillas. blackened shrimp. lime. (i added chipotle mayo). tasty as tasty can be. do it.\n\nmargaritas are awesome and will get you to that special place. mango? yes. raspberry? yes. coconut? yes. lime? yes. \n\ndo 'em all.\n\nthe only drawbacks are that they only take cash and you may be smooshed, depending on the crowd. for sure, it's a place you take that chill person you're trying to lay.. . .  never take those that can't hang.", "author": "ascheras g."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2009-07-28", "description": "It was ok...fill your belly kind of food. I didn't think they used any decent ingredients in the food either... a lot flavorlessness. Service was ok nothing special. I am sure there is better Mexican food in Brooklyn. I would rather eat at Habana Outpost for sure. I know its not Mexican but it is good and has lot of flavor.", "author": "Jo S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2007-04-16", "description": "The food in Pequena doesn't taste like West Coast Mexican food because it's in Fort Greene, bitch!", "author": "Borat S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2009-03-01", "description": "mediocrity.  i have only experienced a dinner selection once.  my roommates and i ordered salads and enchiladas which were edible, however not spectacular for the plethora of dining experiences available in fort greene.  the chips and pico and guacamole were the highlight of the meal.  the chips were homemade with a particularly tasty spice sprinkled over the basket.  the guacamole was good as well, however missing garlic and the citric tang i tend to enjoy.  i will negatively address the awful service i endured.  the waitstaff was pushy since my party and i ordered more margaritas then dishes.  we were even asked to relocate to the \"bar\" area which consisted of three bar stools against the non existent outdoor area to accommodate another party waiting for a table.  i enjoyed the atmosphere, crammed however cozy, but i have no intentions of frequenting.", "author": "julia v."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-11-01", "description": "love the the tosdada's, main portion is huge so you probably end up taking some part of your meal home, which is great because then you can enjoy it again the next day.....sometimes the wait is to long bc the place is tiny, although with the new seating in the sunroom this looks to have improved", "author": "Ragger K."}], "servesCuisine": "Mexican", "priceRange": "$11-30", "name": "Pequena", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "86 S Portland Ave", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/KWpvOOon8kcWehPXnMptDw/ls.jpg", "@type": "Restaurant", "telephone": "+17186430000"}