{"aggregateRating": {"reviewCount": 317, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-04-15", "description": "So, first off, the food is decent. DECENT. The wait staff was really polite and helpful, but then there was what could only be the owner or manager. This middle-aged woman was incredibly rude and would snap at both the waiter and the customers. My group came in for brunch and it literally became the topic of conversation, watching this woman be rude to everyone. We enjoyed our food -- but the only thing memorable was the over-priced drinks. We'll never go back however, after reading the other reviews on here, apparently it is a common trend.", "author": "Lee B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-25", "description": "I really like this place. First off, l  have some sort of obsession with Day of the Dead decor, don't care if it's cheesy, but it makes me happy. It is damn tiny, but still cute. The wait staff is surprisingly (surprising only because I am a judgmental asshole, and always assume people dressed hip-ly will be annoying jerks) friendly and accommodating. \n\nFood is really delicious, especially since I am assuming (doing it again) that this place is run by gringos. I usually get some combination of tacos here, and always a rice and beans plate. The rice and beans are awesome. I am especially fond of the fish tacos, the skirt steak tacos, and the mushroom tacos. That might be all the varieties of tacos that they have, now that I think about it. \n\nI haven't had one since the first time I visited, but I had a very delicious-and-interesting-to-my-taste-buds habanero and fruity flavor margarita (raspberry?).", "author": "Ann T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-21", "description": "Great food, okay service, but real authentic mexican food. I mean I grew up going out to eat Mexican in California and this is as close as I've gotten to the same standard I got there. Cute little quaint place, great portion, sizes. Only downsides might be they don't accept card and sometimes there's quite the wait on a friday night. Other than that, cheers!", "author": "Nicole S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-12-30", "description": "The wait staff is extremely friendly and the Margaritas are on point and not to pricey at $8 ($5 during Happy Hour which made me extremely happy) OTHERWISE this place would have gotten a 1-star rating. The food is just bad, made with no love at all and frankly overpriced. I had the Fish Taco main which was awful. The rice and beans are bland and stale - chips are powdered with this overly salty chili dust and the pico de gallo has no flavor at all. None of the foods i tasted was seasoned properly for a Mexican place.  Whoever cooks there either doesn't know what they're doing/doesn't care and/or isn't Mexican.  If you like Mexican food, i would say AVOID this place. For a few drinks, it's a cool little hangout spot - the music is usually good and Margs are $5 during Happy Hour which is a good deal.  If you want to have great and cheap Mexican food, go to Chavela's in Crown Heights or La Superior in Williamsburg.", "author": "Nicole R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-13", "description": "Decent Mexican food in New York City, if a bit expensive ($8 for chips and guac?!?!), but portions are big enough that it's usually more like two meals. Plus the decorations are awesome.", "author": "Emily W."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-05-05", "description": "I am qualified to give a sound review because I have eaten  there several times. The food is good that's why I have given them chances. However,\nThe service is TERRIBLE !!!!!\nThe waitresses are extremely unfriendly. The manager ( She has red hair and wears  glasses) is a TOTAL BEYOCH !!!\nThe only thing that saves this restaurant from going out of business is the Mexican cooks in the kitchen. They better pay those cooks a whole heluva lot of money !", "author": "Randy S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2007-04-14", "description": "Yes, it's Americanized Mexican food. No, it's not half as good as west coast Mexican. Yes, it's super crowded all the time.  So, why four stars?\nCall me nostalgic for the old 'hood, but I always really enjoyed myself at this place, cramped up next to the bathroom in a tiny chair and all.\n\nHow to maximize the Pequena's experience, for those of you that haven't figured it out: \n- Sit outside. You're less likely to be smashed up against a random hipster that hasn't showered in a few days.\n- Go there for brunch, and get there before noon. Service will still suck, but not as much as on a Friday night. Plus the brunch is better than dinner, anyway.\n- Order lots of margaritas, guacamole, black bean and plantain quesadillas, and (christ, i'm forgetting the name of it) that brunch dish that is basically nachos with chicken/avocado/cheese on it. You'll be happy, trust me.\n\nAnd honestly folks, be happy you're living in Brooklyn. I've got all the authentic Mexican food I want here in southern California, but that doesn't make it suck here any less.", "author": "Thea T."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-07-30", "description": "YUUUUUUUUCK!\nI recently took my domestic other to the Pequena on Vanderbilt, and the Cali boy was wowed by the enchiladas and pork tacos.  When we found ourselves in Fort Greene this evening, I mentioned that there was a Pequena just a block away and he was thrilled.  Then we sat down, we ordered, the chips came, and the thrill was gone.\nI cannot believe I am saying the chips and salsa were the best thing that we got.  And it wasn't even salsa, but more of a really watery pico de gallo. We got the enchiladas and tacos again and it was laaaaame...enchiladas were boring. no spice, no flavor. Tacos were the same, really dry-both the taco shell and pork were overcooked. The pickled onions were a little too soft, and the guacamole was just a texture-no flavor at all.  It was busy, but not that busy, and our waitron was courteous, but hardly attentive.  I will definitely try out the Pequena on Vanderbilt again, but this place--no way.  Plus, it seems quite filthy--the table set up stations are right outside the bathroom. grossssssss", "author": "Jessica V."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2007-07-17", "description": "A cute restaurant that is appropriately named. This place is definitely cozy. Not the best or most authentic Mexican food I've ever had. Not even close. However, the chips, fresh pico de gallo and guacamole were like crack - I seriously could not stop eating them.\n\nSadly, my breakfast burrito was subpar. The eggs were overcooked (a problem I unfortunately encountered with all of the eggs I had on my recent NYC trip) and the flavors were lacking. Plus the black beans on the side were over salted. \n\nAgain, it's all about the delicious freshly made chips, guacamole and pico de gallo. The three star rating is based largely on those items. The service was very friendly too.", "author": "Jenny K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2007-12-06", "description": "Pequena, in my opinion, has a really cute feel about it. I love the light strands and all of the little knick-knacks hanging on the wall. It has the air of a really comfortable little house.  Let me say though, that if you are the kind of person who doesn't like to bump elbows with your neighbors from time to time during your dinner then you might have a problem with this place!\n\nThe food at pequena disappointed me a little since I really did love the atmosphere.  I was feeling a bit under the weather so I had the tortilla soup which was really lacking. The broth was luke warm and didn't have much flavor and there were more than a couple of questionable pieces of chicken.  However, the slices of avocado were perfectly ripe and the tortillas were still nice and crisp when the soup got to the table. After a bit of tweaking, okay, more than a bit, meaning shake after shake of hot sauce, it was good....not great!\n\nThey do have one nice feature which is that you can pretty much order and appetizer or entree portion of everything from tacos to enchiladas although they don't let you mix and match which is a little frustrating but I can understand because their kitchen is indeed small.\n\nMy friends all seemed to like their dishes on the level that they were good but they'd had better. So if you're just looking for a small, quiet atmosphere and a quick bite then I'd say give it a try!", "author": "Jessica G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-28", "description": "Decor/Experience\nNice wait-staff...check.\nNice atmosphere..check.\nWorth the wait...check.\nClean Bathroom...check.\nSmall,Quint, Romantic...check.\nGood clientele...check.\n\nFood/Drinks\nDelicious Margaritas...check.\nFresh Meat/Veggies...check.\nFlavorful combinations...check.\nAbility to edit a meal..check. (i am always a pain and doing so)\nAppropriate Portion Size...check.\n\nThis place rocks. I have never had a bad experience. I have taken a star away because you will have to wait and its cash only. It is very small... but man its worth the weight.  My suggestion is to get the appetizer size tacos.. the steak ones are delish!  Then share an entrée \u0026 another app or each get an entrée.  \n\nTo speak to their friendly demeanor, we ordered wine while we waited.. (you can always drink outside while you wait).   The bottle we wanted was not yet chilled, so they put it on ice in preparation for our meal.  Then the waitress came outside to give us, for free, the remainder of the bottle they did have left! So nice. Also, me being my normal pain in the ass, altered my salad and they gave me no problem. In fact she helped me figure out what was the best solution.\n\nLove this place!", "author": "Justine M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-19", "description": "Normally I order take out and usually I just order the sampler (guac, black beans, sweet fried plantains, and pico de gallo with corn tortilla vs chips). My one problem with them is that when I call they put me on hold.. I hold for apprx. 3-5 mins give up, hang up, wait another 3-5 min and call back... for some reason on my 2nd call I always get my order in???\n\nOn the plus side they have really good fresh food. I don't know how authentic is it but I have only had great meals here. My favorites are the plantain and black bean quesadilla, the guac with chips and smokey chipotle salsa (tres spicy!!) and the enchilada (when I was eating meat back in January I had the chicken which was good and more recently the cheese and mexican vegetable)- all tasty. I once got the fried fish taco but it needed some fresh salsa to give it a kick. All in all very good. You should try it!\nI hear they have a great brunch too... I need some neighborhood friends man. \nPS they are open until 11 on week nights which is later than most restaurants in the area.", "author": "Emilyna C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-11-04", "description": "Came for brunch. Eggs were well prepared. The huevos rancheros seem to have been covered in canned marinara instead of salsa roja. The beans and chorizo were tasty. Fine for east coast Mexican food.", "author": "Cassy G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-01-03", "description": "I really want to give Pequena more stars, I really do. I live about 2 blocks away from the place and can't seem to get up off of my couch most cold days to go pick up my own food. They're nice enough to bring the food right to me. Only problem is they can never ever ever get the order right.\n\nMy husband and I are pretty predictable when it comes to our orders here. We get the exact same thing every time. I order the chicken enchiladas and he gets the chicken quesadilla. He asks to please have the guacamole on the side and an extra salsa in addition to the one that comes with (it's tiny, not quite enough for the 2 quesadillas that come in the order). He does this to avoid the sauces making the quesadilla soggy. Without fail, EVERY SINGLE TIME... they get the order wrong. EVERY TIME! It's insane. They don't forget to charge us for the extra salsa, but they do forget to send it in the bag. We call, they take another 30-40 minutes to send the salsa and then we just end up telling them to forget it. \n\nTonight was the last time. We will not be ordering from Pequena any more. Dining in might be easier because you have someone there to correct any mistakes on the spot. Any delivery orders should be done at your own risk.", "author": "Lindsey C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-22", "description": "Yum, yum, yum. I had the cheese poblano relleno. It was just spicy enough and roasted perfectly. It was so good that I ordered it again (in all fairness to me, I ordered the a la carte plate both times). This place has great ambiance (Dia de Los Muertos with flair and humor) and a friendly staff. The drinks could be stiffer but, hey, I'm not complaining. Viva Pequena!", "author": "Tom C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-02-17", "description": "I don't care what anyone else yelps about this place, their food is delicious. I stopped in yesterday evening for a \"snack\" with a good friend. We scraped our plate of stewed pork quesadillas, with savory beans and rice, completely clean. \nI don't know how they do it, but I leave here happy and half drunk after a couple of excellent margaritas every time. Even their salsa is yummy - chunky, fresh, spicy - with just the right amount of cilantro. \n\nMaybe it's not \"authentic,\" but I enjoy every single bite.", "author": "Jessica U."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-07-08", "description": "My favorite spot to get chicken or pork enchiladas!  I've been looking for GOOD Mexican, and I have found my Los Angeles equivalent enchiladas.  I haven't tried anything else, but the meats are tasty!  Also, they don't have a full bar, but a good selection of tequilas. \nSeems like the reviews differ, but I love it!", "author": "Em P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-15", "description": "Been here a couple of times... The food is pretty good overall, but I'm in love with the Mexican Hot Chocolate. Wow. I can't wait to go back just for that!\n\nThe food in general has been fine: tasty, seemingly fresh, plentiful. Breakfast was delightful here. I just wish this place was bigger... It's hard to get into, especially during the weekend.\n\nMaybe I can get that hot chocolate to go...?", "author": "Alex G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-10-26", "description": "I really wanted to love this hole in the wall Mexican joint in my neighborhood, after all you need to support the community, right? Sadly I have been pushed over the edge after trying several times to get some decent food here. The prices of the appetizers and entrees are high, and mistakenly I always expect something reasonably good in return. My last meal here - the half rotisserie chicken was my worst chicken experience in many years - it was bland and heavily recooked and the skin was soft and gooey - yuk - I think my knife even buckled while trying to cut into it. The staff are nice though. So in summary, BAD FOOD, GOOD PEOPLE.", "author": "Rajiv B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2008-12-20", "description": "Like the other reviews here, I agree that the lunch special is a great deal. You get a generous amount of food for a less than generous amount of money. Had mushroom torta and it was pretty good - I wouldn't say it was the best mexican food I've ever had, but very decent.\n\nThe space is tiny, and I was here for a weekday lunch with extremely bad and slow service. Slow, like over 30 minutes to get the food. Of course, our server was busy eating his own lunch, so our order may have been sitting in the kitchen a while. Oh, well...\n\nNo credit cards. Whatsoever.", "author": "Jacqueline K."}], "servesCuisine": "Mexican", "priceRange": "$11-30", "name": "Pequena", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "86 S Portland Ave", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/KWpvOOon8kcWehPXnMptDw/ls.jpg", "@type": "Restaurant", "telephone": "+17186430000"}