{"aggregateRating": {"reviewCount": 317, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-20", "description": "The food was amazing!!! Pequena puts a twist on traditional Mexican dishes. I tried the quesadilla with sweet plantains. This is as good as it gets!", "author": "Jesica L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-09-14", "description": "It was good food, service was about as expected reading the other yelp reviews. We had the skirt steak tacos and they were tasty. Just took a bit longer to order than seemed necessary, and no one came by once for additional drinks or to even give us a check. Maybe if they could figure out the service they can start justifying the costs!", "author": "James B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-28", "description": "Still one of my absolute favorite places after many years. (I love the plantain and black bean quesadilla, and their guacamole is some of the best I've had.) Good happy hour, and prices haven't changed dramatically since 2004. Cash only.", "author": "Sara D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-11-09", "description": "The food was ok.  The service was so so.\nFor those yelpers and readers that are wondering why it's called pequena, it's because it's a small spot and you are literally sitting arm and arm with the next person beside you.  I don't know if this was to create a more intimate feel or this restaurant is trying to maximize their space. \n\nMy meals was a bit pricy for 3 tacos that fell apart easily. \n\nI don't think i'd come back here for a few reason.  1. space, 2. staff friendliness 3. space.", "author": "Sha T."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-12-23", "description": "Food is pretty good for price and portion but my god get yourself a better waitstaff. I'm a waitress and I was like .................... \n\nThe whole time. \n\nService changes everything ladies \n\nAlso , chill with the rose's lime juice ew.", "author": "Theresa A."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-10-19", "description": "On the 2nd time I ordered in for delivery there was a hair intertwined into my avocado that was on top of the salad. :(", "author": "E J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-13", "description": "Go for the small selection of killer lunch specials.  (Including the tasty $5 maragitas.). Food stays closer to authentic Mexican than most, which stands to reason when you peek into the kitchen.  The empanadas are great.  The server will ask you whether you want red or green sauce, or why not try a \"little bit of both?\"\n\nThe sides that accompany the dishes--rice, beans, guac, pico--are well seasoned on their own but can take a couple dashes of cholula.  \n\nThe decor is outrageous.  I found myself snapping close ups of all the weird Mexican folk art.  A 5 year old would probably have a ball in this place. Although I would have to advise parents with very young ones to leave their clunky strollers at home and strap on the bjorn.", "author": "Michael L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-30", "description": "I ate here 5y ago. A burrito. And it was so delicious that I made a mental note that great burritos can be found in NYC. Then I lived in Long Island, followed by Hoboken. Sadly, I have not had a great burrito since. So I wrote my friend in Baltimore to help me figure out where it was she lead me to with the great burritos. It was here, in Fort Greene, we had bday drinks nearby and I stopped here after. The food was too good to be true: I had only had Mexican food THAT good in California, Arizona, Mexico (and surprisingly, yes, Chicago). I loved the vibe as well and decor. Just unforgettable.", "author": "Laila D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-07-24", "description": "I have been here many times, and the food never disappoints. It is fresh and flavorful. But the ambience really varies: today was a drag. A hot Sunday afternoon and I looked forward to relaxing. My young waitress was friendly but too laid back: most of the time I was there she was hanging out with her buddies, sitting on a stool between them, as if they were all out for lunch together. Combine that with a too loud soundtrack of a recent college grad's favorites, and my pleasant meal was basically ruined. Too bad...last time I was there the soundtrack was 60's hits! Would be better if they were more consistent.", "author": "Virginia R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-10", "description": "Pleasantly surprise by this place. Stopped in on a whim with a friend during brunch. I had a mushroom quesadilla and she had some sort of egg bake- both were really fresh and yummy. Service was attentive. The bill for two (no adult beverages ordered) was under $25 including tax which is a really good price for generally overpriced Brooklyn brunch. I'm not a huge brunch fan most of the time, but I would come back here.", "author": "Ali C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-03-11", "description": "Bad service, the service personal acts as if the consumers don't exist. Waited forever to order and servers very rude...", "author": "Nandus D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-09", "description": "If you're vegetarian like me, the quesadillas are the thing to go for. They're distinct, very flavorful, some of the best I've ever had. Try the mushroom and the plantain. You can get both in a platter. Overall this place is a bit pricey for what it is but I've gone back often anyway for the superb quesadillas - enough for two meals at least with a platter - and homey unpretentious atmosphere. Look forward to trying the breakfast.", "author": "Nicole F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-09", "description": "Food is good at the Fort Greene location. The Vanderbilt location has a lot more room inside, but the food isn't as good as Fort Greene. They have a great, cheap lunch special with a lot of food. \n\nI give it 4 stars because:\n- service can be very slllooowwww \n- chips have too much red spicy stuff on them sometimes\n\nBut other than that, it's a popular place for lunch!", "author": "Rachael P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-07-10", "description": "What happened, Pequeña? Your rice isn't the same. Now it's really bland and pale. Your chicken quesadilla wasn't crispy enough and failed to wow me. That dish used to be my staple.\n\nI'm also reminded of last summer when I dined at your Prospect Heights location, where a lady wearing a tank top was sporting enough hair under her arms to cornrow. Not a pleasant sight in the food-service industry. I digress.\n\nPull it together, Pequeña.\n\nAlso, they're not kidding. This location is muy pequeña with limited seating.", "author": "Zenovia E."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-01-31", "description": "Quaint little Mexican joint off Fulton. \n\nFood was good. Presentation was great. Entrees were camera ready. Location is great. Restaurant size is very small. And service is terrible. \n\nOverall not too bad of a place. Try not to let bad service ruin the experience (which can be hard to do)", "author": "Unknown Consumer S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-12-11", "description": "This place is true to its name. It's really pequena. It probably doesn't fit more than 15 people. So if you want to get intimimate with a friend, let this be your place. I'd avoid it during prime time eating hours though.\n\nWe went for a late night snack and got the sampler including guacamole, salsa, and sweet plaintains. Although it was a little more than I wanted to pay ($13) It was the perfect snack for what I wanted, which was something not fried or greasy, that would easily satiate me. \n\nI look forward to going back and trying the regular menu.\n\nPS: Don't forget to bring cash. This establishment is cash only", "author": "renje g."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-22", "description": "Pricey but decent Mexican - and that's quite a compliment coming from a native Californian who believes NYC has it all culinary-wise except good Mexican.  I've only ordered take out from here - partly because of the other bad Yelp reviews on the bad service and cramped quarters - but everytime it has been a good experience.  \n\nThe black bean dip is awesome - a meal in itself!  The tostada is meh and the enchiladas are not bad.  Their black beans are great but the rice is weird and bland (as others have commented).", "author": "Akruti D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-10", "description": "The black bean and plantain quesadilla was very tasty. I brought the entree (quesadilla plus yellow rice and black beans on the side) thinking I was going to be full however, it was more than enough. I recommend people stop by before the spring and summer hustle and bustle.", "author": "Kai N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-13", "description": "Interestingly enough, they have the best French toast I've ever tasted!  Server was also pretty nice and the location is sweet (right above a Subway stop \u0026 near several other cool neighborhood businesses).", "author": "Paddy M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-11", "description": "Best Mexican we've had in Nueva York. The Pico is on point, the tostada is well balanced, and the mushroom quesadilla is nothing short of sumptuous.", "author": "Josh S."}], "servesCuisine": "Mexican", "priceRange": "$11-30", "name": "Pequena", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "86 S Portland Ave", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/KWpvOOon8kcWehPXnMptDw/ls.jpg", "@type": "Restaurant", "telephone": "+17186430000"}