{"aggregateRating": {"reviewCount": 317, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-23", "description": "I have eaten at Pequena twice- once last summer and recently two weeks ago. My meal over the summer was tasty but didn't leave me filled, and the service was alright.\nMy meal from two weeks ago was spot on. I got the fish tacos (my first fish tacos at any restaurant) and the chicken enchiladas (what can I say, I was hun-gry). The cool thing about Pequena is you can order the dishes as appetizers or as main dishes with rice and beans. \nDrinks are good too. The place is small and can fill up fast (so no large groups and please leave the suv stroller at home) but worth it.", "author": "Chey H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-08-08", "description": "It's aiight...  but not as good as I had hoped.\n\nSpace:  Small (it's called Pequena, right?) and kind of clumsily (stereotypically) Mexican themed.  Lots of strange things hanging from the ceiling... (there was also water dripping on my back from an A/C duct on the ceiling).  Everything felt a little sticky/\"grubby\" (just like in Mexico?).\n\nFood/Drink:  I went for lunch and I have to say the price is right.  $7-9 bucks for the entrees (and $5 (regular or flavored) margaritas!).  I had the (vegetarian) mushroom torta which was actually very good and accompanied by chips and either pico de gallo salsa or guacamole.  My partner and I got one of each and shared.  They do not skimp on the guac!  The margaritas were ok, but must be premixed as they came out super fast and despite the ice, the liquid itself was still warmish.\n\nService:  Fine... nothing over the top, but sufficient.\n\nWould I go again?  For lunch, possibly... but not sure the price/value/ambiance proposition makes sense for dinner.", "author": "Kevin F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-29", "description": "This little joint right near my apartment is a great place to grab Mexican brunch, which is difficult to find in this fair city of ours.  Fair prices, good quality ingredients, and friendly service.  Cafe con leche was strong and hit the spot.  The egg pan was delicious with plantains, refried beans, avocado and chorizo with hot tortillas to roll everything up.  Add some Cholula sauce, and it's a hearty brunch that'll keep you full until dinner!\n\nCash only.", "author": "Dee S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-14", "description": "This little spot has become a weekend staple for me. The food is really fresh (from the guacamole to the tortillas and black beans) and it's not overpriced. \nThey are a member of the BAM restaurant group, too, so if you have a BAM membership you can get 10% off your bill. Only thing that isn't great is they don't take credit cards. Just cash. But, still very much worth the trip for an authentic, fast, delicious and reasonably priced Mexican meal.", "author": "Stefanie J."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-09-08", "description": "Sad to write this review cause I had wanted to try this place for a while. \nAs soon as we walk in the woman gives us attitude, because the music was so loud inside that I took an extra 3 seconds to decide inside or out. It was so bad that the guy in the kitchen laughed.\nWe should've left but figured, hey we all have bad moments so we let it go. The food was OK. It probably would've been better if we had enjoyed our experience. We also found a piece of plastic in our chips, but I picked it up and put it aside. It shouldn't have been there but it wasn't like a bug or something so we didn't even mention it to them. \nLater, the same woman picks up our plates, and she does so so carelessly that the fork falls on my boyfriend's lap, spilling black bean all over his shorts and shirt. smh. Again, it happens. She asked if she could bring seltzer, and offered a free dessert, but we really at this point wanted to get out of there. \nHe also had to ask her for a bag to put our takeout in. \nBasic service lacking from this poor woman who obviously doesn't want to be working there. Someone give her a job in whatever she really wants to do! \nThe other people who worked there seemed very nice so it's unfortunate that we dealt with her and that leads to this review, to ensure others don't have to.", "author": "Kat I."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-10-09", "description": "What happened to your margarita? I've been coming here for over five years to enjoy delicious margaritas. They're consistent, flavorful and they're a classic margarita. The other day I had a margarita that gave me a headache. It tasted disgusting, was all lime, and tasted like roses lime juice or lime concentrate. Get your margarita back on par please please!", "author": "Beer S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-13", "description": "Really cool spot...kind of tight, but adds to the charm. \nI really enjoyed my meal and thought the food was inexpensive for the taste and portion. \n\nMy friends enjoyed the variety of margaritas they had to offer, even though I stuck with my usual Negra Modello. \n\nAn intimate, cool spot for a small group. Nit recommended for a large group- simply too small and quaint.", "author": "Luisa D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-10-04", "description": "Pink and white twinkle lights and mini-piñata statues hang over the tiny Latin multi-colored shanty restaurant. We came in for a small snack, unable to resist the little restaurants charm, and what we got was a $12 sampler plate that turned out to be a behemoth pof the most delicious guacamole, pico de gallo, fresh refried black beans, and plantains with home-made tortilla chips. \n\nThe staff was wonderful and we overheard a woman ordering a plentitude of fresh vegetables and ingredients over the phone, always a great sign. We felt like we'd been transported from Brooklyn to Costa Rica.\n\nThe restaurant is perfectly named Pequena... A tiny place overloaded with charm and yummy-ness.\n\nIf you want more suggestions about awesome things to do and ways to appreciate New York, visit our blog: www.singeromara.wordpress.com", "author": "Kelley O."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-10", "description": "summer drink spot.   yup.  Thats the place,  Drinks are nice and strong.  Chips are great too, and staff is friendly and quick.    Was here on a Sunday after the Dance Africa Bazaar and they were ready for the increase in foot traffic.   very affordable as well.", "author": "Jean L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-26", "description": "I love this place! \nI have been here many times for both brunch and dinner and I love them both. The food is good (although no mexican in NYC compares to mexican in LA) and the margaritas are tasty and well liquored. \nI do wish they would give out the chips and salsa free but it seems everyone in New York charges for chips and salsa. \nI would absolutely recommend this place!", "author": "Alex V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-06", "description": "Food was pretty tasty for brunch and we didn't have to wait at all.  The servers were also really sweet.  I wasn't feeling well and ordered a small scrambled eggs dish--the green eggs and jamon, with bacon--which was fine but nothing extraordinary.  But I have a feeling I misordered.  My friend's burrito looked amazing and I had lots of food envy for other tables.  I also must note that the coffee was quite tasty and free-flowing!  They only had margaritas and sangria (and we had our hearts set on bloody marias) but honestly that's a minor point to quibble with since the margs were pretty good.  I will definitely be back.  Oh, and points added for the colorful, kitschy decor!", "author": "Maeve M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-07-12", "description": "I went to Pequena's last night with some friends, I had the chicken quesadilla and it was really bland and pale looking... no flavor what so ever.. very much not memorable.. my friend gave me a bite of her chicken burrito and I wasn't impressed to say the least. I wouldn't dine here for food, drinks maybe. My margarita was ok, a bit sour... I've had better food even from a taco bell.", "author": "Shay D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-02-28", "description": "Pequena has ruined bunch. Ever time I go to brunch somewhere else I think: \"This is really good, but I'd rather be at Pequena.\" It is also beyond me that anyone would order anything other then the  \"Pan C\" ($6) http://www.yelp.com/biz_photos/KtzxoHCm9N9QJi31TNjbhw?select=cbeT57_iTq6bzcdW0hizjA - it's a small pan of sweet plantains, black beans, 2 fried eggs, queso fresco, and fresh salsa, served with 3 corn tortilla. I then drown it all in half a bottle of Cholula (because it is the greatest hot sauce on earth) and chow down. My friends like the Breakfast Burrito Challenge ($6.5) http://www.yelp.com/biz_photos/KtzxoHCm9N9QJi31TNjbhw?select=M_ON9uj8MGESeiE8iUup0A - no one can eat the whole thing in one sitting, but it tastes so good that you really really want to. \n\nThe staff is very friendly, a table for 3 will probably be a table for 2 with an extra chair, and they make a mean café con leche! I try to arrive before noon and as a party of 4 or less - this has always gotten me a table right away (except today, I had to wait 20 min to get a table at 11:30...  you can't see it but I'm shaking my fist to the sky).", "author": "Kelly B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-06", "description": "Pequena may be small, but it's big in flavor and character. The mushroom tacos are my favorite, loaded with sauteed mushrooms, a heap of guacamole and pickled red onions add the perfect kick. And the refried black beans, pork tacos and plantains have yet to disappoint. Service is friendly and drinks arrive within minutes- always a good thing in my book. \nI'd say A+ gold star all around! \nLove you Pequena!", "author": "Alma S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-08", "description": "Margaritas are awesome!  I had the mango one and my friend had the grapefruit jalapenño one.  The cheesy Mexican decor on the walls is very cute.  The guacamole and chips were amazing as well as my order of 3 enchiladas where you can get both green and red sauce...YUM!", "author": "Amelia M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-07-01", "description": "This place has a nice vibe, friendly staff and they were playing pretty good music. It wasn't crowded when I went - though it was a weekday afternoon. \n\nThe food was not spectacular. I had fish tacos and guacamole and chips. I thought the guac was pretty bland and the fish tacos were just ok. The rice that was served with the dish was just yellow coloured plain white rice with not much more flavour.", "author": "Little C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-06-17", "description": "Cute Place.  Margarita was ok.  Service was ok.  Food was ok- had fish tacos and shrimp tacos.  The shrimp tacos were better.  The fish was overcooked and dense.  The rice was so bland.  The chips for the guac... they were stale or something.  They are super thick and some were weirdly chewy.", "author": "Jane K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-08-15", "description": "Solid spot, although a bit pricey for me and skip the margaritas, you can get better elsewhere. Still, the tacos are filling and the service is functional. The colorful \"day of the dead\" style decorations add some nice atmosphere. A nice place to have in the neighborhood. \n\nOverall, Pequena probably won't blow you away, but it will leave you fat and happy.", "author": "Michelle L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-11-30", "description": "Horrible experience. Mice in the dining room says a lot, but the attitude of the waitresses was worse. Upon seeing the mouse one of the waitresses tried to kill it, and then told us \"its New York.\" They didnt even comp the meal we didnt eat. Appalling waitstaff and unsanitary conditions. Dont even waste your time.", "author": "Nilcem H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-23", "description": "I love the sangria...the place is pretty small but the waitress are the best...and cute. The food was amazing...I can't wait to go back", "author": "Gregory A."}], "servesCuisine": "Mexican", "priceRange": "$11-30", "name": "Pequena", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "86 S Portland Ave", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/KWpvOOon8kcWehPXnMptDw/ls.jpg", "@type": "Restaurant", "telephone": "+17186430000"}