{"aggregateRating": {"reviewCount": 317, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-28", "description": "I love this place.  My friend and I used to live in the neighborhood and we would eat here whenever we wanted some good Mexican food.  She just came to BK to visit me this year on the 4th of July and guess where we went first?  We used to rock with this place before they got the closed-in dining porch.  I always get the shrimp quesadilla. I always like to take a quick peek in the kitchen when I go because I love seeing the cooks \"throwing down\" as if they were at home!  Remember CASH only. They really need to buy the place next door and expand (not talking about Moe's Lounge on the corner... I love that place too).", "author": "Erica L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-12-09", "description": "Bland food. Undeservedly snooty waitresses. super slow. cash only.\n\n\nMore details:\nSurprisingly expensive: $65 for two people. We shared an appetizer (chips w/guacamole) then i had tacos, my girlfriend had an enchilada. And we each had a glass of sangria.\n\nThe yellow rice was so flavorless it was weird.\nFavorite part: They were out of beans. So they just served lettuce instead and acted like they were doing us a favor. We were super nice to them while we were there, but come on, there's a bodega next door. How long have you hipsters lived in this city? Walk outside, get some goyas. Then we asked what was in the salad and they said avocados, but they were out of avocados too.", "author": "Benjamin T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-10-31", "description": "5 stars on the music listening to (\"Lithium\" by Nirvana) during dinner, A+ 4 stars on the food, We had the sampler, great value for the money. We also had the fish tacos and shrimp tostada, both solid but a little pricey. 3 stars on the service, nice waitress but we had to ask for utensils and the check after being finished for awhile (she was having a conversation with her friend). 2 stars on the drinks- although tasty both the margarita and sangria made of very cheap alcohol made us hungover the next day- we love to drink, just not swill.", "author": "Jillian R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-01", "description": "Wonderfully tasty Mexican food and drinks! Food portions always leave me feeling stuffed and satisfied (especially the brunch and lunch menu). Overall, this is one flavorful and colorful place, now one of my favorite restaurants in the neighborhood.", "author": "Lauren M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-01-24", "description": "You'd think a place so small would have better service. My boyfriend and I split a carafe of margaritas, which tasted like sour lemonade without tequila. We also ordered guacamole, which went to another table that was seated after ours, tortilla soup, which never came at all, steak tacos and a chicken enchilada. The food was mediocre and the servers seemed miserable. Definitely not worth the wait.", "author": "Alisa P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-05-30", "description": "Went here again this weekend for the countless time. I tried the shrimp tostada and was actually kind of disappointed. That's a first. The shrimp was overcooked and tasted really fishy. Perhaps to offset this fact it was covered in guacamole, so much so that I had to dig to get to the bottom. The taco salad was really good though, fresh and zesty with big chunks of avocado. I mostly ate off my boyfriends plate, and the pulled pork enchaladas were fantastic. Disappointed in the shrimp dish, but I'm sure I'll return before long for some redemption.", "author": "Kristina V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-12", "description": "Chicken quesadilla and guacamole and chips are the fucking bomb at this place. I love it!!!!", "author": "Gloria B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-05-17", "description": "The quality has really slipped here. It used to be consistently good, but not anymore. I was in on Saturday night with friends from out of town. The wait staff were as friendly as ever (thus the two stars), but the food just wasn't good. The chips are no longer as seasoned, the salsa no longer as flavorful, the plantains too soggy with oil, and the chile relleno soggy. The black beans were still decent, but not enough to save the rest of the meal. My friends didn't like their fish tacos or chicken soup either. Sadly, I won't be going back.", "author": "Ann M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-04-07", "description": "I rarely review restaurants, but at Pequena I had one of the worst dining experiences of my life and I feel compelled to share it.  I arrived 45 minutes early but was told I cannot give my name for a table without the other member of my party.  When he arrived, we were rudely instructed to step outside onto the street until a table opened even though it was freezing outside.  When we were seated, we had to keep getting up for the staff to rearrange tables and push our chairs around.  The entire time, the staff complained loudly about other customers.  The food was average quality.  I left a 25% tip just to see whether that would curry some favor but the waitress grabbed it and walked away without even looking at me.  I was perfectly polite and soft-spoken throughout the meal, yet the sevice was pathetic, the space impossibly small, and the food average.  Will never return again.", "author": "Aaron P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-12", "description": "Having recently moved, our go-to Mexican place, Chavella's is just a teeny bit too far to be an acceptable oh-my-god-I-am-fucking-STARVING walking distance. We now live super close to Pequeña and I while I thought it looked colorful and cute, I was a bit dubious as to whether the food would be authentic and delicious. We put any doubts aside due to aforementioned intense level of hunger and gave it a whirl. I am very, very glad that we did.\n\nThe menu is pretty small and actually kind of weird due to the notable absence of some usual suspects such as tamales and fajitas. What they do offer for mains: tacos, enchiladas, quesadillas, tostadas and stuffed poblano peppers.\n\nAll items can either be ordered a la carte, or as a entree which comes with refried black beans and rice for 6 dollars more. Boyfriend ordered the enchiladas - one pork, one chicken and one cheese - with both the green and red sauces that were offered. Of the three, the pork and chicken were absolutely delish, while the cheese was a bit underwhelming.\n\nI ordered the grilled shrimp quesadilla which is odd because I usually steer clear of 'em; greasy cheese melted inside some flaccid flour tortillas just isn't my thing. But I was digging the shrimp idea, and the waitress assured me that it was scrumptious. It was indeed scrumptious. To be honest it was fucking amazing. First big win: there was very little cheese. Second big win: There was tons of big chunks of grilled shrimp, making the $9 not-huge quesadilla a pretty good deal. Third big win: The tortillas were crispy. I just realized that calling this item a \"quesadilla\" is truly inappropriate. It was so much better - so much more - than that! \n\nI can't wait to come back to Pequeña. I will probably order the shrimp quesadilla again because it was that good, but I bet everything else is great too. I am also dying to try the habanero grapefruit margarita - being a sucker for spicy, cocktails and spicy cocktails this concoction is DEFINITELY right up my alley.\n\nAlso worth mentioning - service was great and super friendly while not being in your face. Loved every second of it.", "author": "Mary C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-16", "description": "Not sure why all the bad reviews?! This is my favorite neighborhood Mexican place. I can't believe people think it's expensive. 8 dollars for a huge breakfast of baked eggs and potatoes and tortillas? You're not gonna do much better anywhere else in the neighborhood.\n\nAs a glutard I really appreciate that all the tortillas are corn, even the quesadillas. That's a rarity. The stuffed poblano peppers are delicious, as is everything on the brunch menu. An excellent place to bring a \"friend\" for brunch.\n\nMake sure you try a tequila shot too if you go for dinner, they bring the limes with ground espresso and brown sugar. You dip one side of the line in each. Yum.", "author": "Jude D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-08-22", "description": "We went here last night pretty much by accident because every place else in the area the kitchen was closed. \n\nThe kitchen was open late so that's a positive for Pequena. The ambiance makes you feel as though your in an authentic Mexican restaurant. It was a little cramped for my taste but I guess that's why they call it  Pequena.\n\nAnyway the waitress totally was taking the night, or she was preoccupied. It seemed as though she was doing the least amount of work possible from where I was sitting. She gave this couple at the next table a box to put their own food away. Then they had to ask for a bag to take it home. She never came over to our table to see if we were okay when we were eating. Or to refill our cups of water. The water tasted like pure unfiltered New York City tap water! As if she went to the bathroom and turned on the faucet to fill our cups. That were again never refilled. I asked for a ginger ail. She gave me a can, and a glass of ice and she never came back to my table to ask me if I wanted more. \n\nIt wasn't that busy because most of the people left at around 11:45 yet everyone had to ask her to come to their table so they could pay the check. I basically had to flag this waitress down for anything I wanted. Suffice it to say we thought the service was horrific! Then we were right next door to Moe's so you could hear the music blasting through the walls. \n\nI wouldn't recommend this place for a date. I would consider it a high price dive. If your looking for something better, cheaper, with better service try Enduro on Lincoln place.\n\nOh and don't forget to bring cash they don't accept credit cards.", "author": "Amiyr B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-04", "description": "I've been here three times now, twice for lunch and once for brunch. I've only lived nearby for a month, so that should tell you something.\n\nThe lunch specials are amazing. My favorite is the mushroom torta (delicious), which is HUGE (i always save half for dinner) and comes with rice and beans, plus chips and salsa. For $7? That's amazing. The chicken quesadilla is also good. I'm not sure if I would go for dinner (it's a little more expensive) unless I was REALLY craving Mexican, but it's definitely a great lunch/brunch spot.\n\nMinus one star for cash only.", "author": "Julia K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-02", "description": "It lives up to its name. I've been here four times and always order the same thing...black bean \u0026 plantain enchilada. Delicious. Weekends \u0026 evenings are crowded and I often just go around the corner to the bar to wait, which they encourage.  Now I just go for lunch during the week, last time there were only 6 people in there and the prices are lower.\n...wish I was hungry Id go now....", "author": "Kelei T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-11-20", "description": "Shocking mismatch between WONDERFUL tasting food and horrific service. I've had aloof and inattentive servers quite often, but our oblivious waitress set a new record at brunch today. She rolled her eyes when we asked for one of the many available open tables. Waters went refilled as she ate a taco from the window in the dining room overlooking our (empty) table. The food took hugely long, and she failed to visit in the interim. When it finally came, she had mixed up our order, didn't apologize, and left one stranded plate while the other two dishes took another 10 minutes.\n\nSeriously.\n\nThe food is wonderful, but it's difficult to experience with such shoddy service.", "author": "mary b."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-03-28", "description": "The only Cute thing about this place is the decor, maybe. The evening My husband and I went to this place was a Full Moon the other night. Giving it was late. The place was clearing out. It's super tiny as the Menu mentioned and I was charmed by it's characteristics. As we walked in the Hostess sat us down and she noticed that our table wasn't cleared or cleaned so she sat us down anyway, first and walked away....  \n\nThe waitress came, and she put the menu down with out cleaning the table... Then she says \"oh! I forgot to clean the table!\". she picked up the menu as she abruptly was cleaning the table with a dirty rag-dirty crumbs was getting all over my bag and on me, and not apologizing for it.. I got annoyed by this... I'm looking around me.. \nIts really a Small space.. I used to waitress ages ago and Run a 30 top space all by my self and handle it actually with out a problem. And this one waitress can't handle 3 tables and not be able to run a small space and be polite about it?,  what is her deal!?!.... She comes back and takes our order, Mind you I'm a Pescetarian (Which means just a fish eater). I ordered the Three fish taco meal with rice and beans and so did my husband. We waited 20 minutes or so. I went to the restroom. I came back. The plates were out. No utensils (what a shocker) What do I get!?, The Three Beef platter I never ordered and pretty sure no one did either because there was no one there after we got there.  My Husband gets the Three fish taco! At this point it's 10: ish pm Hardly anybody in there, The noise level-quiet!. I keep noticing the waitress being very attentive to some guy to the right of us, smooching him and making sure he's all taking care of? What the hell!?!!! I'm like super annoyed BY HER! and I'm super hungry, My husband See's this.\nWe grab her attention and tell her that I never ordered this platter and that we would like to get the correct order, the Waitress looks at me in confusion like I actually did order the three beef taco meal?!.  I want to take the beef taco and jam it in her face at this point. She's been so far, inattentive, her service sucked and now she's giving me attitude?. \nFor our first time at this place, As foodies. We will never go back here again! For the space and it's decor, it's charming. The food it self, As a Bi-coastal Artist I have had my amazing share of Mexican food From L.A to New York.\nI ate some of the food from my Husband's plate. I ate it so fast because I was so hungry I didn't really had the pleasure to sit and enjoy the dining pleasure experience because I was so irritated by the Service factor. And as far as my \"Order\" I took it to go and fed it to my Dog when I got home.\n\nAt the very end the Waitress passive aggressively told me she \"discounted\" my order and charged it as an appetizer. What for!? for your lame screw up for the 4 people who were left at the restaurant just finishing up their dinner!? GET OUTTA HEEEYAHH!!!  LOL!!!!!!!\n\nWONT RECOMMEND!\n\nSincerely A Foodie New Yorkah", "author": "Jess D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-31", "description": "I love pequena, and I'm surprised there are so many negative reviews here. I've only tried veggie and fish options. My favorites are the shrimp quesadillas, the quesadilla with beans/ cheese/ plantains, and for brunch the pan with beans/ eggs/ plantains. The coffee is delicious.  \n\nThe decor is cute and intimate. This is an alright place for a date if you don't mind the folks at the table hearing everything you are conversing about. I've literally had someone butt into my conversation from the adjacent table. Slightly weird, but we chatted and it turned out we had a friend in common.\n\nI've only had good experiences with the waitstaff, and the food usually comes out pretty quickly.", "author": "M. M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-09-06", "description": "At the risk of differing with the consensus here, I dined at Pequena this evening and had a mediocre experience.  \n\nTo be sure, the decor is charming and the waitresses are agreeable.  However, the food took forever to come even though very few patrons were in the restaurant.  Maybe, if they had comped me a small basket of chips while I was waiting, this would have put me in a better mood.  But guess what: you gotta pay $4 bucks for chips and they do not give you tortillas.  \n\nMy rice was incredibly unseasoned, and  the tomato sauce with the chile relleno tasted to me as if it might have been out of a store jar.  It's all a little mysterious, since the cooks looked like they were Mexican and obviously must know this food is substandard.  My guess is that the public in this neighborhood doesn't know anything about Mexican and the cooks pick up on this.  They probably figure, \"well, all these folk are interested in is getting blasted on margaritas and getting some 'guac,' so that's how we'll pay the rent, plus charge $6 for one Negra Modelo beer.\"\n\nIn other areas of the city, this kind of restaurant might not float because overall our Mexican cuisine is getting better.  But in Fort Greene, the standards are lower --- perhaps a little higher than your average Tex Mex in Park Slope but not by much.", "author": "Nikolas K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-02", "description": "When my wife and I are in mood for Mexican food this is the place to go to. Best black bean soup in town! Decor makes you feel like Halloween all year long,thumbs up!", "author": "Alex B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-14", "description": "Great chicken tortilla soup and very tasty Mexican food at reasonable prices in a tightly packed and slightly grubby interior with plenty of character. Can get pretty busy but they have a waiting list and text service which works well.", "author": "Mike E."}], "servesCuisine": "Mexican", "priceRange": "$11-30", "name": "Pequena", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "86 S Portland Ave", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/KWpvOOon8kcWehPXnMptDw/ls.jpg", "@type": "Restaurant", "telephone": "+17186430000"}