{"aggregateRating": {"reviewCount": 317, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-09-10", "description": "I liked the fish tacos, but not as much as I LOVED the Blood Orange margaritas.....yum!  Conveniently located by the C and G trains, right next door to Moe's", "author": "Kristin T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-14", "description": "This is the cutest little place for pretty good Mexican food, even though my first time here, it took about half an hour just to get a table for 3 during brunch. You'll have a lot more luck with just 2.  The service is very friendly and the decor is funky and adorable. I ordered the \"desayuno mexicano,\" which included a Mexican-style scrambled-egg omelette and really yummy beans and tortillas. The guacamole is also quite delicious here.  The best thing is living right around the corner from this place -- I love Fort Greene!", "author": "Mabel L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-11-15", "description": "It's so cute but the food was really greasy and the portions not too generous.", "author": "Patty F."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2009-12-20", "description": "The food is lousy and the service is terrible. its slow, cramped, disorganized and it seems every member of the wait staff was chosen for their snotty attitude.. \n\nAdd to this the way they leave trash all over the sidewalk and the new ugly glass expansion, it's really a blight on the neighborhood.\n\nWe stopped going a few years ago for all the above reasons. This past week we stopped in again, hoping they got their act together, but it was worse than we remembered it. stay away.\n\n- Hey Pequena - please pick up your trash, its really disgusting. - your neighbors.", "author": "brooklyn b."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2010-05-30", "description": "With so many places in brooklyn, why go to Pequena? The dinner and lunch is blah.  The breakfast and drinks  are good. But the staff is extremely RUDE. On two occasions, my friend and I brought larger groups of people with us, and the manager seemed to either have a problem with the length of time we spent in the restaurant or with us. Funny thing is that we were all eating and drinking. We were not just sitting there taking up space and not buying anything. When we asked the manager to move us to a larger area in the restaurant that had just cleared, so we could accomodate two other people joining us, she flat out refused. Ok fine, she said she needed advance notice. Can't fault her for that. But how rude and unprofessional is it to talk about  and make gestures about your customers who are bringing money into your business, to your waitress?? At the end of the dinner, I attempted to pay my half of the bill with my debit card, and I was told they did not accept debit or credit cards. Am I in a restaurant or a corner store bodega? I had exactly enough cash on me to cover my food bill, but not enough for a  cash tip. Anyhow, the waitress told me that I could go to an ATM and take out money to tip. At this point, after all the attitude from the staff, I was not willing to go down the street, and pay an ATM fee to provide a tip. What I was willing to do though, is ask my friend to spot me the cash tip, which was about 8dollars for my portion.However, before I could do that, the waitress felt the need (after walking away from me the first time while I was talking to her) to come back to my table and say these exact words to me, \"Next time if you don't intend to tip, don't expect to get seated.\" I told her she needed a course in customer service and that she was rude. I also had a conversation with the manager, (who claimed to also be the owner which I found shocking), where I told her that I understood about not being to accomodate or save tables for larger parties at the last minute. But that her waitress had no right to speak to me like that when A) the only reason why an issue came up about the tip was because I was unaware they were a cash only restaurant and B) just because I was not interested in going to an ATM didn't mean I couldn't have borrowed the cash from one of my friends there. The manager at this point had calmed down and said she would speak to the waitress. But speaking to the waitress (about us) in the first place is what made the waitress feel entitled to blatantly direspect paying customers. All in all, a traumatic, inconvenient  experience that wasn't worth the hassle, disrespect and stress. I should have gone to Burrito Bar or Sante Fe grill instead. Never had a problem with Burrito bar or Sante Fe in all the time I've been going there. Piquant is even better for brunch and offers unlimited mimosas and sangrias with their brunch.  This rat hole was my friend's bad suggestion.\n\n11/22/2010: \nPequena's has a sister restaurant on Vanderbuilt. The customer service there is 100% times better than the original location. The food is good (but menu is kinda limited) and their blood orange margaritas and coconut margaritas are delicious.", "author": "Ranah W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2008-01-14", "description": "Boys, here's some advice: if you're having a tough time choosing a first-date restaurant, choose Pequena.  It's funky, charming, unique - and the margaritas are fantastic.  \nNow, don't let your date enter upon the misconception that she'll be enjoying true-blue authentic Mexican food (in fact, if the date's going well, hint that if she wants truly good Mexican that you'll take her to Castro's the next time).  You see, this is Brooklyn's interpretation of Mexican food, and it's a good interpretation.  \nSince you can't make a reservation, be prepared: give the hostess your mobile in advance, tell her to call you when your table's ready (or else you'll have to wait outside); then take the lady over to Moe's for a drink.  \nSkip the sweet plantains and go for the black beans (ask for extra cheese), order the pork tacos and be brave: enjoy a tamarind margarita because they really are good.  \nDuring the summer, you can enjoy a sidewalk seat - but know that your dog will have to sit on the other side of the stanchion (damned health codes!).", "author": "Cannon H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-07-06", "description": "This place is of course tiny ( given the name) but it's some of my favorite Mexican in Brooklyn! Never lets me down, and consistently good service (really a plus for me). In the winter I've been able to get in with a group of six- in the summer that's a little harder to do, but it's a great date spot on a cute street with great food- you can't beat it!", "author": "Emily B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-06-14", "description": "One of the best mexican food restaurants in New York. Small and intimate. Tip: cash only, no credit cards. Bring extra for a pitcher of Sangria.", "author": "Universal R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-09-27", "description": "I'm not a food critic neither I'm a restaurant one. All I can say is that this place was very cute, had awesome service and the food was delicious! Definitely going back!\n\nYUMMMM!", "author": "anna z."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-04-27", "description": "Everything on the menu can come in an appetizer or main course portion, and the difference in portion size is usually explained well on the menu.  The portions are so big here that an appetizer AND a main dish are probably entirely too much food.  (Although the black beans you get with a main dish are to die for.)\n\nThe food is all delicious, but you have to drop your Mexican expectations at the door.  Nothing is even remotely spicy unless you use the Tabasco at your table.  Personally I would have preferred more jalapeno in everything but, like I said, everything was still utterly delicious.  It's hard to explain, but everything here tastes like it was prepared with loving attention to detail.\n\nIt's tiny and they don't take reservations so get here early and expect to be cramped at your table.  Despite the size the service is very friendly and quick.", "author": "Mark R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-06-06", "description": "i've past pequena a bounty of times on my way from the G.  a friend visiting from sf wanted to hit this place up because it was recommended as having the BEST fish tacos in ny.  it's a tall order since we both wen tot uni in san diego.  the best fish taco is a hard bill to fill.  i was told sunset park is where it's at.\n\nanyhoot, we went down and there was a 20-30 minute.  the cool thing is that you leave your number and they will call when your table is ready.  so hop over to moe's for a happy hour.  no biggie.  \n\nwe are seated and the wall is dripping on my roommate.  WTF!  the manager comes by and says sorry this place is small, we can reseat you once another table is available.  heck we are hungry, so we let it pass but would have been nice to get comped chips and guac.  \n\nso onto the headliner...the fish tacos.  we got the fired fish because that's how it should be done.  the fish was fine and the guac was excellent, but the tortillas were not.   so not the best EVAH.  plus my roomie was at sunset park last weekend and she agreed that's the place to be for fish tacos.", "author": "Sharlene C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-04-02", "description": "I am just updating my review, having been here for brunch.  I'd been for lunch and dinner, but never brunch and WOW.  I had a cast-iron skillet with eggs, beans, plantains, and chorizo that was absolutely out of this world.  My dining companion enjoyed his huevos rancheros just as much.  One of my fave brunches in Brooklyn for the price.", "author": "E L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-28", "description": "Came around 12 on a Sunday for brunch with mah lady, and the food and ambiance were stellar. We both had the tortilla strips with chicken and green sauce, which were fresh and delicious, although a little more chicken would have been nice. We also had some amazing margaritas and tequila \u0026 OJ. The icing is that its cheap and about 5 feet from the G train. Can't wait to try their dinner offerings.", "author": "Dave P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-12-31", "description": "Decent food, ok prices, nice staff, cute hole in the wall.  nothing special, but nothing offensive.  If you are careful where you eat, this is 3 stars.  If you consider Chipotle a 4 star \"restaurant,\" then this is 5.", "author": "James R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-02-16", "description": "this is my favorite spot for mexican food - ANYWHERE. and i'm a californian.\n\ndrinks are delicious and strong.\n\nchips/guac/pico are fucking to DIE FOR.\neverything else is equally delicious.\nit's tiny, so don't bring a large group. and arrive probably 20 min before you want to eat. YUMMMMMMMMMMM.", "author": "Chelsea N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-12", "description": "You gotta go a few times to figure out when it's best but Pequena's food is undeniably tasty.  Good spice, cool little space, it's a great local hang.  I prefer to take it out, though, as the space is a little tight.", "author": "Sebastian M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-06-07", "description": "The food here is great, the service is ok, and the atmosphere is cozy, but so squished that I have a hard time saying it's a welcoming atmosphere. I think it tends to be a bit on the expensive side for what it is, but the food itself is amazing, so I guess it's worth it. Frozen margarita machine was broken the last time I went so that sucked, but I'll keep going back.", "author": "Lame C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2008-12-03", "description": "Pequena is a restaurant that's good for the lunch special. The chips with pico or guac are tasty. Again, my favorite thing about the joint is the 12pm-5pm lunch special. I ate there today and had the fish tacos. They were ok, nothing like that little Mex place on Myrtle btwn Carlton \u0026 Adelphi.", "author": "Richard B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2007-02-17", "description": "Maybe I don't know where the great Mexican restaurants are in New York (I used to hit Tacos Mexico when I lived in Queens--free calendars!), but I think this place is decent.  The plantain app is tasty.  I usally get the tacos, which are pretty basic, but good.  I like the beans here too, despite what another reviewer thought.  I don't understand why people get so orgasmic over Bonita versus this place.  The size and crowdedness can be annoying, though.", "author": "J. Andrew V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2007-08-05", "description": "Our favorite place for a margarita, guacamole, and pork enchiladas. It's small, but they'll call when a table's ready. Service is typically attentive and friendly (some exceptions), and they do what they can to accommodate. \n\nCan't mark down in NYC for not accepting credit cards, my favorite places don't. Can't mark down for being small, it's called Pequena for pete's sake. They serve ample and excellent guacamole, not one of those skimpy, overpriced places.\n\nAccording to the shamefully low ratings from previous reviews, avoid the chicken, go for fish tacos or pulled pork enchiladas verdes. Get a pitcher of margaritas and enjoy yourself outside.", "author": "aaron c."}], "servesCuisine": "Mexican", "priceRange": "$11-30", "name": "Pequena", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "86 S Portland Ave", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/KWpvOOon8kcWehPXnMptDw/ls.jpg", "@type": "Restaurant", "telephone": "+17186430000"}