{"aggregateRating": {"reviewCount": 317, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-01", "description": "Delicious little hole in the wall restaurant! My friend and I shared the nachos which were fantastic and I had the vegetarian enchiladas. I would definitely come back!", "author": "Kayla F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-26", "description": "Lovely place, amazing food, great vibes, cool hosts in one of my favourite areas of Brooklyn!", "author": "Emma M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-04", "description": "I love Paquena and it is one of our fav local spots (which says a lot because there is a lot of competition for Mexican in Fort Greene). Service is always quick and friendly, food consistently yummy, amazing atmosphere. I've never waited for a table. Not Michelin star obviously but in terms of casual consistent fun date spot this is a 10/10", "author": "Averill H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-02-23", "description": "Chilequiles, margaritas, and authentic Mexican decor makes Pequeña a Fort Green a staple for your next south of the border fix. \n\nAs a kid from Southern California, Mexican food is something I take very seriously. I generally have low expectations unless I'm in California, New Mexico, or Texas, so when a Mexican joint can unearth even the tiniest bit of nostalgia from my youth, it's a great thing. Pequeña did just that.\n\nFrom the vibrant colors of the interior, the drink selection smattered with tequila based libations, and brunch staples like desayunos Mexicano and chilequiles, it's A-OK. \n\nI was only there for brunch, but I'm already thinking about a return trip for lunch or dinner. Bonus points for using Eat24 as their delivery platform (I'm biased).", "author": "Ruggy J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-23", "description": "I love this place. The food is awesome the staff is fun! 5 dollar margaritas for happy hour ,not bad .. keep up the great work guys!", "author": "Philip R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-12-01", "description": "Pequena was an awesome experience! I visited on 12/1/18 at noon, with a friend for brunch. There is a small, heated enclosed outdoor area and also indoor seating where we went.  It was cozy, clean with colorful, interesting, authentic Mexican decorations  throughout. Although \"pequena\" the space is well used and we were not cramped. We were seated quickly. The food came quickly, had large portions and was very tasty.  The powdered french toast with fruit was delicious \u0026 nicely plated.  My chorizo omelet was fluffy, savory...the perfect balance of salt \u0026 seasoning. My potatoes were crisp with nicely sauteed mushrooms, onions \u0026 peppers. Even the buttered toast was good! Everything was fresh. Our waitress Courtney was friendly \u0026 attentive. The food was moderately priced and payment is Cash only. We will definitely be back again. My only suggestion would be for bottomless brunch / brunch drink specials to be added to the menu...which would be perfect. However, we both loved it! Thumbs up!", "author": "Jen P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-15", "description": "Aw this place is super adorable! I found it when searching Yelp in the area for Mexican food, and since they had great reviews I decided to stop in. It's really tiny but since we were there for lunch it wasn't crowded at all. Upon walking in I saw a sign that said \"CASH ONLY\" so I quickly checked my wallet, and I was in luck. My mom and I sat down right away. \n\nWe both ordered sodas and my mom got a rum drink. It was super sweet! Our sodas came in bottles and were served with glasses filled with ice. After we placed out order our waitress brought us tortilla chips. Guac was only $1 extra. It was so good! My chicken burrito was rocking as well. The portions were massive. \n\nMy waitress left the restaurant before we were done, which I found strange, but another waitress gave us the check. I'll totally stop in again!", "author": "Diana M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-10-11", "description": "Wow. Placed an order 45 minutes ago using Yelp 24 eats (the site the restaurant directs you to). Just got a call saying they \"aren't delivering.\" Would have been nice to know shortly after placing the order. \n\nAs many in the neighborhood know, many places don't deliver after 9:30p so now I'm kind of screwed.  \n\nShout out to Yelp for having customer service. 24eats offered $5 off the next order, what a joke! I'm not even sure what you can buy for $5 these days. Ended up with a $15 credit \u0026 no plans to use the website/app.", "author": "Rachel P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-07-29", "description": "This place is extra overpriced for no apparent reason. Quality of food is just fine. Waitress staff was gossiping with friends at the table next to us... This just leaves bad taste in my mouth....\n\nWe didn't have to wait to be seated.", "author": "Natalia P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-19", "description": "Food was great but the waitress had an attitude and gave us a margarita that had no tequila only mix.", "author": "Brian M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-03", "description": "Three words: New. Favorite. Spot. I've been avidly searching for good Mexican food out here in NYC for months, and I think I've finally found it. The chips were perfectly thick and salted, the guac was flavorful, and I actually did a little dance in my seat after the first bite of my burrito. Also, woman-owned with a rainbow flag and Black Lives Matter sign in the window! I will be back again and again and again.", "author": "Christine P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-06-05", "description": "The hostess tonight: rudely, unsmilingly, like a military officer, says holds up three fingers as we are walking in.  \"Three?\"  Hello, we say, with our little boy bouncing in after us.  No hello.  \"Right here.\" she says angrily, pointing her thumb at a table, practically glaring at us at this point.  We turned right around and walked out. Why would we eat here, for any level of burritos y guacamole, when staff acts like we are some kind of irritant to them?  You are serving in a restaurant. There are dozens of beautiful restaurants on this street, step up your game.", "author": "X O."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-05-20", "description": "Average food. Pico and plantains were good. Skip beans and rice. Took 12 minutes before anyone greeted me at my table and I had to get up and insist they do so. Wouldn't return given the other options in the area.", "author": "Kara D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-03-01", "description": "Came here for dinner on a random Tuesday night for dinner and drinks with a friend. For drinks we had margaritas and rum limeades. The margarita was too sour, syrupy and sweet. Not pleasant at all. The rum lime-add was just okay. Both drinks were just right/kind of on the stronger side in terms of alcohol content. I had quesadillas, which look kind of weird (super greasy/crunchy as if they fried the tortilla first) but tasted fine, but maybe that's because I was a bit intoxicated? Lol It's a bit pricey for the quality of the food imo. The service was relatively okay, not slow but not fast/super attentive. The place is kind of tiny but definitely cute. I would come back only if I was in the area with nothing better to do.", "author": "Len N."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-10-22", "description": "This great find is situated cozily in Ft Greene close to the C train, also very walkable from Atlantic Terminal. A hole in the wall in its truest form, so small that you will be rubbing elbows with your table-neighbors. \n\nMiss Sarit and I sat outside. I allowed her the more comfortable bench seat in a marvelous show of true chivalry and gentlemanliness. We were seated immediately and brought waters and menus. The server came immediately asking if we were ready or wanted drinks, we ordered our food and passed on the drinks (who ever said I was an alcoholic should see me now!) \n\nI ordered the mushroom veggie enchiladas with salsa verde and she ordered the veggie quesadillas with beans and rice. The food took so long to come out that we had an entire discussion about whether we should ask the servers what was up. Twice. I mean, they were not packed so what gives?\n\nAnyhue against all odds the food did indeed arrive. I proceeded to inhale my enchiladas like it was my job, then moved on to \"help\" Miss Sarit with hers. I was pleasantly surprised at how good everything was! The salsa verde was unfortunately not spicy, but that's why we have hot sauce amirite?\n\nI wish I could have given four stars, but -1 for the waitresses sitting down by the counter chatting instead of checking on customers, -1 for having outside tables so close to the roll up door that we were warned (a few minutes AFTER sitting) that customers sometimes get the grease on them so to steer clear. Literally so crammed that you're almost forced to rub against the roll up door track, at least where Miss Sarit was sitting... Gallantry paid off, eh!?\n\nFuhgettaboutit!", "author": "Michael W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-12-15", "description": "Well, I have to leave my review here rather than seamless because it seems as though there is a block from leaving this review there because my order was cancelled. I placed an order on an understandably cold and snowy night and received a confirmation that my food would arrive about an hour later. (Totally understandable due to said winter weather, in fact was prepared with extra cash tip for the hard working person that showed up at my door) Cut to an hour later when I received an alert from seamless that my order was cancelled because Pequena didn't deliver to my location. Now this is were the restaurant themselves go down hill. I've had problems with seamless before but they are quick to rectify their wrongs. So, I called Pequena..... I was quickly transferred to a person who I'm guessing is in a place of authority over the nice lady who answered the phone. I politely explained what happened again and the \"authority\" was quick to blame seamless. My one star now reflects exactly why I feel that their customer service is lacking. I asked \"why then if seamless was to blame did u not call me right away to tell me that this order would not be able to be fulfilled? You have my number.\" It took an hour to get any notice that I would not be getting my food. \nSaid, \"authority\" was nasty with me and told me all about his rough night arguing with seamless. I stated that instead of arguing with seamless u should be calling hungry and clueless customers that are happily waiting for their warm yummy (I'm guessing here bc I've never had it and doubt I ever will) food. Anyway, this review is not food based it's lack of professionalism and customer service based. I hope in the future they inform customers first and blame seamless after rather than the other way around.", "author": "Jamie D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-19", "description": "I love this spot! I come here pretty often and it's always top notch. Great margaritas, solid fresh food, and great service. I honestly don't understand the negative reviews here.\n\nThe sampler appetizer with chips (the best chips--thick, tossed with sea salt \u0026 spices, mmm) and the plantain and black bean quesadilla are my favorites. \n\nNever disappoints!", "author": "Ayala S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-05", "description": "So pink teacup was closed...looked on google maps n found this little gem!! Inside is really pequena (small) but the food is so good!! I recommend the chicken tostadas with the rice and beans extea sour cream!!", "author": "Donna P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-16", "description": "L. O. V. E. this Brooklyn gem. The vibe is so chill and the food is beyond good. Nachos are probably my favorite. But that shrimp quesadilla tho! IT-shirt locally owned and I fee good every time I leave there.", "author": "Dui J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-07", "description": "This is one of my favorite places to eat in Brooklyn, especially on a weekday during lunch. Try the black bean and plantain quesadillas--they are to die for. The atmosphere is warm, colorful, and it smells like warm tortilla chip heaven.", "author": "Ellen W."}], "servesCuisine": "Mexican", "priceRange": "$11-30", "name": "Pequena", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "86 S Portland Ave", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/KWpvOOon8kcWehPXnMptDw/ls.jpg", "@type": "Restaurant", "telephone": "+17186430000"}