{"aggregateRating": {"reviewCount": 317, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-10-23", "description": "Atmosphere: small interior with a glass-enclosed outdoor area. Seating is comfortable, but just barely. Because of the limited seating, they only sit complete parties. \n\nStaff: standard Brooklyn hipster vibe, somewhat inattentive (I had to ask for water several times), but definitely friendly. \n\nFood: great for vegetarians (sorry vegans) and gluten-free eaters. The nachos would satisfy any glutton- crisp but still slopped with a motley assortment of toppings. The mushroom soft tacos were nothing to write home about, but still good. Loved the enchiladas- saucy and stuffed with veggies. However, I would have liked more filling and less cheese. \n\nDrinks: The prices are great, and if you come during happy hour (until 7p), margaritas are $5. Don't come for the wine, very limited selection.  I don't drink, so this didn't sway me and might have lifted the rating for some.", "author": "Melissa D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-27", "description": "Live in the neighborhood, and this is one of our go-to options, both for eating in \u0026 getting delivery. The food is delicious - and portions gigantic - every. single. time. \n\nWhen dining in, it's definitely cramped, and no frills. But the servers are attentive \u0026 friendly, and the food comes out relatively quickly. It's just a small place - with a tiny kitchen - so if you want a place with white tablecloths, where you can sprawl out and have a private conversation, this isn't it. \n\nAlso - they'll take your name/number, and call you when your table is ready. So go grab a drink around the corner while you wait!", "author": "T.R. S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-06-21", "description": "Caveat- I did enjoy the food at this hole in the wall. The portions are filling (I took half the plate home). The service was minimalist, but definitely not bad. \n\nBut as a former Californian resident I just don't understand why Chips and Gauc is $10, and a burrito is $12. \n\nit is a burrito in enchilada style (sauce/ queso on top) so you need to eat it with cutlery. That's just weird. \n\nReally wish the complementary water was chilled or iced. It was neither on this 80F muggy afternoon.", "author": "Joyce L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-04-26", "description": "I really wanted to like this place, I really did. Found this place via Yelp, of course. So my friend and I decided to give it a try since we were in the mood for Mexican food. \n\nLet's begin by saying this place is extremely small. Super small that you can hear others conversation. But hey, that's NYC. The inside was extremely festival with bright colors. \n\nMy friend ordered tacos and I had tostadas. We also shared a carafe of red sangria. The food was delicious. Coming from California and having been to Mexico I think it's safe for me to say I appreciate some good old Mexican food. I agree with other yelpers that the prices for the food/drinks were a bit off. \n\nThe reason for a low rating is because the service was nonexistent. It took forever for us to get our drinks. The worst part was when the server forgot our order of chips/salsa/guac. Our drinks came followed by our entrees. Although we were both starving we didn't bother asking for our appetizer. What's the point? Our entrees came out already.", "author": "Fan V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-30", "description": "Wow. Spectacular food. It's Tex Mex, not Mexican, so lots of sour cream and melty cheese - but the ingredients are so high quality that the food still feels lively despite that weight.", "author": "David M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-03-13", "description": "I can't tell you enough how many times I have given this place a decent chance and it is due to the service that it has failed me time and time again. The food is pretty good, but the attitude of the staff is outrageous!!\nIt seems as if they are Pratt students trying to earn extra cash under the table (it's cash only), and I too survived in the city waiting tables while I went to college. And as hard as that was, I was never so rude, short and dismissive as the asshole kids who work at paquena. \nAlso, I swore I would never yelp, but after 2.5 years of just trying to get a table without attitude or my food delivered within 1 hour, I feel compelled that your owner, boss, or manager should know that you are consistently dicky to everyone that comes in. \n\nI really believe that you should feel ashamed of yourselves for making the world a worse place. I know if I were your grandparents, friend, or even teacher, I would be deeply ashamed of you. It's just a job. But it's a service job. Try not to be a dick. It's not that hard.", "author": "Stephanie T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-17", "description": "Great food and location.  I go for happy hour and Im never disappointed. Try the burrito with steak and onion.  Amazing!", "author": "Emily J."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-02-10", "description": "Food not bad for the most part! Friendly service as well! Good place for the neighborhood! Downside: small restaurant. You feel like you are being force to eat with family you don't like. Cash Only. There's been so many times to where friends and I are wanting to eat eat but they don't take cards at all. Totally discouraging. A lot of people now a day don't carry cash. And if we decide to go there're to eat, we all have to either go to our respectful banks or be forced to pay a fee at a foreign ATM. By the time we alll get back together, it would be easier to get in a train and hit the city for the same food.", "author": "Tony W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-05-11", "description": "I really love the food here and the decor is fun while the restaurant is intimate. I'm knocking off a couple stars due to the inconsistent service and cash only option. The food is comparably priced and everything I've tried has been yummy. The margs were delicious as well. The service has been hit or miss. I've gotten really awesome service and super friendly staff and servers that just weren't friendly or never checked in but were sufficient enough. I will keep coming here  but I just hope service becomes more consistent.", "author": "Leilani L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-11", "description": "I like it here. It's my best friend's favorite restaurant in Brooklyn, so I go more often than I would on my own, but I have no complaints about it. I always get the the chicken enchiladas, which are very satisfying-- you can get them en roja or en verde, I always get one of each as the dish comes with two enchiladas. I prefer the green (verde), but I like the red (roja) enough to still split it. \n\nThe chips and salsa are addictive and you'll have trouble stopping, so if you're starving get them, but you don't want to get too full before you eat your meal, which is the real treat! \n\nThe food is authentic and flavorful, and consistent. The staff is a little disorganized and they get orders confused and mixed up, or sometimes they forget things, but theyre so sweet and friendly you can look past it. \n\nIt's cash only and there's no ATM in the immediate area, so be sure to have cash on you when you go. \n\nThe atmosphere is pretty laid back and the decor is pretty funky and Day of the Dead inspired. The place itself is pretty small so if you go with more than three or four people it might get tricky.", "author": "Lani W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-20", "description": "May be one of my favorite places for a Mexican breakfast in the area! I usually opt for a Pan A or a Pan B but all of the dishes I've tried have been exceptional. The fun and lively decor, the intimate dining space, and the low prices only add to what is usually an exceptional experience!", "author": "Rachel K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-08-31", "description": "Pequena has pretty good food, mildly overpriced drinks, and friendly service even if it takes forever and a day for your food to arrive. We don't tend to go often since every time we do we realize we've forgotten just how long it is between ordering and receiving your food.\n\nCall ahead.", "author": "Brian V."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-06-28", "description": "I want to like this place, but every time I come here, I leave disappointed. The food is okay, medium at best, I just don't think the prices reflect the quality. \n\n$12 for 2 small steak tacos? I'm sorry but they're just not that good to be at that price point.  \n\nI hate writing bad reviews, but I also hate eating somewhere spending $40 on a meal\nThat should've been $28.", "author": "fina a."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-06-02", "description": "I would've given this place 4 stars, but service was a bit off, but let me explain, \n\nWe arrived at 8:15pm and the place was packed. I can't tell you how much I really loved being back in my old hood. So nostalgic and makes me see how this is really home for me, maybe in a few years. \n\nThey were packed but they were able to seat us quickly within 5 minutes. That was uber cool. Many tables had left when we arrived, so perfect. We ordered up a frozen margarita for me and limeade for my friend. We also had the guac and chips for starters. \n\nThe guac and chips came quickly, but then after that, things went downhill. \n\nWe waited until 9pm and still had no food served us. I had to flag down the waitress and then she checked on the food. She then came back and told us the food would be out immediately. And indeed, it came out immediately but it took 45 minutes and also a nudging. I wonder if they forgot about our orders. The table next to us sat down before us and got their food first. That is a major fail. \n\nBut, I would have to say that the avocado black bean salad was very good. No complaints. Fresh ingredients with a good lime cilantro dressing. My friend had the fish tacos and they were also good. \n\nOur bill came to $36, so pretty good for an evening dinner. But, I think they need to work on their service. And besides, we had to get t another party! Busy New Yorkers need good, tasty food along with reliable service!", "author": "Vivian H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-15", "description": "When you go out to a Mexican restaurant, do you like asking for water? Asking for refills of said water? Asking for your chips and salsa? Asking for the food you ordered? Asking for your bill? If you enjoy asking questions when you go out to eat, Pequena is the place for you. The servers really like it when you ask for everything. In fact, if you don't ask for it (about 3 times), they might not bring it to you.\n\nI don't really like asking questions when I go out to eat, but my food was so phenomenal that it made it worth it. All of our food was so perfectly fresh and delicious.  My shredded chicken tacos were tender and flavorful, wrapped with corn tortillas, served with some crispy slaw on top and guacamole that was magical. Also served with rice and beans, it was a huge portion for only $11. My friend got sweet plantain quesadillas which were unbelievable-- love that combo of sweet and salty. Again, came with rice and beans for only $13. Neither of us could finish our food because we were stuffed. Skip the frozen margarita-- I can hold my liquor, but I found it to be unpleasantly strong and overpriced. \n\nAll in all, I spent less than $20 here and had a huge, delicious, fresh Mexican meal, with money left over to buy hipster treasure like deer skulls and broken cameras at Brooklyn Flea. The service was pisspoor, but the food was damn near perfect. I'll be back!", "author": "Sarah R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-02", "description": "The service was okay, but the food was outstanding! I had the stewed pork tacos and a skirt steak quesadilla. The wife had the pork burrito. All were awesome and portions are generous. The pork cones in giant chunks.. no small sheds here. The guacamole is also bangin'...a little spicy without a bunch of veggies taking up space. We will definitely be returning.", "author": "Topher B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-10-25", "description": "I only had a margarita here and based on the mediocrity of it, I didn't want to eat. The margarita was ready-mixed artificially flavored mess. I wanted to try their verde enchiladas but couldn't make it past the drink. Please stop serving these bad margaritas in a \"Mexican\" restaurant", "author": "Cynthia H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-24", "description": "Love the food here. The breakfast pans are my favorite but can oftentimes be a bit oily. The only thing lacking here is the service. The wait staff are a bit rude and abrupt. They also seem understaffed most of the time. I appreciate that they don't overwhelm you with questions about your experience, but the quality of the service could be improved.", "author": "Stacey M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-22", "description": "I go there often for lunch. Great Margaritas (happy hour!) and I love the pulled pork tacos. \nGood honest food with a great service.", "author": "John M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-07-24", "description": "Good food but absolutely horrible service. Server did not check on me once during the meal and the place wasn't even crowded. Music was also too loud for the middle of the day (Sunday).", "author": "Elsie R."}], "servesCuisine": "Mexican", "priceRange": "$11-30", "name": "Pequena", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "86 S Portland Ave", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/KWpvOOon8kcWehPXnMptDw/ls.jpg", "@type": "Restaurant", "telephone": "+17186430000"}