{"aggregateRating": {"reviewCount": 317, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-27", "description": "Delicious, consistent Mexican food. It's a chill, solid place.  My favorite are their guac, tostadas, and Poblano Relleno; my friend always gets the quesadillas and it looks damn good.  I've been coming here for many years.  \n\nI miss the prospect heights location so so so much. :(", "author": "NY E."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-02-28", "description": "Moved to the neighborhood recently and was very excited to have a Mexican spot close by. I just moved here from San Francisco so I desperately am seeking a great burrito. \n\nYou can order takeout or sit down in a very casual setting. Great Mexican music playing and very chill atmosphere. Remember to bring cash tho, they don't take CC. \n\nOk, back to the goods. A few things I'm looking for in a great neighborhood Mexican joint:\n\nSteak burrito\nClassic margarita \nChips and Guac\n\nSteak burrito- best part about this was the steak. It's flavorful, juicy, and grilled. Everything else is mediocre and the worst part is they served it on a plate :( I want my burrito in tin foil so I can pick it up to consume.  \n\nMargarita- Mr Mango sells limes for 20 cents a piece down the street so why do you use limeade? Could easily improve. Get a beer instead. \n\nChips and guac are fine but not memorable. \n\nWill I be back? Probably. However this could have been a weekly spot for me and it's far from gaining a slot in that rotation.", "author": "Nick S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-05-27", "description": "The food is pretty good, but the service was just not. We showed up and asked to be seated, and were asked to wait while the hostess scurried around and tended to already seated tables. After being seated, we were brought water but no menus. The waitress checked on the table next to us three separate times without acknowledging we were there. After we got our menus, we were ready to order for a good five minutes while waitstaff were tending to that same table, cleaning off tables that weren't being used next to us, etc. I just got a bad vibe from it - it was busy but but full, so why aren't you just taking our order? \n\nIt wasn't anything egregious but just subpar enough for me not to return. Cash only, you have to pay for chips, and good but not great standard Mexican fare that's hard to mess up. Not enough to overcome the service.", "author": "Maureen L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-05", "description": "This is one of my favorite spots in NYC. I don't live nearby, but my friend used to work a block away and we both became regulars. The funny thing is that nothing here is particularly spectacular, yet there's something about it that keeps bringing me back.\n\nThe food is pretty good, but you can certainly find better Mexican elsewhere. They're cash-only which is always a pain. The service is hit or miss. And seating is very tight. But oddly enough, all of that adds to its charm. Plus, the space is quirky and full of character, the margaritas are yummy as is the guac, and food always comes out super quick.\n\nI think what I love the most is that it doesn't take itself too seriously. It's easy, laid back, and fills you up without breaking your wallet.", "author": "Jeannette N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-05-17", "description": "My favorite go to neighborhood spot! Cozy \u0026 trendy and the Margs are fab! I love coming here when I'm starved.l either during lunch or for dinner. Perfect for a chill time and one of the best tasting authentic Mexican comida places around", "author": "Amanda R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-26", "description": "One of the absolute best! Whenever I'm in the area I bring people here. Great food at good prices, and really cool decor. I particularly recommend the black bean and plantain quesadillas! Cash only.", "author": "Quinn T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-13", "description": "Mexican can't go wrong for veganbut get the vegetarian black bean soup as your entree. You thank me and worship me. It's worth it even in the summer. \nLove Katie. She's an awesome host.", "author": "Kateria N."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-04-30", "description": "Staff is really friendly and awesome but... yuck. Don't order the veggie burrito unless you're looking for a bad time.", "author": "Sally R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-10", "description": "Good hole in the wall Mexican spot in Fort Greene.  Centrally located near the subway. This place is small and you will feel on top of your dining neighbors but the food is worth it.   The place seems to busy most of the time so you may have to wait and unfortunately there is no space inside to wait. Cash ONLY.\n\nBig list of entrees to choose from including poblano rellano which I never see. I ordered the taco platter and was able to order different tacos to try (one of each shredded chicken, bean, mushroom) that also came w/beans and rice for $15. I really enjoy the tacos as they were well spiced, seasoned, and were wrapped in two soft tortillas. Solid taco platter.  We also split chips and guac to start. For $12, it did seem a bit overpriced as it was a very small portion but the guac was delicious. The others in my party ordered the burrito and it was really big but good. \n\nService wasn't the most attentive but food came out pretty quickly. All in all - I think it's worth it for solid, lowkey, well flavored Mexican.", "author": "Heather L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-17", "description": "IDK perhaps the universe's mojo was in full force when my friend and I dropped by because despite an impossible list of circumstances, we had a brilliant time: \n\nSetting: it was Saturday early evening on Cinco de Mayo. Hence a wait for table. We popped over to Mo's and sucked down a quick marg and boom--the 30 minute-table-wait shrunk to 15 minutes. Don't underestimate the power of tequila, friends--bending minds and minutes since time immemorial!\n\nStaff: from the second we got on the waitlist for our table to the next day, when I happened to run into the lovely manager in the neighborhood, our experience with Pequena's staff was superlative. From adjusting the AC to sorting out extra salsa, to keeping the drinks coming--we were cared for, watered, fed, and liquored up. We were even shouted a round of shots and this made us feel pretty special. (Don't tell me that this happens all the time, ok? I need my special feelings.)\n\nFood/Drink: We ordered vegetarian nachos, loads of fresh margaritas, a couple of special salsas and tucked in. I highly recommend this sort of a simple menu for when you need to catch up with a friend, get some delicious calories going because you haven't eaten all day, and are in the mood for dranks made with real indredients and not synthetic mixers rife with corn syrup and melted sneakers. \n\nExperience: We were a two-top surrounded by much larger parties who were super friendly and extra funny. To make things even more festive-ocassion-spirited I suggested we join our tables and hang, like a newly blended family might. After checking in with the manager, we did just that and proceeded to have a blast. \n\nI'm not sure why I don't eat at Pequena on a weekly basis so I'll have to really look into that. And I'll end with this: are you a bit lonely/ sad/ bored/ frustrated/ in need of kind human vibes? Get yourself here, eat something, have a drink. Way cheaper than a therapist + more delicious!", "author": "Pritha R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-25", "description": "Awesome Burrito!  I would order from herea gain and share this meal choice with anyone local.", "author": "Micaela C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-01", "description": "This is one of our favorite restaurants in New York! Whether before a show at BAM or TFANA, this is the perfect place to grab some delicious food! Everything on the menu is amazing - the margaritas, chips and guacamole, enchiladas, and quesadillas are highlights! Perfect date night spot close to Atlantic Avenue/Barclays Center. \nCash Only!", "author": "Joe H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-10-12", "description": "What was once great has become the worst.\nThe enchilada was ill prepared and looked like a poorly prepared, minuscule taco with no cheese topping, devoid of sauce \u0026 filling. The serving had 2 tbls of rice with 3 tbls of beans. Now, we all know that rice \u0026 beans are inexpensive ingredients.", "author": "Beryl B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-06", "description": "It's true, BEST chilaquiles in town, you could easily sell them in Mexico City.\n\nService is very good, the margacerveza is more like a Mexican michelada, pair it with chilaquiles and your hangover is history!\n\nReasonably priced, just bring cash because is cash only.\n\nHighly recommended!", "author": "Ana M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-16", "description": "Good wallpaper on the table, it made all my hand selfies look fire. Guac and chips I would def dip as well as their stuffed pepper. Overall peep the thumb cuz it's def", "author": "Massivebongrips Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-08", "description": "This is my favorite breakfast spot in Fort Greene.  Decoration is eclectic and the food is tasty. I always get the breakfast burrito.", "author": "Alaa A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-12-16", "description": "I've been eating here for years. Food is great. Drinks are great. Plus, I love the fact it's small. Yes, that does mean it's a tight fit, but I never leave hungry and the blood orange margarita is delicious. CASH ONLY.", "author": "Carli B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-01", "description": "I love this restaurant with my whole entire heart. It lives up the name because it is small af, but the service and food is always good and reliable. It is decently price for the quality and quantity that you get especially in the Fort Greene neighborhood. I have been going here well over 10 years and it never disappoints.", "author": "Jennifer W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-11", "description": "Took about 15 minutes to get a menu once we first sat down.. our server forgot an order and left it on the bill at the end.. we also saw him taking shots... the food was disgusting... fish tacos smelled and tasted rotten and the portion size was ridiculous (too much meat).. the shrimp salad was inedible.. shrimp was bland and rubbery.. we will never come here again and I highly recommend to avoid this terrible place at all costs.", "author": "Ramon I."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-15", "description": "Step inside to escape to Mexico!  Decor always reminds me of vacationing in Playa del Carmen!  Food is authentic and prices are great!", "author": "Ali I."}], "servesCuisine": "Mexican", "priceRange": "$11-30", "name": "Pequena", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "86 S Portland Ave", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/KWpvOOon8kcWehPXnMptDw/ls.jpg", "@type": "Restaurant", "telephone": "+17186430000"}