{"aggregateRating": {"reviewCount": 317, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-03", "description": "I grew up in Fort Greene, and started going to Pequena as soon a they opened. It was my favorite spot for years and years, during high school, whenever I'd come home for college, etc.. I still feel like the food is amazing and I do love the ambiance (although I hate the wait, but  I know it's coming if I'm trying to be there on a Friday or Saturday so I don't hold it against them). I just feel like they've raised their prices so much since starting that I've started going less and less. I'm sure their rent has gone up, but paying $8 for a tiny bowl of guacamole made me second guess my love for their black bean plantain quesadilla. And very little can make me do that.", "author": "Sarah T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-18", "description": "this was a great place to grab a bite in the neighborhood. Cozy though, so going with more than 4 people could be a problem in getting a table.  \n\nThe Guacamole and chips are great and fresh! I had the pork tacos , they were awesome!  Great flavor, not dry, the pickled onions were delicious.  \n\nThe only con is that the staff was a bit rude.  Almost that they were upset about questions.  We had condensation from the A/C unit above our table so we moved over one table and the waitress was annoyed.", "author": "Candice B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-30", "description": "I give this place four stars for food and three for service but since I'm feeling nice today, I'll round up and give a generous four stars.\n\nThere isn't much to say about the place itself other than it's extremely small and has a bunch of kitschy stuff hanging from the walls and ceiling.  The servers weren't very friendly but luckily the food is actually good.\n\nWe only sampled a couple items, the chilaquilles verde and chicken quesadilla.  I especially love the oaxaca cheese on the quesadilla and the verde sauce on the chilaquilles.  \n\nI also scoped out the meals of fellow patrons and would definitely go back to try the enchiladas and tortilla soup.  I'd probably go back and try everything because it all looks good.\n\nIn summary, good food, indifferent staff... luckily I care more about food quality than friendliness so it's all good.", "author": "Katie T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-30", "description": "This place is colorful and cozy, and the staff are some of the friendliest.\nI could eat the bean cheese dip as a main course because it's that amazing- the tacos and enchilada are also a must have.", "author": "Alanna M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-21", "description": "This is the best place for Mexican in this neighborhood! It's small but in the summer there is an awesome little patio, the margaritas are to die for, and the menu is authentic and fantastic. Get the tacos and guacamole!", "author": "Alex M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-08-26", "description": "I am seriously wondering why this place is always packed. It must be for the drinks, because the food is sub-par. I ordered the chicken enchiladas and they were room temperature and swimming in a pool of liquid. I am not just talking salsa, I am talking water. As if maybe they pulled them out of the freezer an nuked them or something. Aside from not being \"hot\" temperature-wise, they had no flavor or spice whatsoever. I had to douse them in the various hot sauces that were on the table. This food is expensive for the quality and not even close to authentic. My enchiladas were supposed to have queso fresco on them, and they were smothered in typical processed cheese with a few sprinkles of queso fresco. A microscopic amount. \nAnd sadly, the service was also pretty disappointing. Lots of people standing around on their iphones.", "author": "Rosetta S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-02-27", "description": "The food at Pequena is flavorful - I had the spicy chipotle fried fish taco appetizer, which came with guacamole and spicy red salsa (getting 4 small tacos for $7 isn't too bad), but they charge for extra sauces. The chipotle sauce was a bit lacking on the tacos, so I asked for extra and then I ended up paying $.075 for a bit of the chipotle sauce. \n\nI wasn't told that the extra mayonnaise would be $0.75, and in retrospect, I can't image paying that much for essentially extra mayonnaise. Does anyone else think that paying $0.75 for extra mayonnaise is ridiculous?\n\nAlso, as per my check-in, my other complaint is that, right when I walked in, I sat down and took out my cash, and the server tried to grab the money that I took out. In defense of why I took out my cash, this place is \"cash only\" and I didn't want to be digging around in my bag for the cash at the end. The server got visibly upset when I asked her to give me back my cash and she then defended trying to grab my cash by claiming that someone had randomly left that much in cash on the table and she was just picking up a tip. Fighting with a server about my own money that I clearly just took out in front of her is also kind of ridiculous.\n\nBetween that and the cost of the \"extras\" I may or may not come back.\n\nAbout the tacos: small but flavorful.", "author": "Kirsten P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-03-10", "description": "Are you kidding me? No really... what sort of mean and costly joke is this place? Before you decide to waltz in here, carefully take these other 4 and 5 star reviews into context.\n\nWe came for dinner. Not lunch, not brunch. It's hardly the cheapest. Your entrees do come with a lot of food. The worst part- I left feeling stuffed and completely unfulfilled by watered down food.\n\nI've been told the restaurants in Fort Greene aren't so great, and given its neighborhood location and target clientele I am sure you can understand why this is not going to be an authentic ethnic restaurant. \n\nPROS:\n+ Quantity of food in entree\n\n+ Open late for the area\n\n+ Key Lime pie dessert was nice.\n\n\nCONS:\n- Flavor is so watered down. My pork tacos tasted like cardboard. My fried fish taco was dinky small, a bit soggy, and the taste of the batter and fish + fish texture were off. **look at a photo of Pequena's tacos, and compare it to one from Taqueria LES, or any taqueria in LA. More specifically, compare a photo of their $3 fried fish taco to a photo of Ricky's Fish Tacos ($3 and 3x the size, 3x the fish, hot, fresh, crispy, bursting with flavor).. just google it. doesn't even compare.\n \n- WHY are the tacos so sweet? The sweet pickled onions or whatever.. is the only (and overpowering) flavor in the taco. \n\n- Charging for your standard chips and salsa. (a red flag of a non-authentic ethnic restaurants- i can give more examples..). How the hell do you charge $4 for a basket of chips and a side of diced tomatoes? Seriously?!\n\n- Incorrect order: I ordered 2 fish and 1 pork taco, but I got 1 fish taco and 2 pork tacos... and was so disappointed with both items I didn't even bother reporting it.. what's the point. rip-off anyone? \n\n- Rice and Beans are both tasteless and sticky starchy. Was this overcooked/oversteamed? Rice \u0026 Beans from even the hole in the walls in Bushwick are much better than this.\n\n- Lackluster service. Note the many other yelp reviews about the service... this place is not known for service.\n\n- Food does not come out hot.\n\n- Look at who is eating here if you go. No judgment! Just sayin... I use the same rule when eating anywhere downtown.. say for ex in chinatown. It tells you a lot about what to expect.\n\n\nNOTES:\n\n+ Overall, the food is lazy and uninspired but it does not matter because it is next to the subway exit and will always have traffic. If you've ever had the middle eastern take out place off the bedford ave L train exit.. you know what I mean.\n\n\n\n+ I did just come back from living in Los Angeles.. and we know that good mexican food has not migrated that far north. With that said-\n\nNYC does have GOOD OPTIONS for mexican food.. in neighborhoods you would expect. Here are my recommendations in 3 price ranges:\n\n$ = Taqueria L.E.S. (Lower East Side Manhattan) / Downtown Taqueria (New Jersey)\n$$ = La Superior (S. 2nd \u0026 Berry, Williamsburg Brooklyn) / Calexico / Arepa (latin american food, not mexican)\n$$$ = Hecho en Dumbo (Bowery \u0026 2nd St Manhattan)\n\n+ Good food is worth the trek!! If you just finished a movie at BAM, or you live in Ft Greene.. good food is not far away (Wburg / LES). This experience overall is like when I used to work near midtown and people :cough: would tell me about the great chinese fast food restaurants in the area (you know.. those poorly lit dingy ones all with the same printed menu that sell fried chicken and french fries among the moo shoo pork).\n\n\nHoney pls... trick me once, shame on you. trick me twice... no you won't get that far. Sorry love, it's not that I won't eat here again- it's just that if I eat here, it'll be a last resort when I'm starving and even the plainest jane would do.", "author": "Steven C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-22", "description": "VERY SMALL, But the food is delicious. The mango margarita my faaaavvvvveeee and the tostada delicious", "author": "Jenn M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-13", "description": "This is my spot!! The food isn't bad and neither are the drinks! Great happy hour. I highly recommend it. It is cozy... so no big entourages. 2-4 ppl max in your party. Please and thanks!", "author": "veranda b."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-05-03", "description": "The Chicken Enchiladas were good. Though there wasn't so much Salsa Verde which made the meal feel a little average. I've eaten here before and absolutely enjoyed the Enchiladas. Might have been a bad day?", "author": "Steve A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-26", "description": "When my boyfriend and I moved to Fort Greene, our first priority was finding the closest Mexican joint that'd become our mainstay for dinner dates. Pequena, as we've learned from at least a dozen visits since then, isn't perfect -- but the pros outweigh the cons.\n\nThe restaurant itself is small, which makes for a cozy dining experience...as well as a potentially lengthy wait-time for a table, especially at dinner. Go early if you want to be seated immediately, and stick to small groups -- this is not the place to take your nine best friends on a Saturday at 9 o'clock.\n\nFood -- mostly -- is lovely. Do not leave without ordering the chips and guacamole. The chips here are unlike any that I've had at other Mexican spots, and much much better. The guac is killer. Black bean soup rocks and is big enough to be an entire meal. Vegetarian entrees (tacos, enchiladas, etc) are all stellar.\n\nI've been less-than-astonished by the shrimp, which is puny and poorly cooked, and the wine is crap. But don't order wine here. Stick with the frozen margaritas, which come in a rotating array of flavors and really rock.\n\nThe servers are often really rude. Get over it and get drunk.", "author": "Katie E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-03", "description": "I find this place sweet and reasonably priced and the food is very good, and the service is usually pretty great, and the manager seems like a cool person. It gets five stars because if you go for brunch on the weekend, you can get the best French toast ever made. Seriously, if there's better French toast somewhere, I need to know about it.", "author": "Joshua R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-13", "description": "Love this little spot in Fort Greene. The service is alright and the restaurant could use a little sprucing up, but the food is fantastic. A tad on the pricey side, but well worth it as it's delicious and the portions are pretty large.", "author": "Amanda G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-10-30", "description": "Moving to New York from Tucson, Ariz. I knew that Mexican food was going to be a challenge. But hey, you can't really find that kind of Sonoran Mexican food anywhere else, so I figured I'd give the local joint a chance. \n\nWhile my first experience at Pequeña was pretty underwhelming -- including an enchilada that tasted like it was made with marina sauce --I've since revised my original opinion. I was too tough on Pequeña if for only one reason: the margaritas are pretty great. They taste like home, and their strong. Also, I loved the Day of the Dead decor. I'd also recommend the chile relleno. Sure, they make their tostadas with black beans instead of pinto, but hey, nobody's perfect.", "author": "Alex D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-10-31", "description": "Pequena is a really great standby restaurant. This is close to where a friend of mine lives so we go here fairly often when I'm in town. Oh, did I mention that you can get margaritas in a carafe?\n\nThe food is good, but it isn't in the 'wow' category but it is very solid. The restaurant itself is really really small and the tables are generally wobbly. But I like that the little chili/festive lights are up all the time. Generally speaking the service is very fast and friendly.\n\nDefinitely worth checking out if you can squeeze yourself into a table.", "author": "Stephanie H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-06-02", "description": "Pretty decent Mexican food. It's not super authentic, but it's like one step up (and therefore more expensive and less authentic) than your real Mexican taquerias. Go for the a la carte sizes if you don't want to feel stuffed. $7-9 for the a la carte size, ~$14 for a little extra plus rice and beans. The guac is tasty, but you can't really ever go wrong with guac. \n\nSurprisingly, the carafes of margaritas were about 4 full drinks' worth. At ~$23 each, we were expecting much less. \n\nThe decor is pretty cute, they have a kind of dia de los muertos thing going on in their little front sunroom. The service was nice but not very attentive.", "author": "Melissa W."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-10-08", "description": "Ehem... if you can have better quesadillas at the Brooklyn Public House, there's gotta be something not right with this MEXICAN restaurant. Yet, black bean soup is delicious...\nWaitstaff could be a little more friendly though...\nI've really expected better.", "author": "Michael W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-11-14", "description": "Conveniently located a block from my friends apartment, while visiting. I was craving Huevos Rancheros and convinced everyone to come here. It is quaint and old fashion, it felt a little cramped but it was cozy.\n\nThe food was great. I had mine with Chorizo, I wasn't too impressed with the presentation of the chorizo but all together it tasted great! Everyone cleared their plates. Next time I'll try the Bloody Maria!", "author": "Jenna P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-28", "description": "Terrific hole-in-the-wall Mexican spot in Fort Greene. Can't imagine how many times I'd passed it before stepping in. Be forewarned-this place is TINY (no surprise, given the name) but so worth it. Quesadillas were incredible and a good portion size for dinner. Tacos looked great and I'll be back to give it a shot. Not good for groups but they also deliver, always a plus.", "author": "Ronald G."}], "servesCuisine": "Mexican", "priceRange": "$11-30", "name": "Pequena", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "86 S Portland Ave", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/KWpvOOon8kcWehPXnMptDw/ls.jpg", "@type": "Restaurant", "telephone": "+17186430000"}