{"aggregateRating": {"reviewCount": 317, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-07", "description": "I go here for one thing and one thing only: the Shrimp Avocado Black Bean Salad. I've been a fan of this place since it opened, so that's a long time.\n\nI'm not sure I've ever tried anything else, but this is so fantastic I keep ordering it. One day I'll try something else.\n\nThey make pretty awesome margaritas too! *nom nom*. Like the name suggests, it's a tiny spot. Especially in winter since they don't have the outdoor tables. Prepared to be shoulder-to-shoulder with your neighbor, but it's sooooo worth it.", "author": "Debbie S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2009-11-04", "description": "ZzzzZzzzz.\n\nA real snooze fest:\n\nCrazily over-seasoned tortilla chips (I respect the effort to make them flavorful, but they went overboard!)\n\nSuper bland rice and beans (a cardinal sin for any Mexican restaurant--don't be lazy, season your rice!)\n\nTotally meh chicken enchiladas con salsa verde (no character--I forgot I was eating food the entire time)\n\nJust meh.  Would never pass in California for food, let alone Mexican food.", "author": "Eloi B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-06", "description": "Just had brunch here - such a cute little place with food good enough to lick the plate clean.  The Huevos Rancheros, Las Cazuelas with plantains, and the Green Eggs \u0026 Jamon were all amazing.  The staff is super friendly, too - we'll definitely be back.", "author": "Lily E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-09", "description": "Four stars, only because if I gave it five you would hype it up in your minds then be disappointed because you've probably had better mexican food, somewhere, at some point in your life.    \n\nBut for Brooklyn...  I love it.  I crave their margaritas, and with a happy hour special of 2 for 1 before six I find those cravings of fresh lime juice and salt to be satisfied often.  Other things I love are the fried plantains that I get every single time I am in here.  They serve them up with sour cream and cotija (cotija = mexican feta cheese).  \n\nI will agree that the beans and rice are bland, but the tacos, stuffed peppers, chips, salsa and guacamole, and everything else I have tried is damn tasty.  This place has such colorful atmosphere and the service is friendly and down to earth.  Me gusta Pequena mucho.  Si.", "author": "Evelyn I."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-12-06", "description": "True to its name, Pequena is a small little space that obviously gets packed pretty quickly. The tortilla chips are made on premises and were pretty good - though the ones near the bottom were super salty and you had to brush off all the extra seasoning which isn't a complaint.\n\nI went with a group of 3 and we split a pitcher of habanero margaritas. We each drank a little over 1 glass, which when divided, equals about the same as buying the individual serving. I got the 2 fried fish tacos for $7.00 which was surprisingly filling. The meal costs about $13 and you get beans, rice, and an extra taco.\n\nThe service was super slow, but I may still come by on a less busy night to try some other stuff.", "author": "Ty R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-09", "description": "This is the place you go for food in a nicely decorated (but SMALL=wait) restaurant.   Tostada's (without rice \u0026 beans) and the chicken tortilla soup are more than enough for 2 to split; so yes the portions are very generous.  And this is the BEST chicken tortilla soup around.  The enchiladas are delicious as well.  On occasion they do have special flavor marg's, like jalapeno for some extra kick.  \nOnly reason i can't give it 5 stars: what's with the smaller portions of soups to go???", "author": "Phil L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-03-23", "description": "I was looking for something different for lunch and walked by Paquena.  I really wish I kept walking as my experience was not satifying.  The decor is very cute and definitely gives you a feel of the islands, but the food is lacking.  The server was very polite however the owner seemed a bit snippy with customers.  I ordered the fried fish Tortas and the fish didn't smell fresh at all. The accompanying rice and beans were bland and I really wished they would have put some limes on my plate just so I can get some acidity in the sandwich. The fresh chips and guacamole were good but also needed some lime.  Overall I would not go back to Pequena. I can't wait till Habana Outpost opens up again since they're right across the street.", "author": "Louisa S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-06-16", "description": "I'll admit: I was raised on the horrible American crispy hard taco, and then the stretchy soft tortillas you'd find in a supermarket, so try as I might the soft tacos here never quite do it for me. Everything else, however, is just about perfect. The pork dishes are by far my favorite, being at my ideal level of saltiness, though the shrimp is probably about equal or better (but also more expensive, thus why I usually don't go for it). The chicken is good too, in that typical unexcitingly chickeny way. I find the rice and beans inordinately tasty as well, the type of thing that's so good and easy to shovel into my mouth that the more I eat of it the faster I find myself eating it.\n\nSides are pretty good tool. I like the plantains, well, about as much as I've ever liked plantains, and I love the chips here--fresh and crispy and dusted with spices. I could subsist on literally nothing but the chips and pico de gallo for up to a week and you'd never hear a single complaint from me.\n\nStill, this is one of those places that is so small and cramped you almost wonder why they bother have seating at all, to the point where even attempting to eat here with more than two people on a busy night should qualify as an arrestable offense.", "author": "Galvin C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-06-02", "description": "I want go give Pequena four stars.  So let me start by saying if you're looking for that fun, festive, slightly dive-y atmosphere that can make a meal at a Mexican restaurant feel like a mini-vacation, this is definitely a good spot.  The decor is great, and the waitstaff are really nice.  And, if you go, definitely check out the skirt steak tacos, they're super tasty.\n\nThe drawback for me is the guacamole.  It's not fresh, and it doesn't have enough tomatoes or garlic.  I could almost forgive that, since there are different styles of guacamole, but the chips were also stale.  I'll probably make it back at least one more time, and if the guac/chip situation improves, I'd bump it up a star.", "author": "Katie S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-11-24", "description": "This review is strictly for the brunch menu.\n\nWent there with the girlfriend and left very satisfied. I had the \"Pan B', which was very tasty, but it wasn't mind blowing. Had this been mind blowing, it would have gotten five stars.\n\nMy girlfriend had the breakfast burrito, which came recommended, and it was one of the best brunch items I've ever eaten.\n\nWe both left stuffed, caffeinated and happy.\n\nThe two items, plus a cafe con leche and Americano came out to $23.\n\nAfter that meal, we're looking forward to exploring Fort Greene more...", "author": "Stranger D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-06-30", "description": "Let's start with the definition of Pequena [pay-kay'-nyo, nyah]\narticle\n1. Little or small of size, minute.\n2. Young, of a tender age.\n3. Low-spirited, humble, abject.\n\nThe place is really little/small hence the name is appropriate! It can only fit about 20 people. However there is nothing small about the flavor or portions of the food. \n\nThe restaurant has a very cozy and fun feel to it. The decor is really cute and inviting--nothing fancy just quaint. The service at brunch was pretty good but we also got there when they first opened. \n\nWe came for brunch and the food was great. I loved the combination of black bean, sweet plantains and eggs---these are a few of my favorite things!!! The guac, salsa and chips were also very fresh and delicious. My bf had a side order of the sausage which he loved. The Mexican style omelet was also very yummy. The margaritas were delicious and overall prices were fair considering the good food. \n\nThis was a great brunch and we will be back!", "author": "Deanna D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2006-05-30", "description": "Pequena is a restaurant well known to the locals in the area. For the most part, you won't see folks wandering to this end of the neighborhood. From the outside, there is a wood deck with space for about 4 tables, and spots just outside the deck on the street for about 2 tables. It isn't much to look at, truth be told. The amazing part is that the kitchen is smaller than the space for tables inside. Impressively small, I'm surprised they have as long a menu as they do. \n\nThe chips with pico de gallo are a MUST. Their chips are homemade and freshly prepared. They are thicker than most people would be used to, but it is very lightly salted and has a little peppery kick added as spice to it as well. The pico de gallo is SUPER fresh and very flavorful -- fresh cut veggies and herbs really make this come alive. What I really wanted was guacamole, but they were all out of it. \n\nAs for the non-appetizers, I was sorely disappointed after hearing wonderful things about the food. The shredded chicken with guacamole and salsa quesadilla was FRIED! I could have overlooked that aspect if it had good flavor, but it simply didn't. The cheese didn't even poke my taste buds and the chicken must have been missing some marinade. It had zero flavor. My BF had a half rotisserie chicken, which had tasty skin, but the inside was flavorless as well. It needed salt desperately just to get it down your palate with some semblance of flavor. The rice and beans were merely okay. FYI, they add some sour cream to the black beans, so if that's not your thing, be warned. It added a creamy flavor, but the beans themselves weren't tasty enough to say it was enjoyable.\n\nWhat a disappointment. Aside from the chips and pico, there's nothing here that enticed me. It almost made me feel like I ordered the wrong thing -- there were so many people waiting outside for this thing. What went wrong? \n\nThey are open 7 days a week, open late nights and are a CASH ONLY joint. They do serve liquor, sangria's and the like, but I wasn't enthused by it after what I tasted.", "author": "Christine J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-15", "description": "Dear Pequena,\n\nPlease open up shop closer to my apartment. Because lord knows the next time I'm going all the way to Fort Greene. At the very least, maybe a guacamole outpost? A salsa stand? I would come eat your enchiladas every day. Maybe twice. Just think about it, okay? \n\nThanks,\nLindsay K.", "author": "Lindsay K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2007-09-23", "description": "Looks matter. And Pequena is cute as hell. They may have a few execution/service problems, but frankly, I've gotten used to to that in my neighborhood and found the service at Pequena to be miles above what seems to be the local standard of one friendly but harried waitress per 8-12 tables. \n\nAs others have stated, there is little point in comparing East Coast Mexican to West Coast Mexican, yet people do it for EVERY MEXICAN RESTAURANT IN NEW YORK. Give it up--we're a few thousand miles further from Mexico than San Diego is. Take what you can get. At Pequena, you should probably take what everyone else has recommended--primarily the delicious chips and black beans. \n\nMy major qualm with Pequena is that the food was consistently lukewarm. I sent back my mushroom tacos, requesting that they just stick them in the microwave for 30 seconds, but was told they would make brand new ones in about 10 minutes. Seemingly brand new ones came back in about 3 minutes, which was both a delightful surprise and slightly suspicious. Also suspicious was the sangria carafe that never got empty, but that's a good kind of suspicious, and one I'd totally go back for.", "author": "Michelle G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-28", "description": "Chicken Tortilla Soup ($7): 3 stars.  Meh.  It was alright, fresh ingredients but I had an avocado slice that should have never made it past the kitchen.  The soup seemed a little brothy/watery  - more so than other soups I've had of this kind, also wasn't very spicy.  3 stars.\n\nBlack Bean Dip with Cheese ($5): 5 stars!  Best black bean dip I've ever had.  So worth $5!  Huge proportion - I was sharing and was totally full by the end.  Served piping hot, literally boiling at my table with seasoned fresh tortilla chips.  Gooey cheesey perfection.\n\nPork Enchiladas ($7-8?):  2.5 stars.  They were alright.  I got the rojo sauce which was suppose to be spicy but wasn't really.  The tortilla was covered with so much cheese it all sort of turned to mush.  The pork was good but as far as enchiladas I've definitely had better and probably wouldn't order these again.\n\nMargarita on the rocks ($7): 3 stars.  Pretty standard, served with fresh lime and salted.  Decent proportion - I like Havana Outpost's better.\n\nAmbiance: 5 stars!  Adorably decorated with bright colors and little fun lights, cool tile, nice people , and great music!  I heard Department of Eagles as soon as we walked in - sold.\n\nOther notes of interest: They serve coffee but not in to-go fashion, cash only, screened in outdoor eating area with windows for rain, gratuity is included for groups.", "author": "Amanda H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-07-07", "description": "Pequena definitely lives up to its name- its hella small in that restaurant. Seriously, there's probably only room for about 6 parties of 2.\n\nService- decent, considering that there is only waitress and she's normally always pretty busy.\nFood- I was impressed, however i don't eat much mexican food so i'm not too hard to impress. Lunch specials come with chips and pico de gallo though you can get guacamole for your chips for about a buck extra. Entree portions are pretty large as the entree comes with sides of black beans topped with sour cream and yellow rice. Pretty good; I had the shrimp quesadilla and it was a little different from quesadillas I normally have as the shell was quite crunchy. Weird, but whatever.\n\nCool place, go there.", "author": "Brittany H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-03-09", "description": "I would have given this place 4 stars, because my stewed pork tacos with spicy chipotle salsa and black beans were absolutely delicious.  The pork was tender and well-seasoned, and the chipotle added a nice kick once I mixed it in with everything.  However, the sangria I ordered to drink was less than stellar.  There wasn't any fruit in it, most of the glass was filled with ice, and it was pretty much watery and flavorless.  \n\nThe service was fast and attentive, and the atmosphere was cute and kitschy.  It's a good place to have next to a popular neighborhood bar, and I'm sure I'll be back after my next trip to Moe's.  They even deliver next door in case you don't want to get up from your stool.", "author": "Meredith F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-08-02", "description": "Pequena....what can I say.\n\nConsistent...the food was incredible.  Best Mexican food I have had hands down.  My suggestions...its cute...its got sass...its got great Margaritas.\n\nHomemade chips....first tried with pica de gallo, next the chipotle salsa.  go with Salsa. First time...the stewed pork enchilladia with green and red salsa and of course delicious rice and beans.  Shareable amongst two.  It was so good.  Second time was heavenly....Spicy beef hash Poblano pepper....OMG. This was the ultimate meal..it was slowly roasted, pepper melted into your mouth and the spicy  beef hash filling was divine.  Again the rice and beans consistently delicious.  \n\nThe chocolate cake was soft, moist and ohhhh soo good.\n\nThe fresh lime margaritas are very good....and for 6.00 each or 16.00 for a cafare.  Meals are good, reasonable and again portions are large enough to share.  Cash only and it is small but cozy.  Oh and Happy Hour Monday thru Friday from 4-6.  2-For-1 Margarita.\n\nI'm still craving it and I had it two days in a row.  I'm a huge fan and best thing ever.  Go for great food, great drinks and then head over for some BAM action afterwards.", "author": "steph d."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-19", "description": "Steak tacos dinner was really good.  At 18 bucks, it might feel a bit pricey tho.  Perhaps they have a nice ambience in the resto, i don't know.  Delivery was fine.  Apparently Kevin Spacey dines here sometimes after his performance at BAM or whatever he's doing there.", "author": "Kevin W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-19", "description": "Arrived about ten minutes before closing on a Saturday night. I was promised an excellent, affordable meal by my penny pinching friend, and he usually knows the best spots for chow on the cheap. The place was small and cozy and we amused ourselves with all of the decorations hanging from the wall and ceilings while we waited for our food.\n\nOur server was awesome and did not make us feel rushed at all, even though we barely got our orders in before their closing time of midnight. The music was really good too, straight off our server's iPod. Made us want to continue the night next door at Moe's with some dancing!\n\nTwo of us got the avocado black bean salad, I got mine with chicken. They were amazing and flavorful and I had enough to bring home for a second meal. Score! My other friend got two tacos from the appetizer portion, probably because he is always on a strict budget, but he said they were tasty as well.  He actually ended up taking my left-overs home for himself when I forgot them after an hour of dancing at Moe's! Fail.\n\nI will totally return to Pequena. Maybe for brunch next time.  And don't forget, cash only!", "author": "Dawn M."}], "servesCuisine": "Mexican", "priceRange": "$11-30", "name": "Pequena", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "86 S Portland Ave", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/KWpvOOon8kcWehPXnMptDw/ls.jpg", "@type": "Restaurant", "telephone": "+17186430000"}