{"aggregateRating": {"reviewCount": 317, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-12", "description": "I paid more attention this time and it was actually really GOOD! The blood orange margarita did not hurt, that's for sure. Even tho this time we sat at the same teeny table and our chips had to be on an adjacent stool (worked great), we were smarter and ordered appe portions with sides of 1/2 beans, 1/2 rice. Perfect! Still a bit more than we could eat, actually. appe size is 1 quesadilla instead of 2 or 2 tostadas instead of 3. The sides are so affordable, this helps you keep your eye/stomach size more equal and it's cheaper than the platter!\n\nfor the 3 of us the perfect amt of food:\npork tostada - appe size (2)\nchicken tostada - appe size (2)\nshrimp quesadilla - appe size (1)\nchips/pico de gallo - fresh!\n2 sides of 1/2 beans, 1/2 rice - a bit left over between the 3 of us AND it fit on the table if you count the chip-stool.\n\ncan't wait for Pequena in Prospect Heights to open on Vanderbilt. Even closer to me! YUM!!", "author": "Joanna G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-11-28", "description": "Pequena is a delightful pocket eatery in Fort Greene with sensible Mexican dishes aim to please a variety of palates. Not as authentic and affordable as Castro's in Clinton Hill or the restaurants in Sunset Park, but this quaint restaurant is a lovely escape for a weeknight out.  The colorful artsy decor puts a smile on my face every time I'm here.  Not crazy about the drinks.  I say stick with beer here.  You can troll Dekalb or Lafayette for after-dinner watering holes.  The service is mediocre but chill.  We got different servers and it was kinda confusing.  The vibe reminds me of LA's Los Feliz.  Casual, nonchalant, slighty quirky.", "author": "Donald L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2007-07-31", "description": "To be honest, there's a peculiar sentimentality I've for this little joint.  Why?  It may be that I really like their pulled-pork offerings, and the first time I went, I really had a great time, sitting at the corner table inside, throwing back some white sangaria (I don't even like the white-version, in general).  Maybe it had to do with the person I was with.  \n\nAnyway, the food there is nothing extraordinary, but it definitely does its job (satiating that certain Mexican-type - or at least something wrapped in tortilla with a sides of rice \u0026 beans - of pull by your appetite).  \n\nI usually end up getting the platter, but I always take nearly half the stuff home (the entire subject of leftovers and how to consume it - great debate of cold vs hot, nuke vs oven, deconstruction vs respect of the sanctity of what is wholly, etc - we'll not get into) and sometimes I think it tastes better after at least 12 hours of refrigeration (this is in no way, necessarily, dissing the food; it may be some type of a mental thing I've got).  \n\nYes, it's always busy, and half the time, the service is very poor.  I mean, the wait staff are nice bunch of folks, but since it's such a small joint, the food takes forever to get to your table.  Also, in addition to the regular tardiness, they messed up our order once, so we had to sit there for an unreasonable amount of time - our waitress did give us some complimentary chips and salsa to pass the time, but I think that appeased me as much as a kid getting a zip-lock bag of Bunny Luv instead of a chocolate-chocolate Klondike Frozen Novelty.\n\nI think if you live in the area, there's probably a good chance you've already tried Pequena and made up your mind.  But if you are new to area or visiting or looking to explore Fort Greene, I don't think the place will ruin your evening - unless you're bound to a tight time-line.  I think the key is to have a good friend or a date and just relax and have a good time.  Try it.", "author": "Arthur O."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-09", "description": "all it's good, food, service, clean place,  but  please please start  accepting  card, so annoying  to  get out  the rest and  get money  from a atm,  not cool at all.  thank you.", "author": "Javier V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-21", "description": "When you laugh the whole world laughs with you, when you have the chips here you will never let anyone get between you and them. Your tongue will act as cousin Larry and the chip as balky as they swirl around your mouth doing the dance of joy.", "author": "John H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-31", "description": "I didn't grow up in a Mexican household, but the food at Pequena makes me feel like I know what it'd be like -- in a good way. The food lacked flash, but everything was well made and satisfying. I had the black bean and sweet plantain quesadilla. I enjoyed the sweetness of the plantain with the spice of the salsa. The main dish came with a side of rice and beans. For a drink, I tried the habanero grapefruit margarita. I wasn't wholly impressed, but the sips that were spicy got my attention. If you go here hungry and get a main dish, you'll leave stuffed.", "author": "Ian M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2008-06-16", "description": "We gave this 2 shots, with the hope of having some good Mexican food closeby..but both times we were disappointed.  Think we got enchiladas take-out the first time, and went back to dine-in the 2nd time and split a quesadilla.  Both times the food was pretty bad--congealed cheese, tasteless tortillas and salsa..\n\nI'll give it 2 stars only b/c it is a nice little place to hang out, and you can get bottles of pacificos.", "author": "Suman G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2009-07-18", "description": "Meh. I've experienced better, pretty much sums it up. \n\nHubby and I had an AMAZING meal at Matamoros for much less then 1/2 the cost of this hole in the wall. Plantains were cold, black beans were ordinary, fish tacos were flavorless, our buzz on our margaritas saved the night - but even those were unimpressive. I'm not sure what everyone was smokin when they gave 4-5 stars, but honestly, they need to lay off the pipe.", "author": "Emily G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-18", "description": "Found this little gem of a place when going for a random bike ride through brooklyn with a friend of mine.  She had eaten here quite some time ago because of a friend that lived in the area.\n\nI got the chicken enchiladas and she got the fish tacos.  My enchiladas came with plenty of rice, black beans, and a green sauce over the two enchiladas.  Food was pretty tasty and filling.  Portions were solid.\n\nSat in the little park near by and just enjoyed the warm weather and good food.\n\nDownside is cash only.", "author": "William B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-20", "description": "One of the reasons I love Brooklyn is because, unlike Manhattan, I can roll into a cute brunch-serving restaurant at 12:30 and only have to wait 15 minutes for a table.\n\nBut I love Pequena for more reasons than it was the real-life location of the above-referenced scenario.  I love the kitschy Mexican decorations hanging from the ceiling (look for the skeleton with butterfly wings!).  I love that I wanted to order EVERYTHING on the menu.  And, of course, I love that my food was tasty above and beyond my expectations!  \n\nI finally decided on the Desayuno Mexicana (scrambled eggs with tomatoes etc., refried beans, and tortillas) with added guacamole (because the people next to me had it and I was having trouble restraining myself from sampling theirs), and it was all really, really good.  The boyfriend had the Chilaquilees Verdes, and that was pretty much amazing.\n\nI am definitely going back.  (I have to try Cast Iron Pan C: eggs on top of refried beans and plantains!)", "author": "Kathleen B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-03-12", "description": "Is it local or is a destination? That's the question you have to ask yourself in both rating and in browsing for reviews. 4 stars for Pequena as a local place on the way home is very different from 4 stars from a midtown dining destination. \n\nThis is for Pequena as a local joint, with the convenience that comes with that and the relatively muted expectations associated with such. First of all, they aren't kidding... it is \"pequena\" (spanish for small for anyone who doesn't know).  So keep that in mind. And if it's at night and you don't want to jammed next to people, order your drinks \"early and heavy\". Pretty soon you won't mind. \n\nOtherwise the food is standard fare that does the job. The guacamole is fresh (i've been there early enough where I had to wait 40 minutes while they sent someone out to get more avocados!). If you and your sig other like mexican, cute place to pop in on a carefree sunday and then scurry her back home and sleep in.", "author": "Ryan C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2007-09-28", "description": "Tough to get over the fact that they don't take credit cards.  But the  place is decent enough.  The food was good, but I don't feel comfortable sitting thigh to thigh w/ppl I don't know.  Yeah I know, i'ts called Pequena, but who'd have thunk it'd be the size of a living room?\n\nIt's right next door to Moe's and the G Train, which makes it convenient for everyone, but w/so many other restaurant choices nearby, it's not my first, second, or twelfth choice.", "author": "Koku K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2007-05-02", "description": "Like the name implies this is a tiny Mexican restaurant. It seats about 16 inside, and has a small area in front for outside tables. Overall the food is very good, the chile rellenos are the best I've had in NYC though the beef ones are filled with ground beef, not shredded. The pico and chipotle is very good. The fajita meat is stewed instead of grilled, but very tasty. Margaritas on the rocks were okay, but tasted like a mix. Service was amazing! The hostess and our waitress were both great. \n\nAs for all of this arguing about 'authentic' Cali-Mex, who cares? Most people I know don't like true Mexican food: menudo, calabaza, lots of hominy and squash, etc. This place is definitely not Baja Mexican, not very much fish on the menu, they serve rice, they use 'American' cheeses like Cheddar and Monterey Jack. Generally the menu looks like typical Tex-Mex, and I generally prefer Tex-Mex over the Californian variety. I have never tried Castro's so I can't compare this to that.", "author": "Devin T."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-07-08", "description": "Visited today again after about a year ago when I had a sit down lunch with a friend of mine.  I enjoyed it then and today I was in the area and decided to have it for take out. I ordered the chicken quesadilla lunch special. I SPECIFICALLY asked the waitress (whom I gave a tip too- for TAKE OUT) to NOT put the salsa, pico de gallo, sour cream or guacamole in the food or around the food. First of all, I am ALLERGIC to raw tomatoes(salsa and pico), Sour cream makes my stomach upset and I hate guacamole. The waitress was nice enough to offer me chips while I waited. They were kind of stale and very greasy. But, I was hungry so I chomped on them anyway. I have had better chips at Qdoba and Chipotle! I finally got my food. Boy, had I wish I would have eaten it there...\nThe quesadilla was completely soggy and greasy at the same time! It was DOUSED with fresh cilantro(a bit too much if you ask me) and some Mexican queso. Not sure what happened there! The beans and rice were not only bland...but wait for it...it had sour cream on it! WTF? Didnt I ask for there to be NO sour cream on my food? Wow! The kicker...after about 5 (knife and fork) servings of the quesadilla (because lets face it, I HAD to eat, i was starving) I cut into what I NEVER saw before in a quesadilla...GUACAMOLE! Seriously? I was so upset,  I could not even finish my meal! Pissed off and I doubt I will return. Food quality has gone down...I would have done better at Cubana Cafe or Habana Outpost. #annoyed", "author": "Tanda M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-06-23", "description": "I love this place - it's cheap, hearty and delicious, and what more do you want out of brunch? The refried black beans that come with most platters are worth the trip on their own - smooth and rich and inky black with a luxurious dollup of sour cream in the middle. yum.\n \nThe staff is generally friendly, though I've had a bad experience with one particular waitress - she completely screwed up my order and then got angry with me for asking her to fix it. Ah well, there's a bad apple in every barrel, and the rest of this barrel more than makes up for it.", "author": "David H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-26", "description": "Cute and quaint.  I enjoy both dining in and their delivery.  As others have pointed out, the service is not always the most attentive.  But the food is quality. Oh and CA$H only.", "author": "Ashley R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-20", "description": "Food is good, staff is great. Only downsized Very small tables and they only take cash :/", "author": "Gian L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-01-11", "description": "Dude, seriously....keep on walking right past this place.  Mediocre food, HORRIBLE service, and definitely cramped not quaint.  Salt, pepper, and hot sauce could not rescue my meal.  The waitress was sleepwalking through her shift and pissed off every customer in there.  Oh, how do I know?  The place is so tiny I could hear every conversation going on in there.  Even if it is the only place open like it was for us one late night, save yourself and go get a bag of chips or something.", "author": "Faye B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-02-08", "description": "Food: Pretty solid stuff. I almost always get the enchiladas and I like them. I don't love them. The portions are huge. When you add in the rice and beans you are going to be full for hours. I think their margaritas are good, my GF thinks they are delicious, in fact she talks about going back a lot.\n\nService: I like the staff. They aren't warm exactly but they are friendly enough if that makes any sense. They are also fast and they get it right.\n\nAtmosphere: I suppose ultimately this the big draw. Like the name suggests this place is tiny. I think there are about 7 tables for 2 and when they are full, the place feels packed. But it's the kind of packed that is fun. The decorations are lots of day of the dead skeletons which make the place feel really unique and colorful.\n\nI don't go often but I am happy when I do.", "author": "Andy S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-17", "description": "I had brunch there. Tight seating Mixed authentic-hipster atmosphere. Delicious food with great presentation. Excellent service. Relatively healthy menu. I'll go back.", "author": "R T."}], "servesCuisine": "Mexican", "priceRange": "$11-30", "name": "Pequena", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "86 S Portland Ave", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/KWpvOOon8kcWehPXnMptDw/ls.jpg", "@type": "Restaurant", "telephone": "+17186430000"}