{"aggregateRating": {"reviewCount": 13, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-01", "description": "OMG!!!!! This is definitely an Excellent spot to eat and the chicken finger with cajon fries is like EVERYTHING!!! Seriously the food is super good and the place is very clean. The people there are very sweet and nice!!!!!!\nAlso the chicken is always plump and the sauces are great my all time fav is the sweet chili sauce!!!\nFrom now till whenever this is a very kool place to get the BEST CHICKEN FINGERS IN BROOKLYN!!!!\nThey live up to their name like 100000%!!!!!!!", "author": "Michelle E."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-04-08", "description": "I'm trying to give this place a chance despite the bland tasting chicken and employees that seem to be more interested in socializing than working.\n\nOn one occasion, they sent my scheduled delivery 2 hours early. What if I wasn't home yet as intended? I'm sure they wouldn't have come back at the right time frame. And on a separate occasion, I scheduled a pickup order, app said it would be ready in 15-25 minutes. I got there in 29 minutes and it wasn't ready! I'd be understanding if it was crowded but there was only one customer paying for his order. I had to wait for my entire pickup order to be made, sauces and all. You know how slow they are with the sauces. Even had a lady come in seconds before me who had gotten her food and was eating by the time they gave me my order!\n\nCome on, Brooklyn. This is way we can't have nice things...", "author": "Octavia T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-03-15", "description": "Loving this new chicken spot! \n\nIf you're going during the lunchtime rush Mon-Fri there can be a bit of a line, it's not a long wait and well worth it anyway.  The chicken is outstanding and the portions are huge compared to other chicken places. The Cajun fries are yummy too and I'm definitely looking forward to going back and getting their cheesy fries. \n\nThis is the old Domo Taco spot, it seems they left the set up and design but updated it for their needs. Still cute and trendy for the area. \n\nStaff is excellent and friendly, glad I found a new go to spot.", "author": "Chre G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-09", "description": "My daughters seems to love this place I don't eat meat so I can't really say anything but go on what they say as far as the food is good from what they have told me", "author": "Shawnee B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-02-28", "description": "I came here to check out all the hype surrounding the newly opened chicken chain that replaced Domo Tacos (RIP). The menu mainly is just chicken tenders, chicken poppers, fries, and chicken sandwiches.\n\nI got the 4 pc chicken tenders with the Buffalo Balsamic Blue specialty sauce (which costed $2 more) with regular fries. The chicken are decent size and taste amazing. The problem I have with this is the price. Along with a glass of Coca Cola, my total order came to $20 which is very pricey for chicken tenders, fries, and a drink. I'd love to come back, but only when I got the money to spend on some premium priced chicken tenders.", "author": "Jacky C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-03-30", "description": "What's not to like. Fresh chicken poppers with great sauces! Prices are average and the line wasn't long at all when I went. A good addition to all the dollar slices in the neighborhood", "author": "Elizabeth K."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-03-05", "description": "Expensive saggy fried pieces of chicken breast. I got 3 sauces, the sticky, ranch and a hot thai. They were pretty bad. It tasted like mayo with color and hot sauce with vinegar. I was better off with ranch dressing from a bottle.The chicken was lightly coated and very well seasoned.", "author": "Alicia C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-04-20", "description": "This place has no sense of urgency. Most of the time it is 2 people in the front and 2 in the back and they are always having side conversations and with no pep in their step. I've been there times and each time it is the worst service ever. Dont dare go in there after 8pm because you'll be waiting for one person to take care of the walk in orders and the uber eats orders. Lastly the last time I went there which was today and will never do so again the whole place had a smell of straight piss i dont know if it's for sanitary reasons or what but it smelled really bad.", "author": "David D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-22", "description": "When you need a some quick chicken in your life this is the place to go. Tender chicken with great sauces to dip your golden crunchy \u0026 tender pieces of chicken too! Fries are salty \u0026 taste fresh! Will eat again!!", "author": "Katherine C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-03-28", "description": "The chicken poppers are so bland no seasoning at all. The sauces dont taste good either. Waste of $17. Never again will I eat here.", "author": "Zeavonn C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-25", "description": "Great fresh, delicious chicken tenders n large popcorn chicken pieces. Great variety of sauces. So glad they opened a location here.", "author": "Lance W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-04-09", "description": "I tried Sticky's for the 1st time today. It was ok. I had the chicken tenders with general tso's dipping sauce. The chicken was juicy but not very flavorful. I'm guessing the sauce is suppose to make up for the lack of flavor in the chicken. The sauce was good though. Overall my food wasn't spectacular, but I'd try it again.", "author": "Akilah T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-16", "description": "Wow they really DO have the best chicken fingers around!  Walked past this location a few times and always wanted to go in.  Finally got the chance today.  Must say the batter has a great flavor, perfectly salted.  But what's better than the chicken is the service! So glad we have a Sticky's in the neighborhood!", "author": "Chris C."}], "servesCuisine": "Chicken Wings", "priceRange": null, "name": "Sticky’s Finger Joint", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "66 Willoughby St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/bW213rSOOrbFzKcPk86QRQ/ls.jpg", "@type": "Restaurant", "telephone": "+17185966181"}