{"aggregateRating": {"reviewCount": 310, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-24", "description": "amarachi!!!!!!!!!\n\nthey have the best brunch menu ever !!!!\n\n$40 unlimited mimosas and you can get sheimp\nlinguini or oxtail??\n\nyoure not finding this elsewhere, they tend to you very frequently and you can upgrade to a hennessy punch.\n\none of my best brunch places for a saturday and sunday. i love the staff and love the attention.\n\nshoutouts to elsa, lady a, effrie and the owner bub !", "author": "Cutty P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-25", "description": "Love this restaurant. \nI like to have them cater my events because guests always love their delicious food like the curry chicken and Caesar salad!\nThe customer service here is oustanding!", "author": "Alysee S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-12-17", "description": "Food is great! No doubt about it. Service is terrible and a little sketchy, though.\n\nSeveral times I have gone and I have gotten attitude from the waiters/bartenders, and one time I went in where there was ONE other table and it took over a half hour to get a pitcher of sangria (waiter was watching her three kids, who were sitting at the bar). Unprofessional and unacceptable when I am spending money for service as well. \n\nCame one time to order hookah, and you have to pay a woman cash, seperate from your check? She also was waiting on tip but never once switched our coal or even checked to see if we needed fresh ones. Lol..buggin. Won't return.", "author": "Stephi L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-05-20", "description": "The food is good but I don't think the portion size match l the price.  The food is too expensive for such small portions.  The jollof rice was good but a little too spicy.", "author": "Lorianne W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-16", "description": "The the music, the drinks, the food everything is amazing. I love this please it was the perfect venue to celebrate my sisters birthday.", "author": "Julissa R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-18", "description": "Great food and service owners are great to work with.  Staff very helpful.  I host a few events here for my Live R\u0026B brunch and afterparty.  Everyone loved the brunch and the mango or Henny mimosa was a sure way to start the party.  Thank You Bubby for allowing myself and my guest to have an amazing evening. You are greatly appreciated.", "author": "Felicia L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-05-25", "description": "It was a brunch that was supposed to start at 12pm. They made us feel as if the venue was overbooked and they were doing us a favor. We were alone in the venue until approximately 3pm when guest  finally started to arrive the service became minimal. Until,  they decided to prematurely kick us out at 5pm when the party was slated til 7pm; after having ordered dinner, appetizer, drinks, and hookah. They threw a bucket on our table and proceeded to kick us out. It was rude and unacceptable. Had we been indecent we would have walked out with out paying because they so abruptly kicked us out and did not even realize that we had not even been served a check. Long story short not worth the hype. And..... there are terrible awkward squishy chairs!", "author": "Alicia C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-05-11", "description": "This is called Linguini in creamy alfredo and this was the worst pasta I had. The chicken was disgusting and the waitress gave me water instead of sprite. Then tells me there isnt sprite after the fact, the only soda they had left was Pepsi and It was warm.", "author": "Ariel B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-05-28", "description": "Visited this place 2 weeks ago for an event(or maybe less than) service was less than a one star from start until finish. Firstly, this establishment was short staff (not enough servers) the server for our section was not patron friendly and appeared to have an attitude. I ordered food at 12:00am and she did not remember until I asked her around the 12:45 mark. She did not fulfill the order correctly and got an attitude once I made her aware that I did not want the order of wings because it was not what I had asked for. She made a smart remark and kept it moving. She was not apologetic. She did not return to other guest to see if they were okay. It was also apparent that she did not remember to put in orders immediately because everything was delayed. I ordered a Hennessy and cranberry.. it was not Hennessy, more like an bottom shelf cognac. waterer down over priced drinks!! Utterly Disgusting! The bathrooms ran out of toilet paper and when I mentioned it to Jonathan the owner, he made a joke \" I went to the finest of schools, and I'm supposed to end up as the tissue boy\" and laughed it off. he may have not meant any harm but at that point I was hungry so the only joke was him. Overall, my experience at Amarachi was horrible. This experience was totally unfair to Laces Inc. brand who continuously hosts nothing but the best parties and will continue to do just that at a deserving and well functioning establishment. P.s. the food was not presentable and the hot sauce tastes like a seasoned vinegar!!!!!", "author": "Tii A."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-12-29", "description": "Nope, nope nope. Staff was but I don't see myself ever coming back here. Tried the apple amarachi drink which was terrible. By the description it seemed like an apple martini but it tasted more like apple juice. The bartender even offered to make a different drink when she realized I didn't like it. She also didn't seemed surprised that I didn't like it. It was replaced with a margarita which was better but it wasn't actually a good margarita. Also got an order of wings that weren't good. Really salty, couldn't finish them. Drinks not good, food not good, equals no reason to return unfortunately.", "author": "Ayesha A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-21", "description": "Really cool spot with great brunch and good music. The food was good as well, but I'm mainly leaving a review for the excellent service. My servers name was Ariane I believe, and she was really great. People can be rude and short with you in the city sometimes, so it was so nice to see someone with great customer service. She really went above and beyond, which made our experience so much better. Would definitely come here again!", "author": "Nina M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-16", "description": "Did the sip and paint for Mother's Day and had an amazing time. Staff was great music was great food was great and the painting teacher was great.", "author": "Ashley G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-23", "description": "I went here for lunch on August 24,2018 with a friend. It was not too crowded which I was thankful for. Upon entering we were graciously welcomed into the restaurant by the owner Joseph. We were seated promptly to a nice spacious table. They didn't have ac on but those fans they have are amazing- they're huge! Most importantly, they kept the place cool and comfortable. Bonus- they were not those noisy fans like you see in a school cafeteria!  We knew what we wanted right away and placed our orders. I had spoken with Joseph earlier via email regarding the lunch rush and time needed for us to receive our food. (In my past experiences African food is a labor of love and you need to be able to take a long lunch to enjoy it) I was informed the food is cooked to order- so expect a 10-20 minute wait, which I found reasonable. \nFood: The food came within 15-20 minutes of us ordering, but I wasn't watching the clock because we were catching up. The food was phenomenal!! I ordered the Egusi and Yam. My friend got the Jollof rice and Shrimp Suya. The food is well seasoned and fresh!! I will warn you the jollof is spicy! If you eat hot food all the time, it won't bother you, but if you're not accustomed to spice it will bother you. It didn't bother us enough to not bear the spice and keep eating because it was that good!! I don't think I've had Egusi or anything like that since I left West Africa almost 2 decades ago- this brought back so many memories to my mind and tears of joy to my soul. This dish was top notch!! I'm so happy we went here for lunch... yet so pissed I hadn't found this place earlier! \nI also had the red velvet cake which was really good! I wouldn't had counted on that at all!!\nDecor: The place has a dark look because it's mostly black furniture with bronze trimmings. I like the space it looks like it would be a good time for happy hour or a party! I'll have to come back and check out their nightlife. \nServer: I didn't catch her name but she was the only waitress there. She was light brown with a top bun and medium build. She was very nice and attentive. Joseph was also very attentive which went a long a long way in my book. I love when owners engage with the customers and really care how you are enjoying the food! Joseph has made a new friend in me!!  \n\n\nI highly recommend this place and will definitely be back soon to try more dishes!! \n\nI ordered food to go on November 8,2018. The food was prepared promptly and was ready when I got there. The food was nice and hot when I got back to work and as usual the serving was massive! I got Eba with Efo- it was so delicious!! I cannot wait until I go back and try the food here again.", "author": "Kia A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-02-22", "description": "Don't waste your time, don't waste your money. Where to start: 1. Food/health/cleanliness: Being in the neighborhood, multiple times I've seen rats come in and out of the kitchen. Is it any wonder then that this restaurant has a B rating? In fact, the wonder is that the rating is even that high. Eat at your own risk! 2. Service: in 3 separate visits, the best experience with service could be described as \"surly.\" The worst was downright rude. 3. Prices: you would think, if everything else about this place is terrible, then at least it's cheap, right?!? WRONG. Overpriced food, overpriced cocktails, even the beers are expensive.\n\nIf I could rack my brain and think of something good to say about this place I would. But nothing comes to mind. Hopefully with crap food, crap service, crap prices and (literal) rat crap in the food, they should be out of business soon", "author": "Josh G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-04-14", "description": "JUST DONT!\n\nWe came in yesterday Saturday around 9:30pm and couldn't get a table (I hear the place is always packed) so we sat at the bar. 90min in and our food was STILL not ready! And they gave us this lame ass excuse that they had 2 big groups of people ahead of us...so what? You are not the first restaurant hosting big groups! I don't care how many people you have in your restaurant, I should NOT have to wait close to TWO hours to get my food! We decided that if we didn't get served by midnight we would bounce. \n\nThe food arrived at 11:40pm! I didn't even have the energy to be pissed off anymore because I was so hungry. The only reason we waited so long was because it was a girls night out so we were chatting up a storm anyway. The waitress was very apologetic and obviously this was beyond her control. She gave us free drinks to soften the blow, which was nice and earned her a tip (my friends did not want to leave any). \n\nNow if you just want to just have drinks there, then it's probably an okay spot. The place is big, the ambiance is fun and the music is really good. But service is terrible, so I will NEVER go BACK! I have been too manyyyyy african restaurants throughout NYC and even the worse ones never made me wait this long and was so disorganized. Black businesses, if you want to be successful you need to stop being on CPT.", "author": "Fatima T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-02", "description": "Can we just say amazing!!!  Delicious food. Great drinks. Hookah!  They even have a DJ which keeps you moving when you eat.", "author": "Fabiola M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-29", "description": "I wish I still lived in NYC, because I would have been back here at least 2 more times this Summer!\n\nMy homegirl and I came through to this place a couple of weeks ago, after hearing the food is really good. We arrived to Amarachi around 3:30pm on a Sunday, and the crowd was pretty decent. It wasn't overly packed and the music wasn't TOO loud to where you couldn't hear anything. Since we had reservations, we were swiftly seated and were automatically greeted by a waitress. Unfortunately, I can't remember her name but she was very sweet and attentive (something tells me her name starts with an M?). \n\nSo my friend and I placed our orders, and were happy to find out that you can get an entree and your OWN PERSONAL PITCHER of mimosas for $40. Say. No. More. I ordered the shrimp suya with jollof rice and my friend ordered salmon with spinach and a waffle. My meal and her meal were both delicious! In terms of mimosa pitchers, I got the mango and she got the guava. Both were delicious as well.\n\nBy the time we left, we were definitely a little too turnt and getting to the next function was a hilarious adventure. But overall my experience at Amarachi was a good one and appreciated our waitress for really being the best part of the experience, aside from the food. The only reason why I deducted a star is because the bathrooms were not as clean as I expected. They weren't absolutely horrendous (like gas station gross) but they could have been a lot better, and could use a mirror in there as well.\n\nNext time I'm back in my home city, this is definitely a spot I'm hitting back up!", "author": "Alyssa A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-27", "description": "Pros\nGood food--seasoned well\nConvenient location right off the Manhattan Bridge\nBrunch special\n\nCons\nCurt staff", "author": "Rosa R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-01-28", "description": "So I booked Amarachi to celebrate my husband's 50th with 28 family \u0026 friends. Paid for event 3-4 weeks prior. They told me we will have a private space but what they didn't tell me was that they had another event booked for same time. Only the other event's function was talking and yes with a mic so we had to be subjected to it the entire time. When I spoke with the Owner he basically said he could accommodate both and they paid $$ to utilize space. You are known for music and these people basically was dressed for a banquet WITH a Program and AWARDS!!!!!!\n\nI told him had you been forthcoming with information I would have selected another venue. He pacified the situation with a bottle of champagne. Amarachi is about the $$$$ not its customers. Don't be surprised when you book for a party you get NO dancing and NO music. They will book another event with yours in a second to make the \"$$$$$\". Sad! We made the best of it but NEVER again.\n\nYes I started with 25 and emailed you 1 week before about the increase.  I was there at 7 but all my guest was there in time for the surprise.  What you seem to be missing is that had you told me about the \"other\"event I would have politely passed in your restaurant.   At anytime my $1700+ event did not warrant your time allotment, had I known I would have made other arrangements.  Your brother told the other party paid extra to have their event and because they had the space for mines as well, they booked both.  I can only determine from his remark was he took the opportunity to make the money on both events.  If you were in my shoes, you would have felt the same way.  My family put flowers, and plate charges to enhance the table setting.  No balloons, no decorations.  My feeling like yours has every Right to be Respect but no necessarily agreed upon!", "author": "Janice P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-27", "description": "This place is jumpin! Came here for brunch on a Saturday with my mom and close friends for a mini girls outing. We all got mimosa pitchers for ourselves. It's safe to say we were all lit AF. After finishing our dinner we all got up and started dancing! It was literally a movie. Can't wait to go back and bring more of my home girls.", "author": "Chrissie D."}], "servesCuisine": "American (Traditional)", "priceRange": "$11-30", "name": "AMARACHI", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "189 Bridge St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/1LakWYHK0MG_HhfpLxK03A/ls.jpg", "@type": "Restaurant", "telephone": "+17182221010"}