{"aggregateRating": {"reviewCount": 310, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-29", "description": "I must say I was really unsure when my husband brought me here on Friday night for my birthday.  I walked in and it seemed like a private party was going on, (it was actually just finishing up) I kinda felt as if I was at someones family home, but then my waiter walked over.  She was extremely pleasant and explained a friend of the restaurant had passed away and the repast was just ending.   She was extremely helpful and she made great suggestions.  When she walked away to put in our order we were checked on by 1 or 2 people to make sure we had what we need and we were being taken care of.  It turned out that yes, I did feel like I was at a family restaurant and was treated as such...  The food was excellent, really well prepared and delicious and I actually stepped out of my comfort zone ordering the fish stew and not my usual oxtails. The music was great!  Not too loud, the energy of the place was high and the prices were moderate.  I had fun and I will be back!!!!", "author": "sandra m."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-11", "description": "I love this place!! The food and atmosphere are great. I've gone her for just a drink, my daughters bday dinners, high school reunions, etc. whatever your dining needs are Amarachi can provide!!!", "author": "Lena H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-30", "description": "This is an awesome restaurant \u0026 lounge with a full bar. The décor is modern, cultural and beautiful accentuating an open airiness with lots of large windows and high ceilings. As soon as you enter, you're happy to be there. The food is absolutely delicious, and the drinks are potent, and all are reasonably priced.  No matter what reason you decide to go, brunch, lunch, dinner or a private event, the atmosphere and staff service accentuate the experience. I really enjoy dining, drinking and attending events here, and I'm always excited when planning to return. Try it. You'll like it.", "author": "Leah J."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-03-20", "description": "HORRIBLE SERVICE!!! UNPROFESSIONAL. DO NOT COME HERE FOR BREAKFAST/LUNCH/DINNER!\nThe shift manager, Devyn, is unprofessional and rolled her eyes at my guests. We had to walk out and go to a competition (Piquant) in order to be served. We NEVER received our meal. There was a promoter (Butta) hosting the party. He was rude, aggressive, disrespectful and mean. I will NEVER walk into this establishment again. If you decide to eat here go there at your own risk. I would leave zero stars if I could but the Yelp app disallows this.", "author": "Desiree J."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-01-23", "description": "This will be my first and last time here. My friend and I got a table, while we waited for our entrées I went to the bar and ordered a happy hour drink and one appetizer. After we got our appetizer, the manager, Tyrese comes over and tells us that when you have a table you are not allowed to order Happy Hour from the bar. He says that being that it's already paid for, he's just letting us know it's not allowed, in a very arrogant tone. Whatever discrepancies there were are supposed to be taken up with your staff, not your customers. To add to this my food came out first, then 30 minutes later the manager comes back to let us know that they didn't have what my friend ordered. I never touched my entree, so instead of selecting something else we left. Go customer service is the key to success in the restaurant industry.", "author": "Akeylah B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-07", "description": "I made a reservation on a Saturday night for my mom's birthday.  Arrived on time but had to wait a few minutes due to an event that was concluding at the restaurant.  Staff was apologetic so that was fine. I do like the location and the ambience of the restaurant. There are tv's on the wall so you can watch sports events. Our waitress was very nice and the food was good as well. From the oxtail to the Alfredo, no real complaints,  just a little bit of a wait. We definitely enjoyed the music as well, good mix of hip hop and Caribbean music. Keep in mind that gratuity is included in the bill. Overall it was a very welcoming establishment.  Will visit again.", "author": "Melissa A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-07", "description": "Black owned restaurant here! This place is AWESOME. Had a high school reunion here and it was the most fun I've had in a long time. The food was just delicious and the DJ played the best music. This is one of those places that you hope no one finds out about because you don't want it to get too crowded, but at the same time you want everybody to find out so it stays here forever. Parking right out front and not far from downtown shopping.", "author": "La La J."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-06-10", "description": "This is the place that ex-con (on parole for murder) got into an altercation, starts waving a gun around and splits out the door... mins later NYPD guns him down as he turns the gun on police, literally about 50ft away from the front door!   Happened about 2 months ago.  They've been offering deals to everyone in the neighborhood especially NYPD \u0026 FDNY... more of a night club/lounge or \"player's club\" as it would have it than a respectable business.  Tilapia de la Nigeria?  C'mon now!  Everybody knows that's just a fancy name slapped on a poor ass piece of fried fish.  We have a saying down south, \"you can take the girl out of the trailer park, but you can't take the trailer park out of the girl!\"", "author": "Aaron M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-25", "description": "This place is the best brunch place in Brooklyn and food is amazing and the atmosphere is great . Whether its brunch , lunch or dinner . This is the place to eat and kick back and relax in downtown Brooklyn . The staff is amazing and very friendly and the service is great .", "author": "Mikey C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-14", "description": "The oxtail with the butter beans, spinach and jollof rice was amazing. The oxtail nice and tender and flavourful. The house punch and Lagos punch are both worth it. The atmosphere is great and Kia was the best hostess/waitress/bartender ever. And lest not forget the wings. Ughhhhh no complaints.", "author": "Lola B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-24", "description": "My husband and I came here for a retirement gathering.  From the door, the manager was very welcoming and engaging.  While we were waiting for the other guests to arrive, the Dj and the videos that were playing kept us jammin'.  The wings and happy hour cocktails were great also.  The ambiance was really cool and I look forward to coming back again.", "author": "Michele E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-13", "description": "Came here earlier today to watch the Giants game and ordered the wild salmon with jolof(?) rice.  Both were well seasoned and a little spicy.  Very tasty!  I will definitely be back again.", "author": "DR W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-24", "description": "I went there to meet a friend while on a job. I was staying right on the corner at the Hilton on Flatbush and seriously was surprised I found heaven at a cheapish reasonable price but sooo good! The jerk chicken wings were the BEST I've ever tasted and the free punch with the check-in was yummy, sweet, and strong!!!! I loved it! But those wings though! We got two orders it was so good. Can someone mail me some?", "author": "Kaleila J."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-09-04", "description": "Third time here. Came for brunch. Suya and Joloff rice was good and the french toast hit the spot. Wasn't too pleased with my mojito, the mint and lime weren't muddled and I think I tasted a hint of Elderflower. Waiter was nice and professional but service is still slow. I don't think it was on him, just need more staff to accommodate the large parties at brunch. Parking was surprisingly easy. Will keep trying - food good and really nice atmosphere.", "author": "Ayanna J."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-05-19", "description": "No,no,no! Now, this is definitely not a place I'd frequent (mainly due to distance) but I must say that it was a terrible first time so I definitely won't return. \nAlso, to be quite honest this review is based solely on their ability to handle a \"dinner party\", not a regular night out at the lounge.\nThe two stars given was for decent music and atmosphere otherwise I'd say NO STARS!\nFirstly, the service was terrible. We had a dinner party of maybe 20-25 and had one waitress! Poor thing didn't know if she was coming or going.\nI ordered oxtails at approximately 10p but was told they \" ran out of oxtails\" around 11:45p (EXACTLY) and my appetizer????? Calamari???? It came out after I ate the curry chicken that must have been African style because it was nothing like any curry I've eaten from India or West Indies. I couldn't even finish my small plate. \nI ordered a coca cola and a sprite came out.\nI was ready to kill somebody I was so damn hungry.", "author": "Michelle W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-21", "description": "Went here for Cinco de Mayo with some friends. The venue was very nice and spacious and they were having drink specials for tequila shots, margaritas and beers. We ordered several margaritas, I didn't like the flavored margaritas so when I got my next one I ordered plain and it was much better. The food was good however it was disappointing that they had no oxtails which I wanted to try. I had some of the appetizer wings and for entree the curry chicken and I liked it a lot. Most of my friends liked their dishes. The staff is very welcoming and hospitable and the bathroom was nice and clean. I always like to see that when I'm at a restaurant. Overall I think I'd go back especially since I heard that they have parties there as well.", "author": "Gabrielle A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-01-10", "description": "I arrived at Amarachi at 715pm. I was there for a birthday event with a party of 12. I recommended the venue to the birthday girl who was in town from Atlanta. We were seated at 745. Everyone ordered food and drinks.  A half hour later, 2 plates of food came.  For the next half hour,  no other plates came. Around 9, most of the other plates arrived except for mine. The waiter assured me it was coming up.  A half hour later,  it finally came.  They brought the wrong plate. I politely asked for the manager.  He came to the table and I told him of the situation. He said don't worry they are bringing the correct order.  I replied \"Thank you.  But now it's been two hours. Everyone has eaten and is ready to go. It's not fair that now they have to wait for me.\" Instead of apologizing for the poor service he responded do you want to cancel your order. I reminded him that I had been patiently waiting for my food for 2 hours and I was pretty calm the whole time. Canceling my order is not a solution when I'm hungry at your restaurant. I  told him that he should figure out a way to make amends for my wasted time. He replied that he would not comp my meal because as long as the food was fine, the amount of time I waited and the overall quality of the service shouldn't matter. I was shocked because still he hadn't apologized and was being very rude in his tone. I also told him that had I been a white patron, he would likely not talk to me so dismissively. He walked back to the kitchen and then returned to my table and went to speak to the birthday girl. He told her he was canceling my order because he didn't like the way I was speaking to him. I was like fucc that,  I'm out. But before I dipped,  I reminded him that he should be careful who he speaks to in such a nasty way. I was there to support black business despite the over priced Nigerian food that I could have made at home.  I let him know that I wasn't some unreasonable ratchet but rather very well educated Nigerian who was happy to patronize his business. I left the restaurant as my friends dealt with this man inside. My friend reminded him that I was the reason that we were all there that day and told him how he handled the situation poorly. He attacked her calling her childish and irrational.  This was the worst service experience ever.  Sorry goes a long way but this pig decided to attack a table of women.  I really enjoyed the waiters so I feel really bad that they have to work for him.  Avoid the drama here and find something else to eat.", "author": "Ace L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-05-22", "description": "This place gets ZERO stars. The server we had was very inattentive and had absolutely no customer service skills. I attended a party for brunch and there menu was prefixe. We had to wait over an hour for our entree with no apologies or updates on our Food. When asked how long for our food, the waitress caught an attitude and snapped at us that the food wasn't ready yet. Every question about substitutions was answered with \"we don't do that\". They server did not even try to be accommodating. And to top it off The food was very mediocre. I will NEVER return here and anyone who asks will definitely be told not to come here. Patron beware!!!!", "author": "Martini N."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-10-28", "description": "So one star because there is actually a contact person who is reliable and picks up. \nAnd the second star is because I like their drink menu \n\nMY BREIF EXPERIENCE WITH AMARACHI...\n\nFor my 25th birthday, I wanted to celebrate at a black owned restaurant and because I heard Amarachi was a great place when it came to food and drinks, I made reservations. I was told there would be a fashion show that night and given a number to call and an individual to speak to regarding any concerns or changes I would like to make. I initially planned to have fifteen guest, but my group of 15 grew to 20 people.\n\nI was told I would have to pay $500 in order to have my guest seated together to host this dinner, not for a seprate room space, but just for a section of the restaurant to seat 20 people. LIK WHAT!!!! So i asked if gratuity would still be added on the list, and I was told yes. Because I reiterated the price in such shock, the manager stated \"I will throw in a bottle of champaign\" HUH???? I was just utterly disappointed that a space would cost $500 dollars. Amarachi is restaurant not a club, you pay for a section and bottle service at the club, and the fee for the space is for service. \n\nIt is just disappointing that Mr. Chow a five star renowned restaurant dos not charge $500 dollars to service a group of 20 people together, but Amarchi does. This is why it is difficult to support black business. I am EXTREMELY mind blown that I was told I can make reservations for 20 people, but they would be seated at different spot of the restaurant??? LIKE WHHHHHHAAAAAAAATTTT?? WHERE THEY DO AT? Apparently Amarachi. \n\nBY THE WAY I DID GO EAT THERE!! People continue to say the food is good, but I thought it was alright. The food seemed pre cooked, WELL  a majority of it. In addition, the server was unaware of the details of the food. The food is not pricey. What I do like IS the variety and creativity of the drink menu. But Amarachi, step your game up... Especially if you want to charge $500 for a 'space' to have dinner in your restaurant with a large group.", "author": "Nerija R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-22", "description": "My husband and I went for the first time today and the food, ambiance and staff were all amazing! We'll definitely return.", "author": "Sauda F."}], "servesCuisine": "American (Traditional)", "priceRange": "$11-30", "name": "AMARACHI", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "189 Bridge St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/1LakWYHK0MG_HhfpLxK03A/ls.jpg", "@type": "Restaurant", "telephone": "+17182221010"}