{"aggregateRating": {"reviewCount": 310, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-07", "description": "Having enjoyed the owner's Amarachi Lounge for years (hung out, party there fully catered by them, events) I decided to drop by for lunch w a friend. \n\nFirst of all - we were met at the door w their signature service - courteous professional cool. Great vibes. Love the space - art, family, open, lots of light and big screen tvs and sound to boot. \n\nThe food - I peeked at the summer salad as the chef was slicing the fresh mango and berries...I should have taken a pic but we threw it down so fast...delish.\n\nLunch - I had the Bubby Burger cooked perfectly, season w lots of spices, super fresh and juicy. My date had the salmon omelette w hash browns. Amazing as well. Bonus-I think they said they do breakfast til 4?  Yup.\n\nIn my line of work I tend to convene/attend a lot of mtgs w coalitions, partners, etc. The right space is so key.  I did a thorough look w this in mind and the pics do not do this place justice. Small or larger groups would work very well.  I'll be looking to use this spot in the near future.\n\nOverall excellent. Enjoy!", "author": "Toni L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-12", "description": "Fisherman's soup and Suya- that is all I have to say about this place. Like Junior's on Flatbush Avenue is a destination for cheesecake, Amarachi Prime should be a destination for Fisherman's soup and Suya. These two menu items deserve to be world famous.  \n\nYou don't believe me, then go there and try for yourself. The proof is in the meal! \n\nNuff said.", "author": "Kachi A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-18", "description": "This place is a hidden gem! The food is delicious and the service was wonderful. Lady A. was attentive but didn't hover over us. The Amarachitini (mixed drink) was sooo good that we ordered seconds. We had the steak and eggs and it was seasoned well and cooked perfectly. I even ate the potatoes which I don't normally do. They played great music while we were there. A nice mixture between grown and sexy and contemporary artists. Will definitely be back!", "author": "Rolandria J."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-03-05", "description": "The food was delish! but the service sucked!\nLet me tell you how. A reservation was made for a Sunday afternoon weeks before the actual date. Ive only seen the inside of the restaurant so I assumed thats where our group of 8 will be served. Wrong. We got to the restaurant ready to be seated and a baby shower was being hosted there. I wasn't sure what was going on so I asked the one of the staff if we needed to reschedule. We didn't, she walked us to another part of the restaurant to be seated. We were seated in what looked like a makeshift outside/inside area in the back of the restaurant where strong incense burned a women sat to cut or shave potatoes..... and flies swarm around the trash area about 10 feet away. We was not happy but we sucked it up because we were extremely hungry for our brunch.\nThe menus came out.... 3 different menus (very confusing) and our dishes that we eventually did order came out in 25-30min  intervals. This meant that by the time I received my meal \n(which I decided to take home) The rest of the party was finished or almost finished their meal. Needless to say we didn't order desert.", "author": "Cheretta S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-04-16", "description": "I've been here twice. The first time I came, I had a great experience. For one, there was a large group of people who were having a gathering, so us other patrons who were not a part of the party, were limited to an area just overlooking the restaurant. The service was pretty great, our waiter was very attentive and sweet. The drinks were very very delicious! I had a mojito, and my friend had what I think was called the \"ghost rider.\" After a few sips, my friend was more than buzzed. So beware if you decide to order the ghost rider, as it is pretty strong! The music was awesome. I think they played mostly reggae and then towards the end of the night hip hop. I wished they had a bigger space for dancing though. Overall, my first experience was great. The second time I went, was unfortunately not so great. The place was super packed, and service was not as great. This time I decided to order the black pepper soup with goat meat. When it arrived, the meat tasted very old and not fresh! My friend also ordered and her meat tasted just as rotten as mine! Our other friend ordered chicken and fries, which were pretty good. The drinks this time, were not  very tasty, so I was unable to finish. Overall, Amarchi is not a bad spot. And if you are looking to hear good music while having a few drinks, this is a place you can count on.", "author": "Alexus S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-08-22", "description": "Lets see if i can make this short.....the place is beautiful definitely a date night vibe but also great for a hangout...great music. went with my girlfriends for Dine in Brooklyn (similar to NY restaurant week)\n\nSo first off, the restaurant was advertised and part of Dine in Brooklyn but when we asked them about the pre-fixe menu they had no clue what we were talking about. then the manager told us we can only have the Cesar salad and choose any non-lobster entree and desserts consisted of carrot cake and red velvet.\n\nAfter we got through this part, we each got the salad and our entrees. My friend wanted to know what other dressings were available and the young lady went to check and took about 15minutes to come back and let us know. The bartender came over and told us about happy hour since our waitress (who i am assuming is new didn't tell us). We ordered margaritas and mimosa. Honestly drinks here are not great at all, even for happy hour i wish i had just stuck to water.\n\nSo now we're waiting another 12 minutes and the waitress comes out to say there's no Cesar salad we asked if there are any other options she said no, so we said well how is there no salad. she stated they went to the store to buy the lettuce (ummm whattttt). Our food came out about 40-50minutes into us being there and omggggg it was borderline cold, the only hot dish was fish stew and we weren't sure at this point if Africans eat cold food but we couldn't believe that they would serve this. \n\nA couple next to us heard us speaking and said their food was lukewarm as well and they weren't happy with their service. we sat and chatted for a bit with them and realized that this place although really beautiful had horrible service and cold food. Maybe they were having a bad night or just reopened i am not sure but i would never want to go there again. My friend said she will try their brunch. Good Luck chica !!!!!", "author": "Jina J."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-05-21", "description": "We went for a bridal shower. There were three events that day Sunday afternoon it was under staffed the waiter was the bartender. The waiter was rude. He served 20 people. We waited 2 hrs\nFor our appetizers and an hour for our entree. The bride was not happy she had words with the \"manager\". \nWe really couldn't tell who managed what. Horrible I would not recommend it for an event at all. The food was ok. It's a shame it's a nice looking place but the service was terrible.", "author": "Thayanna M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-03-07", "description": "It was a snow storm the day we went so the place was not packed at all. It was a decent little gem in Brooklyn. \n\nWe went for a birthday party that already had a preplanned meal picked. Jelloff Rice with no meat and fried chicken in some type of sauce. It was pretty regular food. My PIC wasn't that thrilled with it. \n\nDrinks were average. Tasted average and had decent prices. Lemon drops were 5 per shot. I ordered 2 different drinks and they were out of a couple different juices. Which was disappointing. \n\nThe DJ was good and kept a good mix playing. There was just no one there to enjoy it.\n\n\nAll and all we had a decent time. We would go back maybe in the summer when there is more people.", "author": "Khiah R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-30", "description": "Great ambiance, food and customer service. Highly recommended. Came here for a friends send off event and the pre-fix was affordable and top notch", "author": "Yoossouph K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-05-21", "description": "Restaurant is 8 on a scale of 10.   The brunch Prefix  menu prices are a little expensive for the average diner.  the back restaurant area is nice and quaint however a separate entrance and more lighting would be a perfect setting for a small to medium event.  In addition, complimentary appetizers should be offered while waiting for the main meal to be served.  Location can easily be missed...more street signs should be more visible.  Overall this is a nice venue for your affair and/or drop by for dinner.", "author": "Shelia K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-13", "description": "This review is only for the bar and staff. I haven't tried the food yet, but I had such a wonderful time at Amarachi's Happy Hour which goes until 7PM! The bartenders and staff were so friendly and funny! The look is loungy but the feel is neighborhood go to spot. I'll definitely be back!", "author": "Danielle B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-06-05", "description": "I celebrated my undergraduate graduation and move to graduate school here Sunday. I was pleased with the food but unfortunately the lack in service overshadowed that. We had a 5pm reservation for a party of 23 and when my first guest arrived, the server complained she thought the reservation was for 7pm. Then my guest watched as she placed the forks on the table touching the part you eat with. I had 3 guest running late so I placed their orders. Our server didn't write much now and sort of chastised me in front of my guest about not telling her about the third order. We were given 2 different drink menus so I order a drink from 1 menu that has the same name on another and is different. I'm vegetarian and ordered the curry chic peas but got curry chicken. I was almost just going to eat it and risk getting sick so the server wouldn't chastise me for mishearing. Two people order the salmon burger \u0026 fries and when everyone received their food and they didn't, they reminded the server of their order. She again tried to blame them for not telling her they also wanted fries when it's listed on the menu as coming with. Unfortunately we were finished eating by the time they got theirs. Then when we ordered dessert, we received it in togo containers. It felt as though we were being kicked out. They were sitting up for an open mic night and we were interested in staying for it. When we asked for utensils we got the plastic to go sets. My guest were turned off and left. My dad and a couple of friends decided to stay and order drinks to watch the open mic and basketball game on tv. It took about 15mins to get someone's attention so we could order. Once drinks came she also bought the check. We didn't need anymore hints. We left and went to another establishment. I purposely bought my family \u0026 friends here to emphasize the importance of supporting black business and they expect a nice experience out of me because I worked at a fine restaurant but I was kind of embarrassed. Giving 3 stars because food and music was great, service wasn't.", "author": "Taylor H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-18", "description": "Come meet me here Tonight to watch the game.I will be there for happy hour specials on food and drinks.See me in the corner eating jerk wings lol", "author": "Shorell S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-09", "description": "Amarichi was nice because of the ambiance,the service, the food and the price. I went there for dinner with my cousin and we just felt so at home and welcome. I ordered the tilapia with jolof rice and it was so delicious and the presentation was great as well. I would definitely go back and order that again...and next time I want to try their mixed drinks...;)", "author": "Monica S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-28", "description": "came here last night 10/27 with groupon for 4\nour waitress Rachel ,she is amazing ,very nice,friendly and professional \nfoods are great here and our champagne is great\nthis is the place something difference than other ,only thing i will change is just the music little lighter will be great \ni hope i can get Rachel to be our waitress next time", "author": "Johnny L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-04-07", "description": "Ride by this place all the time coming from work, looks exciting inside @ night.....so its BLACK OWNED RESTAURANT MONTH \u0026 they were on this list of restaurants offering a 3 course pre-fix meal for 30dlrs....the place is beautiful inside very nice ambiance...surprisingly like menu pre-fix menu wasn't bad..\nCeaser salad...wings or fried calamari...shrimp,salmon or curry chicken for your entree...the waitress was a young happy girl with a friendly smile, I assumed she was new to the entire waitress thing NEVER had a waitress so sweet \u0026 innocent...anyway we ordered drinks they came fast when she came back with the drinks we ordered all of our food...the salad came it taste like its pre made for the day...we ordered both appetizers the wings were good the calamari was a waste so bland....I had the salmon my sis had the curry another fail...the salmon came with white rice \u0026 spinach the rice was scorched @ the bottom a little bit you could taste it, the spinach was bland \u0026 there was more red peppers than spinach + they only gave a table spoon of spinach....the curry chicken didn't taste like ANYTHING but some green chicken...SERVICE like a said the waitress was a sweet young woman, however her service skills were bad she took WAYYYYY to long to come back more than 1 time I had to wave her over @ 1 point she was standing @ the front desk with a another service looking in his phone...I personally feel cell phones should NOT be allowed on the work floor of any business dealing with the public...long story short I will never waste my money or anyone else's money going back to Amarachi", "author": "S M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-05-20", "description": "Came here with an open mind and an empty stomach ready to enjoy the food that I've read so much about. Our party of 12 arrived at 7:30 to an empty restaurant and 3 hours later, we are still sitting here waiting for our main course. The service is absolutely horrendous! If you're looking to waste your time this is the place to go!", "author": "Richard S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-04-02", "description": "So much potential and Maxine one of the owners seems like a really great down to earth lady. But there's not much going on for lunch even on Fridays and they are constantly out of items (vermouth for martinis. Come on.) Also my friend got a \"margarita\" which was literally some clesr syrup in a glass. Food is decent and place looks nice. Just try a little harder and hire people who know what they are doing.", "author": "Chris B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-13", "description": "This place was awesome! The ambiance is nice and the food was great - I went for brunch! (French Toast with eggs and bacon; Ox Tails). Maxine was a great host and very accommodating. The drinks (Pitchers of Passion Fruit Mimosa and Mojito were GREAT!", "author": "Jazzy C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-08-20", "description": "This place is cool for big parties. The space is huge and the dj was on point paying everything from top 40, reggae, kompa, and old school music. While at the restaurant, you can get a free fruit punch drink by using yelp lol. The drink was a little strong for me...I was expecting a more fruitier taste. I ordered the tropical cooler which is as good as the name is. We were warned by the staff that the wait for food would be kind of long because there was another party bugger than ours that was also in attendance..and they weren't kidding. Our party size was about 15-20 people, and 2 of us (myself included) didn't get our entree and drinks well into dinner which definitely sucked. However, our meals were delicious. As an appetizer, I split the sweet chili wings with a friend. It comes with 8 and they were very tasty. I had the Optimus prime steak (medium well) which was awesome but because it took so long to come out, I barely ate it and had it packed to go. I wanted to try the cake in a bottle but they didn't have it available at that time so I tried some of the red velvet cake. As a self proclaimed connoisseur of cakes, I would pass. It's just a standard red velvet cake. I would come back here for drinks and appetizers but maybe early enough to beat the crowd if I plan on getting an entree.", "author": "Rebecca B."}], "servesCuisine": "American (Traditional)", "priceRange": "$11-30", "name": "AMARACHI", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "189 Bridge St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/1LakWYHK0MG_HhfpLxK03A/ls.jpg", "@type": "Restaurant", "telephone": "+17182221010"}