{"aggregateRating": {"reviewCount": 310, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-11-17", "description": "Great food. I had the whole Whiting or whatever the fish was. It was spicy and really good. I didn't care for the grapes though, but they gave relief from the heat of the dish! The food type seems to be Nigerian with typical basics like fried calamari and interesting Asian influenced dishes. The atmosphere is like a club, and the tables were too large and shaky. \n\nThe waiter was honest but not very knowledgeable like a club security guard that suddenly decided to wait tables - he was nice but hung around too long asking questions about me and my mom and why we were there. He also insisted that I confirm that I understood I'd be getting a fish with the head attached. I think this gives some insight into what kind of people come in. The menu clearly said a whole fish. Diners across from me and my mom were eyeballing me and some other guys came in just for drinks and were dressed very casually like they were going to just chill. So overall not really upscale dining, although the food quality has the potential to be. Just get some actual waiters and matching plates?\n\nThe menu is also oddly organized and the only wine was listed as \"red wine $49\" or something along those lines. Ask questions about what wine you can get by the glass because they actually had quite a few options. \n\nMy mother had the salmon which was great! The red velvet cake was good, while the chocolate cake was dry as all hell. The calamari was also good. I was advised that the plantains are hit or miss so I didn't order them.", "author": "Erica v."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-17", "description": "Food is great and drinks are good for those that are drinkers. Great atmosphere for groups", "author": "Curcel R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-01", "description": "I love this space... almost as I love the Family and Team behind it. I remember hanging at Amarachi when it was on Franklin and even then it was always amazing. The owner is constantly looking for new ways to make the place different and more amazing.\n\nWell now that they've added food, an outdoor lounge and have a larger space to work with... they have taken everything to another level. The menu has a lot of hidden gems within,,, (Suya w/ Jollof Rice, Bubby Burger, Pepper Soup and Fisherman's Seafood Stew being among my current favorites) and is always being improved. The Bar has something for EVERYONE to enjoy, whatever you might be drinking... and don't forget to check for their specialty signature drinks!!! The space has a great ambiance and the DJs with the Music, Video and Light shows are AMAZING and always on point!!!\n\nIt may be a little off the beaten path, and may take a little more effort to find the first time, but it is definitely worth it. At the end of the day, once you get to Amarachi you will feel like family and be back a lot more often!!!", "author": "Ali E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-11", "description": "Had a great time last week during my first visit to Amarachi! It was hot as Hades outside and the second I stepped into Amarachi I was welcomed by a cool breeze and a wonderful cocktail. I came to check out a new burlesque show called Brooklyn Bordello and had a wonderful night--for just $50 I enjoyed a 4 course meal (including the aforementioned cocktail) and was treated to an incredible live show! Amarachi was a bit difficult to find since I'm not familiar with the neighborhood, but once I was there I didn't want to leave!", "author": "Laura M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-10-20", "description": "1 star for being a black-owned business\n1 star for the servers who are nice\n\nThe rest of the experience was subpar on both occasions. The food is clearly pre-cooked, over salted and served lukewarm. The decor, furniture and general set up gives the impression of an old school Afro-soul restaurant that has seen better years, despite the restaurant only being at the location for about 2 years.\n\nWorst of all, during a Monday night visit to watch the games they were hosting an open mic. Cool. HOWEVER, the host kept admonishing anyone who hadn't bought a drink or ordered from the menu. Scolding everyone in earshot in the most tacky fashion. NOT COOL. Who talks to people like that. Me and my date, who had ordered both drinks and food, were disgusted, quick to leave and NEVER come back.", "author": "Chanel D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-21", "description": "A good look at their new location. Fancier, closer to transportation and the crowd is definitely mature...just the way I like it all the way around. \n\nMy wife and I went and celebrated a long-time DJ friend Nino Torre spinning there. He did his thing as usual, playing a little R\u0026B, house and old school. We danced a bit and observed a bit :D \n\nI'd return to check out the food as we didn't eat the night we went-about Sept or so 2015. Looking to work with them on other levels now! ;D", "author": "Freedom J."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-03-20", "description": "My partner and I are planning our wedding reception and were trying spend most of our money with black owned businesses. I looked on idontdoclubs.com and found this spot. I contacted them and their pricing and menu seemed similar to what we were looking for. So this weekend my partner and I decided to go check out the food.\n\nWe made reservations to have brunch through opentable.com. I wasn't sure what time they opened but 10 minutes before our reservation, we arrived and decided to go in. We walk in and are hit with some intense incense burning near the front. They tell us that they are still setting up so we leave and go for a walk. We're gone for about 15/20 minutes and then return. My partner goes in to see if they're ready and they don't even acknowledge him. He decides to walk back out and call them. They tell us that we can come back in and wait but that they're still not ready. So why did we make reservations?\n\nWe go back in and the woman seems to have an attitude as though it's our fault she has to be at work right now. She seats us in this cramped corner and leaves. My partner and I are quite tall so we decide that we'd like to move to a similar table that has a little more space. Due to the already poor service, we get and move on our own. When she comes back, I explain what happened and ask if it's alright. She tells me that they are having an event but that it's alright for now. (Didn't need to know all that. It was a yes or no question.) Let me also note that we are the only So we order a whole bunch of food so that we can taste a few different items to better make our decision. She asks me about drinks and I state that I hadn't even looked and could we have a minute. \n\nAfter about 5 minutes of waiting for her to come back for the drink order, I give up and walk up to her. I tell her that we'd like an hour of unlimited mimosas. She tells me that because of the event, that's not possible. At this point, I inform her about the reservation and state that I wish someone would have notified us that this was not possible. (I also stated to my partner that even if they hadn't done that, why not just tell us that they're not open instead of taking us through all of this.) She then blames opentable.com and tells me that we can order a single glass of mimosas if we'd like. I decline because that clearly would be stupid on our part. Why pay almost the same price for one drink when we were about to get unlimited drinks for an hour for $25? I walk back to the table and explain what happened to my partner. We decide to stay at this point only because I feel bad since we already ordered the food. The waitress comes back to our table and gives us 2 mimosas. No explanation. No apology. And doesn't even tell us if these are on the house or we're paying for them. I take one sip and don't like the taste (I love mimosas so not sure what was up with this). \n\nSo we sit... and we wait... The staff are standing by the bar having their own personal conversation.... Inappropriate personal conversation. I can't tell you what they talked about but I'm going to believe that saying the n-word multiple times (not derogatory but just through the conversation) is inappropriate when you have customers... even if we are the only customers and are black ourselves. But during this, I also see at least one of the cooks come out a few times to socialize with them. I run through my head about what we ordered questioning if it could be left to cook while he's out here... Or maybe there's more than one cook. Who knows. But after some time, my partner asks what time we got there because it's now 11:40 with no food, bad mimosas, and horrible service. We wait a little longer when the waitress, who has now shaken off her bad attitude, comes to inform us that the kitchen did not get our order so they hadn't started cooking it. Maybe I'm mistaken but did this place grow to the size of a Cheesecake Factory while I was sitting there? Did you not think it was weird when he kept coming out there and hanging out with the rest of the staff? At that point, I'm done and we decide to leave. She said that it would only 10 more minutes but I was totally over it and had only stayed because I thought the food was already being prepared \n\nIt's up to you but I will never go there again. And DEFINITELY not for my wedding. Don't even know if the food was good but none of that matters with all the rest of the stuff I experienced. If I could give less stars I would... To management, please figure out a way to get better organized and train your staff... or fire them. Either way, an overhaul needs to happen.", "author": "Marcelle C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-11", "description": "My husband kept saying the food was good but I had to see for myself. I had the calamar and sweet chili wing as a starter. The wings were great but the calamar was just ok. I ordered the oxtail for dinner and can Insay it eas SPICY!!! I started sweating and could'nt stop but boy was it great. Tender and seasoned well. Just be ready to drink lots of water here because the food is spicy.", "author": "Ronica W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-08", "description": "I went to a dinner and cabaret show at Amarachi this week called the Bridge Street Cabaret and had a wonderful time!  The show was incredible and sexy, with singing, burlesque, acrobatic feats, and even a magician who came from table to table to perform close-up.  It was a true variety show!  If you bring a date to this show, you will get all the cool points.\n\nThe ticket included a prix fixe meal (including a drink and dessert) for $50.  The food was so good.  Everyone at our table agreed.  And the rum punch was delicious as well.  It was definitely worth the price.\n\nI can't wait for the next Bridge Street Cabaret!  \n\nMy only complaint was that the bar service was slow.  The bartenders were very nice and the drinks were good, but I would have had more if they had been faster.", "author": "Alex K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-21", "description": "The owners are super nice and welcoming and they have the best food. Try the salmon/rice dish! It's delicious!! Staff is very friendly and it's not too crowded on the weekdays! Food came fast :)", "author": "Ariel S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-04-16", "description": "I went for my cousin's birthday day dinner and the service was very poor. We chose this restaurant because we went there before and it was wonderful but this time we waited for almost 3 hours for food. We called before and asked if the had the spark candles but when it was time for cake they said they did not have it. We were not pleased with the service and was very disappointed.", "author": "Tajera M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-15", "description": "Came here Saturday night (11/14/15) for dinner with some friends. Had a great experience from the time I called to make reservations to time I walked out the door. I would recommend you make reservations before hand if coming on a Saturday night. The place gets busy quick. Which brings me to one compliant, my friend ordered a side of wings and broccoli and it took a while to come out. BUT the waitress did warn us before hand that they were busy and there's a delay in getting the food out. One thing I would ask Amarachi to do is mark which dishes are spicy. My friend ordered The Fisherman's Stew and it was unbearably spicy. But the waitress was nice about her returning the Stew and ordering another meal. Overall the food was amazing, the drinks were strong, and the music was on point (a mix between new and 90z R\u0026B) and not too loud. I'll be back.", "author": "Junior L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-19", "description": "This spot is the bomb, The drinks are tight, the food is delicious and the ladies are gorgeous. Ambiance and class in downtown BK. What more could you ask for ? Had the oxtails and though I forgot to post a before photo of my oxtails, but the after pic speaks for itself. Check this spot out, you can't go wrong .", "author": "Seth D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-05", "description": "I went here for dinner last evening. The atmosphere was great. The food was even better. I was impressed with the level of service and I will definitely come back. I'm kind of surprised by some of the other reviews I've read here. Perhaps they've corrected some of the previous issues. \nThis is a great addition to Brooklyn!!!", "author": "Tesha R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-24", "description": "Wow what a hidden gem! Despite our first impressions, the food was amazing and blew away all our expectations. We ordered the beef short ribs and jollof rice and suya (we had no idea what this was but gave it a shot) - the meat on both dishes was tender and the dish as a whole was full of flavour. Our only gripe is that the place seems to have an identity crisis. Is it a restaurant? Is it a club? Is it a sports bar? Nevertheless it definitely added to the Caribbean feel to the venue. I hardly ever post reviews on Yelp but I felt compelled to write one for Amarachi because I was so impressed. We are definitely bringing our friends here and telling everyone to come too!", "author": "Jonathan P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-05-01", "description": "The staff r so mean and rude, overpriced brunch consider the quality of the food. A big Not", "author": "Martha P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-18", "description": "My friend had a Groupon so we came here and was greeted politely at the door and seated right away. The waitress was very polite and we ordered two drinks and appetizers the drinks we're delicious and the appetizers was amazing we had her wings. We ordered two entrees and was not dissapointed. The Manger kept checking on us and even had a nice conversation the service was amazing I will definetly be back", "author": "Tina D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-17", "description": "AmaaaZing venue with amazing staff and great service. \n\nHelpful with all food selections because it is African inspired so if you're not used to the type of cuisine they will walk you thru it. \n\nGreat set up in terms of seating and the view of he bridge. City lights!\n\nNot crowded yet but when people get used to the fact that this hidden gem is here it will be!", "author": "Talia D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-04", "description": "Manger was very friendly. Atmosphere is great. I came here because I had a groupon, it was well worth it. Food and drinks were Great.", "author": "Sharmaine B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-07-31", "description": "The food was EXCELLENT. I would suggest takeout. The service was horrible. it was as if they had no idea people were coming to brunch. My friend and I made reservations and they had to find us a table. We ended up sitting on the stage on very uncomfortable stools. This place needs a complete change in staff, and possibly management.", "author": "Sonia T."}], "servesCuisine": "American (Traditional)", "priceRange": "$11-30", "name": "AMARACHI", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "189 Bridge St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/1LakWYHK0MG_HhfpLxK03A/ls.jpg", "@type": "Restaurant", "telephone": "+17182221010"}