{"aggregateRating": {"reviewCount": 310, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-01-14", "description": "Try the Hennessey mimosa. Good music and an almost secret location.  Lol.  The wings are great!", "author": "Ato W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-09", "description": "Wow, just wow!  Hubby and I just came from dinner at this restaurant and it was fantastic.  From the making of the reservations, to the welcome and great smile from Tashi (hostess), to the nice table by the window.  The evening started out great.  We then were given our menus and were off to the races.  We got great recommendations for drinks, appetizers and dinner. We had the red sangria which was very tasty and had a nice kick (very smooth, you felt it after a few sips).  For our appetizer we had the sweet-chili wings, very good and the amount was fine for two people (8 wings). Then the main: Oxtails - I had rice and peas, hubby had Jollof rice - both were stellar.  The meat was succulent, flavorful and the gravy had just the right amount of spice.  We will be having some for lunch tomorrow!  Believe it or not...we even saved some room for dessert - carrot cake.  Yeah, I know, some places have carrot cake as a throw away dessert, but this one was delish.  Not too sweet, with plump juicy raisins, walnuts, a caramel drizzle, cream cheese frosting and so fresh!  Run don't walk to this establishment.  The owners are fabulous people who are interested in making this the best place you have ever eaten. Support, you won't be sorry!", "author": "Antonietta W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-03-22", "description": "The most unprofessional restaurant ever. I will most definitely NEVER come here again. We went for dinner on a Saturday night (surprisingly it didn't seem crowded at all. I guess I understand why now). We walked in and there was no one by the door to greet/seat us. We sat and waited for maybe 5 minutes before a man came down from the elevated area and seated us. No introduction. We have no idea who he was or what his role was. We sit down and wait again for any server to greet us and take our drink orders. A different guy came over and asked if we had been helped yet and went back to tell the server. When she finally came out she didn't have any menus or glasses of water in hand. She just told us she was our server and left to get the menus. She finally handed us menus and came back for our orders. The server made conversation with us and almost told us her whole life story down to when her bf wants them to have kids. Completely inappropriate. It must've taken 15-20 minutes to actually get our drinks and it was only 3 of us (out of 4) who ordered a drink. One of them was just a sprite! \n\nAfter that we literally waited an HOUR for our food to come. The server came over during that time and told us that she spoke to the chef and \"told him about himself\". That was how they compensated for the long wait. No complementary appetizer, round of drinks, dessert, bread, nothing. Again, unprofessional. We finally got our food after contemplating just getting up and leaving because of the long wait and lack of service to make up for it. The food was subpar, at best. And to make matters worse they have the nerve to add automatic gratuity. I know that's their policy but when the service is bad and you have your customers waiting this long you need to make adjustments or do something to make them feel like they're being taken care of. The waitress even caught an attitude when we disputed the automatic gratuity. I was really hoping to make this place a staple since it's black-owned but I absolutely will not be visiting again. It also doesn't look as put together as it does in their photos. Just an overall disappointment.", "author": "A A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-30", "description": "Was there for an after-work event. I've heard of this spot but never knew where it was (at the neck of the Manhattan Bridge in one of the side streets) so got a bit lost, but once I got there I was impressed. The vibe was nice, the DJ was great (not sure if it was their DJ or for the event). I ordered wings and they were deee-licious. The sweet Cuban option, I think. A bit pricey - $12, but at least it was super tasty. Anyhoo, I would def return. Cool spot.", "author": "Michelle A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-10-17", "description": "Saturday my cousin reserved some tables for her birthday celebration our seats were there and ready when we walked in but the waitress named Karen was the worst she didn't offer us any drinks and we was sitting down almost a hour before she took our order. When it did come the food was horrible, no flavor. Later on that night one of the guest from my table decided to tell the head chef about the food and he explained that he was not in the kitchen at that moment. He then made a fresh plate of rice for the lady which she said tasted really good. So i guess he needs to be the only chef working because the rest of the food was shit. Karen the waitress was very rude when we ordered drinks we never received them and had to end up walking to the bar and ordering our own drinks. Damn near to the end of our visit she brought out our dessert. At the end of the night we paid our bill and was just relaxing while the rest of our party danced because the music was good. Mind you tips are included in the bill, Karen took it upon herself to approach my cousin and i and asked why we did not tip her. My cousin told her that the tip was included and Karen walked away without awknowleging she was wrong. The owners did seem nice they gave the birthday girl a free bottle and cared if her food was good. But what about the rest of us? The staff was ghetto, one employee stood against the wall staring us down making me feel real uncomfortable, that same guy grabbed both of my cousins shoulders when he was walking past her. So many employees where on the shift but i only saw 1 doing everything! The scenary was nice the place is a little small. Waitress Karen did not check ID's when she took our drink order which i thought was odd because i look 12. This place will not see me again ever!!!! paying for pricy food that i did not enjoy and bad service is not what i like to do.", "author": "Iman E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-30", "description": "Amarachi is one of my FAVORITE spots...not in Brooklyn, not in New York but PERIOD (and I travel A LOT). WHY...everything is EXCELLENT from the food to the drinks to the atmosphere. I get there and have a hard time leaving because it is just that good. I am one of the pickiest eaters alive and I eat everything possible off of the plate. This is definitely one of my favorite spots to hang out and have a great meal. The flavors and atmosphere will truly feel welcome. Your belly and tastebuds will thank you.", "author": "Kris C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-08-07", "description": "I was invited to dinner by my freind, neither of us had ever been there before but had  positive expectations based on the reviews . I give Amarachi a 1.  I had the Ox tails and was assured by our waitress that they were \"smoken good, fall off the bone good\".  I found the dish to be very oily and tastless,lacking flavor. As for falling off the bone good , they were so but not to the point of falling off the bone.  I got  a very uncomfortable feeling less than halfway through the meal and had to stop. I felt sick ,went to bathroom and all I could do was lean on the sink. I feel the oil they used or something did not agree with me. Needless to say I did not finish the meal. My friend had the surf and turf , which came covered with a sauce that resembled hollandaise sauce.  The shrimp/lobster/and steak was all covered . Mind you the menu did not mention having this sauce with this dish. On the plus side the people were pleasant and welcoming.  I won't go back !!!!", "author": "Phyllis C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-10-21", "description": "Never order from here. I found them on seamless and ordered lunch (costing $26.00) and they promised delivery within 30-45 minutes (I only live a few blocks away). It is now almost 2 hours later and I have not received my food. Every attempt to contact the business results in a busy signal on the phone. Absolutely inexcusable and unacceptable. I will make every attempt to have the charge reversed on my card and will never order from here again.", "author": "Adam S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-30", "description": "Can't wait to go back!  I don't write reviews unless my experience was exceptional and after a fabulous dinner, it's only fair I show love.  This place had a great atmosphere, friendly staff and a phenomenal DJ (Yung Blu).  The environment was perfect to dine or party at and that requires a very delicate balance which the DJ nailed.  Now onto the food...absolutely delicious.  Between my fiancé and I we had the creamy curried chicken, oxtails and chicken wing appetizer.  I eat curry all the time and this was by far some of the best I have ever eaten.  Extremely flavorful with the perfect amount of kick.  The oxtail meal was also delicious and flavorful.  My fiancé ordered that and raved about it throughout the meal and afterwards...an absolute home run.  Lastly we had the chicken wings.  Our plates were cleared and the couple next to us ordered wings and they looked too good to pass up so we ended our meal with the appetizer.  Deeeelish!  Perfectly sized, seasoned and crispy.  All in all it was a 5 star experience across the board and definitely worth it for us to take the 45 min ride from LI again, and again.  :)", "author": "Cathy B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-09-05", "description": "good service, great drinks, but the food was just ok, I would not go back. I wish it was better.", "author": "J P."}], "servesCuisine": "American (Traditional)", "priceRange": "$11-30", "name": "AMARACHI", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "189 Bridge St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/1LakWYHK0MG_HhfpLxK03A/ls.jpg", "@type": "Restaurant", "telephone": "+17182221010"}