{"aggregateRating": {"reviewCount": 310, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-12-14", "description": "HORRIBLE Service at Amarachi !!!! We went about two Saturdays ago . Total waste of time , outfit \u0026 energy .We sat \u0026 waited 47 minutes . No one checked in , took drink orders . We flagged a fair skin female with a short hair style who swore she would return to take our order but never did . We flagged a second waitress or bar person \u0026 same result . Finally walked to the bar \u0026 ordered two drinks . We flagged down the female hostess \u0026 she told us she would send servers , never happened . Thank God we weren't hungry . Music was Eh , crowd is Eh , service Horrible", "author": "Miss F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-10-04", "description": "I came here with a friend for Black Owned Restaurant Month.  The first thing that struck me was the ambiance. The lights are so bright. It doesn't feel anything like a restaurant. It may be because they were hosting one of those byob paint nights in one area of the restaurant. The seating set up was also weird. There are three somewhat separate areas, two of which are like raised stages with the third situated at ground level in between. Sometime in the middle of our meal, the lights went down and the Empire watch party began.  It really felt like a random collection of people gathered to do random activities, all of which happened to be going on in the same space.\n\nThe house cocktail is not bad.  Very sweet.  It's the type of drink I would have ordered at a club in college... or maybe on a beach somewhere.  \n\nService was pretty disorganized.  The waitress first gave us the wrong menu and then didn't seem to know what was actually available to order.  My second course came out after my third.  I'm pretty sure she forgot about it until I asked for it.  She was very nice and talked to someone to figure out the answers to our questions, but it seemed strange that she didn't really know what was going on.  \n\nI ordered from the pre-fixe menu.  I had the suya (on the menu, it's listed as suya chicken tenders, but apparently suya is a plate full of beef pieces), the caesar salad, the salmon with garlic sauce, and the red velvet cake.  The suya was pretty good.  The meat is a little tough, but the rub is delicious, especially when coupled with the fresh onion.  The salad was very overdressed.  I barely noticed that lettuce was involved.  The dressing was good, but there was entirely too much of it.  I really like the salmon.  The creamy sauce on top was perfect.  The rice and veggies served on the side were plain, but not bad.  The red velvet cake was the star of the night.  Three moist layers with perfect cream cheese frosting.  Yum. \n\nMy friend ordered a la carte.  She had the ngobo soup with fufu (I forgot what fufu is called on the menu, but it's like a play-doh ball of pounded yam).  I didn't try the soup because of the okra base-- it's a texture thing-- but my friend said it was really good.  I was excited to try fufu, even though it doesn't really have a distinct taste.\n\nI was glad to visit this restaurant in support of BORM, but it's not quite my cup of tea.  If someone else wanted to go, I'd be happy to go along, but I don't think I would independently decide to visit again.", "author": "Candis D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-12-23", "description": "I've been to Amarachi three times and this review is based on my experience as a whole.\n\nAmbiance: It has nice decor, lounge vibe. Good music, TVs that show sports. A good place for a birthday dinner or a night out with the girls. \n\nPatrons: The restaurant somewhat caters to the 35+ Black crowd. \n\nStaff: The staff is friendly. The last time I was here, our food took very long to come out and though we never mentioned it to our server, she must have sensed that we were getting kind of antsy. She was super proactive and gave us some complimentary shots while we waited which was much appreciated!\n\nFood: As mentioned, I've been here three times and while it's good, the food just isn't consistent. The first time, the wings and the tilapia with jollof rice tasted reheated/microwaved, and not fresh at all. Other times, the food has been on point - so fresh and flavorful. It's really a toss up. \n\nDrinks: The drinks are consistently strong. Make friends with your server or bartender and they will gladly make sure you enjoy your drinks.\n\nPro tip: Call ahead to make a reservation. They often do private events and are closed to the public. This place isn't always busy, but don't make the same mistake I did of just showing up one night only to get turned away at the door.", "author": "Gigi H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-15", "description": "First off, thank you Amarachi for making my 28th birthday dinner so memorable. I had a party of 7 and i couldn't believe how smooth the ordering process was going. Each person received a paper copy of the menu and you circle your entire meal on the paper. My group already knew what they wanted because I sent them the pre fixe menu a head of time. You receive a appetizer, salad, entree and with two cocktails or one cocktail and cake. Also, we receive a free bottle of champagne got the table. Our waitress (I'm so mad I forgot her name) was so amazing! My friend has acid reflux so it was challenging for her to choose food. But the waitress helped her revamp her food to where she will be able to eat it. The music was amazing! We wanted to drop our forks and start dancing! Reggae, Soca, African music! All my favorites! The champagne came out with Sparkles and my slice of cheese cake did also. I received a free shot from one of the owners. I felt so special! Thank you again Amarachi.", "author": "Keyana R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-27", "description": "Amarachi - hands down has the best rum punch I've had since returning from Antigua. I didn't order any food here just came for drinks and they didn't disappoint.", "author": "S C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-07", "description": "I'm happy for this mix of what seems to be Nigerian and West Indian. Someone correct me if I'm wrong about that, but aside from the sub par sound system, it was smooth. However, how can there be an enforced dress code, but someone cannot enter the establishment in a trench coat fitted Jean an h\u0026m hoodie and a casual shoe, but they can enter with jeans Timbs a graphic tee and a pelle. What side are you playing. Are you profiling or do you care to dismiss fashion trends. Idk?", "author": "Joseph W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-08-23", "description": "Save yourself the frustration. The service is subpar, the food is mediocre and the drinks taste like soap. \n\nAfter passing by countless times, my husband and I finally decided to try it out. I wanted to love this place but we were sadly disappointed.", "author": "Heidi O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-24", "description": "Went to eat there on Saturday to celebrate my mom's (belated) birthday. The food was truly something special. I had the short ribs w/vegetables and mashed potatoes, and the potatoes were prepared exactly how I've always want mine to turn out (but no such luck). My mom ordered the snapper w/shrimp. She looked happy with that decision. The drinks, too, were tasty, but since I was driving, I couldn't really indulge. We also ordered the jerk wings and an oxtail platter to go. (Tip: If you have ulcers, don't order the jerk wings. They're spicy as hell!)\n\nOne thing I do agree with (other reviewers have mentioned) is that the interior could use more of a fluid, consistent theme. The restaurant offers so much in the way of excellent food and drinks and music and atmosphere, that a redesign would be icing on a Red Velvet cake. \n\nI'll definitely be back.", "author": "Dianha S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-22", "description": "Absolutely impressed with every single aspect of my dining experience. We went here to celebrate a graduation. The staff was warm welcoming and so accommodating. The food was awesome the drinks were strong and delicious. They really made us feel like we were family. I love this place and can't wait to go back.", "author": "Brownskin C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-06", "description": "The food and atmosphere was amazing! They have great customer service.\n\nTheir Lagos Island Punch is great. I'll definitely be coming back!", "author": "Akeira S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-09", "description": "Love this place.  Friendly, attentive staff. The ambiance, atmosphere and environment is so chill, comfy, classy and sophisticated. Good crowd.  Trendy and different vibe.  Great venue for anything you're thinking of hosting.", "author": "Sam M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-13", "description": "My Husband \u0026 I went to this amazing restaurant yesterday evening. A friend of ours recommended this place...We are so glad they did...At first my husband was like, it's a little tight, but the atmosphere was so laid back \u0026 positive, he enjoyed his self. He even called one of his brothers \u0026 told him, man we have to come here with the other brothers \u0026 watch a game... Our waitress Karen( I believe that was her name) she is the best. The food was awesome. Yes, the have our vote. We can't wait to go back. Kudos To Amarachi... This place is so intimate \u0026 romantic...", "author": "Carline P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-22", "description": "Been here for Luxe Friday \" Black Out \" night . On the small size however you'll still have fun. Drinks were good however overpriced in my opinion. Bottle service is cash only but I can't blame them . Service was a tad long to get our bottles and hookah. Am guessing because of the crowd they had that night . Cool hang out spot just before the Bridges to  the city .", "author": "Notoya S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-08-28", "description": "I would give them about a 1.5 Went for a birthday brunch earlier today. The birthday girl was about 1 1/2 Hour late. I will say this, they weren't pushy and they were very understanding. Letting our big party sit. After she finally arrived we all ordered from a pre fixed birthday menu. It was supposed to be $42.00 per person plus a 18 percent gratuity.  It was 17 of us in total. We all ordered at the same time. The food took VERYYYYYY long to come, and  was brought out kind of like 2 at a time. With very long breaks in between. One person didn't receive her food at all. I believe they were understaffed. We had 1 waitress for all of us and I felt so bad for her. The food was not good at all. Especially for the amount of extra time we waited for it. Almost all of our order came incomplete. I ordered chicken and waffles. It came with 1 dry waffle instead of 2. N 4 VERY small chunks of chicken.  It honestly looked like a kids meal. The same for my friend. The waitress had to actually bring a extra waffle. Everyone had a issue with their food. I think the only thing people did like was the shrimp linguini. They did take off a percentage of our bill, but the experience was beyond annoying. I will say it is a nice atmosphere, however I will not come again.", "author": "Mala H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-02-04", "description": "I went to Amarachi on the wrong day I guess. Before I left my house to have brunch,  I called to make sure that they were open and no mention was made that there were two private events going on at the same time. \n\nWhen I was seated, I thought that the restaurant was nice and that the menu items seemed delicious. After we ordered our food it took close to an hour for it to come out. I ordered the chicken and waffles, my friend ordered the creme curry (to her disappointment, they had no rice -___-) and my other friend ordered the salmon. When our food finally came out, I had a large waffle with 3 very small slivers of fried chicken breast and my friend had 3 shrimp with a few small pieces of chicken in here creme curry. Needless to say, we were disappointed that after waiting for a hour we didn't even get a decent portion size.  \n\nAfter complaining, we found out that the creme curry was supposed to have 5 shrimp not 3 and that my waffle usually comes with more chicken. The owner was willing to work with us to make things right and after another short wait, our plates were made correctly. \n\nWhen we were finally able to dive in, the food was delicious. I will definitely come back to give the restaurant another chance on a day when there aren't multiple private events going on. I wish that we were told before we were seated that service was slow due to the events and that the menu was limited and that certain items aren't available before we ordered.", "author": "R C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-01-26", "description": "Wow, this is a tough place to find. The staff was very nice. The goat pepper soup was very good except for the fact that it contained little meat for the price. The place is so dark that I had to go to the bathroom to read the bill. When given the menu, a staff member was nice enough to use his cell phone flashlight to shine on my menu.", "author": "W Bill S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-26", "description": "Big portions for a small price tag. The service was also very attentive without being overbearing.\n\nWould definitely recommend for lunch/brunch.", "author": "Allison V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-15", "description": "We liked it here! The food was good. I'm a big fan of the Tangy Gold wings. The Lagos rum punch is strong and refreshing. I had the oxtails and my friend had the fisherman's stew. The sauce for the oxtails was delicious. I would I have liked for the meat to have been falling off the bone, like I'm used to. But it was good nonetheless.\n\nThe music was good and not overbearing, which seems to be hard to find these days. The waitress was very friendly and clear about their menu and offerings. \n\nI plan to come here for my birthday and if that goes over well, I'll be back to give the 5 star rating.", "author": "Turi C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-13", "description": "Ambiance was awesome, great music and excellent food. The only downside is that they had no high chair for a toddler...", "author": "Uchechi T."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-10-25", "description": "This is by far the worst restaurant that I've been to. For one, customer service is horrible. Second, I ordered an oxtail w/ rice and peas and told the server it was tasteless and he wouldn't take it back. Third, the ambiance sucks! It's very disappointing that it is black owned. We have to do better.", "author": "Jackie O."}], "servesCuisine": "American (Traditional)", "priceRange": "$11-30", "name": "AMARACHI", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "189 Bridge St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/1LakWYHK0MG_HhfpLxK03A/ls.jpg", "@type": "Restaurant", "telephone": "+17182221010"}