{"aggregateRating": {"reviewCount": 310, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-19", "description": "Everything about this restaurant was amazing. The scenery, the service, the drinks and the food! I brought my boyfriend for an intimate birthday celebration and he enjoyed every second. I definitely recommend the jerk wings as a starter. They were cooked to perfection. Our entrees were great as well. I had the shrimp linguine \u0026y boyfriend has the curry shrimp. The chef definitely wasn't cheap with the shrimp. I like sweet drinks and I opted for the tropical cooler. It tastes great, had to order another. Lastly, once the server knew it was my boyfriend's birthday she surprised him with a yummy piece of red velvet cake and sparkler. I would definitely visit again and recommend everyone to try it. You won't regret it!", "author": "Latonya M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-19", "description": "Great Place. Good Food, Music, Ambiance and Service!", "author": "Mesha S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-12-21", "description": "Food was soooo below average. Went for a frat event and enjoyed the atmosphere but the food was horrid. Ordered the jerk wings shrimp and calamari. The calamari was over fried ( sent it back  ). The wings and shrimp had to do because we were hungry. But wouldn't order food again from here.", "author": "Jazmine C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-06-07", "description": "CaMe here for a bday brunch, had a pre fix menu that included choice app, a pitcher of mimosa, main dish. Food was wonderful but the mimosa was weak nothing but orange juice. One of the waitress was rude at times. Atmosphere is wonderful, music was fine. I would go back since i enjoyed the food.", "author": "Sasha S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-03", "description": "The food was excellent had spicy rice oxtails and my husband had curry chicken with white rice", "author": "Lala B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-08-12", "description": "Service was lousy. Drinks below standard. My order took over a hour. I will  never waste my time coming back. Only thing this place has is a nice atmosphere.", "author": "Melina J."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-05-04", "description": "Somehow I came here without reading the reviews. Sadly,  the reviews are true. I came here to support for black restaurants month buttt,  it is the worst customer  service. Food and drinks are mediocre.", "author": "Tenesia R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-06-19", "description": "The wait was ridiculous. The place wasn't even packed close to empty, there was no reason I got my food and my guests got their food extremely late. Smh first and last time here. My food was not even hot.", "author": "Jay B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-22", "description": "I love this place! The atmosphere is sexy, friendly \u0026 sophisticated. The food is creatively delicious!  The blending of flavors are definitely an incentive to come back again \u0026 again. The drinks are also a creative blend of alcohol that are quick to mellow \u0026 relax. This is my new hangout spot!", "author": "Lesa B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-17", "description": "You cant tell me nothing about Amarachi or Amarachi Prime.  I have been knowing Bubby and the Amarachi crew since my sister discovered the Brooklyn Gem.  I threw my 40th birthday party there and it was so off the chain NYPD shut us down.  You always feel at home with the Amarachi crew.  Please drop in and hang out.", "author": "Charlene J."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-10-09", "description": "Well.. I like to try new places, heard the restaurant was black owned and I wanted to support. Therefore, I will start with the good. The restaurant has a nice view of the road to the Manhattan Bridge and good decor. The wings that we had were good (I recommend the sweet chili sauce) and my server was very sweet and attentive. However the one stars I am giving is for the practices of the restaurant. We came here with a deal for a \"weekday lunch for two people\" from Groupon that cost me $15. When we arrived, my mom and I were told the \"weekday lunch for two\" meant that I could get two free starters which was fine UNTIL it was one per person!! WAIT...WHAT? How does choosing one item from the starter menu, equivalent to lunch for one person? Mind you the \"starter menu\" which includes $5 orders of fries or plantains is less food than the \"small plates menu\". 1st Strike. Next, my mom and I decided to each get an order of 8 wingettes which would be $22 (not much of a deal!) and we were disappointed that it didn't come with fries, salad or any type of side. When they arrived much to my surprise, we only got 6 wingettes but I knew the menu said 8. When I asked I was then told 6 was the lunch portion. WAIT...WHAT??? So 6 wingettes is lunch for 1 person...no fries or sides? UH HUH.... 2nd Strike. We ordered $5 side of sweet plantains because we knew we would be starving and it was literally 4 slices. $5 for 4 pieces = half of one banana? You can get 3 whole plantain bananas for $1. Our waitress gave us the plantains on the house because she could tell we were pretty disappointed. To add insult to injury, as I was leaving the restaurant, I notice a banner advertising a weekday $8.95 lunch special which would have included chicken strips AND fries as an example. This, to me, would be a typical lunch. Had I not used the \"weekday lunch deal for two\" from Groupon and ordered off the lunch special menu (that I didn't know about until I left), I would have gotten a reasonable amount of food. I am positive that I paid more for the deal than what I got in food. When you set up a deal to increase your exposure, encourage new patrons to visit your restaurants and WANT to pay full price next time AND tell their friends, you should be fair and use it as a marketing opportunity. I'm sure the rent is expensive given the location and they are trying to maximize profits, the food that I had was good but this experience left a bad taste in my mouth and we won't be back.", "author": "Azuree M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-11-26", "description": "I really enjoy the food and the beverages it's a beautiful place to throw a private parties or any other occasion...wish they could keep the bar open until 4 am...", "author": "Joey L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-09-13", "description": "If you're thinking of bringing a large party here, don't. If you're thinking of bringing a date here, don't. The live music is obscenely loud and the singers walk around and aggressively shove the microphone in your face and sit at your tables singing. I wasn't aware that Amarachi was a cabaret. Moving on...\nWe were a party of 15 (for 9/12/14 at 8pm) and this reservation was made last week. That is more than ample time to be prepared for our large party. We were there for 2.5 hours and hadn't even received silverware. The waitress' excuse was \"We have to wait for the knives.\" Never in my life, have I been to a self-proclaimed \"restaurant\" that doesn't have silverware ready for their patrons. A few people from my party ordered calamari and they eventually served us two plates 30 minutes apart. No silverware or small plates were given out. And so, we passed these plates around the table. Our calamari did laps! I mean, what kind of business owner or manager (I believe his name is Chris) can sit in his office knowing a group of 15 adults are passing food around the table because of his restaurant's inadequacies and be okay with it? We were obviously frustrated and started asking questions. Then we were told, our order hadn't been given to the kitchen until 9:57 pm. We were told this around 10:35 pm. That was the last straw and so we left. God forbid we had stayed past 10:35; we wouldn't have left until 2 am honestly (and that's an optimistic time given how incredibly slow they were). In the end, all Amarachi had to offer were excuses. Anything they had to say was irrelevant and didn't make the cut. Amarachi ruined someone's birthday and 14 other people's night.", "author": "C J."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-02-20", "description": "Smdh what a waste of my time. First things first the security guard sat us at the table because we didn't have a waitress. We then wait 10 minutes for a waitress who was a bloody muppet to sit us. We then as for a few drinks and water and she disappears for 30 minutes. In a Resturant that had 6 customers. A bloody joke. We then ask for plantain, BBQ wings and calamari. Each dish came out 5 minutes apart with no utensils to eat with and still no water. But wait it gets worst. The grandma in the kitchen was cooking by her lonesome and the waitress though she looked like she had been there a while I'm positive started 5 minutes before we sat down. Wings were okay, plantain suspect and calamari i passed on. Then the entrees. Two oxtails, which should come with rice and peas but tonight they didn't have any because there was a peas shortage in Brooklyn apparently No problem, white rice instead. And an order of Jollof rice and Suya. The oxtails came out but one of the two was spicy, like eating pepper for fun. We go ahead and tell the waitress and she says \"my boss says they were made in the same pot so they are not remaking it but they will take it off the bill\" who says that. What happened to customer service? Unreal. So we return the food. And then proceeds to play where is Waldo with muppet the waitress. The girl with the nose ring, tattoo and a weave that was slightly off center and she was no where to be found. So we put out an APB with the 18th precinct and still no luck. We then walk around the Resturant only to find her doing the Dougie on the dance floor with the people partying. Are you kidding me, see ur life. After finishing her stankey leg she then brings us the check and she was left gasping when she didn't get a tip. Bottom line this place was a bloody disaster.", "author": "M Y."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-09-07", "description": "Decent food; horrible service. It took nearly an hour to get our first and only drinks of the night. Our server ignored us for most the night. The place was not packed or super busy and yet our food still took upwards of 40 minutes after we ordered. When our waitress finally brought it out to the table we still had no silverware. I then look at my plate of Jerk Chicken which comes with a side of asparagus. I had two pieces of asparagus on the plate. The food was good enough that I would probably order delivery from here in the future, but I doubt I'd ever subject myself to their horrible service again.", "author": "Dave B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-03-31", "description": "Definitely the worst service I have ever had. Don't waste your time. The silverware looks very dirty and old. The service is horrible and the staff inexperienced. I will never go back to this place.", "author": "Mr P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-03", "description": "Great atmosphere....with great food to match.  Drinks always on point..I plan to visit again and again and......", "author": "Lyle C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-18", "description": "Went here last night with a Groupon. I'm hard to please so I have to give credit where it is due.  Service was excellent.  Appetizer [calamari] and entree [Tilapia w/Shrimp/Salmon w/mac \u0026 cheese and spinach], the best.  I was pleasantly surprised and will go again.  Oh, the Thursday DJ did his thing.  He was awesome!", "author": "Sherry W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-05-21", "description": "Worst service.   Called restaurant one hour into delivery.   They told me left five minutes ago.   Thirty more  minutes go by, I call seamless.   Seamless calls them,  restaurant tell seamless it hasn't left.   So either he lied on phone or is incompetent.  Maybe time for some new hires...", "author": "Kevin N."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-12-04", "description": "I came here for date night hoping for a good experience after reading the reviews and searching for a good restaurant in BK. The best part was the music. The simplest drink...screwdriver was bad. I had the tilapia, although tasty the rice was old. My date had the salmon which was burnt. The food was served luke warm. The table we sat at had these nice looking leather high back chairs which should only be for decoration and lounging......NOT for eating a meal the most uncomfortable chairs ever!   Sorry but I will never go back or recommend this place.", "author": "Kisha R."}], "servesCuisine": "American (Traditional)", "priceRange": "$11-30", "name": "AMARACHI", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "189 Bridge St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/1LakWYHK0MG_HhfpLxK03A/ls.jpg", "@type": "Restaurant", "telephone": "+17182221010"}