{"aggregateRating": {"reviewCount": 310, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-01-06", "description": "I read the reviews prior to coming but like anything else I wanted the chance to form my own opinion. Walking in I noticed the nice decor and open space. Looks like a nice late night place, with enough space to dance the food you just ate away. My friends and I were seated and promptly brought menus and water. We then placed our order and proceeded to wait for close to an hour for our food. No bueno, especially because at the time we were the ONLY patrons! When the food finally arrived, it was warm, as if it were sitting out for awhile. To my surprise, it was delicious! I had the grilled salmon with mashed potatoes- salmon perfectly seasoned and grilled, potatoes nicely whipped. My friends had the oxtail and rice, both being Caribbean woman, were not impressed with the seasoning. \nThe waitress was pleasant and gave us one out of three drinks on the house (I'm assuming to make up for the long wait). Blue Hawaiian drink was good.\nI don't know if I'll come here again during lunch time. Perhaps I'll give it one more chance and go during dinner when I don't have to rush back to work.", "author": "N C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-22", "description": "Went here on a Saturday night to celebrate my friend's 35th birthday. This place is extremely difficult to find. Its located right off a highway, kinda in the cut. I arrived at approximately 10:30pm. When I entered the establishment, I was greeted by an older gentleman. He politely explained that there was a mandatory coat check for $2. I gave him my coat and he even assisted me with taking off my sweater that I wanted to check in with my coat. Not in a creepish nor uncomfortable way though.\nI was extremely early, so I decided to get a drink at the bar while I waited. I ordered an \"Incredible Hulk\" for $15.00. It had rum n pineapple juice in it. Im not sure of the bartender's name, but she was very pleasant as well. The drink was strong...but I guess that's how ppl like their drinks right? She even let me charge my phone while I waited.\nThe decor is similar to that of an upscale restaurant in Manhattan. Great ambiance. The patrons were all well dressed. Most of them seemed to be there for dinner parties. \nFast forward to 12:00am. The chairs were removed from the main area to turn it into a dancefloor. There was a dj playing hip hop/r\u0026b, and reggae. It wasn't too crowded, just enough room to dance comfortably. I didn't stay too b/c I had to travel back to the Bronx, but I think this is a wonderful establishment and I will definitely return.", "author": "Courtnwy T."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-12-13", "description": "After a horrible experience, I gave this establishment a poor review. Our server responded by writing a long-winded, rambling, and hostile response laced with personal insults. \n\nNo matter that the \"customer is always right\" or that the review was written in good faith after what was truly awful customer service. Amarachi's response is to pile on and harass a disgruntled ex-customer in print. \n\nHey, Amarachi! That's actually NOT good for business! But thanks making the unprofessionalism I complained about plain for all to see. I actually wish this restaurant well, as I make a point to support minority-owned enterprises whenever possible, but Amarachi will have to treat its patrons properly for that to happen, and bullying will never work.", "author": "Mimi S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-26", "description": "From the beginning, I had a feeling that this restaurant would be amazing and I was was right. It started off badly on my part because I was TWO\nHOURS late for my reservation for seven people (I know, terrible). When I arrived, we still only waited about ten minutes to be seated, and they weren't rude about us being late. Our waitress was ABSOLUTELY amazing and the place is so sophisticated and lively, without being pretentious. POur food and drinks were perfect as well; even the white rice was seasoned and garnished. The people at my table had the sweet chili wings, shrimp linguine, curry chicken \u0026 shrimp, curry channa, and oxtail and everyone enjoyed their food to the fullest. At the end of the night they gave me a slice of cake with sparklers, and my guests and I passed it around (even the people who normally don't like that kind of cake) because it was too good not to share. I can honestly say I've never been to a place where everything was a ten out of ten, until now. The DJ played all the hits, new \u0026 old. If you're looking for a great West Indian/African spot in Brooklyn, I HIGHHHHHLLLLLLYYYYYYY recommend Amarachi. I honestly have never been to a restaurant that was this accommodating and this skilled at creating great food and a great atmosphere. This is the best restaurant experience I've EVER had.", "author": "Naomi D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-25", "description": "Horrible service and it was automatic gratuity, wouldn't recommend. I so wasn't impressed, and trust me am very easy to impress. The jollof rice wasn't even good, nothing close to Nigerian jollof. I hope they do bette", "author": "Magistic L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-01-08", "description": "If you're going to dine here, make sure your party consists of two people or less. I came here for a birthday dinner with a big party and was pretty much over the night 20 minutes in. I gave this place two stars because despite the disorganized service, the food was flavorful and the vibe was nice. I know going out in big groups are usually a headache, but this experience took the cake by far. This restaurant can't handle big groups and they need to be more upfront with their patrons when making reservations.", "author": "Sade E."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-06-29", "description": "Great place for after work vibes. The brunch is not bad either. I wish they have more options though. The owners are great. The only concern is the staff urgency need to be a 'urgent' it sometimes take like 5 min just to get an attention.", "author": "Zane M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-12-26", "description": "This was unambiguously and undeniably the worst restaurant service, or lack thereof I have ever experienced. I could have taken a flight to Nigeria to eat in less time than it took for these people to bring a water refill to my empty table. Don't attempt to eat here unless you have at least 2 hours to waste waiting for your food while the restaurant staff bring bottles of champagne out to celebrate various birthday parties while doling out peoples meals sparsely. Enjoy watching the friend you came with eat their entire meal while you sit and watch because your food isn't ready. And don't expect the wait staff to have the decency to bring you more water while you wait or tell you how much longer you have to wait for your meal. It won't happen. In fact when I asked what was taking so long the waitress started telling me about all the people that were still waiting for their food at other tables. Um HELLO! I didn't ask about anyone else. I asked what the reason for the wait was with MY order. Smh...this restaurant is obviously in Dumbo for a reason. Pathetic. This place can't decide whether it wants to be a club or a restaurant. I won't EVER...EVER go back to or recommend this place to anyone I know. Even if it's someone I don't like. Do the entire restaurant community a favor and shut down. By the way, If I could give this place negative stars I would.", "author": "Tai O."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-11-06", "description": "Scammers ..... \n\nSo I made reservations a week in advance because it was my Birthday. The night before I came here my date and I received a confirmation. The location is not ideal (not many other businesses on the block) just highways and its a long walk from the train.\n\nWhen we arrived, there was no hostess/host at the door. When he finally did come, he greeted the guest behind us and ignored me and my date. It was apparent he had knew them. Anyway finally he greets us and I ask if there was a private event going on. He said yes. I told him about our reservations and he said \"They should not have done that\" and starred at us blankly. He offered no remedy to rectify the situation. He gave us a look that said \"you just have to leave because im busy.\" \n\nDont go here. The place is incredibly disorganized. Even the DJ looks confused at the booth.  I do feel the place is prettier in the photos. The ambiance was pretty on the outside.... its a shame that I couldn't experience the full service on the inside.\n\nWe went to Chocolat in Harlem and they are a Black owned business that knows about organization and true beauty. Best of Luck to everyone.", "author": "K_nyc B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-29", "description": "This is my 3rd time here! What an excellent restaurant/bar! The food-the atmosphere-the people -just freakin awesome!! I will come back and eat and drink! The shrimp Afredo-Chilean salmon -while red snapper-just soo delicious!!", "author": "Tania B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-06-17", "description": "Came here for a birthday and Father's Day. Service wasn't that great, Our waitress was bubbly and nice but she accidentally brought us henny mimosas instead of the regular mimosas and then the bartender tried to get us to just keep it since the drink was expensive. There was NO WAY we were going to keep a $45 pitcher of henny mimosa we never asked for. We also had to ask for plates, napkins and silverware....like really? But other than that the service was fine. I had to deduct another star for the overcooked food though. The flavor was perfect but every single meat we ordered was severely overcooked! My lobster and shrimp in the linguini dish was so rubbery and hard. Very disappointed. My mother's chicken suya was so dry it was almost inedible...tasted like sand while chewing smh. Too bad because my pasta was great and the alfredo sauce was really delectable and the jollof rice was good too...as were the sweet chili wings and fried calamari. Our sprite was also super flat lol. This is my 3rd time here and definitely the worst experience I've had so far. I probably wouldn't pick this place again unless it's for a friend's special occasion.", "author": "Cici C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-13", "description": "The Best Experience ever. \n\nCame Here With My Best Friends For A Birthday Celebration and We Loved Every Moment. \nThe Food was AMAZING. We Went On A Thursday Night. The Chef Made Sure To Check On Us and The Food. \nThe Music Had Us Dancing In Our Seats. \nThe Drinks Were Well Worth it, The Bartender Was Great She Helped Carry Over Our Drinks Because We Were A Large Party. . \nI Could Only Say Great Things About This Black Own Establishment. OH, \n\nDid I Forget to Mention How NICE!!! Our Waitress Was. :) \n\nMy Friends And Are Looking to go back ASAPPPPPP. Like Tomorrow.", "author": "Sherley J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-16", "description": "Great foooooooood omg. \nThis is definitely my top 5 calamari ever. They actually serve it with the seeet chili sauce instead of marinara but I varely used it because it was seasoned so well \nThe wait staff was very nice and attentive. Not that annoying type of attentive, just on point. Bartenders and security guards were nice and friendly too. Great place, happy to have just stumbled upon it.\n*was a 5 start review. Had to change it to 4 because they \"don't take gift cards\" it is a regular vanilla master card gift card but their machine cannot process it for whatever reason....odd", "author": "Stacy M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-01-02", "description": "The service was terrible the set up and seeting was terrible and the resturant was freezing. Never going back", "author": "Ngozi H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-04-02", "description": "This place is a hit or miss the first time I went the food was great however i went recently and the food wasn't so good my steak was bloody after asking for medium well. They put the wrong side. My friend asked for no dressing and it came with dressing and all, the server named Karen, said was sorry and didn't take it back until we told her we're paying for this party we want what we pay for. The server never checked on us. We had unlimited drinks she never refilled anything until i asked her when was she planning on bringing out a pitcher of juice. There was a problem with the receipt three times then she told us our card was declined when really she put in the wrong amount and was overcharging us which is why it didn't work because the card had the exact amount. Towards the end she smelled like alcohol and messed up the beautiful cake i ordered by carelessly putting the candles in it and messing up the top. I would never go back.", "author": "Carmel L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-07", "description": "Amazing Food! The red snapper was to die for and the Friday Nite DJ was sooo good! He played everything from soca to dancehall to hip hop to Disco. The ambiance isn't that amazing but what they may lack in decorum they make up for in their menu and their service. Also the rum punch was great, you only need a cup and a half to get to a tipsy place! Lol", "author": "Shaaista C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-16", "description": "Just HORRIBLE!\n\nI very seldom write reviews but because I had such a horrible experience at Amarachi review is warranted. I went to Amarachi this past Saturday to celebrate my birthday with friends. When I called to confirm my reservation, the woman on the phone told me that they had no record of it. Then she proceeded to have a muffled conversation with some other man, came back to the phone and told me that everything was fine and that my reservation was in the \"other system\".  I was instructed to ask for Brother John we I arrived. What I wish she would have told me was that they were having a private event that night, specifically a panel discussion about how single women could find husbands and maintain a marriage. I found out about the private event when I arrived with my friends. Due to the event, there was no music playing and we had to ensure that we spoke in a low tone. Again it was my birthday so I came for music and a lively atmosphere. The hostess/waitress, Tiffany, explained that the event would be ending in 15 minutes so my friends and I decided to stay.\n\nUpon ordering from the menu , it was clear that Tiffany was was not at all knowledgeable about the menu, especially the drinks. Initially we asked what was in the Bubby carafe to which she respond, \"a whole bunch of different liquors\". BUt she informed her that they didn't have that one today.  Consequently, we ended up ordering a carafe of Mojito but she brought us a drink that was orange in color, resembling a mimosa. We reminded her that we wanted a mojito and she told us that it was and abruptly walked away. We tried the drink and indeed it was a mimosa. When the waitress returned, again we explained that it was a mimosa. The waitress appeared annoyed and proceeded to explain that it was in fact a mojito but it was made with \"Mimosa champagne\". We then told her that mojitos are not made with champagne and that we did not want the drink. Still visibly annoyed, she asked us to pour our drinks back into the pitcher which seemed odd and unsanitary, She took the drink away. When she returned she said that the kitchen had informed her that they were not making carafes of mojito but we could get it by the glass if we wanted. She never apologized for her error and walked away. Ultimately, my friends and I decided to leave. Truthfully I was quite disappointed and embarrassed because I had selected this restaurant. I will definitely not be returning", "author": "Alicia S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-04-01", "description": "Probably one of the worst resturants experience ever, EVER.\nDefinitely a lounge environment. we planned a going away party for a friend so it was a party of 10.\n\nDecor: the night look was ok. Nothing to rave about. \n\nDrinks: they were good however the prices of the drinks vary depending on the bartender and waiters. An example is 2 ppl at our dinner party had the same drink, one came in a large glass and one came in the champagne flute and they were charged the same price.\n\nFOOD: depends on the depending isha, presentation wasn't good, the food was mediocre and questionable.\n\nOverall if you are drinking this is all I would say that might be sort of right, good luck to you if you go.\n\nI would not recommend this place.", "author": "Joanne A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-20", "description": "The food was absolutely great. I came here for my boyfriend's birthday today and we had the fried calamari (very good), the jerk parmesean chicken wings (good but very very very spicy), I ate the lobster and shrimp linguini ( tasty, well seasoned), and my boyfriend had the red snapper and rice with shrimp( the sweet chili sauce tasted soo good and the red snapper tasted well too). Like I said no complaints about the food, the drink I had was the blue bridge river i think( I just know it was blue and was so smooth yet strong enough where it wasn't overpowering. The only downside was that the service was a little too slow with them taking long to bring our appetizers and food. Since it was a Monday evening and not a lot of customers I thought we'd be done sooner. Other than that I have no complaints .", "author": "Shaniqua P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-28", "description": "Came here with a friend who had a Groupon.  I got the chicken fingers \u0026 fries.  Fair warning if you aren't into spicy foods: it's a little hot.  There was a blend on the fries that reminded me of something people I knew in NC had on their fries.  I think they'd totally go crazy for this \"small\" plate at lunchtime (b/c this was definitely not a small plate \u0026 this is not just skinny me saying that).  \n\nThis venue looks like it would be very nice in the evenings for happy hour or the events they have here since decor is awesome.  Our server was also extremely nice \u0026 her recommendation of the barbecue sauce was spot on with my meal since it had a sweet blend that complimented the chicken fingers (which I also loved since it had some quality chicken, nothing overcooked or icky tasting).  The drink selections looked good, though I'm not a drinker \u0026 couldn't tell you much about that nor how any drinks tasted since I didn't have any.  It's closer to DUMBO or Downtown Brooklyn than Bed-Stuy (where Groupon said they were); we'd return.", "author": "Monica T."}], "servesCuisine": "American (Traditional)", "priceRange": "$11-30", "name": "AMARACHI", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "189 Bridge St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/1LakWYHK0MG_HhfpLxK03A/ls.jpg", "@type": "Restaurant", "telephone": "+17182221010"}