{"aggregateRating": {"reviewCount": 310, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-04", "description": "My first time here and was felt so welcomed by the bartenders and the lady who waited on us. I had a drink that was so good it was something blue so 2 of them were perfect. My girlfriend told me she did an spoken word there. The owner came over and said hi and the Dj was on point I even had to tell him lol. I will be back here more often", "author": "Jane D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-06-17", "description": "+++\n- love the Afro-Caribbean soundtrack \n\n++\n- enjoyed mashed potatoes and spinach \n- hennymosa is good to get two people nice\n (I'd recommend two pitchers for four or more)\n\n+\n- short rib was cool\n- as was salmon\n\n- \n- service was kind of slow", "author": "renje g."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-05", "description": "I love the vibe of this place. I have been to many African restaurants, of course because I am proud Liberian woman. They out did themselves with presentation and how they combine Carribean and African cuisines. The food is so amazing. They have showcases, parties, and performances. I only go when it's empty.\n\nThe only issue is I have waited for an hour for my meal on day that it wasn't packed. I've waited an hour twice. The food was everything, I complained on waiting but when they brought in my plate. I demolished it lol! I'll go again, but order in advance lol Love this place!\n\nWhere else can you dress cute and eat your African food with yours hands and people staring without judgement and you have no care in the world lol", "author": "Doreen G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-29", "description": "Every time I go to Amarachi the food is really good, like addictive and worth coming back for. I like the Jollof Rice and the oxtails. Not much of a drinker, but the few times I did, the mixed drinks were very good. Parking is fairly easy and the atmosphere is full of good vibes!!", "author": "Mo M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-02-03", "description": "I'm not writing this review because they are my brothers, I'm writing this because I enjoy my food everytime! The ambiance, the music, the people, the drinks and the owners... I love it all! Shout out to professional black businesses!", "author": "Liz I."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-09", "description": "First time trying Nigerian food and it was amazing. The food itself was delicious, no complains. I was pleasantly surprised I like it as much as I did. The drinks were also very good. Bartender knew what she was doing. The service was very good as well. Waitress was sweet and helpful. She went above and beyond. This place is good for brunch and dinner.", "author": "Akelia J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-28", "description": "Hellllllaaaa good I'll come all the way from the bay again just for the oxtails and jerk chicken! Lots of flavor", "author": "Karise S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-06", "description": "I always have a good time when I'm at Amarachi. I think that it would be a great space to host an event because of the ambiance and layout. I was sold when I realized that the main dining area could be lit up in hot pink.\n\nFirst time that I came here was for Black-owned Restaurant Week. The food was delicious then and the service was amazing. I even witnessed an engagement disguised as a birthday celebration while I was throwing back some their signature punch.\n\nMy second trip was an impromptu one. The vibes were exactly as I remembered it. The shrimp pasta was the same creamy deliciousness that I remembered TOO! Everyone in my group was satisfied with their food as well. \n\nI always enjoy myself here. I'm guaranteed to put something tasty in my tummy when I'm here and I LOVE supporting my NPHC family... Oh so pretty!!", "author": "Cassie C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-19", "description": "I wandered in here for lunch and got the veggie stir fry with jollof rice. I was a bit apprehensive because of the price but OH MY GOD IT WAS INCREDIBLE. The only time I've had jollof rice this good was in Ghana. The server was also super nice! 10/10 will dine again.", "author": "Lenka R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-05", "description": "Im writing my review as I'm eating my leftovers from last night was when I visited amarachi for the first time for brunch .... and I came with a plan.. taste their nigerian food.. \n\nLet me tell you .. from the about 5 nigerian restaurants in nyc .... this one has the better food and overall the better experience .. I had the Egusi with pounded yam omg .. my serving was filling .. the mixed meat was tender and cut smaller for better eating .. the Egusi was yummy had all ingredients mandated ... later in the night I sayed I would try the suya and jollof... the jollof is spicy and so tasty ... best jollof I've tasted thus far and the suya was eh okay.. not as traditional as the one in Nigeria ... but not bad just needing more spice and grilling \n\nThe lady who was caring for me was a nigerian (yes I'm kinda biased) and she was great nice she accomodated me perfectly ...\n\nOther staff members were not so nice but eh what the heck !  I got what I wanted .. I will be back and I encourage you to visit this place for good food and good vybes", "author": "Raisa V."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-01-16", "description": "Let me start of by saying I'm Nigerian so my opinion matters and should be taken seriously. Went here for the first time expecting good food and was highly disappointed. Ordered the jollof rice with beef suya and nothing about the food was good. The rice was hard and the suya had no flavor, nor did it taste like suya. The service was terrible, and the food took long to come out from the time we ordered. At one point the waiter was no where to be found. The music is good tho but too loud for a resturant feel but I liked it. To all my African looking for authentic food, this isnt the place. I will not be going back.", "author": "Ayoola A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-26", "description": "The only negative thing I can say about this place is that the dining area does not smell fresh. It has some kind of musk. But THE FOOD IS AMAZING \nTheir jallof rice is made to perfection. Drinks are strong. Didn't really like the open mic / comedy stuff some guy was doing. He was talking about gross stuff at some  point and he had mildly misogynistic jokes but whatever...", "author": "Megan T. T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-30", "description": "My husband is from Nigeria and we came to New York looking for some good African food. This place hits the spot! The owner and hostess were very accommodating and moreover our experience means we will definitely add this place to our list next time we head to New York. Highly, highly recommended!", "author": "Katie O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-02", "description": "Amarachi is an excellent African restaurant serving authentic Nigerian dishes. As a vegetarian-vegan, I was pleased to see a variety of meal options for meat eaters and non-meat eaters. Everyone enjoyed their delicious plates. The atmosphere was a relaxed and inviting. The staff was very nice and attentive. Five stars for me!", "author": "Murphy J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-11-17", "description": "Celebrated my mom's 63rd birthday here. The food and drinks were good. We had 7pm reservations and because of the time, the music was not too loud and there was no crowd or wait to be seated. Service was good and we even got a complimentary slice of red velvet birthday cake with a sparkler candle which was a nice touch. This place felt like a nice restaurant placed in a club/sports bar.  It had a little touch of something for everyone. We were able to have sit down dining while listening to music all while glancing at the game on one of many big screen televisions.  It was just perfect for our little evening out.", "author": "Casandra M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-04-27", "description": "HORRIBLE SERVICE!!!! I placed a pick up order. They said it would take 15mins. I got there an hour later and it was STILL not ready", "author": "Andrea U."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-03-02", "description": "OHHH...MYYY...GOD. Walked in and I was immediately hit in the face with the stench of vomit and mold. Sat at the bar to wait for a friend and ended up waiting 10 minutes to even be greeted. A sign fell off the wall before I got my drink. The Hennessy I ordered was 100% watered down. Will not return.", "author": "Ryan D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-05", "description": "Came here yesterday with my best friend. We were looking for a black owned restaurant to support and I gave her a few options. She had already been to them but we decided on Amarachi since it was close to an area we were exploring.\n\nUpon arriving at 3pm, it was hard to tell if this place was open or not. It was dark and I didn't see anybody initially until I looked over at the bar. The place did not look likely at all, it was empty side from a table of people dining, but it was 3pm on a Wednesday... completely understandable lol. We sat at the bar for the happy hour specials. Our bartender was really sweet! She made great, strong, drinks, too! So that was a plus. We sat in dead silence for a good while but eventually they put music on. It was really hard to figure out the vibe of the place... there were big TVs and stuff, but the place definitely could use a touch more of creating the vibe/ambiance because I was really confused. Once they improve the look of this place, it'll be BOMB! \n\nI ordered wings and fries and let me tell you.... they were some of the best wings I've ever had! I had half jerk and half buffalo and they were perfect. They were tasty, rich in flavor, hot, just all things great. The fries were pretty good, too, and I am a french-fry-aholic in recovery.\n\nDef will be back next time I am in NYC! Would love to see what this place is like at night.\n\nP.S. Seems like the perfect venue to host events. Definitely enough space for it.", "author": "Yasmine B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-02-26", "description": "I came out to celebrate my friends birthday. The wings were amazing. We ordered the Parm jerk which had the right amount of spice and the calamari. Both appetizers was great. For my entree i order the shrimp linguine which was tasty and I had a large amount of pasta.\n\nThe drinks were ok. I had the regular margarita which was decent but expected more alcohol . The others ordered Hennessy mimosas. \n\nThe waitress was ok. She did all she can to fix anything  that went wrong with the service. She was serving  a party of 10 and that can be a lot", "author": "DionJalen B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-03", "description": "I enjoy the ambiance and the menu. Enough said.  Their Sunday brunch is phenomenal. The fixed menu for catered affairs is excellent.", "author": "Barbara S."}], "servesCuisine": "American (Traditional)", "priceRange": "$11-30", "name": "AMARACHI", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "189 Bridge St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/1LakWYHK0MG_HhfpLxK03A/ls.jpg", "@type": "Restaurant", "telephone": "+17182221010"}