{"aggregateRating": {"reviewCount": 310, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-24", "description": "First time trying Nigerian food and O boy has this spot set the bar high. My waitress (devin) was super friendly but even better was very knowledgeable about the menu. It's not expensive for such good food and modern setting. Definitely worth a visit.", "author": "Orun W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-03-20", "description": "Worst service EVER. Please save all of your coins. DO NOT WASTE YOUR TIME LOOKING FOR PARKING or SENDING YOUR HARD EARNED MONEY.\n\nThe wait staff is untrained! No manners whatsoever.\nBe ware of this place.\n\n\nThe food is horrible. I sent my steak back because it was over cooked and I was given back the same steak 20 minutes later drastically over cooked. Everyone's food came 10 minutes apart. \n\nI'm currently sitting in the venue waiting yet again for my check its been 30 minutes.  my friends and I are considering just walking out right now.\n\nBad service\nBad food\nGood music", "author": "Kern E."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-10-04", "description": "My Sorors - who were my dinner companions - liked it but I've had better.  The food was still delicious the next day but they didn't win any favors by running out of RED VELVET CAKE!\nThe service was slow and in the servers defense - they were catering to a 30th birthday party that took up half the restaurant.", "author": "Cathy G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-03", "description": "I'll keep this review short and to the point. Music definitely gets 5 stars. I am very much into Caribbean music and Afro beats. Service 5 stars. The waitress seemed very passionate about the restaurant.  She shared the history of the restaurant with us and make great suggestions on what we should order. Food 5 stars!!! Let me tell you...everything we ordered: chicken quesadillas, parm jerk wings, ox tails, plantains, shrimp suya and everything else was to die for! Finally...drinks...you have to try the Henny mimosa! 5 stars!", "author": "Audrey D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-06-20", "description": "3 1/2 stars on yelp and you wanna take my name and number for a reservation, then gently inform me of a $100 deposit to hold my table. And actually expect me to pay? Who pays a deposit for dinner? Wtf? I read the reviews about the poor service here and decided to see for myself what the place is about, looks like that won't be happening.", "author": "Jane O."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-21", "description": "I visited this place with colleagues and WE had a great time.  No one else in the room mattered, hahaha. Well we were the only ones there. It was during lunch hours and I believe the lounge had just opened. The server was nice--she checked on us once--but I think we were having such a good time she did not want to disturb. The food was good and the drinks were strong. The music was good. I get the sense that it has a really good crowd during the night.", "author": "Odessa S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-31", "description": "Nice relaxed environment. It might take a while to get your food so be patient.  The owners and staff make you feel very comfortable, welcomed, and show that they appreciate your business. I enjoyed the Fried Calamari on a previous visit during Happy Hour, also the $5.00 Mojitos and Margaritas were good.  Enjoying lunch with some co- workers yesterday, my shrimp Alfredo was good my only complaint was that it could have been hotter and the shrimps needed a bit more cook time. The others had the Salmon Quesadilla, Ox Tails, and Chicken Fingers with French Fries. Everyone enjoyed the food. The portions are good and its not expensive.  I will definitely  return and encourage others to check the out.", "author": "Tracy P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-10-19", "description": "Honestly I was disappointed in myself for picking Amarchi as place to eat dinner at especially with one of my friends. After we got seated it took any \"available\" waitress to attend to us. We sat there for 20 mins or more just sitting there waiting to place an order or something. Although Lady A was on her way out she stayed behind and helped us put our order in the kitchen. If you're Nigerian PLEASE DO NOT EAT THERE SO CALLED JOLLOF. It literally taste like nothing and their whole fish don't let me get started that's one of the worse fish I ever ate in my life. I was highly disappointed . Although the fish look appealing I was definitely fooled. When I told my other friends my experience here they weren't surprised at all. It's like they didn't even expect anything good from this place . First and LAST time coming here.", "author": "Temitope S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-16", "description": "Beautiful atmosphere Great people outstanding staff this is the place you come when you want to unwind.", "author": "Smile L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-10", "description": "I'm writing this as I'm still sitting here... That's how horrible my experience is right now! The service is HORRIBLE!!! We got here at 9:40 didn't get our food til 11:40!!!!!! Te appetizers never came and even the drinks took forever to get here!! The hookah took a decade to get to us!!  The food was descent and the waitress was ok.. I'm just upset that I found this cool Caribbean place to come and have dinner and this is what we got!! Not to mention I'm here with my best friend for her birthday and this is what she got??!!!! I WILL NEVER COME BACK HERE and neither will any of the ppl in my 20 ppl party! Thank you!", "author": "Marlz C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-09", "description": "Visited On April 17 For My Cousins Private Birthday Brunch I Must Say I Was Impressed From The Time I Walked Through The Door The Interior Is Amazing. We Were Seated Promotly On Entry Which I Was Very Happy About Even Tho My Cousin Didn't Arrive Yet We Were Still Catered Too Which With Most Olaces Majority Of Your Party Has To Be There. The Waiter Was Super Nice Very Funny And Attentive ... The Food Was Amazingggggggggggg So Much Flavor We Were Given Personal Pitchers Of Mimosas But I Had A Margarita Instead It Came With Our PreFixe Menu. Overall I Would Visit Here Again And Recommend It To EVERYONE", "author": "Venise H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-08-22", "description": "The location is prime, the decor is cute, the menu was not as African as i expected more Caribbean African fusion but i expected better. went to experience Dine in Brooklyn which this restaurant was on its list however no one seemed to be aware of that but me and my party. They stated they only had one starter which was a cesar salad, my salad was more of a house salad than ceasar, then you could choose anything off them menu but lobster, and you had 3 desserts to choose from.\n\nI would recommend it for a date night, there were a lot of couples having a drink and a good time. \n\nService: the service was mediocre, waitress was not efficient as expected but im going to chalk it up to her being new and they seemed understaffed. \n\nFood: the food was good however if it was HOT it would of been great!", "author": "Tamika G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-03", "description": "Had never been here before until a friend wanted to celebrate their birthday. I was pleasantly surprised by how nice the space was. The seating was great, the music was amazing and the staff were all really nice. It doubles as a dance floor so that made it even better for a late night event.", "author": "Nana B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-20", "description": "Took my husband here for his birthday. Just the two of us. I had heard good things about this place and the bonus was that they had it on Groupon. Made rez thru open table. We were greeted as soon as we came in and seated right away. Our waiter Tyrese was a cool guy. Made us feel welcomed going over the highlights on the menu. Even made some suggestions. The food was delicious. Calimari was our appetizer yum. Had the salmon with a parmesan sauce the spinach had an interesting kick. Mmmm. The carrot cake is also a must have. I couldn't give it 5 stars because although they had the ceiling fans going I was still very warm as temps were unseasonably high. I say go check it out for yourself.", "author": "Tracey S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-28", "description": "Recently, I had two positive experiences at Amarachi. On August 15th, my husband and I had our 47th wedding anniversary dinner there. The waitress made sure it was a celebration to remember. This past weekend, I had the pleasure of co-hosting our daughter's, Ashanti, 40th birthday bash. Working with one of the owners, Maxine, made the preparations easy. The ambiance at Amarachi is perfect for parties and contributed to a great party. The food was great and the staff was friendly, attentive and helpful. Amarachi is located near the Brooklyn Hampton Inn on Flatbush Ext near Manhattan Bridge; Thus, out of town guests can walk from hotel to Amarachi easily.Discounted parking is offered at a nearby parking garage on Gold Street.\nAmarachi serves  lunches and dinners daily and weekend brunches.\nI highly recommend visits and events at Amarachi Lounge.\nNoreen Hosier, Brooklyn", "author": "Noreen H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-03-21", "description": "Careless, rude, sad, SERVICE.\n\nWhere should I start. This place is terrible, the service, ambiance and the cleanliness. Love the decor! I booked a reservation for a celebratory brunch. I called back to leave my card information. They then told me that I couldn't have booked anything because there was a promoter there who had booked the entire restaurant for the day. This was unprofessional. So they gave me the promoters information. His name was \"Butta\". That was already a sign that things wouldn't be professional what so ever. \n\nSo we called the promoter and emailed him for the reservations. He confirmed and my guests arrived. An hour after arrival my guests were still sipping on iceless water. No utensils and Devon the waitress had not taken orders because the restaurant was \nclueless to what menu we would use. They had 2 weeks to do this. Devon brought out 6 appetizers for 12 people. One of my guest had to get the silverware from the bar. \n\nThere was a table who came after us and we're seated in OUR VIP area. They were loud and obnoxious. One of the men there must have known the owner so he was disrespectful. Asked us why we hadn't received our food and that he was special because he received his food first. We attempted to dismiss him from our table and he told us he can do whatever the \"fuck\" he wanted. He then said he is OK with smacking women and so we began to ignore him. Minutes later he got into an altercation with another man who was holding his waist before being told to leave. Holding your waist=you're carrying a gun. \n\nThe utensils were dirty. It was now 5pm and we had not received our food nor did we receive our drinks. The waitress came with salad and placed our salads on an empty table and walked away. \n\nI am all for black business as I was celebrating a huge accomplishment. Please whatever you do, do not come here when there is an event. It is terrible. Maybe you can try your luck when the \"hood\" crowd is gone. The establishment is African owned. So we were really disheartened. We stayed for 2.5 hours before leaving. The brunch was ruined. We went to Piquant and the service was incredible as always.", "author": "Naika C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-05-21", "description": "My two star rated is solely based on service and NOT food. The food was OUTSTANDING. The service was downright awful :-( We came here for a dual celebration of both my father's birthday and cousin's scholastic accomplishment. But the service was almost embarrassing to say the least. The server took our drink orders, and came back with our drinks individually and at one point doubled up. My question to the establishment is, do you not supply waitstaff with trays? We had a party of 7 and had many of our drinks served at separate times. We ordered the spicy goat soup, jerk and sweet spicy wings, and the calamari as apps. Those came out separately and kind of untimely as well. The calamari and wings came out first and the soup took another entire 15 minutes to drop. Considering it was one of the guest's of honor's dishes, it felt like an eternity! \nAfter we consumed our DELICIOUS apps, our entree's proceeded to come out, which were amazing might I add. But...we didn't have any knives on the table for our entrees which consisted of fried snapper with jollof rice, salmon with mashed potatoes, burgers and chicken fingers/fries. We ate the food as again, it was amazing, but the server NEVER came back to check on us or inquire whether everything was alright or if we even wanted to add more drinks etc. My suspicion is that she was new as she came to the table approximately 20 times to set items down. At the end of our meal, I went over to her to state the reasoning behind our night out (which I originally said when I made the reservation). She came out with desert for both party members and they went on to enjoy them but she proceeded to remove utensils and glassware with unfinished drinks in them WHILE WE WERE STILL SEATED! One would think common sense would NOT have allowed her to do such...\nFinally she did tried to remove the dessert from the table while we were STILL EATING IT! I think I'll stop now. Please please please Amarachi, re train or meet with staff regarding do's and don'ts of dining. Thank you otherwise for the amazing food!", "author": "Jean B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-22", "description": "Honestly one of the best restaurants I've been to. The vibe and energy was right, the food was delicious, the drinks were good, and the service was awesome. Would def come here again. A Caribbean vibe all the way.", "author": "Kiara M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-26", "description": "Never knew this gem was across the street from me. We had the calamari appetizer and oxtail entree. The food was delicious and we were stuffed! Our waitress was great too. Very helpful and knowledgeable. I will most definitely be coming back again", "author": "David E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-24", "description": "Had the pleasure of attending a family dinner at Amarchi last night. There was a bit of confusion in the beginning but in true form,  the owners aimed to provide quality service and satisfaction to all the dinner guests. The bub rub was excellent and, as always, I enjoyed the shrimp linguine. I took my desert to go....... The cheesecake looks decadent and I know will be delicious. (I need to do a couple laps around the track first, hehe.)", "author": "Jonelle D."}], "servesCuisine": "American (Traditional)", "priceRange": "$11-30", "name": "AMARACHI", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "189 Bridge St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/1LakWYHK0MG_HhfpLxK03A/ls.jpg", "@type": "Restaurant", "telephone": "+17182221010"}