{"aggregateRating": {"reviewCount": 310, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-11-24", "description": "The worse chicken and waffles meal I ever had at Brunch! The waffles were basically hard and inedible. The chicken, on the contrary, was decent. Came here for a Woman's Empowerment brunch and highly doubt I'll be back here again.", "author": "Jessy L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-19", "description": "I had the Extreme pleasure of visiting Amarachi this past Sunday, Dec. 17th, and the experience was Awesome! \n\nThe food, the atmosphere and the customer service was outstanding! Our Ushers' department came in to celebrate Christmas and we were treated like royalty! Lady A's smile, grace and professionalism shined through when she first answered the phone, throughout our meal, and we when departed!\n\nAmarachi is comfy, cozy, inviting and the food is Delicious! I had the oxtails with rice \u0026 beans. When I say melt in your mouth...Yummm! The background music is very soothing and will either leave you dancing in your seat, or may lead you straight to the dance floor to work off the calories from the delectable meals!\n\nUpon winding down our meals, we also had the pleasure of meeting one of the owners, Max. She was friendly, gracious, and made you feel like family.\n\nOur Ushers' department will be back again! If you haven't visited Amarachi, come in, relax and Enjoyyyyy! You will be so pleased you came.", "author": "J.L. H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-01-23", "description": "The food here isnt bad but it isnt great it's a nice huge space service was soooooooo slow tht was the biggest dwn fall", "author": "Gwendolyn O."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-05", "description": "Amarachi to me is a hidden gem. Hidden, because it is located in downtown Brooklyn and I would have never thought to venture in this particular area, and a gem because I thought I had been to every brunch (unlimited and those who supply you with your very own carafe) in NYC.\n\nHowever, I was introduced to them after attending a birthday brunch, and look forward to coming back after the experience. The staff was very nice and accommodating considering majority of the party was late (majority as in all but me lol). \n\nTo eat, I opted for the Jollof Rice and Suya which was soo delicious. Please note that this place is Nigerian, and my Ghanaian friend who will rename nameless so he is not shunned also enjoyed it. For brunch everyone gets their own carafe and can choose between orange, mango, guava or pineapple mimosa. I tend to only ever hear \"mango\" and nothing before or after, so I opted for this which was good, and then tried everyone elses. I thought that the guava was a hit as well. I will definitely stop in again soon to try their other dishes (the honey jack french toast looked amazing!).", "author": "Shakira W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-15", "description": "What an excellent find!  Food was phenomenal.  Something different, featuring a mix of African, Caribbean, Indian and American fare!  Highly recommend.  It's in a odd location but worth the effort to find it next to the bridge entrance ramp.", "author": "Susan A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-12", "description": "We had a group of 35 celebrating our boss this evening.  Had food from a delicious prix fixe menu enjoyed by everyone.  Serving such a large group took skill, professionalism and care.  Karen and Juliette were our servers and were outstanding.  Looking forward to visiting again!!", "author": "Pamela M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-22", "description": "Great service for happy hour. Food selection was nice.  Food could be a little more authentic.  Drinks were good.  Parking in the area is very tough.", "author": "Diana R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-20", "description": "I recently made a reservation for 16 for my cousin's bachelorette celebration. I spoke multiple times with the manager about arrangements including a private room, prefix menu and ability to decorate the space. He assured me he could accommodate all my requests. The day of the bachelorette, I was very disappointed. The first mishap is my party was not able to decorate ahead of time or have desserts dropped. When my bachelorette party arrived we were greeted by another wedding reception in full effect. The manager then proceeds to tell me that he never promised me a private room and the place does not have private rooms even though I paid a $100 deposit to hold the reservation. He then shows me a private room that he soon after informed me has been booked. To top my frustrations management placed customers not in the bachelorette party in our section. \nThe food was good with good portions sizes but the service was unprofessional and subpar. Luckily the bride to be and guests liked the food and drinks even though so many things went wrong. Word of advice, this is not the place to hold a private event. The manager will lie to get your business and will not care when you're disappointed.", "author": "Heurteloue P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-10-09", "description": "Food was really good first time having African food , drinks were good. Staff service was very unpleasant. I walked in for brunch  and no one greeted me for my reservation. I finally seated myself at the bar  and it took forever to get a waitress attention. The dj was very good and the atmosphere was lively. If I go back it would have to be early", "author": "Sabrina B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-18", "description": "Had an amazing time with my family. For my cousin suprise 45th birthday.. \nFood is delicious and drinks are well worth it. Music is good keep u on your feet...", "author": "Kisha V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-02", "description": "First of all, their food is amazing. I repeat: AMAZING! I've had their Jollof rice, Suya and jerk chicken wings which are all extremely spicy (beware non-Africans) with authentic Nigerian taste and absolutely delicious.\n\nI usually order delivery and I'd just like to comment on that for a second. First, their delivery is extremely fast - typically 30minutes, although it may take longer when busy. Secondly their delivery personnel are just so warm and friendly! I think I'm used to Asian delivery places who just thrust the food in your hands (especially if you've paid \u0026 tipped beforehand) so to encounter such genuinely kind happy people is amazing, and rare. \n\nNow the highlight of my review: Twice now I ordered 2 of the same dish, but only received one. HOWEVER, the manner in which Amarachi corrected the issue was simply above and beyond. I've never experienced this with a restaurant in my entire life - one that goes to such lengths to make good with their patrons. The 1st time, a driver was sent over right away with the missing order and Amarachi included a complimentary dessert. The 2nd occasion which prompted me to write this review, they sent over an ENTIRE bottle of wine as an apology. I'm literally sitting here quite stunned. I've dined at Michelin * joints and never encountered such over-and-above service from a restaurant. I will be telling (and bringing) everyone I know here. And frankly at this point, I don't care how many delivery errors they make in the future - they've got a customer for life! You guys are truly wonderful\n\nA+++++", "author": "Chris E."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-12-06", "description": "Came here last Friday night and the place was pretty empty. I've never had African food so it was worth a try. I ordered the chicken Suya with the Jolloff rice, and omg I couldn't believe how hot (spicy) it was. I specifically asked the waiter if it was hot and her response was \"no it's not that hot\". I hate spicy food so To sat the least I was pretty upset and disappointed. All in all it's a cute little spot with good music. The music is on the loud side, so don't expect hear a word the person across from you is saying. The staff is nice and friendly and they have a little area for dancing. When I was there the crowd was older 45+ and more on a low key chill side. I wouldn't come back because most menu options are spicy; but if you like spice with decent drinks and loud music then this is the place for you.", "author": "Tiah M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-02-15", "description": "Underwhelming experience to say the least :\nOur waitress was dressed inappropriately ( She was spilling out of here clothes while serving food )\nThe prefix menu was very limited (they only offered fish or beef)\nThe wine menu was lackluster  \nAfter we placed our orders we were only given forks no knives ?! \nNot what we hoped for on Valentine's day.", "author": "Raven M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-01-16", "description": "I came to this place with my bf thinking I was going to get authentic Nigerian food. The only thing authentic about the food is the names on the menu.food wasn't that great. It was too spicy. My bf thought his jollof  rice was hard. The drinks were not that good and the service was horrible. I personally would never go back.", "author": "Cathy J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-19", "description": "Came here last week Saturday because i was long over due for a brunch and morning drinks. This spot is very spacious with a lot of seating room. The wait staff were so  friendly. I love the music they were playing. The only thing I did not like was the food. It felt like a lot of frozen meals that were warm up. \n\nI do not believe I will come back again or suggest it as a good brunch place to go to. \n\nMy total bill was $41", "author": "Cynthia R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-23", "description": "I love this place! Great food, great ambiance and really good music. Before having my husband's 40th birthday dinner here last week, i had been here two times for happy hour. I never had any of their entrees, so I was pleasantly surprised to find out just how great their food was for my husband's dinner. The owner was very accommodating leading up to the dinner. I made a few changes to the number of people in my party and the owner and waitress was very patient with me. Overall, i have nothing negative to say about this restaurant!!! Loved Loved Loved everything about it.", "author": "Khalilah H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-15", "description": "Saturday November 10th, a day before my birthday I was honored and celebrated at Amarachi hosted by few friends and family for the first time. They're few great things I would like to mention about this restaurant. If you enjoy spices, and the Afro-centric culture this is the place for you. In addition Amarachi have great African food. On the other hand, at a certain time there is a musical band that performs wonderfully. However the food was more than enough. Finally, LOOK OUT for Ashley the \"waitress\" who is beyond sweet and friendly. Thank you Amarachi!", "author": "Utshudiandjeka L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-30", "description": "Service was impeccable! The salmon was to die for and so was the suya and Jollof rice. The girls who work there were very accommodating and pleasant! Oh and they serve hookah which is a plus for me. I'll definitely be coming back!", "author": "Nagi P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-11-10", "description": "I wish I could give this spot no stars ... today was my first time attending \u0026 it was completely horrible ... the food was regular ... the music was good no dj tho .... but the hookah the main reason why I went was horrible it wouldn't pull at all... the hostess changed it 4 times to I got fed up and said forget it .... OH DONT LET ME FORGET THE NASTY ASS BAHAMA MAMA I HAD ... I will never return again ... now I'm at Harlem hookah for a redo ...", "author": "Brittney M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-24", "description": "My friends and i assemble at Amarachi about once a year if we can, and it's ALWAYS a loving, amazing, life-affirming time.\n\nThis past weekend, we were expertly taken care of by Ms. Karen who kept the libations (and shots) flowing, kept us laughing, and genuinely treated us like family. Plus the DJ had us all on our feet by the end with new and old school vibes.\n\nIn addition, all of the food we ordered was great - there were several orders of the oxtail with rice \u0026 peas, the salmon with mashed potatoes, the pepper soup, and an initial starter of calamari and spicy wings. Didn't i just say that ALL OF THE FOOD WAS AMAZING? Believe it.\n\nOne of the restaurant's founders (Mr. Sam) is also a fellow HS alum of ours so he def came by our table and showed us mad love as he always does. \n\ni can't thank Amarachi enough for such a lovely evening. This spot just keeps giving us more and more wonderful memories.", "author": "Nelle C."}], "servesCuisine": "American (Traditional)", "priceRange": "$11-30", "name": "AMARACHI", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "189 Bridge St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/1LakWYHK0MG_HhfpLxK03A/ls.jpg", "@type": "Restaurant", "telephone": "+17182221010"}