{"aggregateRating": {"reviewCount": 310, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-29", "description": "Great restaurant.. waitress is beyond nice food was awesome music and atmosphere is wonderful", "author": "Safiya R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-12", "description": "Incredibly impressed with the restuarants decor, customer service, menu and the owners commitment to give back to the community. White linen cloths adorn the many tables which occupy the indoor/outdoor venue. Cocktails are delicious and complimented by the many big screen tv's that display your favorite sports team or favorite primetime show.\n\nSpace is available for private events", "author": "MyHungryWorld W."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-11-06", "description": "I attended a birthday brunch this past Saturday here. We were a very large group, there were probably about 30-35 people in attendance. We were giving the the back section of the restaurant. I have worked in food service before so I know the process that is put in place when serving a large group. There was one server which was a female who was not too pleasant. Prior to us arriving, the management received a head count weeks prior, so you would have thought they would have been more prepared. The brunch cost per head was $51, which included an entree and your own personal pitcher of mimosa of your chosen, $20 more for the Henny mimosa pitcher. The server took orders and didn't write anything down. She was bringing plates literally one at a time and to different tables at a time instead a getting a table one by one orders out at the same time. She was bringing out food and mimosa orders to the wrong guest. It was very unorganized. They also ended up running out of champagne and no more mimosas was able to be ordered. I found out after we left that this restaurant had a grade B from health inspection. This place needs a lot of improvement. It's sad because I'm always down to support my fellow black business but we have to do better. Express my frustrations to management you say? Where was management exactly? You guys knew you were expecting a large group that day management should have been there to make sure everything went smoothly! So you mean to tell me management was there the whole time and saw your server struggling but didn't step in to help?! My point exactly! Do better!", "author": "Ebony Z."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-09", "description": "So good.  Had the salmon here and was very impressed.  I've also had the wings that were pretty good as well.  Great atmosphere fun vibe.  Can bring a group or be a date night.  Nice surrounding area as well.", "author": "Royce W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-03-02", "description": "Horrible location, very difficult to find,.\n\nWe came in for Sunday Brunch celebrating a friends birthday. \n\nThe Waitress Karen needs some major professional work. She can not manage large groups, and is extremely unapologetic for her mishaps. \n\nOnce you have a party over 4, gratuity is automatically included and its obvious that she knew she had to only work minimally because she was being tipped regardless. \n\nWhy take down everyone's name for their order but still get it incorrect?\n\nHow did one person NEVER receive their food? then you come out and lie and say that its being prepared when you never even put the order in !?  \n\nWhy when asked to speak with management we get the run around? Then management appears with the missing food, thinking this would make it all better, but of course the order is STILL incorrect.\n\nGet it together people, we will never step foot back in this establishment again.\n\nIf i could give it 0 stars I WOULD !\n\nHorrible, just horrible. You should never let your customers leave your establishment feeling this way. Truly Disgusted !", "author": "Sarita A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-13", "description": "Great food, lovely waitress. The location was ideal and beautiful night view. The portions were excellent too much for one sitting. Will return", "author": "Cellini D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-02-22", "description": "My girlfriends and I have decided to hit all the Black Owned Restaurants in NYC.  Amarachi was our first stop and we were not very happy. Our reservation was for 7pm on a Saturday night for 10. Ambiance 5 Stars, floor Mgr/Waiter/Bartender (Tyrese) 5 Stars and the DJ 10 Stars, love the DJ. The menu was short, \"No Problem\" \"Big Problem\" most of the items requested were not available at 7pm on a Friday night. Question What time does the \"Kitchen Close\".  Very disappointing and it to 45 mintinues for half of the table to recieve their order and the other half 1hours. (sad face)\n\nIf it wasn't for Tyrese, who did his best to make us happy by suggesting food on the menu that was their top seller which was limited in servings or not available. He provided complimentary Champagne cocktail to sooth the beast within \"10 Disappoint Black Women\" . \nIt a nice place for \"After Dinner Social\", not for Dinner! \nMaybe Brunch or Lunch, Not Dinner!", "author": "Avilla C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-24", "description": "I came here for the third time about a week ago and it's clear why I keep coming back lol. The second time I went, I went with my mother and brother and our waitress was very social and friendly. My mom practically made friends with her. The last time I went was with a group of 5 friends after our reservation for another spot fell through. My friend asked if I knew a better spot in Brooklyn and I was like Hell yeah Amarachi! We got here, they made a few arrangements and sat us in five minutes without reservations. The waitress we had I'm pretty sure was the waitress  I had last time and she was again, very sociable and funny. My friends and I ordered two rounds of the Hennessy mimosa and we loved it to say the least lol. My friends and I ended up having a great time and loving the food, music, and ambiance so I'm glad I've made this a regular spot!", "author": "Sahara J."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-03-26", "description": "After traveling over the Manhattan bridge several times and seeing this restaurant my friend and I decided to have an early dinner waitress was very attentive but our food was horrible his salmon was over cooked no chef should messed up on cooking salmon and I had shrimp stir fry vegetables the shrimp was like rubber over cooked and vegetables especially the broccoli over cooked and rest of vegetables was cold it's was like the  vegetables was cooked and was sitting in kitchen the rice was tasty but it microwave warm p this chef decided let's plate this nasty ass food and serve it to paying customers I've learned cut your losses and move on when come to food because you make noise about your food you don't know what is going to happen when your food come back out from that kitchen", "author": "Annette F."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-12-10", "description": "This restaurant\\lounge\\sports bar feels like it use to be a strip club, unfortunately the service is not as good as a strip club and we had to wait an entire hour for food on a not so busy Saturday. When the food did arrive 3 of the 4 plates were room temperature (apparently there was an issue with one of the orders so they just let them sit instead of bringing them over).\n\nThe atmosphere was loud, the seats were too low and uncomfortable, and the prices were definitely too high. Not coming back here again.", "author": "Yoav E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-06", "description": "Decided to go somewhere different for a Friday date night, stumbled upon this. \nI was excited to go because I FULLY SUPPORT BLACK BUSINESS, yet a little skeptical because of the many mixed reviews. The location is right by the Manhattan Bridge in the cut. \n\nGoing in it looked pretty cool. It was smaller than I expect and seen from some pictures. The first thing that hit me was the loud music. I know it's a kinda a lounge but for small spot, the loud music wasn't necessary. The decor was okay, could've been better, they had a basketball game on the multiple TV screens, which we didn't mind, being that me and my boyfriend are basketball fans. We were seated by the window in these short, long looking chairs. Me and boyfriend were freezing, sinking into these super soft cozy chairs and on top of that the music was loud. so we were trying to look and talk to each other other for a good 5 minutes. Then our waitress (Rachel) came and we asked to change tables. Thank God it wasn't packed because were would've been stuck in those seats.\n\nRachel, was super friendly and had a great energy. While ordering our food she even helped with further describing dishes, drinks and appetizers. The wait for the food was a bit long, but the drinks were pretty cool. I had the Lagos Island, it wasn't really strong and I told Rachel, she quickly went to the bar and got an extra shot to add to the drink, free of charge. My boyfriend had the classic Long Island and that was the strongest long island I tasted in a while, he loved it. We had the Jerk and Buffalo wings and they were REALLY good, spicy and well cooked. We also got Fried Calamari, it came a late but it was AMAZING! Best calamari I had in a while (I am a thorough Calamari lover). \n\nWhen our food finally came it smelled so good, I got the Oxtail with rice and he got Curry and Rice. Then I realize, he originally ordered the Shrimp Pasta, but he said it was fine and actually loved the dish, so we didn't complain lol The Oxtail could've been better, I am used to melt in your mouth Oxtail but nonetheless it was good. \n\nAs the night went on, the DJ started playing some really good music so I didn't mind the loudness. Overall, it was a good first time, would like to go back to try other things on the menu, and for the CALAMARI AND LONG ISLAND ICE TEA!", "author": "Rebecca S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-04", "description": "What a fantastic experience. .we had a party of 5 and was treated like family 2 thumbs up for the foof,drink as we as the hospitality. ...this establishment is a must do try\n...", "author": "Rashidah B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-11-18", "description": "The food was ok. When my friends \u0026 I went for brunch, their fryer was being serviced so I couldn't get the calamari or the fish \u0026 chips. But I took it as a sign that I needed to skip on the fried foods . I had a sliced beef \u0026 rice dish. The rice was tasty but the meat was dry. My friend had curry chicken dish that was btwn ok \u0026 good. My other friend had a shrimp \u0026 pasta dish that she seemed to like enough.", "author": "Tasha P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-22", "description": "Very disappointing; service was bad, orders were messed up, overpriced for the quality of food \u0026 drinks. Always want to support black businesses, but unfortunately this is not one of them. Will not return. Went for a late lunch around 4pm. Was very empty. Music is good...that's about it.", "author": "Cory E."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-05-05", "description": "Very very less vegetarian option available! And what I ordered, I didn't like it either. Stir fry vegetables.", "author": "Kushagra A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-26", "description": "I ABSOLUTELY LOVE THIS PLACE! It's right up the block, great food, great drinks (The white sangria and blue motorcycles/long islands are everything) It's community friendly, in the perfect area, great for anything! Brunch, sports, birthdays, you name it! I'm a fan!", "author": "Raymon W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-05-22", "description": "Suggested this restaurant to my family for a 60th Birthday celebration. I've been here 2 times previously, once at the bar to watch a game with some friends \u0026 another for a similar birthday celebration. Only had appetizers and drinks on both occasions. I try my best to support Black owned restaurants--my cousin selected the restaurant for her own reasons Im assuming ( I sent her a list of suggestions).\n\nWe arrived a little late for our reservation, so I'll take the blame for that. When we were all seated (13 of us) another larger party walked in. We were seated for a while before orders were taken. We had a prefixed menu and the waiter took our orders--I would assume appetizers, salads, and drinks would come out soon. About an hour passed and we got NOTHING! We watched as the big party got served and we just waited, eventually we received SOME salads and appetizers. Everything came out in pieces. Mind you, the waiter wrote everything down with our names--yet when she came to the table she still had to ask what was missing and who got what. I was beyond annoyed at this point because I had other plans scheduled and had no intention on staying in the restaurant 3.5-4 hours. \n\nAround 10-10:30pm some food started coming out, everyone was ready to go and we asked for the food to be packed to go. Some people still didn't receive meals, they ran out of 1 of the dessert options and I guess handed out whatever they had available. I just don't understand how this can happen. No apologies from the owner who greeted us when we arrived, just the waitress saying the kitchen screwed up. Don't know how a kitchen can screw up on food/run out when this was the menu that was offered to us. NEVER AGAIN--as many people said before the food is good, but I would have liked to have enjoyed it at the restaurant not at home. \n\nIf they needed help they had plenty of workers standing around and hanging out at the bar, but I guess that larger party was the priority of the night. Many people looked as annoyed as we did", "author": "Nay B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-16", "description": "Amazing service, amazing food, amazing drinks! I will definitely be back. The staff is super friendly and accommodating. The house punch is really good and is highly recommended. The jollof rice is great with the beef. Looking forward to going back to try the Eba and Igusi soup.", "author": "Amira O."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-12-16", "description": "Reply to Management:\n\nBased on your reply to my review, you clearly have no idea what customer service is all about and you have the audacity to be religious about it. It will be in your best interest to  learn about customer service, go to other businesses websites and read how other managers reply to customer dissatisfaction. I'm done here completely. Don't worry, I will never come to your restaurant ever! What's really sad is I brought you a lot of business that day but you lost it by your service. My friends would  have marketed this spot very well if not for the horrible customer service which left a sour taste in their mouths. Also, FYI, it was your waitress who had suggested we cut the cake as planned, I was ready to go. What sets a restaurant apart is excellent customer service. Learn to listen to your customers to understand why they really feel the way they do instead of pre- judging  them and suspecting everyone. Our conversation would have ended much better if you only listened.", "author": "Samantha O."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-09-30", "description": "This place is pretty cute. The food wAs so so. I kinda liked them a little bit more when the were in bed study. Probably go check them out again before the new year.", "author": "Kiesha B."}], "servesCuisine": "American (Traditional)", "priceRange": "$11-30", "name": "AMARACHI", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "189 Bridge St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/1LakWYHK0MG_HhfpLxK03A/ls.jpg", "@type": "Restaurant", "telephone": "+17182221010"}