{"aggregateRating": {"reviewCount": 310, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-12", "description": "I enjoyed my sister birthday celebration there. It's all we were talking about the next day. The food was great with hefty size portions. The music was nice, making it a great atmosphere to socialize in. Thumbs up for Amarachi", "author": "Stephanie S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-10-26", "description": "I was going to give this place a bad review, however the music and the friendly staff gave them an extra star. I went on a Sunday for brunch,I would go back for the music and the vibe but not the food. The bathrooms were disgusting wet floors, flies everywhere, just nasty. Main reason why I wouldn't eat here because if the bathroom looks like that i can only imagine the kitchen. However the drinks were good. I say skip the food and go for the drinks and the good music.", "author": "Molly S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-10", "description": "Amarachi was introduced to me while out for the evening with a gentleman. Amarachi is best described as a sports lounge, fused with elements of a night club and a Nigerian wedding. Ever experienced it ? Me neither. There's a first time for everything. \n\nLocated on Bridge Street, downtown Brooklyn easily accessible by the BQE to Tillary street is Amarachi. The name alone had me expecting Italian or Latino cuisine. Not quite folks! This is African-Caribbean-American fusion. When you arrive, there are several flat screen TV's, a large bar, lavish drapes, posh plush leather seating, clouds of Hookah smoke soar throughout the air, hip hop fused with songs that will make you want to pin a couple of $20's on someone's wedding gown and feast on some joloff rice and stew. \n\nThe menu is once again a peculiar mix of African-Caribbean fusion. Some of the menu items listed are Wings, Oxtail, stews and a staple African dish: Joloff Rice. A one-pot rice dish popular in many West African countries. It is a progenitor of the Louisianian dish jambalaya.There are many American classics listed on the menu also such as shrimp alfredo pasta and calamari. My date and I ordered both along with beers. Those items were basic recipes that were not memorable. I am curious about returning for the authentic stews, Oxtail and Joloff rice. \n\nThis is a gorgeous venue to host an event. Ideal for birthdays, engagement parties, baby showers.", "author": "Marissa M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-30", "description": "It has great food and the music is dope a mix of Afro beats... soca and dancehall .. the drinks are good and it's a place for a group and for only 2 ppl ... lowkey Brooklyn spot", "author": "Keary .."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-05", "description": "This was a beautiful place nice ambiance and my Brother in law Birthday was amazing...Nigerian style Jerk was spicy and favorable everything was delicious my coordinator came to celebrate a family friend fathers birthday and they all enjoyed everything...we Thank You\n\nThompson Family", "author": "Julez M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-28", "description": "Went here for my birthday and it was great! Food was delicious and our server Lavina was so attentive and made sure my birthday was fantastic!!! The music was on point as well! Soca, Afrobeats, Rnb, Hip Hop. I will be back.", "author": "Cyesha F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-14", "description": "I love this place! I recommend them to all my friends who wanna get turnt while enjoying great food! The staff is so nice and attentive. \n\nDuring my last visit, I tried their jollof rice with the vegetarian stir fry. It was my first time earring jollof rice (please don't judge me) and I'm hooked. Currently looking for a Naija boyfriend to make that every night. \n\nI did have an issue with our server, as sweet as she was. She did get the card info mixed up/split incorrectly which resulted in me owing my friend some money lol. But it was a simple mistake and she was great with everything else. \n\nThe music is ALWAYS on point. The perfect mixes of 90's R\u0026B, 00's R\u0026B, Reggae, Soca, Afro beats ans hip hop. It was so hard for us to leave after dinner that we just sat by the bar lol. This place is a gem.", "author": "Keys R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-11", "description": "The staff is friendly and I like the ambiance. I have gone for lunch , dinner , and brunch and enjoyed each visit....Especially brunch ....Hennessy Mimosas...Fya !", "author": "Freddie M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-03", "description": "My SO and I frequently try new places based upon their Groupon offers. So after a short scroll through groupon on this fine Sunday, we ended up at Amarachi around 4:30. \n\nIn terms of ambiance this place has all the potential to be beautiful. It's a large space, It just lacks the right creative vision. I'm not sure if it was meant to be a nightclub vibe, an African theme, or a sports bar. It's just a big combo of the three and it ends up amounting to nothing substantial. They have a live DJ that plays hip hop, soca, dancehall, edm, etc. Basically club music but I happen to enjoy that. It's loud so I wouldn't come here if you planned on having a talk with your date. \n\nI'm here on a Sunday. We were presented with a prix fixe brunch style menu priced at $40 for a carafe filled with a mimosa of your choice and an entree. They didn't honor our Groupon for this menu so we opted for the regular menu which featured more options as well as those from the brunch menu. Cool. Upon further inspection of the regular menu the prix fixe menu didn't make much sense unless we both planned on downing a carafe of mimosa each. Depending upon the entree you chose the regular menu would've been much cheaper even with the carafe. \n\nWe both ordered the French toast and then we had a wing platter to share. We also ordered the carafe of a tropical flavored mimosa. The food tasted great but it took very long to get it. We arrived at 4:30 and didn't get the French toast until 6:20. Then the wing platter took another 25 minutes to get to us. The French toast was barely warm when we got it, but still tasty. The wing platter was hot and very good as well. The jerk wings were great and definitely spicy. I'm not sure what the other flavor was but it was sweet and also good. The fries were crispy and well seasoned. The bill came up to around $60, so not terrible. \n\nIn their defense, it seemed to be busy. There was a large birthday party next to us so I assume they took priority. The waitress was quite apologetic and offered us free shots and another mimosa for our patience. \n\nDespite all of the issues, I may go back on a different day of the week. The food was good, drinks were good and strong and they play great music. It feels like you're in the club, but with awesome food.", "author": "Ray A."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-02-01", "description": "Negative. \n\nFirst, there's a photo posted 3 months ago with happy hour specials. That is no longer valid. There is nothing posted any where about happy hour. You have to ask and even then you aren't given a straight answer. I asked the bartender what the happy hour specials are. His response? \"What do you want?\" And even then, we were not given prices. We ordered margaritas. They were $8. Had no clue until we got the bill. \n\nWe ordered fries, sweet chili wings and fried calamari. All appetizers, but they all took forever to come out. Nevertheless, they were good. \n\nI frequent happy hours. It's nice when you walk into an establishment and their happy hour specials are posted and you're able to make an informed decision. \n\nIdk if I'd return, for the reasons listed above, which sucks since this place is so close to my job. \n\nP.S. Happy hour is only at the bar.", "author": "Cassie V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-02", "description": "I had an amazing experience at Amarachi today! From the music, vibes, energy, ambiance, decor, beverages, food and service ... I was overall pleased with my birthday brunch! All of my guests and I had arrived at different times and the server Ari was very accommodating. Once we ordered our food it came out very quickly and we had no complaints whatsoever !!! I couldn't have had a better experience , my friends and I loved it !", "author": "Ashley D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-06-06", "description": "Last night was my second visit to Amarachi.  The first time I went it was a Friday night and the experience was fine.  Last night (TUESDAY) my experience was not so good.  I didn't notice the decor on my first visit but last night it was obvious how subpar it was.  Our waitress was very nice but we waited over an hour for a food (there were only two other tables there!)  The fish tacos were GREAT!!! My oxtails were down right nasty.  The waitress explained that it was the Nigerian version of oxtails, I wish that was made plain on the menu.  The rice was seasoned with something that I did not like!  If you are a lover of Nigerian food maybe this spot would work for you but this Bajan girl is unforgiving of some bad oxtails!", "author": "Yolanda A M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-04-08", "description": "Only 2 stars and I'm just in a good mood...went there earlier today for a friend's birthday brunch.  Off the bat, the first strike was the wait staff not taking our beverage and food orders in advance, as we were such a large group.  2nd strike, the staff turning UP for the duration of the time we were there, taking group shots, smoking hookah, as my table waited almost an hour and a half for even water, which game in cloudy, dirty pitchers.  We watched 2 tables basically eat and drink before us.  Finally as we were served, i did not get my pitcher of mimosa (pitcher was cloudy and dirty) until my friend, told our waitress i hadn't received my drink.  2 stars for the food, the wings were tasty and the shimp linguine was good.  Super disappointed with my overall experience, there was no sense of urgency to accommodate us as a group.", "author": "Rasheeda W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-19", "description": "This is a great spot with the delicious food and  nice environment. Great music! We had a pleasure meeting Ciara who is a manager and she is the most friendliest person. Verybpolite,sweet,knows her restaurant menu very well.  Gave us great recommendation for the lunch . If you are in the area,make sure you stop by this restaurant and try their food.  Oh! And don't forget the carrot cake! It tasted like heaven!", "author": "Dinara I."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-18", "description": "I stumbled upon this restaurant this restaurant this yr...and CAN'T get enough! The ambience is that of a restaurant/sports bar/lounge. They have many big screens tv's so you could enjoy whichever game you're into. The music is always great...Afrobeats, hiphop, \u0026 a lil reggae. The staff is hospitable and serve with love...you'll feel like family. They have a long happy hour from 4-8! The drinks are great and pack a punch...my favs are The Lagos Punch (if you like strong \u0026 sweet), The signature margarita (I like it with mango nectar), the Henny Mimosa (I'm not a Henny girl, but this is absolutely worth a try) and their mojitos- surprisingly not everyone makes a great mojito, but they get it right.  Now onto the STAR of the show...THE FOOD! Omg the Jerk Shrimp Linguine is SMACK YA MAMMA good. Soooo good! I order it a lot...Mr. E (the chef) works magic!  I've also had their calamari...truly one of the BEST I've tasted, Chicken Quesadilla...so simple yet so delicious, Chilean Salmon-loved the parmesan sauce that came with it, wings (sweet chilli \u0026 Jerk parm), even the fries are special lol, they come dusted in spices called \"bub rub\" I believe...named after one of the owners:)\n\nSpeaking of owners, this is a family operated, black owned business! Love that. Let's support small businesses and of course let's not forget about those that are black owned. \n\nCons- parking. However there are parking garages in the area. If you take public transportation its a short walk...not bad at all...take an uber, even better", "author": "Kelisiah H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-18", "description": "I feel any place that's litty on a Sunday! Oh, and the food was great too. Authentic Nigerian and/or Caribbean food. We had a large group, so it was so nice to have a whole section to ourselves. Service was wonderful, thanks Karen! Lovely ambiance with good music! Can't wait to come back!", "author": "Caroline T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-24", "description": "Went to amarachi last week and the food was sooo amazing. And I have to add we had the best bartender ever Lady A!!!!!!", "author": "Carla F."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-08-27", "description": "B rating in the window.  Water glasses were cloudy with a lot of residue.  Champagne/mimosas glasses had lipstick on it. A general mop-water smell lingering in the air. Strike 1.... \n\nI STILL was willing to stay,  commenting to my fiance,  \"The food better be bangin'!\" It was not. She ordered The Big Breakfast - French Toast, bacon, and eggs. I ordered The Chicken and Waffles. The waitress brought her dish and informed me that they were out of waffle batter.  (We were the first reservation/ customers of the day.  How are you out? How does the kitchen staff NOT inform the waitress/ hostess before customers arrive that,  presumably, the most popular brunch dish isn't available?  Strike 2.\n\nAs I tried to decide what to replace my order with,  I noticed my fiance poking,  touching,  and picking at her eggs,  like a middle school frog dissection.  She said \"It's... cold.\" I peeked at her eggs and immediately knew - this wasn't freshly prepared. Judging by temperature and rubbery consistency of eggs, we concluded that they must've have been cooked and refrigerated at least a day before,  and now re-plated. Strike 3! We're out!\n\nWe ordered a pitcher of mimosas to accompany our food,  which we finished during our wait.  I explained that we were leaving but willing to pay for our drinks. The manager came over,  apologized sincerely for our experience,  and refunded the cost for the drinks.  We appreciated that. But what was really eerie was the fact that, while they were remorseful,  neither the manager nor the waitress seemed very surprised about our experience. As if this was \"old hat\" and we just happened to be customers who noticed and complained. \n\nSidenote: The cost structure of the brunch  isn't very crystal clear on the menu, so pay attention: All brunch entrees are $20.  Entree + 1 mimosa =  $25.  Entree + 1 pitcher (a carafe) of mimosas =  $40.\n\nOverall,  I can only gather that this is a club/ lounge posing as a real restaurant.  We noticed the DJ set-up and nighttime party flyers with drink specials - looks like a great time! Perhaps I'll be back,  but not to eat. Only to listen to some music and have a few drinks (but only out of plastic cups).", "author": "K V."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-11-10", "description": "I'm never the type to write bad reviews, I'm not even the type to write reviews at all! But this needs to be known lol and I laugh because the service was so bad it's comical. Walked into what I thought would be your average night spot because it just has that vibe when you walk in. They did sit us down right away, maybe do to the fact it was hardly anybody in there we ordered drinks wings and hooka. The drink took atleast 15 minutes to start coming out they came one by one with more than a five minute separation. Cool we have the drinks now where's the hooka? The hooka came out and when it did it went back 3 times because it wouldn't pull and the hooka girl seemed to have an attitude about it. Whatever atleast we have wings smh they were tough and the only person who ate them she ate them cause she was drinking before and wanted something i her stomach. At that point we just gave up left the drinks on the table because they were disgusting and didn't even wait for the hooka to come back out because it wasn't worth it screw it keep the $30 we done. If it wasn't for the music I would give them zero stars if I could. It was my first and last time going there hope whoever goes has a better experience but they got a lot of improving to do", "author": "Otto D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-29", "description": "Overall I would have to come back again to see if there will be better service , also two other items , I had calamari and joloff rice as well ,they were good . The service could have been better due to the Resturant was not crowded . The hosts was really nice and welcoming .", "author": "Lytia W."}], "servesCuisine": "American (Traditional)", "priceRange": "$11-30", "name": "AMARACHI", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "189 Bridge St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/1LakWYHK0MG_HhfpLxK03A/ls.jpg", "@type": "Restaurant", "telephone": "+17182221010"}