{"aggregateRating": {"reviewCount": 310, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-25", "description": "I guess this restaurant pays attention to yelpers. I was unsure about what type of service I would receive and it was actually excellent. I do not remember my server's name but she was a beautiful older woman with brown locs. She was knowledgable, fun and let us take our time.\n\nThe decor was awesome. It's a very nice looking restaurant. With that said, I went here with one of my female friends and felt out of place. haha. We were surrounded by couples. I highly recommend this restaurant for date night.There was a party going on when I was there and I couldn't see nor hear the guest so I believe it's also good for groups.\n\nThe food was good. I had the salmon burger, nothing to rave about. Not bad, just good and fresh. I'll probably go back, with a date this time.\n\nParking- It was suprisingly easy to find parking nearby. And I went on a Friday night.", "author": "Kellyann M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-01-01", "description": "My boyfriend and I went last night for New Year's Eve. Absolutely the worst experience I've ever had at a restaurant/event. The food was cold and took forever to come. The bartender took 20 mins just to make 2 drinks and another 10 to run the card. The floor was wet and they had no heat. I will never go back I don't suggest anyone go either.", "author": "Irvondra B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-15", "description": "Good food. Good people! You almost feel at home eating here. Great vibe and it's close to my office so I can grab happy hour there.", "author": "Junior S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-17", "description": "First let me say when Yelp confirms your reservations does not mean the establishment does where do I start first got there about 715 was greeted by a rude host who said she does not have my reservations after I should it to her so so now we decided to leave one of the owners came out asked what happened had us seated as for the food is my salmon was the bomb my date said her oxtail was well seasoned but hard and tuff but I will say my waitress was so nice she made our evening with her great attitude after a ruff start", "author": "Jigga F."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-10-15", "description": "I'm disappointed. I came here before and the food was decent. Except for we could not get seated so we sat at the bar. Today I decided to come here for my 25th birthday. BIG MISTAKE. They took forever to wait on us. I had a friend come and they didn't even give her a menu or water and we asked. We had to ask again to get service. The Mac and cheese tastes weird. And my jerk Rasta pasta was overly seasoned. I give this restaurant 2 stars for the music and the calamari. Oh and I forgot, the waiter brought the wrong drink and instead of waiting another 15 minutes for the right drink I took it. I was still charged for that drink I didn't order. And the drink I originally ordered was cheaper. I would not suggest going here. Kinda wack.", "author": "Breianna H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-18", "description": "I have been to this restaurant twice so far, and I must say that the food is great. I had the Currry chicken dish. As for my drink, I had the popular Lagos Rum punch and the Gun Gin Mule. I shall be revisiting.", "author": "Tamisha D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-03-13", "description": "Ok.... Hmmmm...... I don't know man.... I am still shaking my head a couple of times.... \n\nSo let me start with the positives... this is an extremely beautiful and flavorful venue... the interior is real cool... the sound system... the lounge setting to the multi demensional and functional capacity of the venue are EXCELLENT... PRIME LOCATION...\n\nSo you are wondering why the low rating.... still shaking my head.... a beautiful family friend had her wedding shower at the Resto... she rented out the entire place which was real cool.... SO........\n\nThe Service:1 Star....\n\nRestauraunt Coordination: 1 star... Pre-set menu was chosen and placed on every table... To get the appetizer took 2 hours 1/2.... they had 1 waiter for like 11 different tables... With such a big party where are your waiters and waitresses.. and I mean experienced staff\n\nStaff at the Bar: 1 Star... With literally 4 people at the bar.. the young lady was texting while we were waiting... literally.... who does that...\n\nThe Food: 1 Star... not only did people leave with out eating due to the extremely under staffed service.... To make matters worse... the resto ran OUT OF FOOD... so the remaing guests had to settle for what was left..\n\nThe best thing on my plate was the mixed salad and dressing... The food left no pleasure nor desire to return.\n\nAfter the ambiance... the best part of my night was the two cakes that were served.... and guess what.. it was not from the restaurant... it was from an outside bakery...\n\nBlack Owned Businesses... let's do better and be better.... Experienced Staff is necessary... Trained Staff is necessary... Preparation is Key... Delivering on Service and customer service must be exceptional... The key to REVENUE is to ENSURE the CUSTOMER IS HAPPY!", "author": "Nadia A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-17", "description": "Last minute decision to attend Amarchi for brunch , best decision hands down. Juliet best waitress hands downs , very attentive. Good music , good food, good vibes , good drinks. Very affordable, visit for brunch you won't be disappointed. Had the mango mimosa , so good!!!. For brunch I had salmon best salmon hands down. My best friend had The henny mimosa strong but just right. For appetizers we had jerk wings , finger licking good. Everything was good , great ambience.  Large portion of food.", "author": "Maggie A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-19", "description": "I went here for my birthday 10/04/17 \u0026 the hospitality was great. The food was great. I had the jollof rice w/ the snapper which was fillet. Amazing! The drinks was strong which was what i needed. The waitress was really nice. To show my appreciation i tipped them both and i shared my cupcake cake with them. I'm going back on Friday and i can't wait.", "author": "Domonique M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-21", "description": "Fish tacos with extra sauce really hits the spot. The chicken curry too, amazing. Definitely a spot that has all the food you want and need for great lunch prices.", "author": "Alex C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-09", "description": "The food was excellent! My mother, daughter and I went there yesterday for Mother's Day Brunch. I had the Salmon Burger which was delicious! My mother ordered the Rib Eye Steak and my daughter had the Steak Quesadillas and they both raved about the food! This Caribbean infused eatery has decor that is inviting, cozy and friendly....I would have given this place 5 starts but there were some confusion around our actual order that we placed with the waitress and it took some time for us to receive our food (I did factor in that it was Mother's Day and that it might take longer than usual to be served). All in all, it is a great place and I would recommend it to anyone.", "author": "Alexis M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-02-22", "description": "After watching this place for about a year I finally decided to give it a try. It was my mother's birthday and I wanted to treat her to lunch. It's a really small restaurant. Our waitress was really pleasant. A bit slow as if she was new but that was ok. It was lunch time. No complaints there. In my opinion the restaurant didn't look as good in person as it did in pictures. \n\nI ordered a margarita and the shrimp with fries. The shrimp was really good. Now Im not trying to be petty but the menu said 6 shrimp and when it came out I counted it and there were only 5. I was a little annoyed but I didn't want to complain about it. I knew I was going to yelp about it later on lol. The margarita was strong but I didn't like the way it tasted. \n\nMy mother had the curry chicken with shrimp. She said it was just ok. It was more rice than curry chicken and a few shrimp. She ordered a mango mimosa she enjoyed that more than the food. \n\nI did enjoy the music they were playing. It was a mixture of old school and the top playing songs now. \n\nI dont see myself returning or recommending this establishment to anyone else.", "author": "Pash T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-24", "description": "Last night 1 of my girlfriends had her bridal shower at amarachi, it was my first time there. And I must say the service and the spirit of the servers were impeccable especially Johnathan and another lady who was helping him, so loving and sincere. \nNow the food was amazing, flavorful and just great, I am not a drinker but I tasted someones mango mojito and let me tell you something I had to order 2! \nI am definitely a frequent flyer to this restaurant now!\nKeep up the great work guys!", "author": "Barbara A."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-02-27", "description": "I made a reservation to celebrate my birthday here a few months ago. On the phone, I asked the person I spoke with if I would be able to have the section across from the bar that is slightly sectioned off from the rest of the restaurant, which she agreed to. Then I asked if it would be possible to arrange the tables and chairs so that my 15 guests would be able to mix and mingle with ease since I knew that people would be getting drinks and appetizers as opposed to a full sit-down dinner.  She told me I could, which I very much appreciated.\n\nWhen I got there, it was a different story. The area I had requested was not set up the way I was promised. Then, I was asked to relocate since my party would not be eating dinner. I understand from a business perspective how that makes sense, but I had already expressed my plan when I called over a week beforehand. Additionally, for a Friday night, the restaurant was pretty empty. Maybe one other party came in so I felt that I had moved for no reason. \n\nI did agree to move and I tried to make the best of the rest of evening. The service was okay. The waitress was very nice but didn't know the happy hour specials. The food was good but took very long to come out. I really enjoyed the Lagos rum punch. But I'm not sure I'll be back especially because I think the location is a bit hard to find and a bit of a walk from the train. That would be a lot of effort for mediocre service.", "author": "Camille W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-13", "description": "Great food. Good service.\nI've been here many times -- sometimes planned and sometimes spontaneous. The food is great and the waiters are attentive and accommodating. The owner is friendly and kind. \n\nWill definitely be back.", "author": "Raven C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-05-07", "description": "Went to this restaurant with my husband and friends, and was very excited to try the food. When we arrived we were greeted by a very nice hostess. After we were seated, the waitress came by to take our drink order,  the drinks started to come one by one, veeeery slowly.\nWe placed our food order, and waited....waited...an hour went by, someone came to our table and asked what we ordered because (the printer failed?) we were puzzled, repeated the order, another server came to our table 3 times showing us different dishes, (not what we ordered) wondering if it was ours. My friend (very frustrated) said, just bring me anything at this point, i don't care. He got a steak with mashed and vegetables. He loved it! the plates started coming out, one by one, all within a few minutes apart. Turns out that the waitress was on her first day, and wasn't trained. My honest opinion is, if you are looking for GREAT service, don't come here, but if GREAT food is a must for you, and you don't mind the wait or mishaps. then DO give it a try, the food is absolutely delicious! they did serve us appetizers and free drinks by the way. I ordered the chicken curry and loved it, very tasty!", "author": "Diuly T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-25", "description": "I went for an event last night and had an all around great time. They had a prix fix meal that came with the event.  I had the fried tilapia topped with mango salsa \u0026 shrimps, with a side of jollof rice and cabbage.  Let me tell you, the food was to die for,  OMG!!! If I wasn't so stuffed (the portion size is more than generous), I would have cleaned my plate. Talk about a great balance of Nigerian and Caribbean food. It was the best of both worlds for me. \n\nThe place was beyond packed and it took a little over 30 minutes to get our food. The drinks are always great. The bartenders were overwhelmed with orders but over time, I know they will improve. Keep in mind that they've been here for only 3 months.   At the previous location, the bartenders only were taking drink orders. Now they're doing both drinks and food. I've seen how efficient they have been at their last location so I'm confident in this new spot.", "author": "Kemi O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-31", "description": "Went there with my friend for brunch. The food was so freaking amazing ,the service so good and I'm really picky. I would definitely be going back there you should try it. The salmon omg  you have to try", "author": "Nikki F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-18", "description": "The location is amazing, very close to highways, the bridge, and the water if you want to take a nice walk. The food was so good, we had the jerk wings as an appetizer, I had the salmon and mashed potatoes which I loved, and my boyfriend had the oxtail, he enjoyed the oxtail but said the rice was too soft. The drinks are very big and strong, well worth the money. The service was good, the waiter was a nice guy and kept checking on us. My only issue is I feel like the timing of the waiter was off and he stood over us while we decided on appetizers and drinks. I don't think he was actually a waiter, maybe just filling in for Father's Day. We will definitely be back to try some more of the food!", "author": "Asia B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-27", "description": "Sorry to say this restaurant was horrible. As a previous commentator stated this place is confused... is it a sports bar? Restaurant? Club? \n\nI went there for my friend's birthday dinner. The server was inattentive and all over the place. She was stingy with WATER!!!! Ordered wings only and waited an hour before I decided to cancel it. My friend ordered the same time as me and actually ordered more food than I did. She waited awhile as well but she did get her food. It was greasy and tasted microwaved. \n\nI don't recommend this restaurant to anyone. They have food and drinks on the menu and it say \"limited availability\"... meaning they don't have it!! \n\nAll around bad experience. Nicest person there was security by the bar. Not returning!", "author": "Gabrielle S."}], "servesCuisine": "American (Traditional)", "priceRange": "$11-30", "name": "AMARACHI", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "189 Bridge St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/1LakWYHK0MG_HhfpLxK03A/ls.jpg", "@type": "Restaurant", "telephone": "+17182221010"}