{"aggregateRating": {"reviewCount": 310, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-10", "description": "Celebrating my oldest daughter's 17 birthday. Everything we ordered was fantastic. Fried calamari, bubby burgers, NY strip, and chicken strips. Delicious! Best part: Mimosas. Wife had mango mimosa and I did traditional. Excellent work staff, very helpful and friendly and look out to keep things happy. Best place to go with a group. Won't be disappointed.", "author": "J A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-18", "description": "This place is awesome. I had the pleasure of having brunch here and I must say we choose an excellent place to eat. The portions are very generous and the waitress very attentive. The music was great spinning 80's 90's and 00' hip hop and R\u0026B. I will definitely go there again", "author": "Shalyn S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-15", "description": "I have to say that this place is absolutely amazing. I bought a groupon for Amarachi, not really expecting much. The manager Tyrese was hosting at the front door and I was seated within minutes. I had a drink while waiting for my date and Tyrese was very attentive and asked if I was ok pretty much the entire wait. The food was amazing. I would recommend the lobster linguine. And the drinks were strong and to the point. \nGreat experience\nGreat vibes\nGreat music", "author": "Chantel C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-18", "description": "I came here on Memorial Day this year for a birthday brunch. It's a really cute restaurant. When I came they had just opened so it wasn't all the way put together, but I could see the potential and liked the decor. We had half of the restaurant reserved, and I was one of the first to arrive so we put our order in early. We waited about a half an hour for food and then the rest of the party put in their food -- they literally waited about an hour and a half for food, I would have been so upset. The mimosas/bellinis were well made, refilled promptly and the music was good. The waitress needed a quick lesson in friendliness \u0026 customer service, but she wasn't rude or anything.\n\nThe food was good, and OK so I'm being a little easy on them because it was brand new when I went \u0026 is black owned. So shoot me!!", "author": "Marie C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-22", "description": "I really want to give this place 5 stars but the service sucks the food is average the point to highlight is the great music you can tell that there's a friend atmosphere here but don't come here with any high expectations drinks and great music that is all.", "author": "Elizabeth P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-07-24", "description": "If I could give 0 stars I would \n\nFirst of all I came for a birthday brunch. The birthday girl made a $100 deposit to hold her spot. When we got there they had us setup in a hut in the back, because there was a wedding going on in the front. Why didn't they inform her of this to begin with. Eventually they move us to the front,you know the part advertised in pictures.  \n\nFood: TRASHHHHHHHHHH \nOut of a party of 12 only 2 people enjoyed there food. The pancakes were uncooked. Their chicken was bland and tasteless. The pasta was oily. We all came starving and all left starving. We should've known from the health inspector grade of a \"B\" to stay clear. Ruined the birthday girls day. \n\nShoutout to Maxine the manager for being accommodating though and trying to help our party out as best as she could\n\nThe other manager Devin was rude. I'm gonna assume today was not her day.", "author": "Denell G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-03", "description": "Horrible customer service. The waitress was very unfriendly. Went here for a birthday dinner and the waitress charged us an additional $20 on top of the pre fixed menu price without even letting us know before doing so. It wasn't until after the bill was already paid that we started to question the amount of the bill and why it was much higher than the prefixed price. That is when she stated what she had done.", "author": "Kee A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-29", "description": "I must admit that i was hoping for the best in choosing Amarachis for my birthday gathering because i saw such mixed reviews. But i remember them from thier old location so i took a gamble.. \nI got a winner!\nMy visit was friday july 28, 2017 My reservation changed 3 times and they accommodated me.\nI was supposed to have 10 for dinner. Turned out to be  16. No issue they just brought out more tables and chairs.\n we moved to another section to continue the night flawlessly.\nKaren was our server.  I had about  29 people all together and she did not mess up not one order or check. She said she would take all the orders together and bill us separately  and she did just that with NO MISTAKES.  She even remembered a lot of our names. I was impressed.\nThe atmosphere was easy. The music was good. The food was excellent!!! I will definitely  be going back.\nAmarachis  for the win.\nThanks guys for a wonderful experience.", "author": "Monique B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-12", "description": "Karen was our server and she was GREAT.\n\nNo complaints.\n\nThe food and atmosphere was on point.\nto top off the experience, I made money.", "author": "Gerina D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-01-05", "description": "The ambiance and food of this place is great, but their disorganization and pushy service is an issue.\n\nI came with a party of 8 and made a reservation the day before, letting them know that I'd be using a Groupon. I was told that was fine as long as we were only using one Groupon and not more.\n\nWhen we got there, I let the hostess know that we had a reservation for 8 people and she seemed confused as to where to seat us. We were seated but then moved to another table. Not a big deal but what was the point in making a reservation if they didn't actually reserve a table?\n\nOnce seated, our waitress was very friendly but she kept asking us if we wanted drinks. Keep in mind none of us were over 21. We didn't really like that she was being pushy about it (the drinks are $12+ so I see why she was being pushy, but it was annoying all the same.) \n\nThen she told us that normally they don't allow Groupons for a party of over 4 but they'd make an exception for now, which made no sense because when I made the reservation *for a party of 8,* I had said we'd be using a Groupon and I was told it'd be fine.\n\nOn a better note though, we all thought the food was great. The calamari especially - it's probably the best calamari I've ever had. The oxtail \u0026 curry chicken were really good as well. They also opened up a bottle of rosé for us, on the house, which was really sweet of them.\n\nOverall, the food was good and the place looked nice, but there is a lack of organization. I'd probably still stop by again, but next time without a reservation and earlier in the day.", "author": "Mehak I."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-24", "description": "I came to this place for a birthday brunch. I really had a good time. The dj was great. The food was really good. I ordered the chicken and waffle and mango mimosa. Love the ambiance. I will return very soon. Might even throw my own birthday event here.", "author": "Dessi B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-31", "description": "I went on a Sunday for the brunch menu.  At $40, I thought this was a little pricey for brunch.  The brunch menu includes a nice variety of meals (chicken, steak, seafood and vegetarian), and an individual pitcher of mimosa.  I tried the chicken and waffles, the chicken was nicely seasoned and the waffle was served with both syrup and strawberry butter.  Others in my party enjoyed the shrimp linguini, salmon, and cheeseburger meals.  The mimosas were ok, but you get an individual quart sized pitcher per person.  That speaks for itself!\nThere was street parking close by and the  restaurant atmosphere was both eclectic and colorful , giving off a smooth relaxing vibe.\nOverall, I enjoyed my meal and my visit to Amarachi....see you again!", "author": "Stacey L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-07", "description": "So I went there on a impromptu date. Got there at 10 pm and was tended immediately. Waitress was attentive, kind, and informative. I ordered the Bub rub wings for an appetizer that came out quickly.....deeeeelish! I ordered oxtails, but they must be a hit, because they ran out.. However, redemption was found in the rib eye steak as the sub for the missing oxtails. I had it with Jollof rice of course, with oxtails gravy on top. yuuuuummmm!\nAmbience is nice and I always appreciate being checked up on by the owner.  I will be back again...i'm going to impress my Nigerian homegirl by taking her there!\n\n\nSalute!!!!", "author": "Rebekah B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-30", "description": "Amazing portions, great service. Friendly waitresses. \n\nNice location, good music, good vibe in general, strong cocktails and the Afro-Caribbean menu is impressive.", "author": "Toyosi P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-08-18", "description": "So this restaurant/lounge is kind of weird. I wasn't exactly sure what their theme was and I'm pretty sure they don't either. \nI came here on a Sunday afternoon to catch up with friends and scope out an event that was supposed to take place. When we entered, there were about two people to our left and two to our right. The individuals on the right asked us if we were there for a comedy event (not even close). We told her no and she nudged us in the direction of the hostess who seated us right away. \nOnce we were seated and given our menus, we checked-in via Yelp and had our free house punches honored. We also placed our orders.\nAs we sat and waited, my friends noticed that their cups of water were dirty. Mine was clean. Weird. The waitress gave them new cups of water and let us know that she had placed our orders. We chatted, waited, joked around, waited, observed the venue, waited. We waited about thirty minutes for our food to come. A long time in the food service industry according to my friends who have both worked in the industry in the past.\nMy salmon was good though they used sesame seed buns (brioche would have been better since the bun is thicker and doesn't fall apart) and the fries that came with it were alright; just regular crinkly fries. My friends enjoyed their pancakes also. They ordered a pitcher of Sangria, which at the request of my friend was strong but had lemons and cherries in it. Those two things just don't belong in a Sangria. Maybe it was a special or something. \nOur waitress seemed relatively new and tried her best to make sure we had a pleasant experience. While she was good, the establishment wasn't. There seemed like there was a lot going on in the back of the house. So much so that it pushed its way up to the front. \nWe never got to attend the event we were there for because apparently it wasn't even taking place but the comedian that begin to perform as we left was okay.\nRandom note: there is a legal smoking room in the back.", "author": "Shana H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-25", "description": "I'm leaving this rating just for the horrible waitress.  I still like Amarachi and their food but the waitress is just plain bad. We've had her in the past and she hasn't improved.  We came inside and noted there was a bridal shower. The DJ was kind enough to grab the waitress for my husband and I. We were told to wait 2 minutes. I saw two diners leave. Then another two. We waited. The waitress saw me looking at her for the entire time we waited. But we were forgotten. Twenty minutes later the hostess was going to sit someone else and I had to stop her to let her know we were waiting.  The hostess was nice enough to  seat us quickly. As usual the food was great.  To top it off we were given our bill  by the waitress before we were even  asked if we wanted anything else.  Lucky the tip was added to the bill for the brunch. I would have given her $2 for the \"2 minutes\" we waited.  We miss Tyrese, the assistant manager.", "author": "Charise N."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-05-05", "description": "The decor and location of this place are awesome.  It's very easy to get to if you're taking public transportation, and there is parking nearby if you drive.  They also have a parking deal with one of the local parking garages which makes parking a lot easier.\n\nThe service here is okay, nothing spectacular.  The server didn't seem to happy to be there and had a little bit of an attitude.  However, I didn't come there for the service, I came for the food so let's get to that.  For the appetizer, I ordered the wings.  Those were delicious.  They had a dry rub and one that had sauce on it.  I don't remember what the saucy wings were called but I would recommend trying those.  They were finger licking good! :) I ordered the oxtails, rice and sweet plantains for dinner.  The oxtails and rice were okay.  Nothing I would crave, but  they were decent.  They were a little spicy, so if you don't like spicy food, stay away. The plantains came out when I was almost done with my meal, and they were decent also.  \n\nNow for the ambiance, I would give this place more stars just for that.  They had a featured guest and she was bomb AF.  She was playing the guitar and singing, and boyyy was she talented.  She had everyone grooving to her music as she performed covers and original pieces.  I went on a wednesday night, which I think was poetry night.  I would come back again just to hear their featured guest.", "author": "Allison B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-18", "description": "I initially came to this location because it was on the list for 100 black owned businesses in New York City. To say that this restaurant did not disappoint is an understatement. I checked in with Yelp and received a free rum punch which was amazing. The flavor was well balanced. The right ratio of punch to alcohol. For entree I decided to indulge in the creamy curry chicken with a side of rice and spinach. However I did not receive spinach with my meal. I am not certain if the menu has been updated and the info is not relayed to guest but they redeemed themselves with the curry chicken entree. It had the right amount of spice and flavor that I enjoyed with every bite. The decor and service was good. I will definitely be back to this black owned establishment. Prices for meals range between $13-40", "author": "Sevon B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-02", "description": "My second time here, it could have been a little bit better my first experience was excellent. We got here around 1:30 warm welcome music playing,The place only had 2 people each at 2 other table. For a Sunday brunch it was pretty empty. It is now two hours later and the place is still empty. we were there too celebrate a friends birthday. The food was pretty decent. We ordered a traditional Nigerian dish that was good. Our waitress was an elderly lady that was very nice. That being said I'm a strong believer in supporting black owned businesses, as a black Business owner myself customer service is extremely important to me. The owner of this restaurant sat at the bar the whole while we was there, On his computer never once did he come over to say hello how did you like the place how was the food. The waitress asked him to change the music as we watch her walked over towards him he refused to do it,and never got up he slouched over on his computer at the bar. sometimes it's the little things that helps your business a long way.Get to know your customers interact with them.", "author": "Mercedes H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-03-26", "description": "This is by far the most unprofessional establishment I have been to. I had bday party scheduled for 20 and made reservation in advance. When we got there no one was there to greet us at the door. Then we had to look for waitress to take our cupcakes or attend to guests that were seated. They did not secure a spot so there was no place for 5 of my quests to sit. To top it off the Waitress told half my people she wasn't sure if the food will come out because they booked entire restaurant to a paying patron. We were rushed to order food, had to wait for drinks for hour , was in restaurant for 3 hours mostly waiting on food.....to make matters worse DJ told everyone in restaurant to get out while few people was still waiting for food. The waitress was extremely nice but she too was disgusted with how things were being done. No apology or anything and my daughters party was ruined.. the food that did come out was burned or cold. Will never ever go here again or recommend to anyone.\n\nI hate to put things like this up , but I had to send apologies to all my guests and I looked like a complete fool for booking this place. The chairs ,table and utensils were also very cheap looking.. this is not an upscale venue if you are looking for one look elsewhere.", "author": "Nicole B."}], "servesCuisine": "American (Traditional)", "priceRange": "$11-30", "name": "AMARACHI", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "189 Bridge St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/1LakWYHK0MG_HhfpLxK03A/ls.jpg", "@type": "Restaurant", "telephone": "+17182221010"}