{"aggregateRating": {"reviewCount": 310, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-29", "description": "I went for a birthday dinner a group of 25 guest. And let's just say EVERYONE said their food was AMAZING !!! I had the Lobster Shrimp Alfredo delicious.", "author": "Val S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-04-08", "description": "Terrible service! Terrible atmosphere!! Waited 3 hours to be seated and food to be served. Staff was more concerned with sitting around with each other to have shots and smoke hookah. When I told the waitress my beverage wasn't what I ordered, she took a sip of the beverage. My rice wasn't cooked throughly, and my salmon was dry. Terrible. Terrible. Glasses were lip stained, water was cloudy. Mimosa Pitchers were dirty. Terrible!", "author": "Tamara R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-09-09", "description": "I was invited by a friend not necessarily knowing what kind of place this was? It was a bit of a surprised. \nWe stopped by late afternoon on a Sunday walking in seems like a party was going on DJ playing \u0026 people dancing around fun atmosphere came to find out there were a few brunch parties going on. \nOnce seated we started with some drinks first I tried the Mango mimosa ahh this wasn't great tasted like just champagne no mango flavor. \nSince the drink wasn't that great I ended up having an IPA beer much better nice taste bit of an after taste but not bad. \nI was upset that brunch was over \u0026 I couldn't order the chicken \u0026 waffles ended up getting the Chicken quesadillas it was pretty good nice tasting chicken with some cheese on top not bad. \nMy company had an order of the Chicken wings in the jerk chicken flavor, if u like spicy these are the ones to try good sauce with quite the spicy kick to them. \nWhile we finished our drinks Tyrese the manager stopped by our table just checking in seeing if we were enjoying our meal he was kind enough to offer us some free shots very cool, good shots. \nFun atmosphere, good service \u0026 decent prices.", "author": "Ginette P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-16", "description": "I went back 11/04/2017, this time with my boyfriend. We called ahead maybe 15 minutes before getting there and had to wait a while to be seated, but it wasn't there fault because the place was crowded that day and we called last minute. Anyway our waiter was attentive and very friendly. Please read the menu! All went well and we made plans to go back there soon.", "author": "Kay-Ann K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-01-10", "description": "I done here for my friends birthday brunch time, the decor and atmosphere is amazing, the customer service was great as well, the drinks came first which i was pleased with, but when my food came it was cold and i was very upset, i know everything isn't made on the spot but come on for me to pay for Restaurant Food and it's cold to the touch not ok. Other than that it's was ok to dine at.", "author": "Tous S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-11-12", "description": "If you are looking for good food, you've found the right place. I wouldn't recommend you go there hungry though. They take a long time to get the food out of the kitchen. On the bright side, when the food arrives you may forget how long you waited because it is so good! The portions are perfect, lots of flavor, presentation is traditional. I loved the experience and I will go back. I may call my order in to avoid the long wait though.", "author": "Suzanne B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-11", "description": "***see attached photo from the ridiculous response from the owner. It is obvious they do not care about their customers. Also what kind of Q\u0026A is 3 hours?\n\nWent here with a party of six for my friends 25th birthday. This was by far the worst brunch experience we've ever had. \nUpon arrival we noticed there was a private event going on (panel discussion) due to that the music and conversations had to be very toned down (in order to not interrupt). When seated the waitress explained the event would be over in ten minutes, based on that information we each ordered a glass of mimosa (six mimosas total)\nAfter waiting for about 30 minutes and asking several times about the music we learned that the event had three more hours to go. \nAs you may understand this was very disappointing because we were there to celebrate a birthday not to be part of a panel. When we made reservations we specifically asked about the music and ambiance as this was an ver special day for my friend.  No one made us aware of this event and the change of environment this would cause. \nWe spoke with the owner/partner to ask for accommodations and he explained there was nothing he could do and he was not responsible for the way we felt \nWe asked for the check which was $160 for six mimosas. We asked for accommodation as this was basically the bill for the entire brunch (we did not order foods nor appetizers). \nWhen leaving the facility the bouncer/security would not allow is to leave until he verified that the bill was paid - as he assumed we were not going to pay. \n\nEnvironment and drinks \nThe restaurant itself was very dirty - if you look up to the ceiling  you can see the lack of maintenance. \nThe drinks/mimosas options were great they had different flavors available. I ordered the traditional/orange juice. The mimosas tasted more like orange juice than champagne \n\nAdvice to owner\nWhen having difficulties with customers the most important and number one thing that should be done is apologize. No one understood our situation not was anyone willing to listen \n\nTips to customers \nWouldn't recommend this place solely on customer service. We didn't have the opportunity to eat here but I personally would not return", "author": "Christel M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-22", "description": "We had a Groupon for this restaurant and since I love African food I was very excited to try. The deal was $35 and it came with two cocktails, an appetizer, two entrees and two desserts. It could not have been a better deal considering the Lagos Rum punch is $15. \n\nThe suya was delicious and tender. The tilapia was a whole fish and served with a sweet and spicy sauce. Oxtails were amazing. The cakes were both good but I would have been ok sharing one. But Im not a huge dessert person. \n\nThe staff were all amazing. So friendly and personable. Tyrese was our server and he introduced us to Pedro and Pete the bartenders  so we could enjoy the amazing DJ even after our meal. \n\nI will definitely go back when without a groupon!", "author": "Liz G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-07", "description": "Came here to try the Nigerian food on a trip overall I would say if you are Nigerian this place is a decent home away from home meal. Service was okay and asking my friends who live here they said it's over hyped and over priced. If your in the area check it out", "author": "Naomi S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-11", "description": "Great Restaurant, they accommodate large groups, Great food great customer service. I came for my brothers birthday party and everybody had a great time.", "author": "Giorgio M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-26", "description": "We arrived at 7:30 for our reservations (we a had a party of 10 - so we wanted to ensure we would be accommodated, hence our reservations).\n\nThe place was beautiful - loved the ambiance.  I had short ribs as an entree with fried calamari as a starter.  My daughter had the sweet chili wings as a starter and the buffalo wings with french fries as an entree.  The food was delicious, to say the least.  The servers and other personnel were very kind and professional (one of the servers even played along with the mannequin challenge at my request so that I could post on FB).\n\nIn addition to our food we ordered a pitcher of white sangria (delish) and they brought out a slice of birthday cake for my son who was turning 22.  The great food, wonderful music, friendly environment AND red velvet cake topped with an oversized candle that shot fire sparkles would have been the end to a perfect night...\n\nBut it didn't end.\n\nThey accommodated my sister as she brought in a large oversized sheet cake from her car for the birthday boy; they added their unique candle to it, and while it shot a fountain of colorful sparkles, they sang happy birthday and after he blew it out, they cut it up and served everyone, then they brought out a complimentary bottle of champagne for us.\n\nI must say the night was beyond perfect.  It was magical.  Thank you Amarachi.  I can't wait to come back.", "author": "Carla R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-03", "description": "My best friends and I decided to come in tonight to catch up and enjoy some good food, and we ended up getting so much more. \n\nFirst, the service was superb. And, our host Tyrese was GREAT! He continuously made sure that we were okay, gave us recommendations, and tended to every question and request. \n\nThe food was even more amazing. We came in for happy hour and ordered off that menu. I got the sweet chili wings, a house salad, and a mango mimosa. (Still thinking about those wings.) And my other friends ordered the Bubby burger and Hubba Bubba fries, sweet chili wings,  plantains, and the Amarachitini. All amazing! \n\nOne of my friends ended up booking her birthday dinner in December with Johnathan, who was great as well. We had a great and lively conversation with him and shared a good laugh about each of our college experiences. \n\nY'all should already know that we will definitely continue to support Amarachi!!", "author": "Tyra M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-07", "description": "I went to Amarachi Saturday afternoon to meet up with some old college friends. It was the perfect venue. The staff was very welcoming and everyone had smiles and warmth to offer. The wait staff was very attentive and on point. Every time my drink was getting low they were there to ask if I needed anything. The drinks were delicious! I am currently not drinking and am usually bummed out because the best choice is usually cranberry orange mix with Sprite. Not this time! They have a delicious fruit punch with what tasted like guava and maybe mango. It was sooo good! My friends had cocktails and raved about them also. Not to mention they were a nice size not some itty bitty rocks glass. As this was our first time we all wanted to taste everything so we ordered a view entrees and shared everything. EVERYTHING WAS GOOD!!! Top of the list was the salmon... cooked to perfection with a scrumptious glaze. The Jollof rice was tasty with rich flavors (and spicy) the oxtail and rice and peas was tasty also. The jerk chicken wings were good. Very spicy! The Parmesan wings are a winner. Both were good I preferred the Parmesan. And the Bubby burger was sooo tasty! If I had to nit pick the burger was medium rare which I prefer medium well and the server did not ask me how I like it. I ate it though!!!! Lol and it was damn good!! They had a Dj playing really good music from African to Caribbean to American music. The bathrooms were clean. I would definitely recommend Amarachi and would certainly go back.", "author": "Jamaica N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-17", "description": "Amarachi has a wonderful ambiance. The decor is bright and has different spaces. You can sit at the bar, lounge it up a bit, and of course a regular dining area which takes up most of the space. The food is a wonderful mix of Carribean (mostly Jamaican) and West African (mostly Nigerian) dishes so you can basically ensure a flavor-full, spicy meal. The drinks are also good so that's a plus. \n\nThe service is awesome. The servers were super friendly though things can take a little time. Be sure to call in advance as they sometimes have pretty big parties. I'd say it's good for a pair or a huge family-style dinner.", "author": "Kovie B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-26", "description": "I've been craving the jerk parm ever since I left. Wish I knew they had a lunch Groupon before I went. I will definitely use it for the next time I go. The appetizers were my favorite. Wasn't at all crowded during lunch time on a weekday.", "author": "Lexy Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-01", "description": "Another great night at Amarachi!! Great food. Great service, strong drinks and great tunes. I highly recommended the sweet chili wings and shrimp linguini which is more than enough to make another meal out of, and still have some left over for breakfast.  This was definitely one of the best alfredo sauces I've ever tasted. The salmon also was delicious, not overcooked and dry like some places. Portion sizes are huge. Again, this place is great for a date night or a group. I am definitely becoming a regular.", "author": "Demar P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-05", "description": "Highly recommended. Went there for my birthday celebration last week Saturday. Amazing food. Great service. Nigerian/Caribbean fusion. My entire family love it. Nice atmosphere too with a live dj. Our waiter was the best. Can't wait to go back. Compliments to the Chef(s). Do yourself a favor and check it out.", "author": "Godfin T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-27", "description": "Dope spot ! Dope ambiance and customer service ! Drinks are good and my visit here was memorable ! I highly recommend", "author": "Kelly G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-10", "description": "Decent service with okay food. However, the food is missing FLAVOR, LOVE \u0026 PREPARATION, but overall, the restaurant is convenient, if you have NOOOOOOOOOOOOOOOOOOOOOOO other options.", "author": "Laura J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-29", "description": "Great food and the music was off the hook. Waitress was friendly and attentive.  Will be back again", "author": "Lyrical C."}], "servesCuisine": "American (Traditional)", "priceRange": "$11-30", "name": "AMARACHI", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "189 Bridge St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/1LakWYHK0MG_HhfpLxK03A/ls.jpg", "@type": "Restaurant", "telephone": "+17182221010"}