{"aggregateRating": {"reviewCount": 171, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-01-12", "description": "I was eating my chicken and thought it seemed a little rubbery. I looked down and saw it was completely raw. Raw. The staff did not apologize. They did look a little shocked but just asked if I wanted a new one or a different meal. No actual apology. I couldn't eat because I was so grossed out.", "author": "Rachel S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-06-03", "description": "Ordered through Seamless' restaurant week deal for me and 3 coworkers. The food that arrived was only so-so. They forgot 1 entree and 2 salads. Then they took over minutes to bring me replacement food (which one would think should just be cooked and ready, and even if not they're less than 5 blocks away). Once the replacement food did arrive, the salad looked like someone just took a limited fistful of lettuce and threw it into a tupperware and shook way too much cheese on top. One might think it's tough to screw up only 4 orders made through a delivery site (where it's all there in black and white) but they managed. Certainly won't be ordering from them when the whole department does lunch, and I won't be ordering from them when I do lunch again either.", "author": "Alex S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-25", "description": "Relaxed, neighborhood vibe. Staff were all very welcoming, courteous and efficient.  Kicked two goals with a shrimp, salmon and crabmeat appetizer, followed by a delicious pasta with funghi. Sea bass was slightly overcooked but flavor was delicious.  Reasonably priced.", "author": "David J."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2010-06-20", "description": "Terrible food and the manager, maybe owner was horribly rude to me.  I guess my first mistake was ordering potato pancakes at an Italian restaurant.  They looked more like meatballs than pancakes and were served on top of a salad drenched in dressing with tomatoes that looked like they'd been rejected from Burger King.  I ordered a virgin bloody mary, which was basically tomato juice with a lime in it.  When I thought that they'd made a mistake on my bill,  I asked my server about it.  He asked some guy sitting at a nearby table (manager? owner?) and he proceeded to get hostile and argue with me.  I never complained, I just asked a question (to my server, not him...and I still think they were wrong to charge me the way they did.) It was extremely inappropriate that he'd start an argument with me.  It was very awkward having to sit there next to him while we waited for our check to close.  I just don't think people should treat their customers that way.  \n\nThat said, the bread was good.  But again, the rest of the food was plain awful.  Needless to say, I won't be going back there again.", "author": "Laura W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-10", "description": "This place is absolutely one of my favorite italian restaurants to go for pasta. I went to the one at midtown manhattan as well. Although they are the same restaurant, the decorations are very different. The one in manhattan is cozy and the one in brooklyn heights has a bigger area and more italian. Back to the food, you will have to order a pasta dish. The desserts are very good as well. It  is definitely worthy to go!", "author": "Katrina W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-06-14", "description": "The homemade pasta is the way to go - I recommend the orichette w/broccoli rabe + sausage.  Don't bother with the sandwiches... I often forget the Panini means \"sandwich\" and doesn't mean you are going to get a pressed hot sandwich. If you have the choice, dine-in. While delivery was fast, the pasta wasn't as good as it could have been. (Fresh out of the pot) The staff is friendly, so you might as well stick around.", "author": "Erik C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-06-29", "description": "This is one of the better restaurants in Brooklyn Heights and my go-to restaurant for takeout.  I always get the homemade pasta with either pesto or carbonara sauce.  The pasta is delicious and comes with homemade focaccia.  When I order delivery it arrives quickly and hot, and when I eat in the servers have always been attentive.  Like most restaurants in the neighborhood it is not particularly hip or sceney, but the food is always good and it is a nice spot.", "author": "Anna P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-16", "description": "great nighborhood italian place ,the owner NUundo is very personable and friendly the price is right....The owner sometimes offer you free drinks and/or desert\nyummy", "author": "Iris M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-10-11", "description": "Had lunch today. Not only was there a lunch menu, but a prefix lunch menu, as well! The service was excellent as was my pasta! AND you can order any pasta with any sauce so I had cappellini w spicy marinara and sausage. Really good! Can't give 5 stars for the tiny flies buzzing around, though. Probably just a one time situation bc we passed by the place yesterday and EVERY table was filled!!", "author": "Nicole O."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-05-18", "description": "It's nice to sit outside but the food is SO BLAND. Also, for $12 the calamari app is pretty small. They could do much better.", "author": "Anastasia M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-10-20", "description": "It might not be as good as the one on 77th street but it was one of my hangouts when I used to live in Brooklyn. This was probably the first trendy place that open in Brooklyn. I made the switch from Montague Saloon to Buon Gusto because I loved the European girls that used to hang out at the bar. I also love the food especially the Pesto and the Tiramisu is excellent.", "author": "James V."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-04-25", "description": "- 1 star \nheavy, exceedingly heavy handed with the salt this time, assault O.D.!", "author": "bridget e."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-10-11", "description": "I have been going to this restaurant for over ten years and I love it.  The staff have always been friendly and the food service is fast. I have never had one problem and the food has always been consistent.  It would be nice if in the evenings the lights were dimmed, it would make for a better ambiance, otherwise it feels to open and not quaint.", "author": "F F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-23", "description": "considering the slim pickins on montague, this place really isn't half bad. in fact, it's quite good. the only downside (and the reason I don't come here more often) is that I always end up spending more than I had intended to. although, that's partly because I always order wine. if you don't order alcohol, it's pretty reasonable. one word of advice, however: if you're ordering pasta and decide to add anything to it (sausage, mushrooms etc.) know that your 13 dollar pasta can quickly become 20 dollar pasta.\n\nthe only thing I've ever ordered is pasta. a lot of them are homemade, and aside from the combinations they suggest, there's an endless number of creations that you can come up with yourself. needless to say, it's sort of difficult to drag yourself away from that page of the menu. \n\nthe menu, by the way, is huge. it covers all of the standard italian fare from a to z. in fact, sensory overload probably accounts for why I always default to pasta.\n\nnot anything to write home about, but a good choice if you're in need of a dependable italian place nearby.", "author": "Caroline N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-10-18", "description": "For appetizers we shared the assorted cheese and cold cuts platter, and my entree was the pasta carbonara (I chose linguini as my pasta).\n\nThe appetizer platter was yummy, with at least 4 different types of cheese (a blue, a brie-like cheese, and 2 others I couldn't identify), with about 5 slices of cold cuts (salami, prosciutto, and something else I can't remember).  The pasta carbonara had pancetta and onions, and the sauce was creamy but not too thick.  A little more onions and cheese would've been nice.\n\nWe got several baskets of bread, some of which had melted cheese not sure what kind, and was sooo good dipping into the olive oil!\n\nIn addition to scrumptious-looking pasta entrees and other main dishes, you can also create your own pasta with your choice of sauce (pesto, marinara, bolognese, etc) and choice of pasta (linguini, rigatoni, penne, etc), with whatever additional toppings you want (spinach, sausage, shrimp, etc)!  \n\nCute, quaint restaurant, a little crowded since there's not much space, perfect for a date or small group of friends.  They also have outdoor seating.", "author": "Junkfoodie Q."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-24", "description": "Great service, atmosphere, and delicious food. My friend sent back an order that wasn't quite what she wanted, and the staff were understanding and threw in a sampling of desert (and champagne, but we were teetolating). The desert was a fantastic chocolate mousse cake. We were very appreciative of the staff's hospitality and attention. And of course, the quality and taste of the authentic Italian cuisine speaks for itself.", "author": "Rochelle A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-19", "description": "This is my husband my \"go-to\" restaurant. The prices are decent, the food is really good. The pesto sauce is amazing, and the bread they bring out before is really yummy. They have a fairly comprehensive wine list. The staff is great... really friendly managers, courteous waiters/waitresses. In the summer, the outside dining on Montague is awesome.", "author": "Karen V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-06-22", "description": "Had Lunch here with friends.  Staff was great. Food was great. Pasta and Bread - home made.  Salmon was a bit dry buy still good.  They'll accomodate you diet needs.", "author": "judy G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-05-03", "description": "Terrible delivery service, waited over an hour for an order of pasta. Girls on the phone had no clue where the order was. Nobody once apologized about the order and the pasta was cold.", "author": "Omar K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2010-12-15", "description": "Half Star! Actually, not even! This place is horrible!! I have never experienced anything as bad as this. I ordered a Tira Misu and a Chocolate Tartufo, keeping in mind that the food was going to be horrible. After two hours where I had to call the restaurant to ask what became of my order, the man told me the guy couldn't find my building. When I finally got my food there was no Tira Misu or Tartufo, I got two chocolate mousse cakes. I have really never been so mad when it comes to delivery food. It didn't help the mousse cake's texture was nothing better than that of partially baked brownies.", "author": "Divya P."}], "servesCuisine": "Italian", "priceRange": "$11-30", "name": "Caffe Buon Gusto", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "151 Montague St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/GTuIdEHSkpWloATo9iIucA/ls.jpg", "@type": "Restaurant", "telephone": "+17186243838"}