{"aggregateRating": {"reviewCount": 171, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-21", "description": "Caffe Buon Gusto is my new favorite destination for Italian cuisine in Brooklyn Heights.  It's better priced than the nearby and beloved Armando -- and the food is better too!!  It's criminal that there aren't people here all the time.  I don't normally write reviews, but I'm writing one for Buon Gusto because it badly deserves it.  \n\nThe menu is fantastic, every homemade pasta is delicious (I strongly recommend trying one of them), and the service is fast.  The only thing I'd knock it for is that the music is the top 50 pop singles of the last three years -- but we sat outside, and the pasta's good enough to be worth bearing the Despacito :).  Seriously try it out if you're in the neighborhood and I'm here mood for Italian.\n\nI'd recommend the place for couples and families alike.  There's good spaces to support both.  I'll definitely be coming back :).", "author": "Adam S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-10", "description": "This restaurant is like a hidden gem that you're not sure you want other people to find. In the warmer months, sit outside and enjoy the people watching with your wine. When it's cold out (like now), go indoors and enjoy a rich, delicious pasta (my favorite is the homemade veal tortellini with vodka sauce) and a great glass of wine. If you're looking for simple, delicious Italian, this is your place. Come alone or with friends!", "author": "Andrea P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-01-11", "description": "I didn't think you could really go wrong with a basic pasta but turns out I'm wrong on that point.  I live in the area but hadn't been here in a while.  Do notice that it's often when I walk by it's not really very crowded for dinner.  Perhaps I should have taken the hint.  Went to get basic pasta dinner not long ago.  It was not really that hot and, never thought I'd say this but way way too much sausage.  Mushrooms and sauce were not very flavorful.  Overall just underwhelmed.  Friend had a salad which she said was ok. Service was fine.  Given other choices for italian/pasta in the area - i wouldn't come back.", "author": "Jen K."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-04-08", "description": "Food was good but the service was terrible. On a Saturday night, the entire wait staff was congregated by POS system having a conversation/engrossed by each other that my table was ignored for well over 15 minutes. No dessert menus were offered, our water glasses were never refilled, and we had to flag down waiters for our check after being ignored. What a joke. Also, don't waste your money ordering the wine here. The selection is extremely poor and limited to old/not current vintage wines. The list was obviously put together by someone who has no clue on picking varietals/producers.", "author": "Zaneta R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-03-16", "description": "I gave this place 2 chances too many. Ordered takeout pasta- the fresh fettuccine once pesto and once alfredo. Both were mushy gloppy messes.", "author": "Suzie I."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-11-23", "description": "I'll admit, I know absolutely nothing about Italian food. I tried to look up the plates I had but for whatever reason the site menu wasn't the exact same as in the restaurant so I apologize in advance e-e\n\nI went to this place to celebrate the completion of my internship with a few of my supervisors. I found it to be nice little place. We were led to our seats and were talking for a bit while trying to look at the menu. One of the things I noticed was that we had to  call for the bread basked to be brought to us after a whiiile, which rarely happens (usually servers will quickly pull the sucker out). I don't know if they were waiting for us to decide on our orders, but it kind of made me feel weird to sit there for maybe 10-15 minutes for bread.\n\nAnyways, I personally ended up getting their lunch Prix Fixe which came with appetizer+entree+dessert. \n\n- Appetizer was jumbo shrimp wrapped in bacon; it was good, but I will say the shrimp seemed a bit overcooked. People might be bothered by the fact that it's only three shrimp and then the little greens and tomato in between. I didn't mind that much (maybe an extra shrimp?), but at the same time I did eat half of the bread basket on my own. so.\n\n- Entree: this is where my memory fails me. It was some sort of lasagna-ish dish with a lottt of cheese (see picture). It was pretty good, and when the entrees came out the hostess came by asking if we wanted fresh cheese or pepper on our stuff which was nice. I personally could not eat all of it because all the cheese and pasta filled me up fast.\n\n-Dessert was Tiramisu. I took this to go since we had to get back to the office, but it was good. Not the best, but decent :)\n\n\n\nI'm not around that area of Brooklyn anymore, but overall if I had the chance to go back I would, mostly for the lunch prix fixe! I'm not too hot on Italian to really commit to paying the usual $$$ for a full meal.", "author": "Amber R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-07", "description": "Following an unparalleled feature poetry performance of fifteen minutes, my two guests of friends who were SINCERELY able, ready and willing to attend ventured here to Caffe Buon Gusto for additional merriment. Amid we did not ordered food but I am sure to return for a complete substantial meal.  Full service bar awaits to served.\n\nThe three of us enjoyed a better service and good environment which dispels our previous venue's degrading experience at a dingy diner.", "author": "Tina C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-12", "description": "This place is super cute, on a great street in Brooklyn Heights. The bread is great (pizza bread is yummy), the service is good, and the prix fixe lunch menu is delightful (~$22 for appetizer, entree, dessert). The tomato soup is delicious, as is the crab ravioli with shrimp \u0026 spinach in cognac cream sauce. My go-to order there, and it's wonderful. \n\nGreat ambiance, good amount of space, peaceful (at least at lunch), good wine selection, good food.", "author": "Meg M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-17", "description": "The food is always great, authentic, hot, fresh, filling \u0026 flavorful.... The complementary bread is so yummy be sure to use the seasoned olive oil with it .... The pizza bread is really good make sure it's in the basket.... I've had the chicken caprese it is very fresh \u0026 well seasoned with pasta \u0026 red house sauce, the baked egg plant parm is also very good, the lasagna is yummy good, the lobster \u0026 crab ravioli is very good as well... The service is prompt \u0026 friendly. Very welcoming atmosphere, date friendly, it seems welcoming for adult family gatherings as well.", "author": "Millie R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-17", "description": "Quality ingredients make good Italian food, that's axiomatic, and at Caffè Buongusto it is certainly the case. I was there tonight for the first time, Marco, the owner, greeted me like a friend and took the order in person. The wait staff is great, they don't rush the clients like many other restaurants and don't harass you several times asking \"is everything ok\" right when you were chewing your food or busy in an important conversation. They don't take your plate when the other person is still eating...in short, they treat their customers the way they would like to be treated. I had veal with sorrentina sauce, and the dish came with a small side of pasta, al dente and very yummy. The veal came with abundant tomato sauce and mozzarella, covered by slices of eggplants. It was like eating a meaty eggplant parmigiana, something delicious that I am sure I will be dreaming tonight. My friend ordered a grilled sea bass that came with mashed potato and herbs. I didn't have the chance to try it but judging from the way he ate it there's no doubt the fish was good too.\nI am definitely coming back!", "author": "Marco C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-11-10", "description": "They served a pizza that tasted like it might have been frozen.  Fried calamari was lukewarm as if it too had just been microwaved but taken out too early.  It was worse than bad", "author": "Martha B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-21", "description": "I am a little shocked by some of these negative reviews but then again they seem to be older so be sure to sort the reviews by most recent as you can see they are all pretty good, which is in line with what I experienced!\n\nI stopped in for a late lunch with my boyfriend and the service was prompt and friendly. The owner was also helping the wait staff and greeting guests, which was really nice to see. The waitress helped with recommendations and any questions we had and the menu is pretty extensive so there's a lot to choose from. \n\nI ordered the tomato soup (SO GOOD) and the avocado salad (ok, nothing amazing but still good) and my boyfriend got the veal tortellini in a spicy marinara sauce, which was also really good but we decided it was a little too spicy. \n\nWe then ordered gelato for dessert - just beware that this is not gelato. It is ice cream. Would have been nice if they had authentic gelato if they are going to call it such. \n\nOverall, I enjoyed the dining experience and will definitely return!", "author": "Becca K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-08-03", "description": "Pretty good food.  Nice, friendly staff.  Good wine list with a couple real bargains on it!  Great neighborhood place!", "author": "Mark H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-08-30", "description": "Do not order from this restaurant.  I ordered seeing that they offer a dish I wanted and the delivery time was between 30-40 mins.  Long story short, my order was cancelled an hour and 20 minutes later and I'm notified I'm outside their delivery window. Why wasn't I notified when I placed the order if they are having problems with the delivery app?  Why can't they deliver when I speak to the manager and he tells me it has to be within 1.5 miles from the restaurant?  I live exactly 1.5 miles from the restaurant.  Marcos tried to put the blame on grubhub, but it's really that he doesn't want to deliver within his delivery window. Now I am left with a cancelled order and I have to go to work with no food and no time to buy anything.  Stay clear.  No buon gusto.", "author": "Emily L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-01", "description": "Molto bene!  The ambiance was great,and there were many Italians which was a good sign.  \n\nThe manager walks around welcoming people and making sure things are ok.  Food was DELISH!  Surpassed my expectations, and like others say, their Tiramisu is divine.  \n\nThe ONLY reason I give it 4 stars is because our waitress could've been a little nicer and more attentive.  We went mid-afternoon so its not like it was a super busy time.  If they fix that, definitely a 5 star!", "author": "Amanda N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-21", "description": "My boyfriend and I came here at 9PM on a weekday, and were immediately seated outdoors amongst the beautiful floral arrangements.  Our waitress was excellent, and the food was fantastic.  They let you choose which homemade pastas and sauces you want to take together, and at a fantastic price.  I'd recommend this place for people who appreciate delicious Italian food.  It's a great place for couples, but definitely big enough for families.  The dessert was excellent, and service was prompt.  Can't recommend Caffe Buon Gusto enough! :)", "author": "Sara K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-06-29", "description": "Just okay! Food a little cold when delivered.", "author": "Marie S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-14", "description": "I've never been to Italy, so I missed out on all the three-hour 15-course meals my study-abroad friends raved about, but if I ever wanted a three-hour 15-course meal, I'd want to eat it here. \n\nMy boss loves this place and I can see why: the ambiance is nice and simple (stencils of statues on the walls), the waiters were attentive and very, very good about refilling my water (the glass was never half empty), and my La Fritatta (three-ingredient omlette with roast potatoes) was pretty delicious for the price. Eggs nice and fluffy. They do roast potatoes right - crispy to the point of burnt on the outside, nice tongue-melting hot on the inside. \n\nI'd like to come back and try their homemade pastas, which run the gamut from $10.95 (linguini, penne, rigatoni with your choice of sauce) to the special pastas with seafood ($15.95 range). Don't forget to flip one of the laminated menus over - they have a special menu of paninis (I guess for the lunch crowd), most of which are $10.95 and below. They were on the tiny side (like seriously three big bites and you would be done with half) and come with a little pile of salad, but the combinations sounded so good - salmon and pesto, proscuitto and mozz, and more. \n\nDesserts are awesome. I think we ordered two and then got three more on the house, and it's this customer service that gets CBG over the three-star hump. We had the chocolate souffle, chocolate tartufo, tiramisu, fruit tart, and the risotto cheesecake, which was my absolute favorite. Not too sweet but still rich. I'd definitely come back here for a late brunch of pasta and a few glasses of wine with friends. It's also a good place for a first-date, fancy dinner with the parental units, or a business lunch.", "author": "Joy G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-20", "description": "This has got to be one of my favorite cafés in Brooklyn. Love the atmosphere, the food, coffee, and dessert. \n\nThey serve delicious sorbet inside of their \"shells\". Orange sorbet in an orange, coconut sorbet in a coconut, lemon sorbet in a lemon.", "author": "Anya N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-15", "description": "This restaurant is lovely and the foods are amazing...the ambient is lovely the food is Italian with other plate very specil.. The wine list Is very very good.. the waitress who served me called me Victoria  and was very professional and really loving.. I suggest this restaurant!!!", "author": "Antonio C."}], "servesCuisine": "Italian", "priceRange": "$11-30", "name": "Caffe Buon Gusto", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "151 Montague St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/GTuIdEHSkpWloATo9iIucA/ls.jpg", "@type": "Restaurant", "telephone": "+17186243838"}