{"aggregateRating": {"reviewCount": 171, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-05-23", "description": "I've been here a couple of times for lunch, and would say it's hands down the best food on Montague.  I'm never quite satisfied with any of the restaurants on Montague, but Buon Gusto is a safe bet for professional lunches /  dinner with parents, etc...   Both experiences I had here were great, and reports from people I recommended it to were the same.", "author": "Allison S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-22", "description": "Went to this place today for lunch in my quest to find the best linguine and clams.  WOW!!!! So NOT disappointed! The mosh delish I have had since Italy! I ordered the white sauce. 10 fresh, good sized clams with an amazing sauce over perfectly cooked al dente linguine...I want to go back to try the red sauce...", "author": "Christine L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-08", "description": "A nice spot on Montague for a casual yet substantive dinner.  The veal tortellini should not be ignored.", "author": "Dan P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-06-29", "description": "Super value, casual atmosphere with conistently good food and service. Highly recommended by my friends too.", "author": "Bob M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-12", "description": "This place is good, slightly expensive, but only on the relativity scale (for this area) and has a pretty predictable menu so you could take any of your family members and they would find something to eat. Having said that, they have a pretty predictable menu so if you want something different, you have to recreate some of the dishes by just telling them what you want. They will do ANYTHING you want - if you tell them you want spicy pasta with oysters and carrots they will do it. Nando, the owner, is a phenomenal host and really does know his business, and when he is there the place is always a bit livelier - when he is not there, less alcohol is consumed. Anyway, it's a decent joint with a nice ambiance. The wait staff however, with the exception of Johanna the bartender, changes almost daily which says something about the expectations or stability of the owner I s'pose, and one does wonder if they are coming in off an illegal immigration boat or something because English is everyone's second language there. Anyway, order an apple martini when you go and get the fra diavolo sauce and you can't go wrong!", "author": "Heather B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-12", "description": "I went to this place randomly for lunch.  The food was great.  They have a bunch of really good sandwiches, salads, and pastas.  We had the apple and goat cheese salad, rigatoni with pesto, and a portabella/mozzerella/tomato sandwich.  All were tasty.  Now for the major downside that I was tempted to subtract more than one star for, but since the food was so good I didn't..... The waitresses SUCK!  The one we had would snap \"WHAT?\" in the middle of anything you could possibly say and would then move her head within inches of yours for you to repeat it.  It kinda became a game to see how far into your sentence before she pulled her antics. It wasn't just her though.  The rest of them were nearly as bad, especially the one who was yelling someone's espresso order (by saying expresso) to the back and when the didn't hear her screaming after the third time, she proceeded to spell it E-X-P-......  This is the sort of thing that can infuriate me.  I have to say the busboys were great.  They should trade places with the waitresses because those girls are completely useless.  I wouldn't go back based on service alone, but the food was really good, so I will.", "author": "J K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-01-01", "description": "Caffe Buon Gusto is excellent.  It is my favorite Italian restaurant in Brooklyn.  Try the lamb tortellini!  The atmosphere and service is first class.  Every time I come here for a meal I happen to compliment the food with the manager who is very gracious and has given us free dessert.  It can be a little expensive however so heads up!", "author": "Sean G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-14", "description": "excellent service,great food.....Nando all the way", "author": "Paul R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-17", "description": "went here with my parents.  the food was good and they were awesome with sharing (they split the meals generously and didn't charge extra for it).  Love the salad choices, but not the gelato so much.  although there is a bar, the inside decor doesn't inspire, but sitting outside is nice, although it can be a little crowded.  For neighborhood brooklyn this is good, not sure i'd go to the Manhattan location though, with so many other choices.", "author": "Jessica H."}], "servesCuisine": "Italian", "priceRange": "$11-30", "name": "Caffe Buon Gusto", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "151 Montague St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/GTuIdEHSkpWloATo9iIucA/ls.jpg", "@type": "Restaurant", "telephone": "+17186243838"}