{"aggregateRating": {"reviewCount": 171, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-30", "description": "Been here a few times, and came in for lunch today. First, I have to say the service was excellent. Our server Andre was awesome, attentive, and funny, he definitely made our experience much better. We got complimentary bread,  the foccaccia is very,  very good, and Andre made us a homemade recipe to dip the bread which consisted of Balsamic vinegar,  olive oil, parmesan cheese, salt and pepper,  and I have to say it was a really good mix to dip your bread.  We got the fettuccine carbonara that tasted amazing!!! I got the calamari, lasagna which also tasted good. For dessert I got the chocolate almond cake which was delicious if you love chocolate, then Andre \"guessed\" that we did not like the cake so he gave us Tiramisu which tasted so decadent, and moist, then Andre \"figured\" we didn't like the Tiramisu so he brought us the cheesecake which was also very tasty. I would definitely say I personally lived the Tiramisu the best.  I will recommend coming back here.", "author": "Mick E."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-08-09", "description": "This rating is for brunch only. I ordered three eggs over med, home fries, bacon, and a toasted bagel. \n\nI got-\nEggs almost deep fried hard, cold home fries, bacon that taste like it was deep fried in oil with fish, and this crazy burnt toasted bagel platter the trimmings for lox minus the lox. \n\nThis was my third time trying brunch here and my worst yet. The wait was very long however the staff was super friendly. The fresh squeezed OJ is really good too.", "author": "Marcus O."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-11-22", "description": "Cute little place to eat after walking the promenade. Had the veal pizzaiola, fiancé gad chicken parm, and his sister fresh gnocchi. Was a nice meal after cold day. Nice glass of wine and service was very good.", "author": "Ronnie T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-24", "description": "I've only ever had breakfast here, but it's one of the things I miss most about living in Brooklyn. Looking forward to a Sunday morning breakfast here was always a highlight. The Eggs Benedict was never a disappointment and paired with a mimosa only made it all the more great. I definitely suggest coming here for breakfast!", "author": "Nikki H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-01", "description": "Tonight I had dinner with my boyfriend and two of my friends from High School that I haven't seen in a while and it was nice to see them again. One of them requested to eat in Downtown, Brooklyn and little did I realize that we worked very close to each other. I wasn't in a mood for an Asian Fusion place or Diner food and I have heard of Caffe Buon Gusto through my co-workers so why not give it a try?\n\nYou can't really tell much from the outside, but inside the restaurant just felt like a whole other world. The decor was very simple yet beautiful and it was a comfortable restaurant ,candle-lit, and good music as well. When you first walk in, there's a bar and seating in the center/back of the restaurant. This isn't an ideal place for a group dinner, unless it's a group of maybe four people at max. I feel this restaurant is more suitable for a date or with friends. The waiters/waitress was pretty friendly.\n\nThe bread basket was rather small, but at least it was unlimited bread. Entrees, my boyfriend ordered his usual - Chicken Marsala which looks very different from the ones he's eaten before at the Italian restaurants we've been to. The Chicken Marsala looked  clean and definitely not a mess unlike other places I've been too. There wasn't too much sauce or things laying around.  The presentation was unique.\n\nOne of my friends ordered a Seafood Linguine with Red Sauce and it looked amazing and definitely a variety. Great pick! My other friend got a pesto sauce with linguini and I decided to order Tortellini with porcini. The last time I had tortellini, I wasn't too thrilled with it, but this one was great and it was stuffed with veal and porcini mushroom and cream sauce. I really liked the size of the tortellini,  but I couldn't finish the entire dish because too much cream.\n\nI simply couldn't resist the dessert menu, so I decided to try their Tiramisu which turned out to be amazingly delicious! I can still feel the coffee kicking in. The Tiramisu was so moist and you can really taste the coffee. All desserts on the menu are $7.00 and also not sure, why but we got an \"On The House\" slice of cheesecake. Awesomeness! My friends were very impressed with the restaurant, not bad for our first time here!\n\nThe likelihood of returning to this restaurant is pretty high! I love everything about it. This is probably one of the best Italian restaurants I've been to. Many reviewers before me didn't see to have a good impression but I had a good time, good food, and good experience.\n\nNote: Due to some difficulties, I do not have pictures of the food because of lack of light. Next time.", "author": "Jessica D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-13", "description": "Excellent meal and great service. It's a small, intimate spot that makes it's own pasta. Very yummy!", "author": "Mary P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-04-28", "description": "Please DO NOT GO to this restaurant. The service is lovely, the problem is the owner a moroccan guy. I went with my girlfriend and he was being so nice with us, inviting us a dessert and some drinks, and then he tried to invited himself to come with us after the restaurant was closing, we of course said no ( I am a married woman) and he got so angry and upset and tried to overcharged us  all the things that he invited us. \nI was also witness on how bad he treated his employees, when we were arguing with him about the check, the restaurant was empty and he screamed to one of his employees because he asked him if he could take a day off the next day because he was not feeling right.\nAWEFUL!", "author": "Clara C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-02-06", "description": "This place is overpriced and weird. I stopped in for a quick beer while shopping on Montague and the bartender took forever to serve me because she was talking to one of the regulars the whole time (there were like two other people in the place). I got weird vibes from them the whole time like I was encroaching on their territory. The beer I had was $7 and change which is ridiculous for such a crappy place. Don't waste your time or money here.", "author": "Ashley S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-06", "description": "I love italian food, So I am very picky when it comes to it! They by far are my favorite Italian restaurant. The food and service is AMAZING!! I would definitely recommend this place! The employees are also very accommodating.  If you are ever in the area it is a must! I come from Queens just to eat here though!", "author": "Chrystal C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-23", "description": "Omg, this place is soooo good! The food is amazing, it's really not expensive and people over there make u feel like u are at home... I loved it!!! Please go there!!!", "author": "Suzana I."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-19", "description": "Great Italian dishes! Everything from pasta to salmon to a great salad. Service is wonderful. An overall very quaint delicious cafe.", "author": "Tori M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-04-10", "description": "Update: came back for another dinner and things are back as bad as before: bad service, noisy bar full of drunk old people, and the professional manager that they had a few week ago replaced with some clueless guy that looks like it doesn't want to be there. No wander this place is empty.  Bye bye, no more.", "author": "Susan R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-20", "description": "I went back to Caffe Buon Gusto and had we had homemade Paglia Pasta  and Meatballs and homemade ravioli with spinach in cream onion sauce and both were delicious and our waitress was once again lovely but something was missing . Where is the charming Maitre'D Marcelo??? We met him once but looked forward to seeing him again. Is he in the Manhattan location?? \n\n He added a touch of class to Caffe Buon Gusto.", "author": "Elizabeth V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-22", "description": "Food is delicious, atmosphere is quaint and beautiful, and the owner/staff were so friendly and accommodating.  Have nothing but great things to say about this place.  Their food is fresh and even their most simple pasta sauce is so flavorful, I was amazed.\n\nMenu has a great option of making your own pasta dish and still reasonably priced.  I'm so happy I live nearby this place, it's going to be my go-to Italian spot from now on.  Give it a try!", "author": "Cara M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-03", "description": "Visited for work and I must say it was a nice treat.  Nestled in the neighborhood of Brooklyn Heights, I was immediately transformed.  This was the perfect place to have great Italian!", "author": "Niki B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-03", "description": "This is one of the better restaurants in Brooklyn Heights. \n\nI came here with my family for mine and my twin's birthday meal. The produce was fresh. I could tell the kitchen was ON this night. The seafood was cooked perfectly. The pasta was fantastic and seasoned appropriately. Nothing was over the top. It was an incredible celebration of the season. We sat outside as it was a lovely evening. The wine that they brought to us was a great match (a chianti...how can you go wrong with a chianti?) \n\nThe waitstaff was very attentive and acted very quickly. The meals here were a bit pricy but, for the size of the portion and the quality, I didn't mind in the least bit. This is a great place to eat. Family atmosphere. There's some love that has gone into this place. Family run restaurants make my world go round and this one delivered.\n\nWell done Cafe Buon Gusto. You've earned another eventual visit from me and my family.", "author": "Hunter M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-04", "description": "My favorite restaurant in BK Heights.\nExpect fine Italian cuisine and excellent service; I am surprised every time I try a new dish. There's a variety of lean and dairy free options, try the Eggplant Parmigiana, the  eggs Boscaiola, and then the Challah French Toast. Definitely 5 stars.", "author": "Santiago S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-09-02", "description": "I came by on Monday afternoon with some family of mine from Italy, who were in town visiting. In total there were 5 of us. Little did I know that your staff took it upon themselves to add a 15% gratuity to the check when it arrived. \nMaybe they thought they could rip off foreigners but I am born, raised and have lived in Brooklyn my whole life. And since my family doesn't speak English, I did all the ordering. And your \"restaurant\" had the nerve to add on gratuity. No where on your menu did it say gratuity added automatically for parties of 5 or more. You my friend are a crook for sneaking that onto the bill.\nI will spread the word of this in the neighborhood and online.\nOh and PS, my cousin from Milan, said that was the worst espresso she ever had, and couldn't finish it.  CROOK!", "author": "John D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-23", "description": "I had the linguini with fresh white clam sauce.  The six healthy sized clams were extremely fresh.  Sauce was balanced and tasty.   There could have been a little more pasta.", "author": "Beth O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-09", "description": "This is one of my favorite places to order from in BK heights! Everytime I order it I forget how much I love it. \n\nThe food is packaged well, always hot \u0026 comes in a timely manner, and is delicious. I hope to go in and dine there very soon!", "author": "olivia k."}], "servesCuisine": "Italian", "priceRange": "$11-30", "name": "Caffe Buon Gusto", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "151 Montague St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/GTuIdEHSkpWloATo9iIucA/ls.jpg", "@type": "Restaurant", "telephone": "+17186243838"}