{"aggregateRating": {"reviewCount": 171, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-13", "description": "My friend just recently moved into the downtown Brooklyn area and she can literally order from TONS of restaurants. We were in the mood for Italian food and decided to order from here. This is seriously THE BEST ITALIAN food I have had in a seriously LONGGGGGG TIME! No exaggeration. \nThe prices are GREAT and delivery time was fast!!!\nAll I can say is don't hesitate to order or eat at this place. I would give them 6 STARS if I could!", "author": "Lady B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-12", "description": "Caesar Salad was dressed perfectly. Trout Emiliano was delicious. Definitely worth a second visit! I give four stars instead of 5 because I haven't tried enough of the menu, it was a little chilly in the dining room and the music playing overhead didn't fit the mature atmosphere. When a hip hop song came on that did not censor the n-word; I had to choose not to be annoyed and so I wasn't. Bottom line: I was very happy with my meal.", "author": "Nique S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-22", "description": "One the best in restaurant around the area. great food and nicr staff. I go there often and I recommended to all my friends", "author": "Azin M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-16", "description": "Treated myself to a nice lunch for one on a rainy day, and went to my old faithful, Caffe Buon Gusto. It remains as lovely as ever - clean, with polite staff, and great food. My crab ravioli with shrimp and spinach, plus a side of broccoli rabe was delightful. \n\nThe cream sauce on the ravioli is the stuff love songs are made of. So glad that this restaurant is one of the few places that consistently serves great food in a charming establishment. I'm not in Brooklyn as often as I would like nowadays, but I'm so happy that Buon Gusto always makes me feel right at home.", "author": "Nelle C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-14", "description": "Best restaurant in Brooklyn Heights. Amidst tremendous hype and intense competition sits Caffe Buon Gusto, an understated gem of Italian gastronomy. We've tried every upscale place in the Heights and none of them approaches the food, service, and value here on Montague Street. The extensive and comprehensive menu never disappoints. Whether you begin with the pear-gorgonzola salad or grilled bacon-wrapped jumbo shrimp, the appetizers are meticulously prepared and expertly seasoned. The pastas are all house-made. Try the fresh pappardelle with fennel sausage or the king crab \u0026 linguini in spicy marinara. These savory wonders arrive steaming hot. Order from the extensive wine list before selecting an entrée. My favorite is the skillfully braised, crisp-skinned branzino filé with a splash of peppery extra virgin olive oil. My wife loves the lamb chops. There's so much more to explore including the warm chocolate tart to-die-for. Caffe Buon Gusto is a beautiful, family-run restaurant.  The wait staff are courteous and professional. Come hungry and leave gratified by the food.", "author": "Robert D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-05", "description": "Love this place. I always order the Romana chicken and it never disappoints. So good. It comes with a side of pasta, which is just ok. But overall the meal is great. The bread they serve with all their meals is so tasty too. I'll definitely continue ordering from here.", "author": "V M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-13", "description": "Spontaneously walked in after a great afternoon in Brooklyn Heights. We were greeted by the owner Jack who was extremely friendly. My girlfriend got the eggplant parmigiana and I had the chicken parmigiana. Both were very good. Prices are very reasonable compared to Manhattan prices. We will definitely be back if we are in the neighborhood.\n\nRachel and Ben", "author": "Ben B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-13", "description": "Ambiance = old school, service = warm and on top of things, crab ravioli = filling and finely sauced. Cheap, tasty Italian that boosted my spirits! Would happily return even though the glass wine was not the most fresh.", "author": "Leslie B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-11-05", "description": "Brunch is really bad here. Stay away from the hollandaise and definitely avoid the bacon. I had dinner there once and it was, at least not as bad as brunch.", "author": "Christopher L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-05", "description": "Solid, romantic neighborhood spot. \nVery friendly and down to earth staff.\nReasonable prices.\nHandmade pastas fresh daily and with several italian-american staple sauces to choose from.\nDelivery is fast and accurate and they are very generous with their extra pizza bread!", "author": "Anna C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-24", "description": "I came here for dinner on a weekday with coworkers. A friend and I shared the penne vodka with sun-dried tomatoes and artichokes. Dinner was delicious. Staff split the pasta for us before bringing to the table. It was definitely enough for two people. My other friends enjoyed their meals, whether shared or individual (mostly pasta with seafood). For dessert, I had my favorite, tiramisu. It was amazing. I also tried a bite of coffee tartufo, which was smooth, rich, and delicious. Staff was very accommodating and friendly. We were seated immediately and there wasn't much wait time for food. I'll definitely be back.", "author": "Lauren W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-16", "description": "Love this place! Stopped here for a late morning cappuccino on a Tuesday. Very friendly service, wonderful atmosphere, and great coffee! Plus, the outdoor seating feels just like being in at an outdoor cafe in italy. Definitely recommend coming here for a relaxing and enjoyable experience!", "author": "Marissa Z."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-22", "description": "A spontaneous dinner gone well! We were happy to dine in the charming hideaway dining room. It was virtually empty so we felt like we had the restaurant to ourselves, except of course for the few loud sports commentators at the interesting front bar.\n\nThe sight of the small but empty-ish bar could be a tiny turnoff for couples or solo diners, but once you pass it and enter the ski resort-like, relaxing haven, you'll be able to enjoy the quiet and comfortable vibe at Cafe Buon Gusto, while savoring their authentic pasta.\n\nI had the popular crab ravioli with shrimp in a cognac cream sauce and a glass of tasty full bodied red wine. I wanted to fall asleep right there. Talk about pleasantly full.", "author": "Michelle W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-30", "description": "Lovely upscale atmosphere to meet a couple of friends last night for dinner.  Attentive but unobtrusive service.  They brought out the wrong side dish for one of my friends initially but corrected it right away.  Mixed drinks were good, although a little weak. Food was excellent. Dining in was much better than when we tried their delivery last year. Overall, we would return for a special occasion.", "author": "Sarah Y."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-12-05", "description": "First, I ordered take out from seamless and when my order was delivered it was short 2 salads and 2 pastas..I called and the gentleman was very rude and said the sides of pasta were the entrées ordered. I explained the web site asked you if you wanted a choice of salad or pasta..He never offered to make the order correct or admitted the sides were not delivered. Only after my daughter got on the phone and advised him she would give him a bad review did he offer to correct.\n\nSecond, the food was second rate, no sauce on the baked ziti and the meat lasagna was inedible..\n\nNever again,", "author": "Sheri A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-06-10", "description": "Came here on a work lunch with an old supervisor. She is a regular and I'm not so I took her advice on food. She ordered from the lunch pre fixe menu which was reasonably priced and offered plenty of food and good sounding options. I had the lobster linguini which was absolutely amazing. The staff was very friendly and accommodating but I do have to dock them some points for making us ask when someone was finally going to take our orders (we were running on a tight schedule so the delay was especially noticed).\n\nOther than that one hiccup, a very solid and pleasant lunch spot. Would recommend.", "author": "Galen R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-30", "description": "The food and service is great! A quiet little restaurant that you may walk past but don't. I got the crab ravioli and split it with my sister...the waiter was really nice and actually split it for us. It was so good that we ended up ordering another plate! \n\nService was also great; we had multiple waiters come in and check on us to make sure we were good. We also received a free glass of wine which was great. \n\nI would definitely recommend coming here and will be visiting again!", "author": "Laser S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-05-02", "description": "Neighborhood place with good pasta.  Sort of an older person vibe.", "author": "Alice E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-17", "description": "My favorite place in the neighborhood. No matter if you just want to have a drink and a small bite at the bar, or sit down and have a really tasty Italian meal, never had a bad experience. Wait staff and bar tenders are REALLY nice. Also like their brunch, reasonable prices and great food.", "author": "Karsten S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-18", "description": "Its not outstanding but its really good. If you are in Brooklyn Heights and looking for a cute place to eat outside, I would definitely check out this place. Couple friends and I decided take advantage of a good weather and sit outside for dinner. The place was not crowded and the service was good. Huge portioned meals and everything was good but I would not describe them to be exceptional. Still a very good neighborhood spot.", "author": "June K."}], "servesCuisine": "Italian", "priceRange": "$11-30", "name": "Caffe Buon Gusto", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "151 Montague St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/GTuIdEHSkpWloATo9iIucA/ls.jpg", "@type": "Restaurant", "telephone": "+17186243838"}