{"aggregateRating": {"reviewCount": 171, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2019-02-24", "description": "I can't believe I've lived in Brooklyn for ages and haven't heard of this place. I found them via Instagram when someone took a picture of what appeared to be angel hair pasta with vodka and fresh mozzarella. I can here to order it and it was impeccable. We also ordered the salmon with a zesty sauce and capers with a side of mashed potatoes and everything was well made. Service was fast and pleasant. The environment was super cute. I'd return here again.", "author": "Marley M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-03-31", "description": "The Brooklyn Heights location just isn't very good in terms of quality of food. Service was great and the ambiance is nice for a group of 4 or less. \n\nBut we ordered three of the pastas and they were all bland. I ordered an Alfredo pasta and the sauce was extremely heavy but bland. It tasted like the sauce was made from Parmesan from a can, instead of real Parmesan cheese from a block, and used unsalted instead of salted butter. \n\nOverall, I'm not a fan unless you're a health nut looking for flavorless Italian food.", "author": "Judy S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-12-27", "description": "Located on the famous Montague street in Brooklyn , this place is your classic Italian restaurant . From the exterior the decor was very relaxing. During the warmer months they offer outside dining , where they have comfortable seats and clean tables. As you walk inside there is a nice bar , which was pretty busy and more than enough tables to host a party if you'd like. Upon entering  man greeted me , looked like he was the manager or boss. \n\nThey offer a delicious pre-fixe menu for $28 that includes appetizers, a main course, and dessert. They also offered my favorite black linguine - which was al dente - now if you have never tried like link weenie, the ingredients to black linguine is made with squid ink. They made a wonderful black linguine. This was shown by the curls in the linguine itself. It is rare to find a restaurant that makes their homemade black linguine- especially making it well.   I was surprised about the delicious dish! For an appetizer we order the shrimps and scallops. The shrimp and scallop was made to order. For dessert we ordered the lemon meringue pie, and the classic tartufo. \n\nAll in all, the food was delicious. However the huge downfall to this restaurant and the atmosphere was the lack of service. The service was horrible, I had three different waiters wait my table, and they did not communicate with each other. They were very forgetful of my order, and even gave me the wrong dessert. When asked for water, water did not arrive at our table till 15 minutes later.", "author": "J T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-11-06", "description": "My experience at Cafe Buon Gusto was okay. My group and I came around 11:00 AM, and we were pretty lucky because most restaurants in the area don't open until 12 noon, so we decided to check this place out! We received pretty good customer service, so I was happy about that.\n\nI ordered the seafood linguini, which was good, but a tad bit on the salty side. The fried calamari had a rubbery taste, so it was hard to enjoy, but the sauce was delicious! I even dipped some of the complimentary focaccia bread in it. \n\nI was surprised to find that the brunch plates seemed pretty empty. My two friends ordered the eggs Benedict, and the portion sizes were pretty small. This was a tad disappointing.", "author": "Xenia M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-05-01", "description": "The food was good. I liked sitting outside. Prices are a bit unreasonable for the quality. I got chicken parm and my friend got meatballs w spaghetti. The location is nice but I've generally had better Italian food.", "author": "Janae C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-06", "description": "I came in here one rainy Saturday to take myself on a date. I had read great things about their Crab Meat Ravioli (I think it was around of $18) and wanted to curb my pasta craving.\n\nI came at the perfect time. Around 4pm. After the brunch crowd left but before the sinner crowd. There were a few folks at the bar and only one other table sat. \n\nAs soon as I walked in, I was greeted and sat at a corner table alone. The music was right up my alley and included all the classic 90s R\u0026B hits. Very chill and the perfect vibe I was looking for to distress from a crazy few weeks at work. This one my first time dining alone at a table at a restaurant and they made me feel very comfortable as I sipped my wine and sang along in my seat.\n\nNow honeyyyyyyyyyyy, when I tell you that the ravioli BLEW MY MIND. I ate every single morsel on that plate and could have kept going had it been bottomless. It paired great with my glass of Sauvignon ($9).", "author": "Mia N."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-19", "description": "Just your average Italian restaurant. Nothing too special about it. I had the meat lasagna which was very good as it came out on a skillet so it was nice and hot. My friend had one of the lunch specials which included an appetizer (he choose shrimp wrapped in bacon), an entree with a side (he choose the Romana and pasta), and a desert (he choose the cheese cake). \n\nI'm not a fan of bacon but I still enjoyed the appetizer. His desert was also well done, a bit small though. The bread the came with our appetizer was also a bit stale. \n\nWe dined outside which was very nice. His meal cost about $22.00 and mine cost about $15.00 which seemed pretty reasonable. I would revisit if I was in the area but I would not go out of my way for it. Although I think it would be a good spot to take visiting parents and the like. It's not somewhere you would leave and want to tell everyone about but it is a nice place where no one would be disappointed or unimpressed.", "author": "Rebecca F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-04", "description": "Just as good as their location in the UES! Wow - amazing pasta. We had the gnocchi alla vodka and the fettuccini alla bolognese. I'd highly recommend both. \n\nThis location is much bigger than the UES one, but with the same charm and great service.", "author": "Rachel B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-09", "description": "I got lucky on Thursday looking for a nice Italian restaurant in Downtown Brooklyn. I was going to have dental work later that day and since my Dentist told me to eat a good meal prior to having the work done, I figured I'd treat myself to some pasta. \n\nThe staff at Caffe Buon Gusto was on point! They were quite nice, and very, very attentive. I didn't make reservations, was seated immediately and offered the lunch menu. There were so many things to choose from, my head was spinning. I ended up with the Penne pasta and Alfredo sauce. And since I couldn't decide if I wanted sausage or meatballs on the side, I chose both.  I knew I would end up with enough food for two or three meals. I very rarely eat all my of food anywhere I eat, plus it's an excellent way to economize. The meatballs were ok, but the Pasta with Alfredo sauce and sausage were so good I couldn't stop smiling. The hostess offered and added Parmesan and pepper to my dish, which made it even better. You would have thought I never eaten good food before. I also drank a small glass of white wine with my meal. I shouldn't have, but it really took the edge off and calmed my nerves before that dental work. I'm glad I did, it was really good. And I totally forgot to ask what kind of wine it was. All in all I highly recommend Caffe Buon Gusto, I seriously doubt you'll be disappointed. I can't wait to return, and try something else on their menu!", "author": "Cheryl M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-24", "description": "This is really a hidden secret on Montague Street.l have walked by for several years and finally decided to  check  it out. I was quite pleasantly surprised.  The place is quite cozy and very upscale. As soon as you walk in you are greeted and taken care of immediately.  \nI love the selections of pasta and salad  that they offered. They also had a price - fixed menu for lunch. I tried the grilled salmon with mashed potatoes, cherry tomatoes with asparagus.  It was smothered in a saffron sauce that was quite tasty.. A very nice sized salad for my appetizer  and cheese cake for dessert. Service was excellent. I also ordered a nice glass of Moscato to push my fantastic lunch over the edge. This is how they lost 2 stars. When the waiter came to the table he had a bottle of Riesling . He started to pour and l said this is not what l ordered.  I know, but this is better. He pored a sample and l really did not appreciate it  one bit. He said Moscato is too sweet and it has too many calories. I started to speak on the situation, but my friend and colleague  of over 25 years touched me on my arm . Jack, let it go, and so l did. I am not a big girl by any means. 5 feet 8 inches and 168 pounds soaking wet!!!@@%$#@. Anyway, l had an edge l didn't plan on having. I really enjoyed my experience  there other than that short episode. My point  is l asked for what I wanted, not what you think l should have. In order for me to return l would have to flip a coin. Some of my best decisions  have been made this way.", "author": "Jacqueline E."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-01-19", "description": "Unenjoyable evening . Trout Almondene was terrible. \nSpecifically asked the waitress if the trout  was free of bones. Of course she said yes.\nWell...there were more bones then almonds.\nCouldn't eat it . The wine was ok", "author": "Rick M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-22", "description": "This was a lovely restaurant. Spent the day walking around the neighborhood with my father and wanted a quiet place to go for dinner. The setting of the restaurant lights and soft music has an interesting mood, almost like a date night but it was a nice relaxing place to go after a long day. \n\nThe service in the restaurant was very good and the  waiters were very informative and hospitable. Our server was particularly helpful in narrowing down the choices. Our appetizer was the baby octopus which was excellent. It was a soft and a little chewy and was served with cherry tomatoes. I ordered the Penna alla vodka (of course served with extra Parmesan cheese because I'm only human) and my father ordered the linguini lobster which was also very good (he wasn't very willing to share). \n\nFor dessert if you're feeling adventurous I highly recommend the poached pear with corte sauce.  It's a bit unusual for a dessert but it's definitely a required taste. It's a poached pear sliced in half and boiled in corte (red wine). It's served with whipped cream that contains a slight orange rind taste. It's very good and definitely deserves an opportunity. My father ordered the pistachio gelato and thoroughly enjoyed it.", "author": "Friya B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-19", "description": "Wine sauces goes perfectly with the lamb chop, salmon is very fresh and tender, best tiramisu I have ever had!", "author": "Kinki L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-03", "description": "We went to lunch here for our family reunion. I must say the food was amazing, from the appetizers to the dessert. I had the extra large shrimp wrapped in bacon WOW!!! Then the lollipop lamp chops with risotto \u0026 asparagus paired with white Moscato and finally Italian cheesecake. My sister had the salmon with mashed potatoes and asparagus paired with white Moscato and chocolate almond cake for dessert.", "author": "Sharon J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-17", "description": "I visited the Caffe on June 5th. The lovely Grace was the bartender who made  us feel like we were the only people in the restaurant. \nMeatballs were delicious.\nI will definitely be back next time in town. I suggest you visit for a unique and special experience.", "author": "Paul M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-23", "description": "It had been a few years since I tried Buon Gusto and I had a craving for pasta so I decided to go there for lunch yesterday. I think I ordered the wrong dishes because they were absolutely average. I had linguini with fra diavolo, which was tasteless. It was spicy, as it should be, but  that was it, no other taste. It could have benefited from extra parmigiano, which my waiter did not offer. The linguini was cooked al dente, which was nice, but seriously, Rao's Arrabiata out of the jar is better than the sauce they served. I also ordered the Caesar Salad which is completely ordinary and uninspired. The Caesar at b.good down the block is 100% better. If I'm so unhappy with my meal why 3 stars? I'll tell you:\n\n1.) The restaurant has a nice outdoor seating area which is great for people watching. \n\n2.) Service was quite good, they took my order quicky, refilled water and were pleasant and polite. \n\n3.) I'm giving them the benefit of the doubt and admitting that I may have just ordered the wrong dish (although there's no excuse for average pasta at an Italian restaurant). \n\nSince I've been here in the past and had pretty good meals, I will definitely go back and try something else, but probably not for a while because a $27 lunch (including tax and tip) should be fantastic, not just average.", "author": "Laura K."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-01-31", "description": "Always a pretty good go-to for tasty Italian food. However, with my delivery order tonight they really pushed some buttons. A linguini and shrimp dish was delicious, but only contained four shrimp. Okay, I'll give them a walk on this. It was the dessert I found disgraceful. A $6.00 slice of ricotta cheesecake was so small it was practically invisible. If I was served this in the restaurant I would have sent it back. Just so everybody can see, I've attached a photo. Nobody likes to be ripped off, particularly when it's in my own neighborhood.", "author": "Craig Z."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-25", "description": "This caffe offers a great variety of mixed foods, such as Spanish cuisine ranging to classic burgers. Very nice and cozy environment, staff was very polite, and food was mouth watering. I would recommend this caffe for anyone looking for a quick bite. Five stars!", "author": "Larry N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-18", "description": "Ordered for delivery and was presently delighted. Food was delicious, and arrived promptly.", "author": "Adventurous P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-28", "description": "Honestly, I've walked by this place a hundred times but had never gone it. Mostly, it's because the outside seating is so cramped and the restaurant's front is so small. But, since we didn't want to cook and had a minor something to celebrate, we thought we'd give Buon Gusto a chance. The menu outside looked like it had a lot of options. \n\nInside, the space was much larger, comfortable and not crowded at all. The menu had a lot of interesting possibilities, but we went with the Caesar salad to start, followed by a couple of the pasta specials; crab ravioli and a penne with chicken, artichokes, sun-dried tomatoes and a tomato cream sauce. \n\nThe pasta portions were seriously large. I hate it when I go to a place, order ravioli and get like six raviolum (that's probably the singular of ravioli). Both our pastas were delicious and the Caesar salad was too. I think of myself as a Caesar connoisseur, and this was definitely a good one. \n\nUnfortunately, they're going to lose a star because the service wasn't that great. The waitress never came by to offer us a dessert menu or a second round of drinks. And that's surprising, because we wanted to look at the dessert menu, but we had to wait that long we changed our minds. \n\nBut, I'll give them the benefit of the doubt, the waitress was nice, and she might have been busy with something else. Would go again as I would love to sample some of the other items on the menu. I'll just hope that the service is slightly better next time.", "author": "Emily P."}], "servesCuisine": "Italian", "priceRange": "$11-30", "name": "Caffe Buon Gusto", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "151 Montague St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/GTuIdEHSkpWloATo9iIucA/ls.jpg", "@type": "Restaurant", "telephone": "+17186243838"}