{"aggregateRating": {"reviewCount": 171, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-05-19", "description": "Ok.  So I gave it another chance (or three) after a few year hiatus.  I have to say they have improved.  Loved the chicken soup and the prix fix menu items.  I have not recently tried the pasta (which was previously overcooked and just plain bad).", "author": "Scott C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-05-08", "description": "I consider this to be the best restaurant in the Heights. I was there with a friend on a recent Saturday afternoon, and it was a welcome haven of quiet elegance, with starched white tablecloths and an upscale feeling. I have never hd a bad meal here.", "author": "Clint P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-25", "description": "I only stopped in for a glass of wine in the afternoon - 2 for 1 during happy hour 3-7 PM.  then it started raining and I went inside to wait a bit.  I ended up ordering the Fantastica del Bruschetta, which was really interesting!  Based on that one dish, I'd like to go back and see what else they might have.", "author": "Robert S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-10-10", "description": "This place is great for locals and visitors to the neighborhood. Situated just a few blocks from the Promenade makes it perfect for a date, family gathering or anytime you want to go to dinner and take an awesome stroll afterward.\n\nI was just here for a bday dinner...I made a reservation for 12 people and changed both the date and time twice. Not many restaurants (especially ones that do well) will give up this much real estate during prime eating hours. The staff could not have been more accommodating. \n\nThe food is classic Italian - everything I tried was delicious. The appetizers were the weakest point, but the prices are so reasonable that I definitely recommend looking at the wine list and getting dessert. The berry tart is AMAZING; served warm with coconut gelato.\n\nWait staff was friendly although seemed a little inexperienced. Overall, entirely a pleasant experience.", "author": "Lis K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-04-07", "description": "**Delivery**\n\nMy boyfriend and I ordered through seamless - a little after 9pm on a Sunday night. Okay - obviously, end of week, end of day -  so when delivery estimate is 35-45 min, and it wasn't here by 10pm, I wasn't that surprised or alarmed, but decided to call just to check in. \n\nThe woman on the phone could not tell me whether they had received our order - as the \"delivery boy\" just left \"10 minutes\" prior, and apparently takes ALL record of any order with him. *At this point - may I suggest to the management that this is a terrible system. She requested I call back in 10 more minutes if I hadn't received anything yet.\n\nNothing came. \n\nI called back 20 minutes later - would have suggested just canceling altogether since she mentioned on the first call that the delivery window ends at 10pm, but in what seemed like a good customer service gesture, took our order again, and sent it back out. (** Will have to update about whether we were charged double - bc. at this point - it wouldn't be a surprise). \n\nJust before 11pm - buzzer rings - great, awesome, thank you so much! ..... \n\nI had ordered a $6 slice of cake and my boyfriend their $6 tiramisu (and THANK GOD we didn't order anything else). The slice of cake was smaller than something from a child's play set. Seriously, I don't know how to describe how RIDICULOUSLY small the thing was - it was comically small. Imagine cutting a muffin top (not even the full muffin) into thirds. That was how small it was. When I first looked in the bag - I thought for a second they somehow packed an empty clear container. Okay, at least the Tiramisu looked like a generous portion. Evens out, okay (maybe). Oh no. Wait the Tiramisu - is hard as a rock FROZEN. Like literally - a block of ice. My boyfriend broke it in half - and it was just frozen through and through. There was NO WAY they it was an accident. You pull something out of a freezer - and send it to someone - it's not edible. \n\nIf that tells you anything about what they are serving you in-restaurant - it looked like they tossed us what was in the dregs of their deep freezer. I read some of the other positive reviews - and it is really hard to believe any of them - after what we experienced. \n\nGood luck - you have been warned.", "author": "alyssa b."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-03", "description": "Great Food, Excellent Service. What more one could ask for  for a family easter dinner.\nEnjoyed every moment of it.", "author": "Kumudha R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-11", "description": "This review is for a dinner event held for st johns alumni , the place itself is cute, it has a greek touch in the design on the walls . The tables were set up very nicely, long tables to sit large groups of 4 8 and 10 so it feels more like \"family\" style. The service here was fairly quick, they always made sure i had my water refilled and baskets filled and the waiters had great manners and very polite staff. They brought the dishes out one by one, so all salmon dishes came out first and then chicken,etc so the people who ordered the last dish in service had to wait. What stood out to me was the quality of the food, the bread was fresh, the fried calamari was perfecty crisp and plentiful, the marinara sauce has a hint of lemon it was perfect. The entree or chicken capp. Was perfect, the breading of the chicken didnt make it feel like it was too heavy or dry. The presentation was very nice, they placed the garnish and vegetable and cheese salad on top of the chicken , just add a little bit of olive oil from the table and youre all set. The dessert i chose was the ricotta cheesecake which was a very small but thick layered piece, it wasnt as sweet as id hope for but it was definetly fresh. The only thing that holds me back from giving five stars was that the bar in the front looked a bit small they could of expanded it and the bathroom itself was very pretty and modern but the candle they had lit was an awful scent ( think of an old grandmothers cheap perfume with apples and cinnamon totally weird ) , the floors were pretty dirty they could of made the bathroom a little but more tidy for the event. Would i come back to this place though? Absolutely, the food is worth every penny!", "author": "Michelle C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-06-17", "description": "A Solid three -\n\nHad dinner here last night. The outdoor seating is nice because Montague has a lot of sidewalk space. The service was quick and attentive. \n\nI had the homemade spinach-ricotta ravioli and chose the carbonara sauce. It was all very tasty but the dish lacked plating. So the taste was there but not the 'yummy' look. Same with my date's veal tortellini (which came with a mushroom sauce). Tasted nice but the plating lacked. We could taste the flour in the dishes because we had ordered fresh pasta. \n\nOverall not a bad job, would eat there again but we weren't wowed. The pricing is reasonable.", "author": "Sara C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-02", "description": "This place was great food and a relaxing summer dinner outside.  The prixe fix menu for dinner was a great deal.  The salad with aged balsamic vinegar was a great way to start the meal. The three mini lamb chops which were fantastic and well paired with a port wine reduction.  For dessert, the ricotta cheese cake and tiramisu which i shared with my dining partner were both a perfect way to end the meal.", "author": "Andrew D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2007-09-02", "description": "When visiting someone who works for the Eastern District Court of New York, I suppose this is a decent place to eat.  And that's really the best thing I can say.\n\nThe food is your typical fare, pastas and whatnot.  And it's prepared in a perfectly acceptable way.\n\nService is a bit slow and their serving size of soda leaves much to be desired.\n\nI left feeling... ehn.", "author": "Jinny S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2008-07-16", "description": "My friend and I were looking for a lunch spot where we could sit outside, and this place fit the bill.  We were both craving pasta, so we split 2 pasta dishes-- crab meat ravioli with a cognac cream sauce and spinach ravioli with an artichoke vodka sauce.  \n\nThe crab meat ravioli was good, and came with jumbo shrimp too, perfectly cooked.  We both preferred my sauce; the focaccia soaked up the extra nicely at the end.  The pasta dishes do not come with a salad or anything, so we basically ended up paying almost $20 each for pasta only.  The portions are not huge, but we were pretty impressed with the pasta (the ravioli is homemade).  Would I go back?  Probably not, but if you work in the area I would check it out.\n\nThe outdoor seating area was very cramped, but it was worth it to enjoy being outside on such a beautiful day.", "author": "L C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-05", "description": "Very good meal. Service was able to make substitutions to suit the vegetarian diet of my guest as well as my own gluten free diet. Very tasteful but not super fancy, they skipped some of the upscale dining formalities.", "author": "Sally R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-05", "description": "We were on our way to Teresa's down the street for potato pancakes when we noticed that CBG has potato and meat pancakes on its brunch menu. The atmosphere was nice (huge HD screen with the Chelsea v. Liverpool game with a nice crowd watching at the bar). The bread and olive oil were so good that we asked for another basket. Coffee was great... much better than anything else I've had on Montague. I got the focaccia sandwich with prosciutto, arugula, tomato, and mozzarella. It was perfect. My friends got gnocchi (a little too soft, but still good) and an omelette. With three coffees and dishes, the total came to $37 after tax. I'm definitely going back to try the $20.12 prix fixe menu.", "author": "Courtney F."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-12-22", "description": "The worst! Made a reservation yesterday for lunch and it wasn't  honored.\nThe manager didn't honor anyone's reservations made for lunch and gave away tables to walk ins (three other couples waiting for their tables prior).\nWill never try to eat here again.", "author": "Daniel M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-06-25", "description": "The tomato sauce on the $16 black linguine with calamari and the $15 linguine with clams was bland.  Not worth the money.  Heights Cafe on Montague had a tastier plum tomato sauce.", "author": "Corey B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-04", "description": "I have been here at least 5 times (usually from the period of 2 to 5 pm) and the experience has been consistent. it's italian food, basically, that you would have here (i can't recall now the meals i've had here, but i particularly recall the taste of their fresh-ly baked bread). the service has been very attentive, helpful and courteous. the staff would really go out of their way to make your experience outstanding. although it could be problematic if you're taking a table outside and its on the path that leads to the businesses upstairs (or probably the apartments upstairs)----i had seen some of those people going upstairs getting mad at us, the customers, for occupying the space where they would have normally stepped up to get upstairs. or probably, i think the neighborhood (or the neighbors upstairs) can be snotty---which can be to their loss....who likes to be treated ill-fully by neighbors who think they're superiors to their other neighbors?", "author": "Jerome Espinosa B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-11-24", "description": "Came in on a Monday afternoon. The waitress was rude and unknowledgeable. She could not provide any information about the dish I ordered and had never heard of a Remy Martin. I had the grilled calamari for my appetizer and homemade ravioli crab meat with shrimp, spinach and chopped tomato in a cognac cream sauce for my main course. Both were delicious. It is shame this place has such bad service.", "author": "Matt G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-09-13", "description": "Well, looking at the other reviews, it seems like people either love this place or hate it.  I thought it was OK...\n\nI ate there on a pleasant weekend afternoon, when Montague St. was closed and there was plenty of outdoor seating.  We enjoyed drinks and breads while waiting for lunch.  The sandwiches were tasty.  The different options looked basically the same -- your choice of portobello, salami, etc., on foccaccia with mozzarella and pesto.  You have more mix-and-match pasta options, also tasty.  All together, a nice, relatively quick lunch.", "author": "Dano W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2009-07-04", "description": "Italian food that is pedestrian at best but for New York it is a *ZERO*.  \n\nThe standard pasta side is a fusilli that has been sitting in what tastes like canned tomato sauce.  Ugh.\n\nThe fish dishes are way too salty.  The veal dishes are a complete waste of what might be fine meat -- but we'll never know because the kitchen destroys the veal.  The pastas resemble what the Atlanta Marriott might serve at a corporate event's buffet lunch.  Get on line, and grab a plate.\n\nThe atmosphere is completely uninspired.\n\nThe waitresses all seem to be young Russian immigrants.  No problem with that, but it's an interesting dynamic.\n\nIn a nutshell: it's the kind of place people who don't dine out often might be lured to as an upgrade to Friday's or Dallas BBQ.  But the rest of us will be disappointed.  \n\nHow this place manages to stay in business is beyond me.  \n\nVisit near-by Noodle Pudding or Queen for much better Italian food.  Or call me -- I'll bury its product in my little kitchen any day.", "author": "O U."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-07", "description": "i am 100% italian and this place has authentic italian food. i had a veal dish and loved it, the scallops wrapped in pancetta as an appetizer was delicious. my sister ordered pasta and it was delicious as well.\n\nthe atmosphere is a little dated but the food was really amazing. waitstaff was friendly as well", "author": "N P."}], "servesCuisine": "Italian", "priceRange": "$11-30", "name": "Caffe Buon Gusto", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "151 Montague St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/GTuIdEHSkpWloATo9iIucA/ls.jpg", "@type": "Restaurant", "telephone": "+17186243838"}