{"aggregateRating": {"reviewCount": 171, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-15", "description": "OK for the sake of transparency and the love of keepin it real I must disclose that I know the owner. Having said that let me review...  \n\nDinner: The food varies and depending on the dish it can be a crap shoot. Most of the pastas are very good and so is the seafood. The eggplant parm is a major disappointment... The atmosphere is good and I do bring dates, just not Italian ones.\n\nBrunch: Pretty standard, omelets and all \n\nDeserts: Much better than average\n\nWine: Very good,  the owner has a good pallet   and does not serve BS\n\nAll in all I recommend the place but stay away from the eggplant.", "author": "Alan N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-02", "description": "The service here is phenomenal. I totally forgot I was in NYC for a bit. Every single employee was attentive, charming, and friendly which all makes for a better dining experience. My glass of water was never below half. \n\nThe food was great as well. We came here for brunch and enjoyed eggs benedict with mushrooms and I ordered the homemade foccaccia with salami, pesto, mozzarello, and arugula. \n\nI'll definitely be returning here for another awesome experience. \n\n4 stars = great service + delicious food + good prices", "author": "Allis P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-07-25", "description": "I think this place is fantastic. It's a great location on Montague with plenty of opportunities for people watching. The atmosphere inside is nice and cozy. The outdoor seating is relaxing on a beautiful day. And the service is fantastic. (Every time I go, the manager always opens the door for me and asks how my meal was.)\n\nThe food is reasonably priced, and the handmade pastas (~$12-15) are delicious. They also bring out a great bread basket with foccacia, french bread, and pizza bread.", "author": "Alice T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-24", "description": "went here with 3 of my friends we all got different dishes, homemade gnocchi, homemade  ravioli, homemade tortellini and spaghetti and meats balls, everything was incredible we got a bottle of wine to spilt and then the gracious waiter gave us a bottle on the house! how sweet, not to mention he was very helpful with the menu! the atmosphere is so cozy and cute with tablecloths and candles, a quiet bar and quant patio with fairy lights. Very nicely priced. the gelato, poached pears, and tiramisu are to die for!! this is a must go! in a great part of the neighborhood, and did I mention we went at 9:30pm? they close at 11! the food was still fresh and came out in perfect time! this place is must! :) we have already decided we are going back again! texas loves you!", "author": "Emma D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-05-22", "description": "Caffe Buon Gusto is located on Montague Street, featuring indoor and outdoor seating. There's a gracious, almost textbook Italian-American host who will seem like a long lost uncle as he warmly greets you with outstretched arms (Even though) I did not pull up in a Vespa and say \"Ciao\"  ).\n\nThe outdoor seating was packed so we ventured into a larger interior complete with bar and lots of table configurations-- large round ones for groups, smaller tables for two right next to each other, and the occasional outlier in the corner. Dim lighting, Frank Sinatra songs and a wait staff that seem related complete the scene.\n\nWhat immediately caught my eye as an antipasti was the offering of a bresaola roll. Bresaola is proscuitto's beefy cousin, a salted and aged thin slice paradise that must be produced in the Valtellina region of Italy to earn that moniker. ( Otherwise it's just the generic 'beef proscuitto'. Those wacky EU regulations)\n\nServed as a roll with asparagus, goat cheese, red peppers, shaved parmesan and citrus oil, the wait staff was kind enough split the appetizer into two portions for me and my wife. Goat's cheese and bresaola were a winning combination, a great way to experience the taste of beef without any lingering aftertaste.\n\nYou can pick your pasta and sauce at Caffe Buon Gusto and explore the many possibilities. (Or as Spock would say \"Infinite Pasta in Infinite Combiantions- IPIC). \n\nMarinara, puttanesca, carbonara, fra diavolo, vodka, alfredo, pesto, bolognese and more! \n\nSince I didn't feel that creative I opted for the homemade black linguini with calamari and radicchio. Squid ink makes the pasta black and the rest of the squid is cut into circles and becomes my calamari. Nothing goes to waste and nothing was wasted on my plate. The marinara sauce perfectly blended with the linguini-- no red sea of sauce for the calamari to swim in which is fine by me. Scare your date by pretending black worms are exiting your mouth-- such a feat is now possible with black squid linguini.\n\nThe dessert portion of ricotta cake was on the small size. About two fork fulls and your done. So an appetizer (shared), two entrees, two desserts and coffee came to $60. Beware that if you customize your pasta and want to add additional items you'll bring the price up to the $20 range.", "author": "Tom K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-05", "description": "Here's the secret about Buon Gusto:  It's near Armando's, the only comparably priced Italian restaurant on the block.  Armando's is a legendary neighborhood icon; Buon Gusto is not.  Fabulous meals at both places is mostly a given.  But Buon Gusto has impeccable service, a lovely decor, and al fresco dining in warm weather.  They take nothing for granted and have no laurels to rest on -- yet.\n\nThis is another place I can't believe I took so long to review. Maybe it's because my patronage of Buon Gusto predates the existence of Yelp.  I was never a regular, but Nando, the owner, always remembers me and says hello, even when months pass between visits. His beautiful and attentive waitresses know their business. They are friendly even when it's busy and almost always remember the mid-meal check-in to find out if anything needs fixing.\n\nMy favorite dishes are the black linguine, the baked salmon, and a skirt steak (one of the specials, and not always available) with port reduction sauce over spinach.  My favorite salad is a very light baby arugula with shaved parmesan drizzled with olive oil. The lunch specials feature pasta with a great selection of four or five sauces - bolognese, pesto, primavera, puttanesca - that, while not fancy, are solidly satisfying. These pasta dishes are portioned just right: you won't go hungry, but there will be nothing to bring home.  There are also lunch selections made from homemade pasta for those who want to splurge a little.\n\nOne time, I had some disappointing tiramisu.  But on a more recent trip there, it was fabulous:  light, fluffy, and just below room temperature.  So I do not have a single negative thing to say about Buon Gusto.  They are fantastic.", "author": "Jeffrey Z."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-07-02", "description": "I've eaten here a handful of times. I've only tried the Crabmeat Ravioli and the Lobster Carbonara or whatever it's called...both are really delicious and worth the money. My only gripe with this restaurant is today I went there for lunch and ordered a coke. The waiter got my coke from the bartending dispenser at the bar.  When I finished the first glass he asked me if I wanted another one and I said \"Sure!\". At the end of my meal I asked for the check, and saw that I was charged for TWO cokes....and it was $3 each!! I've never gone anywhere with a soft drink dispenser and been charged for refills. Highly annoyed.", "author": "Desmonae P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-09-24", "description": "I think it's the last time we will be here.  My husband ordered the eggplant parmigiana.  It looked good when it arrived, with it's cheesy top, but below that layer, the eggplant was just mush.  You couldn't identified any actual slices of eggplant.  Thankfully, it came with a side of pasta, so he had the pasta side and just a bit to the eggplant parm.  Disappointing.", "author": "Amy K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-15", "description": "I love Caffe Buon Gusto!  I have been to the Upper East Side location once before and was thrilled to see this restaurant in my new Brooklyn Heights neighborhood.  This past weekend it was such a gorgeous Saturday, and I was able to have a lovely meal outside on the front walkway with three friends.  The staff was so nice, they moved around a few tables just to accommodate us for a late lunch at 3pm.  \n\nThe menu offers a nice variety of homemade pastas and authentic Italian dishes, as well as some awesome appetizers, such as the Pan Seared Shrimp and Scallops ($9.95) which are to die for!  \n\nI think this will be my go-to restaurant in the neighborhood for a good, consistent meal and a nice glass of wine...for a date or just a night out with friends.", "author": "Krista J."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-12-23", "description": "*Delivery*\n\nI will never order from here again, I literally threw away my Eggplant Parmigiana, it was that disgusting. It was relatively pricey and then inedible to top it off. The eggplant was not cooked correctly, it was both bitter and mushy. \n\nMy boyfriend got the Chicken Parmigiana and was not impressed either.\n\nThe Caprese Salad and Caesar Salad were fine, but not good enough.\n\nFail.", "author": "Brittan B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-03-03", "description": "Casual and cozy.  The pasta is great and they have a great selection of sauces.  Service was right on top of things.  We never ran out of water.  Bread was replenished as soon as we ran out (we were waiting for a guest and it took longer than expected).\nI am not a fan of crab cakes but I can have them again.  \nI ordered the carbonara on linguine but I got the bolognese instead.  I was with my brother and his wife whom I haven't seen in 2 years so I didn't complaint.  Ate it all and it was gooood!\n\nDuvel and Palm were the brews of choice.  For desert: Tiramisu and espresso.  Do have the espresso.\n\nIf in the area, I will give them a chance again.", "author": "Michael R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-30", "description": "Dear Public:\n\nI had a bridal shower for my niece at Caffe Buon Gusto today for 18 Ladies.  I did not want to waste a minute in letting you know that this was a huge success and Marco (the manager) was incredibly accommodating!  We had half the space to ourselves and truthfully it was as if we had a private room because most of the customers chose to sit outside since it was such a sunny day.  The staff was incredible and what ever I wanted to do, they said okay!  I decorated the space with balloons and flowers and a sign that they allowed me to hang from a light fixture.  \n\nThey created a menu just for our party and it was so special.  The food was delicious and the drinks were perfect.  From start to finish it was just awesome.  The restaurant gave us an entire space for gifts which was extremely helpful.\n\nThanks Caffe Buon Gusto for once again being the very wonderful venue you continue to be after so many years!!!\n\nBravo!!!!\n\nLois S.", "author": "Lois S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-06-25", "description": "2.5 stars?\n\nI called early for reservations and they said it wasn't needed. Came here at 7:30pm for Father's Day and it was DEAD.  Tell-tale signs?  Perhaps.\n\nWe sat inside as it was chilly day.\n\nThe biggest complaint I have is temperature.  If you don't eat your food within 2 minutes of it coming out, it will get cold fast.  The AC plus the ceiling fans were strong.  Not only the food was cold, the people were cold too. It really put a damper to the dining experience.\n\nOverall, as far as Italian food goes, this was definitely NOT the best.\n\nAppetizers:\nbaby octopus - over grilled, tasted too burnt\nshrimp wrapped in bacon - only get 3 pieces. and i heard it was overcooked\nprociutto with melon - VERY interesting flavor mixes, i would recommend trying this.\nmussels white sauce - got cold too fast due to the aforementioned complaint.  otherwise, i felt like it was too much butter used in the broth.\ncrab cakes - only 2 pieces. could have been cirspier.\n\nMain Courses:\nFarfalle with creamy alfredo sauce and sausage - they first sent out this in 'alla vodka' and we sent it back.  they came back with the right dish in 5 minutes. VERY creamy if that is how you like it.  i don't personally like it to be too creamy so this was a bit much for me.\npenne from the prix-fixe menu - this dish....sucked.  pasta was too undercooked and hard.\nveal from the prix-fixe menu - didn't personally eat this myself, but heard it was decent.  the side pasta here was better than the other two, and it tasted like it came from a chef boyarde can. plain tomato sauce.\n\nDessert:\nTiramisu - not bad, it came with the prix-fixe.  would i have paid for it separately? probably not.\nThe cheesecake was just so boring and bland.\n\nIn the end, I was much more disappointed than expected.", "author": "Diana C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-06-22", "description": "Not the best Italian food I've ever had but my family liked it. Heavy on the sauce. Awesome gnocchi. Their tortellini soup in clear broth was tasty too. \n\nThey have an outdoor eating space. Large inside eating area. Big pitfall though, the water was warm and the ice melted. Ick. It tasted disgusting and thus, a 3 star rating because the food was ok but the service was shotty.", "author": "Valerie V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-02-11", "description": "- low key\n- recommend duck w/ risotto and the poached pear for dessert\n- owner (Nando) floats around to greet customers", "author": "Casey W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-01-19", "description": "Inviting atmosphere, willing if semi-skilled wait staff, reasonable priced menu with a prix fixe ($28) all hopeful signs on the way in. Three of us used the fixed menu with OK results. The PF pork chop was a little tough, chicken Parm satisfied but did not delight. The general consensus was fair to middling. You might enjoy the vibe and eats if \"down the middle red sauce italian\" is your aim. My group won't be back.", "author": "Ken L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-17", "description": "This is a great place . Lots to offer great food . Friendly. It makes me feel I'm in my grandmothers house. Great staff couldn't be more welcoming. I really recommend this place .Drinks are good too!", "author": "Esmeehan F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-24", "description": "Hungry and never having been to Brooklyn, I was walking the area looking for a place for a late lunch.  I stumbled upon this place and I am so glad I did!  The staff was welcoming and knowledgeable.  I chose a great pasta, sat at bar, and feasted.  I guess I was lucky but would return to this restaurant!  Loved the environment, ambiance, and hospitality!", "author": "Rick R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-09-29", "description": "An utterly worthwhile dining experience for those that revel in indulging in vapid food and insipid wine. Those that don't might be better off looking elsewhere.", "author": "Johnnie C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-16", "description": "We took advantage of the Italian Restaurant Week prix-fix menu.  Never even heard of this restaurant before that and we are always in the area.  The food was hot \u0026 delicious, very authentic tasting \u0026 flavorful.  The complementary bread is so yummy especially when dipped in the seasoned olive oil.  I had the pan seared salmon w/ asparagus in saffron cream sauce and I was in a heaven of conflict wanting to gobble it up but at the same time savor the flavors for an eternity.  Hubby had the meat lasagna alla fiorentina and loved the freshness of the flavors.  The waitstaff was attentive and friendly.  Very welcoming atmosphere, a wonderful first visit to what is sure to be a regular date spot for us.", "author": "Monique M."}], "servesCuisine": "Italian", "priceRange": "$11-30", "name": "Caffe Buon Gusto", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "151 Montague St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/GTuIdEHSkpWloATo9iIucA/ls.jpg", "@type": "Restaurant", "telephone": "+17186243838"}