{"aggregateRating": {"reviewCount": 573, "@type": "AggregateRating", "ratingValue": 2.5}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-04-04", "description": "I ordered a fairly big takeout order from this location and when I got home and took everything out the bag there was something wrong with every part of the order. The sauces are great don't get me wrong... that's like the only good thing. My order of the classic chicken wrap w/ fries literally had like 10 fries with it... it looked so sad. My large order of boneless wings were missing a few pieces in each box. Some of the boneless wings weren't even covered in sauce. The little cups of blue cheese that came with it weren't even halfway filled there was barely any blue cheese. The girls who helped me out were nice but I'm very disappointed in the entire order. Not good for service.", "author": "Aaliyah O."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-08-25", "description": "PACKED before the Blink 182 concert last week at Barclay's Center. We were able to grab a table near the bar (we had two, but when the servers asked f we were ordering from the bar they asked us to only use one of the two-person tables for the four of us), and get some drinks and food. Food and drinks are par for the course for BWW: Good wings, wide variety of beers from ones you know and love to some slightly-less-than-normal beers.\nOverall I left full, with a credit card smoking.", "author": "Brian G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-08", "description": "super short review. \n\nIts B-dubz so you can't expect much. As bad as the service usually is, you come here for the \"experience.\" [even if its generally not a good one].\n\nI love their honey BBQ and salt and vinegar boneless wings. This location is the one I always go to and it flip flops on how the service is. But, again - this chain is what this chain is. I still come back regardless. \n\nTerrible parking. Actually, none- because its Atlantic avenue. So...take the train.", "author": "Amanda R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-31", "description": "I entered from the take out section by accident. I was trying to get the 2 takeout employee's  attention, because they were in a full blown into a conversation, and they made eye contact, and dismissively continued their conversation. This was on a Friday evening. I passed the section saw a waitress, and she directed me to the hostess/host section to be seated. The host didn't listen since apparently I had a party of 3, and he kept saying party of 2. I reminded him for the 3rd time party of 3. Then the hostess came, and she was able to seat me right away. This is the first time going to this location. I have gone to the one in Harlem, and never had any issues. This location needs much improvement in service. The food was good though.", "author": "Brenda R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-11-27", "description": "So I travel to Brooklyn once a year for the Powerhouse concert at Barclays Center. The first year I went I was shocked to find that when the concert let out there was little to eat in the immediate vicinity of the arena. I'm from Buffalo so I'm used to being able to get pretty much whatever I want at 4am. Enter Buffalo Wild Wings. This location is basically around the corner from the arena and open until 1am. There's been a couple mad dashes before they lock the doors but we made it in. After a certain time they do ask for ID to enter but that's not a big deal. The wings are what you'd expect from a chain. Decent but nothing to write home about. Again I'm from Buffalo so I'm picky about my wings. The 3 star rating is for the service I received on my last visit. I know it's late but you're still open which means good customer service is expected. It wasn't super busy yet it took us almost a half hour and asking 2 people for a server to finally come over and even then she seemed like we were bothering her. It took another half hour to get our food and all of our food didn't even come out, I had to ask TWICE for what was missing. I was super disappointed in the service and since the food is just mediocre at best there wasn't much to redeem. Unfortunately I'll probably be back at some point because it's literally one of the few options available in the area after midnight but it will be under extreme protest.", "author": "Nicole L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-24", "description": "I've been here maybe 3 or 4 times before, but for some reason never thought to review until now. I came here on a Sunday afternoon, on the second day of football season. My boyfriend, being an avid football fan, was quite happy that they asked if we were here to watch the game. \n\nRegarding the other reviews about the terrible service, I can't speak for them, but during my precious visits, the service was meh. Nothing great, kinda slow, but overall not a big deal. This time, the waitress that served us was very enthusiastic and courteous, recommending me flavors that weren't spicy Bc I can't handle spicy, and giving extra blue cheese for my boyfriend who ordered the mango habanero. She kept the water coming, which showed how attentive she was. We left her a 20% tip Bc she was amazingggg.\n\nThe food was really good too. We got a medium (3 choices) with Parmesan garlic, Asian zing and mango habanero. I took one vote of the mango habanero and choked, but I was in love with the Parmesan garlic!! We also got the loaded wedges, which was huge and also really good. Only critique was that we asked for the wedges to come out first, since it's an appetizer, and it came out with the wings. Oh well, better for my pic. They also didn't label the wings with the stickers like they're supposed to. Instead, they stuck all of them on one side. \n\n4.5/5, I'd definitely come back again!", "author": "Jenny G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-08", "description": "Home Goods service. Is a nice place to take the wife and kids the best of sports fanatics............", "author": "Dwayne Z."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-03", "description": "I LOVE wings and I love Drinks. Unfortunately this place is not great at either.  My group and I walked in on a Sunday afternoon and the place looked like a ghost town. We were eventually greeted by a pleasant older woman who walked us to a booth.  Soon after a VERY nice waitress named Ciara or Sierra (I know her name because she actually told it to us when she greeted us, I have noticed lately a lot of waitstaff rarely do so these days tsk tsk) introduced herself and even made a recommendation on a drink. Her energy was so enthusiastic and kind my friend and I both ordered it. It was some pink drink that frankly just tasted like juice. Ciara insisted it was because the liquor mixed in was premium that was why it just tasted like juice but after having 2 I still do not believe there was any liquor in the glass or maybe the bar tender is a teetotaler.....I dont know.  Ciara advised that Long Island drink is not strong at all as other customers have complained and said as such so I am starting to suspect their drinks are just not worth it. Maybe their beers fare better?  The other sad part was that the chicken while spiced and flavorful, was sub standard from what I remember.  Two wings I bit into had a smell that bothered me but the spiciness of my Mango Habanero took over my thoughts. Additionally the wings have that fatty, GMO mutant type consistency that I have tasted from microwaveable buffalo wings. No bueno.\n\n3 stars for Ciara who is a GREAT waitress and the very pleasant hostess but this place needs to do some serious revamping.", "author": "Ariel S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-02-22", "description": "One word that would best sum up this location here and that's CONVENIENT. Since this Buffalo Wild Wings is a few blocks from where I live, I have the opportunity to just get out and walk to there with no problems.\n\nNow you might be wondering why I say CONVENIENT and that's because that is pretty much the only reason to go to this location and especially for Take-out in which I get a lot. When going for takeout, I always try to double check my order EVEN AFTER THEY DO IT because you can just about guarantee that they'll forget something. I can't tell you how many times I've walked back home, sat down and realized and said \" OH Sh\u0026t, again?!!!\" For some reason they always forget something. The Wait is another thing, it usually takes a while to get your food, usually 20 minutes and can be longer depending and you usually have to stand due to seating being limited. When you taste the food, it's usually pretty good, won't complain there, IT'S BAR FOOD BASICALLY\" so you shouldn't. Now like I've mentioned here earlier, I usually go for takeout purposes and have actually only done sit-in like twice and during those 2 times, I've noticed a lack of attention but hey, this can happen. Overall, if you are looking for decent bar food, I'd say do it once in a while but be prepared for what I mentioned above.", "author": "Curtis E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-22", "description": "This place was very convinient, and the food was very good, my daughter liked the chicken quesadilla and the super cheesy mozzarella sticks  i would come back again and hopefully soon!", "author": "Sara G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-24", "description": "Ok I must say this review was going to be 1 star do to our waiter. He was rude inattentive and tried to duck us every time we wanted to tell him our order was missing something or incorrect. To show how inattentive he was, we had to ask another waitress for a manager because our waiter wasn't around. Dorothy the manager not only addressed every issue but was so sweet! she is was made this review 5 stars. Thanks Dorothy!", "author": "J B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-29", "description": "Every time I come, I have a good time. Sasha is usually my bartender and she's a sweetheart. The food is what it is. It's BWW -- no surprises, nothing mind-blowing. Just wings, nachos, alcohol, and sports. Exactly what you expect. I dig it.", "author": "Jay F."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-05-22", "description": "Today was not a good day to come I felt the morale of the employees pretty low the service was sub par and very slow. We waited 10 mins after self seating to a dirty table for service. The food was okay but honestly for a chain like this I had better experiences.", "author": "Chris S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-02-20", "description": "Horrible.... i have been to multiple BWWs and this one is not the one to go to. The wait was not long and it has never been long, its just where the waiting area is at is way too much traffic. The hall is small and that is where the bathroom is. It is annoying when you are going to the restroom and it is annoying when you are waiting. \n\nBad service from our waitress. She took forever to greet us and then left us no utensils, no water, and she took forever to come back to check on us. We had to grab another waitress for napkins. I wanted a refill and she was no where to be found. Then after 20-30mins of not checking on us after the food came, another waitress shows up and says she is taking over for her. The time management was horrible because the couple next to us felt the same way. Management should have came out and apologized or something. \n\nNow, I have been here more than once and it is a hit a miss with the service. As far as the food, my boyfriend hates this BWWs location. We love the one on Austin St in Queens, but this location is closer. The wings came out extremely quick, so we should have known something was wrong. We had 4 flavors and one entire section was cold. Again, our waitress never came back to check up on us and the new one showed 20-30mins later. We just took the wings home to heat up. \n\nIt is okay to have young kids as waiters and waitresses, but they are joking around a lot and not taking this customer service seriously and I can speak because I waitressed once upon a time. We will definitely travel to the Austin St location where the wings were hot and service was even hotter!", "author": "Tamara L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-27", "description": "This is my go to place for wings, beer, and football. The staff has always been friendly. The bartenders attentive, and the prices very good. The have a good number of beers on tap plus some specialties. I've love chiming fit happy hour, plus Tues and Thurs thru have great wings specials.", "author": "Airial R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-12-22", "description": "Not impressed, the Knicks are playing the Nets right across the street from the Barclay Center Downtown, Brooklyn. The server was courteous but seriously overwhelmed it took about an hour and a half to recieve our order. Seriously.  People who arrived after we did were seated and eating. Our party was big but c'mon son seriously????\n\nWhen we recieved our order ....it was wrong. \n\nThe store manager was apologenic and comp my meal, the waitress was damn near tears and complained about various co-workers who called out that night. Clearly not my issue...I'm trying to be compassionate,  however its game night in Brooklyn two home town favorite are going at it... pleeeeeeaaaassse be prepared for a mammouth crowd when two New York favorites go head to head for bragging rights. Clearly they were not ready for the Brooklyn nite take over, seriously more staffing for that night would have made the difference. \n\nWhen the food arrived it was aight, but we were way too pissed to enjoy it. \n\nThe Knicks won.\n\nNever again on game night. Never.", "author": "Letty C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-28", "description": "This location of Buffalo Wild Wings is an utter disappointment of a restaurant. The food is mediocre at best and worse of all the service is abysmal. A friend and I ate here yesterday and were saddened by the experience. We returned today and were refused service because of an apparent age restriction, although we are here a day prior. Please don't dine here unless you are dying of starvation, it's a joke a dining experience.", "author": "Vincent S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-04-14", "description": "The worst sevice for BWW, is it because its located in Brooklyn? Its not fair tho'. \n\nHostess were not friendly at all, either because of shes tired or she hates her job. But seriously, hostess is a crucial role for a restaurant. \n\nSat down for more than 20mins and nobody gave me water nor greet me. 5 mins prior of those 20, somebody asked me what to drink. When I said what I wanted, he said \"one moment\". Before he asked me, he took order from a table in front of me. \n\nDude, I have worked in a restaurant before. Trust me, you can take orders from 3 tables after one another. \n\nAt first I thought they're short staff, but when I walk around, there were like more than 7 servers in the bar area. WTF. \n\nThis location of BWW is the dirtiest, the worst service and the weirdest of all BWW in NYC.", "author": "Wulandari D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-05-06", "description": "I've been to 2 different locations ...mainly for take out ...they weren't bad, bt this one ...well...read on...\nstopped in for lunch at the Flatbush ave location...not good at all....had the boneless chicken , and Mac and cheese . Mac and cheese was runny and bland ....chicken was so hard as if they were leftovers from the previous day, was reheated in the microwave ...all moisture Gone...nothing but hard dry chicken and served. Disgusting ! Hostess was ok...did what was expected ... as far as making sure all orders were taken and thanking us  for coming in \nMost likely wld not be returning ...even if lunch was free...thanks but no thanks !", "author": "Demora F."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-08-12", "description": "I eat a lot at other locations in the south.\n\nThe chicken tasted and looked like it was pre cooked and reheated.\n\nVery dry.  The meat on the boned was dark.   Usually when freshly cooked you the meat and bone is light colored.\n\nNot good.\n\nOh and it was pricey for a Buffalo Wild Wings.", "author": "D G."}], "servesCuisine": "American (Traditional)", "priceRange": "$11-30", "name": "Buffalo Wild Wings", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "139 Flatbush Ave", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/ENoWKg2ScYUtSOPF-xpcJA/ls.jpg", "@type": "Restaurant", "telephone": "+17189439453"}