{"aggregateRating": {"reviewCount": 573, "@type": "AggregateRating", "ratingValue": 2.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-12", "description": "Don't know why this place has low ratings. Perhaps its because of the long wait? I usually wait around 30-40 mins to get seated and today was no exception. Just kill time and walk around Uniqlo and Target. Decided last minute to get wings today and it never disappoints. I always get the dry seasonings because I don't really like the ones with the sauce (weird, i know...) My favorite are the lemon pepper and the buffalo. Service was great, and the waiter checked up on us a few times. Will definitely come back and maybe try one of those extremely hot wings one day...", "author": "Joseph H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-03-26", "description": "If I did not enjoy the flavors of the wings here, I don't think I would come here.\nLet's start with the food. The food is good. Well-seasoned and sauced. Some times, the wings can be overly hard, but still okay enough to eat. The blue cheese dip goes well with the wings. I've also tried their onion rings, which is also very good. The sauce that comes with the onion rings is also pretty tasty and goes well with the dish.\nThe service, on the other hand... A hit or miss. At times the waiters/waitresses would be good and attentive, coming by every so often. Other times, they would be no where to be found! It makes you think if they're avoiding you or that they're busy socializing elsewhere. One second they're by the table next to you, next second they disappear and don't come back until 5-10 minutes later!\nThe wait time is also very unpredictable. There have been times where the dishes come quick, while other times, it's the longest wait ever when you're hungry.\nI do enjoy eating the wings from here.. Everything else, though, probably depends on your luck. Perhaps you'll get a good waiter/waitress.. Perhaps your wait time wouldn't be that bad, but you'll never know.", "author": "Nanciee N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-22", "description": "Great place to have chicken wings!! lot of flavors to choose from. I love their Thai Curry and Honey BBQ Chicken wings the best! The pulled-pork was okay except the meat wasn't soft enough.", "author": "S S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-19", "description": "I seriously dream about these wings and fries! If you need some wings to fulfill your cravings I recommend this place", "author": "Christina R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-08-02", "description": "I have been to bdubs all over the country and the food is clutch as always and gets 5 stars. The service on the other hand gets a  NEGATIVE 5 star rating (minus the people at the bar who were exceptional). Do the math between the 2 stars and you get a 0 star rating. However since I cannot give  0 stars they get one but do not deserve it. Not only was this was my worst all time bdubs service experience ever but this makes the list for my ALL time worst service experiences. I do not want to get into what happened several times I might add because it is only going to make me mad again But, Long story short if they mess up your order they act like you owe them an apology. I will be submitting a complaint to the company. Good food but just don't expect to be treated like a customer. Beware and enter at your own risk!", "author": "Perry T."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-05-10", "description": "The beer selection is great. The wings are pretty good, but the service?! Why must I come out and get annoyed? I simply asked for the \"mild Chicken Salad with tomato, celery , \u0026 cucumber chopped fine . My boyfriend ordered the Wing Sampler. His order came out, as we shared his, I figured my order would be out shortly. It never did. When I found our server requesting she just cancel my order since we were almost through with the wing sampler, she told me she never put my order in because \"it confused her little head.\" I won't be back!", "author": "Linda S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-04", "description": "This is how good BWW is:\n\nI used to board the 65th St. station with the R in Woodside Queens, made my way to 59th and and Lex, switched to the 4-5 train all the way to Flatbush, BK. I am not kidding... A one-hour trip just to satisfy my love for BWW. I don't usually like wings that much, but those are AMAZING.\n\nThis is a sports bar. Nothing fancy, but I have never been disappointed with the food. Over the years, we have always ordered the same things...\n\n1. Honey BBQ traditional wings. YUM!\n2. House salad with the asian sesame dressing.\n3. French fries (SOMETIMES)\n4. We have ordered the chili con queso with the pita chips once. It was delish, but we usually don't order it because it's just too much food.", "author": "Bianca L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-26", "description": "First time at BWW and I absolutely loved it. Please ask for Mark, very helpful and very professional. Both the food and the service deserve 5 stars.", "author": "Jonathan P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-12-10", "description": "I came here with a large group of friends -- 23 people or so, and we had to wait four hours instead of the one to two they had originally told us. I know its ridiculous to come with such a huge group but it was for birthday celebrations. When we finally got seated, we all ordered but my food came the pretty much last. Everyone was nearly finished eating by the time I was served. The wings tasted good and I enjoyed how nice our waitress was. She was very very sweet and patient with such a huge crowd. One of the reason I gave this place three stars is because there were other waiters who was very rude. He got us to sing happy birthday for another table who was also celebrating a birthday but we had three birthdays at our respective tables and had told them so during our long wait to be seated and he only brushed us off saying \"and happy birthday to you guys\" after the song the other table. I felt that was rude and disrespectful to my friends. But other than that I can understand the long wait and messed up food ordering since we had so many people, though I admit it irked at the time. The food was good, if you're lucky you'll have a nice waitress like we did and its a nice place for a smaller gathering!", "author": "Wendy Z."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-01-11", "description": "After a trip to Target, we stopped in here to pick up an order we had phoned in.  Boneless wings are 60 cents a piece on Thursdays, so we ordered those with sauce on the side.  The wings were pretty small, so you need to order a lot.  Also got the fried pickles- they were good, not great.  Nothing like Smashburger's fried pickles- we should have gone there for dinner instead.  \n\nAtmosphere on a game night can be kind of rowdy.  Definitely crowded and the line for take-out was pretty ridic.  Also, the place was pretty dimly lit which didn't seem to be a good idea... Wouldn't eat here for sit-down service.", "author": "Dee S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-04-25", "description": "The wait time was so long, that we almost made the decision to move to another place. Time to order the foods came, we all ordered our wings, burgers and wraps, along with fries, Wedges and the blazing hot sauce. The food came, and as expected it was nothing out of the ordinary. But we did have a good time. Though the only thing is it was bit too much loud, could not really talk with each other. I guess that's what you call a sports bar.", "author": "Md B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-01-13", "description": "I like it here, The location is convenient but the service is always extremely slow whether you order take out or sit down to eat it's always slow.", "author": "Tabitha T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-28", "description": "I don't think this place has anything on Super Wings (superwingsny.net) but that's just me. The 20-minute delay for a table was the worst. The restroom was another big issue with the lack of paper. It's located directly by the hostess and she was told twice before finally doing something about it. I don't get it. She seemed a bit frazzled after being shifted all over the restaurant and didn't even put my party's name on the waiting list. We were finally seated after she regained some of her senses and the food came out pretty quickly. Our waiter was at least knowledgeable about the menu to help us decide. The traditional wings with mild sauce were okay. I much prefer Super Wings! If you haven't tried it, then you're missing out.", "author": "Kristia B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-07-03", "description": "Everything was great until I paid my bill and left a tip (approx 20%).  Ordered another drink, after waiting 5+ min for it with no drink, told the bartender that I was going the bathroom and not to throw out my remaining wings and to leave my drink with my food when it was ready...  came back a couple min later and my food/drinks were gone, and a guy was in my seat.  After asking her what happend, they offered to have them remake my four wings while I waited, but having no seat nor drink, I took the hint and left...  guess I should have waited to pay my bill and leave a tip...", "author": "Oliver R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-01-05", "description": "The wings are bleh. The burgers are really good.\nThey had an entire list of drinks, and only 3 were available. \nSo I ended up trying a Hard Cider. Pretty good.\n\n\n*Clean bathrooms, no lines.", "author": "Nancy T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-13", "description": "bad start! took 10 minutes to get a waiter then...jacob shows up and everything is  better!", "author": "Denise S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-12-01", "description": "This place was average. I was very excited to try Buffalo Wild Wings because one was being built near where I lived before I left Boston. They have a pretty big selection of flavors for wings. When we went it was football Sunday so naturally it is busier since it's a sports bar restaurant. The wait was probably around 20 minutes, and if you didn't want to wait you could seat yourself at one of their high top tables. When we got seated it didn't take long for the server to come ask us if we wanted drinks and he also dropped off some napkins. We ordered one of the appetizer samplers and then a snack size wings. The wings in the sampler we got in the spicy garlic flavor and the snack size wings we got in caribbean jerk flavor. The spicy garlic I wasn't sure if it was spicy garlic at first. And even after eating a few, I still couldn't really say it was spicy garlic. It tasted more to me a buffalo wing because I could not taste the garlic at all. I would not get this flavor again. I really liked the caribbean jerk flavor! When you bite into the chicken at first it was a sweet flavor, but after the flavors sit in your mouth for a while it gets spicy and after a few wings I felt my mouth was on fire. The spicy was a very peppery spiced kind of spicy not so much like the buffalo wing spicy. It was very tasty. I kept grabbing more even though my lips were burning a little because that sweetness at first is just enticing, but then that spiciness just hits you hard after.\n\nOkay now for the service part. I get that this place is a wings place and wings are finger foods, but I feel it should be basic restaurant etiquette to provide utensils and serving plates because not everyone is getting wings and not everyone eats wings with their hands (which I'm guilty of). Maybe they do give you utensils if you're not ordering wings but either way it should already be on the table or given to the customers when the server first approaches. And I would just like to have a small serving plate in front of me so I don't feel like I have to eat over the plate they serve the food in which is in the middle of the table, or I don't want to be putting my food on the table or napkins they provided. We kind of had to hunt down our waiter to get some utensils and even then he only brought one set, but isn't it normal when someone asks \"Can WE get some utensils please?\" you bring enough for however many people are at the table? We were never offered water even though we got drinks, but still water should always be served, in my opinion, regardless if the customer is getting a drink or not. Our server did well in coming to check on us to see if the food is alright or if we wanted another drink, but the super basic service was just not met. I don't know if this is a management issue where the servers aren't trained to do certain things in this place or if it's a server issue because it's not like our server did poor in other areas. It was a busy football sunday night, but still basics are basics and they go a long way.", "author": "Cynthia L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-07-04", "description": "We came to eat here today after a little shopping and first off the hostess ( hispanic girl with long curly hair) was rude and should not be the first face you see coming into this place unless you don't want to keep customers coming, now I'm a hostess myself at a restaurant in midtown manhattan, you should greet and smile when customers come in even when you're in the worst mood let them know the wait time ask if they are interested in waiting and putting their name down and than thanking them, simple as that...but instead I got \"how many people what's your name and age\" (mind you it's only 4pm)and then she turns around..soooo that's it?!?!!Don't mistreat others because you are miserable with your job/life. HORRIBLE SERVICE!!! We asked to speak to a manager after. Now I know it's the job of a manager to pull their employees aside and speak to them about what went on especially if you want to keep customers coming in and satisfied. We were not the only ones who asked to speak to a manager about the same situation. He did not do anything she was still in the same spot, now we're led to believe he doesn't really care as long as they are making their money but honestly you're going to be losing money keeping her upfront...\n     The only good thing that came out of our visit here was the server Russell, he was attentive nice cool vibe and ontop of that he apologized for something he obviously did not do. Food wasn't worth it, and I'm not saying that because of the bad service from entry but because it really isn't worth it, I've had better wings.  \n...Being my first time and now last time eating here, I am very disappointed and disgusted. I definitely DO NOT recommend anybody to come eat here not even as a last resort. Don't waste your time or money coming to this place!", "author": "Nimsi R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-09", "description": "Went there on a Tuesday for take out.  Very busy. Wings good.  Line was out the door.  20 minutes wait for the food.  Employees friendly which is s plus.", "author": "Manny F."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-01-06", "description": "My friend and I went here in order to watch a football game last night. Personally I was bored, I'm a football fan, but I do not like to watch football regularly. It was very loud as well, people screaming at the TVs and etc, just not my scene. Our waiter was friendly, he got us refills when we need them and we got our food promptly. The reason I'm giving this place one star is our wings, they were tasty, but when we got home we both were feeling sick... and then got sick.", "author": "Rosemarie H."}], "servesCuisine": "American (Traditional)", "priceRange": "$11-30", "name": "Buffalo Wild Wings", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "139 Flatbush Ave", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/ENoWKg2ScYUtSOPF-xpcJA/ls.jpg", "@type": "Restaurant", "telephone": "+17189439453"}