{"aggregateRating": {"reviewCount": 573, "@type": "AggregateRating", "ratingValue": 2.5}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-12-18", "description": "It's a chain. I've been here a lot for lunch and the service can be the absolute worst to not bad. If you can sit at the bar I highly recommend it as I've always got great great service there. The food has always been good despite the service. You can also carry out beer from this location which is interesting.", "author": "Scott B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-07", "description": "The food here was very good the drinks are off the hook one is all you need if your not a drinker I enjoy coming here because I know what to expect when it comes to the food an drinks.", "author": "Karen E."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-01-01", "description": "THE WORST!! Waited almost 40MINUTES for take out of just 18wings!! Put my order in at 9:56pm and had get A Manger after waiting 30mins. time I asked for a refund it was 10:38pm and the Food still wasn't READY!!", "author": "Sade M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-05", "description": "This place is a prime example of a joke. There is a table available that they won't let me take because a server has a lot of tables. What kind of stuff is this? Ghetto.", "author": "Megan T. T."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-08-30", "description": "Food is great, but the service is terrible.  Plain and simple. I've been to several BWW locations and their lack of service at this location is very poor representation for the brand.  Sorry to say I won't be dining here again anytime soon.", "author": "Hannah K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-15", "description": "I came here to watch some Football and the wings was just amazing. The service can be slow or fast depending on how busy they are but its a sport bar you can't expect much. My order came out quick and my glass was never empty, my server was attentive to my table.", "author": "Neal C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-07", "description": "Love coming here on Tuesdays when wings are 50off. One of my favorites is the salt and vinegar wings which is delicious. The line to order can be insane but the trick it to order with the online app for pickup and come ten minutes after the pickup time and it should be ready.", "author": "Christy C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-28", "description": "Well, I found glass in my drink and shift manager Javier didn't seem to think it was a big deal. He said there was nothing he could do about the situation other than write up an incident report and call EMS. It was overall an unfortunate experience. Please do not eat here.", "author": "Terri C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-16", "description": "Didn't get the Blue cheese I ordered, I also ordered all drums and the restaurant told me that's not allowed which is BS because I do it at every BW3 I've ever been at. Do yourself a favor and go to Dinosaur BBQ for wings", "author": "Ricky P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-10-02", "description": "The service here is terrible, waited 15minutes just to get started with ice waters and after we ordered our food we got it around 45 minutes after we had ordered our food.... our server was a short Indian guy and something must be done about the servers at this bww because none of them care about the customers....", "author": "Wengy L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-12-16", "description": "It's somewhat hard to believe, but I probably had some of the worst wings I've ever had in my life here. To be clear, out of some wings I ordered, 2 or 3 were just gristle, no meat, while the rest were edible - but didn't necessarily knock my socks off. As others have said, service can leave a lot to be desired. It is in an ideal location if you are traveling through Atlantic Terminal or at Barclay's, and it is convenient with TVs to watch games. It's just not the experience it should be given it's great location. The location and convenience, however, can offset some of the problems, so I'm sure I'll stop in again at some point, but my expectations will be in check.", "author": "Peter R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-03-09", "description": "This being a sports themed bar/restaurant, I always call an hour or two ahead of an event and ask if they'll be playing the according event. After the person I speak to \"checks\", they often tell me that the event will be playing in the restaurant, at which point a confirm the event, time, and channel it will be played on. They always reaffirm. After all of that, it usually is the case that I arrive, and discover that they're not showing the according event, resulting in my party and I having to go somewhere else at the last minute, and try to salvage what we can of the event. The managers tend to ask, \"Who did you speak to?\" I would then explain that the person didn't say his/her name and would then play the recorded phone call for them (showing them the time that I called, and confirming that I called the right number). The managers always come back with the same old, \"oh, they shouldn't have said that...\" This has been going on for a while, and it puzzles me as to what's so difficult.", "author": "J C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-21", "description": "Good huge portion drinking food with very affordable drinks. They also have a good selection of sports tv channel. Great casual ambience.", "author": "Xinyu L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-09-18", "description": "I LOVE LOVE LOVE  CHICKEN. I always tend to get Buffalo Wild Wings cravings. \nDifferent various flavors for the chicken. Asian zinc will always be my favorite flavor. In my opinion, the traditional bone chicken taste better than the boneless. \nTheir fried pickles and fried mushrooms are a must try! I don't really like mushroom but when I tried bwws, I can barely taste it. I thought it was meat at first haha. The fries are like any other fries. Nothing special. \nTheir blueberry lemonade is to die for!!! Best non alcoholic drink in my opinion.\nThe service here is extremely slow. Our waiter took a while to come after we were seated down. We asked for those paper plates but never received them. However, our waiter was very nice and respectful. \nI would still come back here just for the food even though the service was slow.", "author": "Christy Y."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-22", "description": "I hAd the Blazing! And it was HOT! Not for the faint hearted. I also tried the Thai Spice sauce and that was nice. \nAll the sauces that I tasted are high in salt so if you're not a fan, order sauce on the side. I couldn't finished the blazing sauce buffalo wings as they were super hot. It took a side of celery plus a side of fries plus a side of red sangria to curb the heat :)\n\nDefinitely try the nacho burger. The nachos add a crunch but no taste as such or may be my taste buds were dead by the sauce!\n\nAlso tried the fudge cake which was just ok.", "author": "Dee D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-08-01", "description": "I used to LOVE BWW and especially this location but the service and food quality seemed to have dwindled and the price increased.\n\nCouple of bad things to mention:\n-service here is poor and SLOW.  It will take them 10 minutes to get you water.\n-I haven't spotted one professional waiter/waitress.  It seems like every time I am here and I order food, the employee would sit down next to me to take the order - is this their new work \"style\"?  If it is - I am not digging it, it is not professional at all.\n-ordered the spinach artichoke flatbread thinking it was the dip... (I wonder if they changed their appetizer menu)\n\nOverall - would not recommend this place to anyone.", "author": "Racheal D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-29", "description": "The only thing negative I could say about this place is that on that last godforsaken day that I came here, they told me that they were sold out of fried cheese curds. Obviously they don't care about how much they've hurt my feelings.  What emotions do you expect coming from a fat person who loves food? I felt like it was the end of the world. So I have to give it 4 stars and not 5. You people at Buffalo Wild Wings need to check your inventory more often. Oh yeah and I was also missing a wing. I didn't notice until I was almost finished eating but it's okay. Saved me a few calories. Overall I love Buffalo Wild Wings.", "author": "Chanelle M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-01-19", "description": "One of the worse locations of BWW, but sadly the only one near me. The service is continuously poor, no matter what time of day I come. When I came here a few weeks ago, the kitchen messed up my order and gave me flavors I did not ask for. Confused, I asked my waitress to change it. (I asked for Honey BBQ and they gave me Buffalo). Instead of getting us the correct order on a separate dish, she takes the whole plate of wings back into the kitchen. Meanwhile I was STARVING, it was 7pm and my first meal of the day. She came back about 10 minutes later and they swapped out the wings for the correct flavor but they left it on the same dang platter, putting the Honey BBQ wings on top of the Buffalo sauce that was already all over the plate. I don't understand how that would make any sense to the people in the kitchen or to my waitress, not to mention it came back without the carrots and celery sticks. \n\nA few weeks later came back with another group of my friends and got a waitress who forgot lemons in all our drinks, and our straws. Every time we requested something such as straws, our lemons, napkins, wet wipes or bone trays, she always seemed to forget to bring it no matter how often we asked her. We got our appetizers and had to ask for the sauce 3x before we actually got it. Then when our wings finally came out, she left us the bill right as we got our food. Seems like the only thing she could remember was the bill, and not the service we actually asked for.\n\nBathroom stalls also never have toilet paper, and you have to ask the hostess for toilet paper. I stood there waiting for 15 minutes while she continued to seat people, just to ask somebody else to help me and the TP was under the hostess's booth.", "author": "Winnie M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-07-06", "description": "Had dinner here, the food was good, I had the mild traditional wings and Parmesan garlic boneless wings. My mom had the fish tacos which were surprisingly very good. \nI would say service wasn't good. She was taking forever in taking the order, bringing it and then we had to go search for her to get the check and when she gave it to us, she had added a bunch of extra items and never apologized. She also never thanked us for coming or anything just took the money and walked away. That's why she got a $4 tip. Keep it up!!", "author": "Paula M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-06-03", "description": "I love Buffalo Wild Wings and I've eaten here many many times since high school, never liked their service, and still don't because it's that bad. And it makes me regret after every time, asking myself why I do that to myself and still go each time. The people who work there are lazy as hell, all gathering around the cash register/cashier and chit chatting away, blatantly ignoring the customers of the tables they are in charge of. Some even be flirting away, like seriously? \n\nAnyways, my family and I were shopping in Atlantic Mall and decided to get dinner here. It was quite empty compared to other nights probably because it wasn't a Tuesday not a Thursday night (cheaper wings on those days). We ordered a large for boneless wings ($22.49 for 21) and a large for regular traditional wings ($22.99 for 20). You get to pick four flavors for the large. For the boneless wings I asked for blue cheese and the traditional ones my sister asked for ranch. \n\nOur orders finally came and the stickers for each flavor were all put on one side/ corner. It's supposed to be one sticker at each corner, exactly where each flavor of wings are placed on the plate. So basically we didn't really have an idea what flavor we were eating since some were slightly similar. NOT COOL, had to try the spicy ones to know that it's spicy when that's what the stickers were supposed to be there for. And guess what, they messed up the blue cheese with the ranch. And when I asked for more blue cheese (because that's what I wanted) he's like the one you're using is ranch and he made it seem like it was my fault for using the wrong sauce when it was misplaced by them in the first place. He thought it was funny, but I wasn't amused. He didn't even apologize for the mess-up. Just UNACCEPTABLE. It was hard to distinguish with the spiciness. Even though I don't dislike ranch, I still prefer blue cheese. Luckily I'm not like allergic to ranch or something, seriously shouldn't be messing up on something that simple. Our waiter wasn't smart enough to get us more water because he was the one busy flirting away. And when asked for more water, he took so long to get it. \n\nI might just pass with this place next time. It wouldn't even get two stars if it wasn't for their wings. Their service deducted a lot.", "author": "Tom L."}], "servesCuisine": "American (Traditional)", "priceRange": "$11-30", "name": "Buffalo Wild Wings", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "139 Flatbush Ave", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/ENoWKg2ScYUtSOPF-xpcJA/ls.jpg", "@type": "Restaurant", "telephone": "+17189439453"}