{"aggregateRating": {"reviewCount": 573, "@type": "AggregateRating", "ratingValue": 2.5}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-12-07", "description": "I went there last week. The place was pretty crowded. The host by the name of William was very polite. We sat in Danielle's section. It was three of us. Danielle spend at least 30 minutes just sitting at our table talking. I get it. It is personalized service, but who wants to listen a white trash waitress for 30 minutes  when you are out with your friends???? Who?????\nSo, if you want for someone to waste your time and dining experience....Danielle is the server for you!", "author": "Johnatan S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-04-15", "description": "Woah the blazin wings are NO JOKE.  I seriously had one bite of a blazing wing and my mouth was on FIRE.  I can handle spicy unlike most people, so this was quite the shock when I could hardly tolerate the wings.\n\nI've seen this place in the Palisades Mall and never really ever had any urge to eat there (mainly because I despise chain food).  However, my friend went to OSU and apparently she hasn't seen one of these since college and was quite excited to learn that there was a BW3 (apparently that was the original name) in the Atlantic Terminal Mall.  We went and got food to go and took it on the train (grilled chicken with wing sauce and fries).  I'm pretty positive my lips burned off from dipping a fry into the blazin sauce.  My boyfriend had 6 wings and he asked if this was a joke.. hands down the hottest wings he has ever had.", "author": "Julie G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-01-18", "description": "The food was good, the service was horrible. I only saw the waitress twice, when she took our order and when she brought the check. She never came over to ask if everything was okay, we were coughing up hair balls due to lack of water and we waited over 45 minutes for the food, mind you we ordered salads. We complained to the manager and he apologized for the bad service. He than gave me a coupon for 5 dollars off my next meal, not including drinks.. NO DRINKS?! no thank you...I won't be back. Peace \u0026 Love", "author": "Tracy D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-26", "description": "Good Wings, reasonable price and always something new to try! This is a nice place just to hang out.", "author": "Jaron C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-12-27", "description": "Me and my friend both puked within 30 minutes of leaving the facility.. Think twice before going here...\n\nEnough said..", "author": "Eugene L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-12-27", "description": "I'm rolling at the people talking about the crowd,this is Brooklyn, the hell do  you expect? \n\nAnyway, came here for fifty cent wing night and while the company was beyond compare, I wouldn't recommend coming to this BWW. First of all, the wait is insanely long and they don't give you buzzers, so you have to wait outside awkwardly. Also, the space is small and poorly designed.\n\nWings are tasty and saucy, I think ours were fresh because they took a while to come out. Definitely can't beat the price!\n\n\nBrotip: If you have a choice I would recommend the one in White Plains!", "author": "Amelia Z."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-30", "description": "So, I've been putting off going here for some time. My partner in crime and  I headed over there after an exploratory day in down town brooklyn.\n\nI wanted to stick to what they did best so I did order the wings with the Mango Habenero sauce which was three from the spiciest sauce that they had. It was sweet, not too overly sticky and juicy all the way through; some of the best wings I've had in a long time. \n\nAlso had the Sour Apple Spiked Iced Tea, which was just right. I was relaxed enough to let my hair down a bit..\n\nAll in all a good Sunday evening spot, got a chance to catch some of the yankees game as well which wasn't bad. \n\nStaff was organized, nice and attentive.", "author": "Anastasia C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-11-03", "description": "I mean... They are wings lol. My favorite are the Caribbean jerk. The staff is also very friendly in my experience and there are TV's all over the place. FYI it's adults only at night I think that starts at 9pm. They also have good deals wing night on Tuesday and boneless wing night Thursday. They have giveaways too like baseball tickets.", "author": "Shaina E."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-06-17", "description": "I ordered three types of wings.  two styles of the wings were wrong.  Service was very slow and it seemed like the people working at the pick up counter were very disorganized.  The phone was ringing and nobody was picking up the phone half the time.  The food was stacked up but the employees were not making an effort to get the food to people who were picking up their order.  By the time I did get my order, it was wrong and by the time I got it home it was almost cold.  I didn't realize my order was wrong until I got home which made matters worse.  It seemed like everyone was moving so slow and everybody working the pickup counter was disorganized.  The food is OK but that is if they get your order right.", "author": "don m."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-14", "description": "Some good waiters, some bad. The manager will do something about it if your order is wrong. Minor infractions that I can live with. They have Lots of wing flavor choices and it is very inexpensive on Thursdays depending on what you order. Also you can get the discount for wings Tuesday's and Thursday's for take out.", "author": "Kim B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-02-11", "description": "I went with a group of friends and we got seated really fast but it took us an hour to get our food. The waiter also forgot the orders of 2 of the people even though he read back our orders right after taking it. \nI also dislike the rule where you need to be 21 to enter after 9pm. I guess the place has a bar but you can't get in even if you want to just sit and eat wings.\nThe wings were pretty good but for the price and bad service i don't think it is worth it.", "author": "Bin C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-08-15", "description": "This location has to be the worst location in New York. The issue with this location is that it is located in a very busy section of Brooklyn and is always packed. Because of this it seems under staffed, the staff is usually scrambling to get the orders in and bring the drinks. Most of the time they get the orders wrong and the food comes out cold. The restaurant it self is not always clean. The bathrooms are gross and the floor of the restaurant is sticky. The staff and management try to be polite and make the most of the customers experience but it does not always work. Go somewhere else !", "author": "Cassandra L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-05-04", "description": "0 stars for take out, literally dialed 12 times and no one answered. When I arrived employees were standing with nothing to do. I don't understand how that is possible.", "author": "Diana M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-11-14", "description": "Habanero hot wings are great with  onion rings.", "author": "Cee F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-08", "description": "Ate here at midnight after a Barclay Center concert. The service was a little slow, and we kind of had to find our own way to be served. Food was delicious though.", "author": "Kevin E."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-09-12", "description": "When I think football, I think of chicken wings and beer. So when I was asked if I wanted to watch the game with the boy, I replied only if I can eat stupid amounts of chicken wings. That didn't seem like an issue.\n\nThis large, spacious grill \u0026 bar, situated on the 2nd floor of the mall by Target, has designated specific areas for various games. Good call! Off we sat in a relatively small, quiet corner to watch his favorite team, Detroit Lions, beat the Bucaneers.\n\nNow the important part - the wings! It comes regular or boneless and with a variety of sauces to choose from, ranging from mild to blazing. Basically, something for everyone. We shared the spicy garlic (very saucy), mango habanero and caribbean jerk. All were good and did its job of making my hands dirty. Me likey! They came with the choice of celery, carrots, blue cheese and ranch. \n\nOnions rings were ok, nothing worth raving about.\n\nService was a little slow but the waitress was happy and humorous. \n\nBathroom is clean and big.\n\nOverall, a good place to watch the game. Very convenient location as it's right above the Atlantic-Pacific St station.", "author": "Julia B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-30", "description": "Let's be serious here: you're not going for the great ambiance or fantastic service. You're going for the wings and the beer. Why else would you bother going to a restaurant in a mall? \n\nI've been here more times than I'd like to admit. Service is either hit or miss. However, the waiters are always running around to other tables and genuinely are quite busy, so I don't mind when it takes them a little longer to get me more wet naps. The selection of sauces is pretty incredible and I have yet to see anywhere else to offer as many. Prices are not bad either. 50 cent Tuesdays are a pretty big deal and the place gets crowded and crazy! (No seriously. About a month ago a fight broke out between a group of women waiting and the hostess because they felt like they were waiting too long for a table. One thing led to another and a flying piece of bread almost hit my friend in the face if she hadn't ducked in time. Avoid Tuesdays.) I recommend going any other weekday night; there are always some other offer going on. \n\nThere are too many TVs and too many games going on for me to focus on any of them, but like I said, I only come for the wings. They come out nice and hot and amazing! The blazing sauce is really flippin' hot. I normally stick to the medium heat sauces (Asian zing is my favorite). You won't be disappointed. Random flying objects won't make me stop coming! The wings are that good.", "author": "Liliana A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-10-08", "description": "Finally got here with some co-workers over the weekend and I would go back! It was very busy because there was a Jay-Z concert starting in about an hour so I'd like to go back on a night when there's nothing at the Barclay's Center.\n\nThe wings were great, the beer (I had Newcastle) was served properly (cold and in a nice glass) and the servers were friendly. There are tv's everywhere so if you want to go somewhere to watch a game I would put this on the list of possibilities!", "author": "Christina W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-10", "description": "A good place to grab a bite a to eat and a few drinks and watch a game, service is always fast and friendly they have a very good staff working, maybe not a place for a romantic date place can be kinda loud, would recommend if your a sports fan and your teams playing almost as good as going to the game with the big TVs!", "author": "Erik S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-07", "description": "I come to Wild Wings often because it's close to my school, and the wings are pretty good. Only problem is, B.W.W. has recently started cracking down on teens coming in; they just don't want us coming in, and I hear from a lot of people that the \"bouncer\" wouldn't let them in, and it wasn't even at night.\n\nMoving on to the food,...\n\nThe wings are pretty good, but ONLY when the place isn't packed. Come in during off hours, and the wings are cooked to perfection, and they're covered in sauce. i've come in on Tuesdays (When wings are only 50 cents!),  and they were dry, and the sauce was barely even on them. \n\nMy favorite sauces: Honey BBQ, Caribbean Jerk, Mango Habanero, Parm Garlic, and Med. Hot. And if you got the cajones for it, go for the Blazin'. There isn't a taste at all. Other than the taste of your tongue burning. you'll be sweating, shaking, and crying for sweet salvation.\n\n\nGet the Fried Pickles. Just do it.\n\nAnd also, the burgers are okay. The Black\u0026 Bleu (Cajun spiced burger with blue cheese (dressing)) was okay. A little dry, but pretty good.", "author": "Angel H."}], "servesCuisine": "American (Traditional)", "priceRange": "$11-30", "name": "Buffalo Wild Wings", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "139 Flatbush Ave", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/ENoWKg2ScYUtSOPF-xpcJA/ls.jpg", "@type": "Restaurant", "telephone": "+17189439453"}