{"aggregateRating": {"reviewCount": 573, "@type": "AggregateRating", "ratingValue": 2.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-12-22", "description": "Back in Detroit, BW3 was a favorite of mine. In college, the same rang true.\n\nThis BW3 is nothing like the ones back home. The service is really slow, the wait for a table is horrendous, and the food takes forever. \n\nI don't care about any of this. At least I can get that BW3 boneless crave back into my system. I approach this place totally prepared for its service failures, for a long wait, and generally to be disappointed up until the point at which I taste the hot wings. I charge my phone up and get ready to play some long sessions of \"Bejewled Blitz\" or I make sure there's a worthwhile NBA game to watch during the really long wait. \n\nI read above that eating at the bar is an option, I will try that next time to cut down on the wait time. I love BW3 wings, even if the service is beyond shameless!!! 5 stars!!!", "author": "Oliver H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-08-09", "description": "This place is ok when i first went a few weeks after the opening it was crowded and we had to wait about 30 minutes to be seated. after we were seated it took the waiter about another 30 minutes to take our order. The wings were great but the other food was mediocre, mc donalds downstairs had better fries and mozzarella sticks. When i went again with 3 other friends, they told us we couldnt enter unless we were 21 and over, which i have never heard before and it was early in the morning, needless to say we went home hungry. Overall the place is in a nice spot and has good wings.", "author": "Chrissa N."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2009-12-17", "description": "I frequent this BWW fairly often usually for a boneless wing pick up on Wednesday or Thursday or to watch NFL games on Sunday. If you go there to eat and get seated at a table it takes a lot longer than if you just sit at the bar. The price is reasonable and the food is alright. Sometimes the orders get screwed up so make sure to check the bill and your food if you pickup to go orders and for eating in sit at the bar for the best service.", "author": "Christopher D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-12-23", "description": "Worst Service ever created. A Suburban bar with good wings and decent beer prices.", "author": "scott s."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-09", "description": "This place is good for any sporting event but especially great for some football!!  TVs galore, great staff (Norris is my guy), huge selection of beers, and did I mention the wings!  There are flavors of wings for any body's taste and the french fries are especially delicious.  My favorite happens to be the Caribbean Jerk, Jammin' Jalapeno, and if you dare, the Mango Habanero.  The only downside is the over crowding and the long waits for seating, however if you get there early enough that shouldn't be an issue.  Other than that, let the good times roll!", "author": "Christian G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-12-08", "description": "Good service,but the major problem was the esculator not working you had to walk up and down the out of service esc. Seating area is on top floor.", "author": "Reggie F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-03-19", "description": "this place is ridiculous on all accounts.\nthat being said, i like it!\n\nwhere else are you going to get 25 cent boneless wings with like 25 different options of sauces? \nthe service is god awful, you have to BEG someone to take your order and then close out your bill at the end. the urge to dine \u0026 dash has never been stronger for me... it should not be that difficult to pay! \nthe good news is that, once you do find a server, they'll bring you unlimited sides of celery. also, their happy hour deals are totally worth it, especially if there's a good game on (like i would know).", "author": "eliza b."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-05-08", "description": "Came here with a group of friends on a promotion night. 40 cent wings? They had a good range of options- considering my group of friends varied in hot/spicy preferences. Wasn't expecting much. Seemed like a good place to watch a sports game. Don't know if its worth like an hour wait though.", "author": "Lily N."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2007-10-08", "description": "well.....5 stars if you're just going to watch a couple games and down some beers, but if you've got any ambition at all for consistently edible food and/or mixed drinks, ehhh....well, just drop the ambition.\n\n2 extra large tv's above the bar, plus tons of flat screen scattered around.  they pretty much play every network-broadcasted game, but not sure if they have an nhl package.  lots of good company if you're a sports nut!\nthere's also trivia if you've dragged any non-sports fan friends, and there's a good selection of beers of tap that come in extra tall glasses. \n\nhmmm....the food.  well, the wings are never served hot, and the sauce slides off the fatty-not-quite-fried-enough average sized chicken parts. DO NOT get the boneless wings!  inedible at first sight. the nachos were a winner, until this one time the cheese sauce was clearly watered down, verified by the waitress.  uh, whut??  all in all, eat at your own risk!\n\ni've had pretty good luck with the service.  yes, you may have to offer a friendy reminder or two for everything, but the reaction is usually apologetic and quick to rectify the situation.", "author": "Ting S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-02", "description": "I usually don't frequent chains but when a trip to Chuck E. Cheese got squashed due to the immense line, we had to feed our kids who were by this time irritable and starving. The service was great even though the place was packed to capacity and our waiter very accommodating even though we were there over 5 hours!!! We were a party of 5 adults and 3 kids. The mango habanero wings were something special, very hot with a  hint of sweetness. The kids got meals from the kids menu which were surprisingly well portioned. My daughter had the slider which was chargrilled and very tasty. The adults had beer and drinks which were all great. We ordered a dessert for our friend who was celebrating a birthday - chocolate cake with ice cream and it was heavenly. They even  put a candle in it for us. Definitely wasn't reminiscent of chain food - this stuff tasted good and was served quickly and efficiently. They are definitely doing right by their customers in this place. We got a few bottles of mango habenero sauce to take home to make our own wings.", "author": "Stacy S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-01-07", "description": "I guess there's no Wing Stop in New York YET so this is where I go to get my wing fix.  Overall not bad and it's near the house.  I like that they offer Jerk Wings but other than that, I patiently wait for the Wing Stop revolution to sweep NYC.", "author": "RJ S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2008-07-15", "description": "Is this place still in business? I took one of my friends here ago because it was their birthday, they loved wings and this was the place they picked.  Our experience was scary from the moment we walked in.  There was no server to seat us, and we went and seated ourselves.  After about ten minutes of still no menus I was a little disturbed but didn't say anything because my friend did pick this place.  They did eventually serve us and we did eventually eat wings.  I can't say the wings were horrible but they were no better than typical bar wings.  And the bar wings are usually a lot cheaper.  I wouldn't waste a trip down here.", "author": "diana m."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-01-20", "description": "I wish this BW3 could live up the other locations i have so lovingly visited. The service and food was much better when it first opened it has kind of been a slippery slope down hill since then. If you need a place to watch the game in the neighborhood with a lot of large tvs though this place is sufficient.", "author": "Jody K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2009-04-20", "description": "Oh man, this place is out of control.  The floor looked like a hamster's cage.  I had to pee really bad when I first got there and was dismayed to find a dude pulling down his pants in the women's bathroom.  I turned right back around and sat at our sticky table with my full bladder.  I tried to forget it all and focus on eating and getting the hell out of there.  But they were out of pretty much all food.  On a third try I ordered a chicken sandwich with spicy wing sauce.  The chicken was the size of a silver dollar.  The ridiculous amount of salt (not spice) in the sauce burnt my tongue.  I couldn't taste anything after eating that thing.  To fill up I ended up pathetically dunking the kaiser roll in a up of ranch (or blue cheese, not sure) because I was still hungry.  I've been to B Dubbs  in the south and I swear they have their act somewhat together outside of brooklyn.", "author": "Leah T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-12-21", "description": "I love coming here on Tuesdays with a few friends. The wings are delicious and they're cheap cheap cheap! 35cents on Tuesdays for traditional and 45cents on Thursday for boneless I believe.  I love how they have so many flavors for wings ranging from sweet to spicy. The wings are finger ling ling good! The Pina Coladas here aren't bad either, but I don't recommend the Strawberry Daiquiri. Other than that, the waiters are alright, I prefer the guy waiters over the girls. Also the wait for the food is kind of long but I guess cooking wings take a while. The enchiladas here are pretty good too. Don't get the boneless wings though, traditional tastes much better. The meat in the boneless tastes bleh. I'd recommend coming here on an afternoon when they have wing specials because other days, it is pretty expensive for a dozen wings or half a dozen.", "author": "Virginia Y."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2008-06-15", "description": "3 stars for what it is.  It's a sports bar, which I despise.  But they had these in my college town and so when I heard they opened one in Bklyn - I had to go for the memories and wings.  If I was forced to go watch a sports game, I would prefer to do it here.  I love the boneless buffalo wings.  They are big and the sauces are good.  They also have a ton of beers on tap.  Happy hour specials \u0026 50cent wings on Thursdays.  I probably won't trek back here just to go but if I happen to be in Atlantic Center I would drop by for the wings.", "author": "Katie C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2008-03-20", "description": "absolutely horrible place. how did they manage to screw up so bad?\n\nthe cooks inside are really strange. they make some wings with ALOT of sauce, so much that they are unbelievable salty, and sometimes with no sauce, still salty but with no taste. the boneless wings are hard and feel and taste old. this is not the worst part as the worst part is the service. \nwe waited 10-15 minutes to be seated when there were MANY seats in the restaurant. the waiters all text on their phones in the back while the food gets cold. the food literally got to us COLD. ive been here many times, maybe they would get a new waiter that didn't screw us over? nope, ALL the waiters, every last one of them, are slackers. there was also a waiter that justified her actions of ignoring us for 20 minutes because \"kids like you don't tip a lot so we don't like serving you guys\" absolutely disgusting mentality.\n\ndon't come here, you'll regret it.\nDON'T, and i repeat DON'T EVER try the boneless wings, they are probably the worst chicken dish I've ever had in my life.", "author": "gary m."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-04-27", "description": "i wasn't expecting much of this place, maybe that's why I'm not as disappointed as a lot of people.\n\nthe husband and I walked by this place awhile ago and thought of it yesterday after watching the sun set in prospect park. it was 9:30ish so the rest of the mall was closed and the restaurant was pretty empty. we were seated quickly (the server wanted to seat us at the bar, we said we'd prefer a table, about 3 minutes later another server came over and said they were closing the section and moved us to an *enormous* 8-person table which was kind of funny)...\n\nthe server was kind of an ass. he didn't do anything in particular, but it was obvious he was just trying to say as little to us as quickly as possible and get his tip. this is kind of what i'm used to but it's no fun at a wing place when you can't even find the guy to bring you another drink\n\nso yeah, overall, it's a chain in a mall with asshole unorganized servers and way-too-loud big screen TV's. but you know what? the food was kind of delicious-- it came out hot and we both enjoyed our meals, which is something that doesn't happen that often anymore (he got a buffalo chicken sandwich with fries, i got boneless wings). it may have tasted like our insides were burning, but it was just what we wanted, and it was a really pleasant surprise. based on the food alone, this place would have 4 stars, but the ambiance, waitstaff, location, and pretty much everything else dragged it down.\n\ni'd probably go back.", "author": "Vanessa V."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2009-06-12", "description": "This place is really sucky. I love wings, and thier wings aren't horrible, but there are so many better wing options, and thier other food isn't very good,  they don't have much of a selection to choose from. The place is loud and annoying. The service is super slow.", "author": "Amanda H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-07-29", "description": "BROOKLYN BEWARE!!  Meeting a friend at the bar while shopping the mall. It was really crowded and if you're stuck standing it's a pain because you're in the servers' pathway.  I put my coat and bag on the back of a chair and figured if the person had a problem with that when they returned I would just remove them.  Next thing I know two drunk 20-something chicks start going all ghetto on me (I'm a 50-something female).  I tried to explain that I only put it there while I was ordering and while I was trying to remove myself from the situation the manager came and kicked them out. I was standing to the side and two people at a table said they couldn't believe what happened and they specifically pointed out that I didn't do anything wrong.  The manager then approached me and I thought he was going to apologize for his customers' behavior but no, he wanted me to leave as well.  When I explained what happened and even the two people stood up for me his response was \"I don't care.\"  Unbelievable. My son is NYPD and was upset that I was even in that place.  He told me that police are constantly dispatched there to break up fights and said it sometimes includes guns and knives!  So not only is the food marginal but the atmosphere is officially DANGEROUS!", "author": "Deb H."}], "servesCuisine": "American (Traditional)", "priceRange": "$11-30", "name": "Buffalo Wild Wings", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "139 Flatbush Ave", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/ENoWKg2ScYUtSOPF-xpcJA/ls.jpg", "@type": "Restaurant", "telephone": "+17189439453"}