{"aggregateRating": {"reviewCount": 573, "@type": "AggregateRating", "ratingValue": 2.5}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-04-05", "description": "This is the fithiest place ive ever walked into. Dirty floor seated at a dirty table with dirty chairs we walked out....seemed like staff were too busy Bs'ing than working ....what a dump", "author": "Rich B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-10-13", "description": "The Onion Rings are to die for! The best I've had thus far!! This is my third experience and so far there's nothing negative I can say. The wings are amazing \u0026 the variety of sauces makes it even better. I would definitely recommend this spot to others!!", "author": "Shevonne D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-28", "description": "Sooo. Parmesan garlic chicken. Amaaaaazing...... salt and vinegar fries. Yummmm.... however, wouldn't say I felt that way every time. On occasion the fries aren't hot enough or the wing sauce isn't really tossed on the wings enough. But cheap and good when it is.", "author": "Valéry P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-09-13", "description": "I like to sit at the bar.  It seems on fight nights you have to get around 2pm to get a seat at the bar.  The wings are nothing special.  You get ranch or bleu cheese...I pick bleu cheese, I dont think I have ever actually seen a piece of bleu cheese in my dressing.  It is a novelty place to visit.", "author": "Patrick O."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-10-30", "description": "Christopher is a terrible waiter turned a would have been normal experience into a terrible one. Got our order wrong twice took 40 min to being out the second wrong order. .. rushed us to order. No utensils or napkins.. shitty experience. The manager ozzie was the only reason I'm still here.  He did his best to rectify the situation.  Atlantic ave station.", "author": "Natasha L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-11-15", "description": "Between the hostess that skipped us when she had empty tables, the frozen carrot and celery sticks, the fact that we had to ask for utensils, missing food items, and napkins, their watered down beer (and I know when beer is watered down buddy) and simply ordinary wings, I simply cannot recommend anyone at all go to Buffalo Wild Wings in Brooklyn. Just hop on a train and go to Croxley's instead.", "author": "Richard C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-05", "description": "Excellent service. The boneless wings are pretty good, and there is a whole variety of different sauces, well discriminated by how spicy they are. The sandwiches are kinda small, so you may want to head to Applebees, right next to it, in order to exterminate your warrior hunger. Can get pretty noisy with those 500000000000000000 TVs they have. When important games are happening, the place can get REALLY crowded. They also do not allow minors after 21PM, or during Pay-Per-View exhibitions (such as UFC).", "author": "Rafael M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-01-17", "description": "Go there at least once a month. Good service and the food is tasty. Recommend the Long Island Iced Tea with the combo of Blazin Wings and garlic Parmesan to cool you off. Lots of sports and tv to watch.", "author": "Neil B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-03-17", "description": "Horrible service, waited for 20 min and didn't even get an estimate of the waiting time, ended up going to Applebee's next door", "author": "Bharat J."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-02-09", "description": "This place was PACKED and the drinks were EXPENSIVE. We came here before a concert at the Barclay Center and I wouldn't do it again. There has got to be better places to get a drink before heading over to the Barclay Center. If you are considering coming here - keep searching my friend.", "author": "Jon H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-11-21", "description": "Place should be know for wings and beer, wings and beer are mediocre, \n\nService is however not great at all. long wait, missing food item, long waits before waiter comes around before you can order another beer.", "author": "David C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-02-07", "description": "I have visited this Buffalo Wild Wings a couple of times, one time being very recent (4 days ago). The food is good here, but the first time I went it was on 50 cent wing night , and my wings tasted like they had been sitting out all day and reheated in a microwave. That day I was very disappointed but my most recent visit was on a regular night and my wings were delicious ! I also had the nacho appetizer which was great also. The bad thing about this location is that the customer service SUCKS. Every time. Im not a hard-ass when it comes to service, I just want my service to be exceptional \u0026 standard .. So it upsets me that I have to say that the staff here are rude and inattentive. On my recent visit to BWW we waited for our server for 30 min. The hosts and busboys were standing around laughing and joking with each other and watched us just sit there waiting , and didn't even have the decency to tell our server that they had a table. We had to ask the host himself to find our server after 30 min. Once our server finally came he seemed angry, didn't introduce himself, did NOT apologize; he just simply said \"What do you want to order?\" We told him what we wanted and he just walked away. He delivered our drinks and we never saw him after that, etc. Keep in mind that there were barely any customers that day. It was definitely not a full house .. Not even halfway full. Get it together Buffalo Wild Wings (Brooklyn).", "author": "Cia F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-15", "description": "Let me just start by saying that I am a big fan of boneless buffalo chicken and this place can make them really good. I was here with a relative of mine and we enjoyed ourselves. We mainly went there to watch a UFC event and that's what I like about this place, THE SPORTS!!!! Another thing about this place is that although the waiter was nice but the service a bit on the slow side. After we ordered our food I would say that everything took about 40-45 minutes to be brought to our table. But although the service was slow, the food on the other hand was grea", "author": "Zinad K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-08-06", "description": "Food was average at best. And we noticed dishes start to pile up next to us on other empty tables.", "author": "Richard C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-08-28", "description": "Far and away the WORST BWW I have ever been to. Lets start this out right. I am a fan of BWW. I enjoy their food atmosphere and games. None of that pertains to this particular establishment. The food is often improperly cooked and the wings unevenly sauced. The service is slow and inattentive and there always seems to be a  wait for a table; even when the place is half empty.  They even lack the buzztime gaming that is a staple at BWW. Avoid if possible, but if you do go, please don't judge the franchise based on this particular establishment; you'd be missing a jewel.", "author": "Anthony M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-03-03", "description": "Service honestly probably couldn't have been worse. My husband and I went in for lunch during the week. Not that many people were in there and still we waited forvever to give our order or any kind of service. I would hate to see how they are when they are packed. Aside from another set of customers deciding to be our entertainment when they started throwing food and drinks at the waitress like they were toddlers the staff was for the most part nice just slow and non-existent.", "author": "Reina G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-07-05", "description": "slow service but decent wings. they blast on the AC so it's insanely cold inside. bring a jacket", "author": "Susan C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-02-09", "description": "They suck at seating you. Minus 1 star. They are unapologetic and even borderline rude when it comes to seating. The end. If you can get a seat, and there are food specials, then it's your lucky day.... \n\nBdubs is bdubs, the food is no better or worse than any other bdubs...probably 3.5 stars...but what i love about this place is that SOMEHOW they always manage to pour me the BEST BLUEMOON on tap ever. I don't know what it is, or how they do it, but somehow it is so refreshing and tastes perfect. Props to the bartender!", "author": "Juliet C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-04-23", "description": "I frequent the Target at Atlantic Mall way more than I would like to admit and yet I have never even popped my head into Buffalo Wild Wings. This is particularly odd since I am a self-proclaimed wing connoisseur.\n\nI came here with a friend on Friday afternoon for a quick wing-a-ling snack.  I was actually surprised at how big it is inside.  The service was friendly and efficient.  Prices are reasonable.  We had the medium sauce and honey bbq.  It was good, like chain restaurant good. The blue cheese was a bit watered down.\n\nI will probably come back here since it's on the way home, cheap, and seems like a good place to kick back, have a beer, wing, and a relaxing time.", "author": "Donna A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-07-28", "description": "My friend and go every two months for a Tuesday night outting to Brooklyn for Target and Buffalo Wild Wings.  It's always a great night.\n\nWe choose Buffalo Wild Wings for 4 reasons:  1.) 50 cent wings 2.) $3 bud lights 3.) proximity to Target and 4.) Byron\n\nThe wing experience has almost always been great.  Although, I don't recommend the hot sauce.  I couldn't eat more than 3 wings!    The mild, medium and Asian zing are my favorites.  Once I got the puniest set of wings I'd ever seen...but for the most part, they are really good!\n\n$3 bud lights go great with the wings.  And pre-game before Target is always pleasurable.  I came home with a hula hoop on my last trip!\n\nByron is great.  We look forward to having him as our waiter.  He brings our beers quickly, is attentive, nice, and always has good recommendations!  But to get him, you need to sit in the bar area.  You can sit immediately in the bar area.  Seems hundreds of people prefer to wait for hours to NOT sit in the bar area.  Never quite understood this phenomenon....\n\nOther things to note:  Mini corn dogs were great one time, not so great another.  The nachos look great, but I haven't had them yet.  The onion rings and all of the potato varieties are good.  i wouldn't stray too far from the wings.\n\nThey have trivia and poker at the bar.  Lots of TV's with all of the sporting events available.", "author": "Katie M."}], "servesCuisine": "American (Traditional)", "priceRange": "$11-30", "name": "Buffalo Wild Wings", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "139 Flatbush Ave", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/ENoWKg2ScYUtSOPF-xpcJA/ls.jpg", "@type": "Restaurant", "telephone": "+17189439453"}