{"aggregateRating": {"reviewCount": 573, "@type": "AggregateRating", "ratingValue": 2.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-09", "description": "Great place to watch ufc fights. Ufc ppv and Thursdays. I'm always there. I like when they have their sauce of the month. Bring back Fiery Apple and Midnight Mole", "author": "Rudy C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-05-14", "description": "The server for our party was an idiot!\nI ordered a black bean burger and he served me a beef burger instead. I'M A VEGETARIAN...\n\nOverall disgusting service. Not coming here again", "author": "Sainath D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-30", "description": "We ordered beers and wings. The service was a little slow as they don't seem to have enough servers on hand. Our waitress did try her hardest to attend to us in a timely manner so I do not fault her. The beer was cold and tasted good. The wings took a little bit of time to come out but came out hot and delicious. The server got us exactly what we asked for with no mistakes. If you have some time to wait this wing place isn't bad.", "author": "Lee M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-09-21", "description": "Ughhhh where do I begin... I have to say this is one of my least favorite locations. The service is not great everyone is too busy having personal conversations and when you ask for assistance they respond as though you are bothering them. This location is also not very clean or lit well at all even for a bar. I have been to other nearby locations such as gateway mall that were quite pleasant and welcoming. The food was not good either I definitely do not think I will be returning to this location ever again ..", "author": "Summer A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-10-30", "description": "Got here early at 5pm pre islanders game at the Barclays. Dining was packed but bar was not busy yet.\n\nPro-Wings I Ordered were tasty\n\nCon\n-took 10 min to flag someone down order drink as and wings at the par for 2. (Establishment built on wings and drinks )\n-got transferred to another server ordered out 20 wings 4 sauces, and a side of onion rings, 45min later had to flag down the server and ask when out order will be out.\n-she was shocked it didn't come out. 10 more min go by... We speak to another server shocked and focused on helping us out. Original server comes out saying they were ready but never made it out.( unbelievable and ridiculous answer, and no we don't want to order more)\n-guess what half wings were warm and half hot, missing our onion rings.\n-now we have to flag this girl for the check, another 10 min goes by and she's taking more orders( what's the priority??)\n\nWe have to walk up to the supervisor bc the girl taking to long ... Only our onion rings came off the bill we should have just walked out. No one would have cared or noticed.\n\nNever again coming back!!", "author": "Joe C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-11-20", "description": "WINGS!! Nothing less than your typical wing spot. It can get a little crowded/rowdy at times, especially on the nights that they have their wing specials. But I still come back primarily for the variety of sauces and seasonings that you can get for your wings and of course catching up with friends over a cold beer (but I don't drink beer -_-). Anywho, besides wings, French fries and potato wedges, I haven't ordered any other food items from the menu and I don't think I plan to.", "author": "Y. D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-11-29", "description": "Whenever I come here, I find that the service varies between 2 stars and 4 stars, so rating it as a 3 star seems appropriate. \n\nI love the traditional medium wings and get this pretty much every time I come. The food quality varies but not drastically. The wings are sometimes dry so I usually ask for extra saucy. \n\nSome of the staff are friendly, while others are not.\n\nThe seating does not usually take long except for Tuesday or Thursday nights which is understandable because they have their 60 cent wing specials those nights. \n\nThe drinks here are decent. I recommend the Wild Berry Margarita if you're into sweet drinks with a punch of taste.\n\nI do enjoy this place and find myself coming back once or twice every couple months.", "author": "Tashana B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-06-21", "description": "Sad.... Either they need to hire new cooks or they need new managament. The wings are just not good at all.... I've had better wings at small pubs, even I make better wings. I ordered about $80 worth of wings, what a dissapointment. First my order wasn't correct, 2nd the wings were so dry and so unflavored like who does that!? I didnt wanted to go back to complaint because I had 5 hungry kids at home and adults. By the way they all complaint about the wings too.", "author": "Nyc B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-10-15", "description": "Every time I come to this place the wings are always dry and there is never enough sauce on my wings. \nOur server on the other hand was very kind and patient with us. (Daniel)\nThe onion rings from here are the best that I've ever had, and the mango lemonade is shitty.", "author": "Lola C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-01-15", "description": "Good food but the slowest service in the world. Yes, in the \"world.\" Even one beer comes in half an hour.", "author": "Oti M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-11-04", "description": "GROSS RUN. We walked in on a Thursday night place was empty was seated 20-25 mins later nobody came to us (mind you it was basically empty). Finally after I got up and complained this waitress named came she was ok (never around much though). \n\nDrinks now the bartender name was Nick (he is built like a linebacker) i watched this man digging in his nose making peoples drinks. The entire night he was blowing his nose in his hand and making drinks (i can't make this stuff up). I spotted this right after I took a sip and realized i was given sprite basically (he makes a poor drink). We spoke to the manger and i told him what the issue was i was sold sprite and I told him about his bartender (who at the time i didn't know his name). I ordered something else and told him that i didn't want Nick making our drinks because he is nasty. Long story short wine wings serves was spotty food was ok. NEVER AGAIN\n\nFor kicks there was this guy dressed as flavor fav (no it was not halloween) with a huge clock on his neck just standing there dancing.", "author": "Justina A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-09", "description": "These five stars are specifically for our server Mecca. She was fantastic. As someone who works in the industry I was quite please to see such great service at a chain on a busy football Sunday. Well done.", "author": "Nicole S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-01", "description": "Love the Garlic Parmesan wings and the Wing Deal on Tuesday's and Thursday's. Call before picking up for To Go.", "author": "Adjoa N."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-04-14", "description": "Terrible service!! I came here with a group of 7 but our table was given to a group of 9 first. When they finally called us, they told us that there wasn't any big tables but two smaller tables next to each other. \nThe wings taste alright but once it get cold, it don't taste good. The garlic flavor wings are too strong, so I don't recommend it. It's worth a try if you love wings. There's happy hour on Tuesday for wings.", "author": "Susan L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-25", "description": "Food here is always good and the staff are great. The times that I've been here, the waiting staff were always very friendly and just seemed happy to be serving you.Prices are reasonable and wings are half off Tuesday and Wednesday.Gets pretty packed when the Brooklyn Nets are in town.As long as you get there early, you'll be fine.", "author": "Don R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-26", "description": "Wings of course are great. Gets a little crowed sometimes but still a smooth environment. Wouldn't get any alcoholic drinks from there again. (Weak) for the price. Typical American pig out spot", "author": "Jonathan E."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-03-01", "description": "I usually come here when I'm at the mall and I need to get a quick bite to eat.  Their drinks are super weak and their wings are so-so.  The last time I went I had to ask for extra buffalo hot sauce on the side because they barely put any on the wings.  Plus side is there's always a game on.  I come sometimes when the Knicks are playing just for the vibes in the place.  There's always a sports fanatic in here and that came make watching the game super fun.", "author": "Cassie V."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-12-23", "description": "The service here could use life support.\n\nS L O W!!!!\n\nService is good when you finally get someone. \n\nThe food is great and thanks to our waiter Brandon (I think that's his name) from the tall bar section (young man with glasses \u0026 twain accent) made our visit there great.\n\nOtherwise, I don't think I would return.", "author": "Yaya L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-09-27", "description": "Look I love this place its in the mall I shop eat etc food is on point this time around I decided to do a online order and pick up so I waited 5 mins got my food while waiting on a few friends I decided to eat a few wings the lady tells me that's food to go you have to eat it outside I wasn't rude packed my shit up and left when my friends came they wanted to eat here I said hell no go to Applebee's won't be coming here anytime soon", "author": "Lamont Y."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-08-08", "description": "Not sure why there is a line outside when there are tons of open tables in the bar section. It's high top chairs,  but I rather sit  there than wait 20 min for a regular table.\nThe wings are good,  like the variety of sauces. However the service needs work.", "author": "Nik R."}], "servesCuisine": "American (Traditional)", "priceRange": "$11-30", "name": "Buffalo Wild Wings", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "139 Flatbush Ave", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/ENoWKg2ScYUtSOPF-xpcJA/ls.jpg", "@type": "Restaurant", "telephone": "+17189439453"}