{"aggregateRating": {"reviewCount": 573, "@type": "AggregateRating", "ratingValue": 2.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-29", "description": "It pains me that this BWW has 2.5 stars because I love it so much. Not sure if most people get takeout / order delivery, but my review is for dine-in. During the period of March Madness going into NBA playoffs, my husband and I probably came here every week. \n\n5 stars because 1) they have TVs and are happy to change the channel of the TV in your line of sight to be the sporting event you want to watch 2) the servers have an amazing attitude -- we always have different servers and they're all great 3) it's easy to grab seats at the high top bar tables and we generally don't need to wait 4) food is good, beers are not expensive -- I mean this ain't no gourmet food establishment but I'd say it always meets my expectations 5) there are other BWW lovers there and it's fun to watch sports with them. \n\nAnd PS: if you want dessert after to celebrate your team's victory, Cold Stone is downstairs and really complements a stomach full of BWW.", "author": "Susan C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-05-05", "description": "I ordered takeout wings. I waited ... and waited ... according to Yelp's app (and its customer service reps) my wings were still being made. I took a chance and headed to the restaurant. Bam. Wings had been ready for 15 minutes and were waiting for me.\n\nThe order didn't include the expected carrots and celery (not sure whose fault that was).\n\nWings are decent, but nothing special.", "author": "Paul S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-04-02", "description": "Wow I went at 9pm to go get me my wings, fries and was told I can't place any orders/ no walk ins. Just wow... traveled from work just to be told I can't place an order. Going back to wingstop for good. I wish I could give a zero star for the cashiers being so rude!\n\nPS since when a known business like BWW denies a customer from ordering food? I guess that's the 2019 BWW. (I would of gladly paid full price for my wings smh!)", "author": "Gabriel H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-02-23", "description": "THE WORST SERVICE EVER. I came at around 1-2 PM and we had to wait for at least 10 minutes to get seated because it was very packed. After being seated, we waited for an eternity before someone came to serve us. Then, we ordered and yet another perpetually long wait before the food came. Let me just say that I don't mind waiting as long as you keep me posted, but the wait staff here did none of that nor did they care to give my table any attention. Instead, they only catered to the needs of those who were very into the games, which I have nothing against, but please show equal treatment and at least acknowledge that we are customers in your restaurant. \n\nWhen the food came, it was disappointing. The chicken was too dry, too hot, and the portion was very small. The fries were salty and oily. Everything about Buffalo Wild Wings was just a terrible experience that I never want to relive and I do not recommend that anyone else put themselves through this kind of service. \n\nThe best way to round out our visit was to wait for at least 30 minutes for our bill. While I understand that there were many customers, the waitstaff should at least have the courtesy to do more than put the food down and walk away. For the price and time, you are much better off going someplace else.", "author": "Jessica L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-05-29", "description": "This is my worst experience with BWW. The wings were overcooked and salty. The order did not include celery and dressing (btw, I also paid for two extra dressings). The nachos did not have enough toppings to share with the chips--it was an ULTIMATE disappointment. The fries were not covered with cheese, as requested. I should have donated the cost ($61.27) of the food to charity, since the delivered food is in the trash. How do I request a refund from BWW or Grubhub?", "author": "Michael-Todd H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-05-21", "description": "It is impossible to have good service here. Understandable that it is Tues so half off wings, that being said have your best servers. One young lady was carrying out a tray and it ACCIDENTALLY got knocked in my hair. I touch my hair and there is ranch in my hair. IN MY HAIR! She says nothing so I tell my server Kayla and with is biggest attitude her response was It wasnt on purpose. I would love to think that she did not put RANCH IN MY HAIR ON PURPOSE. The server then comes back because I show her the ranch in my hand from my hair, she makes the most disgusting face and say \"okay it was an accident\" ... So now I ask another server to get the manager I explain the situation to Danny. His response so what do want to me to do about that? Do you want a free shot ? Okay I take the shot he then begins to brings the shot over and spill the shots on me and my friends bags. I am so over it. He comes over into a conversation I am having with my friend about Yelp reviews and now he wants to give me a free entree with his business card saying that he is so sorry now . As a business you should NEVER be willing to just give anything out for free . And if you know its busy at your location.. GET BETTER STAFF. Not to mention when the food came out it wasn't good AT ALL\nHonestly Applebee is right next door save your time and money and energy!", "author": "Shannon A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-12-18", "description": "I would give -3 stars if I could. Jesus Christ this is by far the worst experience I ever had in Buffalo Wild Wings. I love Buffalo Wild Wings and their food, I usually have a pleasant experience dining in. That being said, this store is so unorganized and rude. I ordered my food with Christopher and he said it will be 30 min wait. I asked him if I can wait in the car and call the store in 30 min to double check if my order was ready and he said sure no problem. 40 min go by, I call and the rude lady picks up and tells me my order isn't ready. I walk in back in the store 5 min later and ask again, still not ready. Ok fine I wait patiently. Then Christopher comes back out with bags of order and I was waiting for them to call the name out. No. Everyone is complaining and asking to read the orders that just came out. Another 15 minutes go by, the pick up area is crowded. I see the manager Javier and he asks me what my name is. I tell him my name he briskly checks the bag and he says no. So now I am waiting an hour and the lady finds my order which has been sitting there for freaking 45 minutes the whole entire time. My order is cold and I ordered a Pepsi which they also happen to miss. Oh and I ordered mini hot dog things but they gave me potato wedges .The manager can not do his job nor delegate and manage his employees and the staff are rude and had a terrible attitude the whole entire time. The bathroom is also unhygienic and it smells . God awful. \n\nWord of advice don't come here.", "author": "Grace K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-22", "description": "You can't really go wrong with B Dubs. At least not with the food usually, but the service can get kind of bad. The person serving us seemed like he didn't want to deal with all our orders. We ordered a lot of different wing combos because it was boneless Thursday, discounts on boneless wings! We came at 10-11pm so there was a bouncer checking IDs. \n\nWe were able to get 25 wings for $18 I believe. We ordered 50 wings. We also got angry orchard hard cider pitcher for $21. The flavors of the wings are always great. Asian zing, lemon pepper, honey bbq, Parmesan garlic are all great. I prefer the Buffalo Wild Wings from 47th Street more. Place is bigger there and more clean.", "author": "Alice X."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-03-15", "description": "With all of the waiters and waitresses working this afternoon, I was pretty annoyed that the service was slow. My waiter tried his best but he definitely was juggling multiple tables. And I came at 6pm so I was surprised at that ! The food is good but with the service, it makes you just want to do takeout", "author": "Brittney C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-04-29", "description": "I only went here knowing chains are generally predictable with service and with average  food quality. This place is horribly run and you could visibly see rows of food sitting in the kitchen waiting to go out. Unfortunately no one in this place takes pride in their work and the food just sits around. \n\nWe attempted to order a salad with grilled chicken among other standard items. We were told the chicken needed to thaw and would take about 2 hours to prepare. The waiter left and submitted the order for all but the chicken dish. He not only didn't return but, when we complained about the lack of attentiveness, we were told we \"should have waved\" so he knew to come back. We waited 30 minutes in total but didn't receive any food. The manager bought us a round of beers which was appreciated and the only reason I'm giving 2 stars.", "author": "Mike T."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-04-26", "description": "If I could give them NO STARS I would! Horrible customer service ! I was seated and not one server came up to my table for more than 10 mins their greeter was on her phone the whole time instead of seating me with her horrible wig. When I finally was seated and contacted the manager to ask about a server her response was \"I'll see what I can find\" what? How are you running this business? If headquarters know better they will do a clean house and hire people that would positively represent your business because this is ridiculous. With the Apple store just opening up around the corner you would think they would know better than to have such disgusting service.", "author": "Alexandria R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-06-27", "description": "I absolutely love Buffalo Wild Wings but the service I've gotten the previous night from today was game changing enough that I would give this place a three stars. I got a waitress last night that seemed like she was ABSOLUTELY done with her job and didn't want to be there. I've given her the benefit of the doubt considering there was a graduation and many graduates were walking in and having dinner. She got my order but gave me completely different saucing.\nGreat place but the waiters or waitresses you are great if you get them by chance.", "author": "Jia Wai Q."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-04-10", "description": "Service here is fast, not so much personable. It's a franchise. Pretty popular. A lot of seating but it was an ice box in there. Their drinks were bomb, (got the pineapple crush. )  and the Henny wings \u0026 mac n cheese had me smackin my lips. I almost forgot I was cold", "author": "Jenel H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-03-17", "description": "My husband and I have been frequent patrons of several BWW and we always sit at bar to watch games. Recently in the past few months, the bartender of this location who has been there on the weekend afternoons has been very rude. As soon as we sit down, he does not greet customers, he throws down menu to us and walks away.  We ask questions on what are the specials, he answers us with one word answers. The times that we have visited there are only about 5 patrons at bar, no excuse that he's busy. He's more engaging to friends that visit him instead of customers. In all honesty, this bad customer service has prevented us from going back to this location.", "author": "Alely S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-02-23", "description": "Very poor service from our waiter. After being seated, we waited 15 mins. Then inquired of who our waiter would be. Once we were told by a very friendly and customer service oriented waitress, she decided to put in our order for us. Our actually waiter finally come with our drinks and just sat them before us without an introduction. Once that was brought to his attention, \"Alonzo\" introduced himself. Needless to say, once we received our food, we were left unattended. He never came back to us to see if we needed refills. Yet we watched him attend other tables and were bringing them refills. I had to call him over to request a refill. My wife and I was completely dissatisfied with his behavior and the manner in which he provided service or the lack thereof. Our \"Date Night, was totally ruined. After a long week of work, we needed a little \"we\" time. \nTo end on a more sour note, we spoke with Alonzo once we paid the check, (discounted by the mgr) just to be an encouragement and to let him know that we acknowledge that the night was busy and he was serving  several tables, it's important to know that customer's experience should never be compromised. Don't let a customer feel abandoned. Unfortunately, he was not receptive at all. He further let us know  \"if you ever come back, ask to not to be seated in my area!\" Then Alonzo walked away. We were appalled and devastated at his remark. Never have we ever been treated in such a manner. \nI hope no one will ever have to experience such service.", "author": "John V."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-10-21", "description": "Toady I realized the death of family dining. The flailing economy, coupled with low wages, high housing prices, has made it impossible for a family of four--heck, even a couple--to dine out at the most modest of eating establishments. I went to BWW and left with a bill of $34.99 for the most mediocre meal ever. I guess I was paying the exorbitant Jay-Z/Barclays/gentrification/yuppie up tax or something but this is crazy. First, the menus were filthy. FILTHY!!! Every page of the drink menu was sticky with wing sauce. The table was sticky. I actually used one of my hand wipes to wipe down the table. The waiters do not clear the tables. My waiter was super inattentive. His name was Ethan. It took him forever to greet me, did not check to see if I liked my meal, took forever to give me my check, and even longer to pick up the check and card to process payment.  As I stated, the waiters do not clear tables. I was brought another soda without the old glass being removed. Please look at my pictures to see my messy table. And this is for one diner!! I ordered the signature Buffalo Zoo drink and it was nothing but a glass filled with ice and fruity punch. Two sips and the drink was done--$9.50!! The wing snack of 5 is $8.99. Let that sink in for a moment. Five wings cost $9.00. I think ten was $14.99. I mean, any Chinese spot will fry you up some wings, say a dozen, for $6.99 and you will probably get some fried rice with that. These prices were INSANE!! And the wings? I thought I was at a funeral because these suckers were fried to death. 2 of the 5 wings were cooked right. The other 3 just crumbled in my mouth. Brittle and tasteless. The Bayou Po boy was average.  The shrimp were of decent size but the bread was bland the sauce had zero character or zing and the presentation was nothing to be proud of. Shrimp Po Boys are done better with grilled shrimp in my opinion. To think if I took a date, I would have left with a bill of over $65.00 before tip. Sad you cannot even dine out any more. And I was solicited by a server to donate money while I was dining. Can you get any tackier.", "author": "Hillenbrand H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-11-04", "description": "Don't let the low rating scare you away!\n\nOn a Friday night my boyfriend and I had a craving for wings and beer. Growing up in the suburbs where options are sparse, Buffalo Wild Wings was our go to place for wings. Therefore we looked up a Buffalo wild wings for old time sake and was pretty hesitant to come here to say the least. Reviews were pretty bad! We decided to give this place a shot and so glad we did.\n\nOlivia was our waitress and she was great! Very attentive and brought our wings out in a timely manner. Wings, mini corn dogs, potato wedges were just as expected. Yes the pricing is a bit steep compared to Buffalo Wild Wings in the suburbs but this is New York City after all", "author": "Nancy N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-18", "description": "I hate having to do this because if the post is not long enough they you keep harassing me to make it longer or my post don't go up.\nJust for the record the food is great and the service is great\nThis review is shorter than most reviews is what was on the bottom of this post's", "author": "Cassandra R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-11-19", "description": "Just picked up my order . The fries were literally less than 25 pieces!!!!! 4.50 for the fries when I called Javier the manager said that's the size they serve and it is weighed apparently before it leaves the kitchen. So disappointed only coz I feel ripped off. He did offer a free small fries next time we go there , which will be the same amount! No point coz we're def not going back.", "author": "Maria J."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-02-07", "description": "There are too many reasons why I would not recommend anyone to this restaurant. From the start, there was already a long wait just to get in. There was no distinction between a line to be on the wait list or a line for people who were just hanging around in the area, so that made things confusing. Once we were seated, we were not given any water. We actually never received any water throughout the whole course of the meal, so it was a good thing that we ordered other drinks. Not sure if that's a normal thing, but I observed the restaurant and it looked like no one else had water either. The menu is also very dirty, it had food stains and fingerprints, which just made the whole experience even worse. \n\nNonetheless, I ordered the Medium Traditional Wings, half hot and half wild. I liked the flavor of the wings, but I could tell there were major differences between the wings that were in my batch. About one-third of the wings were tender and the other two-thirds were either reheated too often or sitting in the kitchen for too long. They're known for their wings, but that was already a disappointment from my experience. To my surprise, the Big Jack Daddy Burger that my partner ordered tasted a lot better. However, that was not my meal and so I still had to eat the dry wings I ordered. They were just underwhelming and I knew they could have been so much better because I've had good wings at this chain before. \n\nAll in all, we had a long wait, dealt with slow service, mediocre/below average food at a high price, and were just very dissatisfied with this location and what the restaurant had to offer. I won't be dining in ever again, but I would maybe consider ordering out during their half priced wings days.", "author": "Gina P."}], "servesCuisine": "American (Traditional)", "priceRange": "$11-30", "name": "Buffalo Wild Wings", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "139 Flatbush Ave", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/ENoWKg2ScYUtSOPF-xpcJA/ls.jpg", "@type": "Restaurant", "telephone": "+17189439453"}