{"aggregateRating": {"reviewCount": 573, "@type": "AggregateRating", "ratingValue": 2.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-30", "description": "Danielle was great! First time at this buffalo wild wings and will definitely be coming back and asking for her. Friendly, attentive service and the food was fantastic!", "author": "Emily K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2009-11-29", "description": "Per the reviews I've read, this might be the place to go if you are not in a rush.  \n\nIf you are doing lunch....plan on spending an hour and a half.  Also, plan on getting up several times to go and find the server to place an order, ask for water, ask for extra napkins and the check.  \n\nNot sure if the staff in this location is a representative of the chain but they really are terrible.", "author": "Tim S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2007-04-07", "description": "The idea of a specialty buffalo wings place is really appealing! And this place is actually a franchise... so I'm not sure what went wrong in the quality control here. \n\nFirst off, it shouldn't take 10 minutes to seat someone and its not busy. The staff appeared to be very confused and not sure what to do with themselves. Dunno why. Once we were seated, it took forever for someone to get TO us and ask us what we wanted. The guy serving us was apologetic and all, but it still doesn't take away the initial sting. \n\nOne of the cool things they had for the season was the Sam Adam's Cherry Ale. Tasty stuff! Actually, they had a huge bar with an extensive draft beer selection (almost 15 different kinds). \n\nNow for the wings. Here's how it works: they have a quantity selection for the wings and then you can select the sauce you want, ranging from sweet to Blazin hot. Of course, Orlando E. and I had to test the super hot one. It was hot yes, but not a nice kind of hot. Hot without real flavor, which is never good. Their Asian Zing sauce was very nice. Flavorful with a touch of heat. If you have it, I highly recommend it. The gripe is really the price. 12 wings for $8.29? While its not prohibitive, it's the size of the wings that's disappointing. They're tiny. I'm serious, REALLY small. And its not full wings either, but cut up pieces, so you really feel robbed somehow. \n\nBTW, don't bother with their tenders (chix tenders): overfried, overbattered and super dry. Their ribs however, were good.\n\nBottom line: they need to get their service together and get a different chicken supplier because those poor things looked like they were starved before being killed.", "author": "Christine J."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-07-27", "description": "surprisingly packed for a saturday early afternoon. came here with my son and a gf. had the ultimate nachos which were not too greasy, but bland. my 4 year old liked it. well, just the parts with cheese. i've had better pulled pork slammers and better chicken wings. i like my wings crispy. sauce were ok. they can get pretty spicy but that doesn't make them better. service was also kind of slow. for that price, i'd rather go elsewhere. sorry, bww!", "author": "Ms G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-03-21", "description": "Awful staff, always crowded, slow service. Rude.", "author": "Nicole C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-03-09", "description": "I always love Buffalo Wild Wings, and this is my go to place whenever I attend an event at the Barclay Center.  The wings are absolutely awesome and it is a great place to watch a game on TV.  However, my last experience here was not so pleasant.  There was a long line and the hostess took my boyfriend's name and wrote it at the bottom of a piece of paper.  We waited...and waited...and waited.  We waited so long that we were making friends with other couples, that's when we realized that people coming in after us were getting seated before us.  I went to the hostess and she barely looked at the waiting list (on a completely different piece of paper) and said that there were 4 couples before us.  I sat down and waited... and waited...and after SEVEN couples were seated before us, we went back to the hostess.  At this point, the hostess said that they don't have my boyfriend name....then she look at other papers and went on to say that they have my name on the waiting list instead and that we were on the bottom of the list, even though I never gave them my name (and obviously my name is no where on the list as she started calling me by the wrong name).  Finally, we peeked at the waiting list and realized that when they took my boyfriend's name, as mentioned above, they wrote it on the bottom of a piece of paper.  They have now transferred the names on the waiting list onto a different piece of paper, and forgot to transfer my boyfriend's name over.  Finally we were seated and we explained the situation to the manager, however, he insisted that they have a system for the waiting list and the hostess has the name on the waiting list in the correct order.  He also insisted that we were not skipped, it's almost comical that as he was saying this, one of the couples that came in after us were done eating and walking out the door.  After hours of aggravation, we finally ate.  The food is good as usual, but I think I will go to other establishments of BWW instead in the future.", "author": "Viv L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2007-09-03", "description": "I like the place and it has a good Happy hour.  I meet a friend there sometimes after work on Tuesdays where wings are about $0.30 a piece.  Also domestic beers are around $3.  \nI like to sit, talk, watch sports, and flirt with the regulars at the bar.\nAfter about 2 beers, a mixed drink, and a few wings I am good.   \nSo I do not know about anyone else, but I like the place.", "author": "Catie L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-04-07", "description": "I went with some friends today and we were a group of 6 people and they took a good 15 minutes or so till they were able to seat us. But honestly, I think we all enjoyed each other's company so much we really didn't mind the wait. But it was probably another 10 minutes or so for the food to come, but once again, we just chattered away in all that time. So the wait wasn't so bad actually.\n\nI had 12 wings, 6 with the mild buffalo sauce and another 6 with the parmesan garlic. All of it was amazing and came with bleu cheese dressing. The only thing that bothered me was that we had to ask for forks. I would have eaten the wings with just my hands but they were super saucy and it was just easier to eat with a fork. Since I went on a Tuesday, the wings were only 40cents each. And my bill came to under $5, which is great, I would definitely come again. The only negative things seemed to be that other patrons seemed to be extremely loud \u0026 rude and the long wait time.", "author": "Aida L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-12", "description": "Good wings - we tried the garlic parmesan, asian zing and bbq sauces and had 3 dollar happy hour beers along with them.", "author": "Jason Q."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-23", "description": "How can people not love this place? I mean the location is a little ... you know...but overall I can't complain about a thing. The food was awesome. I got a cheese burger, fries, and the medium wings (yes, I was hungry!) and my friend got the Nachos. Everything was well prepared and the waitress was very nice and helpful. Although, it was a bit crowded we got perfect seats next to this huge window, that overlooks BK. There are TV's everywhere that plays different sports. I also believe you can watch UFC there too. It's a great place, to hang out or even grab a bite. They do take-out orders also.", "author": "Marie F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-12-09", "description": "I went BWW with my family one weekend and the food was really good and affordable.Only 3 bucks for beer and among 5 of us the bill only came to a little over $80.00 and that's way cheaper than any of my previous restaurant visits with my friends.The service was good and I had the parmesan garlic wings with a big jack daddy burger.We also shared a sampler.I would definitely recommend this spot for those that love wings and cheap food.", "author": "Sean S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-08-07", "description": "BWW. Start with the good things. The wings are really good and the nachos are very good to. They have a lot of tv's so you be able watch the game, or the fight. Now let's get to the bad the place was filthy our table still had BBQ sauce on it. The wait was so long to get  seated. The wait staff sucked. It was so freaking loud i could not hear the fight on TV. It took forever for are food to get to us. BWW is kind of like that fat chick with the real pretty face. You know she has so much to offer but you wish she could lose weight and she is pretty. That's how BWW is it has so much to offer but falls short.", "author": "Hector S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-24", "description": "always good and cheap for us. this is the only place i know i can get good service and cheap food. we are always here.. i just forget to check in..lol", "author": "Deprina G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-26", "description": "Love this franchise. Recently found this location in Bk and was like cool...great wings! As I waited and waited and waited.....lol...I eventually got my wings and was not disappointed. Please don't come to this spot for anything other than deliciously seasoned wings (yea I know they serve up salad). I highly recommend this location but please be patient with the service.", "author": "Chante R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2007-07-04", "description": "I give this place 5 stars on Tuesday's for its .35 cent wing night!!!  A couple of colleagues and I went out after work and tore through about 120 wings in total and the bill wasn't bad at all.  \n\nThey have a pretty good selection of beers on tap with Guinness, Newcastle and Killian's Irish Red winning me over.  The wings were AWESOME!  I loved the selection of flavors they gave.  My personal favorites were the Caribbean Jerk and Spicy Garlic with emphasis on the latter.  They have so much flavor and zing to them! Mmmmmmm.\n\nThe blazin' are a little ridiculous and ruin the spices of the others so if you feel daring save it for last and make sure to order some water or better yet a large glass of milk!\n\nAs far as the service goes, less than par like other's have said but we were expecting that so every time we saw her, we placed another order for 30 wings.  It turned out to be a pretty good strategy.\n\nOverall, highly recommended for Tuesday .35 cent wings!!", "author": "Gabe F."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-11-15", "description": "THIS PLACE SUCKS. \n\nSorry, but it is true. I have never eaten at one of these places until recently and my experience will make sure I will never eat at another one again. Server was impossible to get a hold of, took forever to take our drink order, food came out before drinks (WTF???), forgot to tell us that they were out of something my friend ordered so it just didn't come, the food was cold when I got it (cold fries are the worst!), wings were mediocre- medium apparently means not spicy at all (although I didn't expect much from a chain restaurant), the atmosphere was somewhat nice with a sports bar feel but it wasn't clean (not in the sense of grimy tables and bugs but like the floor hadn't been vacuumed in 3 days and servers weren't picking up dropped napkins, food, silverware, etc to keep the place looking tidy).... everything was pretty expensive for what you get/ the quality of it, especially for a chain restaurant.\n\nI could keep going. Just don't go here unless you want to spend an arm and a leg for sh*tty service, food, and an overall horrible experience. First time and last time there. Save yourself, don't go and don't give them your money. You're better off spending $7 at McDonalds downstairs, gross I know, but better service and probably hot food.", "author": "K L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-01-08", "description": "This place is awful!!!! Every single time I go the waiter is horrible!!!! Last time I went they bought out the wrong order of food for me, I was upset but I didn't complain, then when it was time to pay the foolish waiter took about 15 minutes to put the food on my sisters debit card and he did it the wrong way! I'll never go back to this BWW again!", "author": "Shannon J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-10-07", "description": "oh buffalo wild wings. i dont know how much praise is too much, but their food is fantastic. just do not come here on a night where there is any type of sports on. you will not get a seat. their servers are good, atmosphere is good. reason for only 4 stars, its sometimes soo over crowded that it gets annoying and the seats/tables are kinda close together so you get those inconsiderate people bumping into you and not saying sorry. \nbut overall, if you looking for some cheap wings, cheap beer and a game, go to buffalo wild wings !", "author": "Britt L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-06-07", "description": "i couldn't help it. i was craving chicken wings. \n\nso i'm adding a few more stars for the wing deals and flavors. Wednesday's are .60 wings or 18 wings with the flavor of your choice for only 8.99. when you order spicy, it's spicy like granny makes it. asian flavors to southern kick, there's about a total of 12 to pick. hey that rhymes. i got the ribs and wings combo and the fries got stale as i was chowing down. maybe they reheated the fries in the microwave? it was 30 mins till closing.\n\nthis location seems to always require lots of patience. the service is very slow. fortunately the server was nice so we didn't make a big stink about the wait. \n\nstill, i stick to what i wrote last time, order take out whenever possible.", "author": "Noy K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-23", "description": "Great wings with many sauces to choose from, including mild ones for weaklings like me. Fried very well--perfect texture. We were seated according to the game we wanted to watch, and they have enough TVs to accommodate several teams/sports. Service was good when I was there. Reading the other reviews, I wonder if my experience was unusual...", "author": "Suzie Q."}], "servesCuisine": "American (Traditional)", "priceRange": "$11-30", "name": "Buffalo Wild Wings", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "139 Flatbush Ave", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/ENoWKg2ScYUtSOPF-xpcJA/ls.jpg", "@type": "Restaurant", "telephone": "+17189439453"}