{"aggregateRating": {"reviewCount": 573, "@type": "AggregateRating", "ratingValue": 2.5}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-09-05", "description": "For sports bars and the ability to watch nearly any game in nearly any sport....I don't know that this place really has any competition. The food.....meh, it's wings and fries and a few other things on the menu. My problem comes in the fact that the word bar is  in the name of this place. The drinks are ridiculously watered down. I mean they must use a thimble to dole out the alcohol for the drinks.....I mean there are churches on communion Sunday that have more alcohol in their drinks. I guess you better stick with beer at this place. The drinks are absolutely terrible. Look if I'm not getting my point across, a complete teetotaler would have to down twenty drinks from this place to even get tipsy. Unless you've just got to see that big game steer faaaaaaar away from this place.", "author": "James B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-05-02", "description": "It's Atlantic Terminal, of course it's ratchet!! I love the Tuesday wing special but the last time I went, it took more than 20 minutes for our waiter to serve our food. Now the waiter was great but I don't know if the kitchen was backed up from the place being packed to capacity at 11pm but I've never waited that long before. And then on top of that, my wings were overcooked and the seasoning was heavily sprinkled on one side of all the wings! SMH but as the old adage says, you get what you pay for right??", "author": "Cassie J."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-07-29", "description": "loud, chaotic, chain restaurant.... what else would you expect above Atlantic terminal?\n\nif you are a tourist and you eat at BW's, shame on you.  That said, I still really like their wings... I just always feel guilty and like I need to work out for 6 hours the day after I eat them.", "author": "Mike B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-02-17", "description": "Aside from the slow wait and service, it's a typical Buffalo Wild Wings. Sometimes you have to fight to get attention from your server, sometimes you don't. It's about 50-50.", "author": "Ian J."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-04-19", "description": "I've had better wings, but was there for the company and the big-screen TVs broadcasting basketball games.", "author": "Bin H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-04-01", "description": "Don't get me wrong, there are a lot of things wrong with this place.  But they'd be a lot wronger if I lived in the suburbs.  Only in Brooklyn do I feel okay going into a mall and eating at a chain restaurant.  But not just any chain restaurant, mind you.  A chain restaurant I've never heard of!  This is key.  I'd rather die than go into Applebee's.  But BW3?  Sure, whatever.  Wings.\n\nBut it's not all bad.  The ceilings are high, and I mean HIGH!  It feels roomy.  I never! feel roomy in NYC.  The beers aren't horribly priced, and some creative thinker on their management team squeaked loud enough to somehow get Kelso beer on their menu.  That was unexpected.\n\nIf this joint was in Putnam County, it would totally blow.  But it's in Brooklyn, one stop from my apartment on the subway, and there are waitresses named Betty who are actually burlesque performers in their real life and flirt non-stop with you.\n\nSo it's not bad.", "author": "Kyle H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-25", "description": "Food here is very good and staff are super friendly. Only thing I do not is the huge crowds during a UFC night.", "author": "Curtis E."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-10-09", "description": "I visited for the 1st time (at a Buffalo Wings ever) this Monday. The Food was ok. The Fries Better. The Waitress was the Pits. She had us wait 15 to place our order then another 30 to get it and once it came she only came back to check on us after we flagged two other servers down to get us something. NEVER AGAIN. I am only giving this 1 star because it wont allow me 0.", "author": "Cristina V."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-05-19", "description": "The wings sides and beer selection is decent.  They certainly have a sauce to fit every flavor profile.  The wings themselves are a little overdone, but im willing to cite the fact that I went on a packed sat night with a fame on and a line out the door.  If this is ur bar destination for a sporting event get here way early, or pay the price.", "author": "Richard L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-27", "description": "Order did take long especially considering that I just ordered a side and the place was nearly empty at the time. But, the servers were very friendly and the potato skins I ordered were great.", "author": "Patrick A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-05", "description": "Just like what I remember from over 10 yrs ago in midwest.  Blazin wings dont disappoint!  Can someone please call 911 for my tongue?:-)  \nBartenders were attentive and friendly.", "author": "J S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-01-07", "description": "My bf and I went here after an exchanging spree at Marshall's and Old Navy, because we both have a soft spot for chains and neither of us had ever been to one of these.  \n\nOn the plus side, we sat in time to take advantage of happy hour with $2 and $3 beers.  It also happened to be 60 cent wing night so we ordered a dozen boneless wings with spicy garlic sauce.  I was pleasantly surprised with how good they were, really crispy and tasty.\n\nOn the minus side, my bf's beer quite obviously came from a dirty tap, they wouldn't let him order his burger any way but well-done, my pulled pork nachos were not even mediocre (and I LOVE nachos, even ballpark chips \u0026 fake cheese), my side salad was all end pieces of iceberg lettuce, and the music was really loud and old - all songs that were popular in the 90s, like they paid for a discount playlist.\n\nWe decided we would probably go back sometime on our way home just for cheap beer and wings, but we wouldn't order anything else.", "author": "Sherri M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-04-17", "description": "So, I've been here once or twice because It's right on the way home and sometimes I just want to eat some wings. \n\nIt's a chain restaurant, and they do ... okay, but to be honest I'm never really excited. Buffalo wings are a lot like sex - even the bad ones are still pretty good.", "author": "Bryon B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-06-23", "description": "The service at this location absolutely sucks.  You may be stuck waiting at the hostess stand for an extended period of time because the hostess is never at her station nor is she very attentive to the needs of the customers.\n\nOnce you are finally seated, the service isn't much better. However, I've got to say that the food is pretty good and it comes out in such a timely manner. They had a wide array of flavors to choose from and everyone will be satisfied.", "author": "Brittany H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-09-17", "description": "No HDTV. Really??? In a sports bar in this day in age? I'll be back when you upgrade your televisions.", "author": "Rasheed M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-13", "description": "I go here a lot with Boyfriend for the wing deals. 24 wings and 4 sauces kick us in the pants every time. (Fans of Asian Zing and Spicy Garlic)\n\nIt's noisy, busy and difficult to flag a waiter, but when it comes down to it: we love the food. Waiters never messed up an order and are friendly and accommodating (when we can grab one).  And Boyfriend can watch all the sports he wants simultaneously.\n\nBWW is an affordable and fun night out when you've been cooped inside working all day!", "author": "Kimmie N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-28", "description": "BEST CHICKEN EVER. Or at least I have ever tastes in NYC. You should go on Tuesday when each chicken wing/drumstick is 55 cents each but prepare to wait cause it gets pretty packed quickly. Other than that, if you are a broke person like me, the place is pretty expensive but its definitely worth it. I also LOVE their popcorn shrimp but my friends were bias about it.", "author": "David Q."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-02-06", "description": "BWW has been a college favorite since I came to NYC, but since graduating and having less time to wait in line, I've found my patience for Buffalo Wild Wings has dropped significantly.\n\nFirst off, the food.  The wings are typically delicious--mango habanero is my utmost favorite, because I find that it tastes spicier than the Blazing but, at the same time, actually has flavor.  Other great choices are the Honey BBQ and the Caribbean Jerk.  Don't be afraid to mix and match, though--many of the flavors are delicious.  Add to that some delicious blue cheese dressing, potato wedges, and 23oz beers, and you've got a comfortable spot for larger groups.\n\nUnfortunately, you're going to be _very_ hungry by the time you get your food.  If you go on a weekend, expect to wait an hour minimum if you have over two people.  I've gone there with large and small parties, and have had to wait for hours at some points, and 10 minutes for others.  Most of the time, its not the hostess' fault--she is usually waiting for people to finish their meals so that she can use their table.  Which leads into my second point...\n\nService. Is. The. Worst.  We're talking 30-45 minutes to bring you the beer you ordered.  By the time you've got your order for wings placed, expect to be waiting for another hour+, usually more.  Needless to say, by the time you actually have your food, you will be starving!  I've been to this specific location a dozen times over the past few years, and its extremely consistent.\n\nThis place is loud and sporty, which is great when you're out with friends.  They have several big screens showing any and all major games, and you'll usually be able to find a lot of college groups there--more than once we've ended up socializing with neighboring tables.  Also, it seems that the bartender/kitchen staff seem to be to blame, and the wait staff tends to make up for it by being friendly and talkative--one of the few saving graces of the service.\n\nIf you're in a hurry, I highly recommend ordering wings to go--the line is non-existent and, somehow, you get your wings substantially faster.  Even more, you can browse the mall for 20-30 minutes and then pick up your food before hopping on the train.  I do this frequently with my girlfriend.\n\nFinally, never get a mixed drink here.  They are EXTREMELY watered down.  Don't forget, this is a beer and wings place.\n\nOverall, its got good food, but its dragged down by its worst of the worst service.  To quote another reviewer here, \"the place [is] a zoo,\" but at least you leave well-fed!", "author": "Andrew M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-27", "description": "short and sweet:\nLike wings? Go to Buffalo Wild Wings.\nLike cheap wings? Go on Tuesday(Traditional), Wednesday(Traditional \u0026 Boneless), or Thursday(Boneless) when each wing is 60 cent.\nLike things that aren't wings or chicken/sauce related? Try somewhere else.\n\nSodas are all you can drink. Waiter service is spotty. Wait times for tables are high when there's a sport event, moderate when not a Tues Wed or Thurs, and not bad otherwise. The onion rings are great.\n\nDon't get Jamaican Jerk or Teriyaki sauce. Don't get Salt \u0026 Vinegar dry rub unless you frackin' love salt and vinegar Wise chips.\n\nIt's a goddamn chain restaurant, folks... what do you want?!", "author": "Rafael G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-05-09", "description": "Been to the Brooklyn location twice so far. I've gone to a few BWW in the southern states. This place fulfills the need for wings wings and more wings please. But unlike the southern locations, this spot has a dark and unimaginative decor. \nThis is a great place for sports. Remember that- especially if you're with some one who hates sports. Saw a UFC fight here on ample large screens. Fun crowd during these events.\nIn the daytime kids are here. Why? This place is like one huge bar. At night unless sports are on the patrons are a bit too silent for the huge bar atmosphere. You really can't win in this one. But like I said, the wings are good.", "author": "D-Baby B."}], "servesCuisine": "American (Traditional)", "priceRange": "$11-30", "name": "Buffalo Wild Wings", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "139 Flatbush Ave", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/ENoWKg2ScYUtSOPF-xpcJA/ls.jpg", "@type": "Restaurant", "telephone": "+17189439453"}