{"aggregateRating": {"reviewCount": 573, "@type": "AggregateRating", "ratingValue": 2.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-11", "description": "The wings were great, I really enjoy the sauces but they were a little on the hard side. I would recommend the Asian zing. I would come back here though, 60 cent wings is really enticing.", "author": "Kar N."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-01-11", "description": "How is it that I can serve the country at age 20 but not be able to go into buffalo wild wings after 9pm because i am not 21.   Disappointed.", "author": "Veronica C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-23", "description": "I came here few days ago around 3pm after getting my shot from the department of health, and service wasn't as hectic as some say maybe because there wasn't any major sport events. \n\nThe wings were delicious, if I remember correctly we got the garlic one and honey BBQ. I regret not trying out the spicier sauce . The other thing we got were cheese fries. I was expecting something more like cheese sauce, on the fries but instead it was like microwaved packaged cheese. The cheese was hard on top of the fries, not very appetizing . I think the fries alone would've been better and cheaper!", "author": "Amey C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-02-18", "description": "Service was a bit quirky but very friendly , very attentive, fast, efficient, and friendly.  I was pleasantly surprised at the awesome service.\n\nThe wings have great flavor.  Maybe a tad on the smallish side (I would say 6 wings would be a lunch for a normal sized person).  They might be a *tad* dry, but you're supposed to put sauce on them anyhow (we ordered the dry rub).\n\nThe boneless \"wings\" are not wings at all.  They're really chicken tenders with a nicely flavored crusty crunchy outside.   The thing that makes them different from, say, Chicken McNuggets would be the fact that they're a bit spicy and crunchy.\n\nThe salt and garlic fries were delicious, but I let my wife eat most of them since I try to avoid all that salt.\n\nSome complain that this place gets rowdy.  It wasn't like that on Monday ~2:30, but I can see how the place might get rowdy during sports events.  I can see it's restaurant veneer can turn bar-like with the right (or wrong?) crowd.\n\nPersonally?  I like the place and wouldn't hesitate to come back.", "author": "Peter S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-07-27", "description": "I came here on a Thursday with 2 of my friends.  First, they stopped us and asked for IDs.  We're all the same age, but one of my friends has a later birthday, so he was still 17.  They refuse to seat us, saying that we had to be 18 years old with state IDs.  We asked why and the lady told us that kids have been cutting school to eat there.  It's summer vacation and there is no school, lady.  All I wanted was some chicken, damnit.\n\nSo we ordered to go and wow, I was disappointed.  The onion rings were good, that was about it.  I didn't like the teriyaki sauce they had.  The boneless chicken was kind of gross.  Maybe their wings are better.  I heard such good things about this place too.  It's such a shame that my first experience was so bad.", "author": "Connie W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-05-16", "description": "This place is the absolute worst. The only reason I even come here is because its the only place my husband and brother in law can eat wings and watch a bunch of sports games simultaneously.\n\nUnless you have someone dragging you here, don't bother.", "author": "Carol F."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-08-29", "description": "Worse takeout service ever,I think because it's by Barclays center they will always get the business so service is not a priority.I knew I was going to be in the area so I order online  so that  I wouldn't have to wait long it said my order should be ready by 7:30 after placing it a little after 6:30pm which I was fine with because I had other things to do.I arrived at 7:30pm,paid them than  was told it wasn't ready.I think I was very patient until after 8pm I inquired about my order and the cashier comes out with the wrong order,let's just say I didn't get my order until 8:30pm.This place is not compassionate towards the customer and lack communication( explain the wait time or delay).The manager had to come out quite a few times to speak to irate customers.It made absolutely no sense that  I had to wait that long,the staff is not apologetic and needless to say this location will not be visited by me anymore.", "author": "Y S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-12-29", "description": "Bad. Just bad. I've been here maybe 2 years ago for their beer pitchers and wings, and thought it was an acceptable establishment for those foods. But the experience this time around was not a good one.\n\nFirst, a few of us got different pints (and types) of beer and they all tasted off... a little flat or watered down was the consensus. One person asked for a different pint of beer, and it tasted slightly better.\n\nSecondly, the nachos was just not... barely edible. I would think most people could toss together nachos better than what was served to us.\n\nThe only upside... tablet trivia! When we inquired about it from a waitress, she was surprised and quite happy that we asked for it. Apparently, she had for some time offered the trivia tablets to patrons but kept getting puzzled faces that she had stopped asking. We were the first to use/ask for them! Regardless, this won't be enough to bring me back.", "author": "Pam H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-09", "description": "As long as you get there early in the day (like one or two-ish) you're good. If you want to be in the presence of a bunch of loud, obnoxious (and sometimes ratchet) idiots, go there during the evening and/or when there's a game on. \nDon't do take out, they almost always neglect the order and it's not as if you can send it back, nor do you want to go through the food when it's already packed to go.\nServers are usually nice and almost always very attractive, in my book, it's a plus to have a cute guy or gal server (I know, I sound hella shallow lol).\n\nAll in all, a cool hang out for me and the kid.", "author": "Marz D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-01-03", "description": "Worst experience ever. So we traveled all the way fron Harlem  (without know BWW opened in Midtown) just for some wings and brews. We enter the place and they said that it would be a 30 minute wait and we should put pur names on the list.\n\nThis place is completely disorganized and there is no real system to track thwir waiting list. We put our names on the list and headed to the bar because we didn't come out to hold the walls up.\n\n About an hour into the wait a waiter crashers into the wall and spills wings, hot sauce and ranch or bleu cheese sauce all over us. Our coats, face, backsides, shoes, bags and everything. And that's not even the issue. We  calmly asked for the manager to resolve the mess and get some napkins, I'm not a fan of being covered in sauce.  Thank you Javier for your apology.\n\nSo all the while we're checking the status of our wait and we're no where near bring seated after a 2 1/2 hour wait. The response I received was a chuckle and smile and the excuse that people are staying to watch the UFC fight and other games. There is no flow of business if you're letting customers sit without ordering anything for hours and hanging on to the last sip of their drinks. \n\nWho is in charge of revenue management? Who handles customer satisfaction? Where is the flow?  Where is the trafficking?\n\nI gave this place 2 starts because I like the brand, the wings and the brews but this location needs a bar rescue and a new way of practicing business. \n\nWe frequent the Barclay's for concerts and games but I promise you that we do not recommend and will never visit this Buffalo Wild Wings again.", "author": "QC C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-10", "description": "Ah, BW3s.\n\nSo good, so delicious and so fun. \n\nMy good group of pals and I decided to embark on a journey into Brooklyn due to the fact that there was no college football or NFL games on for the first time in a long time. It was time to do some trivia, eat some wings and drink some beers at the ever so popular Buffalo Wild Wings. \n\nThis was my first time at Buffalo Wild Wings and I can ensure you it most likely won't be my last. It's not the fact that their wings are the best wings I ever tasted, or their beer is of the greatest beer of my life or anything like that, but it's the ambiance really. It's a great place for you and some pals to go, hang out, drink, play some trivia and enjoy each others company along with beat each other at some trivia (which I can be terrible at btw). \n\nIf you're looking for a fun place to watch a game, eat some wings, drink some beer, and enjoy each others company - this is definitely the place for you. \nIf you do get wings - I recommend the spicey garlic - I'm super sensitive to spice and although they make my eyes water they're SO GOOD.\n\nenjoy!", "author": "Julia L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-01-03", "description": "Worst restaurant experience I've ever had.  Rude/aloof staff, food orders took forever and were repeatedly wrong.  Had saved a table for 2 friends friends that my group was expecting to join us during the 1pm game (explained to the hostess) was repeatedly (3 times in an hour) bothered by staff to take the table away for other patrons.  \n\nI understand that its peak hours and we were holding a empty table (for 2) but either make it/enforce a policy that all guests have to be present before seating, or leave us alone about it.\n\nIncorrect wing orders were \"corrected\" by re-saucing already sauced wings and then served using the same wax paper/bowl as the incorrect order.  (Had the old sauce still stained on the paper)\n\nComplained, had my wings comped and moved on. Never again.", "author": "Michael S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-22", "description": "Boneless wings here only. Boned are not good, and I like bones better. I like the honey ones the best. Thursdays are boneless Thursdays, so they offer I believe .$40 a wing. Their beers are pretty cheap during HH, but they charge you a tax on each one which is annoying. I've also watched a few UFC's here, so keep that in mind if you want to find a place to do that, just get there early, of course.", "author": "Dan M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-09", "description": "I have been dying to try the wings here for quite sometime and I must say, I was not disappointed. My rating is simply for the wings. This location was not for me as it was jammed packed with teenagers from various nearby high schools. \n\nI ate at the Atlantic Center mall location in Bklyn, across the street from the Barclay's Center. I entered through a side door that had a sign for Buffalo Wild Wings and Applebee's. I rode the escalator up, only to find that I was at the take out only section. I had to walk across the entire restaurant in order to find the actual entrance where the hostess/greeter was standing. That was a little bit annoying. \n\nWhen the waiter came over and said that since it was Tuesday, all wings were $0.55, I quickly forgot about the rowdy teens, and trek across the restaurant. I ordered my traditional wings with teriyaki sauce and a small cup of mac and cheese. It was delicious! \n\nI left there with a full belly, and still had money in my pocket. You can't go wrong with that combo!\n\nBottom line: Wings are yummy, just find a better location.", "author": "Elly F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-12-27", "description": "The Mango Lemonade had a lot of lemonade rather than the taste of mango. The chicken wings were okay. They have a lot of sauce you can choose from to put on your chicken wings and wrap. I got the crispy chicken wrap - it was good but the chicken was a bit dry. I liked their BBQ sauce on my wrap though. Also, our waitress was nice and friendly.\n\nThe setting is flooded with music. It's loud and noisy. It's a long wait, too! Not recommended for a date.", "author": "Katie K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-25", "description": "I will forever be a Wings and Beer kinda girl... so no matter where I go I try to lock one of these into my schedule! So glad they brought one to my hood! \n\nAlways great to visit this BWW and grab wings, a beer and catch a game!", "author": "Yana Y."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-22", "description": "We came here today around 3:40PM and made reservations and the person in charge of the front told us 30-35 minutes so my girlfriend and two other friends thought we had time so we went to Target directly across from BWW. We looked around till 4:05 and lost our call but no doubt they were quick with the next time they called which was took like 10 minutes. I didn't understand why they would ID us when we just go there for wings.. We are all 18 luckily.\n\nThey have very nice waiters and waitresses ready to take order. The waiter that took our order was gladly helping us with his opinion on what to get because it was our first time. Tuesday was a special deal on Traditional Wings and Thursday is Boneless Wings! While the wings took a while to come the waiter was supplying us with water and reminds us that it's going to be coming right up.\n\nI ordered a Large Traditional Wings with Parmesan Garlic, Honey BBQ and Sweet BBQ and Buffalo Chips with Cheese. Honey BBQ wings were really dry so I wouldn't recommend this as for others are more juicy.  My friends ordered all the spicy flavors for wings, a burger, and Jalapeño Pepper Bites. Seems to me they're into spicy food.\n\nAs we got our check it was pretty cheap. Came out to be $57 for a meal for 4. As of now I am really full after 4-5 hours apart from BWW.\n\nWill recommend to come back for more of your favorite wings and flavors! Beware of waiting line and packed inner diner.", "author": "Bill Z."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-01", "description": "All things considered, I have a hard time seeing how anyone couldn't like this place. If you can tolerate it being a chain restaurant, the crowded and chaotic neighborhood, the fact that it is in a crowded and chaotic mall, and if you actually manage to step inside the establishment -- it's pretty much impossible to not enjoy yourself. But some people are just downers.\n\nM friend and I had various sorts of beers and wings, had some interesting conversation with our waitress, and really enjoyed the various sorts of group dynamics around the restaurant. I can't imagine eating here every day, but they have decent specials for with-bone Wings on Tuesday, and boneless Wings on Thursday, so perhaps again next time I'm at Target.", "author": "David L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-11", "description": "I want to give a big shout out to Ozzy, one of the managers at BWW Brooklyn. \nMy husband and I met him in December. \nWhenever we crave wings or wanna watch UFC, even though we live in Westchester and have a BWW across the street we go all the way down to Brooklyn just to be with this guy. \nOzzy is the best. \nLast Saturday I went there with a big group for a birthday party and he really took amazing care of us. Everybody had a great time. \nThanks a lot Ozzy!!", "author": "Paloma H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-11", "description": "Good food\nNice atmosphere \nFriendly staff\nI ordered all appetizers( a large amount of food for an appetizer) everything was very tasty \n\nLooking to return soon!", "author": "Tiffany W."}], "servesCuisine": "American (Traditional)", "priceRange": "$11-30", "name": "Buffalo Wild Wings", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "139 Flatbush Ave", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/ENoWKg2ScYUtSOPF-xpcJA/ls.jpg", "@type": "Restaurant", "telephone": "+17189439453"}