{"aggregateRating": {"reviewCount": 573, "@type": "AggregateRating", "ratingValue": 2.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2019-02-18", "description": "I care alone on Presidents' Day. There was no wait and o sat at a high table. I server came right away and he was very kind and attentive. I ordered Wings of course and a glass of red wine. The food took about 10-15min but my wine came right away. My wings were great!! It's fairly empty and quiet today so I'm taking my time to sip my wine. No complaints. Thanks guys!", "author": "Demi M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-02-28", "description": "Placed an order online at 11 for 1:10 pickup. Had to cancel at 1:55 because the order still wasn't ready. What's the point in selecting a a time if the order won't be ready", "author": "Dawn M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-02-19", "description": "They purposely understaff on Tuesdays (where traditional wings are half off) so they can deter customers from buying", "author": "Lawrence S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-08", "description": "Yeahhhhh don't bother lol seriously I'm like the most chill most understanding person when it comes to food service and customer service because I've worked in both fields many years ago this place was like a cafeteria that was run by high schoolers so to make a long story short here is my gripe:\n\nThe food is ok  I've had the food before via takeout so nothing award winning but gets the job done\n\nThe ambience is ok a bit crowded but do-able\n\nMy main thing is where is the host,where is the customer service,good rule of thumb when you have such a large establishment where people come in to enjoy a meal it's a great idea to have a person greeting people on the way in and thanking people for even coming on the way out...\nI should not have the ability to be walking around your establishment in search of the host \n\nwhen I arrived with my family myself along with a few other folks were on the hunt for the host who went MIA never truly greeted us just said \"when you're ready let me know\" like we're here and waiting to be seated so we've been ready the second we walked through the door. \n\nIt's very disheartening to have to spend your money  but the staff look at you like your annoying them...that's not cool or welcoming which is what you sell in your marketing\n\nMaybe a little retraining can help I don't know.... I highly doubt I will recommend this establishment to anyone but best of luck", "author": "Charlene C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-07-22", "description": "Came here for a quick lunch before going to a show at Barclay Center. This place is really dirty. They don't seem to sweep/vacuum. It looks like they whip the scrapes of food from the table to the floor. This place is big but there's a lot of people and it looks chaotic. Service is slow. We can never seem to find our waiter and they do not stop by the table. It is also really dark in the restaurant. We sat close to the window so we had sunlight to see our food. Since this place is really dirty I do like to see what I am eating. \n\nThey have a good selection of sauces for the wings.  We ordered the honey BBQ and sweet bbq. I prefer the honey BBQ. I tried both boneless and bone in. I prefer to have it boneless as it's easier and cleaner to eat. We also ordered the corn dog appetizer. Overall the food is decent.", "author": "Daisy C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-10-30", "description": "As of recently I find myself bound to Sunday's,Monday's and Thursday's ...yes Ladies and Gents, I am a newly found victim of Fantasy Football...I've been wanting to indulge myself more into the sport and what better way to do than with a bit of competitiveness? Anyhow, after work I decided this would be a good place to come and watch the game and some light bites. I arrived promptly at kick off and found myself front and center in the middle of the bar without having to squeeze into a seat. It was rather empty - surprising for game night, but it didn't bother me one bit as I was seeking nothing other than the sort. I read preciously that they have Game night specials with items starting at 5 dollars so I figured how can I go wrong ...my first drink was the Buffalo Zoo which was a drink comprised of pineapple, fruit punch and vodka...a bit too sweet for my taste as I'm more of a martini/wine kind of girl, but nonetheless fitting for the price. I was conflicted with ordering a platter which consisted of a chicken sandwich and fries or go for the signature wings. Since I wasn't entirely too hungry I chose the wings...I decided to try their spicy garlic wings as I've never tried before. Two minutes ....yes Two whole minutes later my  platter comes out with the server calling out my dish. I was surprised to having it come out to fast because well you would think it would take a bit longer for fresh, spicy garlic wings to be done right...well once I set my eyes on the dish, I quickly realized why they came out so fast. The sauce was gunky, the wings were dry and it basically looked thrown together without reverence for representing their staple. I can say with certainty there was nothing 'Wild' about these 'Buffalo Wings'.The only consolation was that they came with fries that were semi warm and decently tasting. The Bartender and the large screens were what made my trip worthwhile. He was attentive and engaging while the game was on and the screens gave me the up close and personal feel. Can't say that I'll be running back for the wings. It may have been an off day, but I would think given the lack of patrons one would put more care into serving their signature wings.", "author": "Elizabeth M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-15", "description": "I have been dining at this Buffalo Wild Wings location for about 5 years but for some reason it was always too much going on for me to snap a photo. This is the third time I have came here for their fast break lunch which is pretty quiet around this time. The service is a good pace along with decent food and hostesses. I usually get the Mango Habanero but today I opted for less spice and ordered the Asian Zing with a side of potato wedges. For starters, I got the Blue Moon regular ounce beer at my server's recommendation. I enjoyed the food and chill atmosphere. Yes, I will continue to revisit as it is my go to location for my favorite chicken.", "author": "Serina J."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-04-10", "description": "Whew let me start off by saying I come here every Tuesday for 1/2 off wings,last Tuesday when I stopped by they said they couldn't take anymore orders something is wrong with the system it shut down, so the new cashier asked the manager can she take my order the answer was yes with a hour wait,so I said no problem because that was the usual on a Tuesday. Now within all 10 min all of a sudden this dirty unkept acne all over his face worker at the the takeout counter brings out my food I never received my food that fast from them in my life,once I seen the unkept boy hand me my food I was immediately turned off and my order was completely wrong, I was sooooo turned off by the way he carried hisself dealing with ppl food soon as I got home and eat my wings towards the end of the night my stomach was hurting uncontrollably not to mention I'm pregnant and it felt like labor pains it was so bad I begin to start pushing thinking it was time. I didn't get any sleep because I cried all nite with this sharp pain in my stomach til the morning when I ran to the bathroom and threw up everything including the carrots,that was the worst case of food poisoning I've ever had that spreaded to everyone in my house and I wouldn't wish that on no one especially not a 7 months pregnant women. I will never buy from them again please remove me from your rewards list.", "author": "Netta C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-19", "description": "BWW is hands down my favorite place to get wings. I love wings and every Tuesday there is a half off traditional wings deal! You will most likely find me there. It is fun to try out the flavors and go spicier everytime you go! And for fun you should definitely try the flavor Blazin!! See what is your limit and maybe shed a few tears. Other than just wings, I love their nachos appetizers and fries. I learned that you can get seasoned fries, which definitely changed my experience. Recommend this to wing lovers!", "author": "Ying L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-05", "description": "The worst service in the history of Buffalo Wild Wings... \n\nI was here for lunch with my fiancée \u0026 8 month old daughter when we came in we asked to sit in the bar area with the high tables \u0026 was told children were not allowed. Now the New York State law is children are allowed as long as they are not drinking. Also she was in a stroller so it's not like she will be sitting up on the high chairs...\n\nwhen we sat down to order I was informed that the burgers are only made well done. This is insane to tell me you only cook food one way!\n\nI then told the waiter I wasn't ready come back, he came back within 2 minutes \u0026 yet I still was not ready..\n\nMy fiancée got her food and my order was not taken, it was not until I asked for the bill and they were taking her empty plate away was I asked if I wanted to order... I've never had such an horrible experience at a Buffalo Wild Wings.", "author": "Ryan B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-01-18", "description": "Do you want the worst dining experience of your life? Then you, my friend, are in luck!\n\nWhere to start? How about the beginning - I've lived in the neighborhood for over 5 years and never once had any inclination to step foot inside BWW. I should trust my gut more often.\n\nBut a coworker wanted to get wings and our local place was closed. So we took the journey over to the Atlantic mall on a Thursday night after a Nets game, so it was pretty full for 11pm. They closed down the whole window section, so the only seats were in the middle.\n\nThat's fine. We went to the bar to grab drinks and wait for a table to open up. We spot a group leaving and then I ask the dude who appeared to the manager if we can grab the table. He says yes.\n\n10 minutes later, nobody comes to serve us. I flag down a waitress and ask for menus. She says \"of course\" and then never returns. Another 10 minutes and we finally get service from a lovely woman. She apologizes and says that since we started a tab at the bar, they didn't know we sat down and wanted to order food. But... like... I literally told two different people.\n\nAnyway, we got our half-price wings (Thursday deal), and they were as subpar as you'd imagine. The type of wings that come frozen and they roughly thaw and bring out to you. At least the sauces weren't terrible. The hotter ones will melt your face off.\n\nAlso, for some reason the entire place was like 75 degrees. So that didn't help.\n\nI guess if you really want to listen to a weird mix of Puddle of Mudd, Mariah Carey and, Nickelback, you might like BWW.\n\nBut otherwise, don't come here if you want great wings. Don't come here if you want good service.\n\nDon't come here, period.", "author": "Kenny C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-01-25", "description": "I came here with a party of 7 one Tuesday evening to take advantage of the half-off regular wings deal. Being that it was a night where they offered half-off wings, the restaurant was relatively crowded. We were told to wait 45 minutes until it was our turn to be seated. \n\nWe were seated and our waitress took our orders. The waitress that took our orders was definitely not the nicest of people. She also wasn't the most attentive. We had to repeat our orders several times before she got it correct. She also got annoyed when she thought one of my friends didn't clarify what she ordered, but realistically, she just did not jot down exactly what she said because she was dozing off or whatever. \n\nThe wings we ordered weren't bad at all. They were also inexpensive. I had an order with 20 wings with 4 different sauces. One of them being the hottest sauces they offered. That particular sauce wasn't THAT bad as I expected. Still gave my lips a good burn for a few minutes though. \n\nWhen it was time to pay our bill, I was planning to pay with credit card. To my dismay, we all found out that the credit card machine was down and I had to pay with cash. \n\nOverall, my experience here was mediocre aside from the food. The staff here need better training as a majority of them were just goofing off when there were no customers being waited on.", "author": "Henry T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-15", "description": "Don't get me wrong I absolutely love Buffalo Wild Wings, but the service here is hit or miss. Sometimes the wait on the food is rather ridiculous. I remember when Tuesdays \u0026 Thursdays you felt like you were actually getting a real deal on the wings.  The price has increased so much, it feels like your paying just a little less than the regular price.\n\nAlways a great place to catch a drink before or after an event at the Barclays Center which is located across the street.", "author": "Durval M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-11-27", "description": "Worst service ever ! they are not organized first of all the lady taking orders at takeout was very rude. Second I waited over 40 minutes they didn't even tell me my order was ready by the time I received it it was already cold not to mention my whole order was taken wrong. Very disappointed", "author": "Marilyn P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-07-11", "description": "Totally different vibe from San Diego. Long line, mostly African Americans, usually I got 6 sides of veggie sticks in SD if I ordered a large original wings. Here I got nothing but a few sticks and server told me they charged extra if I wanted more. Please come to SD, California and see how they serve.", "author": "Gary N."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-12-27", "description": "This place is definitely mismanaged. They won't sit you down even when there are tables available! The host/hostess is always lost and not trained--do not know how to handle and flow people. If my nephew didn't love the wings so much, I'd never step foot in here again. Do yourself a favor, if you have time, just take the train to the one in the city!!!", "author": "Elizabeth T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-20", "description": "Service has greatly improved over the years. Also I've learned to stop being so impatient (lol). Food is always amazing, great place for a casual dinner or drink.", "author": "Karen Y."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-09-10", "description": "This place is either a hit or a miss depending on the day and time. This time was a complete missed. More than half the tables were emptied, they were under-staffed and not enough cooks in the back. Had to wait for a server, had to wait for food, had to wait for additional napkins and utensils. Food was lukewarm (they nuked it in the microwave?). Server was no where to be found, flagged her down twice, got the check pretty fast though. Paid and got out of there.", "author": "Mei C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-09", "description": "This place is very good chicken wings and other food. This restaurant also have bar within the restaurant. It might be a good place to eat with the person you like. Good place your friends can go to eat lunch", "author": "Jenny Umi H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-24", "description": "I'd give this BWW 4.5 stars if it were for the wings alone (honestly, some of the best traditional buffalo wings I've had at a BWW in a long time). But, it's also about the service and the price (and this one is pricey, even compared to DC location prices).\n\nIt took a solid ten minutes for anyone to come to our table after the hostess directed us where to sit. And it wasn't packed at all, so it was kind of unexpected to wait that long. However, the service picked up once we finally had someone come to the table. Wasn't the best, but I don't expect to be waited on hand and foot (is that the saying?) at a Buffalo Wild Wings tbh.\n\nThe high top section where we sat was really cluttered and chairs were all over the place, and it felt a little like the place could be cleaned more, but I got way past that once I got my fried pickles and wings. So so good. So good that I'd come back and look past everything else to get the wings again. It *is* mostly about the food, right?", "author": "Kaley R."}], "servesCuisine": "American (Traditional)", "priceRange": "$11-30", "name": "Buffalo Wild Wings", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "139 Flatbush Ave", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/ENoWKg2ScYUtSOPF-xpcJA/ls.jpg", "@type": "Restaurant", "telephone": "+17189439453"}