{"aggregateRating": {"reviewCount": 573, "@type": "AggregateRating", "ratingValue": 2.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-24", "description": "This places always gets the job done. I prefer take out as opposed to sitting down the place can be overcrowded and loud at times. I always love to get my buffalo dry rub wings, they always hit the spot. The waitress was great, and very accommodating to my 4 year old son which was a plus for me !! Didn't do 5 stars because they ran out of coronas which sucked but overall a great place to grab a fast bite !", "author": "Jeanine G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-08-23", "description": "Carols the server\nfailed to bring us any water \nFailed to gave us any napkins \nFailed to gave us blue cheese dipping or any kind of dipping \nFailed to take in my order of basket of fries \n\nThis location\nFailed in making good wings my desert heat was tasteless \nWife's Caribbean jerked was also tasteless \nMade people wait when there was open tables", "author": "David W."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-12-10", "description": "Worst. Service. Ever... All. The. Time\n\nThey pride themselves on being a great place to watch games, but they have TVs from 2001. It smells, they're slow, and the wings even aren't that good anymore... The sauce selection isn't even interesting anymore.\n\nAnd now with the Barclays Center, expect it to be extremely packed/slow after Nets games...", "author": "Danielle T."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-05-26", "description": "I sat at the bar and was not even acknowledged by any of the 3 ghetto bartenders who were laughing and gossiping amongst themselves. A black couple came in, sat at the bar and were served immediately, so I walked right out. This BWW is dirty and disgusting and of all the lazy workers just standing around doing nothing, not a SINGLE one is white. This BWW is ghetto garbage.", "author": "DP W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-03-11", "description": "Need to hire better employees, The guy working at the register today was cursing up a storm taking in people's order . This is a place of business - not a park.", "author": "Stephany D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-03-23", "description": "I always go here and I love it. 60cent wings Tuesday and boneless wings Thursday. The service is amazing. And the wings are bomb. \n\nThe only reason I'm giving it a 2 stars is because last time I went there they didn't let me go on because my friend wasn't 18 ? And to mention this was around 2PM in the afternoon. And they didn't let us in. The guy gave us a nasty attitude. Buffalo Wild Wings is a family restaurant that just has a bar you don't need I.D unless you're going to the bar or getting drinks. I never had this problem before. Must I say I'm never coming back here ever again.", "author": "Connie L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-15", "description": "Brought a bunch of HS football players there for my son's BD on Friday night. The wait was not too long as I would have expected to be for a popular sports bar in Atlantic Mall. Staff was very friendly. I have ordered a different varieties of chicken wings and fries for the table to share which everyone loved specially the hot ones. Everyone was happy enjoying the food and the atmofer watching football on giant TV right by the table while I was enjoying my beer and fried pickles at the bar. It was good choice for the purpose of my visit. Personally I prefer smaller local sports bars but would recommended to all for large parties. Price wise it was very reasonable as well.", "author": "Jitka W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-23", "description": "Bar was good. We had a few drinks and appetizer. Service was friendly and fast. No complains !", "author": "Eliana G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-01-06", "description": "I placed an order for pick up and upon arriving and getting my food, the order was very cold. I returned to my work area and as I went to open and eat my lunch I was disgusted when I found a hair on my chicken (which I have a picture of). I contacted the store and the manager in hopes of getting a new order, as I was eager to eat BWW. I arrived at the store and the inconvenience I had already incurred seemed to not matter, as the manager did not place a new order for me. I asked for a refund to be issued and left the store, extremely disappointed, hungry and angry. I was forced to eat at another local restaurant in the Atlantic Terminal mall. The store lacked complete customer service, from the food down to the manager who \"handled\" my situation. I was extremely displeased and will encourage my friends and family to no longer dine at BWW Brooklyn or any other locations.", "author": "Sheira C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-03-02", "description": "i got the medium wings but the skin was extra slimy i prefer it crispy but what really through me off was the ranch dip tasted like fish! so weird. the merlot was surprisingly good that's the second star!", "author": "Doris N."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-04-06", "description": "This is by far the worst Buffalo Wild Wings I've ever been too. This is the B-Dubs that is across from the Barclays Centre. I've been here several times before attending events at Barclays, and every time I've been here, there have been issues.\n\nThe wait staff can't seem to get out of each other's way! Nobody seems to know what's going on, which table to serve, where to put the patrons or which table to serve the food! It's beyond unprofessional and embarrassing!! There are obvious no systems in place to help the wait staff succeed!!!!\n\nI've been here for countless events at Barclays that start at 1:00PM, and the staff always seems unprepared for the mad rush that ensues. It's like they didn't realize a 1:00 event was scheduled at Barclays!!!!\n\nAfter seeing the mass confusion that seems to take place here every single time I've been here before an event at Barclays, I've realized that the issue is MANAGEMENT!!! The management has ZERO systems in place to insure proper customer service or a positive work environment for their wait staff!!!\n\nI'm tired of coming here, over an hour before a game, and asking if I'll be served and have enough time to walk across the street in time for the start of the game at Barclays....only to constantly arrive LATE!!!\n\nI'm also tired of coming here after a game when I have 55 minutes to kill before my train departs and asking if I can order a drink and food and have enough time to make my train.....to be told YES, only to still NOT HAVE FOOD ARRIVE with 5 minutes remaining before my train departs!!!!! That is BEYOND UNPROFESSIONAL!!!!\n\nThis past weekend, I complained to the management, and gave them specific examples of how poorly this place is run. While they did nothing to assure me that changes would be put in place to insure that future customers would be taken care of properly, instead a large portion was taken off my bill. So, if you're unhappy here, MAKE NOISE!!!! DEMAND to speak to management, specifically Dorothy, and DEMAND that your bill be adjusted to match your expectations!!!! Perhaps when an ample number of customers complain, this establishment and management will finally put systems in place to insure a positive experience for its patrons!!!! I really hope so, because the wait staff deserve a MUCH BETTER work environment to flourish and make a living!!!", "author": "Craig K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-09-16", "description": "I've been to better locations out of New York State : it's pretty decent here . I like to go early in the day. The night time - well just hang yourself because your waitress most likely will forget you until it's time to give you a bill and collect their tip. I'm not tipping if service is poor. Sorry . In the daytime the young female waitresses .... Play. They talk, laugh with each other and play. Just bring my food , check on me , and I'll be ok. I love their drinks . It is a little pricy seeing that they cut one wing in half and now consider this to be two wings  lol but the sauce .... The sauuuuuuuccceee?!!! I love mango habenero spicy sauce with blue cheese!!! I was a vegetarian until this place came Into my life lol", "author": "Marie Annick M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-10-21", "description": "October 6 2012\n\nI'm starting to write this after waiting in my seat for 15 minutes. The wait for seating was about 5 minutes when I arrived at 5:15pm on Saturday evening. The waiter took our order and provided us with our ordered drinks. The place is a man's hang out.\n\nI ordered a flatbread that they mistook for a spinach dip that took half hour to 45 minutes to come. Chesse fries basket wasn't worth it; just get the classic fries basket. Buffalo wings were average.\n\nThis place is for you if you like to wait, eat with your fingers and very very noisy! I saw the television images, but no sounds from the screen....not coming back.", "author": "Ilene E."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-10-23", "description": "Wings are good but service is really bad despite the fact that they have a million servers!!!\nI was sitting for 25 minutes before i was asked about a drink. We sat there for 45 minutes before we ordered our meal. Servers just walk by as if you don't exist. If you don't stick your foot out and trip one you will not be served. With that many servers, no one should have to wait. Come on managers, open your eyes!!! It's a real shame!", "author": "Robert H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-10-22", "description": "My delivery took 2 hours and they forgot to bring dipping sauces. Called and they put me on hold for 8 minutes then proceeded to ignore my following calls. Very upset with the service!", "author": "Brendan N."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-08-09", "description": "The wings are good, but the service is somehow crazy. I placed an order online and wanted to modify or cancel the order, but the page didn't respond so I called. The first time the lady told me to hold on before I explained, then she never came back; the second time the phone was picked up but no one responded then it was cut off. Not a nice experience at all.", "author": "Zhaoyan L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-08-05", "description": "Do no order online. My wife and I have tried this twice now. We ordered food through two different services with the exact same result. Incomplete orders both times. Then we call the store and they seemed to be more worried about who's fault it is. Here's a hint guys: customers don't care, just fix it. So they finally tell my wife after a long hold that they would credit her card for the missing items. That's it. Honestly she still needs food. So then they tell her they will send the driver back. Later they call saying there are no drivers and they can offer a store credit of $20 for a future visit. Really $20 to sell out your credibility and lack of service. As someone who has worked in the service industry for 25 years it's hard for me to complain. I seldom do because I know these surveys get into higher up hands. But at some point we have to stop saying it's ok to hire these young kids who don't give two craps about service. I mean the girl simply asked my wife why she could just eat my food.  I laugh but it's sad. Never had issues on the inside but please think twice before ordering online.", "author": "Brian P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-06-27", "description": "As a student who's school is in the area and a resident of the neighborhood, I frequent this place pretty often. My multiple experiences here summed up into one word? GHETTO. While the food is always great and I've come across maybe one or two hostesses that was really nice (hence the two stars vs one), the employees here are as rude as they come. Being seated to eat means piss poor service, long waits for food, and nasty attitudes. Don't even get me started on the people at the registers for takeout. I dread going up to them because almost every time I have to stop myself from getting into an argument with them. (And I work in the fast/casual food industry, so I always make sure I'm polite because I get it). Great food, but everyone working outside on the floor needs to be restaffed.", "author": "Jalynn W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-26", "description": "Damn this place has too much traffic especially for Wild Wings Tuesdays. That's my shiznit so I can't complain. I can however complain about that happy hour drink menu. You should see how petty they are with the drinks. My friend ordered a drink from the happy hour menu and I was disappointed for her! I ordered something not within the happy hour special. I think it was a blackberry mojito. Damn I love me some mojiots! I love the muddled mint and fruit. Anyway it's usually easier to find seating at the bar since the kiddies can't sit at the bar boo hoo. I just realized that I haven't been here since Barclay's opened. I know this place is even worse. Damn you Jay Z!", "author": "Amira A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-11", "description": "I would give 0 stars if i could. Be prepared to wait at least 30-60 min AFTER you order on top of the 20 min you spend sitting there trying to get a waiter to take your order. Place is unsanitary and disorganized, managers have an unpleasant attitude, kitchen is severely understaffed. Upper management has to take the time and reevaluate the performance of this shitty chain location. Avoid if you can.", "author": "Alan C."}], "servesCuisine": "American (Traditional)", "priceRange": "$11-30", "name": "Buffalo Wild Wings", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "139 Flatbush Ave", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/ENoWKg2ScYUtSOPF-xpcJA/ls.jpg", "@type": "Restaurant", "telephone": "+17189439453"}