{"aggregateRating": {"reviewCount": 573, "@type": "AggregateRating", "ratingValue": 2.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-15", "description": "Okay I'm a heavy wing eater...I effn love em'. So I'm always out looking for the next best thing to Wing Heaven (doesn't exist yet sadly). \n\nMy coworkers and I decided to give this place a try and the first thing that stood out (in a bad way) was that they DON'T DELIVER! Can you believe that crap? How can you call yourself a wing establishment and not have the means to deliver your product to the masses...total bull. This still leaves me feeling a little upset primarily because when we actually went to pick the order up we had to drive around for a little while to find a decent park, just to run upstairs and collect the damn order. (woo saa)\n\nOkay I'm over it.....I'm over it because the wings are effn amazing. Like I've had wings from way too many places in the 5 boroughs to have this one stand out so much. I don't know if its the 12+ flavors that the wings came in, or the fact that I got to try them all in one sitting (with a few other people of course....im no slob lol), or maybe it was the fact that the wings were VERY meaty and well cooked, or possibly that they weren't soggy or too dry.......they were simply amazing and i must commend them on that.\n\nI'm sorry to say that they will be taking a lot of my money on the days that I work (If I forget my lunch home again :o).\n\nThey are located on the top floor of the Atlantic Mall, right next to the up escalators....trust me you cant miss them. I didn't have a chance to sample the drinks here or anything else they had on the menu but to be honest if the wings are this great they can't possibly have anything better than it.\n\n\n*Cash and Credit*", "author": "Quincy T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-04-12", "description": "Loved this place when it first opened. I love their curry thai wings!!!!! But it's a hit and miss at times. Drinks are ok, nothing special. The wait is crazy..", "author": "Samantha K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-10-04", "description": "The waitress took 10 minutes to come to our table for our drink order. Then, after 15 minutes without seeing our drinks/waitress and several unsuccessful attempts to get assistance from the other waitstaff, we picked up and left. Really pitiful service considering the restaurant wasn't even that busy.", "author": "Evan G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-06-08", "description": "Before I say anything, I'd like let it be known that like any sports loving America, I love Buffalo Wild Wings.  I went to this location with a party of 4 on a Sunday for dinner, and our server basically told us that they were out of all beer except Bud Light, Blue Moon, and Shocktop.  After we ordered, another server came back and informed us that they were out of Shocktop too.  We asked for the check and left.  The prices were inflated, but that's to be expected after considering the close proximity to Barclays Center.  I still love you Buffalo Wild Wings, but I won't be coming back to this location anytime soon (probably ever).", "author": "Ethan M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-07-23", "description": "Went to this location on Tuesday for wings and fries to go. I've never had BWW before and as I entered, I was hit with such a wonderful BBQ aroma.. I ordered and the wait was over 20 mins, cashier didn't tell me, I overheard her telling another customer about the wait. Finally got my wings and wondered why they wasn't dripping with sauce, sauce was like skin tight jeans!! It was very bland BBQ sauce and the wings had no flavor whatsoever... The fries were the size of dollar fries at Mc Donalds, overpriced! I can make better wings at home. FYI, you need better lighting, who wants to eat in the dark?", "author": "Shaquana B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-10-25", "description": "What happens when you put two mentally challenged woman at the front desk of a sports bar... Oh thats right.. Mass chaos. Zero customer service and pissed off customers.\n\nPS - A sports bar shouldn't run out of beer on Football Sunday. \n\nPSS - The uneducated stupid hostesses should be on the same page. One shouldn't say your next and the next say 45 minutes. \n\nPSSS - The manager shouldn't yell at people that they can't be at the bar and need to stand in line for the mentally challenged hostesses to get a hold of people. \n\nOh and by the way yelping from Applebees. Fuck you buffalo wild wings.", "author": "J W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-18", "description": "The restaurant is located inside Atlantic Mall. It has the sports bar feel to it but also kid friendly. They supply you with the \"safe\" high chairs (if you're a mom, you know what I mean) and coloring book with crayons. \n\nTuesday = 60 cent wings!!!\n\nTheir parmesan garlic wings are crave worthy! I love them just as much as I love the fried pickles.\n\nI knocked down a star because this time when I went, it seems like they cheaped out with coating the wings with the sauce. Like some parts were plain wing and some parts had the sauce. UGH TURN OFF. \n\nCOME ON BUFFALO WILD WINGS, JUST BECAUSE ITS HALF OFF DOESN'T MEAN YOU SHOULD CHEAPEN THE FLAVOR.", "author": "Allison K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-30", "description": "First time going there. My mom, sister and I waited in line for a long time. There was so much people, so I made a reservation and the lady told me that It would take like 35 minutes. It was like taking so long for us since we were starving, but finally they called us. We made a order of potatoes wedges, spinach artichoke chicken flatbread, buffalo wings dipped in parmesan garlic sauce, and the screaming nacho burger. The burger was delicious. The jalapeños had that spice that I was looking for, as well as the nachos that gave the burger a crunchiness. The buffalo wings would taste better if they were not so extremely dipped in that sauce, so I suppose that I would have to choose another sauce next time. The potatoes wedges were okay, nothing bad. Good thing is that I noticed that you can refill your drink ONLY if you order SODA or LEMONADE. The service was good.", "author": "Winnie L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-01-28", "description": "Loooooooong time for pick up take me an almost an hour to get 24 wings knowing that when i called they said its 20 min n end up for an hour", "author": "Zaki B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-06-24", "description": "Place wasnt clean... looks really trashed after some party left.\nWent there with a coworker for some late lunch. Dark and quite spacious, big ass tv screens adorn the walls, ddnt really get to see the whole area because we were seated by the entrance.\nOrdered some nachos- quite good actually\nChicken Quesadilla- very cheesy good\nRibs \u0026 Wings - hot one really\nBerry Lemonade - thirst quencher\n\noverall food was awesome. service was okay. but the place was really... a no brainer.", "author": "AlmaGrace S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-06-10", "description": "When the hostess is bussing tables, you know it's gonna be a hawt mess. I came here on Mother's Day, but with a friend. Maybe all the staff was with their mothers? Dunno.\n\nThe host stand was half watched. I know because I waited in line for a long time only to have her come back and immediately seat people who had cut the line. We then had to wait, along with other upset people, even though there was literally a sea of empty tables but not enough waiters (their words, not mine). The hostess offered little in the way of an apology.\n\nThere was an employee standing there, maybe security? I guess he was guarding the unattended stand because he surely wasn't keeping any kind of line order. Nor taking notice of the young children alone in line who had called their mom asking, \"When can we eat? When are you coming back?\"\n\nAbout 10 minutes after being seated, our server finally showed up and he was less than enthused. \n\nWe ordered popcorn shrimp (already dead, but cooked to death some more to the point of being rubbery and with entirely too much breading), mini corn dogs (greasy and barely warm) and  jalapeños poppers (passable). We probably should have stuck to the eponymous wings.\n\nAbysmal service. Abysmal food. Oh, and please lose the creepy cardboard cutouts of the guy all over the place.", "author": "Zenovia E."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-04-14", "description": "So I rarely ever go to chain restaurants anymore. I love a chilis and a Fridays.  This is very reminiscent of those places. The wings are good. They aren't the best wings I've ever had but for what they are, they're good. \nI do love how many choices they have for sauces on the wings and there are a lot of hot options. I recommend this place if you're going to Barclays and need a quick place to eat.", "author": "Lenny W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-03-11", "description": "Not much to say about this place...\n\nTypical sports bar in a highly populated area. Located right in Atlantic Terminal Mall so you can grab something on the go or sit down with and enjoy a game, some drinks and decent sports bar food. Nothing really special but not bad either. The best thing I've had here is the popcorn shrimp but I am sure they have other selections of food that aren't that bad.  Service is okay at best.", "author": "Jay L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-01-03", "description": "Came on a Sunday, was told it's a 'Game Day Wait.' Apparently that means even though there are 'two people in front of us,' parties that walk up can get seated immediately while we wait. I asked the host again to make sure I wasn't bugging out how many people were ahead of us, and as I looked at the list he was randomly going through who to seat ... Unprofessional way to run an establishment.", "author": "John O."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-08-20", "description": "Very disappointed in the service today. 20 mins for the waiter to come. Thats after we went to find her. Almost 30 mins for the food to come. She barely checked on us. If it wasn't for the wings I would have gave it a one star.", "author": "Sandeep S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-11-22", "description": "Came here after an event at the Barclays center so it was a bit busy but not too crazy yet the service was super slow. They were \"out\" of some of their \"fan favorite\" items..and them the waitress forget to put in the replacement order.  Over two hours for an order of wings and a couple burgers. The wings with dry seasonings were good but not outstanding enough to make up for the overall experience.", "author": "Food E."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-10-27", "description": "Good wings but they're drinks are terrible.  You have to show ID to enter the establishment \u0026 my drink  taste like liquid diabetes smh", "author": "Brittney W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-03-13", "description": "(Take out wise) Horrible service on Tuesdays and Thursday's around the time kids get out of school. There are always people playing in the back and not cooking. You'll be waiting in there for hours for your food. And when you call in to order they'll never answer. I will not buy from here anymore.", "author": "Ciara L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-01-25", "description": "I've been here twice both time service was slow.  The last time 20 minutes for the waiter to take our order and waited another 45 minutes for the food to come out to our table.  The wings and nachos was tasty, but the service was awful.  They were way under staff and manager was not to be found anywhere.  Come here if you don't mind very slow service and prices a bit high for wings.", "author": "K Y."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-02-20", "description": "RACIST EMPLOYEE:The food is ok. I had it for takeout. Why 1 star? The cashier/waiter is racist against Asians. She is an African American Lady name Christina/Christine. First she was not doing her job! When we first arrive at the counter, she choose to talk on the phone and when her coworker ask for help, she ignore him. Then when the guy took our order, he told us 15 minutes. We waited over 30 minutes. By the time she came out with boxes of food, there is already second wave of ppl waiting. She went through the boxes and call out names and never call out my husbands name. I watched her while she looked at our boxes several times and never call out our names. Her coworker, nice guy, asked her couple times and again she ignore him. He eventually went to get the food for us instead. This happened in front of our EYES!!! And we were the only Asians waiting for the food! I cannot believe that I'm getting this type of treatment in NYC!! It was not like we were being nasty customers! \nManagement Team:\nI hope this is not how you train your employees!! I demand this lady to be reprimanded!! No one deserves to be treated like this! \n(Visited 02/20/2015, 9:36 pm)", "author": "Crystal H."}], "servesCuisine": "American (Traditional)", "priceRange": "$11-30", "name": "Buffalo Wild Wings", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "139 Flatbush Ave", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/ENoWKg2ScYUtSOPF-xpcJA/ls.jpg", "@type": "Restaurant", "telephone": "+17189439453"}