{"aggregateRating": {"reviewCount": 573, "@type": "AggregateRating", "ratingValue": 2.5}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-05-25", "description": "I really enjoy Buffalo Wild Wings for a variety of reasons. They have a long list of buffalo wing sauces and dry rubs and plenty of beers on tap. They feature a different beer every month and have decent happy hour specials. \n\nAnother great thing about Buffalo Wild Wings is that there are a lot of big screen and medium screen tvs. Therefore whatever game or sporting event you're looking to watch it's more than likely you'll find it on one of the many screens. \n\nThe negatives fall mostly in the inconsistency in service. Due to the location in Atlantic Terminal it can get very busy which means very slow service during dinner time. Even during happy hour while sitting at the bar I've experienced a long wait time for my food. Also, on my visit yesterday my boyfriend ordered his beloved fried pickles; however, the waitress returned to the table and informed us that they had ran out of fried pickles which really disappointed my boyfriend. \n\nOverall, I truly enjoy Buffalo Wild Wings and walk in being prepared for spotty service.", "author": "Candace H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-08", "description": "Great service great place, but I see so many people order food there and they don't know what they ordered soooo heyyy people before you go somewhere to eat just wash your eyes first and then order...,", "author": "Kristian R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-08-18", "description": "Fries tasteless chicken burger juicy but buns were stiff. Tomato old lettuce artificial and guacamole nasty and spicy. The bacon was hard and the mango margarita was eh. I wouldn't order this again", "author": "Kiesha B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-10-13", "description": "Found a roach in my food and crawling all over this table. Some of the staff didn't seem to be bothered by it and in fact kept right on walking when he witnessed me jumping out of my chair. The manager apologized and we left without paying.", "author": "Paige M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-04-01", "description": "My boyfriend ordered some wings on Saturday night April 1st 2017. The wings were $26.00. They arrived without the blue cheese he had requested (a pretty common thing to have with wings). He called the restaurant. Was put on hold. Called again. Spoke to the manager. The manager asked my boyfriend if he wanted a $5.00 credit. My boyfriend asked if he could just have the blue cheese dressing delivered. The manager said no because it was through seamless direct  and not the restaurant. The manager also said that he couldn't refund him because it was, again, through seamless. I know this to be false because i have had my food refunded from other seamless-affilitated restaurants. Then when my boyfriend figured he might as well ask for the $5.00 credit and the manager said he would have to go to the physical restaurant to pick it up.\n\nFinally, we took matters into our hands. I called my corner deli. AJ my deli man said they did in fact have blue cheese. My boyfriend went out and bought blue cheese and ranch dressing and is now more or less happily eating his wings.\n\nI dont usually write Yelp reviews. I think when stuff happens to me I am just so angry, I cant help be mean and exaggerate. But as you can see, this review is just the facts.", "author": "Emily N."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-11-24", "description": "This restaurant is located in downtown so I expected it to be busy. Also I venture out when it had their very popular special...traditional wings half off. \n\nThe entrance way is cramped where you have to wait to be seated. We were told our wait would be 15-30 minutes. It turned out to be 40-60 mins. The bathroom is located in this same space. So this was not a pleasant wait as every odor flew out the door when it opened. \n\nOnce seated the waiter was very pleasant and helpful. He took out order, but the good took another 40 minutes. One set of our chicken was cold and when the waiter came to check on us, I told him it was cold and he promptly brought out fresh well cooked wings. Appreciated that.\n\nThe restaurant itself seems understaffed. It is dirty and needs help organizing a better plan to seat guests.", "author": "Janelle H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-01-20", "description": "I love getting wings and I have never been to Buffalo Wild Wings. Okay, you would think this would be a good place for me. WRONG!!!!\n\nMy friend and I came only for the wings. We order a large wings that comes with 4 different flavors of choice. The large has 24 wings. We got the Mango Habanero, Asian Zing, Hot BBQ, and the Sriracha Sizzle. There was some leftover wings. I didn't have a whole lot. I did not like them. They were a bit on the hard side. Worst wings I ever had. If I had to pick the Asian Zing was the best. \n\nThe only good thing I had was the jack and coke. It's never to early to have a drink. Not too strong. 50-50 of jack and coke. \n\nOnly reason I'm giving two stars because our waiter was very friendly and attentive. \n\nNext time, I'm having wings at a local bar and grill.", "author": "Alan L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-15", "description": "The worse place to eat ever. Every employees seem to be in training or dazed and confused. The order took forever to come and was incorrect. The restaurant wasn't even full so idk why it took so long. Our waiter discouraged us from ordering drinks he stated that they were watered down and not worth it so we did not order any alcohol beverages..... Oh and wait...... we were seated and no one took our drink order or brought water to the table for at least 15 mins (the weather today is 86) water was definitely needed. The starter came with no napkins or utensils... just don't eat here if you expect good service.", "author": "Tori O."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-06-15", "description": "I'm sorry I just broke the 200 reviews but there's an even bigger problem out there: there are wings, wings, wings flying everywhere! \n\nThe only time I'd ever eat wings are on Thanksgiving (I'm not even kidding!) and I have almost never eaten other than homemade. \n\nYou don't mess with Tuesdays here--ever. Groups of people lined up in front of this place like a Black Friday sale and fight for seating. That's how rough it is. Fortunately, it's in the mall and you can kill time by shopping. I came here last summer with my coworkers and the 12 of us were seated within almost 2 hours, more or less. \n\nWe ordered just about every kind of wing on the menu and the hotter, the better; Blazin', Wild, Caribbean Jerk, Parmesan Garlic, Honey BBQ, and Hot were some we ordered and they were all pleasant in their own ways. Being very sensitive to hot foods (even the slightest spice), my mouth was burning when I took one small bite of the Caribbean Jerk, even though I liked the spices. \nYou can just imagine when I ate the blazin'--it was like I was in a melting pot.  I guess their spicy wings are TOO HOT FOR ME TO HANDLE. The Parmesan Garlic was probably my favorite because the flavors were well-balanced but overall, all of the wings were not boney and were done really well. \n\nThe place is actually nicer than I had imaged it as a wing shack--like an upscale Sizzler's setting or a Friday's. Lots of tv screens around so I got to watch the Fab Five take the gold! If you think you can handle hotness, try at your own risk.", "author": "Sharon T."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-01-17", "description": "If I could give this place a zero I would, I had the worst experience at this location, on a empty day I sat in the dining area to eat my take out and I was treated like a criminal who had done something terribly wrong. The manager yelled at me telling me to get up she needs her table and how I can't eat my take out there all while a  Caucasian lady was sitting a table across from me eating her take out way before I arrived. I will not spend another dime in that place and I have contacted corporate. Racist, rude, disgusting staff and management is just as disrespectful.", "author": "Raylea M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-10-27", "description": "Horrible service and it was empty. Overpriced. We got the order that comes with traditional \u0026 boneless wings with a side of fries for $18.99. We figured we'd at least get 8 pieces each. Right..... 6 each. The boneless wings were dry. One of the wings fell on the table and the sauce came off and noticed a discoloration on the skin.", "author": "J A M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-16", "description": "Not a bad atmosphere, and love that they always show the UFC and boxing fights. My boyfriend loves their wings, and I really like their bleu cheese burger.", "author": "Eliza S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-11", "description": "This place was ratchet as fuck. I walked in and there were no servers to seat me, as there normally are in a restaurant. I went up to the servers and asked if it was seat yourself and they looked at me like \"WTF?\" Really sketch crowd here too", "author": "Danny G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-09-27", "description": "One word for this establishment. Trash. Managers are lazy and could easily be seen talking on the phone in the bar area when my waitress was asking for assistance. My waitress was a sweet but was still getting the bearings on the place. The managers clearly are no help in that.  My wings were cold and dry. Long story short, would no recommend.", "author": "Regan J."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-06-01", "description": "I've been to this BWW multiple times and I've never had this problem. They refused to let us dine in even though it's not 9. However they let everyone else in even when they are not 18. This is terrible and rude. This is how you drive away customers. When the waiter got the manager she gave us a smug look. They didn't ask anyone else for ID and wouldn't take our word or let us in. If you want BWW you're probably better off getting take out. It all depends on the person working at the table and if they feel like they want to serve you.", "author": "Amanda X."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-10", "description": "We came to have a late lunch here, and we were seated promptly, we ordered a chicken quesadilla, a tender kids meal, chicken wrap and I ordered a Boston Lager Burger with the meat undercooked \"rare\" which is how I like it, the waitress came back and explained they didnt have it so I picked a Bacon Curd Burger with the meat the same as the one before. No issues we were served, and we started to eat, when I got to the meat, the meat was overcook...way overcooked upon asking the waitress about the issue they promptly replaced my burger with a perfect version although they did advice me that they do not give customers the choice of choosing a cooking point for their meat. Anyway they did satisfy my need and if I ever go back again I will just choose a different kind of meat, like chicken wings or something. I did enjoy my meal at the end", "author": "Laura H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-13", "description": "I've been here so many times and this is the last time. I mean their food is great but the management and service here is the worst of the worst. When we arrived somebody brought us to a table and have us seated. He gave us a menu and walk away never came back. After around 20 mins,I finally wave my hand to tell them that I was ready to order. The guy who I think is responsible for this area finally came and take my order. While he was taking my order he was talking to the other lady then came back to me, I had to ask him three times for \"flats only\" and when the order came out is STILL WRONG. Whatever......  and we told him we wanted one soda and a cup of ice water, he end up giving us two soda and no water, so I told him I want my water, then he said \"I'm not supposed to do anything.\" What? Aren't you responsible for this area? Or you can find the one who's serving this area... and the whole time nobody came for us to ask us what we need....If I didn't ask for utensils they didn't even give me one...whatever, this is the worst dining experience I ever had. Would spend my money else where next time.", "author": "Elise F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-05-14", "description": "I wouldn't call it great. Went there on a Thursday and didn't get a table for at least 25 mins when we could see an empty table right in front of us, we were not given entry. The service is quite slow. Ordered the boneless wings. Caribbean Jerk is by far my favorite sauce. Would definitely recommend. The chicken was quite hard. It kind of hurt my mouth. Nevertheless the flavors were great. Ordered the side of roasted garlic mushrooms. It was great. Nice and crispy outside and soft inside bursting with flavor. On the whole I found it okay. Definitely hope for better and juicer wings.", "author": "Vrushali D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-01", "description": "Came to BWW before a J.Cole concert when there were a ton of people. We sat in the bar area not expecting much and ANDREW blew us away with how incredible he was. He was fun, helpful, and  patient with all of our questions and gave honest recommendations. He made a chain feel like a family restaurant. \n\nPROMOTE THIS MAN!!!!", "author": "Michelle C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-02-24", "description": "I would reccomend this place as a quick bite to eat after shopping in the mall or attending a show or event at the Barclay's Center (Which is across the street). Everytime I come to Buffalo Wild Wings there's always a wait for the booths. Probably a 5-10min wait on slow days and 15-20min wait on their busy days. I always opt for the bar. I don't think the food is worth waiting in line to get a \"dine in\" expirience. \n\nThey have barstools and tables set up by the bar which you can pretty much walk in and sit at an empty table and a waiter will come to you. They have TVs everywhere you turn your head and it's a great place to watch a game.\n\nHere's what I like about the wings, I like that you can choose a variety of sauces to get your wings tossed in. If you want an extra sauce its about 50cents extra (Not bad in my opinion). I always get the Traditional Wings (which are the ones with the bones) They also offer boneless wings as well. To be honest, the past two visits to Buffalo Wild Wings the wings have been overcooked. I always order Lemon Pepper and Mild sauce on the side. My boyfriend likes the Terriyaki and Buffalo sauces on his Boneless Wings. I definitely recommend the cole slaw, it's very good !", "author": "Michelle D."}], "servesCuisine": "American (Traditional)", "priceRange": "$11-30", "name": "Buffalo Wild Wings", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "139 Flatbush Ave", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/ENoWKg2ScYUtSOPF-xpcJA/ls.jpg", "@type": "Restaurant", "telephone": "+17189439453"}