{"aggregateRating": {"reviewCount": 573, "@type": "AggregateRating", "ratingValue": 2.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-15", "description": "They seem to have specials everyday of the week. I came in here on a Thursday evening and the special was .75 cent boneless wings. I ordered 10, 5 hot and 5 bourbon. They were both delicious ! The service was great. I was immediately seated and my order was placed. The food arrived in about 10-15 minutes. I have no complaints.", "author": "Fatima C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-12-17", "description": "Not bad, a typical BBW. I came on a wings night around 8pm. It wasn't crowded; I waited about 10-15 minutes. There's a Target on the same floor and I walked around it for bit while I was waiting. Maybe that's why the wait didn't feel that long. Haha. There was a nice Christmas tree outside too, so you can take pictures while you wait. \n\nIt was difficult to get the waitress attention, but she was very tentative and kind. The wings were bigger than usual. There are certain locations that the wings on wings night are significantly smaller than regular days. However, the wings here were big and meaty. I was super hungry so the big wings were awesome :) \n\nThis location is easily accessible also. It's inside a mall connected to the LIRR and the Subway. Even if you had to wait a while, there are a lot of stores to shop around to wait :)", "author": "Sylvia L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-01-02", "description": "The service was terrible, they messed up our order twice. Asked for honey BBQ they came with buffalo, asked the waiter to get the right set of wings, came back without our veggies and ranch sauce that was originally on the order.", "author": "Daniel F."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-06-16", "description": "Wings were good, drinks were OVERTLY watered down, not even a TASTE of alcohol.\n\nI ordered a rum and coke my friend, a long island iced tea.  My rum and coke tasted like PURE coke and my friend said his long island tasted like watered down iced tea.\n\nI almost thought that maybe my drink order was miss heard, but the lime was there giving the illusion that it was indeed an alcoholic beverage.\n\nBrought this up to our waiter and he basically said they (management I guess) are cracking down on over pourers so you are essentially getting less than an ounce of alcohol.  He then pointed out the 'good' bartenders and the 'bad' ones that supposedly made our drinks...then asked if we wanted more drinks.\n\nI basically paid $8 for a coke and my friend paid $12 for iced tea.\n\nNo thanks.", "author": "Lee T."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-03-23", "description": "Came here with a friend, they check up ID. I had no problem with that. But the wait was outrageously long. I saw a table for two but they said it was reserved. We waited literally an hour for seating and finally they us in the same table we spotted. The table was dirty, they did not wiped down the table for us. The floor was dirty and sticky. Utensil took forever to come and service was so slow. They never took our order, so we decided to walk out. Complete nightmare and waste of time.", "author": "Karen H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-07-21", "description": "I want to start off by saying I don't want anyone to get in trouble... but tonight was not a good night at BWW. The staff clearly had communication issues. The table next to ours had food from the previous guests on it (about three filled plates of food.) Our waitress attempted to clean it but was having issues because she was busy serving her guests. I ordered the drinks and food and while my party waited a roach crawled across the wall. It lingered at the table for a bit. I tried to get the nearest servers attention but everyone was busy. My boyfriend tried to kill it but it booked it across the wall in the direction of the food that was sitting on the table behind us... at that point I lost my appetite and was growing skeptical of my drink and the cleanliness of the food coming out to us. At that point I lost my appetite and so did my other half. We finally got our food and told our waitress who informed the manager. He approached dropped his offer (cut the bill in half) and quickly walked away. Our waitress was much more compassionate. For her action I tipped her 40% of the bill due to us being there late and all, I know how that is. She packed our food and when we got home, we realized that some of the items were missing and/or not good. I feel like this should've been free... I'm stressed, hungry \u0026 disgusted also left with sketchy food. \n\nTonight sucked!\n\n- The End", "author": "Tiffany H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-02-23", "description": "I came here for the first time yesterday just to watch UFC 170 despite knowing about this BWW location for years. I'm a vegetarian who doesn't care for sports bar vibes so there's literally no reason for me to come here...until now.\n\nI'm a fan of UFC who doesn't have cable and refuses to pay for pay-per-view, which is where Buffalo Wild Wings comes into play. They apparently show every major fight, which is great. Unfortunately, everyone knows this and me and my friend waited 2 hours just to be seated on a Saturday night. Insanity. The weird part is that they don't have those buzzers that let you know when you're table is ready, just one hardworking woman forced to push her way through people and call out the names for reservations. STEP IT UP Buffalo Wild Wings! How do you have more than 20 tv's but no buzzer reservation system? Cheap. \n\nAnyways, the beer was good and our waiter was simply amazing. I ordered the spinach artichoke dip and potato wedges, which were both bigger than I expected but perfect for the hours we were there. I'll be back again, but only because of the UFC fights. Dassit.", "author": "Morgen B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-12-17", "description": "If I could give them zero stars I would. I went with a friend and sat there for 40 mins and nobody came to take the order.\nAll waitresses were doing whatever they pleased, there was a big group of them just chatting and laughing in one corner. \nWORSTTTT! Service ever.\nAvoid this place!!!", "author": "Yira A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-11-19", "description": "Me and my boyfriend come here every other week, JUST FOR THE WINGS ALONE. \n\nEvery time we come the service changes. One day it's good, another day it's bad. Even when it's a slow game day, the service sucks. \n\nThere was a Sunday afternoon I forgot my ID and I was taking my little brother there and they refused to let us in. But other days I come alone or with my boyfriend they wouldn't even ask for ID. The service is just strange and horrible. \n\nI repeat, we just come here for the wings alone.", "author": "Rebecca S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-06-09", "description": "I came to this location after the concert at Barclays was one of the first guest in the security told us just to sit in the high tops we sat for about 15 mins no one attended us I went spoke to a manager he faked cared cleaned the table gave me a menu and never came back by the time our server Kyle came to ask what we wanted people who came after us was already eating and drinking on top of waiting an extra 30 mins for our food Kyle walked out the kitchen with it walked threw the entire restaurant with my food in his hands attending to other tables my chicken was so cold and dry barely had any sauce and my buffalo chips were suppose to be plain with melted cheese and it came with spicy queso of course with all this happening the manager didn't even come back to check on us worst service worst food and I will never come back to this location every again\n\nLet not mention they id you to go into a chain restaurant to have horrible service and food even if your not ordering drinks", "author": "Chris M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-10-26", "description": "Went to this location and consistently bad service. I went there during busy time and a non busy time and both times were extremely slow and bad service . Figured give it another chance because I was craving wings and trying to kill time before going to Barclay , but to my dismay my wings were ice cold And I had to send it back , when it came back it was microwaved and all the sauce , carrots , and celery was missing . ... Ontop of that it was extremely salty . \n\nNext time I'm in the neighborhood I'll go to apple bees or shake shack across the street . Not coming back here .", "author": "Melanie Z."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-09-15", "description": "We went in on a Tuesday(75 cent wing day) so we knew that there would be a wait and we didn't mind waiting a reasonable amount of time. We walked in and were given a wait time of 30 mins with 3 parties head of us. So we waited, and waited...\n\nI knew that it would be longer so I gave an extra 20 mins to ask how much longer it would be. Then I was told by the manager \"I don't know why she told you 30 mins. It will be longer and there are 8 parties ahead of you guys\". \n\n...\n\nGot to the table(eventually) and the waitresses took about 20 mins to come to our table and just pour water. \n\nI will never come back. 75 cent wings aren't worth the annoyance.", "author": "Alisha M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-01-15", "description": "A hot terrible mess!! Bww must not have anyone that comes by to check this dump out.   Disgusting food drinks restroom and terrible service", "author": "Mizz T."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-02-26", "description": "Only my second time coming here and now I remember why I haven't came here in years.... The sodium levels of their food is off the wall!! Wow just wow.... I literally feel like a sodium free diet is obligatory after eating here. On the menu there is a little salt shaker symbol next to certain foods which stands for \"more than the average daily average salt in take\" and almost every item on the menu had this symbol on it. I'm not exactly a health freak but I had to down water like I've been deprived for days!!", "author": "Stephanie C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-07-20", "description": "I came here recently for their Thursday boneless wings HH special.  The place is located in the same complex as Target/close to Barclay's.  It's also around Atlantic Ave. area.  \n\nI've been wanting to try their HH specials for a while and finally had the chance to come.  The place is bigger than I thought and it's cool they have so many tv's.  The boneless wings we got weren't bad.  They reminded me a lot of the Perdue frozen popcorn chicken, except this had sauce.  The variety of sauces wasn't bad either, but really, how many boneless wings could you actually have?  \n\nThe service was ok i guess.  We ordered, our food took a while to come and it took a while for us to find our waitress so we could get our check.  Maybe it was because we were sitting at the bar.  \n\nThis place is okay for a quick meal.  I don't think this place is cheap and think the wings are actually kinda expensive when you can go to a real wing place and get better quality chicken for the same price.  \n\nEither way, this is a good addition to the neighborhood.  I'll have to come try their Tuesday HH wing special to compare.", "author": "Angeline C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-04-29", "description": "Atmosphere is cool. Lots of TVs and I like the darker ambiance. Service was really good. I ordered the buffalo Mac n Cheese but it was as if someone dipped everything in salt. My moms burger was ok but still a little salty. Ok fries. \nVery conveniently located with quick access to trains and subways in multiple directions. A little pricey, especially for the quality of the food.\nNot sure if I'd come here again. In the end they comp'd my meal. That was nice.", "author": "Guillermojo H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-26", "description": "Love the sauces \u0026 love the excitement during game nights! Special Wings deal every Tuesday \u0026 Boneless wings deal every Thursday.\n\nWhy have I not write a review for Buffalo Wild Wings yet?! I was introduced by BWW just last year by my boyfriend. I have been here several times during game nights and for my birthday dinner. \n\nThis place does get crazy crowded especially during game season at dinner service. You can expect to be carded and given a wait time (it varies) when you check in with the host/hostess. The restaurant is a sports bar - therefore, you will see a lot of sport fans crowding around to eat dinner and watch the game. The TV screens are big and they make sure you can watch it anywhere in dining area. Fans are very enthusiastic during game time. People actually cheer out loud and freely when their team scores. It's a very exciting sight to see! \n\nThe menu is very neat and precise in telling you the level of spiciness of a dry seasoning or sauce flavors for your wings. On the dry side, I love the lemon pepper seasoning because it is very simple and the skin is very tasty. The sauce side have more variety of flavors. On the sauce side, my favorite is the Caribbean Jerk - it is very well seasoned sauce. It is spicy but not too spicy to the point that it stays on your tongue. Another favorite of mine is the Jalapeno. If you are a brave soul, try Mango Habanero - tangy \u0026 spicy! That sauce is very spicy and it burns! It is very tasty but WOW... that power of spiciness was just unbelievable! It got to me very slowly and stayed for a bit!\n\n I was here for my small birthday dinner - if you are part of their \"Buffalo Circle\" club (you can sign up on their website for free), they will send you a coupon for a free dessert about a week before your birthday! Be sure you print it or show it to them on your phone at the beginning so they will know. \n\nI am a big fan of Buffalo Wild Wings and I will be returning! I also can't wait to visit the brand new Times Square location as well!", "author": "Cynthia D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-09-24", "description": "My friends and I recently went to this location to eat a lot of wings and watch some football. Because we are fans of non-NY teams, it's rare that we can watch our games on our home TV's. Given the sheer amount of TV's at this location, we assumed having our game shown would be no issue.\n\nWe were seated at a booth on the far side of the restaurant, in a little nook with only about 10 tables. Fortunately for us, no one else in that area seemed interested in football, as it was mostly families taking a break from shopping at Atlantic Terminal or just people who don't care about football. We politely requested our football game to be put on the large TV screen in our area, and our waitress went to tell the manager.\n\nAfter about 15 minutes without seeing our game on TV, we flagged the waitress down again and repeated our request. She said she had asked her manager, but would ask again. Shortly after that, the manager came over to our table and said that he would not put our game on the large TV, and that these TVs were reserved for \"local games\". There were no \"local\" fans there, so I don't understand why this was an issue. No one was watching the local game he had on the TV, but this man still refused to put our game on.\n\nInstead of accommodating a table full of hungry customers, he instead turned us off, and we quickly left to find somewhere else to watch the game.\n\nI don't see myself going back to this location, as they clearly don't care about customers or their requests. \"Wings, Beer, Sports\"? Only if you're a fan of the local team.", "author": "Allison S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-03-23", "description": "The wait time for the food is way too long I waited 45 min for my food even after I called ahead that's ridiculous", "author": "Davian C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-04-18", "description": "Terrible service! The employees at the take out section answer the phones to take orders while taking in person orders at the same time. Yea I know with 50 percent off on wings it can get extremely busy but please....no need to give stankkk attitudes to customers who wait to ask a question as opposed to the ones who shout and act a fool. Also ordering online hours in advance makes no sense because when you come in, your order is not even ready. The wings weren't that good....the ones I got were hard and dried up. Not even worth the 50% off. This will definitely be my last trip to BWW.", "author": "Missy R."}], "servesCuisine": "American (Traditional)", "priceRange": "$11-30", "name": "Buffalo Wild Wings", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "139 Flatbush Ave", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/ENoWKg2ScYUtSOPF-xpcJA/ls.jpg", "@type": "Restaurant", "telephone": "+17189439453"}