{"aggregateRating": {"reviewCount": 573, "@type": "AggregateRating", "ratingValue": 2.5}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-06-14", "description": "This place is y some people don't like Brooklyn. At first it looked cute and  like there could be goodness around!\n\nBut noooo, first we sat down on the sticky seats with sticky menus. 10mins later we get water with what looked like mayo floating in it gross, this was mere foreshadowing!\n\n10 more mins n they take our order.\n\n30 more mins and we get our food.I never knew that it took 30mins to make a salad And a chicken wrap with fries! When I wait almost an hour n put up with ppls crap and mayo flavored water, I expect the food to at lest be foodlike and yummy. My wrap was cold, and they charged me a dollar for a side dallop of there famous BBQ sauce. My mom's chicken salad , was plain lettuce with a uncut slab of grilled chicken in the center!\n\nMind you it was 4pm, the place was practically empty, no reason for such a wait. The real problem was the staff, they joked, and chased each other, basically hung out, as my food got cold in the back. I'll all for fun on the job, but when people  who didn't even work there where hanging out in the kitchen, that where the line gets drawn.\n\nI can really go on and on, about how much this place sucked, but im just gonna end it here. This place was def the worst place ive ever been too!", "author": "Kimberly F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-10-03", "description": "guess what.. on the east coast people are sports fanatics.. who knew.. i love real food and not being from the east coast i found it pleasant to eat real food and have a beer regardless of all the sport nuts surrounding me. OK, nothing special. maybe overpriced a little.. alright located in the middle of a mall... what do you want people.. it seems there was always a wait to get in.\n\nChicken and Beer people, chicken and beer.", "author": "R G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2009-01-13", "description": "When I got up to leave this place I half expected to walk out the door and be on the terminal concourse of Any Airport, USA.  The corporate blah-ness of the place should make any NY foodie run away in fear.  \n\nThere are a lot of beers on tap, but i can think of three bars within a couple blocks that have a better selection (4th Ave Pub, Pacific Standard and Cherry Tree).   The boneless wings were what I would expect from an airport restaurant-  probably poured into the fryer from a frozen bag, and then smothered in sauce straight from the jar .  \n\nNot a place I would need to go to again.", "author": "Hiland H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2007-06-10", "description": "Yukk Service, Rude Hostess, really dumb people working there...\n\nWell, why am i dumb enough to come back again? \n\nThe wings are darn pretty good. \n\nExpect to have a very bad service there....", "author": "Libon Z."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-06-28", "description": "Low quality wings, lower quality service, even with an almost empty restaurant our server could not provide even 1/2 decent service....there are very few places to sit down and eat at Atlantic Center, so I guess thats how they get by.", "author": "Fadda M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-08-18", "description": "Just wanted to add two things:\n\n1) Want to sit quick? \nEnter via escalator just left of Atlantic Ave. subway - bar area (has tables too) skips the Hostess line\n\n2) Wednesday 8pm - Live Quiz", "author": "Fiona B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2007-12-09", "description": "I was thrilled to find out this place opened here in NY, so I was willing to truck it all the way down to Brooklyn.\n\nIt's called BW3 - since originally the name was Buffalo Wild Wings \u0026 Weck, but they later dropped Weck.\n\nMy friends and I came here and I was really excited about this place but for some reason this location in NY is not as good as the ones down South.\n\nHowever, I did enjoy their Sour Cream and Chives steak fries with Ranch dressing!", "author": "Ro R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2008-08-21", "description": "if you've never been to a BW3's before, they're all pretty much the same.  They have huge beers and like 15 different kinds of sauces to douse your boneless or bone-y wings in.  Plus there's a million televisions so you can watch all manner of sporting events at once while noshing on junk food you never thought you'd want but somehow find yourself wondering how you ever lived without.  \n\nthe bottom line: there are better wings to be had, esp in park slope.  but 15-cent wing tuesday is hard to sniff at for those like me who find their pocketbooks full of moth balls.  service is hit or miss (usually miss, if i'm being honest).  dine at your own risk.", "author": "Mag M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-12-23", "description": "Wild wings! lol I love their boneless Thursdays! Every Thursday they have 60 cents boneless wings. tuesday id 40 cent bone-in wings i believe but it could be 50 cent. They also have sports events and Monday night football specials. They have a wide variety of wing flavors. the onion rings and wedges with cheddar are on point. They have flat screen tv's all over, the wait time is about 15/20 mins on average so don't expect to walk in and eat right away. they are very busy........", "author": "Eric S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-09-30", "description": "unfortunately, the service at this particular location stands out so much as \"lacking\" that no matter how good or consistent their wings are, i never walk away feeling good about my meal. slow, forgetfull at times, and often disorganized (especiall on football  or game days) the frustration i fell when placing, paying for, and receiving my order overpowers the deliciousness of their wings. still, because this location is so conveniently located in the atlantic center, it's hard not to order my usual lemon pepper wings and small bucket of fries.", "author": "Dianne R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-05", "description": "My experiences here have always been good.  The food is good, the wings are meaty and tasty and the drinks are great!  They have a decent selection of beers on tap and my favorite, Stone IPA !   The downside is it gets very crowded on weekend with an obnoxious crowd and the bathroom doors on the stalls in the ladies room are always broken off...but as far as the food/drinks.. very good.", "author": "Dee .."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-07-31", "description": "Customer service at the take-out counter leaves a lot to be desired. How do you only set out 2 chairs for waiting customers when it's at least a 15 minute wait for a take-out order!!!", "author": "Chanel A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-12-13", "description": "A friend and I went here last Wednesday. As an appetizer I ordered Buffalo wings and my friend ordered the Thai wings (which was a favorite of our waiter) and French fries. My wings were \"so so\" but my friend was really under whelmed. My friend expressed his lack of satisfaction for the wings which were our waiters \"favorite\" and the waiter wasn't even kind enough to change the order or take it off our bill. For my entrée I had bacon cheese burger w/ potato wedges. The burger was \"A-OK\" but the potato wedges was \"AS GOOD AS IT GETS\". My friend also was shocked that our waiter served him a rum and coke in a 6 oz. glass. HMMM. I'm not to sure if I would recommend this location to a friend.", "author": "lee a."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-02-13", "description": "Waited 3 hours for a big table for 14 just to realize that they have 2 separate tables of 7. I could accomplish so much within 3 hours of waiting. One of the waitress was giving my table an attitude, simply asked for a refill on Sprite...never came back with it and talked to us as if it never happened with a bad attitude. Cannot believe one cup of beer would cost me $7.25 and the prices weren't exactly on the menu. Nothing special about a cup of Guiness and a Hard Cider going for $7.25 a cup while everywhere else is about $5 tops. $.60 per wing, it better make me feel young because Croxley Ales wings are only $.10- $.20 per wing so they have some competition. In terms of flavor the chicken wing is just all pure sauce, its the sauce that makes you get sick of eating the wings as time goes by. They definitely drenched the chicken wings in sauce only for quite some time. Blazin' hot wings wasn't that hot, probably wouldn't come back again overall. Not after that 3 hour long wait...", "author": "Royce C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2008-05-30", "description": "Went on a Friday night around 7 pm and it wasn't too busy from what I could tell so we were promptly seated and attended to. I had been jonesing for a big plate of wings for a couple of weeks and not being a local resident I figured this would be the best bet considering that I hadn't done any serious wing research before my trip. I wasn't there to eat a sandwich or give a single french fry any real estate in my tummy. I was here to conduct serious wingness and no other item on the menu would come between me and my mission.\n\nOur server was pretty good and she came back to our table a couple of times after we got our dishes. I got the plain wings with a side of hot bbq sauce because I have a hard time with committing to a sauce. It proved to be a good idea because the hotter sauces might not be a good idea when you're trying to scarf down a huge plate of wings and don't have the tolerance for constant hotness.\n\nAfter 18 wings I was picking off whatever strands of chicken I may have missed in my frenzy. The flavor was about average and the wings were a good proportion. I've had some pretty sickly looking wings before and these were in good shape. Goes great with a wheat beer too.\n\nThis is a good place to go if you just want some quick and delicious wings. The variety of sauces makes it even better.", "author": "Raphael D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-11-10", "description": "I went on Saturday November,10,2012,I went to get some wings to take out,they told me my wait would be 20minutes ,so I decided to go to the bar ,ordered me a jack and coke,I really liked the way the bartender made my drink so I decided,I wanted to be seated near the bar in these high tables,I ask one of the gentleman in black can I just sit ,he told me no,I needed to be seated,so I went over to the girl who was sitting people and ask can I sit in the high tables and wait on my order and have some drinks she told me no,the tables was only for people who order in ,and she said I can wait over by the bar,which I didn't want to do,that's why I ask can I sit in the high tables,then another girl came over to me who worked there she  told me I couldn t be aide the tables belong to the waiters and if I got a drink from the bar most people don't tip the waiters be aide I already got the drink from the bar,so I just said ok ,with my eyes crossed and a little annoyed,I stayed there for three more drinks,I had got my order from the check out desk and watched college football while drinking and by the way I tipped the bartender for each drink I had,because that's how I roll,I ate my honey barbecue wings at home they wasn't that good,the wings was tough,and the honey barbecue sauce wasn't that good,,I will go back for a drunk because they was good and not watered down ,", "author": "Monique B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-08-15", "description": "I really am not a fan of this place...but my kid loves the honey bbq wings and they have great beer options on tap. Extra star because it's a fun place to bring the kiddies.", "author": "Shani W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2008-09-06", "description": "Please stay away from this chain nightmare. \nIt's expensive and nothing special. \nIf you order anything you must pay additional for sides. Want a sandwich? get ready to pay more for fries or celery or even more for additional sauces. Be prepared to wait an eternity for your mediocre wings because even though this place may be packed to the gills you'd never know it by the amount of staff working. \n\nIt's supposed to be all about the wings here but they're not very crispy or very fresh. Go someplace local and don't support this place. It should have closed long ago.", "author": "Michael A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-05-14", "description": "Its a Nice Sporty environment. Good to watch thE Games -Televisions All over. Good specials Also.. but make sure when you order something that's part of the special double Check. I was Told something was part of Happy Hour but when I got the Bill it showed something totally different. Beverages came at a timely fashioN but food took some time and waiter was no where to be found. Food was ok- boneless wings white meat which I love but just a bit too much breadcrumbs. I Rather Atomic Wings!", "author": "Lucy R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-02-22", "description": "Pretty good place to eat and affordable.  Lots of big screens and friendly atmosphere.  Realized after my visit it is more of a chain restaurant feel.", "author": "Siobhan O."}], "servesCuisine": "American (Traditional)", "priceRange": "$11-30", "name": "Buffalo Wild Wings", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "139 Flatbush Ave", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/ENoWKg2ScYUtSOPF-xpcJA/ls.jpg", "@type": "Restaurant", "telephone": "+17189439453"}