{"aggregateRating": {"reviewCount": 573, "@type": "AggregateRating", "ratingValue": 2.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-15", "description": "Love the wings, and its a nice place to watch any game they have TVs all over the place.", "author": "Anna F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-10", "description": "It's a mixed bag at Bee Dubz. The games are always on, all the important ones at least. The service is always friendly, not necessarily speedy, but then again I do always make a point of telling the servers I'll be here for a while. The food's good. Not too pricy, especially given the area. I've been here between 7-10 times and the service was only ever lacking once. I can forgive and forget, especially with a beer and the game in front of me. Overall, I recommend it because the food's good and they are guaranteed to be airing your game.", "author": "Max G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-13", "description": "14 different varieties of wing sauces and around 50 beers to choose from along with a plethora of flat screen tvs and a game almost always on, BWW is the place to go if you are a sports fan.\n\nI highly recommend coming on Tuesdays or Thursdays for wing specials.  Or during happy hour.\n\nWhile the restaurant is kid friendly, I recommend leaving the kids at home, restaurant is too dimly lit and the place is too packed for them.", "author": "Justin W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-02", "description": "The best attraction about this place is the beer selection (23) and the Happy Hour prices, especially for its location. Best place to sit is at the bar, where the bartenders are cool and if you order food, you'll get your order quicker. \n\nAs for the food, it is basic sports bar fare - stick with the wings, potato wedges, etc., as it is not 5-star dining here. However it is a good spot to catch the game (they show several Football Games) on the big screen if you catch a bar stool early - nice place also to kick butt at trivia!", "author": "Leonard P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-05-29", "description": "I tend to eat pretty clean, so this place wrecked me with the fried food lol.  Its not fancy and everything is served in plastic baskets with wax paper.  Service was friendly and quick and there are alot of choices for sauces on the wings.  We got the tailgate sampler which was unique with soft pretzels.  Cant beat this place for a game day seating.\n\nOn a separate note, I had to laugh at the reviewer who was upset about the Fried Pickles being misleading....haha seriously did the heading \"Fried Pickles\" not clue you in???", "author": "Kristin G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-12-17", "description": "First time going there and the bartender was horrible.  She never once asked me if I wanted a drink or even bothered to offer one. Gave me a menu, but then took it away before asking me if I was ready to order. I had to get her attention to order a drink. Apparently her texting was more important than taking care of her guests", "author": "Todd Y."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-09", "description": "Its BWW!!!!\n\nGreat spot. Seated quickly, typical BWW food, great national prices for an NY restaurant. Server was good, nothing amazing, but not disappointed. Would come back.", "author": "Noah K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-29", "description": "I come here every Friday/Saturday to eat in and Most tues and Thur i get either the 50 cent traditional wing Special (Tues) or the 60 cent boneless special (Thurs). Cool place to chill and hang out and not so heavy on the pockets. I can say the Male waiters are better than the female Waitress, and Takeout is pretty quick and efficient", "author": "Tissy R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-04-24", "description": "Meh. I wouldn't normally hang out at his spot like this since it's loud and quite like an Applebee's with the bar. But there are plenty of large TVs for watching sports events. The beer on tap isn't that great. But if you like your run-of-the-mill beer like Heineken and Coors light then this spot has it covered. I sat at the bar...which was quite dirty and disgusting despite the fact that it was an hour before happy hour and far less than busy. But other than that the service was average.", "author": "Melane M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-29", "description": "There was an hour wait time when we ate here. The food is delicious; so maybe the wait was worth it? Our waiter was friendly, knowledgeable and efficient. The atmosphere is definitely a bar type setting (loud and can get a little bit rowdy). They are open late which is great for the weekends. There are TVs everywhere so you're pretty much guaranteed to be able to see your preferred game. You also have a great view to the new Barclays Center which is located across the street.", "author": "Kimberly G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-03-18", "description": "Here's a story of how two people were in Buffalo Wild Wings, so I like to take a minute so sit right there on how were never going back... I went to Buffalo Wild Wings on a hockey game night with my sibling. We sat in the section that's next to the bar. Our server came to us and didn't bring us our menus then she realized we didn't have one also came back later with utensils after the same realization. We ordered our food , as time carried on we noticed every table around us was getting there food. A table next to us, who came fifteen minutes after we did, received their food before us. Wondering did they accidentally give them our food to another table? Half hour in, we still didn't receive anything and I finally asked our waitress \"how much longer\"? becoming frustrated. Forty five minutes later the manager comes with our food and just says it's free without any explanation or even a sincerely apology like \" sorry, what happened was...\" then leaves our table . Our food tasted like it was sitting in the kitchen for a while and the fries were cold also our order was slightly wrong . My sibling was disgusted that they no longer touched the food. The manager of this restaurant , brought us our food and didn't even bring us extra napkins or the paper bowls or ketchup . I had to eat my food on a napkin, yes a napkin, the one that comes wrapped in the utensils . We felt very disrespected and we come here often. It was a shame how we were treated. Our waitress was to busy flirting with the groups of guys adjacent to us and to the table behind us , whom she seem to know personally. She apologized but she whispered it as she was walking away to the other table . She gave no explanation and her apology didn't seem sincere .We didn't go there looking for free food , it's about respect. I decided to opinionated my voice to the manager so he could acknowledge how he treated us because he couldn't even confront his own mistake unless it was bought up. He apologized but no explanation. He gave coupons in the end but it wasn't about the coupons. The manager lacked in many areas and the whole place needs to have better management and staff members. If I'm paying for a service, it should be expected and meet standards. Who wouldn't do the same? .The manager couldn't show the proper form so I'm not surprise why the waitress couldn't do her job. She seems like a nice person but she lacks in the area of customer service. If this scenario was vice versus , the manager and waitress would be equally frustrated with the service. Sadly they lost a customer.", "author": "Ann M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-12-29", "description": "I am a beloved wing lover \u0026 to my disgust I was charged a measly .50 cents extra for sauce? Really! I mean we all are aware when we eat out we expect to pay more than cooking at home, no need to explain business or math in my posting. It isn't about the monies but they had very little sauce on the wings not to mention no where in menu did I see that sauce for your meal was extra. So it is only a dollar but how petty is it to charge for sauces. Most places now try to nickel \u0026 dime. Granted supply cost may go up but this location is always busy because of the foot traffic so I highly doubt that they are in the red for a fiscal year. I have gone to regular bars \u0026 don't have an extra cost for sauce. One staff member said if it is like 5 pieces it is free but if over that then they charge you. So why not just buy a 5 piece then order larger for the other \u0026 use the free sauce. Obviously this company is making a profit. Seems funny how you get free refills which is perhaps more cost efficient because it is from a fountain \u0026 tends to be more syrup with plenty of ice of course. Most places do this to make it seem more bang for the buck. Ok, I'm sure people will say it's only $0.50 but if you have a large group or like today where it is full because of football games \u0026 go with a group spending hours it will add up, like having a hidden fee. Like establishments that charge you a minimum percentage for the size of your group. That is always amusing, I go with a larger group, obviously more cash to spend per person, but placed a minimum tip percentage? Why not go with friends to get split up to avoid such a ridiculous hidden agenda. By no means I am this way because I am frugal, my friends think I over tip, but I am just annoyed how some places want only money but seldom show concern for a customer or have ways to get more money out of people when some have a limited budget for a night out \u0026 just want to enjoy a day out. I'm sure people can relate with families like when you attend sporting events. Profit margins or price gauging? One has to decide.\nAlso twice I mentioned to my waiter I wanted to order \u0026 he just took my beverage order \u0026 walked away. \nOn another note you can't make reservations either which I'm surprised for such a large business chain. \nIf you go perhaps get it to go \u0026 bring your own sauce or save cash buying their bottle of sauce \u0026 serve yourself with it, either way they'll be happy they made a profit one way or another.", "author": "Ray F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-06-21", "description": "Love love love the wings here, but the service is horrible. They often forget to give you celery and carrots, and sometimes even the bleu cheese. If you order for take out, make sure you check your order before leaving. The staff is a bunch of college kids with short term memory. Make sure your order is complete before leaving and getting short changed.", "author": "Mi Gusta B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-01", "description": "The wing are good and a great place for a pre game beer. Service is fast on game days . Don't get their just before the game starts and expect to get food quickly.", "author": "Brian H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2007-09-12", "description": "I was there on opening week.  It was AMAZING.  No lie.  Abundance of fresh new Flat-Screens showing all types of sports.  Happy, bubbly hosts, hostesses, waiters, and waitresses.  Constant wiping down of tables, chairs, and even pictures by the bussers.  Bartenders churning out drinks at rapid pace.  Maximum Service Level.  Food coming out on time (and not sitting around under the heat-lamp).  I was happy to be there.  \n\nThen, everyone realized that it was F'ing Atlantic Center, and it can never house anything fun and/or special, and that it makes everything less than mediocre and unpleasant.\n\nI've been back about three times, now, a few times during lunch hours and once with a friend to catch a Mariners game.\n\nThe wings basically remain solid.  The sauces are, well, mass produced to perfection, so that is also solid (and admittedly very good).\n\nBut when it comes to service and atmosphere . . . well, sorry to remind you (and to repeat myself), but it's Mofo'ing Atlantic Center.\n\nTwice my friend tried to get salt  with her Margarita.  Both times it came without salt.  \n\nMy friend ordered Cheese (she's a veggie muncher) Quesadillas.  The dude brought her Chicken Qs.  \n\nYou have to keep asking for water and napkins.\n\nIt's either too hot or too cold in there.\n\nOn a random Friday afternoon, they had us wait for 10 minutes - man, I just had to have me some wings, man! - for seats, even though half the place was empty.\n\nBasically, they are understaffed and uncaring.  \"Skip it,\" would be the correct response to all this, but I have to admit a certain magnetism that pulls me back to BWW . . . I mean, where else in Brooklyn can you go and enjoy multitudes of large Flat-Screens and eat yourself some wings, and act like you're back in the 'Burbs for a few hours?", "author": "Arthur O."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-01-26", "description": "I have one rule in life: When your fat friend asks you to eat in a hot wings chain restaurant located in a shopping complex that you consider to be the nexus of all evil and you don't even particularly care for wings and are basically kind of a pussy when it comes to spiciness, you say \"yes.\" This rule has seen me through many difficult times in life, such as that time my fat friend asked me to go to the Buffalo Wild Wings in Atlantic Center with him basically because he is a big gross pig who also smells. And if nothing else, I am someone who stands by his friends. Particularly the fat ones, because geographically speaking, it's difficult to find land to stand on that ISN'T directly by them! HAR!\n\nAnyway. I've had some longstanding bones to pick with this Buffalo Wild Wings--even beyond my usual hatred of everything Atlantic Center--not least of which was their 40-cent wing special a while back culminating in a rowdy, buffalo-sauce-fueled teenager shooting another rowdy, buffalo-sauce-fueled teenager right outside my window. (He only got winged [see what I did there] in the leg, by the way, so he lived, not that this presented much comfort to the crying mother, who, between sobs, could be heard blurting out grim ironies like \"But he just got shot two weeks ago!\")\n\nThe worst part? 40-cent wings is seriously not even that great of a deal. \n\nDespite it all, I tried to keep an open mind as we strolled into BWW, but the deck was further stacked by the stale-smelling dankness that immediately greeted us, alongside the unshakable sense that nothing would ever be okay again. The walls are of course dotted with many more TVs than sports or sporting organizations exist in the world, all the better to prompt patrons to drown their sorrows and/or celebrate with overpriced beer and fried chicken limbs in accordance with the most recent performance of their favorite sports team that of course doesn't care about them and doesn't truly affect their lives in any measurable way. \"I have a question; is there any way we could watch sports here?\" quipped my friend, to our hostess. To her credit, she chuckled.\n\nAs we pried open our sporadically sticky Menus of Death and Phoned-In Wordplay we swiftly realized they were entirely unnecessary; where if not a wings place could you not easily guess 95% of the menu? In a surprise twist we ended up going with...the wings--me, being uncharacteristically adventurous with medium; my friend, an entity that survives entirely on syrups- and tabasco-based foods, went \"crazy hot,\" or whatever purportedly fun thing it was called. As we waited for our food I entertained myself by trying to think of ways that could actually make this dump even worse, settling on placing it in a giant coffin filled with spiders instead of a mall or suddenly transporting me to a nightmarish parallel reality wherein I was the chicken and THOSE WERE MY WINGS. \n\nBut then our food arrived, and here's where the real twist came: As I tentatively bit into my gelatinous, sickly orange-brown pieces of bird that just never imagined things would end this way, I discovered it was...not bad. I certainly was not unhappy to be eating them, at any rate, with the medium hotness being at just about the ideal level of a-little-too-spicy, and of course my rotund friend who approves of just about any food so long as it's not too foreign and doesn't have a whiff of vegetable anywhere near it began breathing in that special labored way that I've come to realize means he's enjoying himself. Maybe it's my lack of experience with wings talking, but they seem like something pretty difficult to fuck up. Sure, you could come up with better ones, but you'd really have to work hard to birth something well and truly awful.\n\nNaturally, you could perhaps pick a sunnier place to eat wings than a soulless franchise sports bar located in what has to be in contention for the worst shopping center in America. But then, there's always a certain rueful comfort in embracing such sadness, even reveling in it. Eating here is a celebration of failure held at a funeral for ambition. It's every time you gave up on a dream but realized you were relieved to have it gone; it is CONSUMING the day you woke up and thought, Well, why can't my workout pants be my everyday pants? This is America after all, and if you can't accept and appreciate joyless mediocrity franchised to the point of numbness, well, maybe you should go live somewhere else, pinko. Carpe tristitia, my friend. Seize the sadness. \n\nSo congratulations, BWW, for clearing the negative-hurdle of my unimaginably low expectations. It is both depressing and comforting that I'm sure I'll be seeing you again.", "author": "Galvin C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-01-15", "description": "If I could give zero stars I totally would. Went there 1/14/16, arrived around 10pm. We had about a five minute wait since we arrived. The waitress was a mess from the beginning and we haven't even met her yet. The host guy at the front was nice enough to seat is but I don't think it was his job. The waitress doesn't come to our table for a good 10 minutes. She finally breezes by us and goes \"I'll be with you in a few minutes.\" Like really, it's waiting on top of waiting but fine, it's cool. She comes over and takes our order. We ordered the Parmesan cheese wings, wild, the ghost pepper one I believe it's called, and the lemon butter I think was the name and their beer battered onion rings. I specifically told her I'd like some extra celery please when she initially took our order. So the food arrival time wasn't so bad actually, and the food was very delicious. The hottest wings they have are super spicy so becareful! You would think your waitress would be attentive to you, knowing to keep an eye on your beverage levels since you're consuming very spicy food. Nope none of that. Oh and she forgot my celery. She passed by us and we were like can we get some more water and napkins and celery. She comes by with our water and napkins and just leaves! So we are nearly done with all our food but I think had about 5-6 wings left, and my boy was just thinking if we should take it to go but he decided to finish it. This wonderful waitress comes by to check on us and goes \"is there anything else I can do?\" And I'm like... MY CELERY! She doesn't even apologize or anything, she just grunts loud and says \"JESUS CHRIST!\" And walks away. Yeah, real smart to bring FOUR celery sticks for 60cents AT THE END OF OUR MEAL. And I just wanna put it out there, before we were seated at our table, we found the previous people's receipt, funny how they didn't tip her. Even funnier that she didn't notice they paid up. And believe me, I am a tipper. I believe in it, I support it 100% and I understand it. But if you deliver exceptional service, you deserve an exceptional tip. I didn't tip nothing just like the previous party at our table. This waitress was obviously doing things wrong and not even acknowledging or correcting it. I wouldn't come back here, rather get wings elsewhere should I want some. It's just a very loud and obnoxious place.", "author": "M H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-02", "description": "I came to Buffalo Wild Wings after not finding a restaurant open late enough on a Thursday night. So I was glad Buffalo Wild Wings was open late. They have an okay beer selection to choose from and awesome wings and flavors for a great price. Everyone was friendly and helpful. There was not enough variety showing on the televisions, only sports, sports and more sports, they could of put a music video on or two. Also the women's bathroom needed toilet paper.", "author": "Franchesca G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-09-17", "description": "First of all I have to say that I am not a fan of sports bars, and this sure is what one would call a sports bar... being it has more TVs playing sports than happy customers in a McDonalds restaurant...  But as the name says it, it was the wings, and the wings only I was there for. \n\nFirstly, it was a fruitful trip to the Atlantic Target that brought me here, and saw the dark doors and went in. The seating is normal I guess, but if you get a seat near a TV, get one of the game consoles that they have, and you can play trivia whilst you wait for the wings to fly out of the kitchen..\n\nTo the wings, great selection, not that they were the best wings in the world, very far from it, but they were good for the price and where they were served... The one thing that I was not happy with this place, is the Vodka I got, was a light pour...", "author": "Mischa A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-16", "description": "I'm a glutton and I love fancy and un-fancy food alike. So when I told my husband to take me here for my birthday, I meant it...unironically. It was insanely busy, but the average wait was less than pretty much any other Brooklyn hipster joint on a Friday night. The waitress was genuinely friendly and even let us sample some beer that turned out to be really great. \n\nWe gorged ourselves on all kinds of boneless wings. You can't go wrong with the classic buffalo sauce. We got 4 types of wings, a side of mac, fries, 2 giant beers and it came to less than $55. Try getting that in Park Slope or Fort Greene outside of an Atomic Wings.", "author": "M M."}], "servesCuisine": "American (Traditional)", "priceRange": "$11-30", "name": "Buffalo Wild Wings", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "139 Flatbush Ave", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/ENoWKg2ScYUtSOPF-xpcJA/ls.jpg", "@type": "Restaurant", "telephone": "+17189439453"}