{"aggregateRating": {"reviewCount": 573, "@type": "AggregateRating", "ratingValue": 2.5}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-21", "description": "They took three hours to fulfill a small order, and called me three times asking me what the order was. My delivery driver had to wait there for two hours while they ignored my order.", "author": "Daniel S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-29", "description": "I love wings so I definitely love this place! It's always very crowded and it takes forever to either get a seat or for a waiter to come to you. On Tuesdays the wings are only 50-70cents so it's really worth it. I love the variety of sauces, the sliders and burgers. Can't complain about the food. The service is okay. It's just always packed so definitely plan ahead to avoid the wait.", "author": "Winnie L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-18", "description": "If you like mediocre wings, and really lousy service, then this place is for you. This dump will more-than-adequately fulfill your need to be ignored and disrespected. And nobody dries out wings better than this joint. I gave them 1 star because I liked the honey mustard sauce that came with the mini hot dogs, which were ridiculously greasy.", "author": "Michael D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-30", "description": "Horrible! Most nastiest and driest chicken ever. I ordered spinach dip and the dip looked microwave. And then I order over 20 pieces of boneless wings, and they were all drier than sand. I asked the waiter if my food was microwave because it tasted sooooooo bad! I will never go to a BBW ever again!", "author": "Josephine C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-09-16", "description": "All I have to say is, if you're ordering out/to-go, COUNT YOUR WINGS!! \nIf you're anyone like me, I can eat every last piece of a large order of traditional wings, especially since they keep reducing the amount you get per order. Majority of the time, I don't like to dine in but rather order to-go and relax in front of the tv while enjoying my wings. The only downside to ordering out, is finding out that there's a part of your order that's completely wrong or altogether missing. \nOn a couple of occasions prior to today, I've ordered to-go and it hasn't yet failed that there's always something missing. Whether it's the sauce, or a side order, potentially even a whole order. Tonight was no different but because of those past annoying experience where I got home and noticed something was missing, I made sure to check my order before leaving and made sure to do it in front of the associates there.  \nI ordered 2 large orders of traditional wings, a basket of onion rings, and a kid's mac order. Although the flavors I selected should not really matter, I was informed a large order consisted of 18 wings (it used to be 20 not too long ago). My orders were separated into 4 boxes with 7 wings in each of them. Even without doing any math, the content of each box looked like something was missing so I made sure to open each box and count each wing and had two of their associates count with me. \nI shouldn't have had to explain anything but I had to break the math down to them. Where are my missing 8 wings!? Not one or two, eight of them!!! Now everyone looks dumbfounded. Yes I want them and especially because I tipped! Who even tips the associates who work at the take out counter!? I guess I do and still they tried to get away with a whole small order of wings. \nWhen I asked to speak to a manager, this 35-40 years old looking Caucasian male comes out and apologizes but his exact words were \"was everything fixed for you? This happens quite a lot.\" Blank stare.. I was in no mood to mirror his asshole attitude. \n2 stars because I do enjoy the food but i won't miss it if I decide to not order from there anymore.", "author": "Fanja S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-18", "description": "BWW has one job. Make good wings. If they could even make just decent wings I'd be happy, but they serve old, hard, sauceless wings every damn time. Why the management and cooks here are so incapable is beyond me. It wasn't just my order either, every single person around me had similar issues. The restrooms were also just as disgusting. No toilet paper in the women's restroom? Get your shit together. I just feel bad for the employees, like our wonderful bartender, who will lose business due to the simple mistakes made repeatedly by the management team.", "author": "Alyssa S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-08-13", "description": "Came to this location for a quick order of wings and maybe a drink or two. \n\nSo many issues upon arrival. \n\nThe female host named Princess at the front desk didn't the common courtesy to greet us. I said hello and she looked at me as if I was bothering her. \n\nA guy came to me (and the people I was with) and said to sit at the bar because there was a 10 minute wait on a table. \n\nSo we go to the bar but on the way, couldn't helped noticing that every table was available. \n\nTo top of all off, there was only one bartender Jeremiah. Poor, poor Jeremiah. Overworked but still kept a smile on his face and tried his best to handle his responsibilities. He was so swamped he kept forgetting to come back to us.\n\nThere was no one helping him. I'm surprised that management didn't step in as an extra helping hand. The food took so long. And the place is empty.  \n\nBut anyway they brought me the wrong wings. I almost died from the heat these wings had. I just wanted honey bbq \u0026 mild. \n\nI won't ever come to this place again. Well, not this location. \n\nThe manager/cook/take out clerk was very helpful as well.\n\nJeremiah gave us coronas to easy the pain but it didn't work fully. Lol \nDon't come here people! They don't have enough staff for you.  even on a Saturday", "author": "Rica P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-28", "description": "Those 1/2 off chicken wings on Tuesday were good! I thought the Caribbean Jerk and  Parmesan Garlic sauces were tasty. The Hot Sauce and Sweet BBQ sauces were alright. The Spinach Artichoke Dip was good too, which I underestimated. I don't think the venue has the best vibe compared to the one in Manhattan on 47th. The one on 47th is brighter, bigger and cleaner. It's nicely decorated and has huge tvs hanging all over the place. The one on Atlantic got really crowded (because it's 1/2 off Tues) and the place is slightly dark. I'm usually not into chain restaurants but the food is decent when you're hungry! The waiter was attentive and friendly. We didn't even have to wait more than a minute and got a table because we were a group.", "author": "Wendy C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-11-01", "description": "Worst customer service from any Buffalo Wild Wings I've ever been. Online ordering is a waste of time they will make you wait regardless if your order should be ready or not. I gave this place a second try after waiting after the pickup time and it was so slow I was so angry that I asked for a refund. Wasted my time (20 additional minutes) while I was on my lunch break. I asked for a refund and they took so long to do so as well that my food finally came out. Prob won't come here again also because it reeks of sweaty smelly guys and beer", "author": "Wendy L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-28", "description": "Tonight when my family and I went to this location we had a server named Chelsea who never took our order asked us what we were having. My boyfriend was the only one who did not have an ID but my other family members in our party showed ours. She walked away from the table and approximately 10 min later came back with the manager. We were all confused and wondered why. The manager informs us that he was told that we refused to show an ID which was entirely false. My family and I were deeply disappointed at the fact one her disposition was not welcoming from the moment we entered. 2 she lied to her manager where not only did we cooperate fully but we weren't disrespectful. I will never go back to his location ever again. We never ordered anything and I am saddened that someone like this would even be allowed to work at this establishment. I am a hard working woman and all I wanted to do was enjoy some family time but due to the way this was handled, I will never return again. Hospitality is a key component to keeping a guest happy and not once did she exhibit that.", "author": "Tia T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-04-19", "description": "Ok so I love BWW!!! And I live in Brooklyn! My only location is the one in the Barclay center! Cuz the others you can only get to by car or bus! I keep coming here because I LOVE LOVE LOVE the beer battered onion rings. Just love! Like I dream about them! Soooooo amazing! But that's all they got going. \n\nThe service here is horrible! Terrible! No one ever greets us, they act like we burdened them by coming in! Only once were we treated kindly by the hostess! Other than one time it's pretty much been like \"why are you here!?\" Attitude!!! \n \nNow the wings! This place is called Buffalo Wild Wings! The wings aren't amazing. I've had better at small businesses that are local. But that's just me. For example my husband enjoys the habanero boneless beyond any he's ever had. I however do not like spicy food so I can't vouch for it.\n\nBut because I wasn't a fan of the wings on one of those visits I decided to order a burger. Let's just say the wings are great compared to their burgers and I'm not even a fan of those wings. So it can be worse. \n\nI honestly thought of giving two stars. But I keep coming back for those onion rings and my husband for the habanero wings. So that must mean we really like it enough to continue to go. So it can't be that awful! Get the onion rings if you haven't! They're the best!", "author": "Erica R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-28", "description": "I don't usually do reviews for chain restaurants but my boyfriend and I came here earlier today and we had a waitress named Sarah who was extremely attentive, nice, and friendly. I could tell she was swamped but she remained helpful and pleasant to us, and the customers around us. Shoutouts to Sarah!\nBesides that this place gets crowded, loud, and service gets hella slow. Don't come here if you're starving. (But of course, Sarah kept coming to check on us and assure us that our order were on their way, again, shout out to Sarah).", "author": "Sahara J."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-12-05", "description": "We had to run from our table twice due to a violent brawl that drew 6 police officers to the scene. \n\nOne member of the multi-man altercation repeatedly went in and out of the kitchen unchallenged.\n\n Nothing on our bill was comped. I know it's not the Ritz, but come on! Choose elsewhere for watching the game.", "author": "Sam H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-03", "description": "Went here on Tuesday for the half off wings, and they said to wait about half an hour and we only had to wait 20 minutes. The servers were nice and the wings were good, a little bit too saucy though. The tenders and fries are amazing.", "author": "Emily L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-02-22", "description": "I love buffalo wild wing especially when it first came out but this place is just pure trash. This is my favorite word to use because it is definitely dirty. The table are always sticky and wet. The floors always have papers and trash on it where you need to sit. The wait is extremely long on the weekends. My last server basically hated life. My sister asked him how many jumbo shrimp came in the basket and with the dullest response he said \" I have no clue\" and it ended there. He didn't even try to find out like a decent waiter would. He didn't bring us any waters, utensils, napkins or basic eating needs. He just didn't care about anything. The wings here are dry like you're swallowing sand and it hurts while going down. it is so unpleasant because they are cheap with their sauce. The carrots and celery ,which they give one of each even if you have a hundred wings, are old and ashy(like always) and the overall visit is just a big regret every time. Go to any other wild wings but this one.", "author": "Racquel N."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-10-24", "description": "The place is nice, still well maintained considering the neighborhood is in transition through the gentrification, the staff is nice, wait time for low setting tables is long on weekends. Wait time for food is kind of long. \n\nIt's a decent bang for the buck, don't expect nothing more than a semi fast food restaurant.", "author": "Ameenii M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-09-19", "description": "Had a good time here, the only issue I had was the label on the order was all pasted right next to each other thereby confusing the flavors of the chicken. The food was really good. Out wait staff at first looked very tired and not interested in being at work. When asked why the sad/uninterested demeanor \"\" she stated I go to school full time and work full time and I don't have the energy\"\". It's now 1210 am on Friday night and here with friends after a long day at work and trying to keep a positive vibe. Three star for the food only.", "author": "Naresh S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-02-16", "description": "The food is decent. The hostess was rude as hell... after having just one watered down mixed drink at the bar \u0026 a burger... total of 21 dollars.... I left a 6 dollar tip (in cash)... I get home and see that the Asian bartender not only received my cash tip but helped himself to charge it on my card as well. \n\nYou live and you learn. It was better than being at ghetto ass applebees next door but I will make sure to pay in cash next time", "author": "O F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-11-03", "description": "I took my son for a cool little hangout to eat some wings but I do not eat meat but he is definitely a major meat eater.  When we entered the restaurant there were several tables that were not cleaned as of yet and we were sat next to one that wasn't in a corner that didn't have a great smell it could have been the diner next to me though.  I had the Mediterranean salad which was a mistake the lettuce was a bit wilted and at first it came out with pita chips and I had to point that out to the server.  Albeit 'tis is not a fancy place but it could have been a bit cleaner (tables) and for those non meat eaters they could incorporate a few dishes other than salads and or a bean burger.  Not impressed but my son was happy with his wings.", "author": "Lisa P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-30", "description": "The wings were really good and well marinated, I got the small boneless wings with Caribbean jerk sauce. And it was too salty, it had an odd taste I didn't really like it. I also got the small traditional wings with medium sauce \u0026 mango habanero sauce, the medium sauce was really good and it had a little spice to it and the mango habanero was delicious! It balanced out the taste. And I recommend you to get the traditional wings than the boneless because the size wise was bigger and tastier and it was 2-3$ less. I would make a trip to go back to this place!", "author": "Luyin C."}], "servesCuisine": "American (Traditional)", "priceRange": "$11-30", "name": "Buffalo Wild Wings", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "139 Flatbush Ave", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/ENoWKg2ScYUtSOPF-xpcJA/ls.jpg", "@type": "Restaurant", "telephone": "+17189439453"}