{"aggregateRating": {"reviewCount": 573, "@type": "AggregateRating", "ratingValue": 2.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-19", "description": "It's not in the best hood ever, but I'm a sucker for cherry beer and habanero wings. Must be the midwest girl in me. Yummy.", "author": "Toni F."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-01-16", "description": "I don't like this place because every time I eat here, I get crappy service. Like always.\nThe wait is incredibly long sometimes , like 30 mins to 1 hr and 30 mins! like holly ****, i dont have to wait that long for dim sum and i gotta wait this long for wings!\n( maybe i'm just unlucky)\nThe service as i mention has been crappy too. Whenever we are missing something, say some napkins, or fork or straw or even our appetizers we must ask our waiter or waitress at least twice before we get what we want. I guess it's probably because it is busy but you know, i always assume that's why each waiter/waitress is assumed a certain  amount of tables in the same area.\nAlso, there was one time when i ordered a caesar salad and the plate that they gave it to me was cold, and i mean ice cold. The salad was rather cold too as if they literally took everything out from the frigde and dumped it onto a frozen plate and served it. I have never had a restaurant that served food on a cold plate, which really makes the food displeasing.\nIN ADDITION, whenever we order wings from here they occasionally mess up the order, not all the time, occasionally But you know, I dislike it when i'm not  in the mood for spicy wings and my teriyaki chicken wings get replaced with a hot wing that someone else ordered but eh.\n\nOn the bright side the food does taste pretty good, i meant the wings. The other meals such as ribs and fried shimp and burgers are a soso to me.", "author": "Susan L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-20", "description": "Great atmosphere, great staff and great food. I wish when it's busy for the wings specials (Tuesdays and Thursdays) that the service would be a little bit faster, but I cannot penalize a place of good service because it's busy. I do not think that is fair. Drinks come out made correct, and the food is prepared properly. The only thing about the wings is sometime you would have to specify extra wet if your a saucy kinda person. Other than that, no reason for a bad review.", "author": "Micah L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-03-01", "description": "My friend and I drove here as quickly as we could after our session at Brooklyn Boulders. As we first drove to the rock climbing warehouse, I raved about Bdubbs as it brought all sorts of nostalgia from my collegiate days in Ann Arbor, MI. \n\nUnfortunately, the Brooklyn branch could not deliver the experience I had longed for. First off, the wings were dry and bland. Nothing like the juicy and saucy goodness of other branches. Secondly, getting into this place after 10PM was a joke in of itself. You can't enter through the pick-up exit even though the main dining area is literally in front of you. Instead, you had to walk back out and go around to the main entrance of the Mall.\n\nIt felt like I had warped back in time as a contestant for Legends of the Hidden Temple except, instead of fake rocks and Mayan temples, I was surrounded by steel in a new-aged Acropolis. I narrowly escaped the shutting wheelchair accessible door, rolled down the antiqued escalators, took a leap of faith over treacherous Brooklyn sidewalk puddles, rolled under the FRONT entrance of the Atlantic Terminal Mall and skittered through the Bdubbs door before the timer sounded.\n\nIt was quite an adrenaline rush and I'm probably mis-remembering the whole event, but I know for sure I would rather fly to Michigan before I eat at this branch again.", "author": "Larry L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-01-25", "description": "Was craving for some BWW....and regretted picking this outlet! :(\n\nService was alright. Waiter did not check on us...gave us the tortilla appetizer without napkins. Hostesses/waitresses a bunch of high school dropouts?!?! It was 3 in the afternoon and the waiter/waitresses are sitting down with tattooed customers!?! And when I went to the bathroom to wash my hands...the high school waitresses were hiding in there talking.\n\nTip-bits:\n\nDon't bother coming.", "author": "Florence Y."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-23", "description": "Two words. Dry Rub.\nDesert Heat and Chipotle BBQ rubs I now swear by!!\n\nNow Im not usually for these chain restaurants... Id much rather a smaller bar who has their own 'secret' rubs and crap like that making wings somewhat unique... but man, do I ever get cravings for these wings!\n\nThe quality of the wings themselves are pretty good! Definitely better than other chain restaurants Ive been to. I also highly recommend their soft baked pretzel appetizer... just be careful! They fill you up and you cannot stop eating them!! (Thankfully only a few per order) \n\nSo if you are just looking for a night out with some delish wings and some beer and fun appetizers to watch the game... this is a great place. \n\nThe size of the restaurant is decent, with a range of seating... from booths to bar stools and tables... but dont worry, its not possible to be in a seat where you cannot see at least ONE screen or TV playing some sort of sports game going on somewhere in the world!\n\nMy only con for this place is the staff. Its a hit or miss... sometimes we get friendly, helpful staff... and sometimes its like pulling teeth from a rebellious teenager... the last couple times we went... we got the pain in the @$$ teenager... not friendly... forgetful... and their manager should really tell them that a smile never hurt anyone. \n\nBut of course I'll be back for those delicious dry rubs!!", "author": "Kimber C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-27", "description": "Went there on wing Tuesday (idk what it's call) with a friend and the service was excellent. We had a nice waiter name Christopher who was really attentive to us. The food preparation was a little slow but worth the wait. I tried the potato wedges for the first time and I must say it was delicious!", "author": "Tamarra H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-13", "description": "The wings are good and served with different sauces or dry seasonings. Also French fries are highly recommended! It's close to the price of McDonald so definitely worth it. The funny thing is you have to bring your id to certify that you are 18 to take a seat there.", "author": "Kun Z."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-12-22", "description": "Seeing a show at Barclays? Do yourself a favor and never go here before a show ... Here's why: \n\nBefore attending a concert at Barclays Center in Brooklyn I attended BWW and was disappointed. We waited 40 minutes for a table, which was fine. It was very crowded and a lot of people were there because of the show at Barclays. The trouble started once we were seated. We put in beer orders with our server. Almost 30 minutes later he came to our table and told us that he was still waiting on the beer because they ran out of glasses. We decided to cancel the beers we ordered because we wanted to just eat and get out to enjoy the show, we didn't want to have to rush and drink them. We were served our food while he told us that he was unable to get the beers. After we were finished eating we asked for the check. Our server brought us a bill that included the beers so he had to go back and run through the bill again. When he was away getting us a second corrected bill we were finally served the 2 beers we ordered (a full hour later). We had them sent back because we wanted to be able to go to the show. We weren't even served water the whole time we were there.\n\nThis morning I checked my bank account and realized that the wrong bill was put through on my card for the amount of  $41.13 which is the bill I didn't sign because that included the price of the beer that we canceled our order on. \n\nThis has been a very bad experience, and seeing that we were charged $41.13 for a chicken sandwich and a blue cheese burger is really frustrating. I expect to be refunded the money on the beers that we canceled. \n\nI submitted the above to BWW Corporate via email. I really hope they respond and refund my money, and I also hope that they see this posted here as well.", "author": "Jason W."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-09-11", "description": "Ok where do I begin? This place used to be good a long time ago however customer service is greatly lacking. Now I speak mainly about the take out section when I say this. While there are a select few employees who are very nice the majority are plain rude and nasty! \n\nThey have one or two people taking orders at one time. Those people don't stay there either they are constantly going to the kitchen. The wait time just to order can take 15 minutes and calling in an order in advance is no better bc u still have to wait on the in store line. They need a better system in place. To make it worse if one does decide to call in an advanced order via telephone and the cashier they waited for didn't take your order they make u wait on yet another line!! \n\nTo add insult to injury the staff looks like they'd rather be anywhere but at work. They speak to u as if you're beneath them. They look at u with utter disdain. Nobody updates anyone on anything. The only time you see them smiling is when they're joking around with one another and the cursing in front of customers happens often. They joke around with each other while people are obviously pissed of with the wait time and no update whatsoever. \n\nThen after all the time u waited they may call your name once in an either regular tone (note the place is loud) or fast pace. God forbid u miss your name being called you're waiting until u can get the attention of an employee who cares enough to check for your order. I guess you need to be ghetto and loud to get respect in this place bc I'm neither and I get treated like shit.\n\nLastly they are very stingy with the blue cheese. God forbid u ask for an extra they suck their teeth. Some charge $.64 saying it's the policy others don't which pisses me off. Be consistent!!\n\nThe only reason for the second star is because I have sat at the bar on two occasions and the bartenders were great...then again they get tips the takeout counter ppl don't. \n\nI have a word of advice for u disgruntled employees: go back to school, if you're in school finish! Then find yourself a job you like!", "author": "Nichole R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-09-09", "description": "Terrible! I have been here for over 50 minutes for our food. It took 20 minutes to just get our waiter to come over and take our order. Even when we got the drinks my cup of water smelled strongly of bleach and also a table behind us had a hair in their drink. The food was wasn't terrible, but it tasted like something I could have gotten in the frozen aisle at the grocery store and not worth the  wait. Never again!", "author": "Danielle C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-04-19", "description": "Great wings! Staff is great and they have TV in almost every wall which is a plus for sports games. Large selection of beers and other adult beverages! This is my go to spot for football Sundays!", "author": "Dans N."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-02-16", "description": "The wings are good. That's the only reason I bother with this place, but I won't be going back again. We ordered to go, two medium orders of boneless wings for $14.29 each. The sign guarantees a minimum of 15 wings for the medium order. We got home and found 12 wings each in our medium orders. Over $1 per wing? Really? No. My boyfriend called to speak with the manager and request a portion of his money be refunded, since we got two small orders instead of two mediums. He was placed on hold for 30 minutes then hung up on. What kind of customer service is that? And as a result, we will never return. You can take your \"medium\" orders and place them where the sun doesn't shine.", "author": "Lindsay F."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-03-27", "description": "To be fair, the wings are very good, (I loved the Parmesan sauce) that gets the first star\n\nThe staff is outstanding, that should get them two additional stars, three stars would look like I am saying \"a-ok\" but I am not, so I can only give one star for the staff\n\nEverything else is week, if they want to be a sports bar they have to figure out how to make the sound system audible, even though it was really loud, it was impossible to hear the  sportscaster it came over so muffled\n\nThe burgers are small, thin, tasteless, the onion rings were nondescript,\n\nIf you are going out for wings and wings alone give it 4 stars, if you are going for a sports bar give it 1 star, if you are going for a burger, zero stars", "author": "Perris C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-01-03", "description": "Well, where should I start? I have frequent here a few times it is not a place for a romantic date. It's more of a hang out place for you and a group of friends. The atmosphere is loud and the food is not so great and the drinks are weak. They carry the games so you can catch the game and have a few beers. The wings aren't what they use to be either. Ugh for the time they take to make it should be better.", "author": "Kam w."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-04-09", "description": "4 STARS FOR HAPPY HOUR DRINKS SPECIAL\n3 STARS OVERALL\n\nI first started coming here with classmates to grab a drink  and relax every thursday. Turns out they have happy hour from 4-7pm every single day with every beer on tap available! Can someone say AWESOME! Blue Moon and Stella alll dayy. =]\n\nAnyways, we'd become such regulars that we got to know the bar staff and servers very well to the point where we could tell who was new and what we could come to expect  from our server. \n\nThe food here is good but the portion sizes are very disappointing. When they get busy the wait can also be very long but if you come here after school/work it isn't to crowded and the vibe is very relaxed. FYI the Asian Zing are their best wings hands down.", "author": "Rojé G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-12-16", "description": "I suppose if you're in the neighborhood before a game at the Barclay's.... no wait never mind. I suppose if you're near by and want wings...... no no no there are better options for that too. Oh, if you want a place to catch a bunch of games at one time..... nope, once again better options. I got it, if you eat wings which are sub par, drink water downed cocktails, watch games on poor quality televisions and pay too much for beer this is the place for YOU! The wings are nothing special, you can do better. They aren't awful, but that's about it. The drinks and beer prices suck and a place like this won't be giving you buy backs. The televisions had the games coming in at different times. You can watch what happened on one screen thirty seconds before another. I don't want to hear a crowd of people react to the same game I'm watching before I see what happens. The quality on some of the televisions was surprising shitty too. I would think a place like this would have high quality flat screens. There are plenty of places to hit up in Park Slope, Fort Greene and Prospect Heights before venturing over to the Barclays Center. I do suppose though this is the most child friendly place that is a real short distance to the arena however.", "author": "Mitch E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-02", "description": "You have to show ID to get in here which is stupid because they serve food. They act like it is a club or something. Anyway, my server Lauren was awesome. She knew the menu like the back of her hand and she was hilarious. The bartender was an aspiring comedian and he literally gave me a heart attack from laughing so hard. The food was delicious and we didn't even wait that long. Look for the drink specials its usually just beer but still cheap.", "author": "Carlesha O."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-30", "description": "I love this chain, but wish this location wouldn't over season/baste the wings! Otherwise all good!", "author": "Melissa C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-04-13", "description": "Meh.  Maybe the bar/alcoholic drinks are what brings people here, but if its the food I'm shocked because what I tasted was quite the disappointment. I've always passed by BWW in and out of Atlantic Terminal so I finally decided to give it a try. It was my first time and it will be my last. I ordered eight boneless wings to go. It took them over twenty minutes to fulfill the order. And then when I went to taste one, the wings were awful. The immediate thought that crossed my mind was that I spent good time and money on that place. What a waste.", "author": "Randi C."}], "servesCuisine": "American (Traditional)", "priceRange": "$11-30", "name": "Buffalo Wild Wings", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "139 Flatbush Ave", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/ENoWKg2ScYUtSOPF-xpcJA/ls.jpg", "@type": "Restaurant", "telephone": "+17189439453"}