{"aggregateRating": {"reviewCount": 573, "@type": "AggregateRating", "ratingValue": 2.5}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-03-07", "description": "Cramped up sitting arrangements, literally had a dude eating behind me and clashing elbows with me, but service was great. John great waiter. Serviced us with zero attitude, and made us feel welcomed. I tried the spiciest sauce chicken here and I have no idea how I survived...all I know is 5 boneless chickens of the stuff later and I literally couldn't talk haha I recommend it to those willing to accept the challenge", "author": "Jordan S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-10-15", "description": "I've been to a couple of Buffalo Wild Wings and I have never had such a bad experience as I did here. The waitress come to the table and asks what we need but we are unsure but we did want drink. The waitress then cuts me off and says that she's taking food orders and she does not have time because they are busy. Then said that she would skip us and come back when we are ready. We get Mozarella sticks as an appetizer but we do not get enough Marinara sauce so I decide to ask a food runner to please get new another. He says no problem. Minutes go by and no sauce. The sticks get cold and we just decide to eat them without any. The waitresses name is GIGI and she DOES NOT any customer service skills. So if you decide to eat here, you'll get a bad experience along with rude servers and non helpful employees. Worst Buffalo Wild Wings in this area. NOT RECOMMEND!!!", "author": "Fernando V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-08", "description": "One of the first Buffalo Wild Wings locations I've ever visited and never cease to amaze me. Food always fresh and service pretty fast. Last time I went I had the pleasure of being served by Adrienne and she really took customer service to a whole other level. She was attentive, pleasant and went above and beyond while serving my boyfriend and I. \n\n\nShe really solidified my love for this location. If you ever stop into this location, ask for Adrienne. You won't be disappointed!", "author": "Tiffany B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-08-10", "description": "I wouldn't come here again\n\nThe drinks were watered down.\nI ordered Nachos and had to pay extra for sour cream.\nI thought Sour Cream and Salsa with Nachos were common.... Not additional.\n\nSpending $170, and having to pay additional for a spoon of sour cream.... Wow...\n\nThe Boneless wings are full of bread\n\nJust order traditional wings, mozzarella sticks and no drinks.\n\nSave your money and go to a bar in park slope", "author": "Lola L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-28", "description": "Honestly, I was shocked by my experience at this Buffalo Wild Wings location. I came here on a Saturday afternoon after tiring ride on the LIRR and was starving. My server Briana was so sweet and welcoming. She explained how the drinks were a little on the fruity side, and suggested I try a mango Long Island which, surprisingly tasted pleasant. I ordered the wing combo ( honey BBQ)  and it took no longer then 10-15 minutes. She checked on me a couple times while I was eating to see if I needed refills or more napkins which, was very attentive and thoughtful. Overall I had a very pleasant experience.", "author": "Nicole D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-05-22", "description": "I just don't understand how restaurants that are in a high traffic areas never manage to be organized. So, my friend and I get there before a concert at Barclays on a Friday night so we knew it was going to be a wait. No problem. The hostess tells us 25 minutes so we decide to go to the bar and wait. The hostess tells us to check in before 25 minutes because a table may be available by then. How about you give me a buzzer or text me when my table in ready? Moving right along...\n\nWe go over to the packed bar area. There are at least 4 bartenders behind the bar looking unorganized. They weren't taking orders, the weren't making drinks but somehow looked like they were so busy. I was at the bar for 10 minutes talking to my friend when I realized I still was unable to order a drink. I said it out loud and one of the bartenders heard me and asked if I wanted a drink. Finally!\n\nWe decide to head back over to the hostess and she said we were called already. She ends up seating us at a table that was empty when we first arrived. So for 20 minutes, you didn't seat anyone there when there were other parties of two waiting to be seated. Hmmmm\n\nWe sit down, get our menus and glasses of water. We ordered our wings and got them in a reasonable time. However, we never saw our waiter again until he brought the check. Basically, the service sucked!! I hate places with poor service \n\nThis place gets 3 stars because the wings were good.", "author": "Nell W."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-08-17", "description": "Slow service, took 20 mins to order food, missing a few beers selection, always come here after concerts, but today was the worse , too many staff not doing anything, they love to just stare at you as if you have no business being here, don't recommend at all , just Horrible", "author": "Dara Y."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-11-22", "description": "If you're in search of mediocre food and mediocre service in the heart of Brooklyn then this is the place for you ! I recently came here for my best friend's birthday (late night on a Wednesday). First of all don't expect to dine here after 10PM if you're under 21 whether or not you're a drinker the freakin bouncer/security guard will card you.   Secondly, our waitress Uli provided the slowest and rudest service ever- our food took over an hour and she was honestly just annoying and unpleasant. Honestly the boneless wings here are small and bready and the fries are suuuuuper salty. The chicken ranch sandwich I ordered left much to be desired but I ate it after waiting almost an hour. Drinks are overpriced they start at around $10-$12 and you're charged $7 for extra shots. I honestly hope to never return here- the Applebees next door is 1000 % better in my humble opinion. AVOID !", "author": "Jessie B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-04", "description": "Tradition wings was great and so was the BBQ Stack. The serve came by 3-4 times to ask if everything was ok and asked if we would like dessert. Really kind and professional. There is also 50 cents wings every Tuesday night!", "author": "Dave Y."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-20", "description": "Taking my lil man there for his bday celebration. He's obsessed with their wings...and gotta admit, other than long wait to b seated its a worth while experience", "author": "Maya G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-02-08", "description": "If you don't mind long waits for subpar service -bagged and microwaved food... Go for it. \nSat for 10 minutes before someone acknowledged me. Then another 15 before the waitress told  me she just put my order in when I asked to change something.\nIt's worth it only if the empanadas truck downstairs outside isn't there.", "author": "Juliet F."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-07-24", "description": "Don't ever eat here!!!, I work in the mall where this Buffalo Wild Wings is located, and got pretty sick to my stomach the first time I ate there wings (mango-Habanero). I went back a second time thinking that maybe it wasn't the wing that made me sick, so I ordered, told them I want them cooked well done and like clock work about 2hours later my stomach was in knots and I was running for the bathroom, my advice is eat at the apple B's next door!", "author": "Steve G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-11", "description": "Nice setting to enjoy any sporting event, food is okay and the service needs some improvement. I have a pleasant experience about every 7 out of 10 times. Certain waitresses make a terrible reflection on the others. Summer is not a waitress/server I recommend, she is not very people friendly and does not communicate very well. \n\nGrade: B", "author": "Bandele D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-30", "description": "The service, ambience and overall atmosphere of Buffalo Wild Wings is just like a Sports bar... Simply if you love what part you will enjoy Buffalo Wild Wings. The strength of the wind is not necessarily the quality of wing play in the selection of sauces. You can find metal wing many other places but the soft combination that the bring is second to none. Not the best restaurant in the world but I don't think those who come here are looking for it to be.. just a Wing experience where they can watch the game ot fight..\n\nIt is what it is... and I like B Dubz", "author": "Lorenzo J."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-05-05", "description": "Horrible service, dining in, and taking out. Ordered 8 wings for pick up, and they gave me 6...not to mention they were barely sauced :(\nIf you dine in you should bring a flag to wave to get your servers attention...he disappeared for our whole meal...strange. \nThe wings are sometimes, if you're lucky, pretty good.", "author": "Susanna P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-08-06", "description": "Child, it's nothing I hate more than an inattentive hostess and workers standing around having side conversations right in front of me before acknowledging I'm there... It's Thursday night, so 75 cent wing night and that means it's packed with all the broke people... Let me stop. It's packed, and servers are running around like mad men and I can't fault them, but sheesh. They're lucky I like the mango habanero sauce...", "author": "Abigail A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-10-21", "description": "This place is WACK!!! I should've left the moment I saw the ripped seat in the booths...\n\nAppetizers: had chips and salsa..the salsa tasted WEIRD!!! and also ordered mozzarella sticks...that was good...hard to mess that up...\n\nThe Wings were DRY...nothing special...and they came out pretty damn fast...makes me think that they must have had them lying around somewhere...\n\nDrinks...THUMBS DOWN...had margaritas...BARRRFFF...\n\nThe one star was for the Mozzarella Sticks...LOL", "author": "Eszee R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-08", "description": "The wait just to get seats here is quite long and the service is average, the food though, is really good and the drinks they made were amazing. Def worth the wait and would recommend to friends and family.", "author": "Daisy K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-08", "description": "Just left there after grabbing a quick bite for lunch. I'm not from the area, so saw bdubs and was happy. Went in, was greeted right away, everyone was so nice and friendly. Sat at the bar, the bartender (I think his name was Morris?) was very nice, came over right away with a menu and took my drink order. Ordered a wrap, came very quickly and looked and tasted great! Morris checked on me, as well as the hostess and the manager as well- it was very refreshing to see that they genuinely cared about how my lunch was.  Wish I worked here more often because I would def visit this location. Thanks so much for a great, fast and easy lunch!", "author": "Katie B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-08-23", "description": "Since my not so good experience months ago I decided to try TO GO! Nope! Not any better...the workers NEVER smile and speak with attitude when you ask questions as if YOU are expected to know the entire menu before ordering! I'm here now and waited 15 minutes to even get a HELLO! When I addressed that issue I was told \"I'm helping THEM right now since they were waiting 40min but I DID acknowledge you and you didn't pay me any attention so...\" Like ok I'm glad this is how it works for every service here. I'm COMPLETELY DONE with this establishment!", "author": "Tee P."}], "servesCuisine": "American (Traditional)", "priceRange": "$11-30", "name": "Buffalo Wild Wings", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "139 Flatbush Ave", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/ENoWKg2ScYUtSOPF-xpcJA/ls.jpg", "@type": "Restaurant", "telephone": "+17189439453"}