{"aggregateRating": {"reviewCount": 573, "@type": "AggregateRating", "ratingValue": 2.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-23", "description": "Amazing service!  We went to BWW before the Isles/Devils preseason game.  The place was packed, but the service was still incredible.  The staff, especially Ozzy, the manager was above and beyond what you expect at a chain restaurant.   They put a rush in on our food so we could make it to the game on time.  The food came out made to order - hot \u0026 yummy and not sitting under a heat lamp.  Our server always made sure we had drinks and checked in with us a few times.  Will definitely be back for any pre-game or pre-concert event at the Barclay's center.", "author": "Kristin M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-17", "description": "This place is amazing... There is something for everyone... There wings are to die for.. I have been here multiple times and every time was a pleasure there service is great the crowd is decent most of the times and the sporty bar theme makes it a paradise for us men... This place is somewhere you can go for a guys night out for a drink and wings or a nice alone dinner with your significant other.. I give buffalo wild wings two thumbs up", "author": "jeremy r."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-04-16", "description": "Today's visit was a nightmare but, my friend wanted to eat here today. place was 3/4 empty on a thursday after work and stayed that way. The witer who waited on us was a ditzy as Vera from the show ALICE. Food came out warm yes I am talking about a burger which i ordered medium and it came out well done....bun was dry and stale plate looked like a monkey just threw it into the wax paper lined basket... fries were cold and tasteless..... my friend ordered the spinach dip as well as a parmesan garlic flatbread pizza... she got the  half of cup of dip with a ton of boxed pita crackers which they dropped in oil for effect (i am guess)... but, she never got the flatbread pizza... when we asked about it the ditzy waiter said \"we don\"t serve pizza\" we said the flat bread pizza... Ditzy says..", "author": "Chino P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-07-02", "description": "Came here with six other friends the other night and, needless to say, I wasn't impressed. For a restaurant that is supposed to be all about wings, the wings were not that good. They did have some pretty unique flavors that tasted good, but it felt as if they overdid it with the sauce. The atmosphere was very casual, perfect for a group of friends at night. The service here also needs to improve, and the lack of quality service may be due to the fact that the place appeared to be understaffed (it probably is, judging from other reviews). We would see our waiter and then he would disappear for 15-20 minute intervals. So if my group wanted to ask for napkins (wings are messy, especially with the amount of sauce these had), we would have to wait 15-20 minutes until the waiter was around so we could call him over. He messed up our order of potato wedges (we had asked for a basket so our table could share) and gave us a small order. However, he did make up for it by not charging us for the small order and by giving us the basket we originally ordered.", "author": "Danny S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-26", "description": "mmm buffalo wings.  i never been to a buffalo wild wings before.  but upon seeing the commercials, i decided to check it out despite the fact it was in brooklyn.  besides, i had placed some bets on games and needed their help on fixing the game as per the commercials.\n\nbut guess what? they don't do that.  there's no remote control there that trips up football players or anything of the sort.  minus one star.  its also in bk, minus 4 stars.  \n\nbut ok on to the good, they have a million different wing flavors.  i heard the blazin (the spiciest one) was no joke.  but me being a real man, i could handle my spiciness.  we order 24 of blazin for the table, and all had individual orders to try other flavors as well.  i had the thai curry.  the worse one of them all.  but i mooched off my friend's wings including jammin jalapeno, wild, mango habanero and caribbean jerk.  nothing really stood out, i think the caribbean jerk was actually cold.  whatever, its all about the blazin.  i dove right in.  i've been to places where u have to sign waivers to eat wings so how bad could this be.  one bite into it, pretty impressive for a chain restaurant.  this definitely has some kick into it.  5 wings in, i was sweatin.  but thats just me, my mouth could handle the meat...ummmm yeah.  still for all the girls and the pansy men out there, its pretty spicy, wear your diapers.  my white tight whities were not so white afterwards.\n\ni also had the ribs which were fall off the bone types but not exactly great.  they were semi tasty and above average but i don't recommend coming here for that.  we ate family style so i tried the onion rings, popcorn chicken, potato wedges and fries.  nothing stood out. \n\ni heard this place gets packed during big sporting events and there might be as much as a 3 hour wait.  (click useful for that comment  alone pls).\n\nthe service was nice and personal, big ups to our waiter (paul?).  there were a lot of tvs around and its definitely a sports kinda restaurant.  what else?  oh yeah its in bk, bleh.  but overall, a good place, would definitely go back.", "author": "Steve W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-01-23", "description": "If i could give this place negative five stars i would. it sucks monkey giblets. and there food taste like mouse poop but not just any mouse poop spicy Mexican mouse poop like speedy Gonzales had an accident on your plate the wait is insanely long and there drinks are muddled in dirty glasses and way to sweet I did like the bathroom though it was clean and the mirror deceives you into thinking you are a lot thinner an prettier than you really are i guess this makes them think you'll buy more food idk but bottom line don't go here", "author": "Alexzandra P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-06-09", "description": "If you like it HOT you won't be disappointed with the BLAZIN' sauce at BW3's. I wish there were more locations but I'll drive to Brooklyn if I have to for these wings. I really like the fact that the wings are CRISP! The sauces are all really tasty.... I fancy the Asian Zing, Caribbean Jerk, and the Spicy Garlic but the BLAZIN' is what keeps me coming back. I usually order the buffalo chips (fresh cut potatoes) with cheese and a Guiness. An uncommonly satisfying game day (or any day) treat.SPICY GOODNESS!!!!", "author": "A S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-23", "description": "solid wings, with nice variety of sauces.  wings are def on the smaller side.  place can get real packed, esp before Nets games and after work crowd.\n\nlotta high schoolers come here apparently and often a decent wait to come sit down and eat.  \n\nplace has nice new flat screen tvs, and bar area.  Prices are standard, w/ rarely any specials.\n\ndef worth a try, if you're willing to wait.", "author": "Ken C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-28", "description": "After having the wings and feeling happy for finding a good wing, I am surprised to see that the reviews are pretty bad.\nI think the trick is, TAKE OUT!  Take out and you won't feel dissapointed at the aesthetic of the store at all, you won't have to receive bad service, or have to touch the sticky menu, absolutely no water with mayo floating around. You can eat great wings at home with your own Evian,  Poland Spring, a bottle of blue ribbon. (the only down side is that you will have to buy orange and slice it )  plus you don' have to pay tip! what else can you expect ?\nThe wings are better than average wings store. I tried the parmesian garlic wings 6 for something around 5dollar and 20 cents. I was walking around parkslope and felt super happy.", "author": "Rebecca B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-10-26", "description": "We came here alllll the way from mid-town because my bf says I *have* to try this place for their hot wings. OK... so we came here on Wednesday.. and they have Monday all you can eat wings and fries for $14 specials... 50cents wings Tuesday specials... and 60cents boneless wings Thursday specials... Wednesdays??? Nope... nothing at all! Wow, definitely feeling lucky. Anyhow, we ordered 18 wings and a regular fries to share. Wings were good with the sauce, but I still love my Bon Chon chicken!! They are irreplaceable. All the drinks on the menu do not show the prices... which can be a good or bad thing depending how you look at it. I had a cocktail (the mountain berry tea which was a bit too sweet) which was $8. Beer (the special of the night) was $5 for a pint. Pretty decent prices but i won't be back again i think! Highlight of the night was the buzztime game! We had a great time playing poker.", "author": "Kaimin N."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-02-24", "description": "Was never a fan of boneless chicken. There was too much breading and it was quite hard. Did not seem fresh at all. The sauce was nice and spicy. The service was decent but the cleanliness needed work. Not the greatest first experience but I would like to try their traditional wings (meat on bone).", "author": "Vinny B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-06-02", "description": "Wouldn't let group in because 1 member had no ID to prove 18. Since when do you need to be 18 to eat in a restaurant? The manager was very rude about it too. Especially since a young group had gone in before us \"un-carded\". Would have been a returning customer if it wasn't for that rule", "author": "Victoria A."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-08-22", "description": "The staffing in this place is horrible.  The hostess and waiters are not friendly at all.  The seats when you first walk in are worn and torn, does not make you want to stay.  Not very accommodating at all.\n\nThe food is not bad, i would such going to the back and getting take out.  The service is better and you can sit in your own clean and very environment and save the tip.", "author": "Danette C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-24", "description": "Cannot wait to eat this again, honey barbeque wings are soo good, i will try other flavors next time i go!", "author": "Dannii J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-08", "description": "The atmosphere is quite different than the \"B-Dubs\" I am used to in East Lansing, MI. If anyone gets the \"B-Dubs\" reference than I am sure they know and agree to what I am talking about. But the food is pretty much the same......the sauce is amazing......and the tv screens.....well ocassionally I am lucky enough to see MSU on one of them even in NY!!  Great place to catch a game, drink some beers, and eat some fantastic wings!!", "author": "Michelle B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2010-10-18", "description": "Abysmal. Yuck. Burger tasted like cardboard, beers overpriced. Best to avoid.", "author": "Jim K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2008-04-25", "description": "An entirely ridiculous place. They have this elaborate wing menu with all these different wing flavors, but then they serve you the scroniest, saddest little wings. The suaces are OK I guess. They do have a ton of beers on tap, and a raucous atmosphere for game watching amongst a colorful local crowd. They are also a destination UFC watching spot, haha.", "author": "Justin C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2007-11-26", "description": "Good happy hour specials, but the service is too spotty to judge.  I've had great service, and other times I've been made to feel like I don't exist.  I love the boneless wings Thursdays, and they have some drink specials.  It's a decent place to catch a game (if you're into that sort of thing) but not much of a restaurant.  I'm a bit put off by getting served my meal in a paper container like this is Popeye's. They need to step it up a bit.  I looove spicy food, but even I'm not built for their hottest wings.  Order w/caution.", "author": "Koku K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2008-07-03", "description": "2.5 stars\n\nI ordered (my usual) appetizer platter that came with boneless chicken wings, mozzarella sticks, nachos, and onion rings.\n\nBoneless wings?  Maybe I'm biased (and enjoy licking the chicken bones clean too much) but I wasn't really a fan of these boneless wings (which basically came out like chicken nuggets).  There's a whole variety of sauces to choose from and I ordered mine in parmesan garlic.  The sauce itself was ok.  \n\nOther than that, the mozzarella sticks weren't very crispy (and not enough batter), the nachos were pretty standard, but the onion rings were pretty crispy and tasty.  \n\nOverall, I'd give this place another try (since I do have a soft spot for chicken wings but also since I work at the Atlantic Mall sometimes anyway so it's not like I'm going out of my way to get to this place).  Looking forward to trying another sauce!", "author": "Junkfoodie Q."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2010-10-23", "description": "I have visited this location of BWW probably 15 times or so over the past 2 years. Originally I really liked going here. Service was great and food was always out quickly. But I've noticed the quality has really started to slip. \n\nAfter not going for a few months, I decided to go there with my gf Friday Night Oct 22. We got there about 7:45 and was told there would be a 30 minute wait. Not a problem, so we put our names in and went to Target to pick up a few things. We came back around 8:00 and were told we had missed our spot but they would find get us a seat soon. About 5 minutes later they sat us at a high-top. The TV's were blasting so loud with the Yankees game we couldn't even have a conversation. We placed our order for 18 wings and fries about 8:15 and the waiter brought us our drinks. \n\nThen the wait began. My gf finished her drink and the waiter was nowhere in sight. Around 8:45 we noticed the couple they came in after us were served. Our waiter hadn't been around to check on us for quite a while so my gf got the attention of the manager. He said it shouldn't be taking this long and said he'd fix it. Around 8:55 they brought out our order. It was wrong. I told the manager and he apologized and said he would fix it. After another 10 minutes I had had enough and we got up to leave. I had the bouncer get the manager and told him politely that we would be leaving and not paying. I told him it was unacceptable to make us wait 50 minutes for our food. He said that would be ok.\n\nIn conclusion, this BWW has awful service and I don't think I'll ever be back. I recommend everyone stay away until they hire some adults to run this place the right way.", "author": "Christopher J."}], "servesCuisine": "American (Traditional)", "priceRange": "$11-30", "name": "Buffalo Wild Wings", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "139 Flatbush Ave", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/ENoWKg2ScYUtSOPF-xpcJA/ls.jpg", "@type": "Restaurant", "telephone": "+17189439453"}