{"aggregateRating": {"reviewCount": 573, "@type": "AggregateRating", "ratingValue": 2.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-26", "description": "The line isn't so bad, but on Tuesday's it is because of their special deal. The wings here are good tho. Comes in so many different flavors. I love love the mango habanero, it's sweet and the heat just hits you. The other thing I don't like is the bathroom line. It's always long and sometimes not all of them are working. I will come back again tho.", "author": "Angela J."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-02-14", "description": "Horrible service.  Don't use seamless.  Poor service.", "author": "Pravin B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-11-06", "description": "HAHAHA this is NOT a BWW.  High schoolers who run McDonald's provide better service than this crew.\n\nWaited awhile while there were clearly 4-top tables open, bussed our own bar table, and got no apologies for the wait while the workers were screwing around.  The floor was littered with trash and soda like a subway track and not one person tried to mop it up during our hour long stay.\n\nThey got a $0 tip that night.  No regrets.  Will gladly spend an extra $20 to eat expensive food in the Barclays center instead.", "author": "Forrest C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-10-19", "description": "Just left the Restaurant. Horrible service. We were there for their shift change and what poor communication between the bartender coming on and the one coming off his shift. I had just gotten out of the DMV and wanted to decompress and eat. Didn't happen. They must st have forgotten about mmy food. The patrons next to us ordered their food 5 minutes after us and five minutes after they received their food i was still waiting. I asked the bartender where our order was. She left to check but never communicated to me. So i asked the manager who was polite but didn't seem to know how to help a disappointed guest. We left paying for one beer and still starving. Great job. I give the star for the Tall Guy at the host stand. He was understanding and seemed to care most. Which is kind of sad.", "author": "Paolo P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-08-02", "description": "Always come here when im looking for a nice size lunch.  Teriyaki wings my favorite and some fried pickles. \n\nService here isnt too bad.  Its always busy so they are usually running all over the place.  \n\nThe reason I only gave it 3 stars is because I feel the drink selection could be better and I think they are very slow with  take out orders.\n\nWill return for good wings though", "author": "Laura C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-29", "description": "I love BDUBS especially during the NBA playoffs. Yes it can get crowded, but that just means the place is well loved. We always sit at the bar since waiting for a seat takes too long. Wings come out at a reasonable time considering the size of the restaurant as well as the fact that they do take out orders. \n\nIn addition to the great reasonably priced wings, the atmosphere is simply wonderful. This is a place to come and watch a basketball game. You've got people cheering for both sides, including the bartender! It's a good feeling being surrounded by other fans while you chow down on good food, gulp a refreshing beer (large selection btw), and watching a good game of basketball. \n\nI used to live in Harlem, and would trek it down to BDUBS (sometimes taking an hour and a half) just to enjoy a game. And you know why? Because it's like home.", "author": "Chelle S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-10-23", "description": "Very dark dinning room. Food was what you expect from BWs. Service wasn't anything to write home sbout. But we enjoyed the food and tge view from the window.", "author": "Jen T."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-07-07", "description": "Honesty they don't even deserve a star, just waiting, for your wings already takes more then 1 hour and then the service is really bad like they don't even care your existence. I mean if you have 2 hour of your time waiting for a wing then go for it when there's really nothing special about it.", "author": "Andy L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-04-04", "description": "They had pretty good service. The table was very dirty and it took awhile for the server to come. When he did come he made up for the service. The host , young Chinese girl was very rude and I definitely wasn't having it. Don't work in food service if your going to have an nasty attitude. Could have definitely had a better experience.", "author": "Steven A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-02-18", "description": "Abosuletly THE WORST SERVICE I've ever received! Half of my did not eat because the food never arrived!!!! 30 minutes for my kids to get their fruit punch! 20 minutes waiting for ketchup! I'm disgusted with this Buffalo Wild Wings!", "author": "Jesus G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-01-07", "description": "They could be a little more clean. The menus are sticky and dirty most of the time and the ketchup bottles always have old ketchup around the ring of it. The table and seats had a bunch of crumbs where we were seated. It seems like with all this dark lighting they're missing plenty of spots. Also you're waiting forever to be seated and forever for a waiter to come greet your table.", "author": "Amirah E."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-02-15", "description": "Long wait time for a table and slow service. Even on the evenings on weekdays, the wait for a table can take 1 hour. If there is a big game going on that day, don't bother coming here unless you come really early. The service is extremely slow. Our table needed water badly after eating some of the spicy wings. It took so long to get the waiters attention and then it took even longer to get the refill. The whole process may have taken at least 15 minutes. It may be better during the lunch hour. \n\nThe wings here are good. I love the selection of different ways to cool the wings. The small plate option is a feast to me. The boneless wings aren't as good as the regular ones which are much juicier. My favorite sauce is the jamming jalapeño. I tried the sriracha one, a limited flavor, and it was gross. Not a good idea. It was spicy and sour. Blech", "author": "Doris H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-19", "description": "WHY, OH WHY am I such a sucker for succulent wings? I beg of you please remove this place from my neighborhood before I need to call ahead and reserve my own car on MTA. \n\nThis place is officially the delightful death of diets. \n\n\"I'm only hungry enough for 6 wings, so I think I will just take that...\" Said NO ONE EVER. Even if I can only cram 3-4 wings in mah'belly I often find myself ordering the dozen. Why not? I'll work it off tomorrow - or at least that's what I tell myself. Does it actually happen? I decline to respond, but I will say that on the positive-side weight is relative - right? Einstein? Anyone? *crickets*\n\nAnyways! \n\nNo \"Wing Wednesday\" specials here. They've got you covered Tuesdays and Thursdays however with half off traditional wings (Tuesdays) and boneless wings (Thursdays.) Can't go wrong.\n\nMy favorites, and the ones I get every time I come, are the Thai Curry and Spicy Garlic (I think.) They're spiced perfectly; enough to make your nose run but not enough to embarrass you in front of your date or friends.\n\nDon't stop at six. You can do it!", "author": "Michael W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-15", "description": "First time there, I went with my family for Sunday lunch we were seated right away by the window, our waitress was very nice but it seems as if she was rushing us to order, I got the medium size for boneless chicken and hubby got the larger wings, the wings were great!! And if you dare try their blazin sauce wow very spicy, great time there definitely returning", "author": "Cynthia M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-08", "description": "My husband and I came here today (it was our first time). It's a pretty big place and they have lots of tv's (if you're into sports that's a plus). We were seated quick and the hostess was really nice. \n\nOur server came it a good amount if time and explained to us how the menu goes. \n\nMy husband ordered the traditional combo. His wings had Parmesan garlic and his no less wings were honey BBQ. I had the small wings (10) with honey BBQ sauce. We also had onion rings as an appetizer (I ate them all lol) \n\nI was not really please by their wings. They didn't have any flavor besides the BBQ sauce which their was a lot of that on the wings also. I only at 2 of my wings but I just couldn't get into it. But I must say their boneless wing are delicious (I ate my husbands food lol) \n\nI will visit again I just won't order wings", "author": "Monique J."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-09-16", "description": "Waited an hour for my very simple takeout order, just for them to get it wrong! .. the wait is always long regardless of what you order!! .. if that cashier wasn't nice I would be flipping tables", "author": "Chantay T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-22", "description": "Hm, am I going to lose my yelp street cred for giving this place 4 stars?? No matter, I think that their wings are consistently great and I love the clearly labeled spice level of the sauces. Their burgers are also hefty, decadent, and tasty. Love that you can bring your kids here and that the noise level ensures that they won't bother anyone else, haha. They even give you free wings on your birthday (if you sign up to their e-mail list prior). They get packed but the servers I've had have all been friendly and competent.", "author": "Tiffany L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-11", "description": "I love this place. A nice sports bar. Ive brought my date here, for the first time and she loved it as well.", "author": "Mark S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-11-04", "description": "Worst service ever. The waitress/waiter is so rude here and besides that your lucky if you can even get a hold of them. Terrible. It stinks here too.", "author": "Irene Z."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-07-18", "description": "Terrible service out of the beer on the menu and brought buffalo wings with ranch. Buffalo wings come with blue cheese period.", "author": "Taylor M."}], "servesCuisine": "American (Traditional)", "priceRange": "$11-30", "name": "Buffalo Wild Wings", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "139 Flatbush Ave", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/ENoWKg2ScYUtSOPF-xpcJA/ls.jpg", "@type": "Restaurant", "telephone": "+17189439453"}