{"aggregateRating": {"reviewCount": 573, "@type": "AggregateRating", "ratingValue": 2.5}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-01-13", "description": "This place is just OK. The wings are tasty, and I love being able to mix several different flavors of wings in an order. But you can count on the waitstaff leaving you hanging for 10-20 minutes at a time, so keep an eye on your drink if it's getting low and flag them quick to get you a refill before they disappear. And if you're in a hurry, know what you want to order as soon as someone gets around to greeting you and asking you if you'd like a beverage.\n\nPlus, it's a friggin sports bar atmosphere. And it's in a mall. Not just any mall, but the friggin Atlantic Center. Gag.\n\nSo, in my mind, not being a sports junkie, there's only two reasons to go here: lunch/dinner before/after shopping in the immediate vicinity, or if you absolutely, positively, gotta have wings in a variety of sauces. Anything else they do here you can easily get somewhere else.", "author": "Leah Shane D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-18", "description": "I look forward to football season. Not because I care for football, but because suddenly everyone I know wants to go to BWW with me! Of the wing chain restaurants, this one is my favorite. I like the hot-grade standard buffalo sauce, but the desert heat dry spice is also one of my favorites. They have a nice variety of sauces from mild to presumably OMGBURNMYMOUTHOUT (which I have never tried). I also like this sickly sweet electric blue lemonade drink they have. If only they didn't post the calories. However, minus one star because they refuse to put on the hockey game even on one TV!", "author": "Katie I."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-05-16", "description": "As always with BWW, the food was great.  The service was great.  That is basically why you go.  The beer deals are cool too.  They have tv's everywhere, of course, but they are pretty small at this location expect for the one at the bar.  \n\nOverall, it is what is to be expected from a BWW.  The wings are awesome and the beer is cheap.", "author": "Klysha R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-11-06", "description": "Had this for the first time. Its a chain place...meh...wings were ok, nothing special. Honestly don't remember much about the food or the place..guess that tells you something huh?", "author": "Eric S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-03-21", "description": "I go there for the awesome wings and appetizers. But when its game day, forget about getting seats unless you be there 1.5 hours before it starts. On a regular day its good. Most of the staffs are really nice, while others aren't as much.", "author": "Kenneth L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-01-31", "description": "WE CAME IN TO THE ATLANTIC ONE FREAKING DONT ALLOW PEOPLE TO GO IN BECAUSE we were not 18 and it was only 3pm and we had a group of 16 people!", "author": "Rachel Z."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-22", "description": "Great selection of beers and the great wing flavors such as the garlic parmesan. They have different level of spicy wings to cater to your taste buds. I go once in a while to quench my thirst for wings but the long lines some nights are not worth it. Other than the long waits, this place has awesome wings!", "author": "Gary Y."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-01-02", "description": "I like the honey barbecue wings and mango lemonade. Ive eaten here several times and dont like anything on the menu. Most of the food is like eating at a hospital cafeteria. Quesadilla I had the last time i was there were horrible. The chicken fingers were hard, the mozzarella sticks were cold. I come here for the convenience and to watch the game. Other than the options of sauces, the wings are generic as if you were ordering from applebees or Fridays. I sat on seat cushions that were ripped. Noisy mall crowd", "author": "Helmut D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-01-02", "description": "My search for a good UFC bar continues, Buffalo Wild Wings, was loud and bright, not nearly enough seating or space, the tables were dirty and the service was lousy.\n\nThe Wings were standard, but the place was a zoo, everything you would expect from a chain.", "author": "Terry P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-14", "description": "This place usually gets a bad rep. I've never been let down whenever I make a visit here. The wings are always good and so are the drinks. Never been here on a big game night but it's always a cool crowd of people here. Def one of my regular spots.", "author": "Just' C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-07-05", "description": "Only gets two stars because the food was satisfactory. Waiter got my order wrong so now my family and I eat at different times. Waiter more distracted on watching the sports on tv than serving. Looks like a bunch of teens that work there. Wait time over 35 mins. Waiting area can only seat 10 at most. Just a poor experience overall.", "author": "Juan B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-26", "description": "BWW Is the absolute greatest place in the world. Okay maybe that's an exaggeration, but the wing sauces are so amazing, and the prices are awesome.", "author": "Julian S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-02-06", "description": "A friend and I were visiting for the weekend...partied HARD the night before \u0026 stopped in Buffalow Wild Wings for the hangover cure. It was my first time there and it was OK. I tried fried pickles for the first time and the wings weren't bad but clearly not the best. The staff was helpful and friendly. I left satisfied.", "author": "Lakiya T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-02-24", "description": "Great experience. Got 50 wings w/ my cousin ... Sauces: good ones were the asian zing and mango habenero. Bad: Carribean jerk, :P yucko.\n\nI'm not a big fan of beer but I ordered anyway ... pretty big glass.", "author": "Yellow L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-05-26", "description": "I had the worst expirience today, foodrunner brought the wrong app, been my first time there I didn't really know if that was what I order so I ate 1 realized this is not mine so foodrunner came back with and attitude telling me why I ate that , I said this is what you brought me, ok then he came back with my app and entree at the sametime and tried to make fun at me asking me is this what you order? I was like are YOU sure this is what I order? I'm the one who's eating and started arguing about ..... Well this wasn't pleasant at all so I decided to leave \n\nI ended up eating at Applebees ... Right next door I had a great time there", "author": "Carlos U."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-01-03", "description": "Horrible Service, they don't have their stuff together for big playoff or UFC matches. They didn't call our party for 3 hours. The clientele are some of the scumiest people on earth. The staff is more concerned with their Instagrams and their dumb conversations then helping people. Don't ever go here.", "author": "Brian F."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-05-19", "description": "Food is good but service sucks, I ordered 2 appetizers and got my mozzarella sticks and the wings didn't come till like 15 minutes after we finished the mozzarella sticks n then waited like another 20 minutes for our food to arrive. Only saw waitress 2 times and someone else had to attend our table because she was no where to be found.", "author": "Carlos G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-26", "description": "I've been here many times, as well as BWWs in other locations. The service here is great and compared to other locations, the wings taste better. I'm not sure why, but the wings taste hotter and fresher when I eat them from this location. Make sure to go on Tuesday and Thursday for the 60 cent wing specials.", "author": "Mike W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-10-01", "description": "Let me start out by saying that I thought the hostess was a JERK! we felt like we were bothering him since we came to this place to watch the Giants game. That was also a problem, its a sports place in nyc and the game was only showing one big screen and little 20 something inch TVs. My TV at home is bigger than that! So the jerk of a hostess put us near one of the little TVs. needless to say we were not happy so we moved to the bar but all of us couldnt fit but when the bartender found out that another of the big screens was being changed to the game he told us to go grab the seats. Well jerk of a hostess wasnt happy and proceeded to say oh you folks can't keep changing your seats. So we FINALLY get a table near a decent size TV screen. \n\nNow onto the food, there buffalo wings were really good. My only word of advice is not to order the hottest wing sauce (can't remember the name), it wasn't that they were to hot but they had a weird taste to them. Now onto my next problem with this place, and employee I will assume on his break was near our table acting like he wasnt at work. Dude was sitting in a chair watching the game, screaming and yelling. A couple of times he would get up and and bang the chair down. Dude was WAYYY to animated and quite frankly he was getting on everyone at my table nerves. I had no problem with him watching the game but I felt his over the top behavior was ridiculous. The waiter was a pain towards the end of the Jet game it was as if he was rushing up to leave which I didnt get because although we sat there for awhile we kept ordering a bunch of stuff. To cap off the night I had to pay 20 dollars for mall parking. I can say that to me this place is NOT the place you come to watch a football game in my opinion.\n\n\n\n\nSo I'll sum it up the food was 3 1/2 stars\nThe Service was 0 stars", "author": "Ciara S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-01-23", "description": "Just like everyone said the service here is pretty terrible. After trying their chicken I must say it is quite overhyped (it didn't have that crunch I was looking for). I have had better fried chicken and the only thing I enjoyed here was the vast amount of flavors they have for their fried chicken.", "author": "Jonathan L."}], "servesCuisine": "American (Traditional)", "priceRange": "$11-30", "name": "Buffalo Wild Wings", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "139 Flatbush Ave", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/ENoWKg2ScYUtSOPF-xpcJA/ls.jpg", "@type": "Restaurant", "telephone": "+17189439453"}