{"aggregateRating": {"reviewCount": 573, "@type": "AggregateRating", "ratingValue": 2.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-05-04", "description": "The other day, my brother and a certain grammy winning movie star came to pick me up from the office.  I wanted chicken.  The game was on and we wanted to go somewhere quiet.  I had not been home and I was feeling blah.  Mr. Movie Star informed us he didnt want to go anywhere too flashy or with people because he had been playing ball and really needed a shower.  His theory was, if we go somewhere flashy, people were going to want pictures with him and then they would go telling everyone he stunk.  He was pretty serious about this.\n\nMy brother, who never really thinks things through in a rationale manner drives us to Buffalo Wild Wings.\n\nThink, about two hundred people, in a huge sports bar, with screens with games, etc, drinks, etc.  Its downtown brooklyn.  There are many ethnic people.  We walk in the back door.  People start pointing...our friend was starting to get extremely upset and nervous...he proclaims \"why...why would you do this to me?\"  We get a table and order.  So we are seated next to a table with two guys and two girls.  Instantly, the girls at the other table just start ignoring their guys and start trying to talk to us and get involved with our table.  It was like the boondocks episode where the guys wife ends up flirting with and chillin with Usher.  I was like this isnt good.  I was expecting a Pimp named slick back to show up at any moment.\n\nWe ordered wings.  Mine were boneless.  I had the mango sauce and another medium sauce.  They were decent.  I don't like the boneless as much as I do the bones but my brother swears by them.  They had some good tequila drinks.  We had some with mango and strawberry.  The girls that were now basically at our table, were drinking frozen tequila drinks as well.  One had painted nails and 9 were one color and one was another color.  I insisted she tell us why she would do such a thing.   She gave me no real acceptable answer.  Then a party of ten of the biggest women I have ever seen together showed up and sat at a table.  The Movie star got really nervous and insisted we get the check before he was spotted.  Other than some handshakes and two girls leaving their date, we were ok up to that point.  My brother was slow in getting the waitress.  The movie star sprang into action and got the waitress so that we could pay.  He was trying to get out of there before the bbw convention spotted him.  Fortunately, he was giving himself way too much credit because I assure you, those women were way more interested in the chicken.\n\nMr Movie Star: Stick to acting, you are no fortune teller...and take a shower man...", "author": "Jamel O."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-28", "description": "What is Buffalo Wild Wings?\n\nDefinition: Chicken Wings that are cooked, glazed and dipped again into your choice of 14 different sauces and the sauces range from mild to hot. I tried the Asian Zing which is sort of in the middle range, it was sweet soy ginger with a fire chili pepper after taste. Served with celery and ranch dressing on the side!\n\nWhat's not to like about this chicken place? They have a chicken wing special every Tuesday and Thursday for 50 cent a wing!  Yeaaah...I'm a fan!", "author": "Touro T."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-03-18", "description": "Never, I repeat never have I had a worse experience at a restaurant in my entire life. Working personally in the restaurant business for over 10 years throughout my studies and growing up around my father's hospitality career, you learn a few things. \nLike, how a manager should act when interacting with customers. The female manager who worked this past Saturday March 16th during the afternoon was an embarrassment to this establishment and I do not envy any customers who must interact with this woman. \n\nMy two friends and I went in to Buffalo Wild Wings to watch the game between Michigan State and Ohio State. We sat in the bar area among a sea of customers, none of which were paying any attention to the games. Upon asking a bartender if we could switch games between two of the TV screens she very kindly went to ask her manager. A minute or two passed, and an angry woman showed up to our table not explaining why that task could not be done but forcibly and in an almost yelling tone said she wasn't going to change the channels. \n\n\"YOUR GAMES ON RIGHT THERE.\" Pointing at the screen and then storming away.\n\nStunned and confused as to why she would without being provoked, yell at a table of patrons I walked after her and asked her this question. \n\n\"Are you the manager?\"\n\nShe said yes. Which I then followed with....\n\n\"Well, you sure aren't acting like a manager.\" \n\nI said a few more words, explaining why how she spoke with us was inappropriate but anyone with a piece of common sense could see why that was wrong. Managers are supposed to solve issues not be the cause of them. They're supposed to take care of customers or at least approach situations in ways that are not detrimental to the business they run. \n\nMy friends and I are mid-twenties men, who love sports and Buffalo Wild Wings for being a haven for beer loving, wing eating, sports watchers. It is a regular event of ours to visit during sports seasons but now, we're not so sure we'll be back after the last trip. \n\nMaking wings at home might not be as good as the ones we'll find inside Buffalo Wild Wings, but two things are for sure... We'll have control over the remote and the manager of the year won't be there.", "author": "Spencer C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-06-10", "description": "So I first went and heard of this place when visiting my friends up in Buffalo.  Why we went to a chain place for wings that were invited in that town, is beyond me.  Either way, I remember plump, crispy wings, with heavenly sauces evenly coating each morsel.  They also didn't have heavy batter going on.  \n\nAnyway, when I saw that a Buffalo Wild Wings had opened up (this review is a few years over-due), I was super-psyched!  Yay! wings in whatever flavor I want!  Once my (overpriced) order came in their individual paper trays, I was less excited.  The wings were tiny, and deep-fried to hell.  The sauces were still tasty as hell, but the wings themselves were subpar.  Also, I decided to go crazy and ordered the hottest sauce they had on that menu.  I couldn't eat past 3 wings.  The waitress was nice though and went to the kitchen and got me a glass of milk.  The service was OK, but not super quick or attentive.  The $0.60 wing night is a joke.  That's not even a special.  I'd rather go to croxley's or 1849 for $0.10/$0.20 wing nights.", "author": "Lisa Y."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2009-03-25", "description": "Walked in hoping they would play a Sabres game.. being BUFFALO wild wings and all. They didn't even know who the Sabres were. At this point, I decided not even to attempt to go in and try the wings. I knew I'd be disappointed. \n\nWings and a Sabres Game are like Mustard and Ketchup. You can have them alone, but together.... sublime bliss.", "author": "Justine M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2007-10-01", "description": "First of all, I'm not completely sure why I went here... maybe out of convenience or maybe cause I thought they'd have amazing wings, but regardless, I did go and I will not go back.\n\nWe started out with three different people being introduced to us as our server, one of them being the manager.  The manager ended up being the one to take our order and reminded us that even though he's the manger, we should feel free to tip him.  Thanks dude.\n\nIn the meantime, we were seated near the door to the kitchen and the entrance to behind the bar.  This made it painfully obvious that something wasn't right.  There was no sort of organization and everyone was doing random tasks.  I didn't even really want to watch because I knew it would make me not want to eat (it was kinda gross and messy).  It was also hard to talk over the blaring sports commentary.\n\nTwenty minutes later, no food, no drinks.  We ask one of our \"other\" servers what was going on and she finally brought our drinks.  A little while later our food came.\n\nThe food selection is what it is, kinda on the same level as Friday's or Applebees.  OK, maybe a little nastier.  It was probably one of the grossest meals I've ever eaten, partly gross in the way that it was the most unhealty meal you could possibly eat and partly cause it was just not good.  We had wings (kinda average), nachos (gross), onion rings (fine), fries (pretty good), mozzerella sticks (ok), and mini burger dippers (good idea, but kinda gross).  The drinks were fine once we finally got them.  \n\nBy the end of the meal, we couldn't even stand to look at what was left and made a pile and pushed it aside until someone finally took it.  Then.......... more waiting.  We asked twice for the check.  Finally 20 minutues later the manager comes over to our table and starts apologizing.  I don't know what happened, but without thinking I just started reaming him out about how much everythign sucked, which I never do.  I might start though because we got a free meal out of it, which was nice I guess.  However, I wouldn't go back, not even for another free meal.\n\nSo much for Buffalo Wild.", "author": "J K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-16", "description": "Great wings.  Tuesdays are a steal!  Always order them xtra crispy, and I reccomend the Asian zing and Caribbean spice sauces.   Great place to sit at the bar solo if you want to get away.   Too crowded on gameday for me, but during the week this place is great.", "author": "not c."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-13", "description": "I usually come here randomly either with my Son or friends and we have a blast - The wings are all very good but I like boneless better and the potato Wedges are always cooked great. We sat across from this guy who did the wing challenge -  I think 12 wings in 5 mintues and you get a free shirt...I tried the sauce they used for it which is the hottest one and labeled to not touch small children ,animal , or eyes after touching it and I know why now . 1 Wing dipped in the sauce My mouth was burning like crazy LOL it was an experience I had to quickly eat a lot of Ranch sauce to help myself out. The TVS play the current games on which is great and the staff are more or less friendly. When it gets crowded on weekends though the service can be average and the wait time is Bleh but its the weekend - Week days and Tuesdays are great to stop by even to just pick up and go if you want as they have a take out area. Not a bad place and they sell the sauces for a decent price at the take out. The beer is a bit overpriced but They have a nice selection that introduced me to new things so that a plus. If you got some time and friends that wanna hang and have a good time stop by, but remember weekends will require patience.", "author": "Roberto G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-01", "description": "by far one of the best wings i've eaten. i can eat this everyday if i could the service can be a lil chappy but thats cuz this place is always packed out especially on a saturday when ufc is on anyone that doesn't like this place can e.a.d", "author": "Nicholas D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-20", "description": "sometimes you just need some delicious wings and giant tvs to escape all the damn kale and quinoa in this city", "author": "Allison S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-11-17", "description": "The wings are amazing!  The Thai flavor is very good.  The service from this African American girl was super ghetto!  It's sad due to this ghetto being this restaurant got 2 stars!  I asked for a better seating, and this ghetto being wanted me to wait online again.  No problem, done!  Later I had to changed from party of 2 to 3, the same ghetto being make me go online again.  No problem, done!  It's no big deal to me since I had to wait for my 3rd party anyway, but I hope the next time when I return this ghetto being is fired!  What a wasted of life :)", "author": "Jonny H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2007-12-23", "description": "Loved the Wisconsin location, but the Brooklyn location brought the place down to 2 stars.  After experiencing them in Wisconsin, I wanted to relive that moment in the Bklyn location near my place.  Unfortunately it didn't live up to what I was expecting from my prior visit.  The service was dreadfully slow.  Our waitress just hung around the corner chatting it up with her friends most of the time.  Our food came out late, and it wasn't hot at all...as if it had been sitting up at the window 10min. longer than it should have.  To top it off, the general crowd in that locale wasn't Fratty, but a bit too Ghetto for my tastes.  Arguments and fights were breaking out, people chasing each other around the restaurant.  I was really itching to leave and head to McDonalds.  If I ever do come back here again, it will be during a time with the least amount of people.\n\nDespite the food being cold, it still had a nice heatness to it that I liked...so Kudo's to BW3 for its extra star.  You should be proud.", "author": "Peter A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2008-07-03", "description": "Absolutely horrible service and even worse food! Ordered dozen wings and received one less..11. Ordered grilled chicken caesar salad and received wilted romain lettuce atop a large iceberg lettuce heart adorned by hard and dried chicken. But to top off a lousy visit I was given somebody Else's check. A higher check at that!! Definitely WOULD NOT RECOMMEND!!!\n\nCLARIFICATION: My sister wrote this, though she has her own Yelp account. But she told me the story, it sounds pretty legit, I'll vouch for her review. =)", "author": "Sarah W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-01-26", "description": "OK, first of all, it's in a mall, above a big train station. So don't expect anything other than a transit center pit stop restaurant. But I kinda like the experience of being magically whisked away to generic suburban chain restaurant while staying close to home in Brooklyn.\n\nThe wings are fine, not too pricey. Nothing spectacular, but after shopping at the Atlantic Terminal Target (where the shelves have been picked clean) you might be hungry for a snack of some chicken and a beer. All in all it's what you'd expect of a mediocre chain. I'll be back next time I'm shopping here.\n\nGood place to bring the kids, too.", "author": "Jessica S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-18", "description": "I love their wings!! SO far I havent had a problem with the service, so I cant comment on that. Normally, I go on Tuesdays which are 50 cent wing days...a pretty good deal!!! They have like 18 different flavors to choose from from sweet to hot and everything in between. They also only sell them in increments of 6, which is a perfect portion for me!!\n\nSo far Ive tried the honey bbq, parmesan garlic, hot bbq, asian zing, carribean jerk, and Ive loved them all!! Seriously, if you don't mind Ok service and somewhat of an afterschool crowd ...go for the wings!!", "author": "Sam B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2009-10-27", "description": "The best part about this place: UFC!  My BF and I were able to watch the fight and my football game at the same time.  I was really disappointed in the beer selection.  We drank Miller Light all night because it was the best deal.  The food was alright/nothing spectacular- I would have expected better fries from a joint like this.\n\nYou really can't expect much out of a chain like this one.  \nThe 2nd best thing about this place was our server- TJ you rock! Thanks for keeping up happy :)", "author": "Sara R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2008-08-05", "description": "ok..I know you're looking at all the 1 star reviews below mine.  I did too and went into this with pretty low expectations.  I am a die hard wing lover.  If you read my reviews I go to pretty much ANY place that has any mention of halfway semi kinda almost descent acceptable wings.  Here are some bullets to sum up experience\n\n- Yes..Even though there is a place for a hostess...a paper that looks like someone is marking who gets what tables tables...a sign that says 'Please wait to be seated'...ya..you have to seat yourself.  I found this out after 5 minutes (I timed it because of previous reviews and was curious if a place could really be that ignorant.)\n\n- Tuesday...Wing Night.  $.40 cent wings...Not busy.  Thats what I don't get.  No server was slammed, nobody actually hustling around trying to get out of the weeds...Everyone just kinda hanging out talking around being pretty casual in general.  I just don't get how service is slow (note: I'm only counting the beer service..more on the wing service in a minute).  It started off great after I seated myself and a greet about 2 minutes after I sat down.  But the greet to first sip of beer was unsatisfactory.  A good 5-10 minutes.  I saw the server.  It looked like he was drawing a picture with craysons with a customer.  His service was average throughout the night.\n\n- Time to order till delivery?  WAY too long.  I use to work in a kitchen and know how long this takes to cook.  Not that long.   Not nearly enough to watch 2 and a half innings in a baseball game (that was not 3 up 3 down style).\n\n- The building was nice.  It was clean and had PLENTY of large projector TVs with many sports games on.  Big fan of that. \n\nThe key question: Were the wings good?\n- Ehh...I wasn't blown away but wasn't like 'eww'.  Contradictory to what others said I found the wings pretty plump.  Even plumper than other places.  Maybe they are reading this feedback.  But again.  For a place that specializes in wings I was expecting a little more.  But they were good.\n\nBottom Line: Better than average wings, Go on Tuesdays for a good value.  Lots of space and great place to watch sports.  Pretty good time and would be back.  It is NOT as bad as people say on here.  But its not the best experience either.", "author": "Dan F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-10-27", "description": "As part of my daily commute, I change trains at Atlantic Station. Sometimes, when I don't feel like going directly home, or if I'm in the mood to eat out, I'll make a stop here. Buffalo Wild Wings (or BW3 for short).\n\nThe place is always filled with an ecclectic crowd, which is fun. On weekends, the wait to get a seat can be a bit long, but once you're seated, the service is great. Probably a solid 90% of the waiters/waitresses there are absoulutely spectacular! And the other 10% are awesome. I'm not sure why all the good servers in the area go to BW3s, but I'm not going to complain. I've never had bad service.\n\nThe food is not the best, but it's good. You know how that goes.\n\nI'm not really into sports, but I guess that's one of the reason people go there. I mean, they do have lots of TVs playing lots of sports. And people yell and stuff when balls go through things and stuff. Meh, you know sports.\n\nCheck it out if you're in the area.", "author": "Dann B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-04-19", "description": "wings are some of the best in town great place to come hang with friends watch a game or so drinks aren't the best shots are expensive so beware if order just shots", "author": "Jermaine I."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-03-26", "description": "Where do I begin. I came with a party of 4 and we arrived at 8:45pm and asked to be seated. Seats weren't available so we sat at the bar. An hour and a half passed and so we went to the manager (Javier)  who then told us we would be seated now. 20 minutes later we still weren't seated. One of the amazing employees took it upon her self to make sure we were seated, so much to the point where we watched her clear the table. We than sat and begin eating our food. When we asked for the check we told our waiter we wanted to speak to the manager to inform him about the service thus far. He didn't care to much to hear about it and decided to give us a 10% discount. As we continue eating the food one person in the party takes a bite of the wing and finds a long brunette hair inside. When he came back and informed him of this, instead of apologizing he says we should have informed him of this the first time we were at the table as if we should have found the hair sooner!!! I then asked to be refunded for the entire check and he said no, I'm only refunding you for the wings. I myself am a general manager of a restaurant  so I know proper food handling procedures. On top of this there were  fruit flies flying around the table as we ate!!!", "author": "Jai L."}], "servesCuisine": "American (Traditional)", "priceRange": "$11-30", "name": "Buffalo Wild Wings", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "139 Flatbush Ave", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/ENoWKg2ScYUtSOPF-xpcJA/ls.jpg", "@type": "Restaurant", "telephone": "+17189439453"}