{"aggregateRating": {"reviewCount": 573, "@type": "AggregateRating", "ratingValue": 2.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-18", "description": "Sriracha sizzle is my favorite. Amazing place with great food but think they can improve in there customer service.", "author": "Jess M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-12-12", "description": "If you're looking for some good bar and a place to watch your sport in Brooklyn.\nI suggest it Buffalo Wild Wings \nThey're showing it, whether it be basketball, football, baseball, golf, soccer, etc. A seat anywhere in the restaurant will give you a view of a television. You can even request your channel. \nThey have a great variety of delicious sauces for the wings too! \nJust Yummys!!\nThese are so nice that customize ownflaver source and Level of the hotness  \nThe service here is not good, our waiter was pushy and admitted\nAnd fogot our order twice.\nWild Wings for tues wing special.", "author": "Loong H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-03-08", "description": "Great place to unwind after attending a Brooklyn Nets game!\n\nYou pretty much have to fight for a bar stool \u0026 table near the bar if you don't want regular seating. Aside from that, good food + mediocre service is what you will get.", "author": "Philip M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-01-14", "description": "So many people working and they are all ignoring the customers. I had to ask 3 servers. You just see the employees having conversations amongst themselves. This is he third time I visit and it does not seem to change.", "author": "Tina B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-02-29", "description": "I love BWWs like a fat kid loves cake. So I pretty much don't care as long as I can get my fix. However, I do have to say this location isn't the best on service. They are very busy--seeing as they are at the Atlantic Terminal--so just be prepared to wait (to be seated). In terms of service, it was a lot better last time I was there but its probably not what a lot of people would rate high. \nAll these things being said, I'm still gonna continue to go and eat their delicious food.", "author": "Chantalle U."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-08-14", "description": "Food is good but service sucks. Waitress showed up once during my meal, to bring me water and my drink and forgot I even existed.", "author": "Rufina Y."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-02-02", "description": "The service here is terrible. Me and my sister was on the line and people who were behind us got their food before us. They offered an hour to us to get a seat, is the food worth waiting for an hour? Making reservation for a seat online is a pain in the neck. Unfortunately I lost my nerve and we left and without waiting an extra few minutes to pickup the food. It felt like they didn't want the poor people in the back by the bar. A huge upset because my sister wanted to take me out to eat. Keep the $21 my sister gave you and I hope my words speak to others about this place. Not recommended to anyone who's looking for a fast and friendly service.", "author": "Thy T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-22", "description": "Right away I felt I was in the presence of sportsman when I entered the Buffalo Wild Wings in Brooklyn. It had been a while since I socialized outside of my neighborhood's cafes and bookstores and, dare I say, it was getting a little stuffy in those intellectual dungeons.  \n\nTo the surprise of many of my readers, I was once an athlete in my heyday.  As an all-county, co-ed badminton player, the local competitors nicknamed me \"daffodil\" for my grace on my toes. Ultimately, my athletic years came to a close after high school and I moved onto the bottomless pit of conversing with intellectuals.\n\nAdmittedly, the environment in the Buffalo Wild Wings was intimidating. Many people in attendance had the names \"Manning\" or \"Beckham\" stitched to the back of their shirts leading me to initially think I was in a wedding party with these two families. When I reached my table, all the fans around me were letting out primal roars in reaction to the American football being played on the surrounding televisions. It had been a while since I screamed without a conscious; the last time I yelled so loud was at my late-cat Rhubarb for getting overly handsy with the other cats in the neighborhood.\n\nIt took me a few minutes to settle in and feel comfortable again in the athletic ring. Beatrice, my delightful waitress from Ames, Iowa coached me through the afternoon. She refreshed my memory on American football and told me, \"Buffalo Wild Wings is the place to let go of your proper table manners.\" I left wandering if Beatrice was coming onto me. \n\nSoon enough I screamed and hollered along with the rest of the sportsman in the bar as Beatrice brought on pints of beer and her favorite chicken wings. I stuffed my face without any regard for my appearance or physical health.  Finally, I felt like the man I had been keeping inside for all these years. \n\nI stayed for over two hours at the Buffalo Wild Wings and took pleasure in the entire experience. On my way home, I passed by my local bookstore and through the store window saw my good friend, Genevieve, leading her beloved puppet show \"Socialized Squirrels.\" She was midway through the first act and I surely could have stopped in and said hello. Instead, I skipped on home, plopped on my couch, and watched football for the rest of the night. I felt alive. \n\n5/5 - I feel invigorated from my experience here.  Thank you BWW. \n\nYour Dutiful Critic, \n\nTheReverend57", "author": "Dylan S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-09-25", "description": "Just horrible.  Nachos were abissmal. (sent them back and got the same thung) Burger was horrible.  Wings were slightly better than bland.  Mac and cheese was a joke. \n\nWaitress was cool.  Not her fault. \n\nI've never written a bad review.", "author": "Andy S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-07-17", "description": "Came here midweek close to closing. Smallish mall location compared to what I experienced in Florida. Clean, open layout in the seating area. Lots of unobstructed views of televisions. Lighting is bit too low for my taste in the dining room. \n\nFood took quite a while to arrive considering we only ordered a mediterranean salad, chicken wings and mac n cheese as a side order. \n\nSalad was good although all of the items were layered as opposed to being tossed/mixed. My dining companion had the bulk of the wings and mac cheese and was of the opinion that they were adequately delicious.\n\nWould return to experience other items and make a full judgement during a peak service time.", "author": "Mardory V."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-01-20", "description": "The service is spotty, at best. Sometimes you get a phenomenal server and your meal is seamless from start to finish. Other times, you're trying to get the groups of waiters and waitresses BSing in the corner to pay attention to you long enough to take your order. It's a 50/50 crap shoot. \n\nSo, BWW took the cheese-stuffed fried jalapenos off the menu. That, in itself, strips away at least a star and a half. The fried 'shrooms are still there and the wings are almost always consistently good. The drinks are generally mixed well and decently strong.\n\nThis is still the spot my friends and I hit up before any event at the Barclays Center. But, seeing that they took my favorite thing off their menu and we just never know how the service is going to be, maybe it's time we start venturing to places more than half a block away from the venue. If you are going there before a Barclays event, you'll have an easier time at the bar area rather than the restaurant if you want to drink \u0026 eat. Again, though, the service is hit or miss there. Just make sure you know who your waiter or waitress is so you can flag them down as needed. (That will save you time and won't make you late for your event.)", "author": "Katherine M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-05-30", "description": "I love b-dubs.  My husband and I are regulars.  The service at this location has gotten so horrendous, we have decided to only visit the midtown location from now on.  We generally sit in the bar seating area and have waited up to 30 minutes to be acknowledged.  We have also waited close to 45 minutes to receive our orders!  This hasn't just happened once, or twice, I'm talking about 7-8 times over the past year.  It's disappointing, because when this location first opened, it was great!  But it has severely fallen off!", "author": "Sara W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-06-07", "description": "I rally like  giving 5 Star reviews- and I really like the wings and fries at BWW - but I had an order delivered and I was so disappointed-   I paid for celery and carrot sticks - and I really LIKE having that with my wings, they left that out of a simple order. Very frustrating.  And the blue cheese dressing is terrible,  watery and sugary - -no blue cheese to be found.  Bring your own dressing - the wings were very good and the fries are excellent - -and they are GLUTEN FREE!!!", "author": "Cindy L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-01-23", "description": "Went here last night and they wouldn't let me drink because my licensed expired!  The waiter was rude and the security guard took his job way to seriously. Food was decent,  nothing to brag about.  Been here a few times, I would recommend the times square location better!", "author": "Jessy L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-03-26", "description": "It's a BWW. Came here for dinner after the circus at Barclays center finished. The service was pleasant but slow. The food was not spectacular. We didn't have a ton of options so this worked out OK. They have TVs, food, \u0026 alcohol. It's family friendly.", "author": "Tony T."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-03-14", "description": "Horrible service. Me and my boyfriend waited there for a hour and a half for our order.\nThe whole time the waitress kept saying oh it will be here and 3 more minutes. Till around the hour mark when she finally admitted that our order got sent to the wrong table. And that they was making the food all over again. And that they would give us a 10% discount. So we waited for about a half hour more. And got more lies of 3 more minutes. We just got up and left, and went to eat a subways downstairs. Worst service I ever had at a restaurant. Wasted a hour and half of my life there.", "author": "Mini L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-07-17", "description": "It was my first time at BWW and I didn't realized that I'd walk into a busy night like game night. The hostess was nice with explaining the estimated time for a table. \n\nIf you're coming here just to eat, don't come on game night. It's super packed and crowded. Long waiting times and everything's just backed up. \n\nSo, Bring a non-expired 21+ ID to get seats by the bar instead of waiting 1-2 hours on game nights! There's TV in every direction of the restaurant if you are interested in coming here for the game. \n\nI ordered some food and drinks from our waiter which was attentive even on such a busy night. \n\nThe Parmesan wings were just alright, nothing spectacular about it. \n\nMy boyfriend really like the Asian zing but it was too spicy for me. \n\nThe buffalo wings were dry and not wet rubbed enough. \n\nThe Caribbean jerk was spicy and made me lose my tastebuds. \n\nI ordered a Bahama Mama and it was not something I would order again. It tastes like your typical open bar, vodka with oj and cranberry type of drink.  \n\nOverall, everything was alright but not spectacular. I hope to be more amazed the next time I dine there.", "author": "Carrie C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-12-29", "description": "Just finished shopping at Atlantic Mall and was hungry and decided to stop by here for a quick bite. Wait time is approximately 20 minutes around 2 pm on a Sunday.\n\nPROS:\n- FRIES are thin and very tasty \n\nThe Okay:\n- Boneless Honey BBQ wings (Small Size) - pretty good. sauce is similar to McDonald's BBQ sauce. I love BBQ sauce so this is pretty good. \n- Cheeseburger slammers - meat was dry. had better burger elsewhere but the fries that the burgers come with are great!\n\nCON:\n- long wait time: waitress takes a really long time to come back and check on you and bring you your food\n- Chicken Wrap - taste like McDonald's chicken wrap. nothing special. \n\nNote: great place for guys who like to watch sports. you can hear guys cheering during the football game when there is a touchdown. \n\nAlso this was too much food for 2 people to eat. I was stuffed.", "author": "Teresa C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-01-17", "description": "Quite simply, this place keeps going downhill. My friends and I meet up to grab wings every few months and tonight was an absolutely terrible experience. We sat for 20 minutes before anyone offered to take our order. No water, napkins, silverware were provided to us during the time we sat there waiting. One of our beers came but the rest of our drinks did not show up until AFTER the food came out and was being eaten. Additionally, the french fries came out 45 minutes into our dinner after telling the waiter THREE times that we were still waiting for them. One of the drinks tasted very flat and a different drink was requested with the original only having a sip taken. This original drink was charged on a separate bill along with the replacement drink which was added by pen to the main bill. \nThe best part was when the waiter asked if we wanted another round of drinks after we finished our meal and beers. It was asked as if he had taken care of us all night and were willing to stay longer for more punishment. Sure, we probably would've had a second beer if we had received our first beer sooner but we did not. Due to this, BWW failed to draw more money from our pockets and probably has lost our business to a competitor.\nWith that being said, the wings and fries weren't too bad...", "author": "Mike G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-05", "description": "I enjoyed my last visit to BWW this past Tuesday and it was a pleasant surprise. It was after 11pm so I don't know if they do it all the time but we got carded at the door like it was a club. He then told us that we would have to go to the other side to the host stand if we want low tables, but the high tables by the bar were self seating. \n\nJust trying to eat right away, we sat at the high tables and Thank God we did because we were greeted and served by Adriana. She gave great service and was very pleasant and helpful in doing so. She informed us that it was 60cents for traditional wings on Tuesday's so we went in that direction and ordered 24 wings, 6 Hot BBQ, 6 Honey BBQ, 6 Garlic Parmesan, \u0026 6 Lemon Pepper \u0026 a basket of fries. We liked all of the sauces except the Hot BBQ. If you get Lemon-Pepper, eat them first because they're perfect when they're hot. \n\nThe KnockOut Punch was good but it did not \"knock\" me out. With a name like that, it should have! Squeeze the lime into it for the full taste. \n\nMike, one of the managers, is a cool dude. Came over \u0026 checked on us to make sure everything was ok.\n \nThe only thing I don't like about this BWW location is parking. Luckily we got a spot across the street but it was late and we got lucky.", "author": "Tiffany M."}], "servesCuisine": "American (Traditional)", "priceRange": "$11-30", "name": "Buffalo Wild Wings", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "139 Flatbush Ave", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/ENoWKg2ScYUtSOPF-xpcJA/ls.jpg", "@type": "Restaurant", "telephone": "+17189439453"}