{"aggregateRating": {"reviewCount": 573, "@type": "AggregateRating", "ratingValue": 2.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-28", "description": "My friend and I always to go his buffalo wild wings. Wings are good beer is cold service is great.  Since we are regulars we found out that some waitresses r better then some. We always ask for one in particular that is Danielle. She always a sweetheart never gives me a problem or an attitude. She makes you feel welcomed and never let's your drink get empty (which is big for me). Nikki's and Cindy are also great waitresses  but danielle is top notch.", "author": "Chris M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2007-06-25", "description": "It is what it is.  The wings are pretty tasty (medium, jerk, asian zing and honey bbq leading the pack).  The service is hit or miss.  Onion ring sauce is incredible.  Overall, good low key place in an area needing of less formal dining.", "author": "BIG S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2008-03-31", "description": "After seeing this on the stock exchange, I was pumped to try it out. I am not usually a big fan of chain restaurants, but it's wings. You can't go wrong with wings. The wings sux! I ordered 24 pieces ---- i only ate 4 pieces. I didn't want to die from sodium overdose. Ick.", "author": "Kent W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2008-10-31", "description": "Primarily a chain located in the North East they are known for their wings.  But they also have fantastic sides such as sour cream and chive potato wedges", "author": "Foodie C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2009-06-22", "description": "I would come here more often but once again I was let down by the service. Came for Daddy's day with my family. I kid you not we sat 20 minutes and our waitress never came over. After some questioning the manager came over to take our order. When a waitress brought the food and we asked who was serving the table she said the manager. The manager is waiting the tables...\"Really?\" The she told us the kitchen was backed up. \"Seriously?\" I informed her 4 other tables had been served before us an one couple came, ate and left. We stayed the wings are good. Lots of flavors but this is the second time I've gone in and had horrible service. Next to tip I noted here's a \"tip\" get better service. Stick to take out.", "author": "Anthony D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-10", "description": "i live mile away from this place ...nice bar, nice food , and nice staff..if u want to watch ufc fight ...this is the place to go to , they have big ass tv everywhere , i love this place", "author": "Harp H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-07-30", "description": "This place was packed when we entered. I was not thrilled with the neighborhood but I thought that because it was busy the food would be good. I was so beyond wrong. I have never had worse wings in my life. This place blows in all aspects: food, service and location.", "author": "Romana R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-05-08", "description": "if you eat here, take your food with you to go! this place is super urban (ghetto) . cheap wings attract the most undesireables looking for a bargain. if you have the patience to wait, wings are decent.", "author": "Sharon B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2009-04-04", "description": "the service was slow and rude. The food was average and came out cold. Even the feature they are known for, their wings, were below average. To top it off the whole place was dark and dank. \n\nAlso the TVs were poorly place and their pictures were poor quality. DO NOT BOTHER", "author": "Ryan O."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2008-03-11", "description": "So, I'll begin with a disclaimer of sorts; I HATE chain restaurants.  Everything about them, usually.\nThat said, I was near this place, they had free wireless and I do LOVE buffalo wings.  I figured theirs must be at least decent, pickins were slim in the area, and I wasn't looking for a \"Great\" dining experience anyway (I was carrying a bunch of crap and really needed to take a break.)   I walked in, trying to decide if I was supposed to wait to be seated or seat myself.  Nothing led me to believe that I'd ever be helped and couldn't get anyone's attention, so I took a seat in the bar area at one of the tall tables.  15 minutes or so passed, I had \"read\" the menu; I was definitely getting wings, but not one of the people in uniform stopped by my table.  One of the waitresses sort of smiled and said hi after checking on the girl sitting alone at the table 2 feet from me.  But, she never came back.  Finally the girl eating next to me told me I needed to flag down somebody or I would never get service.  After a couple unsuccessful attempts at that, I finally got one girl to stop.\nShe reluctantly agreed to take my order.  When she didn't undertand that a \"tall Stoli soda\" did not mean 2 shots, she told me  maybe i should go to the bar and order that.   I told her, very nicely, that she could just order me a stoli soda.  I also ordered my wings.  She then came back to confirm that I wanted my stoli soda with lemon; i said yes.\n10 minutes later, i got my drink; no lemon.\n15 more minutes later or so, she came back and asked me if i ate yet.\nI said no.\nShe asked for my order again; no explanation or apology, nor did she ask me if i wanted another drink; my glass very empty by now.\nAt least another 15 minutes later after that; NOTHING.  No wings, no anything else.  I could see my waitress talking with somebody across the room. I put $8 down on the table, slowly got up and put on my jacket, gathered my bags and looked directly at her.  She looked right at me getting ready to go and continued her conversation.\nI actually sat there for over an hour, beginning to end.\nGod, I DO HATE CHAIN RESTAURANTS!!\nAnd now I really need a wing fix!\nZERO   ZERO   ZERO    ZERO STARS!!", "author": "bklyn b."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2009-04-14", "description": "First things first - If you can't sit at the bar RUN back into the mall and get the hell out of there as fast as possible.  Restaurants should not get tax write offs for hiring the insane and mildly retarded.  I've never been violent or forcefull with waiters but the BWW staff seems to want to start fights.  I once watched a waitress spill a full glass of coke and then she laughed and never cleaned it up.  An old man didn't see the spill and he sat on it without knowing.  He started yelling and not one person addressed his complaint.  He just left with a wet ass.  Secondly, don't order anything but the wings.  I foolishly ordered the chips and salsa once and I woke up the next day with a brown mark on my chest.  I think my body was telling me that I had actually eaten shit.  My only recommendation are the boneless WILD (sauce) wings the happy hour with $2 pints of domestic drafts.  Remember, only sit at the bar.  You don't want to be stuck arguing with a retarded kid from East New York about why the food takes an hour to arrive at your table.", "author": "Brian A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2007-12-08", "description": "Bww is a cool place to eat some wings and drink some beers. This is not a five star fancy restaurant, so of course the service is not going to be all that. The place gets pretty crowded on big nights. For example on tues and thurs they have discounts for their traditional wings and boneless wings. So sometimes the servers are running around trying to please everybody. So if us the customer can understand that then this place is not as bad as people see it. We just have to be patient and have fun. Also when theirs a big game on it also tends to get busy so again if you want fast food and service do not go to Bww, go to McDonalds. Its right down stairs from Bww.", "author": "dayna b."}], "servesCuisine": "American (Traditional)", "priceRange": "$11-30", "name": "Buffalo Wild Wings", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "139 Flatbush Ave", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/ENoWKg2ScYUtSOPF-xpcJA/ls.jpg", "@type": "Restaurant", "telephone": "+17189439453"}