{"aggregateRating": {"reviewCount": 573, "@type": "AggregateRating", "ratingValue": 2.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-02", "description": "I've never dined in but the wings here are great! Especially on tues/thurs for the discounted wings/boneless wings. The breeding on the chicken is just something else - crispy and thick. My favorite flavors are Asian zing, mango habanero (really spicy), and Thai curry. The take out window area is normally really crowded during dinner time, and the cashiers can be a little short, but they do an awesome job for the amount of wings they push out and the amount of people they serve.", "author": "Sarah K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-01", "description": "I came for take out and Tiquana was AMAZING!  She took care of the longest line of customers and super efficient and friendly.. I called my order in and she remembered my order to a tea.. She was so nice. Thank you BWW for a nice experience!!", "author": "A S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-08-18", "description": "I went there a couple of times every time there is a different issue but this time I'm really pissed off because I told the waiter and he didn't do anything about it. First it was a really long wait to get a table second time the waiter double charged me but third and not least this time I waited for 20mins to get them to notice I'm sitting on the table and I found feathers -_- yes feathers I'd like to Tell you  guys watch out its usually dark there so pick a table that has good lighting", "author": "Zeinab E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-01", "description": "For what its worth the BWW at the Atlantic Center is pretty cool. I don't eat chicken so when I come here it is usually to place an order for someone like my mom, cousin, or friend who asked me to pick them up an order or two of wings on my way home. Because I am a push-over I usually say yes and go out of my way to buy and bring it to them. \n\nTuesdays and Thursdays are discounted wings (traditional and boneless) days. \n\nFavorite sauces include: \n-Mild\n-Honey BBQ  \n-Hot\n-Hot BBQ \n-Caribbean Jerk \n\nService is pretty friendly. I've only ever done take-out. I've never sat down and been served.\n\nTIP: Try to avoid here during after-school hours: between 2:00 and 4:00pm because this place is just crawling with JHS and HS kids who are loud and solicit in and around the area. I never knew it took 5 teenagers to place 1 order for 8 wings! LOL \n\nI definitely wouldn't come here before or after a Nets game or any other event at Barclay's across the street.", "author": "Rachel D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-09-22", "description": "I wasn't allowed in to this establishment because I wasn't carrying a NY state ID or passport, and was told that this was a New York State Law requirement by the manager. This is the first time in 12 months in NYC where my international drivers licence was not acceptable. I'm about to turn 35. SMH and never coming back.", "author": "Jon T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-17", "description": "I felt obligated to leave a note. I had an awesome meal there last night! What made it great was our fantastic server. Been to a lot of \"classier establishments\" that had much worse service. They should take a lesson from our waitress last night. Thank you.", "author": "Jesse P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-25", "description": "Friendly staff. Waited a long time to just get seats maybe 1.5-2 hrs ~ they have some decent fries that anyone would think is tasty because of the long wait. The wings are good when you get anything that does not kill your tongue like the blazing  wings which my friend ate first and for him the experience was terrible because he could not taste the flavor of any winga but whose fault is that besides his. My experience with the wings are decent and I will go again to but definitely not alone.\n\nP.S any place that refills my water gets +1 star", "author": "David L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-11-08", "description": "This place sucks...the winga seem smaller than everyother qild wings i have every been in and the service is shit....literally  shit...i order a beer, a appetizer,  and wings...i got a flat beer and baby wings...my kids food was burnt...dont ever go here....i will never be back an eunice the waitress really needs to get her life and get another job...cause you ate making it hard for the other real waitresses in the world..", "author": "David T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-15", "description": "Great place to watch the games. The wings are great, my favorite ones are the blazing wings... BUT BEWARE THEY AREN'T FOR PEOPLE WHO DON'T LIKE VERY HOT THINGS, your mouth and throat will be burning for at least 10min after you taste one.", "author": "Jonathan B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-04-19", "description": "Horrible super ghetto and it wasn't even a game day. Waiting time for 2 was over an hour and larger parties even longer may I add there's only 1 exit and entrance worse bww ever...\n\nThe good? Wings thats it.", "author": "Joey M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-10-20", "description": "Normally, I wouldn't go to a chain in NYC (except for KFC and other fast food places), but I had good reason to on October 18, 2010: AYCE wings and fries on Mondays from 7-12 for $10.99. \n\nChallenge accepted. \n\nOur party of 10 was seated quite quickly. We were delighted to see the options for both rub and sauce for both wings and fries. Possibilities were endless.\n\nThe way this works is you order individually. First round comes with 12 wings and 2 sauces, with each subsequent wave producing half that. \n\nLet me point out now that while we were seated quickly, it took 45-60 min for our order to be taken and food to arrive. A sign of things to come. \n\nMy first round consisted of Caribbean jerk sauce and some spicy mango concoction with salt and vinegar fries (I had actually/accidentally ordered them as 'chips'). I challenge you to find a better combination. \n\nUpon arrival, we played it smart and ordered our next round, assuming it would take forever anyway. It would. \n\nThe spicy mango was hot, but I decided to take up a secondary challenge to my 30-wing minimum... See how spicy I could go. \n\nI went up in spiciness but decided I could go to their max for round 3. I ordered blazin'. \n\n(If you recall, service here is slow. I preemptively ordered another beer to assist me in my upcoming battle.)\n\nThe blazin' wings were just that. Minimal flavor, maximum burn. My mouth was on fire and I was drenched in sweat. I was milking my beer as i was still waiting for my next one. I would soon succumb to the fire, finish my drink and resort to fries for relief.\n\nMy downfall. \n\nI would not recover from this setback. I could go on to a mere total of 22 wings, aka fail. My last round was \"hot BBQ\", a sauce I do not recommend. Any desire or hope I had of continuing was negated by this flavor. \n\nTo anyone willing to take the challenge, I would make the following recommendations:\n\n1. Order wings + a beer + soda (unlimited refills)\n2. As soon as wings arrive, order the next batch and the next beverage.\n3. Repeat as necessary, making sure to have at least 1.5 beverages on hand for spicier sauces.\n\n+1 options\n+1 bang for buck\n+1 taste\n-2 service\n\nGlad I came. If their service ever improves then I may return. Otherwise, I'd much rather go to Croxley Ales House for my wing fix.", "author": "Timothy T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-11-28", "description": "It's fine for what it is. If you're on your way into a concert and need time to kill, want to watch a football game or are just in the mood for decent beer, cheap shots and bar food, it'll do.", "author": "Alyvia M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-09-21", "description": "The one star is for our original server, she was the only pleasant experience in the whole visit. The food runner spilt sauce on one of our jackets, then followed that up by flicking the sauce on his hand onto one of our sweaters. After 45min of waiting for the manager, we eventually were able to get our meal comped. Never had our drinks refilled, terrible customer service. The  food was about what you would expect from a chain wing spot. Never going back.", "author": "Derrick O."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-01-21", "description": "WORST RESTAURANT EVER! PERIOD! Very Unprofessional And Rude. I Went There With A Couple Friends For Wings And Drinks.. However We Ended Up Leaving Due To The Disgusting Service And Surroundings. For Starters, We Had To Wait Over 20 Minutes To Be Seated And It Was Not Busy! There Was No Hostess At The Booth So The Security Guard Had To Seat Us. It Was Not Even Busy.. The Tables Around Us Were Sooo Dirty As If They Didnt Clean Them In Hours .Then Our WaitressWas Extremely Rude She Was Constantly Rolling Her Eyes And Walking Away From The Table When We Were Ordering. One Of My Friends Called The Manager For Further Assitance (An Old Caucasian Woman)  And She Says \"It Really Doesnt Matter You Guys Can Leave I Dont Care!\" Like What Manager Says That? She Was Nonchalant And Rude ! We Left After That. I LOVE WILD WINGS But Will Never Spend My Money At Any Location EVER AGAIN. SAVE YOUR MONEY AND THE TROUBLE. Go Eat At A Place Thats Respects You And VALUES Your Business.", "author": "Ariana B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-20", "description": "Friendly staff, great service, great food.  The waitress said the wait for our food might be long due to the number of patrnos there to see the basketball game across the street that night.  We didn't wait long for our food though.  We waited too long for our bill. But all in all everything was all good.", "author": "Laura R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-04", "description": "Five stars only go to our server, nick. Come on Thursdays after work and sit on left hand side in bar area. He was very attentive, respectful and prompt. He explained how things were done and why we could not order two beers at once per person and gave us the extra bleu cheese. He actually spent some time while taking our order and made us feel welcome.", "author": "Katya M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-12-06", "description": "Sigh..........I've been here before once or twice and it's usually pretty decent the service is usually ok but I went this Saturday and it was terrible! Our food order was wrong, the food was pretty good, whatever wasn't cold when it came to the table that is, but the Mac and Cheese was like Mac and Cheese soup and was that disgusting half hot half cold you get from a low powered microwave. It was worse than KFC mac and cheese. The waitress spilled a tray of onion rings on me and tried to give me the rest and said \"At least I saved some hehe\" And to top it off the manager tried to \"make it all better\" by giving me $3 off my bill....\nThe only saving grace was the $20 in gift coupons I was given after making a big deal of how upset I was. I wish I would have gone to Applebees instead...", "author": "Mardi G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-04-18", "description": "The year is 2012. This is a sports bar in the year 2012 and none of it's TVs show games in HDTV. There are dozens of TVs in this place all showing games in standard defintion. People stopped watching games in standard defintion way back in 2003. In 2003 Herbert hoover was president, the top TV show was The Dick Van Dyke Show and the cost of a lap dance was 75 cents.\n\nThey got a bunch of different wing sauces but who cares if your watching a Knicks game that looks like the Zapruder film.", "author": "Ian R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-10", "description": "Great service - quick with orders in the kitchen of course have great wings but the best part would be they were accommodating when we asked to be seated to watch the patriots game they made sure we were in view of three screens for coverage!", "author": "Pamela Q."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-04-16", "description": "A decent chain restaurant (are there any out there that are more than just decent?) located in the mall on Atlantic ave.\n\nSetup as a chain version of a sports bar, with the prerequisite menu of wings \u0026 beer, potato wedges and other stadium-style foods. While they do offer sandwiches, salads, burgers, wraps and other foods, their big staple are their wings (traditional and boneless) and sauces. The menu is basic, with few non-fried options. Don't look for anything green here, unless it's fried pickles. \n\nThe big draw is the wings. Offering over 15 different sauces for their wings (elevating in heat from Sweet BBQ to Blazin'), you can get your wing fix satisfied. Ordering different sauce combos isn't a problem either, so you're not pigeonholed into one flavor for your order. That's a plus if you want your 6 Honey BBQ, 12 Carribean Jerk, and 6 Blazin' wings, or whatever floats your boat. \n\nSides again are basically anything in potato or cheese form (or both). They also offer a variety of beers on tap as well as a few signature cocktails. Supply is hit or miss, so make sure you have a back-up drink in mind.\n\nBeen here about 3-4 times and each time has been decent. Nothing glaringly bad, but nothing that knocked my socks off either. Again, it's a chain, so don't expect the best food you've ever had. It's a good enough place to hang out with a group of friends, pound down some food, and have a good time. Don't bring a date here. \n\nService is okay. staff can be nice and staff can/may forget about you. Again, it's hit or miss. \n\nBiggest issue is the wait. Never been seated in less than 30mins. The place is usually packed, and it gets worse as the night goes on. Also, after 9pm, no one under 21 is allowed in, even to eat. Kind of odd, but I understand it's hard to keep track of who's underage when the place is always packed. \n\nAnother thing is the setup. Waiting area is tucked behind a wall, so good luck being noticed while you sit there and wait for 30-45 minutes. Tip: Stay by the host if you can, that way they won't forget about you or skip you altogether. Gets crowded by the entrance too.\n\nAs for the environment, its loaded with enough TV's to give you an epileptic fit, housing more TV's than an OTB in Vegas. A Sports bar for the A.D.D. generation.", "author": "Joseph F."}], "servesCuisine": "American (Traditional)", "priceRange": "$11-30", "name": "Buffalo Wild Wings", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "139 Flatbush Ave", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/ENoWKg2ScYUtSOPF-xpcJA/ls.jpg", "@type": "Restaurant", "telephone": "+17189439453"}