{"aggregateRating": {"reviewCount": 573, "@type": "AggregateRating", "ratingValue": 2.5}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2019-03-16", "description": "Waited 30 mins and was Told that my waitress was In a pre-shift meeting and had my drink taken by another waitress. When my waitress FINALLY arrived she told us we had to take our orders again. For drinks. Gave us an attitude told us she got there and had nothing to do with what happened before(Dominique). WE WAITED THE ENTIRE TIME WITHOUT WATER. So disappointing", "author": "Diana W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-03-14", "description": "Sometimes you just want some wings on a Tuesday when you're on a budget even when you know you're about to have frozen chicken wings nothing wrong with that we've all been there decent wings AMAZING ONION RINGS the only thing I hate about this bww is the service is trash the service is so disgusting no one wants to work in there no one wants to take your order they're always on their phone I literally had someone refuse to take my order at the takeout stand because there was an hour left and it was \"dead\" and they wanted to leave", "author": "Lear N."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-12-02", "description": "I am obsessed with Buffalo Wild Wings and we go to this restaurant no matter where we are traveling in the world, but this was the most disappoint experience at this location. We made reservations at this restaurant 8 weeks prior in anticipation of the SEC championship game. Upon arriving the hosts told us they did not have our reservation. We were seated in a table at the very back of the restaurant where we could only see one TV, even though we told them the reason we came was to watch the game. They finally changed our one TV to the game we had come to watch after us having to ask three times. About 20 min later they sat another family next to us who wanted to watch a different game so they changed the channel of the one TV that we could see. We asked the family if they would mind watching the game on another TV that was also in their range of view. They conceded and we went to ask them to swap the channels. The manager came over and threatened to kick us out if we were \"fighting over the TV's\" when we had simply asked to have them swap so that everyone could be happy. I have never felt this way in a Buffalo Wild Wings before and am astounded by how unaccommodating and rude the manager of this restaurant was. \n\nOn the bright side, a guy named Bryce was our server and he was phenomenal. He was so attentive and patient with our big table. Thank you for being the silver lining, Bryce!", "author": "Sophie G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-12-05", "description": "Can't expect much from a retail restaurant... avoid coming here during peak hours on day's with specials (Tuesday: 1/2 off traditional wings, Thursday: deal for boneless wings) from around 4-9 pm this place can be pretty busy on those days, long wait times for food and tables (up to 1 hour)... but it's good food, who doesn't like wings?? They have several options for food, for beers, conveniently located in the mall...", "author": "Zär R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-22", "description": "I'm a big fan of BWW to begin with, although this was my first time at this particular location.  I stopped in before an Islanders game (it's right around the corner from the arena) for a few drinks and a snack.  The happy hour specials (both food and drink) were surprisingly inexpensive (something like $12 for two beers and an order of tacos - how can you go wrong?).  Regardless of other reviews of this location, my bartender was friendly and attentive and when he saw I was opening my BWW app to check in he handled it all on the computer for me.  As usual there are TVs all over the place, and the beer selection is great.", "author": "Brian S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-08", "description": "Literally the scum of the earth, this place is trash. We came for the fight and they sat us at a table and no one came over, so we left after 15 minutes. Thank god we didn't have to stay longer. We tried to tell them that no one came over to us and they blamed it on us and kept asking if we sat ourselves. We definitely did not seat ourselves the hostess sat us. These people are horrible, we tried to tell two different people that we were ignored and they were just terrible. I wish I never walked in.", "author": "Brittany D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-10-14", "description": "Bf was craving wings, but we had to do a lot of errands. After finishing up with the laundry, we decided to stop by B-dubs before doing our weekly grocery shopping at Stop n' shop. You can park in the garage for a couple bucks. 3hrs was $4 I think. We beat the dinner rush and were seated immediately.... in dark area by the wall. I do like to see my food, ya'feel me?\n\nORDER\n- Boneless \u0026 traditional combo: Traditional is the way to go with the bone IN. The boneless tastes like mini chicken tenders lightly sauced and heavily breaded. Bf got the medium sauce and was super happy. He said that the B-dubs in his hometown has the worst tasting chicken.\n- Boneless garlic parmesan: this is usually my g-to flavor, but it was my first time trying the boneless chicken. Bad mistake. Food was sooo salty. I ordered hot water to warm myself up, but it was scalding hot that I couldn't drink enough fluids fast enough to rehydrate myself.\n\nOur server was alright. She came to check on us once or twice and gave bf his missing ranch sauce after some time. The tv's were dialed in to mostly football games, which I was happy for. Got to catch some Cowboys action. Only one patron was enthusiastically watching and whooping. Overall, an okay place to watch the game and grub, but I wouldn't come back to cure my chicken wings hankering.\n\n10/29: Learned our lesson last time and ordered the traditional wings. I really like the asian zinger sauce more than the garlic parmesan sauce. Bf and I agreed that the wings were less salty than before. Waiter was very inattentive. Didn't refill water and forgot to give us napkins, side of fries, and my blue cheese sauce that was supposed to come with wings. Plus, it was hard to wave him down to get our bare minimums met.", "author": "Nicole T."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-12-06", "description": "After eating the world's most mediocre/borderline gross meal--my server somehow managed to lose my credit card in the seven steps he walked from our table to the credit card machine to swipe it. \n\nMy high school cafeteria was run better than this place and they could probably make better food too.", "author": "Lan H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-01-29", "description": "I only come here when I crave wings and only on Tuesdays because of the half off deal. They do ID Zulu around school hours because I'm assuming kids show up when they should be at school which I think is a great idea. There usually always is a wait even when there's empty seats. The servers are not great. The wings are good but make sure you're clear with your order. You typically do have to wait a while. Overall i just come here on Tuesdays for the deal and that's it don't depend on good service.", "author": "Carmen E."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-04-17", "description": "Basically self serve. Went there as 5 got sat down at a small table, 2 small tables together, note that the place wasnt even half full. Anyways, took 30 minutes to get 2 of the 5 drinks we ordered. All we ordered were fountain drinks too, i dont know where they went to get it, somewhere on the Moon? Who knows. Anyways, 30 minutes passed no food just 2 pepsis. 20 minutes later food came, tastes like shit. The other 3 drinks still not here. Asked for silverwares, took them 15 minutes to get. Thats some next level service. By the time we got our silverwares we finally got our 3rd drink. Keep in mind, we got FIVE. so so far 50 minutes in, 3 drinks. After another 10 minutes we had to ask for our two other drinks again. No service at all. After we finished, we looked for our server but cant find him anywhere. Asked another worker to give us out check, he replies, \"who is your server?\" I honestly dont know his name since he never said it. Then i told him, i dont know who my server is. He said \"I dont know either, im not ur server.\" Then walks away. Another 15 minutes passed. Nowhere to be seen. I had to go ask where to pay and look for my server. HAH. What a joke. Soon to be closed.", "author": "Wu X."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-06-13", "description": "Terribly understaffed and in desperate need of kiosks on the table to pay for your meal. Our server was pretty standard for Atlantic Terminal, dry, overworked, took forever to take our order, not really paying attention, took forever for us to pay, need I say more? Sad to say but I don't expect much from this area, you'd think Atlantic Avenue would've improved ten fold with the Barclays Center located right across the street but alas it's just as bad as the Applebee's next door or up the block on Dekalb.", "author": "Jazmine A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-06-03", "description": "This is my 3rd location I have visited. This place is smaller and isn't as lively as Times Square and the Long Island location. The menus were also dirty and sticky, however the waitress were nice and attentive. \n\nThe wings were great as usual, crispy and saucy. My favorite one is the awesome Asian zing! Yay for Asians!! The sweet bbq is also quite good. I have a thing for sweet sauces. We also tried the spicy garlic and I wasn't expecting it to taste like buffalo hot sauce but it did and a more garlicky version. I thought the sauce would be bomb but it turns out it wasn't bomb. I also tried the hot sauce, 3 levels above ghost pepper but it was weak as hell.", "author": "Cindy X."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-21", "description": "I've been waiting over 30 mins for an order of wings. That type of service is completely unacceptable.", "author": "Sean H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-12-19", "description": "Menus were soaked in strange liquid. Tables weren't clean. Service was slow, waitress was spending more time talking to her friends.  Probably the worst buffalos wild wings I've ever been to. Avoid!!", "author": "Edward L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-10-24", "description": "Well, a friend and I grabbed dinner here last night. Sever was nice not very attentive, guess we caught them on a good day. Over priced for not so great wings. I'm pretty sure the wings are the reason I've been in the bathroom for most of my work day. -_-", "author": "Vanessa T."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-28", "description": "Was not like the others I've been too. Very unsanitary. Asked the waiter to take my beer and replace it because there was something on the rim the bartender thought she could wipe it with her finger and send it back!", "author": "Amani M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-04-05", "description": "Buffalo Wild Wings\nNY BK Atlantic Center\n9pm Friday 1st April 2016\nThree Stars\n\nLocated in shopping mall with Applebee's, Target, and Chuckie Cheese, B Dubs was surprisingly crowded. There was 10 people waiting in line to put their name down. We snuck in and sat at high top bar table. I ordered a tall Bud Light which came 85% full which I think it's their corporate policy. I had a medium traditional wings: Hot, Caribbean Jerk, and Salt \u0026 Vinegar. Our order came out perfectly which was first for me. The wings were a bit small, overly fried, and under sauced. The service was better than average. There were plenty of TVs playing the Knicks v Nets Game.", "author": "Leonard L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-08-04", "description": "We did a take out order and asked for carrots and celery.... none were in the bag.  I think it could've been a better experience order date 8/4/18 15:08:08 order of large boneless", "author": "Kevin J."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-21", "description": "DO NOT VISIT THIS RESTAURANT!!!\nThe worst service I've ever experienced. The food took over an hour, none of the servers wanted to help, they gave an attitude when I mentioned that something was missing from my order, my food tasted dry and reheated like it was thrown back in a microwave or oven and served to me and this is the second time that I've experienced this. It is THE worst service I've ever experienced, ever!", "author": "Chris P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-24", "description": "The service just gets worse and worse. What is this supposed to be? It looks disgusting. Theres a wing missing, and the service is always terrible.", "author": "Charli S."}], "servesCuisine": "American (Traditional)", "priceRange": "$11-30", "name": "Buffalo Wild Wings", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "139 Flatbush Ave", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/ENoWKg2ScYUtSOPF-xpcJA/ls.jpg", "@type": "Restaurant", "telephone": "+17189439453"}