{"aggregateRating": {"reviewCount": 133, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-24", "description": "Lines get long, but that's because they really take care to get your order just right. Their new honey biscuit sandwiches are UH-MAZE-ING. The sausage egg and cheese is legit. They also have all sorts of bagels and cream cheeses (including with avocado). There's a deli counter with all sorts of Boars Head meats. They also run a deal where if you buy $15 of meat, they'll throw in a dozen bagels. Great deal. Their beverage selection is also top notch. Oh, and you can order a pizza bagel off-menu. It's not pretty, but it gets the job done.", "author": "Kenny C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-09", "description": "Our tour guide took us to his favorite bagel shop and it happened to be in the DUMBO part of the town. \nBagels are good but I never go crazy for them. If I had to choose I would rather get a flagel...I think that is how you spell it. \nALSO I usually ask for scoop out bagel...just too much dough in a damn bread.\nbut overall the bagels came out fresh and no extra toasted needed. \nOh ya...I got the everything bagel with veggie cream cheese. great combo. \nit was even yumi the next day lol couldn't finish it.", "author": "Cindy CiCi L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-07-19", "description": "Went to get a b.l.t. on a plain bagel for breakfast and the bacon wasnt even cooked. I got the one bagel and 2 drinks and it was almost 18 bucks. Probably wouldn't get that again from them.", "author": "Mike E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-20", "description": "Most of the time I end up with great egg sandwiches and bagels. It's the only bagel location in DUMBO so it will be packed on a weekend morning. I did show up a little bedraggled one morning only to my horror, see several people I know from the neighborhood. The line doesn't take too long though.  I've always had great service here, but several of my friends loathe ordering multiple sandwiches and the orders coming out wrong.\n\nTheir bagels are inconsistent - sometimes doughy and once in a while, too crispy. About 50% of the time the roll for my sandwich is slightly stale. The prices are as expected.\n\nThe one italian sandwich I got here was a huge disappointment. It was totally dry and tasteless. \n\nStick with their everything and whole wheat sunflower bagels. If you ask, they will make the eggs on your sandwich over easy, then you have a nice yolk on your egger.", "author": "Julianne B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-31", "description": "Now THIS is a bagel. No frills, no BS, but enough options to please any palette. Bagels are big and fluffy. Every flavor of bagel and topping you could want. \n\n[moment] THEY HAVE HUMMUS. So many of the bagel places don't have hummus. Laaaawd.[/moment]\n\nOrdering system is a bit wonky: stand in the right to order, then stand on the left somewhere until they yell your order, then you pay.", "author": "Katrina S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-10", "description": "For a bagel joint, their bagels didn't really impress. My sesame bagel was plump, but the skin was chewy in a strange way and it was... too bready? The walnut raisin cream cheese spread was excellent though.", "author": "Peter H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-09-05", "description": "This place continues to disappoint. They don't know how to make a proper breakfast sandwich. I ask for ham, egg, salt, pepper \u0026 ketchup on a roll and received a thin slice of raw ham with too much egg and no ketchup. Apparently, I'm not allowed to ask for/receive ketchup on my sandwich?? Fine, I'll put the ketchup on myself. The only reason I didn't throw the sandwich out is because I paid over $5 for it (not sure what I paid for); it was disgusting. Their customer service is mediocre, unless you're they're favorite, at which they cater to you. Starbucks has better breakfast sandwiches AND customer service. Not coming back here ever again!", "author": "Lindsey B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-25", "description": "I stopped by with my kids, grabbed a few drinks and ordered a buttered bagel toasted for my young daughter.  The guy gave it to me without toasting it.  I politely reminded him I had asked for it to be toasted and he claimed that I had not told him. He then said he would toast me another one but would charge me for both!  He was absolutely insistent and yet totally wrong.  We finally walked out.  He was a complete jerk and hostile to me and my family.  No reason for such aggressiveness.", "author": "Michael K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-06", "description": "I love this place.  I love the hustle of it, I love the bagels, the coffee, not crazy about line buuuut, that's a good sign.  They also make amazing BEC on a bagel - love everything about this place!", "author": "A W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-06", "description": "I've had bagels in Queens, Brooklyn, and in the City. I just had the best bagel I've ever had at this place. Onion bagel with vegetable tofu spread. Unbelievable!", "author": "L C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-10-27", "description": "Worst system to order and pay. They have you wait in line to get to the cash register to order, but then make you leave and stand crowded against the wall to wait for your order, only to elbow your way back through the crowd to the cash register you had just ordered at in order to pay, continuously disrupting the lines to order, and to get your food, and to pay. On top of all of it, a bagel with egg and a coffee was almost $8. Apparently, iced coffee instead of hot coffee no longer counts for their \"egg on a bagel + coffee\" combo for $3.75.... and somehow makes it $4 more? Who the hell knows.\n\nFood and coffee were good, but jesus, what a headache.", "author": "Teryn G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-25", "description": "The morning crowds are a sure indication that this place is worth a visit.  Each time I visit DUMBO, I grab bagels to go, and a few breakfast sandwiches for the family.  The service is always quick and the food is terrific.", "author": "Michael M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-25", "description": "Since I drop in early in the mornings the bagels are always fresh. I just wish the bagels themselves are a bit more flavorful.  I've never ordered anything other than plain bagels (no cream chees, no salmon etc..) so I can't comment on their premium bagel sandwhiches.  For a buck twent-five per bagel...I can't really complain.", "author": "Dina B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-27", "description": "Big fluffy bagels\nAnything you want, really!\nFast service to-go\n\nTofu cream cheeses\nMy lactose intolerant \nfriends can eat here fine \n\nPlease tip the workers\nThey are so nice and friendly\nGot orders on point", "author": "Linda W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-21", "description": "This place is a neighborhood gem - bagels are great, prices are cheap and service is efficient and friendly.  Highly recommended.", "author": "Oliver B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-07-26", "description": "A cute little bagel shop located in the DUMBO area. This is the place for you to grab a bite and head over to the water front for some nice views. \n\nFOOD: I ordered a mozzarella, egg, spinach on a sesame bagel for $6. It's honestly a bit over-priced in my opinion. For the food itself, it was one of the better bagels I have.\n\nDRINK: I ordered a medium iced coffee for $3. It was a solid ice coffee. \n\nSERVICE: Unlike the some of the other reviews, I did not have too much of a problem with the service, nobody was rude or disrespectful. They did seem a little disorganized taking orders though. I gave my bagel order and the cashier left to begin making it before I gave my coffee order. Then another man came from behind to help the next customer behind me and she ordered her food and paid in the same transaction. I had to wait for my bagel to finish toasting before I had the opportunity to slip in my coffee order and paid after two people finished their transactions. \n\nOVERALL: Good place for a quick bite!", "author": "Tiffany C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-17", "description": "I come here every Sunday morning (no lie EVERY Sunday morning). The staff is so friendly! They keep the lines moving quickly and make jokes along the way to keep it lighthearted. The bagels are delicious, I'd say a 10/10. They have a large selection of bagels, sandwiches, and drinks available all made fresh daily. There isn't space to eat inside of the bagel spot; however, I usually choose to go eat my bagel in the park overlooking the NYC skyline.", "author": "Brigid K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-11", "description": "I had the Mr. Bagel and it was incredible, my girlfriend had the veggie spread on her bagel and said she was impressed that it still had chunks of veggie in the spread as most places grind them down so much that you can't even tell there is vegetables in there, will definitely go back again!! Just grab your bagels and head down to the water and eat them w views of the Manhattan and Brooklyn bridges!", "author": "Lawson M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-05-26", "description": "After walking across the Brooklyn Bridge this morning, I was really craving a bagel with cream cheese and smoked salmon.  I googled this place - and it totally hit the spot.\n\nI knocked them down one star because I thought the service was more curt than needed.  Given how laid back and chill the rest of DUMBO is, that stood out for me more than it would have in a Midtown place.  \n\nI definitely suggest taking a walk across the bridge to work up the appetite, getting a bagel here, and then sitting at Main Street Park so you can eat with a view of both Brooklyn \u0026 Manhattan Bridges.", "author": "Elle W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-21", "description": "Amazing!!!  Not just the food but Yanira pulled thru for me when I was in a bind for a corporate function. I appreciated all she did last minute for me.  She was just so pleasant to work with also.  I can't thank her enough.  Now about the food...OMG.  The bagels, muffins and danishes were awesome!! They all arrived so warm.  I couldn't stop eating!    If you need catering call Yanira!!!", "author": "Rosie V."}], "servesCuisine": "Fast Food", "priceRange": "Under $10", "name": "La Bagel Delight at Dumbo", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "104 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/ysQr9MAG5ZFHwwB2Xzm3zQ/ls.jpg", "@type": "Restaurant", "telephone": "+17186252235"}