{"aggregateRating": {"reviewCount": 133, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-07-25", "description": "I don't know how anyone could give this place more than one star. The bagels are stale and flavorless and their tuna is fishy and overly drenched in mayo. It's the only bagel place in Dumbo so I guess they can get away with terrible food.", "author": "Dorian M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-10-22", "description": "Always pleased with La Bagel. Their bagels are really good-I often bring them home for my family. I'm really into their chicken salad, lox and whole wheat everything bagels.", "author": "Bee C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-01-29", "description": "I love this place.  AMAZING bagels, AMAZING sandwiches, and AMAZING service.\n\nAll the guys behind the counter are super friendly and helpful and when I lived there they never got my order wrong....and I ordered from them continuously for years!\n\nUnfortunately I do not live in the area anymore, but that doesn't stop me from traveling to get some bagels, a sandwich, or a desert.\nLa Bagel Delight is for sure a delight for me!!!\n\nThis place is fantastic.", "author": "Dean R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-04-12", "description": "Small, well-run, bagel shop.  Perfect for a quick bite to take out.", "author": "M D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2008-03-31", "description": "Will someone please tell me in what world  it makes sense to have a bagel shop whose name implies some sort of Western European flair?  \"La\" plus \"Bagel\" just makes no sense to me at all.    \n\nThe bagels at LBD, while not bad, are certainly not delightful.  Too big and puffy.  And it is also not delightful to walk into LBD on a Sunday to find that they have only 3 kinds of bagels left.  There aren't even that many people who live in DUMBO, how does this store manage to run out of bagels? To be fair, the whole-wheat everything bagels we were forced to purchase (yes, forced!!!!!) were in fact quite tasty, but I really wanted a sesame to put my cream cheese and strawberry jam on, and I really have to draw a line at jam + onions.  DEFINITELY not delightful.\n\nWhat I would call delightful, however, is LBD's lox.  Extremely fresh and buttery, and for $25/lb, it had freaking better be.", "author": "Becca S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2009-10-16", "description": "I used to work around the corner, and I enjoy a good bagel.\n\nI'm not a fan, for a few reasons. I once ordered a chicken sandwich that had all sorts of other things on it. Bacon, cheese, BBQ sauce... okay maybe that was all. Anyway, they got my order confused, then treated me like I was an idiot and said the wrong thing when it was the only thing I had ever ordered from there (other than a simple bagel w/ butter), and it ended up taking legitimately 15-20 minutes. When I finally got it and was in the park about to eat it, I looked at the chicken and it looked a bit shiny/raw, but I thought, \"Hey, what do I know?\" Which generally, is not a lot. So, I ate it, like a fool, and paid for it the rest of the day. Ugh, so sick.\n\nAnother thing, I hate about this place is the way they treat customers. They try to play this, \"What's goin' on pal, whaddya need?\" with people like they are buddies with everyone, but it's so insincere it's really really irritating. It's kind of hard to explain. I'm sure if you need a bagel and you're in DUMBO where your options are pretty limited, it's not gonna stop you, but... I kinda hate these guys.", "author": "Sean E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-09", "description": "Great costumer service, fresh bagels, fabulous prices. I'll be back!!", "author": "Margaret P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-29", "description": "I was in the area and looking for a great sub before I hopped back on the F train.\n\nI stopped in this shop and felt comfortable instantly. The guys working behind the counter greeted me with a friendly hello. I ordered the Mama Mia sub and it was not only excellent, but enormous.\n\nBeing right down the street from the infamous Gleason's boxing gym, all of the guys were talking about boxing. I felt right at home.\n\nThe sandwich was pretty expensive, considering a 12\" sub and a can of diet coke cost me about $13.00.\n\nThe bagels looked delicious, and I'm looking forward to going back to try one.\n\nThis is a takeout place only. Expect to grab n' go.\n\nIf you're in the area for work or to check out the Manhattan or Brooklyn bridge, stop here for food first and then walk over to check out the views.\n\nGreat food\nGreat service", "author": "Nicholas D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-07", "description": "The word that describes this place: Value!\n\nWhether you're a local or a worker-bee based in the neighborhood, the smell of the fresh and soft bagels in the morning will lead your nose to the best one can find in DUMBO.  And believe me, these guys don't skimp on the fillings, whether it be cream cheese in the morning or deli turkey in the afternoon (I don't think I've ever finished a sandwich in one sitting, but that's just me being an average Joe, I guess).\n\nThe drawback here is the chaotic line and the wait for anything more complicated than a bagel with butter.  So when you come here, just be prepared to wait a bit for your enormous [insert whatever you ordered here] and then enjoy.", "author": "Andrew T."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-09-18", "description": "While the bagels at the joint are decent, and so are some of the deli/cold cut items, buyer beware: The pricing in this place is ridiculous (average deli sandwich runs over 8.00, average bottled drink runs 2.50-3.00), the customer service is bad at best.  Very unfriendly staff makes you feel as if they are doing you a huge favor by serving you, often huffing and puffing as they slice your bagel.  \nOut of the nine times I've visited: probably about six of them had either the \"toaster is off\" (turn the damn thing back on you lazy SOB), or the \"slicer is clean\" (wow, makes you wonder about how filthy this thing is the rest of the day).  \nOh yeah, on more than one occasion, I courteously pointed out to the mean deli-man that there was mold growing on this 'grilled vegetables' within their deli-case.  He was kind enough to thank me.  \n\nFood quality: 3.5 stars\nFood freshness: 2.5 stars\nOrder quickness: 4 stars\nStaff's friendliness: -1 star\n\nNot very many options in the neighborhood.  If you work in DUMBO get your breakfast before you arrive.  If you live in DUMBO get your breakfast when you get to work.  If you live and work here; go to Starbucks.", "author": "Joshua F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-26", "description": "So come here pretty much every morning and pretty much every morning I order a plain cream cheese bagel. They are not stingy with the cream cheese and the bagels are always fresh and delicious. I'd give them five stars but they're always busy and so the staff don't come across as all that friendly.\n\nIf you find it's busy, keep an ear out for when they shout 'next'. There isn't so much a queue here as everyone just mills around and waits. Keep track of who's ordered and who's waiting, and if in doubt, just step up anyway, they serve whoever steps forward quickest.", "author": "David P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-19", "description": "So I felt compelled to write this review for several pertinent reasons.\n\nAs I sit here, eating a sandwich I just picked up from this very establishment, I feel that it is my responsibility to share my story of amazing food, bitchy customers and phenomenal deli employees with the world. \n\nI went in to pick up my lunch and was immediately upset when I heard an overly entitled rude and hateful woman in her (what appeared to be) early thirties, although I am not entirely sure of her age but something tells he all the hate and anger behind those wrinkles have aged her quite a bit. For all I know she could be 18 seeing how obnoxious she was.\n\nAnyways, she continued to yell at the employees as they asked her what she would like on her sandwich and with every reply she gave an incrementally bitchy response followed by, \"I already told you that, UGH\". \n\nWhen all was said and done she got her sandwich and the gentleman who cashed her out was polite and professional dispute her obviously unpleasant demeanor. \n\nI got my sandwich and in the time it took me to write this I have scarfed it down because ladies and gentleman, the fact is this place makes an excellent sandwich and everyone who works there keeps their cool in the face of NYC's worst. \n\nSo I say thank you La Bagel Delight, Thank you.", "author": "Brendan F."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-06-16", "description": "If you like enough cream cheese on your bagel to feed a small country in Africa, this place is for you. However, if you think that's wasteful and a bit much, go elsewhere or be sure to tell them to hold off a little. Otherwise, the food is decent, but the workers here are a little cold sometimes and rub me the wrong way.", "author": "Addison J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-12-21", "description": "I loved my bagel. Granted it was \"blowing sleet\" and I was just happy to be somewhere warm. I like my bagels puffy - I had a cinnamon raisin bagel with cream cheese and thought it was nutritious and delicious. \n\nOne word of warning - their sandwiches are ridiculously huge, share one with a friend.", "author": "Jessica M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-05-18", "description": "The guys working here are great.  The bagels are good. They do not skimp on the cream cheese or the lox.  It is nice to know there is a bagel shop in DUMBO, the only one I believe.\n\nOh yeah, the Everything has just the right amount of salt and you can also get a Whole Wheat Everything.", "author": "Geoffrey B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-02-15", "description": "This is a nice enough place. The bagels are good enough, maybe not  anything to rave about, but still good.  But the service is great, the guys here always try to be friendly, and the kids love them so I like coming here if we're down in the neighborhood.  Its also just a block away from the bridge park, so if it's warm enough we take out bagels and go eat them on the grass by the water.\nall-in-all a pleasant experience.", "author": "JJ G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-27", "description": "FRESH delicious NY style bagels. Really doesn't get much better than that. There might be a line, but the service is QUICK and the guys are super friendly. I frequent La Bagel at least once or twice a week and definitely recommend if you are in Dumbo.", "author": "Stephanie B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2009-10-06", "description": "Lets start with the positive....  The bagels are very good and so are the corn muffins. The guys in there are also pretty friendly.\n\nThe Bad: I have purchased a few items over the past few months from the glass case that holds all the baked goods and each time they kind of tasted like \"lemon, all purpose cleaner\". It seems like they spray the glass to clean it and unfortunately the fumes are getting into the case and making everything taste like the cleaner!  I mentioned it to one of the \"regular\" guys there and he kind of brushed me off and took offense to it.  OH WELL I TRIED.  Maybe some of you can bring it up to him. \nAlso, I find them to just be incredibly lazy. They offer \"delivery\" but on their terms... I have called twice to get breakfast delivered and it was either too cold or it was too rainy. \n\nFor that I give the place a 2 and that is generous.", "author": "JP J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-16", "description": "There's not much around DUMBO...really there isn't. (Perhaps the most artificial neighborhood in Brooklyn...but that's another story) The bagels here are best in the morning and the service for the most part, is warm and friendly. They don't give you the cold, clammy look and brighten up only if you tip, you know what I mean? It's not Murray's in Manhattan but if you need a fix while you're in DUMBO, this is not a bad place since it's decent and cheap.", "author": "Alex R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2009-12-21", "description": "In a city known for bagels, this place just doesn't measure up. The bagels are okay - not bad, not great. Over-priced for what it is - but that's not surprising in Dumbo. If it weren't for the tons of awesome bagel places in NYC, this place might get more stars.", "author": "Janny J."}], "servesCuisine": "Fast Food", "priceRange": "Under $10", "name": "La Bagel Delight at Dumbo", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "104 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/ysQr9MAG5ZFHwwB2Xzm3zQ/ls.jpg", "@type": "Restaurant", "telephone": "+17186252235"}