{"aggregateRating": {"reviewCount": 133, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-03-05", "description": "The salmon cream cheese one is decent but I tried the steak and eggs one and it was so bad it took away my desire to live.", "author": "Giulia L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-07-28", "description": "Excellent bagels, great menu selection, and some of the sweetest, funniest, FASTEST counter guys you'll find in all of NYC. I've been going here almost every day for 2 years and they're like family to me. If you're a first-timer, follow reviewer Jonathan G.'s handy rules for best results. This is the kind of place you really miss when you switch jobs or relocate, both for the food and the people.", "author": "Erin B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-03-13", "description": "Hands down the best bagels in DUMBO. They're HUGE. Always warm. Baked fresh in the morning. What else do you need?", "author": "Kristin M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-07-21", "description": "this place is a joke. if theyre the slightest bit busy, forget about getting delivery. dont advertise online that you deliver if you dont. everything besides the bagels here is pretty much bad diner food anyway. still no decent delivery options for breakfast in dumbo.", "author": "Ripov V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-04-14", "description": "Best bagels in this part of Brooklyn.  Big, chewy, delicious.  The line can be long, but moves quickly!", "author": "Matthew P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-03-03", "description": "La Bagel Delight certainly makes and serves delightful bagels but more importantly the guys that work there make everyone feel like a friend and are always fun, happy to help and give great service with a smile! The bagels are the perfect amount of fat softness with a slightly crunchier outside when you ask for it toasted. LBD's fares will stand their ground among born and breed New Yorkers and new comers as well.", "author": "Jess W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-28", "description": "Great bagels (though they're no Murray's or Essa), yummy sammies, and they have pictures of all the hood babies on the wall. Just like Murray's and Essa, they won't toast your bagel for you and the veggie cream cheese actually has veggies in it!", "author": "Kelly M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-12-18", "description": "Yyyyyummy!! I work remotely for a company in DUMBO, and I always look forward to my onsite visits, in large part because of La Bagel. Their bagels are just so good. Honestly, most of the time I eat them untoasted and completely unadorned, which means they pass the test of a damn good bagel. I like that they're a bit doughy, because you can always toast them to make them less doughy if you want to. And in my experience, the dudes working there have always been friendly and efficient.\n\nYum.", "author": "Kathryn B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-05", "description": "Let me begin by saying that this place is great, and I love having great bagels close to work. If you think reviewer Jonathan G.'s \"steps for ordering\" make it sound like the place is run by the bagel Nazi (a la Seinfeld), well, you'd be nearly spot-on. But that's not to say that it's not a pleasant place. The guys here know several customers (and some customer's kids) on a first-name basis, know their orders, and are always hustling to get customers their orders. Also, the prices are very reasonable, especially for New York, and they don't cut corners on the cream cheese (i.e. let them know if you want anything less than a metric ton).", "author": "Patrick D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-04-05", "description": "I've worked in the area over two years. In the past, I've overlooked the oddly (this is Brooklyn, right??) high prices primarily due to the lack of acceptable alternatives. The bagels are OK, the vegetable and scallion cream cheeses are truly lacking. Still, I've continued to patronize this place. \nI just got back to my office with my lunch - a ham sandwich, vitamin water and chips - $11.25!! I watched as the clerk rang up the purchase. He added $1.25 to the order without explanation - assuming I wouldn't notice. I waited a second or so to decide quickly whether to bring this up and end up in an argument or simply get back to my very busy afternoon. I turned and left with my lunch and consider the $1.25 a small price to pay for the absolute right to state publicly that  you will be robbed if you patronize this place. I hope the manager or owner sees this (as they should if they are running a business - always look for the buzz on your place!) so that they will know that the $1.25 stolen from me will cost them my business from here on out. If they choose to laugh that off, fine... just one building block in a mausoleum that I am sure is at least half complete. Save your time, money and patience - go somewhere else for bagels or sandwiches. The food is so-so, the service is felonious and life is just way too short.", "author": "marc m."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-19", "description": "This place is great! Delicious, fluffy bagels, friendly staff, quick service, generous with the cream cheese.  No seating and they don't toast (update: they have now started toasting), so consider yourself warned.  They also run out of things sometimes, especially on weekends.  It's all delicious, though- you can't go wrong.", "author": "Liz L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-02-26", "description": "Ok bagels. I work in the area and live in Manhattan, so I don't know what Brooklyn bagels are supposed to be like, but the ones in Manhattan are better. Overall, I'd go back on a high carb day. The bagels are very big, and the prices are decent.  I've had the classic bagel with butter both toasted and not. I definitely recommend not getting it toasted because I got it to go, and when I opened the bag it was like a bagel swimming in butter. I ate part of it because I unfortunately really like butter, but it was sort of gross having to hold it with a napkin and squeeze out the butter every once in awhile, so I ended up throwing most away. Obviously when it is not toasted you can just scrape the extra butter off. I've also had a bagel with lox. Not the best lox I've had and not the worst. Pretty standard, and the portions are huge. I haven't had the sandwiches, but the word in the office is that they are huge and definitely good for two meals.", "author": "S H."}], "servesCuisine": "Fast Food", "priceRange": "Under $10", "name": "La Bagel Delight at Dumbo", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "104 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/ysQr9MAG5ZFHwwB2Xzm3zQ/ls.jpg", "@type": "Restaurant", "telephone": "+17186252235"}