{"aggregateRating": {"reviewCount": 133, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-04", "description": "Currently enjoying a toasted sesame seed bagel with low-fat veggie cream cheese. I also purchased a large hazelnut flavored coffee, everything is delicious and the lady who assisted me was very friendly and worked fast which I highly appreciate. I've tried their turkey bacon, egg and cheese on a toasted bagel and that too was delicious, their prices are great for the area. Definitely recommend this spot for any bagel lovers.", "author": "Charles C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-15", "description": "After a walk over the Brooklyn Bridge and on our way to the Manhattan Bridge (it was Walk a Bridge Day) we stopped in about noonish. The place is clean and neat, small, and the employees (or owners) were very attentive. Got a toasted sesame seed bagel with turkey, lettuce, tomato. Was about $7 and packed with food. Reasonable price, decent food, and didn't take forever. If you don't see what you like on the menu, just ask for what you want. Seems the wall menu is packed with $12+ stuff only.", "author": "John W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-28", "description": "Not sure why some of the other reviews are not great (maybe I need to try lunch?). Either way, going on what we ate (2 eggs on a Everything Bagel w/ Jalapeño \u0026 Everything Bagel w/ Scallion Cream Cheese) I was super pleased.\n\nRecommended for Breakfast.", "author": "Zarbrook S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-06-15", "description": "Service was beyond SHI*TY. It was so bad, I almost left midway into my order being prepared. I couldn't understand why. I was polite. I said please \u0026 thank you. \n\nAfter I got my crusty order and sat someplace to eat my egg sandwich bagel, it was dry \u0026 flavorless! I barely ate half \u0026 threw the rest away. \n\nAdd salt guys and take the stick outta your ass. \nNot returning!", "author": "Lydia W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-08-25", "description": "Visiting NY from Texas, we were excited to try a \"New York Bagel\" but to my surprise, there really wasn't much fuss about it. The egg on the bagel was a bit on the too fried side for me. I would have preferred a much more fluffy egg, but that's just my taste. Overall it was good, but I personally wouldn't go back to this particular place only because it was not up to par. The area around it is very nice though.", "author": "Juan De Dios G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-01-19", "description": "About a 2.5: La Bagel Delight has been around since '86, originating from Park Slope (they currently have 5 locations now).  They're known for their hand-rolled bagels as well as their 'Who's next?' yell-outs for quick/efficient service.  The hubs and I were in DUMBO, and while waiting for a brunch reservation, we decided to give La Bagel Delight to kill some time :P  They offer breakfast bagels (with butter or jelly, cream cheese, sliced cheese, cream cheese \u0026 jelly, specialty cream cheeses, lox, or grilled items (bacon, Canadian bacon, sausages, grilled ham, pancetta, etc.)), muffins, croissants, turnovers, soups, and sandwiches/salads.  I had the Onion bagel (toasted) with Scallion cream cheese (it had onion bits all around the bagel; large and slightly crisp exterior, with a generous spread of cream cheese with scallions; the cream cheese was okay, but it wasn't anything special, as it wasn't as creamy and not enough of a pronounced scallion taste to it); the hubs had the 2 eggs with bacon on an Egg bagel (this, we were both not fans of, as the scrambled eggs within were overcooked, and the egg bagel had an off-taste to it).  Service was fine, and the place is carry-out only.  \n\n+hand-rolled bagels", "author": "Hannah H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-03", "description": "Fast, quick, and good. This is what bagels are all about in Brooklyn. Counter service only - no seating. Open at 6am! I've never had their coffee - not fancy but ready and hot. Every neighborhood needs one of these!", "author": "Bruce G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-16", "description": "$2.82 for a bagel and cream cheese. \n\nI got the whole wheat everything bagel with raisin \u0026 walnut cream cheese and it was truly delightful. The bagel had crunchy nuts and the cream cheese also had pieces of walnuts and raisins. Also their bagels are HUGE. \n\nGranted, there is no sitting area and the service is kind of slow (same people running the counter and making sandwiches ... now that I think about it, am not sure how hygienic that is), but I was happy and super full post bagel-consumption.", "author": "Olivia J."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-01-28", "description": "Unbelievably bad. It's pretty tough to mess up a bagel with tofu and a small coffee, but I probably could find something in the DUMBO trash that tastes better. \n\nMy bagel was okay but had a weird aftertaste. Like it had pickle juice in it or something. The texture was good but it tastes horrible, and the veggie cream cheese (which was spread so thin I barely noticed it was there) wasn't much better. My coffee was horrible-tasted like it was brewed a week ago and reheated. Fortunately Im not in this neighborhood often. Go somewhere else!", "author": "Alyssa F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-29", "description": "I've eaten bagels all over New York (and the country). These are truly top notch bagels, even for Brooklyn. I've been to several of their locations, and all of them are fantastic. These are New York bagels at their best. And the service is friendly and quick too!", "author": "Shane C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-30", "description": "Everything here is super solid. If you're in DUMBO and want a great bacon egg and cheese, come here. The bagels are also very very good. Don't spend big money for a fancy to go breakfast at some of the other spots, come here.", "author": "Dennis I."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-13", "description": "This was my first time eating a New York Bagel. Everyone told me the water in NYC makes the bagels taste different, and they're so right!! The bagels here are so much bigger than those in other states. They were really nice and fluffy with a hard exterior. \n\nNormally I can eat 2 bagels in 1 sitting, but these NYC bagels are filling. This location offers a TOFU VEGGIE CREAM CHEESE spread that was amazing. Who knew Tofu + Cream Cheese could be so delicious and creamy!\n\nI wish this place offered a better coffee/espresso selection, but I suppose it's a bagel shop not a cafe. \n\nFor one bagel, it's about $1.00.", "author": "Mary Y."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-06", "description": "For you Californians remember you pay when your order is ready and have you mind made up! Don't try to change your order half way through!", "author": "Richard M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-04", "description": "New York service, so not so great, and get your coffee up the st at bluestone lane or Starbucks. Their bagels make up for where they lack in every way. Please do yourself a favor and do not toast it, I repeat, do not toast it. They're warm, soft on the inside with a perfect natural crisp on the outside. The everything, cinnamon raisin and pumpernickel in that order are the best", "author": "Quinn M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-15", "description": "So so so happy to find out they had egg whites and croissants!! Such amazing food and the perfect place to go get that traditional \"New York style bagel.\" Adorable location and all around great experience!!", "author": "Katy K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-04", "description": "Best bagel shop serving Dumbo and Brooklyn Heights, good selection and fun staff.  They have great options for bagel sandwiches, including egg whites and avocado.", "author": "Matt M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-28", "description": "Just what you need in a neighborhood bagel shop. This isn't the bagel that tourists are visiting the city in search of, but it's a solid option. The guys are always in a rush to get you outta there... sometimes they'll forget something you ordered... but, hey, it's Brooklyn. Get the pastrami egg sandwich and don't let them forget the cheese. It's awesome.", "author": "Andrew M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-27", "description": "A great bagel shop for our daily breakfast\n\nThe staff r always friendly and helpful. Prices are fairly reasonable, and everything I've tried has been delicious.\n\nMy favorite is the Bagel with salmon !!!\nIt is so addictive!!!!!", "author": "Alex C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-27", "description": "Walked over the bridge and got hungry for some bagels. Had the sausage and eggs while my wife got a bagel with crime cheese. Very good and the creme cheese was fresh. Staff was super friendly and quick.", "author": "Kyle R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-04-18", "description": "Good bagel sandwiches! But too pricey!! And the service leave MUCH to be desired. I can't say they are straight up rude, but almost. If there was another bagel place close to my home I wouldn't come back here.", "author": "Leslie M."}], "servesCuisine": "Fast Food", "priceRange": "Under $10", "name": "La Bagel Delight at Dumbo", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "104 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/ysQr9MAG5ZFHwwB2Xzm3zQ/ls.jpg", "@type": "Restaurant", "telephone": "+17186252235"}