{"aggregateRating": {"reviewCount": 133, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-30", "description": "I go here several times a week. Bagels are top notch, fresh and delicious - classic NY  style. They have pumpernickel bagels, which I love to have with whitefish salad. \n\nI had a croissant today and it was above expectations. Flaky, chewy, unrollable - very much like you find in Paris. I had worse croissants in French bakeries.\n\nLunch sandwiches are alright I gave them a few tries, but its not my go to. They are cheaper if you get just one meat and no cheese but with lettuce and tomato for $1.50 they can get pricy. \n\nStaff is friendly and polite and service is very quick,  even during lunch hour and breakfast rush.", "author": "Natasha B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-10-21", "description": "Was walking and saw this cute little place and hoped that they would have iced coffee for us. Granted it was about 3 PM and I know that they may have made the ice coffee in the morning but the ice coffee tasted HORRIBLE. Goodness gracious, I could have made a better cup of coffee from DIRT. We paid $5 for two cups. Worst ever. \n\nLove that the workers were in the back were sitting and playing cards (and making comments about me in Spanish...like I don't understand it?) while ONE guy came out to help us. Lousy.", "author": "Darina H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-18", "description": "I know bagels. I am from Long Island. \nThis place rocks.", "author": "Max D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-06-29", "description": "I created a yelp profile JUST so I could write this review. Where do I even begin. Oh, maybe the fact that if this was the last place left on the face of the earth I would rather eat dirt than EVERR go back.\n\nFirst of all, they were super super rude when I ordered an egg and cheese sandwich and a coffee. I asked for water in a cup which they refused, telling me I had to buy bottled water. I let it slide that not serving tap water is ILLEGAL, even though it was 90 degrees outside. Then, and this is the kicker, they served me coffee with very very clearly ROTTED MILK!!! When I went back to tell them, the guy basically spat in my face and said the milk wasn't expired but refused to even smell the coffee. I asked the dude in line next to me to smell it and he cringed. Their fridge was CLEARLY broken. When I asked for my money back the guy threw quarters at me cursing. For real??\n\nOh, and I have food poisoning today, after only eating that bagel and a salad yesterday (you can guess which one made me sick). I've reported this place to 311 and they promised they will try to shut it down. Don't go here ever. Ever. Ever.", "author": "Jasmine M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-11", "description": "Love this place! Grab a Cinnamon Raisin with Strawberry cream cheese and go down to the Brooklyn Bridge! Perfect cure for a hangover / just amazing bagels in general.", "author": "Rebecca S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-12-14", "description": "I AM SO ANGRY RIGHT NOW!!!\n\nJust ordered A SCOOP (1/2 pound) of tuna salad in a plastic container and a small bag of Wise potato chips and the total came to $7.50!!!\n\nThought maybe the celery in the salad would be made of gold at this price, but after mining through my lunch found nothing but way too much mayo. Just another DUMBO scam.", "author": "Cat A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-01-05", "description": "The bagels are alright, and DUMBO definitely lacks bagel competition so I've been here a few times. Every time I go, however, I wonder why I went. I've gotten in the habit of repeating my order here because I've never received what I requested. \n\nThe service is BAD. The last time I went I ordered a toasted bagel with tofu cream cheese. Instead, I got an untoasted bagel with regular cream cheese. I'm allergic to dairy so this is really not cool.\n\nThe time before that. I ordered the same thing, but had enough sense to check my bagel before leaving. I pointed out the mistake to the man behind the counter and he insisted I didn't request the bagel be toasted and that I need to order \"more damn clearly\"- although, I had actually said it to him twice. I understand if there's genuine confusion, or he simply didn't hear me - that's cool, but why be so rude about it? Things happen, but I don't like being treated like that when I'm grabbing my lunch.\n\nHonestly, I would say avoid this place. The bagels are not great enough to trump the really bad service.", "author": "cait K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-14", "description": "The bagels are perfection. PERFECTION. Big, light, fluffy, cripsy when toasted. Cinnamon raison with strawberry CH is the shit. Go for the bagels!", "author": "Coral G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-12-13", "description": "The bagels are delightful but their service is horrible.\n\nThe guys running the place have no tolerance. I have been buying the same order for the last couple of weeks for my associates, which is big.\n2 dozens of bagels \u0026 4 spreads.\nEvery time I went there he was short with me, and had no manners - no thank you or anything.\n\nUnfortunately I have decided that today will be the last time I am buying from La Bagel delight.", "author": "Yaakov C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-11", "description": "Well if you've ever seen \"The Soup Nazi\" episode on Seinfeld then you kind of already know what to expect when you walk into La Bagel. So why the 4 stars? Because the bagels are absolutely worth it. A true Brooklyn bagel experience. Just make sure you know what your order is before you stand up to the register. Cash only under $20.", "author": "Tim K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-08-04", "description": "On my first (and possibly last) trip to La Bagel Delight, I was surprised to learn that a bagel with cream cheese costs a whopping $3.81. \n\nI know that DUMBO businesses tend to have a captive audience, but the bagel wasn't anything spectacular, and the price was ridiculous. \n\nI'm not a huge fan of Bridge Fresh either, but at least the equivalent product there is only $1.50.", "author": "Catita D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-04", "description": "This place is great for a morning bagel and coffee stop on the way to work.  Bagels are delish in terms of quality and authenticity.  Quick service gets you in and out and on your way in the morning. $5 credit card minimum.", "author": "Jennifer C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-04", "description": "Bagel sandwiches here rock. I have two staples (tuna salad or chicken salad on toasted whole wheat everything), but I'll try out different options and I am always satisfied. My only issue is that lettuce and tomato cost an an extra $0.75 cents each. Comes to around $8 for a sandwich with bagel, meat, cheese, lettuce, tomato.", "author": "Jake R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-03", "description": "Great bagels as well as efficient and friendly service. What more could you want? These guys are top notch. Highly recommended if you're in the DUMBO area.", "author": "Josh M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-10-07", "description": "(Preface:  This place is on my \"Two-Week List,\" in which I list the top twenty restaurants and bars that I'd go to if some soothsayer came up to me and told me that I only had two weeks to live.  Check out the full list on my profile!)\n\nWhen my (now ex) boyfriend said to me one morning, \"We have to get La Bagel Delight,\" I guffawed. \"Are you JOKING?  What kind of place would call itself that?  It sounds really crappy.\"  But he insisted.  And wow, I am glad that he did.  Many reviewers don't think that the bagels are any different from any other New York bagels-- but the trick is to get your bagel with sausage, egg, and cheese.  Not bacon (even if you are a die-hard bacon person like I am).  Sausage.  \n\nThe eggs here don't taste bland or overcooked.  (I feel as if they are at Murray's Bagels and at Leo's bagels.)  These eggs have just the right amount of salt, grease, and butter. They are sumptuous, especially with the sausage patty and the oozing cheese.  And I don't mean to say that the bagels on their own aren't good (they are phenomenal-- we would sometimes bring a whole dozen to someone's house for brunch), but the sausage breakfast sandwich here really sets it apart from other bagel places.\n\nYou can't go wrong with any of the bagels, but I like the whole-wheat everything.  (Ha, it's my attempt to get a \"healthy\" sausage, egg, and cheese sandwich.)  Added plus:  have you ever seen the ridiculous weekend line outside of Leo's bagels?  This place doesn't have that.  Maybe it's not as well known.  But the guys in here are super fast and efficient.  I like them even more because I saw them give free stuff to a homeless man.  I wish I could just give them an extra star for that.\n\nI'm not going to lie, but one of the top five things I miss about that relationship was getting these bagels every Saturday and eating them at the water.  Ha, and I know that my ex would say the same. :)", "author": "J. K."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-03-09", "description": "your head is thumping. the light burns your eyes. you can't feel your face and your body aches like the pinch of a thousand school boys. it's a hungover sunday morning and every pore of your body is begging for a bagel and a cup of coffee (morning may be a relative term, it's about two o'clock). \n\nsmall shop, relatively packed. ordered an egg bagel sandwich on everything and a cup of coffee. the coffee was fine. the bagel, not so much. the egg was thin and weak and bland and he bagel had no taste. none. it was like eating bread, and ain't nobody want to eat bread when all you want is your bagel. \n\nthere was nowhere to sit. and I don't mean no empty tables. I mean no tables. or chairs. what?\n\nmeh. maybe it would have been better toasted? now I understand the passive-aggressive sign above the plain bagels.", "author": "D S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-07-06", "description": "When you have lived in the neighborhood for a week and they already know you at a place, you* either:\n\nA. have obsessive compulsive disorder and always go to the same places\nB. are on house arrest and can only stray so far from your boundaries\nC. really like the place even with the name\nD. are so overdone by the 2010 summer heat wave that you physically can only make it so far\nE. are an obnoxious twit who is only known for all the wrong reasons\nF. B and E\nG. A, C and D\n\nLook I can't answer this for you, you need to figure it out on your own. La Bagel Delight has good bagels. I feel like they suffer from the same fate many modern-day bagels do, steroids. I like to eat them, they just seem like twice the size of the bagels I ate as a kid.** They have tons of options available for breakfast and your bageldom - shmears, eggs, bacon, cheese, whatever the hell you want to put on your bagel.\n\nWait, this is not just a breakfast and bagel shop, it is also a good deli with all Boars Head meats. Sandwiches here are excellent and the one thing that you get here is good, quick, no-nonsense service. These guys run like a machine so follow the somewhat not obvious rules:\n\n1. hover in the form of a line\n2. when you hear \"Next\" and no one in front of you says anything, it is your turn\n3. speak clearly and order all your things at once\n4. stay close for confirmations\n5. pay before your food comes so you can take it and go\n\nAfter all this, I don't know why you need to go since I just laid it all out there for you. If you don't go, there will just be more for me so thanks.\n________________\n* As usual when I say you, I might mean me. I said might.\n** Fine, those were Lenders, but still.", "author": "Jonathan G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-20", "description": "Not the best bagel place there is, but it's sufficient enough. Staff was a little cold, but I only come here for a quick order of bagel. Just a simple toasted everything bagel with plain cream cheese for $2.75, and it satisfies my morning hunger pangs.", "author": "Ryan D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-11", "description": "Everything bagel was amazing. Best part: dairy free cream cheese!", "author": "Crystal C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-02-15", "description": "A roast beef sandwich on a roll with lettuce, tomatoes, mayo, mustard, salt \u0026 pepper, pickles and cheese came to $9.78 all said and done. I find this to be a bit absurd. 8 bucks, maybe 9....but exceeding $9 and getting close to $10 for a standard, non-fancy deli sandwich for lunch is NOT OK in my book.", "author": "J. L."}], "servesCuisine": "Fast Food", "priceRange": "Under $10", "name": "La Bagel Delight at Dumbo", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "104 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/ysQr9MAG5ZFHwwB2Xzm3zQ/ls.jpg", "@type": "Restaurant", "telephone": "+17186252235"}