{"aggregateRating": {"reviewCount": 133, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-23", "description": "GREAT bagels, just off the Brooklyn bridge and friendly staff - we came here after walking the Brooklyn bridge (from Manhattan because we had somewhere to be after in Brooklyn) and ate our bagels in a park nearby. The lox are mediocre but the bagels are definitely worthy. Go for one of the breakfast sandwich bagels. These guys have it down.", "author": "Amber H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-03-24", "description": "Another Dumbo hotspot that benefits from being the only spot of its kind in town. \n\nAlmost every bagel I've tried comes with a subtle Onion Taste likely due to that fact they cut their bagels on a table I've never seen them wipe. Bagels can often be quite Stale sometimes to the point where you will feel like you're getting your teeth pulled out by the dentist. \n\nWhen its good, its pretty decent and needed on some hungry mornings.", "author": "Davis K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-23", "description": "Borderline 5 star\n\nGot a everything bagel with cream cheese and small coffee for $2.99.  Very good deal for the area and the bagels are fresh and the coffee is on par or better than Brooklyn toasting.\n\nThe bagels were a good consistency even though I like bagels a little softer.  The whole wheat sunflower has generous amount of sunflower and other seeds on it which make for a really well round flavor and texture.\n\nI found the everything bagels to be a little light in terms of seeds but it still had a good flavor.  I will be coming back.", "author": "Ryan R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-04-06", "description": "It's not often that I forget to eat lunch, but on this particular day I was still recovering from a week-long stomach bug. And eating anything made me queasy.\n\nI came out of a three hour meeting and raced over to this place and ordered an egg bagel toasted with butter. Then I proceeded to eat it while walking home (so classy!). It was quite tasty. \n\nSo relieved that it was nearby. So grateful to have prevented a potential fainting spell!", "author": "Shu Jin S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-02", "description": "A place in DUMBO that not only takes cards, but also doesn't have a card minimum?  Yes please.  The bagels are fresh, delicious, and nearly overstuffed (not in a bad way) with whatever you ask for.  I don't know how this place isn't crowded all the time.  The people that work there are great, the food is great, and it's super convenient if you work in one of the many offices nearby.\n\nIf I have to complain about anything, it's that they don't seem to write down long orders (which is fine, because I rarely have any), which resulted in me getting a bacon-less wrap once.  That's it.  Not worth a star off, in my opinion.", "author": "Victoria R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-08-11", "description": "Just walked in at 8am on Friday. Stood at the counter and watched a woman texting on her phone, completely ignoring me. Two guys running around. Completely ignoring me. A few minutes later I walked out without any employee ever acknowledging I was ever there. One more reason DUMBO is so terrible", "author": "Kyle B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-20", "description": "Wonderfully soft and chewy (and dense enough) bagels with an excellent variety of schmears. I had the everything bagel with the vegetable cream cheese - it was perfection. Staff are very nice and the wait is short. Great start to my day.", "author": "Jean G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-07", "description": "I usually go to the La Bagel location on Court Street, but I was in the DUMBO area and decided to try out this location. In short, great quality bagels and taste! I ordered a sesame bagel with avocado cream cheese and a large coffee. AMAZING! I took my bagel over to the Carousel and enjoyed the view as I chowed down. It was a great early morning experience. The one thing I would complain about is how quickly everything moves. The line is long, but it moves quickly. The workers call out \"Next!\", which hurries along the line. The place is overall cozy and warm, and the atmosphere is nice. The service is mediocre, but the employees are efficient, which is fine considering my morning bagel and coffee is enough to cure my \"hangriness\".", "author": "Ashley S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-17", "description": "5 stars for CONVENIENCY \n\nRight next door to my dumbo office, pretty good selection to choose from. Will add that any type of bacon selection is amazing! Due to the fact that the bacon is ALWAYS well cooked. Very important for us bacon lovers.", "author": "Angelo R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-08-02", "description": "The bagels and egg sandwiches here are delicious, one of the best in 11201. But the customer service is not great. Maybe the staff are tired of the regular customers they serve, because they aren't necessarily rude, but they aren't really nice either. There is one worker we call \"Dummy\" who 75% of the time gets our order wrong, even after asking to repeat the order. It's to the point where if I'm on line I dread getting Dummy as my order taker.", "author": "Clarita H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-12", "description": "I had one of the greatest brunches of my life recently, and these bagels played an integral role. I'm a big fan of their everything bagel, and everyone who cares about their health seems to appreciate that this place carries whole wheat everything bagels as well.\n\nSERIOUS bonus points for the guys working there. They were quick and efficient, and much much more tolerant than I might be in the following situation (to get the maximum annoying effect, imagine 7-10 \"ums\" being said by the girl, in addition to those quoted):\n\nGirl: Um, I need one cinnamon raisin bagel with butter. Um, one with strawberry cream cheese, and one, um, cinnamon raisin bagel with butter. \nBagel Delight Employee: So three cinnamon raisin bagels, two with butter and one with strawberry.\nGirl: Um, I don't know. It's um, one cinnamon raisin...\nBDE: I got it. \nGirl: And one um, regular. With butter.\nBDE: Regular what? You mean plain?\nGirl: Yeah. So one cinnamon raisin with...\nBDE: I got it. \n\nAnd the guy walked away SINGING to fill the order. To Celine Dion, no less. Clearly, he is a better man than I. \n\nGood bagels. Great service. \n\nBut I agree with Dr. Becca; what a TERRIBLE name for a bagel shop. Why is the \"La\" there? It is completely awkward to say, and it's absolutely unnecessary. Wouldn't \"Bagel Delight\" be perfectly acceptable? Are these French bagels? No, those are called \"croissants.\"", "author": "Peter D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-11-11", "description": "Great bagels, snappy service. Scooped out is done well here. The manager is very quick and gets things done in the morning, albeit a bit intense. \nA line out the door doesn't mean a long wait by any means.", "author": "Austin G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-06", "description": "Fresh bagels, good prices, quick service and the staff are always nice.", "author": "Jess F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-27", "description": "I won't lie...the biggest reason I walked down to DUMBO from Brooklyn Heights for bagels is because I heard they served taylor ham. Being from NJ, I have been on a search for taylor ham in NYC for about a decade. I still did not find it at La Bagel Delight. But I did find an awesome and affordable salt bagel with friendly, fast service.", "author": "Krista J."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-10-18", "description": "Nothing Special.\nBagel with plain cream cheese, $2. Special CC starts at $3.50. good prices. And the coffee is fairly cheap as well.\n\nBut in a land full of endless Jewish bakeries and bagel bodegas, this place was unimpressive. My everything bagel lacked flavor and the toast was only mildly luke warm (I rather have toasted or not, somewhere in the middle is always bad).\n\nIf you're looking for a quick bite, this place will do. If you're craving a bagel or looking for the NY bagel experience, pass on this place.", "author": "Ari A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-01-04", "description": "Nope. I'll admit I've only tried it once, and perhaps it was somehow an off day for them but I won't be back. Exorbitant prices for bagels that taste like they were bought from a gas station 500 miles outside NYC. Can a business really survive simply due to its location and get away with overpriced, poorly prepared food? I guess so, though I hope not.", "author": "Noah N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-15", "description": "My favorite bagel joint in my hometown.  They are the nicest fellas ever.\nEvery Saturday I pick up a bakers dozen for the family and the fixings.\nReally good bagel \u0026 lox and excellent deli sandwiches for lunch on the go.", "author": "Dina C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-31", "description": "I haven't been in the neighborhood that long, but it's pretty clear that Dumbo has some real highs and lows.  Highs: views, architecture, laid back vibe. Lows: Cost of dry cleaning, cost of parking, lack of places that open early in the morning.\n\nWell, pretty much at the top of my highs list is La Bagel Delight.  Sure, you can get a bagel, a sandwich, or even a bagel sandwich at just about any bodega in New York.  But this is no lowly bodega.  Perhaps we should call it a bagel-dega...or THE Bagel-dega.  Why is that?  This place simply has amazing bagels that have the absolute perfect texture for breakfast sandwiches.  A bacon, egg, and cheese on a bagel from La Bagel Delight is as close to portable breakfast perfection as I've yet found.  The bagel is soft enough to chew easily, while still maintaining that chewiness that is the essence of a bagel.  The guys behind the counter aren't overly saccharine, but they are friendly and professional, and get the job done quickly.  If you call your order in, you can be in and out in a matter of seconds.  Perhaps my only complaint is they don't make fancy espresso drinks, but it probably wouldn't feel right if they did.", "author": "Brian Q."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-02", "description": "Great staff and fresh food! I get a salad and they always remember how I like it. Super friendly and fairly priced :)", "author": "Carina N."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-09-05", "description": "First, i must say they do have some pretty good bagels and croissants, but thats where it stops - THE SERVICE IS TERRIBLE. \n\nI\"ve had issues w this place a few times, but today I decided to write about it.\nThere was 3 of us in the place, its early on a Thursday before work. I was first in line and got a sausage egg and cheddar on a toasted roll. Next person got the same thing but on wheat. 3rd person got egg and cheese on a roll.\n\nGuess what, the guy after me got his order first.... i was like, hmmmm, ok, no worries. And THEN the following guy got his order - and thats when i said, excuse me, i ordered before both of these  fellas and we all got pretty much same thing.\n\nAt which point the counter dude takes the egg and cheese sandwich out of someones hands, takes it back, i see them open it up, rip a sausage in half and show it in there. I was shocked.\n\nI should have walked out, but I was hungry so I didnt.\n\nIn the end i had a soggy, wet from condensation untoasted egg and american (not cheddar) sandwich w a sausage as an afterthought and a coffee for SEVEN dollars??? that is even ridiculous for DUMBO. And they didnt care, nor apologized or anything. These people suck and there are too many options to ever go back there again. Which is a shame. \n\nTerrible service, they dont give a fuk at all!", "author": "Vassili S."}], "servesCuisine": "Fast Food", "priceRange": "Under $10", "name": "La Bagel Delight at Dumbo", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "104 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/ysQr9MAG5ZFHwwB2Xzm3zQ/ls.jpg", "@type": "Restaurant", "telephone": "+17186252235"}