{"aggregateRating": {"reviewCount": 133, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2019-06-01", "description": "Great bagel in the heart of Dumbo. Biking from Williamsburg, we always pass up the local spots on the weekend and make a trip here. For a bagel with cream cheese, tuna salad, or just plain... you can't go wrong. And their iced coffee is great too!", "author": "Adam K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-09-07", "description": "Solid bagel joint under the bridge! \n\nThe line stretches quite long in the mornings and they have some nice breakfast deals on bagel coffee combos. The bacon egg and cheese I got was decent but light on egg and cheese.\n\nThe wait to order was 10 min, and about 5-10 min for the bagel to be ready as well. The price isn't bad and they have some cheap chips and drinks you can snack on while waiting.", "author": "Jennifer D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-25", "description": "Stopped by this place when I was in the area for a quick bite. The bagels are pretty delicious and large for the price. I got a whole wheat everything bagel toasted with cream cheese for $2.75 and it really filled me up. There are no places to sit in the cafe which is unfortunate, but luckily there are picnic tables a little down the road that you can eat at.\n\nIt seems like they have some pretty good breakfast specials during the weekdays until 1 pm so I'll definitely stop by again for breakfast when I'm in the area.", "author": "Giselle R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-04-27", "description": "The bagel was okay, the turkey bacon might have been undercooked. They're friendly to locals but not friendly to tourists. They have lots of options for lunch but not many for breakfast. You're not able to make your own coffee, they ask you how you want it. There was no greeting. I mean they weren't unfriendly but when a place has friendly staff it really makes a difference for their customers.", "author": "Kalyn T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-25", "description": "One of the best places to have a bagel in Brooklyn. Great selection, many breakfast and lunch options available. I've tried couple of their sandwiches and everything is just good quality and great tasting. Had their turkey sandwich with grilled onions and cheese and also their chicken fantastic which has the chicken, cheese and lettuce. Both were good. There was along line to order at the counter and had to wait about 10 mins until it was ready. Location is good as you can walk to the Brooklyn Bridge underpass from here.", "author": "Malini A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-14", "description": "The pastrami egg and cheese bagel was amazing! Great service and wonderful location! Close in walking distance to many hotels. And very friendly staff!", "author": "Krystina K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-20", "description": "This place has been my go-to bagel spot. I worked in the area and was a regular. They are very fast, kind, and on point. Leaving La Bagel for the last time was the saddest part about leaving my job in the area (honestly). Great prices / best bagels / best staff / asst cream cheeses / yum sandwiches / tasty treats. Gracias por tu amabilidad y te veré pronto", "author": "Claire B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-09-25", "description": "The bagels are great. They taste fresh, add a generous amount of cream cheese, and there's a variety of spreads. \n\nHowever, my qualms are with the consistent disappointing drinks. Twice, I've ordered their iced black tea, because I'm not a coffee drinker, but I need the caffeine, and both times the iced tea tasted so old and bitter. I drink my black tea without any sugar, so I know that it is strong and has a kick to it, but what they gave me both times was just old and gross. The tea was murky. \n\nWhen I went today to get it, I decided to ask for a sample before I bought it to see if it's just an abandoned drink that no one bothers to check on, or if it was just a two time occurrence. The iced tea was okay, not very old tasting, but what I discovered later was the super old and mushy lemon slices they added to it. I asked for extra lemon and when I went to squeeze them, they were so mushy that they turned into a yellowy oatmeal mush. Not good. A waste of almost $4, but a cumulative waste of $12.", "author": "Majlinda B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-28", "description": "I've been here a dozen times for some morning grub and have never left disappointed. Fresh, chewy and flavorful, bagels, good cream cheese distribution and quantity, hot unburned coffee. Orders with eggs in them take a little longer, buts that's only because they cook them fresh as you order.\n\nPricing is pretty good, not bargain-basement values, but quite excellent for this neighborhood. $3 for two eggs on a bagel, $1.25 for a plain bagel. $3.25 for egg cheese on bagel plus coffee.\n\nThe only downside I see it that it gets a little crowded and confusing with their unorganized order system. If you are heading in there, the line on the right by the display case is usually for people who have not ordered. The people hanging out on the left and in back have placed their order and are waiting. Remember what you ordered because there is no order number or name system, they will just call out your food items when ready.", "author": "Matt C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-12-19", "description": "Im really sorry, but I have to change my review. I've gone here twice now both times my order has been wrong. One time so wrong that I had allergic reaction and got extremely ill. Their busy, their fast, but they are not tentative at all. First time, I ordered a scallion tofu cream cream cheese sandwich. I was given a Veggie tofu cream cheese, that's fine. But this time..I ordered a scallion tofu cream cheese w/ tomato slices and noticed far too late that it was indeed real cream cheese not tofu. I got extremely EXTREMELY ill. If you have an allergy, are vegan, or particular I wouldn't recommend it. Super bummer because you do make good stuff. But I am really really hesitant now.", "author": "Jess A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-17", "description": "Enjoyed the nova lox, very fresh and bagel had the perfect amount of everything seeds.", "author": "Alise G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-12-29", "description": "Closest bagel shop to the bridge. Good bagels, no seats, take away only. Could have better service", "author": "Danielle E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-22", "description": "La Bagel Delight\nNY BK DUMBO \n7am Tuesday 5th December 2016\nFour Stars\n\nEveryone here was super friendly. My Bacon, Egg, and Cheese on a toasted Everything Bagel was good and got the job done. The bagel was very dense, the eggs were fresh, the bacon was fatty, and the cheese was melted. It's nothing fancy which makes place a good meal deal.", "author": "Leonard L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-06", "description": "I moved out of Brooklyn a year ago and I still think about their delicious bagels with a vegan tofu cream cheese. And coffee with soy milk.Really good coffee.\nSuper friendly and welcoming staff that just makes your day first thing in the morning with a nice attitude and delicious bagels. Tried to find worthy replacement and haven't succeeded just yet!", "author": "M M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-12", "description": "Seriously some of the best bagels in the city. Any and all bagel combinations. They come fresh straight out of the oven and you can enjoy without even toasting. Their deli sandwiches are top notch as well. This place is a total gem.", "author": "Maron W."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-04-17", "description": "Had the ice coffee, worst ive ever had. Literally tasted like nothing but tap water and milk. Only tried it because Starbucks was closed for an emergency. Never again\n\n4/17: stale $3 muffin. I dont know i keep doing it to myself (-__-)", "author": "Edwin C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-13", "description": "Great way to stay the morning - had a bagel with egg and cheese and it left me full but not too full. Perfect way to start the day!", "author": "Leti T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-07", "description": "Great bagel sandwiches and iced coffee!  The line was long, but worth the wait. They have all kinds of fresh bagels and pastries. Oh and did I mention the iced coffee? It's awesome!", "author": "Anthony V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-24", "description": "A very solidly delicious bagel. Huge in size. Could have had more cream cheese. Nice guy working there.", "author": "Andrew K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-10", "description": "What an awesome way to start the day!Recommended by the girl working in the next block pharmacy...\nFresh bagels. I had the egg, cheese, pastrami breakfast everything bagel. Which was delicious.\nNowhere to sit on premise, but plenty of tables across the street under the bridge. I set by the river, which was perfect.", "author": "Itai H."}], "servesCuisine": "Fast Food", "priceRange": "Under $10", "name": "La Bagel Delight at Dumbo", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "104 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/ysQr9MAG5ZFHwwB2Xzm3zQ/ls.jpg", "@type": "Restaurant", "telephone": "+17186252235"}