{"aggregateRating": {"reviewCount": 9, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-18", "description": "This place is amazing.\n\nOn the outside, it's just a normal corner deli.\nOn the inside, it's like a mini Whole Foods (but not as expensive).\n\nI'm surprised every time I go in here, though by now I should just be used to it.", "author": "Diana R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-11-12", "description": "I've been coming here for years , earlier on it was a great place to get a few beers but it's pretty evident that they are clearly taking advantage of customers when it comes to prices lately, you could walk down three blocks and get the same beers for cheaper and colder. I don't know what's going on but the honesty towards the customers have reached a decline. One minute you're purchasing a pack of vape nicotine cartridges for $17.50, next day they switch the price to $25 while the manufacturer still sells them for $16 on their website. I was pretty upset that the cashier was trying to rectify the price on a non business holiday ( no change in the laws ). I won't shop here again unless they take ownership and take an initiative to be honest with the many customers who frequent the area. \"Sweethearting\" ( false price adjustments ) is retail fraud!", "author": "Sean D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-08-14", "description": "Been here a few times to pick up a six pack for some BYOB neighborhood joints. Their prices are fine, and they think their beer selection is better than it actually is. At least it's open 24/7, and if you need some last minute flowers or plants, they've got you covered.", "author": "Kenny C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-07-16", "description": "The place smelled really bad and everything looked spoiled. The Chinese guy there was very rude to us when we came in and even my friend cried. He had a very bad attitude. He told us that if we don't buy anything that we are not welcomed into the store again. who says that, really? He doesn't know english and starts telling me how this is america and americans are stupid. I don't recommend going to this place for anything.", "author": "Jesse B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-19", "description": "I'm always amazed at the wide selection available at this tiny deli.  Every other deli this size just has coffee, chips, and beef jerky but they are like a super-compact Trader Joes, minus a full butcher.", "author": "Brad K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-17", "description": "If the people who ran this place ran the world we would all be OK. It has more variety than places ten times its size, yet somehow never runs out of anything. I completely agree with the person who said it's like a cheap mini Whole Foods. They have everything, including a lot of the frou frou organic foods and cleaning products that I like. \n\nIt's also open 24/7, so I can come here at midnight to get fresh spinach, cheese etc to make late dinner. \n\nThe people who work here are awesome too. A total neighborhood gem, and way better than any other local deli.", "author": "Susan R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-04-24", "description": "Everything I've ever wanted in a corner deli, this place has:\n\n- choices for ramen noodles\n- Sriracha, sambal oelek, mae ploy, and whatever kind of chili sauce you might want \n- a fairly impressive produce section\n- seaweed sheets\n- British candy \n- organic and gourmet staples, like bread and milk etc.\n- snacks like wasabi peas and fruit gummies\n- ice cream and sorbet and gelato \n- 24-hour service (THAT'S RIGHT)\n- nice counter people\n\nSo imagine getting a little bit of all of the stuff I mentioned above, and for under $35.\n\nIt's true, friends.", "author": "Miguel d."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-04-21", "description": "This place is by no means your typical milk-eggs-and-beer corner deli. it's got a very wide produce selection all the way from avocados and lettuce to dill, bok choy and papayas. \n\nThe space is rather small but the selection and variety is very impressive; they've got your typical staples like milk, bread, etc., but they've also got udon, flax, granola, Amy's organic soups, flat bread, frozen foods, fresh tofu, tortillas, etc., etc....\n\nJust moved to the neighborhood two months ago and I've been stopping by this place every 3 days - love the selection, and I love chatting it up with Ayman, the friendly cashier.", "author": "Brodi B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-10-10", "description": "Apple gourmet has been a wonderful addition to the neighborhood.  Its  amazing how much this little store packs.  Fresh produce and the variety of import gourmet items, micro brews, yummy snacks, make this place a must go to place, even at 3 a.m. (open 24hrs.) the people that work there are a delight!", "author": "Sang H."}], "servesCuisine": "Delis", "priceRange": "$11-30", "name": "Apple Gourmet", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "404 Atlantic Ave", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/mwXwibqUZfNweaXR0Q75PA/ls.jpg", "@type": "Restaurant", "telephone": "+17188555788"}