{"aggregateRating": {"reviewCount": 35, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-07", "description": "Chef Rob Newton has opened a few solid Brooklyn eateries including Nightingale Nine and Wilma Jean, two spots I totally dig. Black Walnut, the new restaurant in the Hilton Hotel on Schermerhorn, seemed like a great opportunity to expand the brand, but a little out of character. Turns out Newton brings a similar sensibility to the space along with a few hidden charms.\n\nLike his other restaurants, there's a minimalism on display that lets the flavors do the talking. At Wilma Jean you're gonna get some good fried chicken. At Nightingale Nine, some competent Vietnamese.  Here, catering to not just the restaurant itself, but also to room service, Newton balances on that fine line between pushing the envelope and playing it safe. Thankfully, he hits the sweet spot.\n\nWhether Black Walnut is considered a financial success remains to be seen. The hood is still showing signs of adolescent gentrification. There are cranes aplenty, with new apartments and establishments popping up for blocks around. Is it enough to keep this spot afloat? I sure hope so. For starters, get some signage out front. Had I not been tuned into social media, or sites like Grubstreet and Eater, I would have never known about it.\n\nSo, off the bat, the cocktails were super delicious. Always a good sign. We had a couple of Wilma Jeans (rittenhouse rye, koval honey liqueur, fennel, lemon, bitters ) and more than a few magically smokey Dopplegangers (nuestra soledad san luis del rio mezcal, cynar, brennavin aquavit).\n\nWe started with some smaller plates, the high-point of which was a surprising chicken liver mousse with caramelized cocoa nibs, pickles, and perfectly grilled bread. The flavors really shined through. It was bright and creamy and now I want it again.\n\nThe flatbread with roasted mushrooms, kabocha squash, mint, and parsley was also good, but maybe could have been crispier. A little bit. But the flavors were spot on and there was a lightness to it you don't normally get from flatbread.\n\nWe also shared the dry aged burger on a butter toasted house bun with some hearty steak fries. Different enough from the solid burgers at Wilma Jean, with an aged funk that stole the show. The inclusion of pickled okra was a perfect pairing, indicative of the chef's ability to be twist expectations in subtle, thoughtful ways.\n\nThe pan roasted fluke, with unctuous chanterelles, parsley root purée, crosnes, and pickled spruce tips was light and tasty, if a wee small. That it left us wanting more is probably a good sign.\n\nI read positive things about the aged Tennessee ham and the grilled shishitos, but we were stuffed by the end of the meal. That Chocolate Pretzel Torte will have to wait until next time.\n\nDefinitely another plus on the Brooklyn food scene.", "author": "Eric C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-06-11", "description": "The food is good. Shared the fried broccoli, then fish muddle and spaetzle and the special dessert. We were told a garnish for the the dessert was not available but we ordered anyway. Now that I've seen the dessert, it was half the serving! No discount. Not a way to bring a local back.\n\nThe service was off but not bad, really tried but it's not as busy as it should be. The cocktails were both delicious and strong! But it's a depressing space. Feels like a hotel breakfast room.", "author": "Ruth P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-01", "description": "What a welcome addition to the neighborhood!  I tried dinner at Black Walnut this weekend and was thoroughly impressed by the experience: The food was inventive but comfortable, and everything we ate - the bread course, flatbread and ham appetizers, fish main course, and two house-made desserts - surpassed my expectations.  The cocktails were also perfect - well conceived and executed.\n\nThe room itself is also really nicely designed, handsome and cozy.  It's too bad you have to access it through the Hilton lobby, and perhaps that's why so few people seem to know about Black Walnut.  There's not even a sign for it on the building, that I can see, but hopefully it will soon get the recognition it deserves.\n\nOverall, a strong new restaurant for the neighborhood and a much-needed shot in the arm for this stretch of Schermerhorn Street.", "author": "Andrew P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-21", "description": "The shishito peppers  and the bread were delicious and I got the farro with mushrooms! \nCan't go wrong with the burger.", "author": "victoria h."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-18", "description": "Breakfast was wonderful and tasty. The waiter was very helpful. My eggs sunny side up was perfect and the home fries were very crispy. Coffee was hot!", "author": "Alice M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-22", "description": "Simple menu, excellent food preparation, friendly waiters... I would definitely recommend it for visitors and locals alike!", "author": "Milton N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-04", "description": "Amazing food and staff! As former BK locals, my wife and I stayed at the Brooklyn Hilton and and invited a bunch of friends to meet at the bar. The bartender was on point, but the best part was the food. Chef Tony Tardio is a wizard, and a serious up and comer in the NY restaurant scene. I've been following Tony around for a few years and this time decided to order a bunch of apps as our group was busy mingling. We ordered about eight plates, which were all amazing but three dishes in particular stood out--the Short Rib Grilled Cheese, Nacho Arancini, and the Salmon Tartare. Each were out if this world and a must have if you have the chance to visit! On. Side note, the scene at the bar was surprisingly happening, with a good looking mix of trendy locals and tourists. Great spot, and hats off to the chef!", "author": "Mike T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-02-10", "description": "We arrived after a movie and on Super Bowl Sunday. Had I not seen photographs we wouldn't have located it or we would have been hesitant to explore. We sailed past the bar with a smattering of people and into the main dining room which with it's proliferation of booths and cubbies, it felt stark and monastic. Lots of space, a greyed wood paneling, very corporate looking ( which, I guess I understand). Some nice art on the back wall, but random art on either side seemed incongruous. We sat in the corner booth with another group of three in the other far left booth, other than that, there were a completely silent two top in the middle boothes. Another couple two tables down finished their meals and left as we were ordering. The ladies in the other booth were clearly a group of Clinton campaign employees, getting together for the first time because that is all we could hear. Other than that, a faint clink of a glass and the hum of both a TV at the bar and an engine motor of some sort, it was dead. Some music would have certainly warmed the place up.\n\nOur server was delightful and sweet, very shy it seemed, the bar tender/ runner funny and peppy. With a super bowl menu, I ordered the poutine and sliders, my husband got the trout salad which looked beautiful. My poutine came first with crispy steak fries smothered in a Gouda infused sauce mornay. Really tasty after asking for some salt and ketchup. I think more Gouda could have livened it up from the start, but still yummy. I had the sliders after and was only able to finish one, buttery roll, very sharp cheddar, yum. Everyone always messes around with mild cheese but this one you could taste, I appreciated it ( oh, and some pickle). The menu is much larger than online as it includes specials and a separate bar menu.\n\nI most certainly would return, but my husband has a thing about being the last ones at the restaurant, which it seemed we were throughout the meal, so I'm sure he'd be hesitant. I do recommend they add some warmth only i'm not sure how. Candles at the top of the banquets perhaps? The lighting fixtures over the central booths look like they belong in the jewelry counter at a department store. Our pendants were pretty character- free, too so perhaps make more of a statement with those? Otherwise, it's feeling a bit 90's, masculine and stark. \n\nI do wish it luck and hope to enjoy further meals in our neighborhood.", "author": "aimee m."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-05-16", "description": "The saving grace of this restaurant was our Uzbeki server, AZ who cared a great deal about our experience. However, the original chef is no longer here which is why I suggested this to my family in the first plce. The dishes are bland and uninteresting. Just overpriced hotel cuisine.", "author": "Ada d."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-15", "description": "Great service! Unpretentious feel. Shishito pepper sunchocke app and beef tartar so yummy! Spaeztke and burger amazing. The hot chocolate rum dessert so delicious! Def worth a try!!  Xoxo", "author": "Kate And Tom N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-26", "description": "I like this place!  Food is good, fresh and tasty  but don't expect much for service, it's like nonexistent hotel service.    The place is contemporary and clean but bring good company with you because the place is empty which i don't mind.   My manhattan was made well and they serve delicious local made pie.  Overall a great neighborhood stop for a bite with a friend.", "author": "T B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-01-23", "description": "I made a reservation on Saturday night thinking it would be crowded. We were one of 3 tables at 7:00. The space is lovely, the room well lit and the staff attentive in a good way. For apps we ate the chicken liver and roasted baby carrot salad. Both were excellent. The presentation was lovely. For dinner we ate the halibut, farro with mushrooms and the steak. The only good dish was the steak at $34.00. It was tender and cooked perfectly. We did not finish the farro dish because it was as just not that good. We also had the halibut that was edible but did not taste that fresh. For dessert we ordered the pretzel cake which we did not finish either.\n\nI would love to see this restaurant succeed but there has to be an everyday burger and pasta option. In reading the reviews I feel like I was eating in a different restaurant. Given that the restaurant was not busy on a Saturday night indicates changes are needed.", "author": "judith f."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-06-24", "description": "We were staying at this hotel and wanted to get a bite to eat after a long day of traveling.  At 8:00 on a Friday, there was one other group of people eating in the restaurant.  This should have been a clue.  I felt the menu was a bit uninspired for spring/summer.  We didn't want a large meal but in looking at the menu, none of the dinners (there were about 5 appealed to us).  If there were any specials, we weren't informed of them.    I had to ask if there was soup as it wasn't listed on the menu.  I asked if the minestrone had a meat or vegetable broth and the server said he'd check. I never heard back from him during our meal though.  I just assumed it was a meat broth which I didn't want.  My dining partner settled for the chicken po boy sandwich.  It came with steak fries which were seasoned well and delicious.  He loved the sandwich which was pieces of tender fried chicken on a soft roll.  I settled on the salad of arugula and fried chick peas with lemon dressing.  It was arugula and warm sauteed chick peas, and the lemon dressing.  But,it was really very good.  There was ricotta salada grated over the top.  Then, oddly enough when I was done with my salad and my partner done with sandwich, out comes a large bowl of soup.  Yes, the minestrone.  We asked to have it brought to our room which our server offered to do.  He was quite accommodating.  The minestrone was spicy and the pasta very al dente but it was decent, not exceptional.  \n\nThe restaurant itself has very clean lines and interesting art work.  It's dark though.  I found it very nice and relaxing, even with the buzz of the bar in the next room.", "author": "L. R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-05", "description": "I was a guest at the Hilton hotel in which this restaurant resides and sat at the Black Walnut bar for a solo dinner. I was expecting the typical, mediocre to disappointing hotel restaurant fare. Instead I had the most refined and  delicious meal I have had in months. I'll be back for sure, whether I'm staying at the Hilton or not.", "author": "Jon P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-04-14", "description": "kind of a weird place to eat in a neighborhood surrounded by tons of great options. Not sure who'd want to eat at a pretty sterile environment inside a hilton hotel.", "author": "D S."}], "servesCuisine": "Breakfast \u0026 Brunch", "priceRange": "$31-60", "name": "Black Walnut Public House", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "140 Schermerhorn St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/Pg7C7G6wJGRnY5aqykNTNw/ls.jpg", "@type": "Restaurant", "telephone": "+19293371280"}