{"aggregateRating": {"reviewCount": 35, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2019-01-18", "description": "Full disclosure: This meal was courtesy of the corporate card. So essentially, free. And free makes everything feel good. \n\nSo, I had a bone-in NY steak. It was good. And the accompanying fries were good. And everything around me looked good.\n\nOne mark against them: No dinner bread. The photos here on Yelp make the bread look tantalizing. But when asked for some, the bartender said, No. I think they ran out. Lame.", "author": "Vegas K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-03-20", "description": "3 Stars for good bar service but uneven food.\n\nI was staying at the Hilton in Brooklyn over the weekend and had a chance to dine on bar bites and drinks at the bar, as well as room service by Black Walnut. The drinks at the bar were good, nothing super craft-cocktail, but good drinks. \n\nFor bites we got Charred Brussel Sprouts-- Slivered almonds, lemon and cranberries) and the Crispy Smashed Potato Skins-- Smashed red bliss, sage, Parmesan and zesty ranch). Both were really good bar food and we finished them (I even used some of the Brussel Sprouts to grab the last of the ranch!). \n\nHaving had a good experience with light bites at the bar, I ordered from BW for room service (they service the Hilton where they're located). I got a few smaller dishes for lunch, which ended up totaling over $50 with tip. Here's what I got:\n\n- (HARD PASS- SEE PICS) Arugula Salad-- Described on the menu as consisting of Aged ricotta and crispy chickpeas to top. This was the most underwhelming salad I've gotten in a while. It was a small heap of arugula, coated in some extremely salty oil, with what looked like shaved parmesan and some fried chickpeas (that were not crispy because of the dressing). I called because I thought there was a mistake- having expected a heap of creamy ricotta. I told them I wanted to send it back and after talking to the kitchen, the gentleman told me that was the aged ricotta. I told him I've never seen ricotta like that and that they should specify it on the menu because that was not at all what one would expect when hoping for \"aged ricotta.\" And for $12, this was a real let-down. They didn't take it back.\n\n- (HARD PASS- SEE PICS) Braised Pork Bao Bun-- Described as Crispy buns, Korean chili, sesame, carrots, pickled daikon. SIGH. At $4/bun I was really excited for something special. What I got instead were two heavily fried bao buns with a sliver of filling. I took one bite and oil was literally dripping down my chin and fingers from the friend buns. I ended up opening them and scooping one bite of filling out of each. That was an expensive two bites- even for NYC! I just don't know why they would fry these delicate buns. All they do is soak in all of the oil. Eek...\n\n- (WOULD ORDER AGAIN) Artichoke Hummus with grilled naan bread and fire roasted vegetables. This was the only dish I enjoyed, but I was so annoyed and grossed out by the other dishes (particularly the oil-filled bite of bao) that I left most of it. Still, if I had to order anything again, I'd order this.\n\nWith one good food experience and one terrible food experience, I think a three star review is warranted. Gosh, I hope they rethink that arugula salad (or at least the description) and the fried pork bao buns.", "author": "Andi P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-22", "description": "Food is so good. The bartender Tori was extremely helpful and attentive. We will definitely visit the Black Walnut again.", "author": "Danette C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-01", "description": "So. We went there to try the exclusive release of the IHOP beer, and left with so much more.\nTaury was freaking awesome!!!!\nShe was nothing but welcoming, kind, funny, and so helpful.\nWe were able to get the beer and she made us the drink that they set on fire. Once she said \"drink and fire\" we were sold. It was the best bourbon drink ever.\nAnd we we're typical tourists so she helped us out with a few other spots.", "author": "Koryn P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-11-02", "description": "This restaurant is inside the Hilton Brooklyn New York. \n\nThere are so many amazing places to eat in NYC, but we dined here out of convenience hoping that it would be better than your average hotel restaurant. It was not. \n\nThe food was edible, and the service a bit slow, but nothing really to complain about. The only reason to eat here is if your staying in the hotel, waiting for your room to be ready, waiting for some friends to arrive who are also staying at the hotel and starving because you haven't eaten since you started traveling to get to the hotel. \n\nI do have to say that the fried broccoli and mushrooms was interesting. I liked it, but thewas mixed reviews amongst my group. \n\nLet me repeat, there are so many amazing places to eat in NYC, so eat here only if you are staying in the hotel or have to be at the hotel and seeking something convenient.", "author": "Corissa L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-11-03", "description": "This is a restaurant in the Hilton hotel in downtown Brooklyn.  They have a small but tasty menu the drink are good. There is a sitting area near the window with fireplace and TV. I've never seen this place crowded so it is a good place to have a drink and talk. The flatbread is very tasty and and deviled eggs are good.", "author": "Marsha D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-22", "description": "What a surprise to find such fabulous food in a hotel none the less. A Hilton, Brooklyn. The price is so right, the service amazing and so is the food.   We will be back often and totally hungry. \nThe steaks, the soft shell crabs, hamburgers are incredible but don't miss out on the Lobster MAC \u0026 cheese.", "author": "Barbara S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-19", "description": "Chicken and waffles yum. Jalapeño corn waffle yum yum.  Spicy honey? Yes please. This place is a hidden gem on the first floor of the Hilton hotel.", "author": "Mark J."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-12-05", "description": "Rob Newton's new restaurant is completely unrecognizable from everything else he's done so far, from the decor to the service to the food.\n\nIt's located in the lobby of the Hilton Hotel in downtown Brooklyn, so it feels like a hotel restaurant, and while it is nice and has an upscale vibe, it is a 180 from his fun, casual spots.\n\nThe biggest issue was with the service, and while it was just the first night, the issues were pretty inexplicable. The restaurant was nearly empty when we ordered at around 7, and we were there for 2 hours.\n\nWe started with the 18 Month Aged Tennessee Ham with Japanese Milk Bread, Pickled Okra and Butter ($16). I was extremely sad when I realized that the \"Milk Bread\" is the exact same thing they give you as the complimentary bread to start. So after we got the complimentary bread and the House Flatbread ($14), 20 minutes later we got that same exact bread with a few slices of ham and pickles.\n\nMoving on, we then had the Braised Tofu Skins ($18), which were fine, and then noticed the table of 4 near us getting our entrees. The waitress asked if we wanted dessert, so they clearly forgot our burger, and rushed it in. The Dry Aged Burger ($23) happened to be excellent, but for the last issue, they brought it without the Steak Fries, which they said would be right out, but ended up arriving several minutes after we finished the burger.\n\nFinally, the desserts were pretty solid. We tried the Vanilla Cheesecake ($10), which was super creamy and nice and sweet, and the Chocolate Pretzel Torte ($10), which wasn't as good as the Pretzel Ice Cream it came with.\n\nMaybe breakfast is better, as the menu seems to have a number of sandwiches that sound great. I might return to try those. But I'd probably rather go to Wilma Jean next time I'm in this area of Brooklyn.", "author": "Mike C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-11", "description": "Flavortown downtown! It's time Brooklyn hotel food meets the new high standard as current Manhattan Hotel Food. Chef Newton of Wilma Jean and Nightengale 9 fame has opened an American restaurant in the Downtown Brooklyn Hotel\nSouthern style with Asian touches, this is elevated cuisine with flavors and textures that are inventive, sophisticated  and delicious.\nAte:\nJapanese milk bread with cultured butter\nShisitos, cabbage and sunchokes\nEast coast seafood muddle\nTotal: $43\nThe bread and butter with peppery bits was clever, texturally super interesting. The Shisitos with crunchy sunchokes and a goddess style dressing was lick the bowl great, also texturally interesting. The seafood muddle in a tomato broth was delish though a tad more spice would have given it a little pop. Lots of veg options, well thought out menu.", "author": "Franny A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-10", "description": "The staff here is awesome ! The service is great, The food is high quality. And also thanks to the bartender for my cocktail .", "author": "Kristina I."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-10", "description": "I come to Brooklyn a lot for work \u0026 usually when I travel for work I don't stay in the hotel. That's not the case when I come here though. I enjoy the food and drinks and Taury is definitely my favorite bartender!", "author": "Chris K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-12-17", "description": "Soooo, I arrived at the hotel at 10:40. Was told they were serving until 11. Was hoping to simply get a cocktail but when I went to the bar at 10:50, I was told they had last call already. Not traveler friendly. Also, I've been in Midwest towns that stay open longer that this area. Am I even in NYC???", "author": "Josh W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-21", "description": "Came in the have a drink along with my co- worker. The drink was amazing I had the prickly pear marg it was delish. The environment had a nice fresh clean feel to it. Our bartender Racheal was so sweet and kind. Had a great time!!!!", "author": "Samantha M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-18", "description": "I absolutely love The Black Walnut! The food the is amazing! The staff here are wonderful. The bartenders are well versed with there selection of drinks. Taury, Rachel, and AZ are the greatest!", "author": "Darius L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-18", "description": "Very good cocktails with great execution. I recommend fried smashed potatoes and arancini. The bartender Jordano was awesome and very personable.", "author": "Andrew B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-05-15", "description": "Would definitely not recommend this place for breakfast. Hot coffee tasted a bit burnt, oatmeal was primarily heavy cream, and it just wasn't worth the price. It gets the job done if you're staying here, but otherwise it's just like any other mid level hotel breakfast.", "author": "Gabriela R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-18", "description": "Our dinner here was dang good! We live nearby and were a bit unsure given the place is new and has had mixed reviews thus far - but we are SO glad we decided to try it for ourselves.\n\nThe food was fantastic - fresh, tasty, and well seasoned. We had the roasted carrots \u0026 asparagus appetizer, the Po Boy sandwich, and the cheeseburger. All perfectly cooked and yummy. But to start, they brought out warm bread with warm butter, and this was a huge plus in our book; it's the way bread and butter should be served, and not nearly enough of the higher-end restaurants serve it this way.\n\nThe dessert was to die for; pie from the local (and award-winning) Four and Twenty Blackbirds. We barely had room in our bellies but this treat is not one to miss.\n\nVery attentive service from our server Johan and the rest of the staff. And the ambience was a relaxed elegant.\n\nThis lovely place will very soon be discovered by the neighborhood foodies who aren't daunted by hotel restaurants (it is tucked within the Hilton Downtown Brooklyn); those who are will be missing out.", "author": "Barbara G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-29", "description": "Gabriel, the bartender is super chill! Nice friendly conversation, in a chic, brand new Hilton in Downtown Brooklyn! I had to do a conference call, and the space beside the bar with comfy chairs \u0026 couches, was the perfect, quiet space! Hey also have tv's by the bar \u0026 lounge to keep up with sports and/or news, plus a large dining room, which looks like it can accommodate good sized groups! Although, I did not eat, I hear their food is top notch, originating from the masters of Wilma Jean \u0026 their other locations (Carroll Gardens). It has since been bought out by Hilton, but apparently holds similar standards/menu, and still has some sort of affiliation.", "author": "Meri K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-18", "description": "I've been coming here for a few months and I must say it just keeps getting better and better from the food to the drinks. Whatever they're doing, keep doing it!! The staff is amazing and Tory is usually my go to girl behind the bar!!!", "author": "Z M."}], "servesCuisine": "Breakfast \u0026 Brunch", "priceRange": "$31-60", "name": "Black Walnut Public House", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "140 Schermerhorn St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/Pg7C7G6wJGRnY5aqykNTNw/ls.jpg", "@type": "Restaurant", "telephone": "+19293371280"}