{"aggregateRating": {"reviewCount": 14, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-24", "description": "Came for fries, am now addicted to the cocktails which are more sophisticated than they have any right to be. A regular hang in the neighborhood. Nice", "author": "Alex K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-05-29", "description": "My return to writing Yelp reviews begins with Endswell! \n\nCame here on a Tuesday evening -- ambience was perfectly chill (the 70 degree weather may have added to it) for catching up with a friend. There are a handful of good craft cocktail bars in the neighborhood, pretty much in the 0.5 mile radius, but Endswell definitely holds its own. 4 stars mostly for ambience, decor, and cocktails (got the Verte, Noir, and tried the Jaune -- all excellent / unique). Food was more of a 3 star -- steak frites was fine, and the cheese + charcuterie was good (but I feel like you can't really go wrong with that). Regardless I would most definitely return if I'm looking for somewhere to grab drinks in the area, but to be fair probably wouldn't travel to the area just to come here.", "author": "Susan C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-05-25", "description": "I popped in here on a whim since I was in the area and had been wanting to check this place out. I came for brunch and the menu has a good selection of entrees (everything from avocado toast to eggs and French toast). They also have craft cocktails along with coffee and tea to choose from. The space itself is very inviting with beautiful plants all over, a tin ceiling and a white marble bar and tables. It's not a huge space, so I could see there being a wait for peak dinner times or brunch.", "author": "Alexis S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-06-01", "description": "Cute new place we went to check out for a drink and snack after work. Really loved the ambiance with all of the plants and greenery and the marble topped bar and they had great oldies music playing while we were there. I ordered a Blanc cocktail and my fiance ordered a wine and we split a flat bread. The preparation of the cocktail was a sight to see .. including the bartender slapping some herbs on the back of his hand and some other fancy handy work crafting the cocktail. I was very excited to try after that show. It was good but I think I was expecting something amazing after all that went in to making it. Also the ice cubes were huge and I felt like took away from the drink. The flat bread was also good. I liked the bread the most. My fiance enjoyed his wine. Would go again to enjoy the atmosphere and give some of the other colors on the cocktail menu a try.", "author": "Kayla J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-24", "description": "Went for dinner before an event at BAM. The space is really beautiful-marble tables, lots of plants, great wallpaper in the bathroom. Had some rosé (light and dry and on happy hour), the heirloom tomato salad and coq au vin (both very tasty). Really nice service - friendly and attentive without being overbearing. Will definitely be back!", "author": "Christine J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-02", "description": "This place just opened and its literally already my favorite bar in the neighborhood, possibly Brooklyn. The food is amazing, the cocktails are the shiz (my hangover can attest to that!) and the staff are so awesome and cute! But the place itself is what sets this apart from everything else in the area. What they've done with the space is just off the charts. The breakfast poutine at weekends is quite literally to die for; I've been dreaming about that poutine for days! So needless to say I'm going back tonight and possibly tomorrow and the next and the next.", "author": "Rachel K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-16", "description": "The cocktails are amazing! I had the salmon for dinner--spicy and perfectly cooked. The staff is super friendly, the space is comfortable and theres wifi. Will be coming back for brunch.", "author": "Nicole C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-16", "description": "Visiting from Philly.  Great spot, perfect drinks, great decor and super friendly staff.  Only drinks this time but looking forward to trying their food.", "author": "Johan W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-18", "description": "I was fortunate enough to get to try this hidden gem before it blew up. The best french bistro in fort greene with a very chic vibe, the perfect place for a brunch cocktail. The owners grow many of their own herbs for the cocktails and recipes.", "author": "Beau B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-18", "description": "Literally a breath of fresh air, from the decor with its abundant and beautiful plants, to the cocktails and delicious food. Friendly and excellent staff - I'll be back!", "author": "Sarah W."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-05-16", "description": "I live a block away from Endswell. I use to come to the former establishment around 3xs a week. I was really looking forward to trying its replacement. This is my second time but was sorely disappointed!\nGreat bar in Ft Greene. Good cocktails. But the food, mediocre at best. I have been disappointed TWICE. My friends as well. I think all it will be is a bar, the food not expensive but definitely an after thought. Have tried 4 different dishes now. Definitely check out the cocktails but the food is not worth the time or money. I'm not exaggerating- I cook better food and so far from being an expert. Was looking for my new for dinner in the neighborhood but this won't be it. I do hope they do well. The staff was very nice!", "author": "Ingrid P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-01", "description": "Really cute and amazing spot to have dinner or drinks for the night. Perfect date spot, or just a cute place to spill tea with your girlfriends. Food = bomb.com and the staff are also super cute and attentive. Will def be coming back, hope it doesn't get too crowded when I come back next time", "author": "Christine C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-05-27", "description": "Price is right but the food is pretty mediocre. Like college dorm room mediocre. The salmon I ordered was so basic and boring that I felt he $17 price tag - which is a good deal almost anywhere in the hood - was twice too much. The bar staff was friendly - like a bit too friendly - but can't blame them for being bored", "author": "Edward Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-18", "description": "Great vibes, great interior, great cocktails, great food, great people!   Amazing poutine!", "author": "Chris C."}], "servesCuisine": "French", "priceRange": null, "name": "Endswell Bar \u0026 Bistro", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "773 Fulton St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/Z9wb60on2HSFvFKFfaXPYQ/ls.jpg", "@type": "Restaurant", "telephone": ""}