{"aggregateRating": {"reviewCount": 155, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-12", "description": "Best fish tacos in NYC. The burritos are also amazing. I love ordering from them and I always take friends here when they visit me. It's the best Mexican place in our part of Brooklyn.", "author": "James S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-27", "description": "We've been eating the Tostada de Buddy (spicy pork and pinto beans) for years and it remains consistently spectacular! Thank you!", "author": "T G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-12-01", "description": "When I first tried buddys, the food was amazing i loved it, but some time passed and they started to lack, Not sure if there is a new chef or something but I was looking for some good tacos, and buddys is where i went for a long time and the meat just wasnt cooked right on multiple occasions.", "author": "Edwin A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-31", "description": "The steak burrito here was to die for. That's some quality steak in a quality burrito and for a bargain. The burrito was huge and every nook and cranny was filled. The beans, rice, steak and cheese melted together perfectly. Topped with the salsas they give you, I just drooled a little writing this review. Seriously stop by for a quick lunch break, order and take it to go. Shoot, order 2 and save one for later. Everyone compares the smaller shops to Chipotle but I like both. Buddy's burritos are definitely softer and has a more melt in your mouth feel. I enjoyed every last bite of my burrito.", "author": "John T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-24", "description": "Do yourself a favor and try their fish tacos. I lived practically above them for 8 years before ordering them and was very pleasantly surprised. Still live here though, so now they are in the rotation.  Also, an unexpectedly good place to get a burger.", "author": "Brooklyn B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-24", "description": "My favorite Mexican spot in the area. Order at counter, they'll prepare your order and you pick up at the other end. Set up like Chipotle, but Buddy's has better food in terms of quality, taste, and portion. \n\nI usually go for the various burritos they have on offer. Regardless of your choice, the burrito will be stuffed with freshly grilled meat of choice, guacamole, salsa, and shredded cheese yet well wrapped (I always hold on the beans). Since the burrito is void of the usual carb fillers (rice, beans), meat is packed in. The burrito will also be longer than the provided plate. \n\nI randomly had the spinach quesadilla once, will eat again. Usually not a fan of quesadilla, but do like spinach rolls and such. The spinach is well seasoned and sautéed, wrapped alongside with cheese, was a joy to eat. \n\nNever had the tacos and oddly enough, the guacamole with chips. I guess it's because I'm fixated on their nachos if I'm craving chips. The nachos are definitely layered with ingredients, not just topped. Also nachos are most definitely entrée sized, not appetizer sized. \n\nService is friendly, only interacted with cashier though. Sauces are available at pick up area and some hot sauces are located on tables. However the place is a bit dingy, which I usually don't mind, but it's dingy in a dirty kind of way. Like sticky floor, tables had only been wiped with water in its entire lifetime kind of way. Don't let that turn you away though.", "author": "Leo C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-08", "description": "Definitely visit this place when you're craving a real char-grilled steak burrito. Not that bs stuff you get from the chain burrito spots. This place is legit and for the price, there is no comparison. The amount you pay here vs like chipotle or w/e will probably get you twice as much meat of higher quality and extra guac is only like 1 dollar more.\n\nThere is no telling how long this place will stay in business because the real estate is going up all over Brooklyn. Visit here and enjoy it before we all have to go back to Chipotle out of convenience.", "author": "Kenny Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-25", "description": "Yummy burrito's and they have tasty nachos. They are always fast with my food when I go and very friendly. So much food for the price", "author": "Marie C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-09", "description": "Not a frequent visitor of Brooklyn, but I was here yesterday with 3 other friends and everyone enjoyed the food.\nLate at around 8pm, we stopped by here for cheap eats. \n2 of us ordered quesadillas and 2 ordered burritos. Most of the food on the menu is below $10 and everything is super-sized! The portions are huge and intimidating before you devour it.\nI got the El Grande Burrito with Chicken for approx $9. It was huge, they were very generous with sauce, ingredients, utensils etc.\nWhen we entered, there were merely 2/10 tables filled up, when we began eating, the store ran out of seats. And this was late at night! The store interior is not the best nor the cleanest, but the food is really decent and beyond expectations. \nMy friends loved the quesadillas. The cheese was melted to perfection and it was more flavorful than other places' cheese. The guac was delicious but I realized then I had a slight allergy to avocado LOL!\nI don't think I could come here often since the commute is almost 3 hours, but this place is legit!", "author": "Vincent T."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-03-09", "description": "I ordered a super burrito and it literally fell apart in my hands. It was so poorly wrapped. But my real problem with this place was that I just didn't feel like the burrito was that good. I could have lived with pile of burrito mush had it tasted more flavorful. Mine had way too much sour cream it was really over powering. The salsa also tasted like it had been sitting out. Maybe I'm being a little harsh because I'm from California and tend to have high standards for Mexican food, but I honestly feel like I would have been better off going to Chipotle.", "author": "Shelly P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-28", "description": "Savory tacos, a lot of flavor. You can tell they take their time with the meats. The burritos are pretty large - all packed with flavor.", "author": "Viv M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-14", "description": "This place is the best.  I lived near here and came in almost daily after finding it!  I came even when there was a snowstorm and the owner was fabulous to me.  I've read some of the other reviews about the owner and I completely disagree.  He treated everyone the same and, as I mentioned, was there during the snowstorm!\nI moved away and I STILL come here. \nYou will not regret coming here, I dream about their food sometimes.\nThe staff is absolutely lovely, as well, and really make the trip worth it.", "author": "D O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-05", "description": "Best food I've ever had in my life. The workers are very friendly and the food is fresh. The ambiance is super welcoming. I definitely recommend the spicy pork nachos w/ black beans.", "author": "Nathan C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-13", "description": "I have been coming here since the late 90's, and it is amazingly consistent. Everything fresh and made to order. My go-to is the fish tacos, which are made in the authentic, Rosarita/Baja style: soft corn tortillas, beer-batter flakey white fish, chipotle mayo, chopped tomatoes and cabbage. Outstanding.", "author": "John S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-05-30", "description": "Very nasty owner.He basically took my order wrong,\nI apologized and politely let him know that my burrito was not given to me as i requested. He proceeds to argue and yell at me and kept stating hes been there 26 years and he couldnt have messed up my order.\n-Well i am 26 years old,have been here countless times and guess what? My family has been coming here way before i was born! My siblings are in their 40s and my parents were loyal customers here even before they were born! \nI was referring MANY people here from maimonides medical center ...\nwill definetly not anymore...\nI was* a very loyal customer til now.\n-the rest of the staff is very friendly and really do know how to cater to loyal customers. \nThis is a shame...coming from the owner HIMSELF.\n!food is good but i have too much pride 2 ever return here.\nwill spend my money elsewhere.", "author": "Ms. O."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-10-28", "description": "I have a tomato allergy and ordered a burrito over the phone. I made very clear that I had a tomato allergy, checking if the guacamole had tomatoes and asking for no salsa/pico de gallo. When I picked up my burrito, I again asked to make sure there were no tomatoes. Of course, I get home and there are chunks of tomato in the rice. I called and told them what happened. He knew I had asked for tomatoes and said \"maybe the rice had tomatoes, I don't know\" which is 100% unacceptable when dealing with allergies. There was no apology and it was treated as if this was a flippant situation. Luckily my allergy is not life threatening but this could have been for someone else. I would give negative stars if I could because food safety is most important, which Buddy clearly disregards.", "author": "Liz P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-17", "description": "Best Burrito bar in Brooklyn and possibly NYC.  Been going here for 20 years and it's always been amazing.  Go.", "author": "Eli G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-12", "description": "I've been coming here regularly for about a year and never had a bad experience. I love this place. The people who work here are always friendly. The food is fresh, tasty and really affordable. My husband and I split an El Grande with extra meat and are both super full at the end for about $10.  It even comes with guac. If you like spicy food I highly recommend using their house made hot sauces on whatever you order. Their grilled meats are all great and I'm also a fan of their super vegetarian burrito. Their tacos are also delicious and they are big enough that two tacos will fill you up.", "author": "Carla M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-12", "description": "After being disappointed by food in nearby restaurant we stopped by here. Tried the tacos and veggie burritos , super delicious and fresh !!\nQuick service , fresh food and fair prices ! \nWill definitely return!", "author": "Supriya K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-12", "description": "I dig this place.  The burrito I had was so big I couldnt eat the whole thing!  Thats a big-ass burrito...\n\nThey have plenty of options and everything I have had there has been very tasty.  No frills.  Sorta a dirty chipotle.  \n\nBe weary of the hot sauce. That stuff will smack your ass and call your susie. Dont say I didnt warn you.", "author": "Josh M."}], "servesCuisine": "Mexican", "priceRange": "Under $10", "name": "Buddy’s Burrito \u0026 Taco Bar", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "260 Court St", "postalCode": "11231", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/8OYfpcGtKqkWJxA4nCCSlg/ls.jpg", "@type": "Restaurant", "telephone": "+17184888695"}