{"aggregateRating": {"reviewCount": 155, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-05-12", "description": "Oh the salt they put in their burritos! You'd think you were going to die of sodium poisoning right then and there. But honestly, I can't complain too much as it's one of the only cheap places to do delivery to the southern end of CG. For helping stave off the hunger pangs in record time and on low funds, Buddy I salute you.", "author": "Thea T."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-03-24", "description": "it sucks , over priced ,dirty looking place , unaplealling , nothing more to say ,don't waste your time an cash trust me .", "author": "Francesco B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2009-03-22", "description": "the burritos are gigantic, first of all. I got carnitas, which was ok, not the best or worst i've had. i forgot to ask for refried beans instead of black beans, but they did have whole wheat tortillas. i almost went to california taqueria down the street, but then changed my mind at the last minute-- kind of wish i had gone with my first choice.", "author": "Sara N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-09", "description": "We ordered from here last night. I had the brooklyn burrito with chicken, which was AMAZING, and my companion had the tacos with steamed shredded beef...he was a fan except all the tortillas fell apart making them real messy to eat. \nI agree though that their guac is seriously lacking. If it's fresh like they say it is, it's fresh from one of those packets. \nI'll definitely order from here again (and before california taqueria), but no more guac unless they find some avocados somewhere and start using them.", "author": "MK B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2007-07-28", "description": "great burrito spot in cobble hill. I had the vegetarian burrito, a little on the messy side but still great.", "author": "Michael N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-11-19", "description": "I love this place.  The food just tastes good. Its not the fanciest tex-mexican on earth its just a rather large hole in the wall with consistent tasty take out food - you can eat there but I wouldn't.  We love the nachos (no meat) which are the best nachos I have ever had.  And their burritos are really really good. the place across the street is awful.  The fish tacos are hit or miss.", "author": "Julee W."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-06-02", "description": "A really underwhelming burrito. The meat lacks much taste, the sauces are not noteworthy and the thing falls apart about half way through. The cost to food ratio is about right but this place is still a total miss.", "author": "Nick H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-23", "description": "I really like the food here. I think is my favorite burrito place that I've found in NYC so far.", "author": "Isaac D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-10-25", "description": "The burrito here was huge. I wasn't impressed by the flavors and it took an inordinate amount of time for them to make it even though there were only two others in the restaurant at the time but it was ok. I've still had better burritos but this was ok for a last minute dinner stop.", "author": "Carlie D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-20", "description": "I had the Brooklyn Burrito with pork and my wife had it with beef. Very tastey burrito especially the meat. High quality meat used. I will definitely try them again.", "author": "Daniel C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2008-04-03", "description": "this place sucks. i would rather a burrito from chipotle any day of the week than from here. it took a long time to get, their tortillas dont taste good, and it's just underwhelming. your money and calories are better spent elsewhere, straight up.", "author": "seth h."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-20", "description": "Great takeout place.  Huge, tasty, filling burritos.  Yum!  I like the grande steak burrito with the extra \"green\" sauce.  Not sure what the green sauce is called but it's delicious.", "author": "S L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2007-04-16", "description": "Now that I've relocated to the West Coast, my visits to Buddy's Burrito are certainly limited. However, it is one of the places that I almost always make a point to visit upon returning home. I'm a big guy, and therefore I need a big burrito. A lot of Mexican joints say they have \"big burritos,\" but none compare to the \"El Grande\" at Buddy's. It's so big that they use 2 tortillas, and weighs over 8 pounds. Fine, I made that last part up, but nonetheless it's pretty enormous. My personal favorite is the El Grande with both chicken and steak, a mixture of both types of beans, cheese, guacamole, pico, and sour cream, no lettuce. Delicious. If you want something a bit smaller, go for the Brooklyn Burrito which is also very niiiice.", "author": "Jonah P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-07-02", "description": "You guys are CRAZY! This plays is AWESOME! The staff is not the friendliest, but who cares, the burritos are delicous! I recommend the steak burrito. I eat it at least twice a week.", "author": "darin c."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2009-09-28", "description": "I called to order three hard tacos but they were out of hard taco shells so I ordered 3 soft tacos.  When they came the soft shells were a sopping wet mess and completely inedible.  I understand that tacos don't always travel well, especially soft tacos, but when I called them back to fix the situation, there wasn't a manager working and the staff couldn't do anything to resolve the problem.  They told me to talk to the manager the following day and they gave me his name.  When I called him he said he wasn't the manager and there were no managers.  All I could do was call the owner the following day.  I spent $9 (plus tax and delivery tip) on 3 tacos that I couldn't eat and have no recourse except to try to track down the owner.  That is ridiculous.  The tacos may be good at the restaurant but not delivered.  I will never ever order from there again.  Poorly run place.", "author": "Jeff S."}], "servesCuisine": "Mexican", "priceRange": "Under $10", "name": "Buddy’s Burrito \u0026 Taco Bar", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "260 Court St", "postalCode": "11231", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/8OYfpcGtKqkWJxA4nCCSlg/ls.jpg", "@type": "Restaurant", "telephone": "+17184888695"}