{"aggregateRating": {"reviewCount": 155, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-27", "description": "I got a chicken Brooklyn burrito- it's basically just Mexican rice, chicken and the perfect amount of cheese. The chicken is super flavorful, and my boyfriend got the steak- also super delicious. \n\nKind of wish there were more veggies but that's a personal preference... \n\nIt was delicious, I'll definitely go back- but maybe ask for more veggies in the burrito?", "author": "Laura V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-28", "description": "Awesome burrito place with friendly staff. Open relatively late (at least for an old soul like me) for your late night munchies.", "author": "Mei Y."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-30", "description": "So yeah, we were so hungry that we went next door to grab something to eat...either it's the best burrito I've ever had or we were so freakin' hungry that everything tasted phenomenal!\n\nCarne al Vapor burrito was amazing! There was delicious tender meat, and amazing guacamole just doused in salsa and wrapped in the lightest tortilla. Ironically we didn't get any tacos...I'm not really much of a taco person anyway. But I'm sure I might change my mind if I had one of theirs! (Gives me a reason to go back again on the next trip.)\n\nThe location is great, open atmosphere and easy to get to from the street. You can dine in or get it to-go. \n\nYelping admission: Forgive me, but I was so hungry I didn't even care to take a photos!! But it's massive!! GINORMOUS! Hoking huge! - I still finished it though - yeah that's right, I devoured it. :P", "author": "Nahid D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-10", "description": "Buddy's is a reliable and decent option if you're craving cheap and tasty Mexican food that is as least kind of close to what you might find in Tucson. It's a shame that the beans are not refried, and there is more emphasis on fillings instead of just the divine bean and cheese, but it's all fresh and authentically treated. \n\nIf you're on your way to Chipotle down the street, eat here instead.", "author": "Joe C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-28", "description": "Not mind-altering food but it's a good value. I like the fish tacos, grilled chicken burrito, and the free salsas.", "author": "Jenna S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-03-16", "description": "I enjoy a burrito as much as the next burrito lover so to have ordered a shrimp burrito and gotten a sloppy cheese mix with sickly looking shrimp with soggy rice, I was seriously disappointed. Maybe it wasn't their best night but I'm not willing to find out. Good luck.", "author": "Nathline C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-11", "description": "Wow, I walked into Buddy's tonight, tired from a long day, and hungry, but not sure what I wanted, and even wondering why was I walking into Buddy's since I hadn't been there in a while. I ordered the Quesadilla with shrimp, asked for hot and green sauce as well as pico de gallo which they gave to me. But once I got home and took my first bite, oh wow! So delicious. Their red sauce inside the Quesadilla with the shrimp was exquisite.\n\nBest ever!\n\nGive the guys a fan, though, summer is coming! They work really hard. The food is delicious. I'll be back!", "author": "Sheela W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-09", "description": "Don't come here often but when I do the food is always great! I have a hard time branching out and trying new things so I only stick to the quesadillas. The chicken and spinach are awesome!  Only reason I can't give this place 5 stars because they don't deliver to my area :(", "author": "GiaB90 .."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-09", "description": "Yes! Oh glorious Yes! Buddy's is by far, my favorite Mexican joint in the neighborhood. \n\nThe Good: Obviously it's the food. Which is made right in front of you. For anybody craving a \"Big Lunch/Dinner\" try the \"El Grande\". It's fantastic. Also, their Brooklyn Burrito as well as their Vegetable Burrito are two personal favorites of mine. \n\nThe Bad: The only bad reflection I have towards Buddy's is the area to sit. Usually, the first three tables by the door are always taken. This leaves you with the back of the restaurant to sit in. Which sorta comes off as not a very enjoyable part of the restaurant to eat in.\n\nThe Terrible: Nope not here. Buddy's has nothing too crazed to speak about.\n\nWhat I would Recommend: Honestly, add some lighting in the back to enjoy my food. Also, it's going to be hard to view the television screen from this far back and the tv being cornered towards the front. Possibly think about installing another television for the people in the back. Which could end up bringing in more patrons into your restaurant.\n\nThe Grade: I'm giving Buddy's 4 stars. Why 4 stars? Mainly due to the situation with eating in the restaurant. Aside from this, the food is terrific and the staff are a great group of nice guys.", "author": "Frankie G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-08", "description": "Great food, great price. Simply as that. I just wouldn't recommend the shrimp tacos, it's a bit plain and you don't get full off of that. The nachos and Burrito are very good though. I def recommend this place. Look forward to coming here again!", "author": "Jasmine A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-09", "description": "It has been years since I have been here, but nothing has change and they did not disappoint.  Use to visit often when I lived in Brooklyn and have been dying to come back and check out the food.  Since it was later than I like to eat I passed on the burrito as they are still in HUGE portions.  Their burritos can serve for two meals.  They definitely pack in the ingredients.  I actually had the flank steak with black beans \u0026 rice.  It was really good.  The price point is more than reasonable for the amount of food the provide.  Anyone who likes Mexican food I would highly recommend this spot.", "author": "N M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-09-07", "description": "The burrito I had (carnitas + black beans) didn't insult my mother or give me food poisoning, so hey, it's still a burrito. I imagine your enjoyment level will be directly related to your inebriation level. \n\nPros:\n* burrito was sufficiently enormous\n* burrito was cheap (less than $8)\n* fast service\n\nCons:\n* bland, bland, bland. \n* this place had a B rating from the health and safety board. You deserve better, but if you're like me, you probably won't care. \n\n2 stars because there's so much better to be had. Make the hike to calexico if you really want a burrito ($$) or, I dunno, try somewhere else ($?)", "author": "Alex M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-10", "description": "What you need to know is, yes, this place is better than Chipotle and it doesn't hurt up your stomach like Chipotle.  Support the local place.\n\nThe burritos are large and super tasty.  The chips w/ fresh salsa is super good. \n\nI'll continue to order from Buddy's.", "author": "Mark S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-23", "description": "For 3.50 I get two corn tortillas piled high with black beans, lettuce, cheese, pico de gallo, guacamole, and cilantro. And it all tastes fresh. And they're open late when you need carbs to soak up the booze.", "author": "Nicole G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-12-13", "description": "I've ordered takeout a few times and never had a problem. The place isn't much to look at, but I'd probably go back.", "author": "Vashti R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-26", "description": "A great place to get delivery.  I regularly get a meal for two for under $20.  Honestly, Ive never eaten in, so i cant speak to that experience... But the food is definitely a step-up from Chipotle (and I actually AM a fan of Chipotle, considering it as \"fast food\" at least).  My usual is a vege burrito, and it comes with all you would expect or could ask for.", "author": "Michelle K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-12-03", "description": "From the outside, didn't look too promising but we decided to give it a try. This resulted in us discovering the best burrito and quesadilla on this side of town. The burrito was muchhh bigger than expected- awesomeness! (must upload pic next time I go!) It came with all the fixings and didn't charge you 2 dollars extra for guacamole (cough*chipotle*cough). The quesdadilla was also huge and seemingly endless. You could tell the ingredients they used were fresh and high quality. I will definitely be returning next time I'm at the Cobble Hill theater across the street.\n\nOh, and they have wheat tortillas!!!! (for those like myself who like to pretend to be healthy, lol)", "author": "Marla B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-03", "description": "I go to this place all the time.  I love it.  It is nothing fancy and is not a place you wanna go on a date.  It is mainly a takeout but there is some seating.  The burritos are amazing.  The super vegetarian taco is so good you don't miss the meat.  Everything is made fresh so it's best to order ahead of time.  I generally get everything with shrimp and it's awesome.  Also the southwestern salad (w/shrimp) is SO good.  I have been going here for a few years now and I keep coming back.", "author": "Nicole S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-08", "description": "I wish this place was closer to me! The food is great and the staff are friendly. The portions are also very generous. I stop by whenever I am in the neighborhood. Highly recommended.", "author": "Kay N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-24", "description": "Their chicken tacos are an absolute must.  Chicken is grilled and charred to perfection and each bite is a fresh, hot, tangy taste of heaven. I also enjoy their tostadas with shrimp/beef. Note, though - their guacamole is all avocado.  It was kind of strange not having any tomatoes in it.  Nevertheless, huge portions and very inexpensive.", "author": "Harold H."}], "servesCuisine": "Mexican", "priceRange": "Under $10", "name": "Buddy’s Burrito \u0026 Taco Bar", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "260 Court St", "postalCode": "11231", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/8OYfpcGtKqkWJxA4nCCSlg/ls.jpg", "@type": "Restaurant", "telephone": "+17184888695"}