{"aggregateRating": {"reviewCount": 155, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-07-29", "description": "The\nFood won't\nAmaze but\nGood service and\nReally large portion sizes earn three stars.", "author": "Justin L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-25", "description": "Great place for some cheap eats in Cobble Hill. The SUPER vegetarian taco was amazing.", "author": "Deli Llama K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-24", "description": "I love this place! the food is cheap and very tasty.  they grill and cook right in front of you so i like that.  the portions are huge for the cost and that's partly why i keep going out of my way to eat there or take out.  the other part is for the taste.  they have the best burritos I've ever tasted.", "author": "Ann D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-02-25", "description": "I LOVE THIS PLACE..... awesome burritos and for you morons who said you would rather go to chipotle( owned by McD's)...go ahead and get your daily dose of way toooo much over processed food... Buddys makes it fresh and my burritos are always soo good....\n\nplus the service is awesome, the people that work there are so friendly", "author": "David M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2008-07-19", "description": "Had a few tacos and a quesadilla.  Three comments:\n\n1. The food is very mediocre.\n\n2. The people who work there are dour, rude, and obnoxious.  Crappy service with an attitude.\n\n3. I saw roaches on the wall.\n\nLook.  There's \"LA Style Burritos\" a block away.  The guys are nicer, the food is better, and I never saw roaches there.  If you have a hankering for Mexican food, do yourself a favor and walk past Buddy's.  Go to LA Burritos.  Your stomach with thank you, and you'll be a whole lot happier.\n\nOn October 21, 2015, NYC health inspectors cited Buddy's for the following violations:\n\n* Non-food contact surface improperly constructed.  Unacceptable material used.  Non-food contact surface or equipment improperly maintained and/or not properly sealed, raised, spaced or movable to allow accessibility for cleaning on all sides, above and underneath the unit.\n\n* Evidence of mice or live mice present in facility's food and/or non-food areas.\n\n* Filth flies or food/refuse/sewage-associated (FRSA) flies present in facilitys food and/or non-food areas. Filth flies include house flies, little house flies, blow flies, bottle flies and flesh flies. Food/refuse/sewage-associated flies include fruit flies, drain flies and Phorid flies.\n\n* Facility not vermin proof. Harborage or conditions conducive to attracting vermin to the premises and/or allowing vermin to exist.\n\n* Food contact surface not properly washed, rinsed and sanitized after each use and following any activity when contamination may have occurred.\n\n* Food not cooled by an approved method whereby the internal product temperature is reduced from 140º F to 70º F or less within 2 hours, and from 70º F to 41º F or less within 4 additional hours.\n\n* Canned food product observed dented and not segregated from other consumable food items.", "author": "Peter S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2008-12-12", "description": "Okay, I'm not such an asshole that I can't admit when I'm wrong. Buddy's may have just about the worst guacamole ever, but I ordered a Brooklyn Burrito recently and it was pretty okay. It was way better, in fact, than the burritos I've had at California Taqueria, which has been my cheapo Tex Mex fast food go-to joint for months.\n\nIt's still not great, or even very good, but for New York fake Mexican food, Buddy's will do just fine.", "author": "Abigail S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-09", "description": "I must admit, I've only had one thing from Buddy's (basic gourmet burrito with shredded pork), but in my defense it's because this is the best burrito I have ever tasted in my life and I can't bring myself to order something that might be less delicious. You must try it.\nOne negative, their guacamole which is supposedly \"all avocado, no filler\" is a GROSS mis-advertisement. Quite the opposite, it's all filler, very little avocado. But this doesn't even make a mark against them because their burritos are so awesome.", "author": "Mardi R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2006-09-26", "description": "We've ordered in twice from Buddy's, and I'll order delivery from them again. You can't go wrong with their Brooklyn Burrito, and C. reports that the vegetarian burrito is also solid. They're relatively big, so prepare yourself for a filling meal. (I can barely eat the whole thing.)\n\nThe chips and salsa make a nice accompaniment to whatever you order, and be sure to try the lime Jarritos. It's a Mexican soda, and I recommend it. One disappointment. They don't serve horchata at Buddy's. What kind of Mexican place doesn't serve the traditional Mexican drink?", "author": "Heath R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-07", "description": "Additional visits make Buddy stand out. Lots of meat in tacos, incredibly fresh guacamole, low prices, and friendly service.", "author": "Roberto A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-02-16", "description": "ordered delivery from here the other night. \nwe ordered:\nchicken nachos\npork burrito.\n\nthe nachos were pretty good for the most part... but their guac is not that great. also, they should really cut up their chicken in some fashion, as an entire breast of chicken is kind of impossible to eat via nachos. and it seemed light on nacho chips.... but then, at the bottom, there was a hunk of chips all stacked together. could've been better, but it was tasty. and they get points in my book for holding back the sour cream on request.\n\nmy boo seemed to like his burrito. he devoured all of it.\n\ndelivery took a little over an hour, which seems like a long time. it was a random Monday night, and i live pretty nearby, so i would've expected more like a 30 min time frame. \n\nbut it was also pretty cheap, coming to $17, so $20 with a tip. we'll be trying delivery from here again, so we'll see if there's any improvements.", "author": "Kathleen A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-04-25", "description": "Go ahead, ask a random New Yorker on the street where you can get some good Mexican food. Most of the time the standard answer is that you can't in New York City. Be careful that you're not asking a Californian transplant, or you really won't want that earful.\n\nAnyway, I'm from Tennessee and I've lived in Texas. So that means I know tex-mex better and I'm no purist anyway. Buddy's does something great, which is cooking the meat to order. My husband consistently gets a chicken burrito and it's almost as big as his head. That means it fills him up, folks. I waffle between getting chicken nachos and trying to be healthy and getting a meat platter (I did once try a salad too). OK, Buddy's is pretty serviceable. If you're hitting up the movies later or you're just hungry and you don't want to break a $20, go to Buddy's. Now if they'd just slice that freshly-cooked meat into more serviceable pieces we'd be really cooking with gas. I'd say this place falls more on a Cali-Mex or Tex-Mex style scale of \"Mexican cuisine authenticity\" but please, it's Brooklyn. It tastes good, it's fresh and it's fairly inexpensive. I'm not complaining about having this option in the hood. When I want nachos, this is my go-to spot.", "author": "Cara M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-03", "description": "Very very good Mexican food! I was surprised especially since I was told you can't find decent Mexican food in NYC. We have a lot of good Mexican food back in California \u0026 this could compete with any of them. A little pricy (maybe because of its location?). But clean \u0026 delicious", "author": "Hodad N."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-02-01", "description": "I had the Shrimp Taco's that were pretty good and the Nacho's. The chicken in the nacho's was not sooo great... but I wouldn't let that be a stopper for going here. Decor I give a zero, but most of these places are not meant to be classy in any way, but I wish they made at least a 3 star for the decor. I would go back, but there is room for improvement for sure. It was also reasonably priced.", "author": "Sera A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-12-02", "description": "Now, befor i say anything, this place has been here probably befor i was born. it seems like the type of place that was a hit when it first opened up. The food comes in massive portions at a great price. fresh and fast. its very good. However the taste of their tacos isnt as good as oaxacas, but it is bigger.", "author": "Ali F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-07-18", "description": "My burrito was delicious until I bit into a piece of cilantro, after asking the guys nicely if the gourmet burrito had any and was told no. I even heard the cashier ask the \"cook\" if there was any cilantro, in Spanish. He also said no. Well, fellow cilantro-haters, it does. Enough to make you feel sick. Why lie about something like that to your customers??? Or if it wasn't intentional...how do you not know what's in the food you're serving? They get three stars from me cause their $3 sangria was good (tasted like a juice box!), and my boyfriend loved his burrito. I'm just sad my experience was ruined by their mistake. I can't help it that cilantro makes everything taste like laundry detergent!", "author": "Rebecca M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2008-04-28", "description": "Yuck.\n\nGood to see I'm not the only one who thinks this place is the opposite of delicious. The weird sweetish sauce on my burrito was gag-alicious.  Ate here once, got burned, ain't gonna do it again.", "author": "Alice S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-29", "description": "I must admit their Burritos are very large.  My favorite is the Brooklyn Burrito with steak.  A major plus is that they will make it to order.  Often I like mine spicy.  I also highly recommend their shrimp tacos.", "author": "Bill J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-16", "description": "Went there for two veggie tacos on a whim for a total of $6--cheap! The were both delicious! Messy  to eat with all the packed-in goodness, but delicious. Everyone was super friendly. However, and I feel bad to say it, they need to hire a better exterminator. Upon opening the bathroom door and flicking on the light, a medium sized black roach started running around. I ended up swinging the door wide open, the roach came out by me, then ran out into the restaurant, and under the door of the next bathroom. Gross.", "author": "M D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-16", "description": "Unassuming place that produces very tastey, but basic, food for an excellent price.  Be sure to try their home made salsas.", "author": "Dave N."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-09-04", "description": "Serviceable but nothing to write home about. If you're hungry it will do the trick. I cut my Tex-Mex teeth at the late night taquerias in Chicago and NYC's offerings just don't measure up. Buddy's is about the same quality as Lobo and 10x better than California Taqeria down the street. Paid $7.25 for a chicken burrito and $5.50 for salsa/guac and chips", "author": "Will S."}], "servesCuisine": "Mexican", "priceRange": "Under $10", "name": "Buddy’s Burrito \u0026 Taco Bar", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "260 Court St", "postalCode": "11231", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/8OYfpcGtKqkWJxA4nCCSlg/ls.jpg", "@type": "Restaurant", "telephone": "+17184888695"}