{"aggregateRating": {"reviewCount": 155, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-18", "description": "Super vegetarian burrito. Made in a hurry. Fair price. Flavorful, light but filling, and fresh! The burrito was stuffed. Delectable taste hit the spot [on my taste buds and in my belly]!!! Best burrito in a long while. The only thing missing were a toss in of a few chips. Chips extra $2.  I will surely return. Pleasant staff. Cash or credit. Open late.", "author": "K S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-08-06", "description": "So far I've eaten from Buddy's twice.  The first was at night after work.  The staff were really friendly \u0026 delivery person was super sweet.  All I can say is that the portions are very good and the guacamole, tomatoes, and onions are fresh and deelish!!!!\n\nThe Super Veggie Taco is like 1/2 a burrito, I ate it with a spoon because it was piled high. YUMMY!!!", "author": "K C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-11", "description": "My parents recently came to NYC for the first time and I took them to about 6 it 7 different restaurants that I knew they were going to love! All of them that we tried, their reaction was the same, \"yeah, it was good. But not great\". I could tell they were trying to be nice. On their last day we walked around the neighborhood and walked past this place. We were getting pretty hungry, so we decided to stop in and my parents ordered a ton of food (every other place had tiny portion sizes). On our way back to my apartment, our bag felt as heavy as a small child and smelled amazing. My parents fell in love with this Mexican place! They loved the southwest chicken salads. I still eat here every now and then. Definitely the best Mexican I've had in NYC and when my parents visit, they won't leave without stopping by.", "author": "Tia S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-14", "description": "Do not come here if you plan to go out in a slinky dress after. Do not come here if you are getting fitted for your wedding gown after. Do not come come here if you want that Scarlett O'Hara waist afterwards. These monster burritos go down swell and tasty. The Yelpers who compared this to Chipotle made me cringe..the food here is far yummier and filled more substantially. This may not be your authentic Mexican burrito, but this NY/Californian hybrid sure tastes fine. The shrimp Bklyn burrito has a flavor that has been lacking in so much fast food Mexican I've had lately. The vegetarian one is okay also. The service here is friendly, if laid back(read, a little on the slow side).\n\nI've seen the other Yelper complaints about cleanliness. I didn't see much to complain about when I came.", "author": "Helen Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-20", "description": "Went there today for the first time...  Hot,  no ac... but the food was delicious, affordable and plentiful.  I travel a lot for work but this will be my go to in this neighborhood!", "author": "Jon C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-13", "description": "Came in right at closing time but no problem. Made my tacos and tostadas anyway. Really nice guys here and it always tastes great. Never had a bad taco here. Good prices too.", "author": "John C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-21", "description": "Each burrito is made to order.  Unlike Chipotle, there is no vat of chicken or beef.\n\nThat's annoying when you're waiting.  BUT, it tastes really good!  And in a non-Chipotle type of way.  They use stewed tomatoes which sounds nasty but works really nicely.  And the guys are always nice.  Recommended for sure.", "author": "Jared S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-11-16", "description": "I've ordered from buddy's once (delivery) and while the food was good, it was not what I asked for. I specifically told the person on the phone that I wanted a burrito with steak, and received one with chicken. I paid the delivery guy, checked to see if the order was right, realized it wasn't and called him back. He told me that he couldn't do anything about it because he had already delivered it (I took about a minute to call him back) I would probably eat at buddy's (in person) but I wouldn't order delivery again.", "author": "Sarah B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-30", "description": "This place has great burritos. They're stuffed full of ingredients, all of which are balanced in portion. The food is hot, fresh, and filling. Also, the guys making the burritos actually know how to roll them, so that's a plus. Like many have stated, it does get hot in restaurant, especially by the counter. That's only a problem in the summer; in the fall and winter things are comfortable.", "author": "Aatish P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-18", "description": "We get delivery from Buddy's a couple of times a month. I have only eaten burritos but the wife gets quesadillas as well. It works quite well for me. You would think it is hard to go wrong with a burrito but so many places somehow manage it. Buddy's knows what they are doing. The ingredient quality, size and taste are all very good to me. I think out of a dozen+ burritos I've only gotten gristly meat once. I get the chicken, enchilada pork (fave) and steak and all are good. The vegetarian chili burrito is another favorite and really excellent. Their beans are flavorful. The rice is perfectly cooked and the tortillas are always fresh. To me burritos are really a matter of personal taste. Over 20 yrs, I've yet to find one that matches the amazing, late, great \"Tortillas\" in Atlanta GA but I know plenty of folks who hated their burritos. As outlined above, Buddy's at least consistently delivers a good quality product (which you certainly can't take for granted around here) and one that I happen to like very much. Their service is always fast and courteous. If you're in the market for a good burrito you should definitely give Buddy's a try.", "author": "Henry M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-08", "description": "I get nachos for dinner from here more than I'd like to think about ... but they're always awesome. Yeah, it's kinda hard to eff up melted cheese over chips, piled with beans, guac, etc ... and they don't. That and they're fast, cheap, and friendly. What's not to like?", "author": "Anna D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-12", "description": "I enjoy buddies a lot. I love any of their dishes with the steak, except the chimichanga with steak was slightly disappointing (but i have a feeling they gave me pork by mistake). However I'm always leaving full and satisfied. Great spot. Huge quantities.", "author": "Andy N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-20", "description": "Love Buddys!! Ive had their tostada salad, huge burrito, plu southwestern salad all with shrimp and they are all my Fav!! I mean I can taste everything, its always fresh and omg the shrimp is amazing. Ive never ate any of their meats so cant help you there. The staff is always friendly.", "author": "Jennah S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-25", "description": "So happy to have moved back to the land of filling, cheap and tasty fast food. Best tex-mex in the land. Mmmmm shrimp. Really shrimp. Not, like, tiny and out of a freezer bag shrimp. The steak: it's juicy. It's real steak. None of that shaved steak grossness. Yup, the portions are entirely huge so I often take my quesedilla to go and save it for later/tomorrow (this works best when guac and salsa are on the side). \n\nChipotle!? Seriously!? Gross. \n\nAlso the dudes are awesome. I practically grew up eating here. If you throw 'em a smile they'll smile right back.", "author": "Kelsey B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-01", "description": "It sounds like a bad chain restaurant, but isn't. Solid place, fresh food. I mostly get Brooklyn Burritos with chicken or carne asada. I'd skip the guacamole, which I think is weird, but maybe some people like it.", "author": "Devin M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-28", "description": "My favorite burrito place in the area! \n\nI always get the Gourmet Burrito with chicken...\n\nLove that the chicken gets a char on the grill and love all the guacamole, salsa fresca and cheese -- all the right components.\n\nYou *may* have to wait a bit depending on the number of orders ahead of you...but I've never been disappointed, no matter how long I've waited.", "author": "Lisa L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-04", "description": "Finally finally finally found my burrito spot!!! I had the steak burrito which I believe is called \"The Brooklyn Burrito\" it was awesome so fresh and tasty and huge. Also, ordered the Guacamole which was definitely the best I've ever had! I can't wait to go back!!!", "author": "Jimmy S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-12-15", "description": "Not sure why this place gets such a bad review, but coming from California, maybe I'm just used to dirty, unkempt hole in the wall type mexican restaurants.\n\nThe only thing I've ordered is the El Grande Burrito with carnitas and it definitely brought me back to memories of eating giant burritos in college back home. I am a big eater and the El Grande is a solid meal and a half for me. Carnitas are freshly cooked. My wife has ordered the chicken and it is seasoned rather well. Simple, but well.\n\nI've never eaten there (not sure why you would), but the service is fast and you can watch them prepare your food (always slightly comforting). I wish their food would include chips though!", "author": "Chris H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-13", "description": "I'm so sad that I've moved out of Buddy's delivery range. I miss being able to not move off the couch to get the best burrito ever - Brooklyn Burrito with steak, no guac. Absolutely heavenly. I'm also lucky that I actually dragged myself into the store once, because I then discovered the chirizo and potato quesadilla, which is huge and so, so delicious. The best part is that my boyfriend and I would share one, so I would only ever eat half my burrito, which meant 2nd meal of burrito later. And now I think I know what I want for dinner...", "author": "Peggy N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-06", "description": "Yummy!!! Brooklyn Burrito is delicious.  Support this local business because it tastes better than the corporate chains descending on the area and the owner is a friendly person!", "author": "Shannon P."}], "servesCuisine": "Mexican", "priceRange": "Under $10", "name": "Buddy’s Burrito \u0026 Taco Bar", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "260 Court St", "postalCode": "11231", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/8OYfpcGtKqkWJxA4nCCSlg/ls.jpg", "@type": "Restaurant", "telephone": "+17184888695"}