{"aggregateRating": {"reviewCount": 155, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-12-23", "description": "I love this place. I love this place so much that it almost kills me to not give it 5 stars, so I'll start with my reason for the markdown: they seemingly don't have AC in the summer or heat (as I found out tonight) in the winter. It's incredibly unpleasant to eat there when you're freezing your butt off, and my boyfriend and I live too far away to take the food home. \n\nNow, onto the positive: this is some seriously good, seriously cheap Mexican food. Most items on the menu are around $10 or cheaper and the portion sizes are generous. The meat is cooked to order and is consistently great. The food isn't the prettiest thing in the world, but it's filling and delicious. Also, $4 beers? Sign me up. \n\nWorkers are always really nice. They take cards too which is huge. You order at the counter but there are plenty of seats inside. There's tapatio hot sauce at every table and there are a few salsas to try too. Pickled jalapeños are self-serve. Guacamole is included and the portion size is BIG. \n\nAll in all, this place is the real deal. I had someone tell me that the best Mexican food should be no more than $15 a plate and this place is the perfect example to corroborate.", "author": "Hannah M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-08", "description": "This place is great for authentic Mexican food. I don't understand how Chipotle even survived next door. \n\nI only wish they had fresh jalapeños.\n\nTheir staff was super sweet and hospitable.", "author": "Marley M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-08", "description": "This place is a good spot in the area for Mexican food, given that there is so few and not everyone wants to eat Chipotle all the time (honestly, I think this place is better than Chipotle).\n\nLoves:\n+ yummy and big burritos\n+ everything is made right in front of ya and it's fun to watch\n+ they accept cards\n+ nice staff\n\nWhile it's in a visible location, Court Street is just bursting with restaurants so there's a chance you might have walked past it without even noticing it. Regardless, I'd say it is a reliable place if you're craving some good ol' Mexican food in the 'hood!", "author": "Connie H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-10", "description": "My nail salon is in the neighborhood and I tend to go after work on Friday's. I was looking for somewhere to grab take-out before taking the train home. Yelp led me to Buddy's.\n\nI had their steak quesadilla, which comes with sour cream, pico, and guac. I like that it came with all of these condiments - usually places charge extra.\n\nThe quesadilla was a very large portion size and I was really full from finishing it - I almost didn't finish it!\n\nCounter staff was very nice and my quesadilla was very quick to come out. I'll definitely stop by again when I'm in the neighborhood.", "author": "Michelle T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-26", "description": "I get the high stars, but I don't at the same time.  I came in for lunch, was not busy at all, placed my order nice and easy (just got a burrito with pork).  Two people come in after me, and their food was made before mine... (barring it was a solid ten minute wait anyway, which didn't really bother me, as I wasn't in a rush)\n\nI get the burrito, and damn, this thing is big (cue Michael Scott).  I could tell it was very hot, so I let it sit for a minute before attempting to eat it.  I grab some Tapatio hot sauce, napkins, and so on, pick the burrito up, take a bite, and bam, the whole thing falls apart.  I don't mean the normal, oops the liquid built up at the bottom part and started leaking, I mean, the burrito just torn and rice/beans/pork just went all over the place.  Ok, no big deal, i'll just go up and ask if they can re-wrap it, i don't care if some insides are lost.  I go up, they just say no, and I kind of go, you can see I tried to take one bite, it wasn't user error of someone who just has no idea how to eat a burrito..\n\nSo I have to do what I HATE, and that's eat my burrito with a fork and knife, since there was absolutely no way of making this work.  I have to say, besides the burrito being hot, meh.  It's alright, not amazing.  \n\nIf I lived in the immediate area, i'd probably come back to give something else on a menu a chance, but, I don't.", "author": "Justin C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-05", "description": "If you are ever on Court St and craving some really good tacos, nachos or burritos. Come here. The portions are a good size and prices are really good. I had the catfish nachosand it was Amazing!!!  Come here you will not regret it!!", "author": "Lenore T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-25", "description": "This is the best Mexican food I've had in Brooklyn! Everything is so fresh and flavorful.  The meat is cooked to order and you can definitely taste the difference! The portions are huge and prices are so reasonable considering the quality and quantity of the food. Order at the counter but they have a good bit of seating.  If you're in the area you need to come here!", "author": "Alex I."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-02-23", "description": "I ordered a chicken burrito and they mixed up my order with someone else who ordered a steak burrito. However, I only found that out after I took of the burrito in which they told me was a chicken burrito. I went to the counter where they had the chicken burrito which was a part of my order and I told them the mistake. The person at the counter told me too bad and that the steak burrito was now mine as I took a bite out of it and he threw out the chicken burrito in front of me. Awful service and honestly the food wasn't great either.", "author": "Charlie S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-14", "description": "Nice, unassuming Mexican comfort refuge in Cobble Hill. As soon as I stepped in for a pre-movie burrito, I recognized it from years ago when I was here on a cold winter night. This time it was raining. Something about harsh weather drives people to Buddy's...\n\nIf you've only got a half hour for some filling grub, this place is perfect. Order up at the counter and your burrito (I got the Brooklyn one) will be ready in minutes. Grab a Corona or Pacifico for a few bucks more, and guac and chips to set the mood.\n\nThe burrito was good, definitely above average for New York, and generously portioned. I probably could have split one with my buddy and been fine. And the guac was decent too, though a bit too plain for my taste. Luckily, there was plenty of hot sauce on hand.", "author": "Yan T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-02", "description": "Best Mexican food that I've tried in nyc . Not fancy but cozy with great Mexican beers and hard work staff .  I would easily recommend", "author": "Shauan L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-01-11", "description": "Nothing particularly notable or great about the food other than it's a consistent and dependable takeout burrito spot.  Service can be really hit or miss - I recently ordered a standard Brooklyn for takeout like I have a million times before only to find that I got a tortilla filled with guacamole and onions and nothing else.  I would have thought it was a good joke if I wasn't starving.  Buyer beware, I guess.", "author": "Atlantic A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-24", "description": "Came here the other day. Only positive was the guacamole. Chips were very tough and thick, shrimp tacos were sweet with fishy/tough shrimp, and burrito was way too spicy. We didn't enjoy our food and threw most of it away. I would recommend not ordering shrimp or seafood from here. They put some really sweet sauce that tasted off.", "author": "Kelly G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-19", "description": "I stopped in here on a super cold Thursday around 4pm to grab an early dinner. I read a bunch of the positive reviews, so I had high hopes for some tasty food. \n\nI had to do some work on my computer so I got the wifi password, plugged in at the first table near the window and ordered what I think was called Buddy's Bowl. It was filled with rice, beans (I got mine without-because farts), lettuce, tomato, onion, sour cream and salsa. I also added some grilled steak to my order. \n\nTypically I would just stop at Chipotle when I'm in the area. I'm kinda secretly in love with them, but I wasn't in the mood for Ebola so I passed this time. Also, they're only a couple of blocks from one another so I deliberately came to Buddy's with the whole \"shop small, shop local\" idea in mind. \n\nSo as soon as my meal came, I dove in. The ingredients tasted fresh, but I was a little worried about the portion size. With all the reviews specifically dedicated to complimenting the large portions here, I was a bit surprised when I was almost done and not nearly close to being full. \n\nI decided to slow down my eating (which is not something I'm particularly good at since I'm a teacher and I often need to finish a meal in under 15 minutes). \n\nSo I finished my meal and sat there for another 30 min or so while I typed away, waiting for my stomach to tell me I was full. Sadly that wasn't the case. \n\nIn total I spent a little over an hour at Buddy's. Like others have said, there is no AC in the summer. Don't expect any heat in the winter either. I was in a full coat, scarf and gloves while I ate here. \n\nIn conclusion, the food is good, but if you're like me, you may want to order something extra if you're getting a Buddy's Bowl. Also do takeout and eat somewhere else unless you want to pretend like you're outside.", "author": "Lori K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-14", "description": "The food is consistently delicious, ingredients are always fresh and service is efficient. Most of their meats are cooked on the grill right after ordering. My favorites are the beef and chicken bowls which come with beans, rice, cheese, pico de gallo and salad. The burritos are also good and seem to be more popular. Food taste pretty authentic and the fact they sell beer is a plus! It's a small casual spot that can get really hot during the summer but food never disappoints.", "author": "Rosie B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-18", "description": "Been coming here for years. Service is great, portions are huge, and food tastes amazing!!\nOne thing I love is that they cook the meat specifically for each order, instead of having already-cooked meat sitting there, and heating it up. Def a place where you get your money's worth!! :)", "author": "Diana F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-18", "description": "Really nice staff, food was phenomenal. Had the Brooklyn Burrito and it was perfect. I'm from New Jersey and working in the area. I will defiantly be back. They also have a liquor license. Will recommend to everyone!", "author": "Taylor N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-24", "description": "The burritos from here are massive!!!! And weigh more than my dog! The chicken \u0026 steak together are delicious! I love that they put cheese in the burritos, wish they delivered to Park Slope but they don't. All these years, and I've never had a complaint, burritos came be shared, no way one person can eat a whole one.", "author": "Casey R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-21", "description": "If you're in the mood for burritos and you're in the area you should eat here instead of chipotle. The price is great for the portions!! I'm a fan, I had the shrimp burrito and it was great. I do wish that the shrimp was not in a chipotle sauce, but I also didn't ask them if I could get it without- so maybe next time I'll do that. It was good customer service, also fast.", "author": "Antonina N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-04", "description": "Ok, so I read all the reviews before coming to this place and none of them do it justice.\n\nYES, IT IS HOT IN HERE. Nelly would be thrilled. There are fans spinning but no AC and during a NY heat wave that's kind of a bummer, but honestly, it doesn't take away from the amazingness of the steak burrito I just consumed.\n\nI watched the man behind the counter cook up my perfectly marinated steak. It's piping hot and juicy as hell. I ordered the Buddy's Gourmet Burrito with steak (8.44 including tax) which comes with medium spicy steak, guacamole, cheese, and salsa. There were huge tomatoes and chunks of onions in the burrito, it tasted fresh and delicious.\n\nSo please give this place a shot. Seriously, do it for the steak.", "author": "Maria W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-22", "description": "You would have to almost pay me to give something 5 stars -  unless you're on Buddy's burrito level. \n\nWhere to even start, EVERYTHING IS GOOD. Their burritos are round 8 bux and taste slammmmmin! Tried their tostadas, salad, and you just Can't go wrong. My usual order is the El Grande . It is seriously huge, for size comparison just put it next to a brick, it'll probably weigh just as much. I get it with shrimp and steak with pinto beans. Enjoy and be prepared to go to war with it!\n\nThe staff are great and quick. the food is fresh \u0026 servings are generous. Place isn't all pristine and shiny, but pretty spacious (imagine a pizza shop but serves  Mexican food instead). \n\n Bravo Buddy's!", "author": "Kabir A."}], "servesCuisine": "Mexican", "priceRange": "Under $10", "name": "Buddy’s Burrito \u0026 Taco Bar", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "260 Court St", "postalCode": "11231", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/8OYfpcGtKqkWJxA4nCCSlg/ls.jpg", "@type": "Restaurant", "telephone": "+17184888695"}