{"aggregateRating": {"reviewCount": 155, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-14", "description": "Buddy's Burrito is definitely the place to go if you want a satisfying Mexican food experience. I always order the Brooklyn Burrito with beef and black beans. The meat is made to order which is what makes their burrito so flavorful. I am never left disappointed after going to this place. I can also say after going here I am very hesitant to go to Chipotle, it definitely makes you realize how generic their food is.", "author": "Jordan S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-08-28", "description": "I have been coming  here for years. I order a nacho platter almost Everytime. Recently it has not been what i remembered . It used to be packed with all those very tasty sides. Poco de gallo sour cream cheese beans guac chips and steak! But now it's a sad platter some days the food is badly spicy. And the platter itself is made cheaply with very little poco de gallo or sour cream sometimes very little steak and chips . It's sad I really love this place. It was great! And the people who are there making the food have been for years. They have been loyal employees. It's sad to see what management has become ( there is no achievement latter in this place)  . I hope they are being paid accordingly . They work very hard and sometimes being inside that store is unbearable ! It's a Mexican restaurant but it shouldn't feel like I'm in a Mexican desert. The owners are not Mexican so I wonder if there the ones who are telling them to add less ingredients. Idk but this place has changed . Also the meat is not put in the fridge it is on the counter sitting in a marinade. I only mention this because something's the store gets extremely hot so that could only mean a recipe for disaster. Again not the employees fault. But management. Such a shame. They make very very good business here on any givin day.", "author": "Harold A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-27", "description": "We visited the place Sunday evening. Just a random pick, I wished we would try out something new, a different place. I had a chicken quesadilla, he ate a steak burrito. The cashier was friendly and fast. Our food came fast too! It was delicious and huge. It was so good, my friend decided to visit it again and order a quesadilla! So, we will be back!:)", "author": "Mint R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-02-11", "description": "This is a place I get take out from quite a bit.  The food is solid and is the best burrito available in the neighborhood.  Being a burrito adict I've had better but this one is decent and delivers.  Their Guac isn't bad either.  I can't speak for much else here.  I've eaten in the shop a few times adn was not impressed with its cleanliness which is something I try to forget when I'm ordering delivery.", "author": "David N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-08", "description": "Not a place for hipsters. Good food, mostly for delivery. Not a place to hang out just good mexican food. Fresh and quick. Cheap beer.", "author": "anita r."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-10-06", "description": "oh i loves it. southwestern salad with carne asada + fish tacos are my staples here. their jalapenos are the REAL DEAL, not freakishly spicy, almost pickle-like. and you can eat them in unlimited quantities!!! \n\n...but for the sake of your stomach lining, i wouldn't.", "author": "Sarah J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-06", "description": "since moving from cobble hill, i have yet to find a quesadilla i like more than buddie's.   the steak is very nice, but the pork is my favorite, sandwiched with guacamole and cheese in a nice big tortilla and grilled until warm and melty.  simple, delicious--just the way comfort food should be.", "author": "Erica D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2007-10-21", "description": "Tacky, tawdry Mexican fare, I've been three times somehow and this place has always managed to disappoint me afresh. Maybe it's just my own preference for a little flavour, spice and character in my burritos, but this place is far too much a college haunt in its culinary arrested development.", "author": "Jeff M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-21", "description": "I love Buddy's! Their food is always fresh to the core, the portions are decent, the staff is prompt with orders and it has a laid back vibe inside.", "author": "Jamie B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-02-22", "description": "Came here in the middle of the day on a Sunday to grab a quick bite and was not disappointed.  While the steak in my burrito was overcooked a bit , it didn't bother me much.  The overall taste of the burrito was definitely good enough to have me come back again and again.  There was something dirty about the food and the place but in a good way that made me feel like I am eating something authentic.  The horchata tasted like soap, so I would skip that next time.", "author": "Anna K."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2008-03-03", "description": "if you need to get evacuated asap and might be having trouble doing so for whatever reason, buddy's is your spot. \n\nseriously: post-feast brown-town.  \n\n... perhaps only second worst to the burrito king on hyperion in LA. wow, just thinking about that place makes my stomach hurt.", "author": "dan f."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2006-11-21", "description": "The first time at Buddy's I ordered the big burrito and it barely had any meat (carne asad) although it cost $9; the nachos were excellent though!.  The second time, I ordered the Brooklyn Burrito and had to pay $1.50 for extra meat (carne asada), but I can't imagine why this amount of meat is not included without paying extra!  The nachos the second time were excellent again!  Moral of the story:  Order the nachos, or something other than the carne asada burrito.  Pros:  They cook the meat as you order it.  Definitely fresh!  Cons: Not enough meat in burritos and they charge almost $3 for chips.", "author": "Laurian C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-05-05", "description": "This food here is really good! It's nothing fancy, but it is delicious. Inexpensive and delicious, I might add. Definitely good bang for your buck, and their chips and salsa are amazing! A great place to eat.", "author": "ashley r."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2008-08-01", "description": "The worst fish taco ever!  I've been on a big fish taco kick and thought I'd give Buddy's a chance since it's in my neighborhood but I never go to it.  Big mistake.  How does a clumpy piece of fried fish that tastes like it came from a frozen pack of Ms. Paul's qualify for a fish taco?  And I couldn't even bear to eat the sloppy regurgitated-looking vegetarian taco I ordered.  I will definitely stick to California Taqueria on Court and Bergen -- just four blocks from Buddy's but light years ahead in terms of taste and quality.", "author": "Tracy H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2007-10-14", "description": "this place is NOT the greatest. if you want good cali style taqueria mexican, go to la taqueria or rachel's (same owners) in park slope.\nbut i don't live in park slope anymore, so buddy's is where i get my nachos.\ni have never eaten anything else there, but i've seen burritos and tacos which look totally \"eh\".\nbut the nachos are good. get those.", "author": "jessica l."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-11-14", "description": "I don't mess around with Mexican food. I'm from California, I know a good burrito. NY has forced me to lower my standards and just accept that they just don't get it here, however I wasn't totally grossed out with my burrito. I just got the veggie burrito and for $7 and it did the job. I was hung over and just wanted something with substance. There wasn't much flavor but it wasn't terrible. Ya the guac was more of a paste but what can you do? I don't think I would attempt any of the meat but thats just me. If you want a fast food burrito its fine.", "author": "Jenn S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-09", "description": "The nachos here are really good! That with the southwestern salad are my faves!", "author": "Lily A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-07-07", "description": "The \"Buddy's Basic Bean and Cheese Burrito\" is fantastic! They are fat in size and the price for them is excellent. When I want burritos this is the place I go to.", "author": "Jonathan P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-29", "description": "ohm. ohm. ohmmmmmmmmmmmmmmmmmmmmm....with jalapenos in a cuppppppppppppppp", "author": "Davina L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-04-28", "description": "The burritos are perfection here.  We get the gourmet burrito with carne asada, and it gets cooked right in front of our eyes!  Everything here is fresh, from the steak to the chips.  Probably the best burrito I've ever had.  Last time, we got the fish taco and it was divine.  It's quick, affordable, and delightful.  I highly recommend Buddy's and can't wait to go back!", "author": "christine y."}], "servesCuisine": "Mexican", "priceRange": "Under $10", "name": "Buddy’s Burrito \u0026 Taco Bar", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "260 Court St", "postalCode": "11231", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/8OYfpcGtKqkWJxA4nCCSlg/ls.jpg", "@type": "Restaurant", "telephone": "+17184888695"}