{"aggregateRating": {"reviewCount": 155, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-07", "description": "Although it doesn't look like much, everything is fresh and high quality (and cheap). It's also easy to be healthy here without skimping on taste. I came right before close and everything looked/tasted as if it had just been made. Cheap and delicious, Buddy's is my new go-to.", "author": "Emory S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-21", "description": "Gourmet burrito with seasoned grilled chicken, cheese, avocado, salsa Verdi and no rice. It has more flavor than chipotle. The small businesses usually taste better but are overlooked", "author": "Kayisha T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-21", "description": "Great neighborhood taco/Mexican. It's been here forever and always fresh and consistent. Friendly staff and great local fare...", "author": "Mary E."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-02-11", "description": "Solid spot for a big-ass burrito. I can't complain because i got the vegetarian burrito and the baby was STACKED! The inside of Buddy's is nothing to get excited over, it kind of smelled bad and it looked like a mess hall. You can sit and eat if you wish, there is enough space. \n\n$7.78 after tax for the burrito, on par with other mexican spots. They had a few different types of Mexican beers and Mexican soda too that i did not try. Menus were not placed in the front too well, some things were on the wall the others were on a paper taped to the counter,\n\nThe guy who made my burrito was suspect but he did a good job, and made it fast too. The guacamole isn't homemade it's definitely from a container that sits in their fridge but it was passable. \n\nDon't expect the world, it's not as good as Chipotle either but i think you will enjoy. I would compare it to a larger version of a Chinese food/tex mex spot you would see in other areas.", "author": "Louis P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-07-04", "description": "Food is delicious , but the owner is racist. Only says hello to white people. I asked for 2 orders of fish tacos he tells me so 4 tacos. Yes I know what I'm ordering. Rude tone to minorities I observed this wile eating. He should never be there. The guac and steak are the best", "author": "Mo W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-11-26", "description": "Just ate at the restaurant had a cockroach inside my black bean burrito owner told me I was rude for pointing this out in front of customers he was really nasty and did not refund my money and told me to get out. This is the place in caroll garden 260 Court St, Brooklyn NY 11231", "author": "Brian G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-16", "description": "I ate here for the first time yesterday..yum yum yum...best taco in nyc....I have to go back to try the rest of the menu...", "author": "Melissa W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-12", "description": "The food is always fresh. Huge portions and low prices. The people who work there can work on their english a bit. But that can be overlooked due to high food quality", "author": "Salim K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-19", "description": "Buddy recognize me. They should since I go there every other day.\n\nLiterally steps away from me, it is my go to place when I want something decently healthy and affordable. And fast.\n\nI'd tried pretty much the whole menu, but I keep going back to the super veggie burrito, $7.89, (and am I the only one that feels so foolish when saying super veggie......?) which consist of lettuce, rice, two types of beans, guacamole, sour cream, salsa and maybe something else that I don't really care to differentiate. Burritos are meant to be mixed anyways.\n\nThe fish tacos are pretty good too, but gets too oily and too rich/fatty feel if you have more than two in a month. \n\nStaff is friendly, if a bit shy. Not very talkative. I've never actually ate in here before, but there's plenty of seating. A bit dark no matter what hour is it, makes it a little grimy-like, but nothing too off putting.", "author": "Vicky C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-03-19", "description": "I came here last Sunday in order to eat something and kill some time while waiting to pick up my pet. My Fiance and I sat and ordered. From the outside,  I expected a larger interior, but it was smaller than I expected. We sat down in the rear, which was actually cold. I ordered the steak platter with black beans and rice and my fiance had the chicken burrito.  I have been to a lot of Mexican Restaurants, so FLAVOR is a big thing for me. I read all of these review prior to coming here so I expected to be wow'd to some extent . But I wasn't. I ate my steak platter which was actually ok, the black beans lacked something for me, they didn't have the seasoning that some places have, but it was OK. The steak was lightly seasoned which was good because it doesn't over power your palate. The rice was actually my favorite thing on the plate, it had some nice spice to it. The pico de gallo didnt live up to my expectations though, too light on the taste buds for my taste. Barely any lime or cilantro could be tasted.\n\nThe chicken burrito is where the failure was found. The chicken was EXTREMELY bland, no flavor whatsoever, the only reason you knew you were eating chicken was because of its texture, if not for that, you really didn't know if you were chewing just a big bean or something else lol. The burrito wasn't tightly packed and so everything spilled on to the plate. The chicken looked actually pale, if that is even believable. You could tell by the lack of color on the chicken pieces that it was not seasoned, hence the reason for the bland taste. Sadly, my Fiance could not finish even half of the burrito because the taste was not there. I am sure that every one here has a different experience, and some will disagree with me, and that's ok. I definitely prefer LOBO or even Calexico over this place. \nAlso, this isnt so much of a restaurant, its more like a taco shop to say the least because they didnt reallty have many mexican platters.", "author": "Ivan T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-15", "description": "For the price and quality, this place can't be beat!  Everything is delicious and fresh - I highly recommend the nachos and Brooklyn Burrito.  Awesome take out!", "author": "K M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-03", "description": "Gluten free tacos (because they are using soft corn tortillas) with carne asada for less than $3.00 bucks? Cant beat that!\nYummyyyy!!!", "author": "Sabina M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-10-20", "description": "This is definitely a no frills shop and it doesn't pretend to be otherwise. My vegetarian burrito came quick and it was the size of my head. The line quickly picked up after I put in my order. \n\nReasonable priced for what I think is standard mexican food. If I'm in the neighbourhood and my stomach is grumbling, I'd be back at Buddy's.", "author": "Pam H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-24", "description": "So this is a takeaway burrito/Mexican place. It's obviously lacking in fancy decor. But this place is a serious hole in the wall treasure. First and foremost, my boyfriend and I can share an entree for like $9 and be stuffed. The price is right. The thing that I simply love though is that all of the grilled meat (like the chicken and pork) is grilled to order. It hasn't been sitting around in the container behind the glass. It's warm, crispy and flavorful. That's a game changer. You don't get that at Chipotle.\n\nSimply love this spot for Mexican takeaway!", "author": "Amanda H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-24", "description": "My favorite Mexican joint in New York.  Steak quesadilla and steak taco make everything alright in the world. Comes with sour cream and guac. Don't forget the green sauce! The perfect no fuss cantina spot (plastic chairs and stuff). Would choose this over any upscale place.", "author": "Alex M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-03-13", "description": "When I ordered 2 tacos and a water, I was surprised that the bill was around $8.  It seemed a bit high.\n\nBut then I told the cook I didn't want tortillas, as I'm on a low carb diet.  As such, he delivered a big plate of carne asada and carnitas with greens, which was a decent amount of food for the price.  The meats were nice, though I'm not sure if this taco salad is typically offered.\n\nI didn't venture into the beans, guac and other things that can distinguish eateries, so it might gain a star on future visits.", "author": "Jonathan E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-12-23", "description": "HOLY GUACAMOLE! Probably some of the best guac I've had in a longggg time.  I've ben there 2xs now and it was consistent.  Its like $6 for guac and chips but don't be discouraged.  The guac is a pretty large portion and it has tomatoes mixed in.  Probably about a solid cup of guac.  \nThey also have some beer - corona and some others that are reasonably priced.\nWhen I say they marinate in some magical sauce I am not joking.  I don't eat meat and I eat a lot of seafood. Sometimes in places like this the seafood is too 'fishy'.  OMG I had shrimp quesadillas. Not only was the shrimp marinated in some magical sauce there was more guac in the quesadillas.  The thing was huge and I could only eat half.", "author": "Brittany S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-22", "description": "This place is awesome! I grew up in NY for a long time without knowing this place until 2010 after I had went to college and moved to Philly. The owners are friendly and nice and my favorite burrito is the Brooklyn Burrito with steak and shrimp - salsa. ;) Make sure you put lots of habanero and Tapatio on those babies!", "author": "Blaize B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-11-10", "description": "Wow people are pretty harsh. Since when is \"burritos are gigantic\" a bad thing? \n\nThe burritos in this place are GIGANTIC. And they make for a darn good $7 lunch.", "author": "Lana V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-03", "description": "Good Mexican food large servings good prices very fast = satisfied belly... Def coming back", "author": "Jorge V."}], "servesCuisine": "Mexican", "priceRange": "Under $10", "name": "Buddy’s Burrito \u0026 Taco Bar", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "260 Court St", "postalCode": "11231", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/8OYfpcGtKqkWJxA4nCCSlg/ls.jpg", "@type": "Restaurant", "telephone": "+17184888695"}