{"aggregateRating": {"reviewCount": 120, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-27", "description": "An amazing dinner ! All of the entrees are balanced, temperatures and textures perfected and the flavors are savory ! We hope they offer a new season menu soon with sun peaking through here in Brooklyn. Thank you Osprey and special thanks to Tyler Clark for going above and beyond !", "author": "Patricia K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-28", "description": "Nice location at dumbo. Restaurant is beautiful. We only ordered fries and latte. I think no one can fail the fries. The three stars is for the poor service. I assume they just open... the waiter don't know what they are doing. It wasn't a busy time, but we waited for a long time to order food and later we waited for another 20 minutes for the check while the waiters were chatting without doing anything... they need more training for the staffs. But cute restaurant tho.", "author": "Maggie L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-21", "description": "The Osprey is decorated beautifully with a very garden feel. There is a small menu, that's a little on the pricier side given the taste. But the proximity to the Brooklyn Bridge Park views and great environment help make up for this. I had a pretty okay burger, and my friend thought the fish n chips were subpar. However, we both loved the fries. The employees were all very friendly and helpful, as well!", "author": "Christy H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-08", "description": "Had a pleasant brunch to along with the great view inside 1 Hotel. We ordered the chicken and waffles, whitefish pate and fontina thyme biscuits. The chicken waffles had a Asian fusion spin and pleasantly surprised how moist the chicken was. The white fish pate is just a personal favorite of mine and it was creamy and delicious. Needs more toast on the side. The biscuits were delicious and the Jane on the side was unnecessary. The Jam was Too sweet and runny. Overall, enjoyed the brunch selection and just love being inside the 1 hotel's incredible designed hotel.", "author": "G P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-28", "description": "The Hotel 1 is such a gorgeous space first thing to say. The restaurant was very welcoming and the food was great. I had the cauliflower vegan dish and the Branzino Fish dish I asked them to take off the shrimp because I didn't want it and they did It was delicious. I felt healthy and good after eating here I didn't feel like a fat beast. I ate at the bar with my friend and the bartenders were friendly and good conversation the staff is with it and normal that work here. The warm olives were good and they have tons of different types of Tequila here. I love good food and great drinks and this place delivered. The hotel is Dog friendly and super cute! They serve hot apple cider and fresh apples in the lobby you can't beat that !", "author": "Karmela L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-09-29", "description": "We got a reservation about an hour before we went... so that was good.  However, it took FOREVER for the food and the food was just decent at best. I was expecting a lot more. Then the waitress took forever with our check, and forever to pick up our credit card after we left it for her. It was our anniversary and I was hoping for better.", "author": "Lisa R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-15", "description": "What a lovely restaurant!\n\nI took visitors from Paris here, trying hard to find a place that had an impressive view AND fantastic food to keep up with those high French standards. The day we had a dinner reservation was one of the first nice Saturdays the city's had this year, so it was insane. We arrived to our reservation super late (like, 45 minutes because MTA), and, while the staff had EVERY reason to nope out on seating us, they were so incredibly accommodating and collected - despite the surge in customers - it really made the entire experience so worth it. The food was delicious, the dining room, view of downtown Manhattan, and ambience fabulous, and whoever hired the staff and the staff themselves really deserve the five stars here. I'm really looking forward to this being my go-to when hosting tourists and for my own beautiful evening out.", "author": "Ms. A K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-24", "description": "This place is awesome, went there today for the first time with my husband and will definitely be back again. Malcom, the bartender was amazingly professional and had a super nice personality. I had a delicious beet salad and my husband had the avocado toast with smoked salmon. Very nice atmosphere, inside and out, we decided to eat at the bar because it was a full house. They had so many great things to choose from and watching the food get brought out by the servers and pass us by made deciding what to get quite difficult. Everyone that works there seems very nice and happy with their jobs, it was refreshing for sure.", "author": "Laurie M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-31", "description": "This amazing restaurant is under the culinary wing of Chef Ivy.  Perfect for a date if you're looking to impress a new suitor.  The atmosphere is stunning and the staff is beyond warm and welcoming.  The lighting alone is a work of art and the food is divine.", "author": "Jessica M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-24", "description": "The ambience is amazing and most people get attracted to this place because of the view. The rooftop is lively and a great place to chill. But honestly we weren't happy with the restaurant food. It was a saturday night and we sat outside as the weather was great. But we had to wait for 2 hours to get our main course. How crazy is that?!! The waiter was really polite and was apologizing to us and the couple on the next table for the delay but we have no idea why the food took so much time. And it wasn't even worth the wait. The meat wasn't cooked well and we ended up having a bite and leaving. So if you want to enjoy some great view with music then you should go to the rooftop. The food here is not upto the mark.", "author": "Aiswarya S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-01-26", "description": "Let's start off by saying the location and ambience of the osprey is beautiful. I'm sure it's gorgeous in the summer time. Now, moving on. We got there and the wait staff seemed very nice and attentive ( we were still waiting for more people to join us). They came by to ask if we wanted drinks for starters. We ordered our drinks which was coffee, a cappuccino and 2 alcoholic drinks. The coffee which was literally right next to us took forever to be served. I literally got my cappuccino before my husband and my brother in law who wanted regular black coffee. I then had to ask for sugar. I personally feel that sugar should be automatic when serving coffee. Finally the rest of the party arrives and we start ordering food. Everyone's food came out except for one order, the steak and eggs. We had placed 3 orders of steak and eggs and only two came out. The wait staffed looked confused.  Oh and I must add that we had like 3 different waiters, why? That just causes confusion. Hence, the reason why they all looked confused lol, But anyway, we ended up eating with out the other person having their meal as it was taking too long. So their excuse was \"we over cooked the steak\".  Ok fine but why was it taking so long to come out now. Anyway, it was so annoying that we had to keep asking for coffee or a drink more than once. Sir, where's my coffee?! Lastly, the manager came to apologize for the late/missed meal and gave a comp on the alcoholic beverage. I honestly hoped that he would have comped the meal... an establishment like that come on dude! But yeah, would I go again? probably not. Maybe for a drink because it was delish. Oh I forgot the food was mediocre. I've had better brunch at a diner.", "author": "Gissela C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-27", "description": "For a new restaurant - I must say the food and service were amazing. The servers were extremely attentive and the food was to die for. Definitely making another trip soon!", "author": "Tajha G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-02", "description": "Had a fantastic NYE dinner at the Osprey with some friends. Our server, Paul, was stellar and the food was fantastic. \n\nChef of the Osprey is a Locanda Verde veteran and it shows. My favorite parts of the meal were the steak tartare and the duck but every dish was amazing. Other highlights: chilled seafood salad, scallops, beef duo, oysters, Camembert toast. \n\nAlso check out the roof for an awesome view of the river/Manhattan.", "author": "Sarah B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-22", "description": "Amazing view, great food and good service. \nFrench in holiday we were really well served by Sara whose French is much better than our English. Amis Francais, vous pouvez y aller les yeux fermés ! Enfin pas trop quand même la vue est à couper le souffle.", "author": "Benoît M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-20", "description": "Incredible service and food. I am vegan and gf. They don't have many options on the menu but we're willing to accommodate and make things off the menu like a lettuce wrapped veg burger and a side of beets. Highly recommend it.", "author": "Ariana R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-24", "description": "I was nervous to make a reservation here due to the mixed reviews but was really eager to check out the beautiful space and views.\n\nOut of the hit and miss experiences which it seems that people have had here, our experience was a hit. It was my parents' anniversary and I arranged with the hosts and servers to have a bottle of champagne ready and they added a handwritten card for my parents and some treats at the end of the meal - I really appreciated the little personal touch!\n\nThe food was tasty (although a little overpriced in comparison to other restaurants in the area), service was friendly and fast, and the space is stunning. Finally at the end of the night, your receipt from the restaurant allows you to go up the roof without paying cover to enjoy a drink with one of the most stunning rooftop bar views in NYC.", "author": "Anton W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-11", "description": "Lovely restaurant with a nice view of the Brooklyn bridge and waterfront. The restaurant inside the 1 Hotel and it's an interesting hotel to visit. The staff are friendly and food was very good. Had a brunch on a Sunday morning and no wait for seating. However it took about 20 minutes to get our food. Other than that all is fine. I will come back.", "author": "Tak C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-11", "description": "Really slow service - extremely slow. But the steak was amazing and the lemon shrimp appetizer was the best. Outdoor seating made the night. Avoid the chicken - not well seasoned.", "author": "Reid B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-13", "description": "Hard to describe how good the food is. We read about their slow roaster on Eater, so we tried their 2 dishes that come out of it - the rotisserie chicken and prime rib. My god - we were completely blown away. We both agreed that these were the two top dishes we had all year. The texture of the prime rib is perfect, unbelievably tasty. The chicken is in a wonderfully complemented vegetable stew. Even the squash we had on the side was exceptional - makes us want to try the entire menu. Great atmosphere - all glass windows with views across the east river to lower Manhattan. Service is excellent. We will definitely be back - and often!", "author": "John B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-10-07", "description": "The place is a rip off... bought an orange juice (which was ok), a tartine and a chicken salad sandwich for 32usd. The tartine was a slice of bread with cheese and a little bit of cold tomato sauce. The sandwich was so small and was so cold that i could not believe that was it... Apart from that, they took 30mins to deliver those 2 food items to the table. Do not go there.", "author": "Lucas V."}], "servesCuisine": "American (New)", "priceRange": "$11-30", "name": "The Osprey", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "60 Furman St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/zLDflVKECvYd7pWXvLi_6g/ls.jpg", "@type": "Restaurant", "telephone": "+19294140012"}