{"aggregateRating": {"reviewCount": 120, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-26", "description": "Great location, beautiful setting, with very good food (better than expected, but not necessarily memorable). We had ricotta and the duck for starters and both were very tasty. The scallops were very fresh, and nicely cooked. The strawberry shortcake was meh - basically just whipped cream and strawberries and almost no cake. HOWEVER, they have to fix the bathroom situation. You have to use the bathroom open to the public and it's disgusting. To be at a fancy meal and then use a bathroom that smells gross, where the toilet seats are way to gross to sit on and where my husband literally almost had his shoe sucked off from the muck on the ground- that is enough to keep me from bringing more visitors to this restaurant (every person in our party came back disgusted). We mentioned it to the host, and they said it was the hotel's responsibility.", "author": "Janna G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-04-28", "description": "We were seated at 1:40 pm and were waiting over ONE hour and TWENTY minutes for our food... this is a table for two with a baby. I am vegetarian and requested NO MEAT(I watched the waiter write it down) and when my simple egg sandwich arrived it had bacon in it, so back it goes to the kitchen and I have to wait another 20min ... while my wife ate by herself. When I finally got my sandwich I was frustrated and had lost my appetite AND I could taste bacon(not sure if they removed it or make the eggs in the same pan)... I just gave up and got the check.\nThey did comp the sandwich and apologized for the wait but not good enough. I understand that you are busy but you can not make people wait that long. Terrible experience and ruined my afternoon.", "author": "James M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-05-21", "description": "So disappointing.  Atmosphere is beautiful. Service was all over the place but all would be forgiven if the food wasn't terrible.  Came here for a special occasion - and while I normally have a sense of humor the prices are nothing the laugh about.  As we sat there waiting for our lukewarm food we could hear the chef yelling out commands to kitchen staff even though we were seated in the front of the restaurant.  Food was nearly inedible - bread was stale, mussels were watery, cauliflower came out cold, and risotto was terrible.  We wanted to love this place so much.  To top everything off the cookies served at the end were also stale.  Superficial stuff on point - don't eat the food.", "author": "Alexa P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-04", "description": "My husband and I were guest at 1 Hotel for a couple of nights. On the morning of check out, we had a 9am reservation for brunch. Before the hostess sat us, she told us we only had an hour because they have to accommodate another reservation at 10am. Was every guest told that before they were seated? We had reservation just like everyone else. Very unprofessional on their part and trust me--I will be more than happy to stay at the hotel again but never go to back to The Osprey. Similar thing happened the previous night. Hostess told us we can not be seated in the main dining room, but go outside and ask the outside hostess if they can accommodate us for dinner. I don't know what type of training your staff has--apparently it is lacking based on other reviews. I would not recommend this place to anyone.", "author": "Sal V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-19", "description": "The restaurant was lovely. Location and design impressive. We struggled to find a nice restaurant in Manhattan that was open for lunch so this was perfect, albeit flawed. It felt empty, maybe because it was new, or just a dreary day? We had a 1:15pm rsvp and thought it would be bustling. Upon arrival, it was raining, so we tried to valet but no one was there to take the car. Ended up parking in the garage at the hotel. Like 30 bucks for lunch parking, but hey it's manhattan. No easy way to get from the garage to the hotel. Had to walk up the ramp and through the rain to get to the hotel. Very poor planning and design for a new hotel and restaurant of this caliber. Got to the restaurant, looked empty. Waited for the host a few minutes, nice guy. Waiter came right over and asked our water preference and took our drink order. Then asked if we were ready to order, no mention of specials or recommendations, no 'you just have to try the burger'. This seems to be the norm in Manhattan lately. Sad that I get a warmer welcome and more personal service at the Chick-fil-A in Greensboro. No introduction, no name, no what brings you here. Then it seemed like we got another waiter, then never saw him again and got another waiter. Everyone was nice enough but didn't feel that welcoming connection like you get at a place like the Wythe Hotel. But having owned my own restaurant I don't blame the staff. This is clearly a management issue, poor training and poor oversight. Don't even recall seeing anyone that looked like a manager on the floor. Food was solid, everything was good but nothing to write home about. No desserts at lunch? Really, can't even have a few slices of cake or ice cream? Seems like a big miss. Once food was served no one ever checked on us. Plates sat empty on the table for quite a while before they came and got them. Maybe there were 5 or 6 tables sat in the whole restaurant with a few folks at the bar. Staff seemed huddled by the bar or kitchen. I guess at the end of the day I was most impressed with the decor and location. I would certianly avoid rainy days. Food is good but nothing stood out. Fries were good but maybe a little parmesan. Like the French say its missing that certain 'je ne sais quoi'. Staff is nice but they make the place feel generic and lacking personality. Bigger smiles and a little engagement would have made a big difference. I'd give it another try when guests are in town, everyone has an off day but there is a lot of room for improvement.", "author": "Kevin C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-10", "description": "Have you ever been fortunate enough to experience one of those rarities in which your day intrinsically aligns and syncs with the utopian algorithm of Brooklyn? A friend and I stumbled upon a delightful outside garden terraced restaurant, The Osprey, which was the very first of the many splendors to come that day. We were greeted by an infectiously gravitational smile bestowed upon us by none other than a seamlessly brilliant and exquisitely dressed host Travis Gochnour that I later found out happened to be the general manager filling in for a hostess that had unexpectedly needed to leave that day. I was so impressed with Travis's versatility as he wore many costumes that day. From the careful way he guided my friend and I to our table to how he gently commanded all aspects of the restaurant's operation. Our server as well as the rest of the staff were diligent in inspiring us with absolutely SCRUMPTIOUS decisions on the menu that day. Our water glasses kept full throughout our entire meal, the staff was so kind and attentive, no doubt from the way the manager seemed to have lead by example and crafted a flawless crew.\nThe appetizers were far beyond anything I had ever had the privilege of tasting only to be followed by a simply satiating main course. I had the pork chop. It reminded me of how I'd eat over in Europe. The cuisine so clean and natural that if felt as though you could continually graze the day away and try absolutely everything on the menu, never feeling overly full or uncomfortable. \nThe atmosphere was so lush and vibrant. From the decor of the venue to the detailed positioning of its terrace sure to transport you to a magical backland ocean marsh where land meets the sea. Watching the countless tourists, joggers, families, outdoor enthusiasts, my eyes would blink creating a film of human wildlife that distanced me from my city life in a quite welcoming way.\nThe desserts were to die for. A blueberry sorbet and stracciatella gelato that was the perfect finale and send off for our afternoon. \nI will certainly be back and outrageously recommend to anyone that they take a load off their shoulders and stop in at Osprey.", "author": "Bryden M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-17", "description": "In love with The Osprey! Much better than any of the other new restaurants in the Dumbo area. \n\nThe food is so good! Healthy, fresh. Service is very friendly. Atmosphere is cool. Keep up the good work!\nMy favorites \n- Cauliflower appetizer \n- Mushroom appetizer \n- Risotto entree", "author": "Santiago M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-07", "description": "We enjoyed some great small plates here last night during sunset. The place is adorable with plants hanging all over. I love the setup. We LOVED the lobster appitizer, which was recommended by our amazing server, Adam. As well as the ricotta appitizer. I am planning to come back again for my upcoming birthday, and I would love if Adam would serve us again, we really enjoyed him!", "author": "Heidi S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-02", "description": "Amazing food, great service, cool atmosphere. Best views! The pancakes were to DIE and so was the french toast. The coffee was a little strong though.", "author": "Ashley T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-18", "description": "Beautiful restaurant in a beautiful hotel with a menu thats not overwhelming. The mussels and the steak were cooked perfectly and seasoned well. The drinks were a bit on the pricey side in my opinion but they didn't skimp on the quantity or the quality. Wait staff paid just enough attention and answered all our questions happily. I would definitely try Osprey again when the weather is warmer because they have a wonderful outdoor seating area with a fantastic view.", "author": "Amy C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-06", "description": "Horrible service. Walked in - hostess looked bored and they were all just chatting amongst one another. My husband and i waiting and no greeting. It was EMPTY and 530 pm. I've waited tables before, worked in hospitality and it was frustrating that nobody cared one ounce. We left ... too bad they think the sights overcome service. A joke and i wanted to like this place. I hope that does t happen to anyone else or if management reads this you will lose business quickly if you run things this way.", "author": "Kimberly G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-04", "description": "Dinner was impeccable.  For a new restaurant the service and staff were remarkably in top form. The food was as beautiful as the view, fresh and delicious. We had the steak tartare, 2 salads and the jumbo shrimp.The mushroom and butternut squash bruschetta was amazing. Entrees of steak, scallops and veggies sides (try the Brussels sprouts ) were really perfect.  Great subtle atmosphere with stunning views.", "author": "Trish G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-06-09", "description": "The only nice thing about this place is the layout and the decor. It's quite large, with nice outdoor seating. The food was mediocre. The fried chicken and waffles were very blank and coated with a tomato based sauce that was terrible. The burgers that we ordered medium came well done and the staff was not attentive and forgot half our order. Definitely not worth it.", "author": "Nathalie Z."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-04", "description": "Wow. Bad. Overpriced and just bad. Heatlamps and heavy salting are the order of the day here. If you are interested in amping up your daily sodium intake, that is your place. Also, if you like food that has been sitting around for awhile, you will love it. And if dessert is your thing, definitely get the strawberry shortcake for two. Nothing beats yesterday's desserts, repurposed into today's.", "author": "Stacie D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-23", "description": "I live in the area, and the first time I came to The Osprey it was weeks after their opening.  At that time I would have given this place 10 stars.  I was raving about that dining experience for months.  The food and the service were spectacular.  I found the perfect opportunity to go back over the weekend for my mom's birthday and it was a much different experience.\n\nWhen it comes to service, this was one of the most abysmal dining experiences I have ever had.  The waitress was inattentive, forgetful, and made mistake after mistake the whole meal.  I knew there was going to be a problem when we didn't receive water for 15 minutes.  The waitress didn't care to take of our drink order prior to us ordering (we had to order drinks and our food at the same time) so we were just sitting there with empty glasses for 20 minutes.  Once we did order drinks, it took anywhere between 10 - 25 minutes to receive them.  Their menu is broken into small plates, apps, entrees, etc.  I asked for the small plates to come first, then the apps, then the entrees. That didn't happen.  Small plates and apps came at the same time so we had an overflowing of food on our table.  We ordered drinks after our appetizers, those drinks did not come until I was 3/4 of the way through my entree (so i ate with no drink).  When my drink came and my partner's did not, the waitress told us she forgot which drink my partner ordered (this was 25 minutes after the drink was ordered).  Further on, no one asked us if our food was ok.  No one checked in during appetizers or entrees.  And despite all the mistakes and waiting, no one cared to apologize.\n\nI will say that the food continues to be delicious.  Everyone was raving about it.  We had everything from seafood to meat and it was all fantastic.  \n\nNeedless to say this was a huge disappointment compared to my last time here and it's all because of the service.  I want to come back here, I want to recommend this place to people but in order for me to do so, this place has to either get a new waitstaff in there or figure out a way to to do much much better.   I understand that DUMBO is becoming a huge tourist destination and oftentimes that means the service level drops, but remember there are plenty of people who live in the neighborhood that would make this their go to spot for years to come.  \n\nReally hoping they can get back on the right track...", "author": "Dan B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-13", "description": "Very cool space, great location and fantastic views. Lunch menu is extremely limited and not exciting at all. Due to lack of choices ended up with an egg sandwich. Very mediocre scrambled with bacon on a cheeseburger bun, but for $18! Hopefully the menu will expand in the future.", "author": "Steve P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-02-18", "description": "Delicious but portions were incredibly small for the price. I ordered the brunch entree steak hash, which really wasn't really hash, just an assortment of tiny potatoes with shredded beef . I got to try the pancakes which were fantastic, especially with the sassafras butter. The Osprey cocktail was good but again plagued by poor pour size. Bloody Mary was unflavorful with a dash of pepper and no horseradish. I'll give it another try as they are new and getting into the swing of things.", "author": "Matt F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-18", "description": "Wonderful restaurant with a beautiful view. Our server, Adam, was very helpful and attentive. I had the branzino, and he recommended a greek wine with a mineral-driven finish that paired wonderfully. My friend ordered an appletini, and he graciously suggested the house cocktail \"The Osprey\" as an alternative. It was an excellent recommendation, mildly sweet with a lot of fresh fruit flavors! Will definitely be dining here again, especially in the summer!", "author": "M B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-14", "description": "The food is great but the service is better. Manager Ariel meets us at the door and no detail is missed all night. Grated horseradish makes the steak tartare. Olives and crispy artichokes lift perfectly cooked branzino. Pork chop is juicy but the promised pickled peppers are missing, and the reason I ordered it; extremely tasty polenta makes up for it. The fries are the stuff of dreams. Hospitality enhances the whole experience. An exceptional meal - we will be back!", "author": "Bryan W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-06", "description": "Pretty much fell in love with this place the moment I walked in. (Maybe my obsession for birds had something to do with it.) But in all seriousness, the food was delicious and ambience was superb.  Cute little succulents on each table added the perfect touch. Came during a weekday for lunch and a cocktail. A little pricey, but I would definitely come back. I had the chicken salad sandwich along with a Bloody Mary which was extra spicy and extra amazing. The beet salad was also out of this world. And with the huge glass windows, you get a beautiful view of a park (not sure of the name) and the Brooklyn Bridge. Only downfall is the restroom situation. I've never been in a gender neutral bathroom - sharing the sink area with everyone; it lacked privacy. The issue is since the restaurant is located in a hotel, the restroom is on a different floor which is a little inconvenient. But it doesn't matter! Please bring The Osprey to NJ!", "author": "Danielle M."}], "servesCuisine": "American (New)", "priceRange": "$11-30", "name": "The Osprey", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "60 Furman St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/zLDflVKECvYd7pWXvLi_6g/ls.jpg", "@type": "Restaurant", "telephone": "+19294140012"}