{"aggregateRating": {"reviewCount": 120, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-09", "description": "Came here for Sunday brunch. It wasn't crowded but there was a little bit of a wait. The area is spacious and beautifully decorated with outdoor seating as well. Keep in mind there is a different hostess for outdoor seating.\n\nI ordered the Cauliflower dish. It was a perfect combination of light curry flavor with grape pieces for a hint of sweetness. I was pleasantly surprised by how fulfilling this healthy dish was.", "author": "Laurie C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-04", "description": "I was looking for a restaurant with a nice view and I found this amazing place .  Very fancy and the service was on top of everything . I dont remember the name of the guy but he ( I guess he was Indian) was so helpful about everything that we were asking him . The menu didn't have that much options ( American food burgers and stuff) but they made some pasta for me (even though it wasn't part of the menu )wich made me feel special  . I got the tequila sunrise cocktail and it was amaizing !! The prices were to high but thinking that was at Brooklyn bridge and all that fancy around yeah it's acceptable \nLoved the lunch in here .", "author": "Klisara P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-08", "description": "I had the absolute best time at The Osprey! The manager Sterling was amazing! He brought us up to the rooftop and truly showed us what New York is about.. the views and the drinks. The whole property is dog friendly and my dog loved seeing the views with us. This will be our summer spot. All of the staff was so friendly. Thanks for a great time!!", "author": "Alexis F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-04", "description": "Brunch here was so excellent! We got seated right away and ate a delicious salmon scramble and fried chicken and waffles. Both were unique, tasty and well balanced in terms of flavor. We decided to level up and get some drinks - the All Hands On Deck was so good. Tasted like a fresh summer morning. We ended with the most insane apple crisp with cinnamon ice cream. Will definitely be coming back to enjoy that outdoor patio!", "author": "Leila O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-10", "description": "Delicious food \u0026 drinks here.  We meet friends here on our first night in NYC and this place did not disappoint.  We sat outside, which was lovely and although it was a warm night, it was very pleased to.  I had lobster arinchinni which was the special and OMG it was delicious.  I paired it with some brocollini which was cooked well \u0026 was plentiful.  We all loved our meal \u0026 drinks. Our friends live not to far so I'm sure they'll be back \u0026 I'll be back next time I'm in town too!", "author": "Julia C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-10", "description": "I don't leave reviews unless I'm particularly astounded by something, and this place managed to earn one. Went here to get a simple pre-dinner drink at the bar \u0026 sit on the patio on a very empty \u0026 slow Tuesday evening. The bartender took nearly 10 minutes to even make eye contact \u0026 offer a menu, followed by several minutes of waiting to order as he proceeded to take orders from a couple men who walked right up to the bar \u0026 he gave immediate service to before us. \n\nWe walked out, as it was apparent it was a purposeful ignorance of us. Please work on your unnecessary level of pretentious attitude \u0026 frankly douchie vibes. No place is cool enough to act that disrespectful.", "author": "Kelly B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-07-03", "description": "I have tried so many times to enjoy something from the menu here, but I have been disappointed every time. I want to tell you that you can at least enjoy a salad or appetizer here, but no! I have nit found anything worth trying again. I love this hotel so I keep trying to find at least something I could enjoy for a meal or a snack. Unfortunately they fail me every time. The drinks and service are pretty good though. That's why they get a second star.", "author": "Travis C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-22", "description": "Between the amazing decor, service and food, this place is easily one of the top 2 restaurants in Dumbo!\nI literally love everything about this place. The duck croquettes are a slam dunk! I'm not a fan of croquettes but I really enjoyed the texture and taste of these. So we were a party of 5, so every one got a different entree. The BEST ENTREE hands down is the scallops with grits. Now...I HATE GRITS...but this dish has turned me into a believer. I probably will not eat anybody grits but this restaurant. This seriously will be my go to restaurant especially for the summer time. \nAll the waitstaff were super friendly and efficient. I didn't feel too rushed and I also didn't feel like I was waiting around even when it got really busy. I had the sangria which was delicious and quite strong which..YES.thank you for that\nOh...dessert. The strawberry shortcake was sooo memorable. Again, NOT a fan of shortcake but I would definitely get this EVERY time. Imagine cake with nice cold whip cream filled with fresh sweet ripe strawberries. \nLong story short, this place is a GEM.", "author": "Natasha P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-08-12", "description": "Overpriced, slow and underwhelming. I've been here twice, once for lunch and once for dinner, and both times were disappointing. \n\nBoth times I've come it's taken a long time to be seated even though we've had reservations. They clearly just wanted us to spend some money at the bar and sent us there for 15 minutes before seating us. \n\nEvery entree is over $25, which would be fine except nothing that they serve is that special. A lot of them items we got were bland and/or lukewarm. \n\nIt's a nice looking place so I get the draw, but there are better places in the neighborhood.", "author": "Katie S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-27", "description": "The service was so poor. We were practically ignored the whole night. We were offered bread and didn't get it until after our appetizer. We also got our drinks after the appetizer. Tables that were seated after us got their entrés before us!\nFurthermore, the selection is minimal for overpriced food. And if you're unlucky like us, it'll also come out cold. \nThe interior decoration is probably the only salvageable thing of our night.", "author": "Alejandra T."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-04-08", "description": "Well.  I love the 1 Hotel, service was great everywhere except their restaurant.  It was a stark and unfortunate contrast.  Breakfast on a Sunday, the menu was limited but sufficient.  Received my food well before my drinks, then the waiter never came back to check on me or bring me the needed sweetener for my cappuccino, so it sat and went cold.   20+ minutes without service interaction is unacceptable. \n\nAnother diner a few tables over finally stood up and left, declaring his dissatisfaction the entire way out. \n\nNice looking place, and a nice view, but that was it.  I think this place has great potential but needs new management to get it back in order.", "author": "Adam H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-17", "description": "Amazing food and ambiance. Didn't feel like we were in NYC! the bread pudding french toast is perfect--not too sweet at all and gorgeous. \n\nGet the chicken and waffle-most unique chicken and waffle I've tasted.", "author": "Ashlin A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-02", "description": "Really just the prettiest restaurant. Very romantic. The food was very good. We got the whitefish pate, baby beets, mussels, duck croquettes and seared scallops. The duck croquettes is really a MUST! The mussels were delicious. I personally love beets plain so I thought they made the beets were too vinegar-y. I didn't personally love the whitefish or the scallops. Isn't deterring me from coming back real soon!!", "author": "Cathy L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-30", "description": "This place, simply put: amazing ! Food is delicious, service is great. I went two times, brunch \u0026 dinner. Will definitely be coming back !", "author": "Omima F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-30", "description": "Beautiful space with great views. Food is also good. Try the egg white frittata wo the goat cheese.", "author": "Whitney W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-22", "description": "I came for the view, stayed for the brunch. \n\nI especially like to bring family members visiting the city here because it's overall such a great experience. The restaurant itself is stunningly beautiful. The plants and the high ceilings for an inviting, modern and luxurious space with a postcard perfect view of the Brooklyn Bridge.\n\n The food and service is excellent. The coffee is great. The eggs have always been cooked perfectly. Priced about what you would expect for what you get. There tends to be an interested array of eaters being that it's attached to the 1 hotel and that adds to the unique atmosphere of the restaurant. Unlike some restaurants, where the combination of crowds, rushed service, etc can make one a bit stressed, I've always left The Osprey happier and more relaxed when I came in.", "author": "Ben A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-26", "description": "I really wanted to love this place- mostly because the location is gorgeous and the service was really top notch. For real, they excel at service for sure. However, the food was just not worth the price ( it's pretty pricey for what you get). \n\nthe pork chop was extra fatty and the risotto tasted far too acidic ( really really lemony and sweet). It seems likes  the kitchen lacked a bit of finesse. Trim a bit of fat and hit that risotto with some fresh black pepper!! \n\nI wouldn't eat here again, but I'd def. come here for a drink... and as said, our server and the rest of the staff, including the busser were really personable and polite.", "author": "Jenny C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-01-02", "description": "The location for this restaurant is probably my favorite. There is no better place in NYC. The food here was just average and service was a notch below. Bartender had an attitude, our drinks during brunch took to long. Most likely stemming from the bartender..... great space, great decor, now if they hire the right people it could be a great spot.", "author": "Burim S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-06-10", "description": "Bread pudding French toast was good, but the bread was a bit too cakey for my taste. The lemon curd was quite tasty though; needed more of it to go with the bread, so I had some left over.", "author": "Amy Y."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-22", "description": "Good restaurant but very awkward mixed-sex bathroom. \n \nMen and women share the same toilet stalls and sink area. Thus, there is urine on the toilet seats from males. A sense of privacy and discretion is missing. It probably saved a few dollars. But it's just a failed idea masked as a progressive statement. \n\nMy duck was ok.", "author": "D R."}], "servesCuisine": "American (New)", "priceRange": "$11-30", "name": "The Osprey", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "60 Furman St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/zLDflVKECvYd7pWXvLi_6g/ls.jpg", "@type": "Restaurant", "telephone": "+19294140012"}