{"aggregateRating": {"reviewCount": 120, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-19", "description": "Love this new edition to our Brooklyn Waterfront. Nestled in the chic and cozy 1 Hotel, this casual candlelit restaurant has a priceless view of the skyline and an impressive menu of beautifully plated comfort foods. Husband and I were so torn but ultimately enjoyed the beet salad appetizer, then duck breast and grilled branzino filet for entrees. All of the dishes were so well prepared with bright, fresh flavors and hearty portions. We definitely plan to return to try the scallops, pork chop, prime rib, and Coney Island chowder.", "author": "Erica T."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-10", "description": "Horrible service. Walked up to the nearly empty bar to get pre-dinner drinks. Took forever for the bartender to even acknowledge our presence. We waited a looong time while he slowly made cocktails for the only other 2 people at the bar. Then he started taking orders for other people that had showed up much later than us. Extremely rude and disrespectful. We left and decided to go somewhere that actually wanted our business. Don't bother here.", "author": "Melissa S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-28", "description": "The worst place. Waited for 15 minutes for a table when the restaurant was empty. Took 45 minutes to get the appetizer and they spilled coffee all over us. Didn't even wait to get my food. Worst service, never going again", "author": "Carolyn C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-30", "description": "Loved having dinner last night 6/29/18 at The Osprey. The ricotta with honey and chili oil was delicious. The mussels were fresh with the spicy chorizo. The bread and butter was great. The service was also great. Overall it was a pleasant dinner.", "author": "Vivian J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-25", "description": "This place has very nice ambience and the staff are very helpful. Ashanti was very nice and was able to accommodate me and my friends many times when we had to change our seats. \n\nThe fried chicken and waffles are very good, and the pancakes are very hearty. I also tried the fish and chips, fish was very very tender. I would definitely come back here.", "author": "Christi C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-06", "description": "The Osprey is AMAZING! I went here this past weekend with some girlfriends and absolutely loved it. Everything was perfect - great views, great food, great drinks and great service. The branzino and artic char were to die for. They also had a fabulous wine list. Sterling and Adam were so attentive and took such great care of us. I am definitely going to be going back again with friends and family!", "author": "Katie C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-11", "description": "Fantastic choice after trip around Brooklyn, the dishes are perfect and staffs so welcoming and friendly. Outdoor is super!!", "author": "Sheem A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-18", "description": "Incredible. Drinks, food, atmosphere, waitress, timeliness. The entire experience was awesome. What an absolute treasure. We will be back for sure.", "author": "Andre A."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-05-05", "description": "TERRIBLE service!!!\nFirst could find my reservation, then waited to sit us for 20 minute, didn't give a menu, came to take the order in 20 minutes... ect.\nthe brunch was mediocre.", "author": "Luba P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-27", "description": "Underwhelming from hosts who gave us a table in the middle of high traffic area even though we made reservations days in advance to slow service, forgotten dishes and poor wine selection by glass (no rioja why?!). They seemed very understaffed. Food was not bad but tables are dark, it's hard to see what you are eating. There was an engagement party and they allowed a professional photographer take pictures with a flash for the entirety of our dinner in the glass dinning room, it was extremely annoying to everyone and yet the staff did not care. Will not return.", "author": "Mishkin L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-04-07", "description": "It is true this place has a unique location and the views are amazing (the brooklyn bridge) but somehow I did not like it. Maybe if this place was in Manhattan I would not have cared.  But being in brooklyn it reminded of the gentrification that has made brooklyn lose some of its charm.\n\nWhen I'm in brooklyn I enjoy the small cozy privately run restaurants with amazing food and a friendly personal touch. This place is not that. It's one of your generic corporate restaurants that serves ok food and has ridiculous prices for a glass wine ($24 for a glass of Cabernet?!).\n\nThe food while not bad, was not amazing, definitely not the price worth coming back for.\n\nWhile it make be an ok place for tourists to enjoy the view, I think as a New Yorker I will definitely not be back.", "author": "Angelina A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-05", "description": "Great food, lovely atmosphere, and the Osprey cocktail was amazing unique. They made our day special by wishing us a happy anniversary by leaving a handwritten card in our table. Thank you!", "author": "Atoosa M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-05-18", "description": "We had a reservation at 9 pm, didn't get seated until 10 pm. Had a drink at the bar where the bartender said he forgot an ingredient in the drink and had to remake it, after he charged us for the drink, and our food was lukewarm and average. They gave us champagne for the wait, which I don't drink.", "author": "Devin P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-06-03", "description": "Looks better than it tastes and the service is mediocre, especially for the price. We went for brunch. We had reservations and still had to wait at least 20 min. We sat at the bar and no one asked us if we wanted anything. The group next to us was trying to order food and ended up leaving because no one ever came over. The venue is gorgeous and everything is very instagramable though...", "author": "Andria E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-10", "description": "I'm not sure what some of these bad reviews are about, I've been 4 times and my mother and sister have been an additional 3 and everyone has always had a great experience. Food is excellent, great cocktails, service, and that view is unbelievable. My family is a big fan", "author": "Leah R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-06-21", "description": "We have had the worse experience in this place despite the lovely location and the setting. Service was terrible right from the start with waiter ( Jasmine) barely making it to the table. Next was on the wine menu where 4 if the rose wines were unavailable so we had to settle with a mediocre replacement. Last we had the worse risotto in the history of risottos. No flavor, no seasoning, cold and overall a bad choice. We had to send it back and thankfully we were not charged for it but nobody even bothered to apologize. Finally we were given the check and 20 min later nobody came by to process the payment. Overall left disappointed and will not go back. Management needs to seriously overhaul that operation.", "author": "Laura V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-21", "description": "Really enjoyed brunch at The Osprey. You'll find nice decor, professional staff and an egg sandwich with gruyere and perfectly cooked bacon on a brioche roll that will make your day.\n\nA word of warning- the prices are a bit high. A very small glass of pineapple juice is $4 and the mixed drinks on the brunch menu are $15 each. \n\nWorth a visit and a walk around the neighborhood for sure.", "author": "E C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-04-21", "description": "We got to the restaurant 15 minutes late after calling and telling them we were delayed due to traffic from the city. They said on the phone it was no problem but when we got there we were rudely told that the kitchen closed at 3pm! Why did they book a 2:45 reservation for a kitchen closing at 3pm.  Typical snobby attitude.", "author": "Lisa L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-09", "description": "Came here on a Saturday night  before proposing to my girlfriend. Told the hostess  about my upcoming proposal and she was very  accommodating and found us a seat with a great view by the window. The atmosphere is very nice with a beautiful view of the skyline and bridge.The food was excellent and the service was ok. I would definitely come back mayb in the summer for the nice outdoor seating area", "author": "Chris C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-13", "description": "Nice ambience but that's about it?? The food was good but nothing amazing. A bit over price but since it's hotel restaurant maybe that's acceptable. It was the service that came short really. We arrived about 30 min early. The hostess politely refused to sit us, saying she'd do that when it's close to my reservation time. There were lots of empty seats so i was like ???? But sure. When we returned close to our reservation time, there was a gentleman before us wishing to be seated earlier than the reservation time. She again politely refused. The man pointed out empty seats but she said they are reserved and the time is coming soon. Ok. Understandable. We were seated but the service was very slow. And if I'm not mistaken the mug in front of me had lipstick/lipmark on it. The waiter kept making small mistakes.", "author": "OkKyung L."}], "servesCuisine": "American (New)", "priceRange": "$11-30", "name": "The Osprey", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "60 Furman St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/zLDflVKECvYd7pWXvLi_6g/ls.jpg", "@type": "Restaurant", "telephone": "+19294140012"}