{"aggregateRating": {"reviewCount": 120, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-25", "description": "Good views of the bridge If sat by a window. Expensive but worth it. They nail the details. \n\nGet the...\n+ all hands on deck cocktail\n+ truffle fries", "author": "Jon S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-05-12", "description": "This is probably the worst service I have received in any restaurant in New York. Whenever I read reviews like this I tend to disregard them and think they are exaggerating, but I hardly ever write a review, and when I do is usually never bad. But I felt compelled to, because it was particularly bad, both the service AND the food.\n\nI had made a reservation to celebrate my birthday two weeks in advance. I asked for a table in the center, but they gave me a table by a wall. I asked them if they could change us to an empty table in the middle (that had just gotten emptied up) but they said they couldn't in a very condescending way, giving nonsense explanations. \nSo then the server tried to convince us to sit at another table with a better view, and treated me like a baby trying to explain to me why that table was better than a table in the middle.\n\nThey gave us the menu and left. For about 30 minutes and never came back. They didnt bring the drinks menu. We had to ask for it. We had to call her to get our order for drinks and appetizers. Our cocktails took 30 minutes to arrive. Then we had to call them again to order our main entrees. Let me stop for a second and go over the food:\n\nThe pasta was BLAND and TASTELESS. There was no such thing as spicy sausage in it. The squash was not properly cooked. The worst most tasteless pasta Ive had.\n\nThe branzino was nothing out of this world.\n\nThe charred brussel sprouts were so soggy. It's hard to mess up charred anything. Very disappointing.\n\nThey didnt give us honey in the cheese platter. I reminded her. She never brought it.\n\nThe only yumy thing was whitefish pate which I couldve bought at the supermarket.\n\nScallops were okay. \n\nOn top of all of this, not once did anyone stop to ask if everyfhing was okay. Not a single person poured more wine when needed. We had no idea how much wine was left in the bottle. \n\nIt was my birthday and the girl just gave us the dessert with the candles and walked away. The staff here is probably the rudest and most non efficient people I have met.", "author": "Laita C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-02-12", "description": "Been meaning to check out The Osprey since it opened since I work nearby, but never felt a need to splurge on my lunch break. But, as everyone knows, Restaurant Week is the perfect excuse to convince yourself that you're not actually spending that much money, and then realizing you're actually spending more than you thought after the fact.\n\nThe RW meal I crafted for myself was basically a cow before and after. My first course was the beef tartare, and my main was their cheeseburger.\n\nThe beef tartare was fine, but didn't really pop in terms of freshness or flavors. There was a ton of it though.\n\nThe burger was a double patty with melty cheddar and caramelized onions, and was delicious. Super messy, and with a giant basket of fries (which were also really good).\n\nI would come back for the burger.\n\nI also ordered a whiskey cocktail since I was sitting at the bar, but it took a while since they had to go to the stockroom multiple times for specific ingredients. It was good though, and the bartender was apologetic.\n\nIf you're in the area, staying at the 1 Hotel, or generally want a semi-fancy meal, The Osprey is a pretty solid bet.", "author": "Kenny C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-02-04", "description": "Such a beautiful location in Dumbo! I went here for a birthday brunch around 12pm. It wasn't packed, but had a decent crowd for a freezing Saturday morning. \n\nSomeone at the table let the waiter know it was my birthday, and he gave all five of us a round of free cocktails! That was SO nice, and they were all insanely delicious. For food, we all split the cauliflower and ordered individual entrees. I had the (pricey) seafood Cobb salad... and it was ok. For almost $30, I had higher up expectations for the freshness of the seafood and the other toppings. The corn on the salad was very, very gummy and over cooked. \n\nOverall, I'd definitely return for lunch/dinner for some amazing cocktails and to sample their more savory dishes.", "author": "Katey G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-05-17", "description": "Pros: Beautiful space; food was pretty good\nCons: Overpriced; they seem to treat families with kids like lepers\n\nWent here for brunch on a Saturday with our well-behaved two-year-old. The restaurant was about a quarter full, but they stuck us in a dark booth back by the kitchens. We asked a couple times if we could switch to one of the dozen or so empty tables nearer to the windows. They refused, telling us that they \"had a lot of reservations\" that day. (We were also there on a reservation.)\n\nWe looked around and realized we were in a sort of Child Ghetto -- 4 other families with kids were clustered back in the same row of booths. 90 minutes into the meal, the tables that the waitress had claimed were reserved were still empty. (I took a picture. It's ridiculous.)\n\nDespite the bad service, the food here is decent. I had chicken and waffles, and enjoyed it. It's an expensive brunch, even by NYC standards, but I suppose you're paying for the surroundings, which are in fact beautiful, so no complaints there. \n\nTLDR: This place is probably fine if you're in a group of all adults... but there are a lot of better options if you want to bring your kids somewhere.", "author": "Joseph M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-10", "description": "Love it! And can't wait to return.  I had the scallops and a glass of white wine - the scallops were cooked perfectly and was the exact portion size I needed.", "author": "Koli D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-01-26", "description": "Amazing location. Beautiful views. Mediocre food. Mediocre service.\n\nThe starters were great. We especially enjoyed the beet hummus and charcuterie platter.\n\nDessert is also yummy!\n\nBut...\n---shoe string fries, looked yummy but too salty\n--table bread is sliced sandwich bread vs baguette\n--i ordered a French Martini and the bartender had never heard of the drink; I offered to Google it for the waiter when he came back 20 min later without my drink to ask for more details about the drink\n--burger came out cold, had to send it back to heat up\n--sauce for muscles was unbareable; sent back and ordered something different which took so long I gave up and moved on to dessert\n\nMy advice: grab a drink and dessert at the bar. Don't eat there until they do something drastically different.\n\nI do hear brunch is pretty good but hard to trust.", "author": "Nancy G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-28", "description": "Had an excellent experience at the osprey. fantastic location , overlooking brooklyn bridge if you are sitting outdoors or by a window. found the service to be superb. my server was kind and efficient. went around 1pm lunch and had the seafood cobb. it was fantastic, with generous portions of crab meat and lobster claw along with the delicious lemon dressing. it has standard nyc pricing which some may consider to be a bit high but it is located in the very nice 1 hotel in dumbo and has fantastic views along with activities to do nearby.", "author": "Ash P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-05", "description": "While staying at the hotel we came here for breakfast, the restaurant is so beautiful, you feel like you're in a green house, and not in Brooklyn! Even when looking out the windows all you see if trees, it has a farm house feeling, the waiters \u0026 waitresses wear aprons. We were seated right away, and service was great, everyone was super polite, and kept on top of everything, making sugar orange juice, and coffee was always refilled. We had the usual, eggs, bacon, breakfast potatoes, and toast. Of course everything was organic, the eggs were basic eggs, the bacon was delicious \u0026 very thick, the potatoes were delicious, they had Parmesan cheese on them, toast was also good, just wish the butter wasn't so hard. We definitely had a nice relaxing breakfast before leaving. \n\nBetween two people, you will spend about $80", "author": "Casey R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-26", "description": "Great food, atmosphere and service! Nice view to the Brooklyn bridge park. Ordered the cauliflower salad and added steak and it was very tasty!", "author": "Hermínia M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-10-01", "description": "We were staying at the hotel and try to come for Breakfast and Dinner. Both times, the restaurant was 1/4 full and we were told there was a wait but Opentable had slots available on their site.\n\nOn the second day, we decided to eat breakfast. I ordered the avocado toast and country breakfast. The food was good but over priced (it's inside the hotel) and the service was very slow. It took 30mn to get our food. They forgot one of our drink orders and brought out the wrong food.\n\nOsprey is good if you're staying in the hotel and don't want to venture outside and if you're not in a rush.", "author": "Elena C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-28", "description": "Everything about my experience at The Osprey last Friday was absolutely perfect. We had a reservation and they had a table available but we didn't care for the location so we agreed to wait for another table. While we waited, we had a cocktail from the bar and the mixologist nailed my drink. I asked her to surprise me, she asked what I like and created something that I may have to return for (I have no idea what was in it.) We then headed to our table and the young lady (her name started with a M) was so attentive and paid attention to details. As soon as I said I was vegan, she walked me through the entire menu and gave suggestions on how to veganize some menu items. She was fantastic. The ambiance, the food, the staff, the overall experience was exceptional and I am SO HAPPY that I chose to go there for dinner. The volume was also perfect cause me and my friend were able to talk and not have to scream over each other. I'll be going back for sure.", "author": "Jodine D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-01-13", "description": "As a local, and one who works/lives nearby, the prices here are steep, IMO. But, our server was bubbly, friendly, and had great energy for first thing in the morning - there is something to be said for solid service! Now how about the food? The avocado toast w/ an egg was decadent and a solid choice for breakfast. We also were given complimentary hot apple cider shots (yum) and my friends ordered some of their green energy juice (I didn't have any, but they loved it). \n\nThe view of BK bridge park and plenty of sunlight also add to the ambiance. I think this makes for a solid work breakfast location!", "author": "Shu Jin S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-03-22", "description": "This place is beautiful! The inside decoration are amazing. Food was good but not amazing! Everything was delicious though! I just expected more from a place like The Osprey.", "author": "Lourdes L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-23", "description": "The atmosphere is great and I love the location.\n\nCauliflower dish and beets salad were delicious.\nBut do not order steak. It was too hard and not edible. \nChicken was ok but nothing special. \n\nDesserts were fantastic.\n\nI will come here for drinks and desserts not for the main courses.", "author": "Miki N."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-05-14", "description": "Went here for dinner on a Saturday night and found the location and ambiance to be very good.  However, my dinner was supposed to have Chorizo and pasta and it was mostly just a bowl of past for nearly $30.  As an out of towner we know things are more expensive in NYC, but would've expected more for 3 of us when paying over $160.\n\nService was good and the quality of my companions' dinners seemed fine, mine was a disappointment though.", "author": "Dennis C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-15", "description": "Oh my! What an incredible restaurant experience! \nI came here Friday last week for lunch, right after my husband and I got married in the Court House. \nWe came with my mom and grandfather ( first time visiting NY from Norway) and my husbands sister, two kids and their father. \n\nFirst of all, we came over an hour before our reservation. I did not call to let the restaurant know, I just showed up and explained myself to the host. ( With this I am not trying to recommend people to do what I did, as I have long experience working in food service and arriving over an hour before your reservation is just not cool!) BUT the hostess was the sweetest ever and was totally understanding and great. \n\nBecause of the occasion I had requested a nice table, and of course being this early I did not expect to get the same table they had reserved for us, but we were seated at our table almost right away! \n\nThe hostess offered to take our coats and let us park the stroller by the entrance. I dont think I have ever been been so kindly welcomed at a restaurant before. \nThe staff we passed while walking to our table congratulated us on our wedding which was very kind. \n\nWe got our seats, which was perfect. Gorgeous view and big enough for us all with the two kids. \n\nStaff at the house had written us a beautiful congratulation-card - hangs on our fridge today!- and we were severed complimentary champagne for the occasion. \nLike that was not enough to be blown away - my husband, me and my husbands siste are those \"annoying sober New Yorkers\" and when we turned down the champagne, our sweet server was totally respectful (major plus!) and offered us something else instead for the toast. \n\nWe then got two complimentary salads while waiting for what turned out to be THE BEST BURGERS ANYONE HAD EVER HAD IN NYC! AMAZING!\n\nAfter the most amazing lunch, with the best service anyone had ever had in NYC ( or basically ever!) we were guided up ( I belive his name was Elvis, but apologizes if I got the name wrong) to the incredible roof for a showing and we got some insane wedding photos with the best NY view! BTW he took great care of us during the whole stay, checked in with us and was just absolutely amazing! \n\nTHANK YOU everyone at The Osprey for making our special day feel so extra special. \n\nWe will most definitely be back, and no doubt this is our go-to when our international friends/family are coming to visit!\n\n( oh, and if you are doing a Court House wedding. I highly recommend you walk Brooklyn Bridge with your crew before ending up at the Osprey for lunch or dinner. Make sure to go up to see the rooftop view and snap some photos!)", "author": "Malene S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-03-09", "description": "Really nice brunch spot in Brooklyn in the 1 Hotel. Great food and service. Really cool view of Manhattan and the waterfront. Portions were a little small for the price but overall worth it and would definitely recommend!", "author": "Joe N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-15", "description": "Is there a 6th star I can add to this?!?! Seriously. You NEED to check this place out if you're ever in the neighborhood. It's a beautiful, romantic, amazing place to dine, celebrate or just chill with a glass of wine (or in my case single malt scotch)  \n\nFist impressions-I was blown away by the beautiful decor and the lighting of the spaces. This restaurant was so well thought out; so pleasing to the senses. \n\nWe were seated near the Wall of glass windows where we could see the amazing skyline...beautifully lit up and so very romantic. \n\nSeating: beautiful patio area, bar seating and indoor seating\n\nService: EXCELLENT!!! Fun, prompt, attentive but not hovering\n\nParking: unknown as we took an Uber\n\nFood:\nHere is what my husband and I ordered: \n\nLamb duo \nPrime rib\nBrussels sprouts \n2Clary Ranch- Pinot Noir (Sonoma Coast)\n\nEVERYTHING was perfectly cooked, tender, seasoned beautifully and was an absolute delight to the taste buds. It was an anniversary to remember and a place my husband and I will surely be visiting again!", "author": "Audry P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-11-03", "description": "The service was very inattentive and the food was really bland. Branzino - bland. Chitare - bland. \n\nI had to send back the \"steak tartare\" aka the hamburger twice and I still got charged for it. \n\nI wouldn't go back.", "author": "Patty G."}], "servesCuisine": "American (New)", "priceRange": "$11-30", "name": "The Osprey", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "60 Furman St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/zLDflVKECvYd7pWXvLi_6g/ls.jpg", "@type": "Restaurant", "telephone": "+19294140012"}