{"aggregateRating": {"reviewCount": 364, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-24", "description": "Being German, I can tell you that this is the real thing. They know how to pour a beer properly, what a Flammkuchen is supposed to taste like and surprisingly, also what a great Italy-class cappuccino is supposed to taste like. You'd be surprised that this is a place that makes an espresso shot with a perfect balance of bitter notes and acids and on top of that also knows how to steam the milk just right to get a perfect creamy texture. If you hit the right bartender, you'll also be surprised with some cute latte art. The owners Tobias and Ayana are sweethearts and whenever I'm in Fort Greene it's a religion to me to enjoy some great food and good old German beer here.", "author": "Sebastian O."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-01-21", "description": "This has been by far my worst experience at Black Forest after coming to brunch here many times over the past few years. I'm not exactly sure where to start.\n1. After being seated we ordered coffees that never came after asking a few times\n2. Our food came and it was fine, subpar but edible, but the orders were not right and when we asked for hot sauce we were again ignored, \n3. Bottomless brunch is advertised as 2 hours for $25 on top of a the cost of a brunch item which is a great deal and had been great other times we've visited this restaurant. Over the course of the 2 hours we were served 2 mimosas after sitting empty handed for periods of 30-45min. Everytime we attempted to order another round we were ignored and after waiting we asked to speak to the manager and he assured us that they would removed from the bill. When the bill arrived they had added an additional bottomless brunch to our bill.\n\nOverall this was one of the most disappointing experiences I have had at any brunch and will not be returning and I advise that other diners also look for other options in the neighborhood. Black forest is not worth the money nor the frustration.", "author": "Jenny P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-21", "description": "Great German restaurant with a warm rustic vibe inside, outside tables, friendly service and fantastic German food.\n\nMy son and I were in the area for an appointment,  first time in this area...  The outside tables were inviting, and my son was game for sausages.\n\nNothing disappointed and we would definitely return. \n\nAmbiance. We sat outside which was great for people watching, and the rustic inside was comfortable looking too, longer wood tables making it more conducive for groups of friends.\n\nService.  Server was extremely friendly, great with suggestions on food and beer, and helpful giving us input about the neighborhood and subways, taxis. \n\nBeer.  The dark, black German beer was fantastic.\n\nFood.  We both loved the spätzle with gravy side.  Must have and reminded me of a grandma making it from scratch as she piece by piece dropped the dough type mix into a pot of hot water . Nostalgia and this was my favorite.\n\nMy son had the bratwurst with a side of fries, excellent and my favorite of the two sausages we ordered.  I had the Lange rote bratwurst with a salad, also good.  \n\nEverything was great.  Definitely recommend.", "author": "Lisa F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-16", "description": "Recently move to NY, and being originally from Germany, I had to try all the German restaurants in the city. Black Forest Brooklyn, has 100% authentic German food. The schnitzel is literally better than any schnitzel I've had living my entire life in Germany. It is SO good. The Currywurst is also great, and so are the pretzels as well as the Spätzle. I come here every two weeks and it's always packed. This place brings you back to the fatherland! Beer is obvs great, since it's from Germany", "author": "Julius L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-03", "description": "I was looking for a bar/nice place to hang out and came accross this place. German pub, pretty cool. I had the Oktoberfest beer, it was delicious, light and not bitter. We had the pretzels, this size and it was humongous, hot and fresh out of the oven. Soft and salty. We also had a side of shoe string fries and they were perfect. Service was great. Our server was very attentive and not pushy. The ambience was nice, with music in the background. I wish they had an outdoor space. That would have made this place perfect.", "author": "Alicia C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-04", "description": "One of my favorite spots in downtown Brooklyn. Never too hard to snag a table and the menu is perfectly priced. I usually order a flat bread/pizza like item which is more than enough food for one person and can probably be shared along with an app if you are a group of two. This is also a perfect brunch spot and you wont have to spend 45 minutes waiting for a table on a Saturday afternoon. The service can be iffy, but the food and drinks and price make up for it", "author": "Alli D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-07", "description": "I originally meant to go to some cafe to meet a friend but came across the Black Forest. I peered into the window, saw that it wasn't crowded, and decided to switch locations. For a Friday afternoon, the vibe was pretty laid-back. Visitors ranged from solo ppl on their laptops to families with babies. Wooden benches and tables are your  furniture arrangements with a bar by the door. I ordered a latte and a hot chocolate. My friend had soup and the flourless Chocolate cake, which I had the pleasure of tasting. Overall, I was pretty satisfied.", "author": "Eunice C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-18", "description": "Checked this place out with some friends for a Sunday Brunch. First, cool ambiance with both individual tables and the traditional beer hall benches. Awesome exposed brick walls with skylights showcasing their roof garden. The environment is chill and bright - it's the kind of place you will want to linger all day. \n\nFood is delicious! I got the black forest bededikt with salmon (other choices are kale and ham) for $14. It was also served with a small side salad. Very filling and tasty benedict as the benedict itself was served on hearty biscuits. Smoked salmon was well cooked as were the eggs. Overall, good flavor.  I was absolutely stuffed though I did eat every less morsel of my dish.  My fiancee got the egg over schnitzel ($16) which came with fries and a side salad. I had a taste of the schnitzel and it was a really good bite.  My friends got the gravy over biscuits and the scrambled eggs respectively - both looked like good dishes and very filling.  For $2.50, the coffee was a big cup which was nice.\n\nMy only compliant was the service as it took FOREVER to get our coffees (which then came out one at a time). After our dishes were served, it was hard to find any waitstaff for water refill or anything else.  All in all - a good meal and great bier garden environment!", "author": "Heather L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-17", "description": "This is a German place. I ordered a really original german dish, some kind of biscuits with meat gravy and pouched eggs with cheddar on top, it was good but the eggs were a little tasteless. The place is nice but the attention not great.", "author": "Julia S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-08", "description": "My waitress was not attentive. I had room temperature water on the table and I asked for a glass of ice water, she bought out  a cup of ice and poured the other water I had on the table that was room temperature in the glass with the ice. My food didn't come out hot more like 5 seconds from being cold. She forgot part of my order. And when my date wanted the German breakfast she asked if she can have a hard boiled egg instead of the soft boil and she was very adamant about saying it couldn't be done. The guys that bought out the food and cleaned the tables was nice. The crossiant was great, my eggs that I ask to be scrambled was like a chopped up dry omelet. The french TOAST W/O the nutella my partner ordered was DELICIOUS!! Oh and the Bellini was great.", "author": "Iesha M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-03", "description": "We had a decent dinner here prior to a show at TFANA. The good: great beer selection at reasonable prices, huge portions of pretty tasty food- portion size made the cost relatively cheap - and friendly servers. The bad: it was super loud, making conversation virtually impossible. I had the wurst sampler and there is no way I could even come close to finishing it. It could have easily been shared by 2-3 people.", "author": "Denise P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-06-24", "description": "Well to begin service sucks. I ordered the Black Forest Burger without tomatoes and of course they put it on and then took it off and left seeds. Waitress didn't even ask for it to be remade nor did she remove it from my bill. Smh... glasses of water stayed empty.  Great food service sucks... if you are in any kind of hurry don't eat here. If you hVe all the time in the world then it's worth it.", "author": "Joanna C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-11", "description": "Happen to be in the area and went in on a whim for an early dinner. I was craving a pretzel the size of my head. Really glad I stumbled upon this place. Great schnitzel and spaetzle. I'd absolutely come back here again.", "author": "Hayden L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-27", "description": "a German restaurant that isn't overly kitschy or \"just another beer hall\" is hard to find these days. luckily, Black Forest has you covered.\n\npretty solid brunch menu with some interesting spins on standards: Black Forest ham eggs benedict, schnitzel with eggs, and more. I ultimately picked the German breakfast, an impressive platter of charcuterie, cheese, mixed fruits, boiled egg, croissant, and pretzel, as well as a variety of spreads and preserves. a certain someone wanted a pretzel, but we were both a little let down by the pretzel, though she enjoyed her custom omelet and German-style home fries.\n\nsolid beer list and service was good. pretty fairly priced, and there was no huge rush to get people in and out. good way to fuel up on a chilly day!", "author": "Mike B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-04-26", "description": "Unfortunately I have to retract what I had said on my previous post about this restaurant. \n\nI went with a group of friends a couple months ago and recommended that one of them order the schnitzel. After waiting almost 40 minutes he received a FROZEN UNCOOKED piece of breaded chicken that he mistakenly attempted to eat. We told our waiter right away who just proceeded to apologize and didn't even offer to replace the meal with anything else. She did take the item off the tab but never offered anything on the house after that horrible and shocking piece of uncooked meat we were served. \n\nTerrible incident and terrible service to top it off.", "author": "Neda K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-15", "description": "German brats, schnitzels, and Jamaican jerk chicken wings!  The last unexpected but fall off the bone good.  Pretzels always solid but just learned of Sunday/Monday night football $0.50 wings, so we'll be back!", "author": "Sarah K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-31", "description": "We waited 1.5 hours for our food. Food and hot drinks were cold by the time we got them. Food was ready but not served for 20-30 minutes. Burger was dry, just like other chicken cutlets and the rest. I usually don't write bad reviews but this place asked for it. Understaffed and horrible.", "author": "Sayyora A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-15", "description": "I don't understand how Black Forest only has 3.5 stars to its name. My experience here was fantastic. This is coming from someone who walked in starving, tired and cranky. It's dangerous when I'm in the majority of HALT (Hungry Angry Lonely Tired). I'm not the nicest of people in that case. But Black Forest turned everything around for me pretty quickly. The food and beverages were solid at the very least, the service was superb considering how busy the place was, and everything was AFFORDABLE. That's a pretty hard combination to find here, folks. \n\nWe found ourselves at Black Forest thanks to my aunt, who's a loyal patron of BAM. She informed me that though there are many fine eateries around the theater, Black Forest was her go-to. Though I prefer to do more research before going out to eat somewhere, I decided to live a little. And yes, that's what risk-taking looks like in my life.\n\nThe space itself is warm and celebratory. Though I prefer Belgian beer to German beer, I adore German beer halls. The vibe is just so merry and carefree and that's a vibe we could all use more of in our lives. Plenty of different seating options here--high top tables, normal dining tables, bar seating, communal seating. Because we came here straight from a BAM show (at around 9:45) we were, well, not the only people who had the idea to come here, post-BAM. By this I mean that our only seating option was a communal table, which ended up a lot nicer than expected. I'm always down for bonding with fellow diners, but that excitement is often met with odd looks and suspicion. Here, we got to witness a party of five take a communal shot off of a ski, which was a treat. I didn't even take the shot and I was buzzed from that. \n\nDon't worry, we did try out some alcohol here. I planned to go with beer, through and through, given that this is a German beer spot. But I took one look at the cocktail menu here and knew I might need to reconsider. For starters, I'm pretty sure most of the spirits they use here are German. It's one thing to carry exclusively German beers, but it's far less common to see a full bar of German liquor. Serious props there. I ended up going for the Williams Sour (Schladerer Williams pear brandy, Van Brunt moonshine whiskey, lemon juice), which was fantastic. I felt like they kind of skimped on the total amount of liquid (it was maybe three sips, max), but overall, I was happy. And though it's always better to stick to one type of alcohol for the night, I just had to get a beer for my second drink. You can't not at a place like this. I ended up going with an Andechs Dopplebock Dunkel, which was fabulous. One of the best dopplebocks I've ever had. \n\nFood-wise, Black Forest has great options, great portions, and great prices. I think \"great\" would be the only word sophisticated enough to describe all of that. Any type of German food you could possibly want, all with German/English menu translations. I don't know that much about German food, but this is up there with some of the best I've had. Seems pretty authentic to me. I tend to not eat heavy food (gym rat, so sue me) so I don't tend to go for sausages or schnitzel on the reg, but Black Forest actually offers a pretty healthy menu. Organic, grass-fed beef AND vegan options. It's rare to find a German restaurant that serves a vegan sausage option as well as a cheese substitute. Our eats, below:\n\nBauernmadchen Flammkuchen (flatbread): (sour cream--we subbed for the vegan citrus cauliflower spread--spicy citrus shredded kale, roasted pumpkins, cauliflower, roasted almonds) - A+\nOh man, this was unbelievable. I didn't realize the Germans had a traditional flatbread that they serve. Add in the fact that Black Forest offers gluten free crust and vegan spread and I'm on cloud 9. Pretty fantastic combo--unusual toppings but a nice change of pace from your typical flatbreads. Fresh, varied, healthy and earthy. Must-order. \n\nWurstkorb (choice of sausage w/ warm kaiser bun, shoestring fries, sauerkraut) w/ Geflugel Bratwurst (hardwood-smoked chicken sausage): A\nHooray for chicken bratwurst! What I treat to find this on the menu. Very flavorful, just wish there was more. Next time I should just through caution to the wind and get a four-sausage sampler. One issue--I realized after the fact that we didn't receive shoestring fries. Whatever we did receive was meh. But hey, at least the kraut was good! Love my kraut. \n\nOne Weisswurt sausage (Bavarian pork and veal): A-\nIt didn't blow my mind, but for a simple single sausage, still pretty tasty. Now there's some kind of innuendo. Anyway, glad we opted to try a second type of sausage--particularly one that's in the arena of authentic German cuisine (as opposed to a vegan sausage, which would be very far from it). I tend not to eat red meat but I'd still say it was a worthy diversion from my normal diet. And for just 5 bucks, really can't complain.", "author": "Molly T."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-04-27", "description": "They tax their employees on unearned cash, and they skim tips. The way they handle payroll has to be illegal, at the very least it's ignorant and unethical. Overpriced food and treats their staff like dirt - I won't eat somewhere that takes money from their employees' pockets. They should be investigated.", "author": "Lauren B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-22", "description": "This was a strange experience. We got there with no reservation which we didn't think would be a problem cause the restaurant was pretty empty. They sat us outside despite many tables inside being available. We had 4 different servers during our time there, which made things confusing and the servers did not know the menu. Finally they said we could move inside to one of the empty tables. We rarely got checked in on by any of our 4 servers and none of them especially friendly. Made us seem like we were burdening them by being there. Overall service was horrible, the highlight was the food and beer. Food was awesome, if only they could get their service issues figured out then this place would be a 5 star establishment.", "author": "Sarah D."}], "servesCuisine": "German", "priceRange": "$11-30", "name": "Black Forest Brooklyn", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "733 Fulton St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/SeINe6YLs2K5rJB8tUD8rg/ls.jpg", "@type": "Restaurant", "telephone": "+17189350300"}