{"aggregateRating": {"reviewCount": 364, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-09", "description": "I've been here twice, both times were Tuesdays. Crowd is the down time after work scene in the evening, even a family or two. The food is great. Brezel, wurst, you name it, all stellar. Even the fried mushrooms, which I usually would say no way to. The beers are on point. The bar tender is great with recommendations (and very friendly) for what you're looking for if you're not familiar with German beers. One down side *maybe* is the very limit liquor selection. If you want a beer or three with a couple friends, you can't go wrong.", "author": "Kevin C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-08", "description": "This review is just based on drinks. I came here on a date after dinner at Pequena around the corner. For a Saturday night at around 9 the place was pretty dead. We sat at a table for 2 and ordered beers. The wait staff was really kind and attentive. I'd for sure go back here for more beer and to try food.", "author": "Calee P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-12", "description": "Real German food in the neighborhood. Kaesespaetzle was really good, it's like a German version of mac and cheese, with the real nice emmentaler cheese. If you come in a crowd, definitely get the Grosse Wurstplatte, nice presentation with 7 kinds of sausages. Schnitzel was tender with fresh salad. Happy to have Black Forest in Fort Greene!", "author": "Caitlin R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-10", "description": "Love this place. Had great goulash. The beer selection is great. Good choice for food near Barclays.  Prices are very reasonable too.", "author": "Adam L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-20", "description": "This restaurant came recommended to me by a friend who said they serve a good steak... Unfortunately there wasn't such a meal on the menu.  On the bright side, they do serve some pretty fantastic traditional German food!  Pretty chill place to eat, and I'm sure I'll be back in the future.", "author": "Coby B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-10-09", "description": "The beer here is fresh, tasty and clean, the flatbread is great, and the space is ideal for a night out. However, what wonky service! Seriously inconsistent to the point of me wondering if someone slipped the waitstaff something before their shifts. The first time I came here--three waitresses called in sick and we waited maybe 30 minutes between beers. Second time, just slow. Third time, the waitress looks like she's about to cry, ignores us, and when I chase her down for the check she confronts me, saying, \"I heard you.\" And then she says the same thing another time while at my table. (I felt a little violated at that point--all I wanted was my check, not an excuse). C'mon guys, hire decent waitstaff! I like you!", "author": "Sarah M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-01-29", "description": "Came here on a Sunday afternoon and can only say it felt like it had kind of a strange vibe. On one side the skylights and the architecture have a very modern feel, while the tables and benches are more like a traditional beer hall. On the other side, where the bar is, it feels more like a coffee shop with smaller tables in a totally different style. And the soundtrack was all jazz, which was a bit unexpected.\n\nWe tried two pilsners that were pretty standard, but not great. The rest of the beer list was decent, but not as extensive as some other beer gardens in NYC. We didn't try the food, but the menu seemed to have a lot of choices.\n\nThe service was ok but not standout in any way, and there were a lot of parents with their young children, which is not atypical in the neighborhood, but makes things feel more subdued than you might expect. Probably a nice place to come during the day if you have kids because they seem to be accommodating for families. But not much else stands out here.", "author": "Katie S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-30", "description": "Great food and ambiance. Amazing selection of beers. Great location. Menu keeps evolving with new items.", "author": "Federico A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-20", "description": "The beer warms the belly, and the food warms the soul. Best meal I've had in New York so far!! The menu has something for everyone, a brat and fries to traditional German fare. The beer list is small but every beer I've tried I enjoyed. A definite must if your in the area!", "author": "Laurel G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-20", "description": "My family came from Hamburg... I love it.  I don't eat meat I hate it. \n\nKaesespaetzle rules.\n\nLove it or hate it, German is the next big thing resistance is futile.", "author": "Alan N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-10", "description": "Really great german beer spot. I frequently go for lunch--the wurst is the best! The fresh hot pretzels are really a great happy hour snack. The service is almost always excellent, fast and friendly. Even during world cup games.", "author": "Jared G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-22", "description": "Food was excellent, especially the kale. Be sure to try the Flammekuchen! Very similar tasting to the food I had when I was visiting the Bavarian region. True to its roots!\n\nGreat atmosphere, though at times the music seemed a little loud. Great place for gathering with friends.", "author": "Guillaume M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-05", "description": "Updating my previous review to add that I just learned they're open for breakfast now, too. They have excellent coffee and espressos - and I love the butter pretzel. There are also egg-sandwiches for those who are into that sort of thing. The music is always great and the barista's solid.\n\nEvery time I go in there, I wonder how it's not busier. Their loss, my gain - it's great here!", "author": "Mark R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-06-21", "description": "The place is overpriced and dirty. They don't clean tables properly. Also, In summers inside is super hot, they seem don't turn the AC on to make more money and expect customers ask no questions about it. And when you ask why it is hot, the waitress is going to look into your eyes and lie that AC is working and it is just hot outside. You show the AC is off, and Outside was much cooler and inside no AC was running - she will tell you it is working. I don't care what kinda exotic German words in the menu they use or how they clean tables in Germany, fix the f. AC and let it run the American way!!! And clean the f. tables the American way too!!!", "author": "E S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-23", "description": "I've been here several times and try something new each time (all delicious). Also very family friendly and spacious. I could comfortably nurse my baby (which is a nice convenience).", "author": "Nik O."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-09", "description": "I am updating my review.  It seems that the owners paid attention to all of us Yelpers because service has greatly improved.  Even though our waiter was \"in training\" he still was attentive and managed to get it right.  Food was great this time.  And of course, the beers as great as ever.", "author": "Barbara H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-17", "description": "True to its name, Black Forest Brooklyn brings a bit of der Schwartzwald zum Brooklyn. I see that Matthew S laments, \"Oh, yay, ANOTHER German beer hall,\" but I think it has a number of things going for it that give it an edge over the rest. Take it from me, as I've been around the Stammtisch a few times: I'm a huge fan of Buschenschank and Zum Schneider, but I think BFB eclipses them and certainly the likes of Der Schwarze Koelner and its crappy service.\n\nFirst, it has one of the best beer selections: not just the typical Hofbraeuhaus Muenchen, but Weihenstephan (one of the oldest and best breweries), Jever, and a good selection of bocks, altbier, and other richer varieties. Pils and hefeweizen are ideal in the summer, but it's nice to have darker varieties during this never-ending winter.\n\nSecond, at some other German beer halls, you may get a similar selection, yet not all of these beers will be served vom Fass, which makes a huge difference for imported beer.\n\nThird, I think the atmosphere strikes the perfect balance between Brooklyn character (thoughtfully decorated, mottled exposed brick, relaxed atmosphere) and ein echtes Hofbraeuhaus. They have real Germans working here, including at least one of the owners--who, by the way, appear to give a Scheisse, as I've seen them in the place every time I've visited.\n\nFourth, ein Wort: die Riesenbrezel! Considerably better than Buschenschank's, served hot, buttery, und so gross wie der Wienerischer Riesenrad! Easily the best pretzel this side of the Neckar.\n\nThe complaints about the noise level and babies strike me as odd--you know you're going to a beer hall in Brooklyn, right? If you need to find something more authentically German, meine Empfehlung would be to watch this Sprockets video: http://www.dailymotion.com/video/x9p5ey_sprockets-germany-s-most-disturbing_shortfilms", "author": "Food Jerk X."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-30", "description": "Always a good idea. The food and beers are delish and seemingly authentic, for a very reasonable price. The atmosphere is relaxed and peaceful. Go here on an afternoon when you're not in a rush. Its worth it. The spicy kale citrus kraut is awesome, but it's only a side. Their big soft pretzels are perfect for sharing. The flatbread is very good, and a lot of food for the price.", "author": "Amanda D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-23", "description": "Great spot with lots of room to chill with friends and enjoy some beer and bratwurst.", "author": "Farah K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-07", "description": "Sebastian is the best bartender in this place. Ask for him next time if u want to know to anything about German beer. He is so nice.. Love him!!!!", "author": "Monika W."}], "servesCuisine": "German", "priceRange": "$11-30", "name": "Black Forest Brooklyn", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "733 Fulton St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/SeINe6YLs2K5rJB8tUD8rg/ls.jpg", "@type": "Restaurant", "telephone": "+17189350300"}