{"aggregateRating": {"reviewCount": 364, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-09-19", "description": "This place is about the beer and atmosphere. Generally a good crowd but the staff gets a little overwhelmed if you come primetime (say, 10p Saturday). \n\nReally wanted to love the food but unfortunately not so - the snacks are great (pretzel, meat plate) but I wasn't fond of the entree options. Most notable was the spätzle which was seasoned with butter and that's it - yes I know its supposed to be a 'mop' like a side of bread, but even fresh bread by itself is pretty darn good, right? This spätzle was a bit one note (butter) when eaten alone. \n\nThe beers are still outstanding.", "author": "Joyce L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-03-12", "description": "I want to love this place, the beer is great the food is great but holy hell, the bar staff SUCK!!! Been coming here for a year and every time the staff suck. It's a shame", "author": "Rachel K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-04", "description": "Great spot.  Solid food, friendly service, large selection of German beers on tap, cool ambiance.  Will happily visit again.", "author": "Chris C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-06-16", "description": "My husband and I went to Black Forest last night and arrived for a 7:30pm reservation. There's no check in / host station so we told a waiter we had a reservation and he showed us to a table that he just wiped down.  The place was packed! And as we waited for our drinks to arrive 40 minutes later I noticed that for a place that busy there were 2 waitstaff, 1 runner and I think just 1 bartender.  There was no way service was going to be able cover ALL of the tables and we knew it was going to be a bad experience - particularly when tables around us started to get up and leave because they had waited for food, service and drinks that never showed up OR were delivered and not what they ordered. I blame the owners - shame on you for making your staff work under those stressful conditions.", "author": "Anthony R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-07-19", "description": "It's one of my favorite places in Fort Greene but the food hit or miss and the service is slow. However the selection of beers is great. We will keep going unless a place with better service and consistency in food comes along.", "author": "Rychiee E."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-04-22", "description": "Lesser of two evils in the neighborhood. Had food, which was good. The drinks were better than the other German spot on Fulton. Service.... Not as bad, but nothing worth the exploration. \n\nGo if you want to kill hours of time with people who like to sip and have long conversations.", "author": "Jason D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-13", "description": "I have no idea why this place has such low ratings. The service is super nice, the beers are great, and the food is delicious. I tried my husband's brat and it was very well done. The atmosphere is wonderful and they even have a big projector screen which is currently playing the U.S. Open.", "author": "Julie J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-04", "description": "Great service, delicious and filling food, and excellent beer. I had the Nurnberger and my cousin had the Flammkuchen. Both were terrific. The interior is cozy but big at the same time. Love the cuckoo clocks on the wall. Only complaint is I wish more entrees came with mashed potatoes instead of boring fries.", "author": "Carrie M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-03", "description": "Why does this place only have 3.5 stars? Since they opened it's been a standard, everything they make is amazing. The staff is awesome, the food is fantastic, the space is beautiful. \nI'm not usually a German beer drinker (I love hoppy ipas) but I've always found something I want to drink here. Btw thank you for putting an IPA on your list :) they've also got Aventinus, a fav.\nI'm actually headed there tonight to introduce a few friends to it \u0026 after writing this, I can't wait!", "author": "k m."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-03", "description": "I've been here more than a handful of times and the food service and drinks have been great. \n\nMy favorite experiences were during the past World Cup in 2014 and Octoberfest in 2015 because we were attended to very kindly and promptly when food or drinks got low and in October they had a brass band play inside. They were very good and the whole place was very fun. Owners are great people and very kind.\n\nGreat selection of beer and I try different food every time I go. All good!", "author": "keven m."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-23", "description": "Never had a bad experience here - yet!\n\nFantastic beers and great food with greasy and healthier options.\n\nThey don't take AmEx cards!", "author": "Claudia L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-23", "description": "Went here for a friend's birthday. We had a lovely table outside in the sun. I don't drink beer so I consumed the dry reisling. It was crisp and went well with my bratwurst and fries. Really really delicious. The flat bread we ordered for the table also was so tasty. And of course a real pretzel. Crunchy on outside fluffy on the inside, dipped in spicy mustard...YUM! I will definitely come\nBack. \n\nVery easy to get to in Brooklyn. Friendly owners. The friend having the birthday had friends who were friends of the owners :) did you get that? No matter. I was just name dropping. ;-)", "author": "Nel A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-02-20", "description": "Cheap lunch special. Beer was overpriced. Vibe is a bit generic. Not really much German authentic food going on here..", "author": "John S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-16", "description": "Super yummy! Great service. Great drinks.. \nYou will likely only be able to pronounce 1/3 of the menu but everything we tried was good. Daniel was our server. He was very attentive and gave great suggestions. \nThe Camembert Pit (insert German word here) salad was amazing!  \nI will be back.", "author": "Natasha D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-04-25", "description": "The food here is pretty good. The staff is friendly. But the service is just horrible. Coming here for sausage and a salad means you're going to be here for over an hour on your lunch break. I really hope they pull it together in terms of their issues with timing.", "author": "Courtney W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-25", "description": "Tasty and affordable German food. Great place to have drinks and have food that sticks to your ribs. Also super friendly wait staff and attentive service. The one downside is its very loud though this could be expected for a biergarten.", "author": "Anastasia T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-19", "description": "Black Forest is one of our favorite places in the neighborhood to grab a drink or bite to eat! It's a chic indoor German beer garden that appeals to beer lovers and beyond!\n\nPros:\n-pretty beautiful space with long wooden tables, a big bar, chalkboard bar menu, and skylights on the ceiling\n-great location on Fulton (just past Fulton and Lafayette intersection)\n-huge communal tables available which makes it a fantastic option for large groups\n-diverse beer selection (handful of wines and shots too, and you can do a beer flight or a shotski!) with many sizes (all the way up to a boot!)\n-food is surprisingly delicious, we have enjoyed the pretzels and sausages (of course to be expected at a German beer garden!), as well as some of the flatbreads, salads, fried mushrooms, and Mac and cheese. All were really well done.\n-they have outdoor sidewalk seating which offers great people watching\n-generally a fun mixed crowd of couples and large groups, have also seen many families here \n-bottomless mimosa brunch on Sundays!!!\n\nCons:\n-maybe drinks are a bit on the pricier side (not entirely out of the ordinary for the neighborhood, but still maybe a bit high)\n-service can be slow or inefficient at times\n-gets packed many weekend nights that may be hard to get a table \n\nGood place for a drink or bite in fort Greene!", "author": "Amanda B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-31", "description": "This place is amazing for German food and craft German beers...and close to Barclay's if you ever at an event definantly a must to stop by.", "author": "Jean F."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-03-28", "description": "The first experience I had here was during the weekday.  I wandered in at 1:15PM looking for a quick lunch and a place to study comfortably while a friend of mine came over from work.  She was late, like normal, so I had set up shop with a few of my textbooks by the time she came.  We ended up ordering the Flammkuchen (a german style pizza) and a Bratwurst.  Our orders came out in a pretty timely manner and tasted quite good.  The flammkuchen was light and had a nice crunchy crust.  The grilled onions and bacon on it had good flavors, but the sour cream base started to solidfy in a kind of chalky way.  While the taste was good fresh, 20 minutes after having order the flammkuchen, the pizza definitely fell flat.  The bratwurst, as you would expect of a German place, was decent, hot, and came out american style (on a bun).  Resting on a bed of crispy french fries, the basket had and slots for small carafes of ketchup and whole grain mustard which were both delicious but didn't really appear homemade.  The sauerkraut that accompanied the dish was decent but had minimal pungency.\n\nOverall my first experience here would have been rated a 3 or a 4, but that was before I decided to drag T.H. here for brunch.\n\nOn the second experience here, T.H. and I went in for a late brunch.  Having eaten here a few days earlier, I was eager to show him that there are decent and delicious brunch places nearby to our apartment.  Not to say that there aren't, but it is clear that Black Forest was built more for my weekday mid-afternoon study locale on that rare day that you get off early from work.  \n\nWhen we walked in, we were quite lucky as we were seated immediately midst the bustling lunch crowd.  Seated further into the restaurant, T.H. and I had a small two-seater table near the casually decorated beer barrel and in full view of both the kitchen door, the bar, and the server's station.  Against our better judgement, we both ended up ordering brunch specials, the Bratwurst gravy and biscuits for T.H. and the Black Forest Benedikt for myself. \n\nThe Bratwurst Gravy and Biscuits, unfortunately came out slightly cold.  Willing to ignore this in favor of a potentially delicious bratwurst, T.H. dug in and found that not only was his dish slightly cold, the cheese they used remained partially unmelted, giving his dish a slightly chalky taste with a rubbery texture.  Upon further probing into his dish, he found that the biscuits, that were laid down in slider style with the bratwurst and eggs in between, were rock hard.  Not only were they rock hard, they practically bounced off the dish.  I snagged a bit of his biscuit later, as it was the only item left on his plate (he refused to eat them after a while) in hopes that I could soften it with the hollandaise sauce left on my plate and found that the biscuit was actually stale.  So no, we can't recommend this dish.  The bratwurst, from my previous experience here, is decent but it really doesn't get treated properly in this dish.\n\nThe Black Forest Benedikt itself comes in three varieties.  One with ham, one with lox, and one with Kale.  It comes with a delicious side salad with a mustard vinegrette.  Unfortunately the salad was a tad better then the eggs benedict today.  The egg was cooked perfectly but the biscuit underneath, just like T.H.'s, was rock hard.  While it did soften slightly as the hollandase soaked into it's craggy pores, it was still pretty chewy and difficult to separate into bite sized pieces.  \n\nSo if the food was overall okay but not extremely good, why did I rate this a 2?  The service wasn't great.  It took 15 minutes to get the check and we only managed to get the check after asking two of the servers and finally were approached by the manager of the establishment because we were looking irate.", "author": "Caroline L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-05-15", "description": "If you could give negative stars I would. I've been to Black Forest quite a few times and always had a great experience but after today I will not be going back. My friends ordered bloody Mary's which the which the waitress told them they couldn't get because there wasn't an option to order it on her screen. Yes I know Black Forest is a beer garden but it has a full bar, a Bloody Mary shouldn't be a difficult request. She managed to ask the bar to make them but insisted on making a statement about how she made it happen. After this we tried to order a large pretzel, but we were told they were out. So we went with 2 small pretzels instead, which was fine. But after ordering the rest of our food the server returned again to let me know they were out of the gluten free flatbreads. The frustration began. A few minutes later she returned to tell another friend of mine they were actually out of all the flatbreads. So at this point 3 out of the 4 dishes we tried to order they didn't have and we were given a stink when trying to order bloody Mary's. \n\nFinally after the owner must have overheard our frustration, the server let us know they would like to comp us a round of drinks. After waiting about 15 minutes the drinks never came, nor did our server. We had to go to the bar to get silverware for the food that we did mange to get.  \n\nFinally about 30 minutes later another sever came over and gave us our bill and told us we could pay them, apparently out sever had left. We never asked for our bill and we never received our comped drinks. So we asked that the drinks we had drank be comped and left as quickly as possible after paying to get a drink around the corner to recover from the horrible experience.", "author": "Marielouise M."}], "servesCuisine": "German", "priceRange": "$11-30", "name": "Black Forest Brooklyn", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "733 Fulton St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/SeINe6YLs2K5rJB8tUD8rg/ls.jpg", "@type": "Restaurant", "telephone": "+17189350300"}