{"aggregateRating": {"reviewCount": 364, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-05-13", "description": "Lapin and I came here for an unexpected brunch. We were walking around aimlessly and thought the place looked interesting. The place was bustling with people but we managed to be seated quickly without a very long wait.\n\nWe were given a small table right next to the cafeteria style tables for larger groups.  I got the two scrambled eggs with Bratkartoffeln ( a German fried and sliced rosemary potatoes, which was tasty) served with toast and preserves. The preserves were really good. Lapin got Flammkuchen, which is a flatbread  with sour cream and bacon. Lapin  really enjoyed it and it was a very big portion for the price. Lapin also ordered this German Orange juice beverage which he enjoyed. \n\nThe food was good but I think I might try their lunch or dinner option the next time. The service was a bit slow at times as the place got packed really quickly. Lapin wants to come back to try their beer offerings as he found several he wanted to try.", "author": "Andie B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-25", "description": "Good service\nLovely outdoor area - good for people watching\nDelicious Rosemary potatoes\nGreat iced latte", "author": "Ross C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-21", "description": "My buddy was in Germany and he saw a program on TV about German food in America. And Black Forest was one of the places that they discussed and now he wanted to go. So we did.\n\nAnd the food, it's decent. The Flammkuchen is basically German pizza. Flatbread, cut into pieces and easily share-able. The one we got had salmon and dill. It was pretty good. Would order again. The goulash w/ Spaetzel was kind of lacking. I don't know if they par-cook the spaetzel or what, but it wasn't great. I also personally prefer them in smaller pieces, these were kind of like noodles.The meat in the goulash was on the tough side, but on the other hand, the sauce was pretty good. I had a bite of the fish schnitzel too, and it was pretty mediocre.\n\nThe beer list is good though. They do a barrel-aged old fashioned that was delicious if a bit sweet. And the beer that they have that's a cross between an American style IPA and a German beer was really good.\n\nSo maybe this is a place for drinks and snacks. I'd go back for that.", "author": "Adam R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-18", "description": "Great service. Great atmosphere. Great food. I live in the area and decided to come here on a lunch date with a friend. Our waitress was very attentive and answered all of our questions and even made a few recommendations. She recommended a grapefruit beer which my friend and I loved! We ordered lunch which came out to $9 for a pork schnitzel with fries on the side and a free chocolate dessert. The Olympic games were playing on their huge screen. I really liked the setup. I will definitely return!", "author": "Christine M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-12", "description": "Great location as a lot is happening on n this block, and is near BAM. This is a German Biergarten. There are plenty of options on draft, but beware the smallest glass will be half a liter. Very open layout with just the right rustic touch with half the space holding wooden picnic tables standing under two large skylights, and the remainder with newer country 2-3 person square blonde wood tables accompanied by spring green wooden chairs matching in color some wainscoting and fireplace mantle. The same blonde wood creates the tall stools at the bar. Most of the walls are open brick, which is common in BK, yet always appreciated by myself. Likewise to the ubiquitous \"Edison\" style filament anti-energy-efficient light bulbs. \n\nLike any respectable beer place, they readily offer you shot-glass tastes of various beers before commitment to order. I love IPAs, and just because I did not find a similar brew to my current taste did not stop me from this 5 star review. I can appreciate that they have many colorful(and sometimes rare) alcohol options, and I settled on their darkest beer, the Köstritzer Schearzbier which satisfied my thirst thoroughly with its tasty black character. Music was a medium loud of various popular eclectic cool, hip, retro or unusual sounds. I think if they wanted to sing \"traditional\" German song fare to the local BK ear, no one would have come, and this place would not have been as crowded as it was this Saturday night. \n\nService was friendly. They sell organic German delicacies and apparently coffee and cake, which I cannot comment because I did not partake in those options.", "author": "Michael D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-18", "description": "The kitschy name jumped out at me when I saw this spot a few weeks before. Having spent much time in Deutschland, my appetite was engaged. This place is big so I brought my friend Sandy for a prime-time brunch- no waiting at 1on a Sunday- a miracle in these here parts of Brooklyn. \nThe food here is authentic with local updates. \nAte: Brat with kraut and a salad $11\nBlack Forest  cake hence the name\nKolsch beer-2 oz $2\nThe brat on a local roll with spicy mustard was legit- kraut tasting of cider was delish, nice salad with cukes, radishes and tomatoes. The beer was perfect with the  food.  We shared a shot of Baileys for old times sake. The savory here definitely surpassed the sweet cake, but love this.place!", "author": "Franny A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-03", "description": "Cozy place with excellent food and ridiculously fast service. I ordered the shnitzel here, and I just came back from a trip to Austria so I know what it should taste like. It was flavorful and came with two filling sides of my choosing. However, it was pretty expensive at $21. Our table also ordered the pretzel, which was delicious, and the goulash, also delicious. Great German beer is available, and the food comes out really fast. I would definitely come back.", "author": "Jon P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-26", "description": "Good beer with a decent it door seating for the neighborhood. The out door seating is mainly for couples due to the space and layout oh the seating arrangement. Waiters and bartender are great and won't let your mug go empty.", "author": "Brock S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-23", "description": "Anyone who's spent time in Angela Merkel's country understands that German food is secretly the best. It's basically carbs (potatoes, spätzle), meat (bratwurst, schnitzel) and beer (!!!). So whenever I'm faced with a cold winter's night and I have an appetite the size of the Fernsehturm, German food is what I'm grabbing.\n\n...Which is why when the temperature dipped below 30 degrees recently I rounded up some friends to fight the winter freeze with a hearty meal. We got here around 8 and it was pretty crowded, but were able to snag a table without waiting too long (it's seat yourself, which I think is GENIUS).\n\nHere's what we had and how I felt about it:\n\nReisenbrezel: This giant pretzel is phenomenal. As someone with a bottomless pit for a stomach, I could probably eat an entire one by myself but it's also good to share.\n\nBratwurst: Good and great classic German fare that Merkel herself would approve.\n\nKasebratwurst: Bratwurst...infused with cheese. DO IT. You won't be disappointed.\n\nGeflugelbratwurst: Delicious, devine and not as heavy as the other two mentioned above.\n\nKasspatzle: Just do yourself a favor and order this if you're confounded on what to get. It's essentially a German take on mac n' cheese...with bacon.\n\nThere's also a great beer selection, with the famous Schofferhofer Grapefruit brew and Rothause Tannenzapfle. I ambitiously got a liter, which I could barely finish, but it's worth a try if you're feeling frisky!", "author": "Sarah G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-02", "description": "A great neighborhood German spot that is spacious and low-key. During the day you can find many people hanging out with friends or working on their laptops. They are family-friendly and have been very accommodating when I bring my baby. Service is friendly, food arrives quickly, and the ambiance is relaxed and enjoyable. I like how they take your order and settle your bill with tablets, makes it very easy to split the check and it's eco-friendly without numerous paper receipts. \n\nI've had the original flammkuchen and the pork schnitzel and both were delicious. I look forward to hanging out and dining here again!", "author": "Fawn M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-07-13", "description": "This is not an easy review to write, and not because I have one of those little beer headaches that feels like a bike helmet that's just a little too small for your skull.\n\nIt's not easy to write this because this place, the venuuuuue, is amazing. It's big and cool and comfy and you can come here with all of your friends and all sit together, and you can be loud and no one cares, and the lighting is just right at night that no one can really notice how sloppy you're getting on German bier. So, yes, the place, the space, is outstanding. Kudos to the designer and space-planner.\n\nThe service, too, is quite charming. Friendly at the bar and friendly with table service, even when busy. Kudos to the staff. And the fun, totally anachronistic 80's music? Looooove it.\n\n\"So where are the other two stars, you creep?\" Alas, I fear that the other two stars are in the kitchen ... somewhere. We had some dinner bites - pretzels and such - and everything tasted ... see, this is when I hate myself ... microwaved. It just did. I don't know how else to say it, type it, or yelp it. It just didn't taste fresh. Period. There's no more to say about the food. I will mention that my friends said, \"Oh, their brunch is good.\" But I wasn't there for brunch, I didn't want brunch. I wanted a bunch of yummy bites for dinner. You gotta be aiming for five stars all the time, amiright Yelpers?\n\nSo, you should certainly come here for the space, service, atmosphere, and huge selection of great biers and schnapps (too!), but not for food.", "author": "Brian M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-10", "description": "+++\n- Enjoyed the Radler\n- It's perfect for the ladies if they're not too fond of the beer taste\n\n++\n- The menu is one of the most reminiscent of my time in Austria, of any place I've been to in the city\n- Large portions of beer and food\n- (.5L is pretty big)\n- Place is pretty packed on a random Thursday night\n\n+\n- Chicken schnitzel is kind of tasteless without the lemon\n- Attentive bartenders", "author": "renje g."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-18", "description": "I really like this place. The Fulton location is much better than the Smith Street location. I've never had a bad experience here and I've been there multiple times for boozy brunch. Bottomless mimosas?!? Great food?!? I love this place. Don't bother with Smith Street. The service is horrible.", "author": "Nel C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-03", "description": "Went there for the first time after reading about it online. My friend and I were pleasantly surprised, the beer selection is FANTASTIC and very reasonably priced. \nThe food was more or less consistent with real German fare. Certainly the sausages are delicious and well worth it, as are the potatoes and sauerkraut. We only took issue with the occasional random tomato or radish  garnish that seemed a little out of place. \n\nThe decor is great, and the table set up is consistent with a German beer hall, and great for bringing many friends with you. I should also mention the service is good too, even when they were busy. \n\nOne of the only negatives I can note is that the music was a little loud for the size of the place, which made having a conversation difficult. \n\nCheck it out and see what you think though. \nHave a great time!", "author": "C G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-05-01", "description": "I actually really like this place, and in spite of the two stars, will continue to go there. I love the natural light and openness of the room, and the beer selection and food are great. The main issue here is that the waitstaff are like the Keystone Cops. Consistently. Every time I've been there, the service has been almost comedic. Sometimes I look around the room for the hidden camera, because it almost feels like there is a practical joke underway. \n\nI was there just yesterday. There were only about 8 people in the place at the time I arrived (before noon). It took 15 minutes for one of the waitstaff to notice me and come by. When he did, he told me that I couldn't sit at one of the big tables and disappeared, didn't even ask if I wanted anything. Then he came back about 10-15 minutes later and finally took my order. I was waiting for a friend and just ordered a coffee, which took about 10 minutes. Then he disappeared forever. My friend and I had to keep on flagging down a very helpful waitress who was dealing with a different section. I felt bad for her, but she didn't complain. \n\nLong story short, it's like this every time I go there. No one is unfriendly or aggressive by any means, which is partially why I'll continue to go back. But man, these guys really need to up their C+ service. It wouldn't be too difficult to get things running more smoothly.", "author": "Michael H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-15", "description": "Good beer and delicious food, can't go wrong. \n\nThe flat bread is really crunchy / thin and the bacon and onion were a good combo.  We also got the regular sasausage which tasted bland but comes with fries.  The potato pancake was also bland but salad that came with it was very fresh. \n\nGrapefruit beer!  Have to get it!!!", "author": "Angela L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-17", "description": "I'm going to tell you a secret (which I probably shouldn't - because I want to keep it to myself): Black Forest Brooklyn is one of the *only* (or the only?) venue in NYC that has a license to carry Weihenstephan Kristallweizen beer! Why? I don't know - because you can buy it at Wegman's in Buffalo. \n\nAnyways, this Fort Greene beer garten is thriving because of the rustic/wood ambiance and the picnic-bench open seating, and REALLY good draft beers. PLUS, they have good food - WAY better than the beer garden down the street. \n\nFavorites:\n-Spicy Citrus Kale side (It is SOOOOO good, citrus-y and spicy.  However, lately, it has gone down in quality. Sometimes there is very little spice and/or citrus.  This is why I did not give the locale 5 stars.  If their kale was *always* on point - it would be 5 stars... the last 3 times that I have patronized the garten - the kale was not that good. Again, IF it is good - it's fabulous. \n\n- Flammkuchen Waldschrat: Try it. It's really good - truffled mushrooms, sour creams and onions on good quality pizza-type flat bread. VERY unexpectedly tasty. \n\n- Brezel - the small one or the large one.  Whatever they put in the dough is on point - and the horseradish from the mustard gets into your nose like wasabi. I love that!\n\nWe saw the World Cup here when Germany won. It was door to door packed and when Germany won, the owners gave FREE BEER to the whole restaurant for an hour. The owners are really sweet, young, from the Black Forest - but met in Fort Greene... \n\nOverall GREAT place to hang out with a group or catch up with friends.", "author": "Fazeela S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-02-21", "description": "Coming to New York for New Years, Black Forest was my first choice for dinner. With it being my favorite restaurant in Brooklyn and all. But I have to admit I was kind of disappointed this time. The portion size changed so much. I ordered the goulash and they used to give you so much. It was still pretty good (not as good as last time)  I wonder if they changed cooks..... Service was good, and ambiance is great. Price to portion was off. Overall I'd still recommend coming here.", "author": "Wilson Z."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-24", "description": "Came here for the boozy brunch that they serve all weekday! I got there a little before the main group of people so I got their Radler which is Sprite and Pilsner-which is what it traditionally is and have to say, Sprite and Pilsner is a good combo-who knew that Germans knew beer? After that, the whole group showed up and we sat down at one of the big picnic style tables that they had. If you're there on a weekday brunch then do the bottomless brunch. They give you three options to choose from and I went with the beermosa, which is a hefeweizen and oj, which was pretty good, sweet but not too sweet and easy drinking.\n\nI ended up getting the omelette with bacon, onions and goat cheese. A little on the plain side but the bacon was good. All in all it was a good place to go to for daytime fun and a bottomless brunch.", "author": "Ted C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-11-03", "description": "My friend and I went for a bite on Friday ,a Punk look a like bartender made us walk away from your restaurant . The bartender was tossing things at him like he wasn't welcome here. The menu was tossed at him, the silverware same . We felt very uncomfortable and left . Worst experience ever", "author": "R R."}], "servesCuisine": "German", "priceRange": "$11-30", "name": "Black Forest Brooklyn", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "733 Fulton St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/SeINe6YLs2K5rJB8tUD8rg/ls.jpg", "@type": "Restaurant", "telephone": "+17189350300"}