{"aggregateRating": {"reviewCount": 364, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2019-05-13", "description": "Omg I finally found my place for a good beer and it was everything!!!!! It has a sweet taste which is my alley. There's a huge variety to try so go for it! \nI always walked past this place and had no idea it was this good!\nThe food-- I had the chicken sausage which was eh. Nice size but the bread was tiny. Fries /salad size was good. \nI'm open to come again for the beer ofcourse and try another meal!", "author": "Angela M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-06", "description": "Love. This. Place. \n\nBrezels (pretzels) have, IMHO, the perfect texture and have that buttery salt goodness that doesn't need the apple butter or mustard. \n\nAnything with spicy citrus kale on it: seriously all vegetarian options everyone should be this good. \n\nCurrywurst: YAS. \n\nBeer selection: robust, especially for this area. I have liked everything I have tried. \n\nBrunch gravy and biscuits: YAS. \n\nService: consistently friendly and professional. Not too fussy. \n\nSpace: roomy and great for groups. Ambience is VERY casual but can accommodate intimate moments too! \n\nI come here a lot and I'm so happy they're in the neighborhood.", "author": "Gayle G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-03-20", "description": "Beer:\nGreat German beer selection.  It's hard to find a good selection that isn't the same old same old.  They DO have traditional selections but also go above and beyond to find unique German beers.\n\nFood:\nPretzel was great.  I loved that it wasn't the giant pretzel a lot of places have but was a \"normal\" size.  Had the pork schnitzel and spaetzle both were very good.  I could hear them \"tenderizing\" the meat in the back.  Sounded like they gave it a good workout.  I also like that they gave me a big glass of water as soon as I sat down.  I'll be back.", "author": "Kyle D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-05-27", "description": "I love the ambiance here, and the beer selection is great. Good cocktails too! And the pretzel is to die for. However the service is always so slow and usually unfriendly. We live in the neighborhood and come by a lot, it'd be nice to develop a little more of a rapport.", "author": "Mara M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-05-27", "description": "Sat for 30 minutes waiting for service in an empty restaurant. After 20 minutes, my friend went up to the bar to ask if we had to order there - the bartender then said \"oh we've been ignoring you, I'll send someone over.\" Still no service for another 10 minutes. \n\nCustomer service 0/10 wish I could vote negative stars", "author": "A. P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-02-13", "description": "Food is decent but overpriced. $12 sausage sandwich and the sausage was smaller than the bread. $15 flatbread which was large but had sourcream, onions, and bacon. Nothing fancy.\n\nFun atmosphere but when we went there was a party in the back room so the servers were very flustered and slow. I would give it another shot but it didn't wow me.", "author": "Allie R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-05-12", "description": "We arrived at 10AM on a Sunday for Brunch. The restaurant was not very crowded, but filled up quickly.\n\nOur food took an hour to arrive after we ordered, and it was lukewarm. The hashbrowns where colder then our water. Our waitress never checked on us after the food arrived. We asked for Ketchup twice, and finally had to get up and walk to the bar to get it. \n\nOur Server was too busy folding napkins to check on us or get us a check. Had to get up and go to the bar to ask for a check. Service was horrible!\n\nIf the food arrived warm, it would have been delicious.", "author": "David S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-05-20", "description": "I used to go here for a good authentic Wiener Schnitzel but what they served tonight was below any standards... it didn't even look like a schnitzel and won't even share how it tasted... blend, boring, cold... if you pretend to be a German beer garden at least service proper German food..", "author": "Bob T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-22", "description": "Black Forest. Wow. Brings me back to Berlin. I ordered the schnitzel w/ Kale and Sour Kraut and a currywurst with the string fries. Both were delicious. My schnitzel was pork tenderloin. Perfectly golden crisp, with a delicious bite to it. The currywurst was not traditional in that there was no curry ketchup, instead, it was served in a grey bowl with a curry sauce.\n\nI also tried the huge pretzel, warm, salty, and it came with two mustards: savory and sweet.\n\nI highly recommend ordering my personal favorite, the Schoffer Hoffer Grapefruit beer. So light and refreshing. Yum!\n\nAll in all Black Forest is a great german spot with a nice atmosphere: long beer garden style bench/tables with art and photographs lining the walls.", "author": "Charles R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-04-11", "description": "I love the vibe, food and space of this place, but the service is abysmal and getting worse every time I visit. The servers look haunted. Requests are met with a glazed look of terror. Beverages are ordered, and never appear. Perhaps this is because they are out of stock (often). Perhaps they vanish through a trap door. Perhaps they are abducted by aliens. We are in a haunted house.\n\nI waited tables for many years, have managed restaurants and am extremely forgiving of poor service when it's clear that the place is understaffed, crowded, slammed with a large party, or under other obvious duress. However, I have had nothing but terrible service on numerous visits to BFB, and it doesn't matter if the place is empty, crowded, overstaffed, understaffed, or on fire.\n\nWhen service is this consistently bad, over a long period of time, it's pretty clear that there is at minimum a serious management problem and likely a shady payroll practice. It confounds me that so many restaurant owners choose to cut corners with and poorly treat their floor staff- it is immediately obvious to anyone who enters the place and is the thing they remember most after they leave. BFB- pay your waitstaff and treat them well. Your slip is showing.", "author": "Saffron R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-02-03", "description": "My friend and I stopped in recently--didn't check out any of the eats there, but they had a really extensive menu of all types of German food. There were also a number of seating options--with stools along the window to look outside, and a number of private \u0026 communal tables. On a busy Saturday night, it seemed like there were still a few seats to be snagged, which is always good. (It is true that space is the true commodity in this city...).", "author": "Mel G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-10", "description": "One of my go to places in this area!\n\nI really love the curry wurst with the chicken sausage! The chicken schnitzel is also one really good! It's a really large piece that could even be shared with another person. \n\nIm not a huge fan of potato salad but I actually like the one from here! It has a slight mustard taste but is mostly citrusy and refreshing! To wash it all down go a for the half litter or FULL liter beers (a little pricy but probs equals the same as a couple of beers at an nyc bar.) My only complaint is that the food is sometimes a little cold.", "author": "Anasofia T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-01", "description": "Friend remember this place after our first place for brunch didn't work out.  Good thing too!\n\nThis place was almost empty and worked out for a big group with a toddler.  We had our own little corner away from others so we wouldn't be too much of a disturbance to other patrons.\n\nThe restaurant has hooks on the walls to hang bags or coats which is a nice touch.  Wooden tables and benches...very casual and laid back.\n\nWithout a doubt, you need to order a Reisenbrezel, giant warm pretzel with German mustard.  The food came pretty quick after we placed our order.  Brunch is a good size plate.  Got the black forest benedikt (2 poached eggs, black forest ham, homemade butter biscuits with a side salad).  It was pretty good.  The German breakfast looks good (and it comes with a brezel - warm pretzel)...have to try next time.  The waitress checked on us from time to time and refilled the coffee cups that we're empty.  Great service.\n\nThere is a bar in the front if you want a drink.\n\nThere are 5 non-gender restrooms.  One was a bit wet so went to another one which was cleaner.\n\nNice place, have to try other stuff next time.", "author": "Caroline N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-13", "description": "I honestly can't believe why more people aren't giving this place 5 stars. Unlike the crowded beer gardens like the Standard, which are usually frequented by the same loud groups of people, Black Forest offers a chill atmosphere for the neighborhood crowd. You can always depend on finding seats even on a Friday night.\n\nTheir wooden table group seating arrangement is pretty much a beer garden classic. But they also have high top or normal tables for those coming in groups of 2 and not feeling like mingling with strangers. \n\nMusic plays in the background, but not so much that it would disrupt your conversation. The servers are helpful and attentive, offering recommendations and coming toward you immediately at a time of your dire need of refills. \n\nNow the food. I would have loved to try their Schnitzel, but I felt somewhat uncomfortable paying $18 for a schnitzel at a place I've never tried the meals of. So, we went with the Bratwurst ($10) served with sauerkraut and shoestring fries and the Black Forest Burger ($14) with shoestring fries. Needless to say, we had enough fries that day. \n\nTheir servings were generous and meals were delicious. Whatever German butcher they are using for their sausages and grass-fed burgers is none of my business, but please keep using them. \n\nThe burger gets a special shout-out. Pretzel buns are becoming a commodity for burgers nowadays, so I won't rave about that, but their use of ham, emmentaler cheese and caramelized onions made that burger an amalgamation of greatness. \n\nThe bratwurst was also an amazing dinner considering the price and how their spicy mustard works so well with their sausages. Shoestring fries were McDonalds friesesque, which means they were salted, thinly cut, and amazing. I ate them until my mouth felt numb from the sodium content, which I later fixed by drinking a liter of their Hofbräu original. All of their Hofbräus are great options, but go for the Hofbräu Oktoberfest if you are looking to get buzzed sooner.", "author": "Beril E."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-05-28", "description": "My family and I came to the Dance Africa Show and Bazaar on Memorial Day. It was a beautiful day which included 4 children. We searched for place that would be good for kids and this place popped up and was close to BAM. We made a reservation for 6. Got there 5:34pm. We stood at the door for about 3 mins, when my sister decided to go to find someone. The rest of the party waited and a lady came by and said leave this place. The service is awful dont spend your money. OK perhaps she was unhappy but what did that have to do with us. We finally got to sit after the woman told us she didnt have a reservation for us. We waited another 10 mins no one came to use. The only part of this establishment that was working was the bar. The place smelled like a brewery and was not at all kid friendly unless you serving huge glasses of beer. There was no waitstaff at all. It was horrible. So Iwent next door to Lean Pizza Crust because the menu was not for kids at all unless you were born in Germany. By the time I discovered the pizza place someone came over so about 20 mins and asked my group if we were ready. My sister saw me and said no and we all left. 7 people. Shame on them. Please change kid friendly cause it is not at all.", "author": "Valerie C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-06-05", "description": "Food is so-so and service is very off at Black Forest. \n\nBratwurst w/ curry sauce is interesting and I'm not sure if I like it or not, TBH. The curry tastes like sweet and sour sauce with a hint of curry and I felt like the sauce worked much better with the side of fries rather than the sausage itself. Our table also shared an order of jerk chicken which also tasted not-so-jerk-chickenish. Maybe it's a german thing, I DUNNO. Fish sandwich was huge, but very bland. \n\nService - Weird. People that work here are nice but all seem to be in a daze. There were 4 of us, but the waitress acted as if there were only 3. Took the orders for 3 of us and almost walked away til we stopped her.. because.. hello? There was literally one person who was waiting to order. Gave us three empty plates for our apps when again, there were 4 of us. Same goes for utensils. Our apple pie took them close to half an hour and her \"3 more minutes\" actually meant \"20 more minutes\".", "author": "Kitty W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-30", "description": "This place came highly recommended, so decided to check it out before a concert at the Barclays center. Sat at the bar and looked through the beer selections. Pretty mixed options, but I'm more of an IPA drinker than German beer. Gave the original a try, the smallest option they had was still a big portion.\n\nThe menu is awesome. The different types of meats and German options make this place feel totally authentic. We decided on the potato latkes and the spicy pork served with French fries. The place was packed, but we didn't wait long at all for the food. They give you a mix of sauces from plain ketchup to different mustards. All were delish.\n\nNothing was left on our plates, and nothing was left in our glasses. All in all a great job for a great Brooklyn spot.", "author": "Hilary R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-04", "description": "Remember that Katy Perry song, \"Hot n Cold\"?\n..\n'Cause you're hot then you're cold\nYou're yes then you're no\nYou're in and you're out\n..\n\nThis song epitomizes the place. Every time we come here we receive mixed service. The last time we came here, we were standing like we were waiting for the G train to come into the station, before they put in those arrival notification systems. Sure, the bartender saw us in the corner of his beady eyes, but no follow through.\n\nSome random murmuring occurred and is likely what other people would have thought:\n- Are we supposed to seat ourselves?\n- Hmmph.. let's seat ourselves somewhere else.\n- Oh maybe they're busy. Let's give them X more seconds/minutes.\n- I'm just going to grab my own seat.. [5 minute elapses] Who's our server?\n\nSo eventually we do get seated, as if the place is packed. The place does have a chill scene, with the occasional baby and adult entourage. However, I get the impression that there's only one chef and all the other staff don't care or are way over their heads.\n\nI will say that even though the food and beer are way overpriced, as with almost all German restaurants, it usually comes out as pretty good fare.\n\n-1 for the service (or lack thereof/inconsistency)\n-1 for the pricey food and beer", "author": "Daniel C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-03-09", "description": "Horrendous service.\n\nIt's 2019, how does your reservations system go down on Saturday night and you don't have a way to tell the customers ahead of time? Then when you arrive they just allow crowd of people gather at the door... no one at the front door to organize and take down names.. Just okay with chaos.", "author": "Mai J."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-05-11", "description": "I ordered the Black Forest burger. It was okay, not spectacular. The giant pretzel was on the dry side but the sweet mustard made it good. The jerk wings were on the greasy side but had a good flavor. Overall, it was 3/5 stars. We sat outside where the seating was crowded.", "author": "Sarah F."}], "servesCuisine": "German", "priceRange": "$11-30", "name": "Black Forest Brooklyn", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "733 Fulton St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/SeINe6YLs2K5rJB8tUD8rg/ls.jpg", "@type": "Restaurant", "telephone": "+17189350300"}