{"aggregateRating": {"reviewCount": 364, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-11-21", "description": "I had something called flammkuchen , but it was not flammkuchen ! NO! big huge pieces of American bacon are not supposed to be used. The crust was dry like a cracker! The cheese was slapped on haphazardly and had no taste!  It was bad and expensive! Add to this crappy service from a snotty little waitress and you get a big thumbs down from me!  shize, mein got!", "author": "fred s."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-25", "description": "Nice cozy place! I had a grapefruit flavored beer and it was delish. Also pretzels with mustard are out of this world!", "author": "Xenia M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-05", "description": "Had great beers and pretzels here, while sitting outside and enjoying a summer day. Would totally go back when the weather gets warm again!", "author": "Emily H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-31", "description": "Unbelievable brunch. Happy and pleasant waitresses and bartenders from Germany. Good prices. I can't believe this place didn't show up when I googled \"brunch\". Plenty of space too with room for large parties not to mention the incredible beer selection.", "author": "Joe L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-11", "description": "Braved the weather yesterday and decided to stop by this gem and check it out. I am nowhere near familiar with German beers and so I was curious. \n\nIt was me and two other people, the place was almost empty (omg this place is HUGE), with the exception of 2-4 tables. Our bartenders were both Lee and Matt - they were fucking awesome (can I curse on YELP?) ! Their service was perfect, both were divided their time with us with great conversation and were very attentive. They introduced me to three different kinds of beer. The first one was the lightest beer on draft (which I cant pronounce to save my life or yours). The second one was a beer a darker beer that had hints of banana and raspberry. It was totally delicious. I normally don't go for dark beers but im glad I was converted in this moment. The third beer was the winner - a grapefruit, soda-tasting beer. I hate grapefruit, but the presence in this drink wasn't overwhelming and the other flavors helped.. It was very good. \n\nI would definitely return for sure! Hope to see the coolest bartenders there again!", "author": "Wesleyan T."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-09-16", "description": "This place is indicative of what fort greene and I suppose what most of brooklyn has become: folks with funny mustaches and strollers. Yes, there were kids in a bar ordering top shelf grilled cheese sandwiches, ha.\n\nMusic was way too loud and our server disappeared and had to be flagged down several times. I was with a rather large party so when he did finally come by, he would shout over us: DOES ANYONE NEED ANYTHING ELSE BEFORE I WALK AWAYYYYY!!!!????? Super rude and obnoxious.\n\nI had the apple crumble cake which was really just some \"artisanal\" apple pie and coffee that had a bitter/sour taste. Meh. The French fries were good though, so I'll give a point for that.\n\nOh, Brooklyn. How I miss thee.", "author": "Vit C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-18", "description": "Really enjoyed the food, drinks, and atmosphere of this place!\n\nGreat for a gathering with friends or coworkers. \n\nDoes get a little noisy and crowded.\n\nWould definitely go back.", "author": "Calista Y."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-07", "description": "Extremely friendly bartenders, always plenty of seats, clean bathrooms, excellent fries, and many vegetarian options (both healthy and.... okay, I had german latkes). The flatbread pizza looked delicious -- I'll be back for it. Go across to Greenlight bookstore when you're full and maybe tipsy.", "author": "Jesse F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-05-23", "description": "The beer and food at Black Forest are great. But the speed of service is definitely not. While the servers and bartenders are super nice, they're not fast, even with fancy tablets to take orders with while walking around the room. \n\nI went with a medium-size group of six people over the weekend, at not the busiest time (about 9:30 or 10:00 pm), and it took well over ten minutes to get a round of beers. It wasn't like we were waiting for fancy cocktails to be mixed -- it was a handful of beer taps that had to be pulled. And the room wasn't full, and neither was the bar understaffed. It was weird.\n\nBut again, the beers themselves are great, and the wurst selection is too. Worth a trip but not if you're feeling impatient!", "author": "Jennifer L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-04", "description": "Shocked this place doesn't have higher reviews. \n\nFantastic food with huge portions - I've been for brunch and dinner several times. This is a local go-to for me, and I've brought out of town friends here and they all love it. Great for both big and small groups, any time of day. \n\nPrices are fantastic too for quality and portions.\n\nChicken schnitzel (comes with eggs for brunch... yum), spaetzle, chicken wurst, mushroom flammkuchen, and pumpkin/cauliflower flammkuchen are all delicious. Dressing on house salad is delicious, and shoe string fries are not too salty or greasy.\n\nWide selection of alcoholic and non-alcoholic beverages.\n\nWait staff can sometimes be a little cold, though. I've been a few times and have seen 3 waiters - one was fantastic the one time I saw him, one who I've had a few times was a bit cold one time but very friendly the other, and the other was cold the one time I saw him.\n\nWait time for food is decent - not too slow, not too fast. Worth it for the quality of food. \n\nGreat seating and atmosphere - open, lots of light, and great look and feel overall.\n\nI've never had their delivery but I'm sure it's great...", "author": "Fareed K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-13", "description": "Another good German addition in the area. Superb selection of beers on tap, as well as food options.\n\nFew evenings ago I had drinks and bites with some friends and we had a blast! \nIt was a Friday evening and our server was quick, responsive, and really nice.\n\nBeers are a bit expensive ($8-10), but food is relatively cheap. We shared a delicious wiener schnitzel with fries, and fried mushroom.", "author": "Martina C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-15", "description": "I came here before heading to Barclays for a Nets game. I wish I lived in Brooklyn and could make this my regular place.\n\nThe atmosphere is very casual and laid-back. On a Sunday afternoon, there were plenty of families (babies in tow).\n\nI split the 13 flights of beer with two friends. It's definitely fun to try out all the different beer on tap. 2-3 taps were out when I went so a couple were duplicated. But to make up for it, received an extra flight.", "author": "Carol H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-31", "description": "Great friendly spot. Perfect selection of German Beer and reasonably priced to boot. \nVery relaxing", "author": "Dwayne M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-12", "description": "Came here based on a recommendation and was blown away. I ordered a flat bread (gluten free dough available) with truffle mushrooms and caramelized onions. The flatbread was HUGE and could easily be shared between two people. The atmosphere is cool and trendy and there were a few families here. Definitely a place to grab some awesome food and drinks.", "author": "Kristin G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-12-05", "description": "The owners of this establishment, Ayana and Tobias, are extremely nice people. The food and beer selection at this establishment are great. Unfortunately, the service here is some of the worst I have ever experienced. Quite a few times I have been here only to have a server be rude and disinterested in serving me or not interested in answering my questions about the menu. Its a shame that such a great establishment has such a poorly trained staff. Not recommended!", "author": "Paul F."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-12-01", "description": "I ordered kale thinking I couldn't go wrong but wrong! The kale was so spicy it burned my throat. My friend's mouth was so burned it blistered. The manager was generally unhelpful and unnecessarily rude to our waiter.  Besides the kale the food was meh.\nNot overpriced so that's good.", "author": "Marius C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-05", "description": "This was a great place to visit between a matinee performance and an evening performance at BAM's Harvey Theater. The menu provided a good number of items to choose from and the atmosphere was excellent - noisy, but that was part of the beer hall atmosphere. I ordered the pork loin schnitzel with sauerkraut and kale and it was very, very good.\nThe service was excellent and helpful.\nIt was perfect for the time and we will visit again when we are in Brooklyn. Next time I will get one of those gigantic beers!", "author": "Kevin K."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-12-09", "description": "Got take out from this place when it was not very busy. It took someone 10 minutes to take  my order and an additional 30 for my food to come out. \n\nOrder was taken down incorrectly and when I called to address it I was told by two different people that I was wrong.\n\nHad to give it two stars because the bratwurst was great, but not great enough for the price and service.", "author": "Abby A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-08-05", "description": "As we traversed around Brooklyn we wanted to find a beer garden to post up and have a large beer to help enjoy a hot Saturday afternoon. We popped into Black Forest Brooklyn and although there isn't much outdoor seating, the oversized skylights helped make the bar feel very open with the added benefit of air conditioning! \n\nThough the beer was quite tasty and the selection numerous, the wait staff was almost impossible to flag down and was very cold when we asked questions and placed our order.... Not to mention the beer was pretty expensive! Maybe I'm used to DC prices? (hah who am I kidding DC is still bad!)\n\nI think  I was a bit caught off guard at how many families their were at the establishment also. Lots of babies! That is in NO way a reason for my 3 star review, but I don't think I was ready for how family friendly the establishment was when I was drinking a liter of beer... If you are desperately wanting some good German beer and a place to post up with the fam, this is an excellent spot. However, if you want a more rowdy and young crowd I would suggest making the trek to Radegast!", "author": "Liz F."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-11-02", "description": "The kitchen at BFB has steeply dropped in quality since the opening. Now I do not want to order food at all.\n\nI had a \"Wienerschnitzel\" that was prepared without care, and had little to do with a real Wienerschnitzel. I was disappointed because when Black Forest opened, the food was remarkably good and authentic.\n\nI had \"Spaetzle\" (a dish I know well in its authentic form) that was a sopping pile of starch.\n\nI recently ordered potato \"latkes\" that were greasy, sad lumps. I refused them and was not charged.\n\nI have always liked the salads -- my small salad with the latkes was good.\n\nWhoever is in the kitchen is not qualified to prepare this menu. Food not recommended.", "author": "Marie D."}], "servesCuisine": "German", "priceRange": "$11-30", "name": "Black Forest Brooklyn", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "733 Fulton St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/SeINe6YLs2K5rJB8tUD8rg/ls.jpg", "@type": "Restaurant", "telephone": "+17189350300"}