{"aggregateRating": {"reviewCount": 364, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-20", "description": "Superb food, gorgeous space, lovely staff.  I would go here every weekend if I lived closer.  =)", "author": "C T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-08", "description": "Great cuisine, great beer, but the service can be show when things get busy. Always leave satisfied though!", "author": "Jason W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-05", "description": "I've been a regular at a different German restaurant for years. But this is closer and I thought I'd give it a try.\n\nThe menu is a good, honest cross section of the regional cuisine of the Black Forest. Execution is very good, I loved the Käsespätzle. The Flammkuchen is great and something you don't see very often.\n\nService is quick and efficient (no doubt in part due to their wireless ordering system).\nThe three times I've been there, all the servers knew how to pronounce the admittedly tricky German menu items.\n\nThey do have my hometown beer, which earns the fifth star in my book. I will be here more often.", "author": "Martin F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-11", "description": "I went back. Time heals all wounds I guess. The waitress was very nice and the food was very good. Good lunch. Nice space. Nice service. Good food. Thanks for the better time.", "author": "Andrew J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-10", "description": "One of our favorite places in the neighborhood. Great food and great beer. Very relaxed and friendly. Good for kids. They even deliver, beer and all!", "author": "Jesse N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-12", "description": "Great addition to the area. Will be showing the World Cup, good German beer and food is fine.  Comfortable with outdoor seating.  I go regularly.", "author": "Patrick L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-01-01", "description": "This is the about the sixth time i have been to this establishment. For drinks at the bar this place is fine, though the bar tenders tend to ignore you despite the fact you are sitting in front of them.  This was the fourth time i have been here for food , all times requiring a hefty wait for our food but hey there's lots of good beer to be had, right?.. Well that's if you can get served in a timely way.    This time around we waited 40 minutes before getting our drinks even (and to that only two of three of us got our drinks)  and we never saw our food so we left about 5 mins after that. The waiter did not seem to be willing to check on our food or give us any kind of estimate as to when it might be ready. Don't  come here if you actually want to be served food or drink.  also just a heads up.. if you don't want to dine with hundreds of kids running around you this may also not be the place for you during the day.", "author": "A Y."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-23", "description": "Friendly service, nice beer selection, the sausage sampler was nicely cooked \u0026 prepared. Awesome fantabulous sauerkraut. I was thrilled to try the battered mushrooms, but they were really soggy. Maybe the oil wasn't hot enough? Overall. had a great time \u0026 look forward to going back \u0026 trying those mushrooms again - must have been a one-off because everything else was lovely. :)", "author": "C H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-09-26", "description": "good selection of beers, great authentic sizes (try a boot!), and a pretty legit selection of wursts, brats, and schnitzels on their menu. friendly staff, friendly people, decent size with seating options, but it does get crowded quickly, especially during the summer and whenever a game is on.", "author": "Dianne R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-08-18", "description": "This place is terrible .. 1. Loud noise felt like I was at a concert can't have a conversation because of the volume 2. Asked for mushroom on my entree told they can't accommodate and the rude waiter just pointed at the bottom of the menu where it says no substitutions to the menu items 3. My friend received the wrong mustard and asked same waiter to bring the correct condiment and he got the same mustard again 4. Diet coke was filled to the top with ice maybe a few sips of actual soft drink 5. Waiter was indifferent and attitude was like we were doing him a favor by being there he appeared annoyed by everything even a request for a refill .. Asked him for a to go bag he gave me a box I had to ask him again for a bag and he finally found the time to get me one 6. Restroom had dishwasher detergent instead of hand soap (says right on the dispenser dishwash) 7. Food was actually pretty good but the service was minus 5 stars and I can't believe they couldn't add mushrooms .. when asked to speak to the owner/ manager our waiter told us there were none at the restaurant at that time .. What a joke I'll never return and will discourage anybody from going here .. This is the only restaurant review I have made on yelp and for my lazy butt to take the time to write this should speak volumes to just how bad this place is., I would give it negative stars if possible", "author": "Paul A."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-05-10", "description": "Decent food completely overshadowed by bad service. Staff was short on menus and impossible to wave down. Had to get up from the meal no less than 3 times to chase down waiter and ask for things like water. Not coming back.", "author": "Blair S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-24", "description": "We've been here a few times with friends. It can be a little tricky to find a seat sometimes (on weekend nights or if there's an event at BAM) but it's worth the effort. The food is good (traditional German fare, try the schnitzel) and the beer list is pretty solid too. Servers are nice if a bit overtaxed at times. I actually reached out to the owners about a casual wedding reception. We ended up eloping but the owner, Tobias, was very nice and helpful even though they are not currently holding private events that shut down the restaurant. You could probably do smaller groups easily though. Altogether, a great addition to the Fort Greene dining/bar scene.", "author": "Elizabeth M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-25", "description": "Great place to watch the World Cup!  And especially if you're a Germany fan. The place was standing room only during the Germany v. Portugal game which happened at noon on a Monday.  I've come here twice now to watch the games as well as another time in the evening for dinner and drinks.  I like the picnic bench style seating that creates for a communal atmosphere and encourages strangers to chat and be friendly with each other.  I'm a vegetarian so there aren't too many options for me here, but I'm not complaining.  I understand that German cuisine is meat heavy.  The vegetarian options they do have are quite good.  The salad is a variety of greens and potato salad that is fresh and tasty.  The cheese sandwich is good although a bit small and could use a few more toppings.  The shoe string French fries are crispy and delicious.  My meat eating friends enjoyed the sausages very much.  There are some great German beers offered on the menu, which you can get in enormous quantities.  I have yet to order a beer in a boot but I look forward to doing so in the future.  The waitstaff is very friendly although a bit slow at times.  It looks like they could use more staff on busy nights.  The food and the beers are also slightly more pricey than they need to be.  Nevertheless, I highly recommend this place and look forward to coming back to watch more World Cup soccer!", "author": "Logan P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-10-03", "description": "My wife did not like her dish and informed the waitress  of it after taking a bite.  The waitress asked if she would like to order something else but did not agree to substitute the first dish.   My dish was blah.", "author": "Shaike A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-08", "description": "Amazing brunch served daily. They have wifi and heaps of space. This is a great place to eat, drink and hang out but also do work during weekdays. Way more comfy and way more room than a cafe and their coffee is equally as good. Service couldn't be more lovely. Good neighborhood find.", "author": "Lauren J."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-09-26", "description": "The food and beer selection are nice. We like the ambiance--it's open and light--and it's great that it's kid friendly so we can bring our baby with no problem. The main issue with this restaurant is the waitstaff. They are always very nice just very slow and a bit incompetent unfortunately....the last two times we've gone there we waited forever just to get menus, then it took at least 10-15 min to get our drinks and had to ask for them or go up to the bar ourselves. They have also gotten drink orders wrong a few times too. I know it gets pretty busy at times, but I think maybe need a few more people working and ones that can get the orders out in an efficient manner.", "author": "Emily M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-11-24", "description": "I would give them a 3 star review but because this is a \"beer\" garden I can't help but complain that their beer tastes flat and dirty. They need to spend more attention on making sure their beer is up to standards. Their food could be more authentic too.", "author": "Seth M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-12-20", "description": "The bar has a strange atmosphere... But you can buy strong German beers served in a boot, Oktoberfest style.", "author": "Jack L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-07", "description": "Really tasty food here, especially the flammkuchen (pumpkin kale one!)  Every beer you could ever want.  Super efficient ordering system/wait staff.  Ample indoor and outdoor seating (plenty of customers always there, but being handled well).", "author": "Meg W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-21", "description": "love! love! love!! Hubby found this place during a visit to my Bro's house- place was fantastic! Hubby loved the Brats! Our new go to place when we are in town...", "author": "Mari B."}], "servesCuisine": "German", "priceRange": "$11-30", "name": "Black Forest Brooklyn", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "733 Fulton St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/SeINe6YLs2K5rJB8tUD8rg/ls.jpg", "@type": "Restaurant", "telephone": "+17189350300"}