{"aggregateRating": {"reviewCount": 364, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-10-27", "description": "We got sat in 3 minutes. Awesome! Ordered food and beer. Waited 45 minutes to get a beer. Still didn't get the beer. Got up to leave and waitress asked if we wanted to close out our tab... made sense because she had not been paying attention to us. But we didn't even get any food... terrible service. Awful. Would not recommend.", "author": "Joey P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-28", "description": "Opentable res for 12 made with my card and all. Upon arrival, we were \"reserved\" the horseshoe area by the window, but we picked a bench by the wall instead. We came to eat AND drink. Luckily it was a windy Monday night. \n\nThe waiter immediately greeted us with carafes of water and (votive) glasses?  Ordering happens on a tablet which was pretty spot on for us. \n\nWe started with some pretzels which were just ok to me but the two different mustards (spicy and not) were unique.  The beer battered mushrooms with aioli - get them!  The flatbread, although they only had gluten free dough, none of us could tell the diff. The mushroom and vegetarian ones are both delish!  Got the spätzle (pasta) without bacon which prob made it a little less flavorful but the texture was still comforting as always. Never had it ribbon like before, just had it bite size. You couldn't really taste the cheese.  Sparkling apple juice was good, not too sweet. Everyone else enjoyed their beers and wine. Service was attentive and quick!", "author": "Thy L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-06", "description": "Excellent food.  I had the weisswurst, my wife had the goulash with spaetzle.  Both were excellent.  Likewise the kale and apple salad.  Then we shared a flourless chocolate cake.  It was superb!  Most restaurants cheat and it doesn't melt on the tongue like it should, and like it does at the Black Forest!\n\nA bit loud, very popular, kid friendly.  Love this place.", "author": "Thomas B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-24", "description": "Good place to meet with a group as there are several large tables. Food is okay. Beer is okay. Service is okay. There's nothing particularly remarkable about this place, but nothing particular bad. It's not a crowded beer garden, that's for sure. That makes it a pretty solid place to go for beers, IMHO", "author": "Audrey W."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-10-08", "description": "Food was adequate, but very disappointed in the service.  After waiting a long time for our food when the place was slow, the waitress dropped some of our food. Understandable, but we waited another half hour and their food never came. We were polite and patient. After waiting even longer we had to get to the Barclay Center we had to ask for them to remove the meals we never received off the bill. They did, but did not offer us any additional discount. Half of our party did not eat, we were there for almost 2 hours, I asked for them to give us something-they removed 2 sodas. Very poor customer service. Additionally, we had questions about the meals and the waiter had zero knowledge of the menu or food preparation.", "author": "Eileen E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-25", "description": "The place gets really busy during peak times but a good drinking spot in the area. \n\nThe giant pretzel is perfect when you want to soak up all that alcohol in your belly. \n\nHappy hour specials: $5 Hofbrau Original, Dunkel \u0026 Seasonal beers. $3 off on cocktails.", "author": "Jade B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-05", "description": "Very comforting atmosphere, both through decor, lighting, and excellent choice of music ( which isn't too loud). \n\nThis establishment of course has a great selection of alcohol, especially beer and of course not to mention excellent German food. Staff is friendly and attentive. My friend ordered the grapefruit flavored beer which I tried and was delicious. I don't really drink beer too often but I definitely would have ordered that! However, I ordered a hot totty which was very good- soothing and sweet with a slight kick.  We shared a pretzel ( smaller size) which came out hot, perfectly doughy and delicious! The mustard had a great spicy flavor as well. \n\nI was happy my friend decided to share this gem with me!", "author": "Lizzy K."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-10-06", "description": "I can see why some people go here, it is kid friendly and it is in Brooklyn.  That being said, this place was not very good.  We took our 2 year old kid with us, so it was nice to see that there were other kids there.  But the service was slow and our waiter did not seem to know anything about the food.  Also, somehow this German beer hall did not have any Oktoberfest beers, although I can look past that given that they had a pretty good beer menu.  However, my first beer (Hafbrau lager) came warm.  I couldnt drink it so I had to return it, the next one was cold enough, but it was very odd.  I got the chicken shnitzel, which I actually enjoyed, however the mashed potatoes (which the clueless server recomended) were not very good.  My wife's spaetzle was bad.  Not sure if we will be back, because too many things were unsatisfactory (especially for the prices), but there are not a ton of places as kid friendly as this, so we might give it another try at some point.", "author": "Rakesh M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-04-01", "description": "This was our second trip to Black Forest Brooklyn. We happened upon here once during an even at Barclays and liked it so we thought we'd go back for a birthday dinner. First time was great, maybe we had too much to drink, Second time wasn't nearly as good. It wasn't overly crowded and we got seated right away but it took a while for the waitress to get to us.\n\nWe order our drinks; a beer, 2 sodas and a cider, and 4 Wurst Plates. Waitress comes back they are out of both ciders on the menu, and they are out of curry wurst, and curry sauce. Ok, order an overpriced $12  mixed drink instead (not by choice I am gluten free, so no beer for me). Drinks arrive with no ice in the soda (?). Now we know the 4 wurst platter is a lot of food and we knew that we'd be taking some home (that was part of the plan) yet when our food came, there was only one platter... Ok, start sharing while we wait for the other 3, but that was it. So we go find the waitress and correct the order, somehow she thought we ordered just one for the 4 of us. More than 20 minutes later and the first wurst platter is gone, the rest of our food arrives, and we have a new waitress. They are out of curry sauce but they made us some other spicy sauce that is \"better\" than the curry sauce. It was some hot pepper sugary sauce that I've never had before in my life (my family is from Germany and I've been to Germany btw) that burned our mouths so no thanks (we didn't complain we just didn't eat it). The potatoes on 2 of the platters were literally cold as if they forgot to hear them up so we had to send them back. We finally got them back about 10 minutes later with some curry sauce they whipped up for us. It took a long time for this dinner, we were there about 90 minutes.\n\nWhile we appreciated the gesture of the curry sauce since that was one of our main reasons for coming back, the major mistake on our order along with being out of multiple menu items, and the cold potatoes... it was just a hot mess, and they knew it. When we got our $170 check we saw that they charge $3 for a coke (typical for NYC) AND charge for refills. A good customer service gesture would have been to take off the sodas, or take off the refills, or take off one of the beers, or offer a dessert, or even offer an apology. Something- ANYTHING. With so many options in NYC and this being out of our way, we most likely won't be back.\n\nTips- Many items are heavy on garlic. If you don't like garlic be sure to read the menu well and ask for substitutions. As expected, parking is scarce. If you use a garage and there happens to be an event at Barclays, you will be charged $35 even if for just an hour.", "author": "Suzie B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-02", "description": "I really enjoyed this place.  Our waitress Janina was really sweet and attentive.  She recommended the black forest schnopps, which had a nice warming effect after the meal:. The food was pretty good, and the overall effect was great.  Definitely come eat at this place.", "author": "Ephraim W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-11", "description": "This was an excellent \"point n pick\" spot in a very trendy Ft. Greene neighborhood. While waiting for a colleague I had a very cozy hot chocolate while listening to an eclectic blue eyed soul, funk, and R \u0026 B playlist. The vibe is light and it proved to be a perfect Sunday brunch experience. The menu is hearty and cultured. I would have pics but it was so good I ate it. I had the sausage biscuits and gravy. Yum!  There is also a boozy brunch option. The service was attentive. This is a great spot for a day date, meeting chums, or self care alone time.", "author": "Sonya N."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-02-01", "description": "I rarely bother with reviews but there were so many glaring customer service issues, I felt I had to write. Food was fine, not amazing but good enough. I arrived late afternoon but it was not empty. Sat at a place on the bar that was recently vacated. 6 empty glasses in front of me were never moved, even after menu was dropped off. I eventually pushed them aside. An hour later and they still sit there. After 10-15 min they took my order. Bartender was inattentive, gossiping with waitress about drunken nights. At one point the bartender yells across the room at a patron at a table (drink and food finished). When the patron didn't hear, bartender shrugged and went back to his phone. 20 minuted later the patron got up and asked for his check. The whole experience was like this. Really terrible experience. No professionalism. Needs a manager keeping things in line.", "author": "Karen P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-11", "description": "Obsessed with this place - food on the brunch menu is always incredible and I've been happy enough with my service. Always get seated quickly and very much enjoy my time there - wether in big groups or just a date.", "author": "Lauren C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-12-03", "description": "Sat there for soft opening for 13 minutes until someone finally came over.  The person who cane over during the time we were waiting was busy with other servers.   We left.  Don't want to support bad service when there are so many other options in Brooklyn.", "author": "Robert P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-10", "description": "We had been to this place once before at night and it was great, so we thought it would be the perfect place to go after graduation at Barclay's for lunch. Our waitress just looked confused and lost they entire service. It was one thing after another. They were out of a few things, which ok it happens, but the communicating of it and explaining what they were out of so we order something else that they also weren't out of was painful. Then the bratwurst came out with no mustard or sauerkraut, just the meat on the bun. We had to ask for it and even then \"oh yeah it's supposed to come with that.\" Then we were still waiting on something and she came over and asked how everything was and we had to remind her we were still waiting on stuff. On top of all that the soup that came with the sandwich was bland and I know why would you order that with your sandwich well it's lunch and if you are going to do something do it right or don't put it on the menu.  The brat was good, chicken wings dry. \n\nIf you want beer, soft pretzels and brats you may be ok, but service was horrible and there are plenty of places in the zip code with great beer, pretzels brat AND service.", "author": "Nicole A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-14", "description": "You know, I rarely find myself trying out a new spot, liking it THAT much and itching to return as soon as possible. So as you can tell, I had a really fantastic experience at Black Forest Brooklyn and can't wait to go back. When you combine tons of craft brews, excellent pub style food and a really bright, warm atmosphere... what's not to love?\n\nThis place is huge! BFB is somewhat divided into two sides. One side consists of the large picnic tables which are perfect for after-work happy hours, parties or just really large groups. It has that communal, casual feel which makes for a great space for socializing. On the other side are the smaller tables of 2 or 4, as well as the bar (with ample seating). The inside is BEAUTIFULLY decorated- antique German clocks, artwork, high ceilings with vintage bulbs. We arrived about 6pm and got a seat right away despite there being a decent crowd.\n\nThe first thing I noticed: the vast selection of German beers. Aside from, Weihenstephan Hefe Weissbier, my knowledge of German brands are limited. Our waitress was extremely helpful and let me taste a few. Ultimately I settled on the Riegele Kellerbier which was smooth, light... and one of my new favorites. \n\nI think it's pretty safe to say if you're going to a bier garden or German eatery, you must order a warm pretzel. Their Riesenbrezel was not only bigger than my head, but delicious. It has just enough crisp on the outside, soft/dough-y on the inside and with the perfect amount of salt. Wonderful for sharing! For dinner, I ordered the Bratwurst which came with a warm kaiser bun, apple cider sauerkraut and shoestring fries. I loved it. To be honest, I'm not the biggest fan of sauerkraut, but it just worked wonderfully with the German sausage. All in all, my meal was spot on and I happily ate the entire thing. (No regrets.)\n\nIt's safe to say I will 100% be back. Possibly next week even. We had a pleasant experience with the staff and the food exceeded all my expectations. PROST!", "author": "Katie H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-09", "description": "Love this place. Great food, great beer, spacious to accommodate large parties! \nI highly recommend their bratwurst, flatbreads, schnitzels!", "author": "Haena Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-25", "description": "This place is very addictive I came here just out of curiosity, and I'm very glad I did. My wife had the Jamaican Jerk Jumbo wings, I had the Forelle Mullerin Art (rainbow trout) this was amazing. The flatbreads are fabulous, and you gotta do a Riesenbrezl. Finally since I don't eat meat I highly recommend the vegan Brat\n\nCheers", "author": "Shawn W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-04-16", "description": "This place is a paradox. The food is good. Drinks are good. Decor works. Outside seating is a win. Service sucks. I've been here several times and mostly have scratched my head at the service. \n\nMy most recent visit is an example: A solo early brunch. I walk in to a semi-empty restaurant, stand at door waiting to be greeted, as is customary. About 3 people acknowledge me but no one asks to seat me. When someone does she says I can sit anywhere. Thanks! But why take so long to say so? \n\nMy cup of coffee runs out and instead of asking if I want more, they simply take The empty cup away. No one asks if I want anything else. Thanks!\n\nMy glass of mimosa is almost empty but no one is asking if I want more, anything else...\n\nSo I don't get this place. I'd actually like to order a beer before I bounce but wonder if that'll ever happen. \n\nGet your service right Black Forest and pay attention to your costumers! Thanks!", "author": "Jamiyla C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-31", "description": "Delicious low key brunch. Great seating, service and food, what more could you ask for?", "author": "Roxanna P."}], "servesCuisine": "German", "priceRange": "$11-30", "name": "Black Forest Brooklyn", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "733 Fulton St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/SeINe6YLs2K5rJB8tUD8rg/ls.jpg", "@type": "Restaurant", "telephone": "+17189350300"}