{"aggregateRating": {"reviewCount": 364, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-04-22", "description": "We made a reservation on Open Table. It was pretty packed when we got there, but they didn't ask for my name  and sat us immediately at a shared table. This was fine with us being that we were trying to get to the Islanders game early. Unfortunately, it took over 20 minutes to get our waiter to come over - and this was after several attempts to get his attention and asking 3 different employees to have him come by. Our food came, it was okay, but certainly nothing to write home about. One of my friends and I both got the jagerschnitzel - they give you 2 cutlets, but only a tiny ramekin of the mushroom sauce. Our waiter never stopped by to see if we needed anything, but when he was in the vicinity we asked him to bring the check. After 15 minutes of trying to get his attention again, finally my wife walked up to him and gave him her credit card so we could get out of there. Thankfully we were able to get to our seats for the Islander game just before puck drop.", "author": "Tony S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-06", "description": "Fun, lively restaurant with tasty beer and sausages. \n\nOnly downside: impossibly loud when it's busy. The first time I came it was quieter and really fun. The second time I could barely hear my husband across the table. \n\nProbably will only go back on more off-peak times.", "author": "Katie O."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-19", "description": "Hearty German food in a friendly restaurant. Good service and good beer. What more do you want?", "author": "Karl B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-05-20", "description": "I wish giving no stars was an option. This place is the worst. Attempted to have lunch here with friends. Everything we ordered from drinks to entrees was 86d. After ordering for the third time with no availability my friends and I began to wonder out loud who does their ordering. The owner, who was apparently seated near to us, overheard and had our server offer us a free round of drinks that never actually came. Our server left halfway through the ordeal causing another server to approach the table to \"collect payment\" for food we had never received. Needless to say I will not be going back, and I suggest if time and service are of importance to you that you dine elsewhere.", "author": "Adrienne S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-04-26", "description": "I want to like this place and the food is good, but I've been a couple times now, about a month apart, and as others have said the service is still really lacking.  The first time I chalked it up to just having opened, but at this point I feel they should have worked out the big kinks.\n\nBoth times I've been it's taken a REALLY long time to get menus, drinks, get our food after we've ordered, etc.  Also both times the wait staff kept forgetting things like water that we'd asked for.  They haven't been huge mistakes, but there have been a few of them each time and it got to be annoying.  Seems like they just don't have enough wait staff to go around.\n\nIf they can improve the service it will be a big improvement.  The space is lovely and well done, the atmosphere is great, there's a lot of potential.  I'm not really a beer drinker so I can't comment on that, unfortunately.", "author": "Florecita M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-07-18", "description": "The food and atmosphere here are great, but holy cow service sucked today! Sat outside and got my lunch before drink order. Five minutes later I was able to ask for napkin and silverware. People next to me waiting at least five minutes to have their c/c ran and returned. Great place, but really failed today and the last time I was here for service.", "author": "Randi B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-01", "description": "Local beer garden with good food and great beer options. Folks are friendly and it's always got people hanging out!", "author": "Vasudha G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-17", "description": "I've lived in neighborhood more than ten years- this is my new fav place.  Everything is yummy and it's kid friendly.", "author": "Jim R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-05", "description": "Good Service even during busy times (World Cup games).\nGreat selection of quality beer and food.\nBrunch menu highlights: BF scramble.\nFull menu: Pizza\nFriendly pro-active staff, diverse easy going Brooklyn clientele.", "author": "Rob T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-15", "description": "Outstanding genuine German cuisine. I grew up in a 100% German household so I know German food and this place blows away most \"German \" restaurants I have eaten in. And in the middle of Brooklyn to boot!!  Highly recommended!", "author": "Steve S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-06-03", "description": "Cool space. Don't get the burger. They will serve it well-done and charred despite any specifications otherwise. Stick to the sausages.", "author": "Ryan B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-14", "description": "Oh holy moly the food here is good! I'm of German descent and I can tell you that this is some outstanding German food. The pretzel was perfection. The beet salad was HUGE and what I would expect to get in a contemporary restaurant in Germany, but the pork Schnitzel was beyond good and very traditional. Probably the best I've ever had and that's quite a lot. You get 2 sides with the Schnitzel and I got the potato salad (German style natch) and sauerkraut. The potato salad was nice and cold and the sauerkraut was piping hot. I saved my mustard from the pretzel so I could layer sauerkraut on the pork and dab mustard on the top. What a great and super filing dinner. I could've eaten half of everything and still been full. However, I was a good girl and cleaned my plate and they had to roll me out the door. Such a shame because I was really looking forward to trying the traditional Black Forest cake, which I assume would've been just as great as everything else. Next time. Next time.", "author": "Amy D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-03-22", "description": "Took my family there after a great experience in a Bierhall in Park Slope.  Couldn't have made worse decision.  While the place and the menu appear to be ok, we never got to try the beer or the food.  After we were given the menus we sat there for well over 20 minutes, and no one took our order or even bothered to inquire what we were doing, sitting in the middle of the place, in plain view of the bartenders and waitresses.  \n\nI know the place was busy.  But so was the other German place virtually across the street (separate review will follow), and there we were make to feel like royalty, whereas when we left the Black Forest we were feeling like peasants.\n \nI will never go this place again, and will strongly discourage others from doing so.  For me service is the primary reason for going out:  I can buy quality beer in a store, and order good food online.  But when I make the effort to go out, I want to be SERVED.  Not made to wait while looking at the menu.  I work very hard at my job, and make sure that my clients get the best service possible.   This place is the antithesis of customer service.  So if you want to wait forever before some BAM wannabe actress  decides to grace you with her presence, by all means go there.  If you want German beer, food and good service,  walk the block down the road.\n\nZero stars for zero customer care", "author": "Thomas K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-01", "description": "This place is so amazing! Food is great, German food is pretty good, but I totally recommend the burger: the patty is so fresh so juicy so tasty yuuuuuumy! And of course, beers menu is very good as well, I love Aventinus! Come here you won't regret!", "author": "Jacob F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-01", "description": "I came here for brunch on a Sunday. It was crowded, but not obnoxiously so, and it's a big enough space to where you don't feel like you're sitting on top of each other. I was very comfortable there. Food and drinks were satisfying (I had schnitzel - it was really good, but nothing to write home about). The waitstaff was super nice and attentive. I LOVE the fact they're paperless! From both a staff and patron standpoint it makes things so much easier.", "author": "Kristina M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-26", "description": "authentic german food, love the schnitzel.", "author": "Thomas S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-10", "description": "Fun place. We walked by here and went in on a fluke. It was about 11 in the morning. We sat at the bar and had a coffee. The server was very friendly and helpful. The place was really cute N will come back for dinner.", "author": "Paula H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-22", "description": "Great vibe with the liveliness, warmth, and modern charm that you would expect from a German pub. I enjoyed the schnitzel, the mixed wurst dish, and the giant pretzel.  The food definitely reminded me of my visit to Germany.   Unfortunately, it took a while to arrive. The waitress was very friendly and refilled our soda for free during the wait.", "author": "Mimi W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-17", "description": "Great place for southwestern German food! Learned that the owner is from Freiburg, an awesome German city where I lived for 6 months and absolutely loved. This place brings me the Freiburger vibe that I've missed, let alone the great food and beer.", "author": "Cyn W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-17", "description": "Came here for a friend's birthday. Had a group of 12 people, had to wait for about 20 minutes which isn't bad for a Friday night. We all ordered from the bar, I went for the Rothaus. Being a fan of nonpasteurized beer, I was hoping it lived up to the hype and standard of other beers in the same category. It did, it was so good I grabbed another 2 liter steins throughout the night. Had the kasebratwurst, though the portion seemed small, I highly recommend it. I'll definitely be back for sure. Host and waiter were both friendly and attentive.", "author": "Bartosz G."}], "servesCuisine": "German", "priceRange": "$11-30", "name": "Black Forest Brooklyn", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "733 Fulton St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/SeINe6YLs2K5rJB8tUD8rg/ls.jpg", "@type": "Restaurant", "telephone": "+17189350300"}