{"aggregateRating": {"reviewCount": 364, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-06", "description": "Soooooooooo pumped!\n\nCame here for the soft opening and my first impression is hot-damn-yes!  In a time of an over-proliferation of pseudo-German beer halls and restaurants, Black Forest Brooklyn puts just the right spin on it.\n\nFriendly staff, good music at the right volume and a gorgeous space means I will be here on the often.  Can't wait to try the food!\n\nWelcome to the 'hood, BFB!", "author": "Kevin F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-30", "description": "Black Forest was a mess. Ten minutes after I arrived, a waitress finally came over to the table.\n\n\"Can I get you a beer?\" she asked. \"We don't have any food right now.\"\n\nThe restaurant had only opened a couple weeks earlier, but I'd read online that some food would available. Was I mistaken?\n\n\"Oh, we have food,\" she said, \"Just not now.\"\n\nOver the course of the next half-hour, it slowly emerged that there had been some sort of kitchen fire, and the fire brigade had to be called before the ovens could be turned on.\n\nI was ravenous after work and not happy about the delay. The wait staff was understandably distracted and appeared infrequently during the outage. They were, however, generally friendly, and made sure the food went through the kitchen once things were back up and ready. \n\nFlammkuchen (also called Tarte flambée) is excellent bar food. Black Forest's version is very filling, especially if you choose one with a meat topping. Between this and the large pretzel, a friend and I were completely full after two beers. \n\nThe atmosphere is nice - there's none of the cavernous roar and mediocre food that plague some other Brooklyn beer halls - and cozy for winter nights. \n\nThe long delay and the confusion probably should have merited a little something comped (nothing like a free beer to mollify an empty stomach) but I was so satisfied by the end of the meal that I'd recommend the place. And besides, the kitchen can't catch on fire every day.", "author": "Jon S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-31", "description": "Black Forest is wonderful! It's one of those places you can sit at all day, beginning with coffee and work in the afternoon and ending with a few beers by evening (or a few beers throughout) when it transforms into a beer hall. My server Kat was wonderful; she knew exactly what happy hour beers were best and what food I was craving. She was very accommodating without being overbearing. I sat there for hours, got lots of work done, and left sufficiently buzzed.", "author": "Michael H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-01-03", "description": "There's a German bar not 200 feet from this location. We stopped going there once we saw a mom change her kid's diaper in front of us while we were eating. BF has change tables in the restrooms, so hopefully you won't see that. Although I wouldn't put it past the manic, entitled Brooklyn mom. But aside from nicer decor and slightly better food, that vibe is very much the Zeitgeist here. If you can't deal with the screaming toddler derby, make like Hansel and Gretel and get lost -- at least until 9pm, when der kinder are (unofficially) verboten. \n\nI'm sure I'll end up here again, since it's irresistibly close to BAM, but IMHO Lederhosen in the village does a $5 brat sandwich with red cabbage and kraut that's way better than the $8 variety here. Also, in BF parlance, \"shoestring fries\" = McDonald's-style.", "author": "Andres J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-19", "description": "Great beer, great food! A large selection of legit German beers with a pretty good cider thrown in. Get the pretzel (large or small) and a wurst plate to share. Great service at the bar, not so great at the tables.", "author": "Savannah E."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-12-01", "description": "Stopped by this spot last night with several friends before a show. Sincerely disappointed! The service was probably the worst I've experienced in NYC. Our waitress was not only inattentive, but extremely rude. She literally grabbed the iPad out of my hands after I paid and walked away without any sort of parting word. The food and beer was delicious, but not worth the bad service!", "author": "Abby D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-01-12", "description": "Walked in late on a Sunday night. I was surprised they opened a second beer garden so close to the other one down the street. \n\nThe decor was a little odd, I think because they painted the chairs and tables the same color as the wall - a tiffany blueish/green. But the setup of the bar and rest of the wooden tables was fine. Spacious inside and felt cozy enough. \n\nThe service was okay and the ambiance wasn't bad - except the music was really odd and very loud - didn't get a  very German beer garden feel but more of a Euro club type feel. \n\nA warm beer arrived at the table and we asked for a cold one, I guess it was left sitting out the server said since the beer was just tapped.  Not a huge deal, she brought us a new beer later.  \n\nMy main frustration with the place was the menu. Who serves schnitzel with shoestring fries??  And a house salad? When asked if we could substitute for mash or anything else, they said no substitutions at all.  The other similar item on the menu came with dumplings but they ran out of it so no luck. The meal wasnt bad but it strayed from the norm and didn't improve the meal, just detracted from it. \n\nOverall, it is great to have a new joint in the neighborhood. The food is acceptable if you don't mind non-authentic. But if you want to go to a real German beer garden then check out Radegast in Williamaburg.", "author": "AY K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-14", "description": "my bf and i stumbled upon this place friday night and devoured 2 bratwursts. we may or may not have been quite intoxicated but we thought they were the best bratwursts we had ever had. SO then we decided to return for dinner saturday night. again - AMAZING. and then on sunday we were like, what should we have for brunch? Back to Black Forest Brooklyn and again, bratwursts - aamazing! I've been to all over Germany and this is as good, if not better!! I'm a fort greene resident so i will DEFINITLEY be coming back all spring and summer!! YAY!!! \n\nPS - great service every time too! food comes super fast.", "author": "Marika S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-04-02", "description": "Very disappointing experience.  Our waitress was nice, but she either seemed too overwhelmed or just couldn't care less. Took over 20 minutes to get our drinks, maybe about 45 for food.   My Brat was overcooked.   My friend ordered a burger rare.  It came out looking a hockey puck.  The waitress never ever came by to check on us, and when we were able to get her attention, and my friend politely explained he could not eat the burger, she basically just stood there and looked at him.  He suggested she please remove the burger from the bill.  She said she would take care of it, but never did.   We grabbed the hostess who did remove it.  Also, we had to clear the table on our own.  We were happy the hostess rectified the situation, but will most likely not be returning because of the experience.", "author": "Jennie B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-09-30", "description": "STRAIGHT UP TRASH. Ordered delivery - one pretzel, a piece of cake and cappuccino. simple enough you'd think. an hour later, the food arrived. the cappuccino was missing, the pretzel looked like it had been sitting in the rain and had the texture of a sponge and the cake was raw. called the restaurant and spoke to someone who promised me a refund WITHOUT KNOWING WHO I was. When i pointed that out to him he was like uh yeah. I asked for a manager but one wasn't available apparently and he could not authorize my refund without one yet somehow when I called seamless a refund for the cappuccino was already authorized :/. The Seamless lady told me the same guy who told me he isn't the manager told her he is the manager. I mean WTF???? This literally has been my worst ordering experience ever. DISGUSTING FOOD AND EVEN MORE DISGUSTING SERVICE.", "author": "Milly M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-12", "description": "Loving the new entrant to the Ft. Greene 'Hood! Black Forest Brooklyn is everything that an indoor German Beer Garden should be: expansive inside, yet feels cozy and warm, filled with large tables for gathering groups and meeting plenty of friends that you may or may not have known before coming in. The interior is impeccably adorned with black forest vintage clocks, and plenty of exposed brick and salvaged wood (you are in Brooklyn of course). Having visited at night the lighting was perfect for the hour, but there are also some huge skylights that I imagine are pretty great during the occasional afternoon day drinking excursion. \n\nAs far as food, there was a limited menu during the first few nights, but what we ordered was excellent: Flammkuchen, some excellent wurst and delicious pretzels. They paired nicely with the assortment of German beers on tap to choose from.  Suffice it to say that I will be returning when the entire food lineup rolls out.", "author": "Andre M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-23", "description": "Their Bottemless Brunch is an amazing deal! We easily got outdoor seating on a beautiful Saturday afternoon (not sure if this holds true on peak summer weekends) and enjoyed bottomless mimosas with our delicious food. Also a great place for drinks/cocktails in the evening. Definitely coming back soon!", "author": "Ali D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-23", "description": "Beer selection rocks\nWursts and pizzas are delicious and reasonable\nHow's this 3.5stars?????", "author": "Anthony A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-13", "description": "- great ambiance, perfect for a date or with friends\n- dark and authentic European feel\n- drinks are on point\n- food was excellent, hearty portions so go hungry\n\nLooking forward to bringing my German mother here! It's one of my new favorite restaurants in the area!!", "author": "Liz C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-05-29", "description": "This place is nice and chill, but for a Wednesday the service is dismal. We came for a birthday and the manager came to tell us that we couldn't eat the cupcakes that we brought (which is fine) so we ordered a cake... which never came until we asked for it again. Then came the food which was fairly standard 'german beer hall style food', however it was a bit unorganized. We kept getting Liter beers sent to our table and other beverages - though we didn't order it. \n\nObviously a bit of a mix up.  It's possible due to us having a large group, but having the beers show up on the bill is a no-no. They fixed it, but perhaps there were other things added onto the bill, since food had german names, we weren't sure exactly what was added additionally.\n\nIt's a german beer hall that probably would work better if you just order everything at the bar and perhaps have numbers so people know where to drop the food off.", "author": "Jimmy H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-25", "description": "Great atmosphere good food very rustic looking with wooden picnic tables exposed brick. Wonderful beer I recommend the grapefruit.", "author": "Januari V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-10", "description": "This place was a pleasant brunch spot surprise. I walked past it with my friend and that this menu looked great. I didn't try the beer or coffee but I will next time.\n\nI had the chicken Schnitzel a la Meyer and it was so filling and delicious. For 2 meals, we paid $30.\n\nThe atmosphere is really nice and homey. You seat yourself at large long tables and other fellow hungry customers are nice and won't give you an evil eye for sitting at their table. Or they might but that's not the restaurants fault ;)", "author": "Hannah A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-12-29", "description": "Expansive inside, with big tables which was nice for our group.\nThe flat breads they have (with a really long German name) are very good, especially the one with the pumpkin, kale and cauliflower. Nice to see a German restaurant with veggie options.\nThe potato latkes were a little too greasy for my liking.\nDecent beer selection, I like their crystal hefeweizen.\nService was lacking, it seemed like our waitress disappeared into the kitchen for extended periods of time. She was friendly though.", "author": "Lena D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-01-10", "description": "Yo, i like to cut to the chase. The food is good the beer is great but this 1 bartender is horrible! Yes, horrible. If you frequent bars then you understand when i say her bar edict is horrible. But the beer is great. Love the Radeberger. Yesssss for German beer.", "author": "Brandon C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-24", "description": "I went with my friend who is a bit of a troll, and the waitress treated him like he was an averagely attractive person, which I thought was really nice - it made his night!", "author": "Ryan S."}], "servesCuisine": "German", "priceRange": "$11-30", "name": "Black Forest Brooklyn", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "733 Fulton St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/SeINe6YLs2K5rJB8tUD8rg/ls.jpg", "@type": "Restaurant", "telephone": "+17189350300"}