{"aggregateRating": {"reviewCount": 364, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-27", "description": "great place with authentic food. I had the Kaesespaetzle, they were fantastic, my friend had the Waldschrat Flammkuchen, which was also great. \n\nI loved the atmosphere and the service was great and very attentive. \n\nonly thing I would criticize  is that my glass of german Pinot Noir was pretty small for a 10$ price tag. other than that I loved it and expect to come here often in the future.", "author": "Nomsa B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-27", "description": "Met up with some friends in the neighborhood on Saturday night.  BF  has great beer (duh, it's a German beer garden) and pretty good food.  The flatbread was different, but delicious.  We also had:\n \nSpatzel with bacon  - which was delicious and sticks to your bones\nChicken sausage - nothing to write home about, but tasty. \n\nI don't really understand why there's another German place that has opened in general vicinity, but it's more casual than Berlyn, which has more of a sit-down-dining experience going on (on top of great cocktails), and more modern than Der Swartzkolner (which is a fun place to drink, but I find the waitstaff rude).", "author": "marisa p."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-25", "description": "I love this place. Their sitting arrangement is pretty interesting. The food is really good. I would definitely go back with friends. Been to this place twice already. If you are looking for a boozy brunch I would recommend this place.", "author": "Anam K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-12", "description": "My band had a video showing here a couple of months back and I said I would Yelp this place but forgot. So when I found their business card and thought back to my experience that night, what came to mind was THE BEST DRINK I EVER HAD IN MY LIFE!!!!! I'm SOOOO not kidding! It was too long now for me to remember the name of this beautiful fruity concoction, but what I do remember is that whatever I was annoyed about was lost in this elixir FOR DA GAAAAAAWDS!!!!!! And the owner of the place was adorable and awesome as were the bartender and the servers. The place is like HUGE HUGE HUGE for NO REASON!!!! So it's big enough to convert into whatever you need for a private event...or an open mic...or a show....I mean it's huge. I can't wait to go back!", "author": "Roslyn C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-01-01", "description": "Tried to go to brunch on New Years day. Went to the place once before and had a great experience. This time was beyond dissapointing. Staff took about 15 min to acknowlege us to be seated mind you the place was not busy whatsoever. But ok its new years day evryone can be slugish. However that set the theme for the rest of the day becaue it took exactly 45 min to get two glasses of orange juice since we were seated and had to call over the waiter who was bringing the orange juices to the wrong table. Sadly enough three other tables were sat and orders taken with drinks on the table before we even got juice. Eventually they took our order and what a surprise i find a hair on my eggs when they finally arrived. Disgusted i returned the plate and asked for the check. What a way to start the new year.", "author": "David K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-12-12", "description": "Staff seemed totally overwhelmed. Kitchen was slow. They got the beer order wrong and the spätzle without onions wrong. Schnitzel was greasy, not light and crispy. But my kids loved it and My wife and I did too. And the schwartzwalder kirschtorte was the real deal and was the best I've had outside Freiburg! Love this place for its authenticity and  Gemütlichkeit! I'm sure they will work out the kinks with the service and kitchen. Good luck and I will be back.", "author": "Thomas B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-15", "description": "My rating is on based on the food. The very delicious food.....\n\nI am a firm believer that a German restaurant is only as good as its potato salad. Black Forest had a fantastic potato salad, tangy and cooled with soft potatoes and the occasional crunch of onion. Does this come with the option to add bacon?? Because that would be amazing, \nMy husband order the goulash and I ordered the jagerschnitzel. Despite the restaurant  having running over Spaetzal, (which it was supposed to come with) and being substituted for mashed potatoes, we were both pleased with our tasty and enormous portions. The meat in the goulash was very tender and my veal cutlet was delicious. The mushroom gravy was amazing, and I asked for extra. Would it be strange if I drank the gravy out of the ramekin?\nThe atmosphere was  a little lacking; it seems like this is a restaurant that has not found its personality yet, but I am not going to hold that against Black Forest. The servers were nice and attentive.\nThe crowd seemed to be very very yuppy. \nThe very loud, top 40s hits music playing left something to be desired. There were not enough people in the restaurant to have crappy teeny bopper music playing that loud. We almost chose to move on judging on that alone, but I am glad we toughed it out. \n\nI will definitely return; I am eager to get some potato dumplings in my mouth.  I'm very glad you were good, Black Forest.", "author": "Alyssa F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-15", "description": "I was out on a date with a friend and we were looking for a place to eat before going into BAM. Black Forest was the perfect spot, a few blocks away from the theater. My friend was looking for a good place to have a beer and I have to say they have a large selection. Pilsner beer was the choice of the night it was lite and has a very good flavor. I had the Jagerschnitzel Mit Spatzle, it is a breaded veal cutlet with homemade German egg noodle and wild mushroom gravy. It had a very good taste. The portion was big I could not finish it all. The prices are reasonable. The place was very busy. We waited for a waiter but thereafter the food was served right away.", "author": "Marizol C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-01-02", "description": "I'm no expert on German food by any means, but the service here was not the best. The waiter seemed overwhelmed. We did have a big group (7 I think), and almost everyone did the 2 hour unlimited mimosas/bloody mary's...which seemed like a good deal, except for the part where we had to practically beg to get refills. That being said, the food was good, and the place seems authentic.", "author": "Kathryn W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-08", "description": "brats, spatzle, schnitzel, flammkuchen, what's not to love? everything i've had here has been delicious, even the side salads that come with the various dishes are tasty. \n\ni am relieved i live a 20-min walk away, instead of really close by, otherwise i'd be here eating all the time and fat and poor. my favorite is the spatzle, mmm.\n\nmost recently went for Sunday brunch around 1pm and it was pretty busy, so the food took awhile, but we still snagged part of a table (seat yourself! lots of group seating options) and the servers are all super nice and on top of it. yay Black Forest!", "author": "X Q."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-19", "description": "I love this place. Excellent food, excellent drinks. They even have food for vegetarians, and a few non-alcoholic drink options. I almost always get the kässspätzle sans bacon. In the morning, I usually go for the omelets. Shofferhofer is a nice light grapefruit shandy drink. The wine list is short, but good. \n\nBlack Forest is the kind of place where people bring children, especially during the daytime, and you might see people over 45 there, too. At the same time, a single person might have a decent shot at getting picked up at the bar. The space has a open feeling, and the bartenders are pretty friendly. It's cozy in the winter, and warm and sunny in the summer. Fun neighborhood hangout spot.", "author": "M. M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-12-29", "description": "A group of 6 walked in and sat down. It was not super crowded and plenty of tables open. We sat there for 20 minutes and nobody acknowledged us. We asked a waitress twice if we could order and both times she said just a minute.  When we asked again she said she was closing out and she would let someone know.  She did not. Finally we left and still not one person working there noticed. Horrible service.", "author": "Abbey Z."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-05-26", "description": "Unfortunately in the time since I've posted my last review of Black Forest, the service has gone from bad to worse.  The food and drink is still really tasty but I'm not sure how many more times i can keep going and wait forever for basic things like water or silverware and then face some grumpy waitress's attitude by asking for the check.  I really want this place to work out but they need to train their employees better, and maybe staff more per evening if they're too busy/overloaded.", "author": "Maeve M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-03-17", "description": "Had a reservation here yesterday at 6p. When we arrived, it was clear they totally forgot/lost the reservation. All ten of us waited in a cramped corner at the bar for almost 45 minutes - during which time the hostess/manager never even came over to give us an update on our table or apologize for the situation the way any other respectable dining establishment would. When we finally sat at our table, it took forever to place our order. When our food came, there were a couple mistakes but we were too famished to care. ANNNND my bf's food came ten minutes later than everyone else's - a single sausage on a bun with french fries. #itsnotthathardpeople \n\nWhen we got the bill (which ALSO took our waitress 20 minutes to get), they hadn't comped a single thing and even charged us extra for subs that they messed up on. SO NOT COMING BACK HERE EVER AGAIN. There are too many better biergartens in the city to deal with this bs.", "author": "n. e."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-01", "description": "John F. Kennedy, in his famous speech in Germany in which he wanted to say \"I'm a Berliner,\" actually said something closer to, \"I am a jelly donut.\" Why am I telling you this? It's because they sell Berliners here at Black Forest. I will say that it is the *only* thing I tried on their menu that I didn't find absolutely delicious. Why do they get the coveted five star rating then, you ask? Because everything else put before me, from the sausages to the salad to the coffee, was absolutely delicious, the service was wonderful, and the ambiance delightful. I will be back many times. Yummy!", "author": "Jeff H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-09-16", "description": "Fun atmosphere for a night out for drinks.  Food was just ok and service was weak. We were there saturday night and the place was crowded. The veal schnitzel and spatzle was what I thought was best. The flatbread wasn't good at all. Other meals were just ok.", "author": "Lisa W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-15", "description": "We came here pre concert on a Wednesday evening.  The food and drinks were good but the service was slow.  They need to become more aware of when The Barclay has events because they couldn't really handle the rush of people.  There were maybe two servers and the kitchen was backed up.  It took almost half an hour to get our pretzel appetizer.  If you go on anon event night the food is tasty and the portions generous.  I ordered the chicken schnitzel.", "author": "Michelle L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-12", "description": "i'm reading a memoir of a brit who travelled through germany in the 30s and hit a series of beer halls.  his descriptions had me craving a good german bar, and as i was passing through fort greene i stopped in at dsk (not knowing any better).  i was so dissappointed that i left for the bbq place down the street, giving up on my hopes for a good german experience.  \nthen i stumbled on black forest and it was exactly what i'd been hoping for.  huge great beer selection.  great food (i had the dumplings with bacon and kraut).  a beer hall section with long shared tables, and a sizable bar if that's not your thing.  but you've got to have the big open space like that because the echoing voices and laughter are a big part of the vibe in a good german joint.\nthis place was just what i wanted and i'll definitely be back.", "author": "Tom H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-03-31", "description": "Simply too loud in there. Bad acoustics and loud music had us shouting to talk over the din. Really wanted to like it but it was much too uncomfortable to stay and this was a Sunday afternoon.", "author": "Eric A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-17", "description": "Loved the food, atmosphere and drinks. Sampled the kasespatzle, champignons im bierteg, and eggplant schnitzel. The only downside was the long wait for ordering/check. Would definitely come here again and recommend to friends.", "author": "Denise S."}], "servesCuisine": "German", "priceRange": "$11-30", "name": "Black Forest Brooklyn", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "733 Fulton St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/SeINe6YLs2K5rJB8tUD8rg/ls.jpg", "@type": "Restaurant", "telephone": "+17189350300"}