{"aggregateRating": {"reviewCount": 364, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-11-07", "description": "I'm in the neighborhood for brunch a lot and my friends and I have given Black Forest a shot several times. Most of the time, the service has been sub-par. While the wait staff is quite nice, they're usually too busy to properly take care of you. One time, the server spilled a full tray of mimosas on my friend -- a complete accident. All good but management only tried to give him a free dessert while he was wet from the spill and it all in his food. Talked with management and all it did was make a bad experience worse. It's a great space and would love to see it turn around! The best thing on the brunch menu was the biscuits and gravy. Last time was there, they said chef took it off the menu because it was not up to their culinary standards. Oh well...", "author": "Nathan G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-12-29", "description": "We had brunch over the weekend and it was quite nice. We arrived at about 11:15 AM and it was relatively empty. A small lounge area, counter seats at the bar, counter seats in front of the windows, small four-seat tables and longer communal tables. I could tell upon entering it is kid friendly by the strollers that were inside the restaurant back by the second bar. We ordered cauliflower sweet potato flat break which was very nice. We also ordered the French toast and bratwurst with biscuits and gravy. All of the food was good and the service was pretty good considering there was only one waitress. However, with the next hour it became a madhouse. One couple asked if they could share the table and we said absolutely yes. Please take a seat. Well, the couple had their parents and kid so four adults and three kids slowly got pushed to the end of the table. Not cool. Then another group came over and basically circled our table as they waited for us to finish. They were quite polite, but it was not cool at all and most certainly uncomfortable.", "author": "Lars F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-31", "description": "Went tonight for drinks after a concert at Brooklyn Academy of Music (BAM) and this is definitely a good place to go if you are in the neighborhood. We ate the pretzel, which was awesome. There beer list is pretty large and has over a dozen different beers from Germany with a good description for each. Also, each beer came in three sizes half liter, liter, and two-liter (comes in a boot).", "author": "HedgeFunNY C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-07", "description": "This beer hall has a great beer and wine selection as well as full bar. They have authentic german food and some interesting other options as well (such as fried mushrooms!). Everything I have tried here is good (including those odd mushrooms!); they have solid pretzels, spaetzle and sausages to satisfy your german cravings. They also have some nice veggie options like salads and flatbreads. This place can get a little busy and therefore the service is kind of lacking at times but other than that this place is pretty great. Nice location in Fort Greene that is pretty easy to get to as well.", "author": "Jessica S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-09-06", "description": "First off I want to say I'd really like to see Ayana and Tobias win with this business. But you HAVE to get better servers. It is obvious that they are just plain unhappy and could care less about good service. I actually really enjoyed my food and beer. I'm not even a beer person but the grapefruit beer was so enjoyable I was talking about it for days. However the service was just so rude and unwelcoming. The server with the long braids came to close our bill and she was so nasty throwing my friend's card on the table saying \"We don't take Amex\" Which is fine, she paid with another card. She walked away without saying a word. Not a thank you, hope you enjoyed your meal, come back again... nothing. She had absolutely no reason to be so nasty because she wasn't our server to begin with. The other guy ended his shift and she took over. So it's not like we could have even had the opportunity to do anything to warrant such an attitude. The guy before her was okay, but seemed only interested in getting us to order as much as possible. Neither had any personal skills or anything to make customers feel welcome in the space. I want to come to Black Forest, but I also don't want to spend my money and not feel welcome. Please work on it.", "author": "Sonya F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-01", "description": "This place was amazing! I was visiting from Raleigh and I'm officially sad that I wont get to eat here regularly.  I had their grapefruit beer which i believe was a mix of hefeweisen and grapefruit shandy which was perfect because it cut the sweetness.  I also had the chicken schnitzel with spicy sauteed kale.  It really was so good; highly recommend.  The schnitzell was simple, but it was the best meal i had during 2 weeks in New York.  It was served with plenty of lemon and great spicy mustard.  Im craving it writing about it...yum!   They were extremely busy but service was still great.  Maybe they need to consider a Raleigh location.", "author": "Reba P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-08-03", "description": "As much I love the variety of beer served here, I won't be coming back. Sucks, because there's outdoor seating, and they serve brunch on Sundays! I came here on a not-so-busy Sunday afternoon with a friend and the service was horrendous. We stayed for maybe an hour and a half, and was served only one beer. Our server completely forgot about us. I watched as she mingled with her coworkers and tended to everyone else. When she finally came back to us, over a half hour after we finished our first beer, our second round never came to us. When I approached the server (who was idling at the bar) about this, before I opened my mouth, she simply said, \"oh, I know it's taking long..\" That's when I knew I had to cancel the second round. There was no apology. There was no explanation. I just got a smug response from a server I just watched from afar doing absolutely nothing but joke around behind the bar! It wasn't that busy either, and they seemed adequately staffed. What gives?", "author": "Adriane C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-21", "description": "Really like this place! Great selection of German beers and delicious Bratwurst made from grass-fed animals, very friendly staff and cosy atmosphere. Thanks for bringing the Black Forest to NYC :)!", "author": "Ben P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-30", "description": "Went here after a BAM show for birthday beers n brats a few weeks ago. The food exceeded all expectations. It was probably the best kasewurst I've eaten, even compared to ones I had in Germany \u0026 Austria! Good beer selection too. The only reason I'm giving 4 stars is the service was pretty bad. For example, I tried three times to get the waitress to come back to order my drink as she crossed the room. Granted it was a Saturday night and it wasn't exactly slow, but it was frustrating. I'd come back anyway though, just to try some more wurst!", "author": "Eleanor D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-18", "description": "This past weekend my amazing girlfriend threw my 30th Birthday Sunday Funday at Black Forest Brooklyn. She said that planning with the staff was simple and they were eager to have us. \nShe reserved the back four tables for the 40 or so friends and family that showed up. Our waitress Claire was unbelievable. Not only was she extraordinarily attentive, she made sure that no randos sat at the tables that were empty before everyone arrived. It just made it easy and relaxed. Everyone had a beer in their hands at all times.\nConsidering how much space we took up, they never rushed us, and you just felt welcomed. Our reservation was at 3:30PM. We didn't leave till 9PM. Just speaks to how much fun we were having.  \nI used to be a regular at DSK up the block when I lived in Ft. Greene, and was amazed and happy to see my former favorite waitress now owns Black Forest.\nThe space is open and roomy, and the sky-lights give the place a lot of natural light.\nAnd the food was really great. Favorites included the kale, potato pancakes, and the thunger sausage.\nI really couldn't have asked for a better birthday party, and I better place to have it. Thanks to everyone at Black Forest for making it a special day. \nAnd really enjoyed my birthday boot.", "author": "Jason K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-03", "description": "Very good selection of beer and location, location, location!! As we say in real estate. Super accessible which definitely matters to me. There's wifi and cool waitstaff. Love the space and layout. I've only ordered the chicken brat with sauerkraut and fries, above average for a Biergarten.", "author": "Desi M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-02-20", "description": "Good news is they have German beer on tap and the food is decent and generally authentic, even if slow or hot items arrive at the table cold.  Often, items are not available.  \n\nBad news - the service is really really lacking.  It's really bad.  Worst I've seen in a while.  Certainly the worst we've had in Ft. Greene which is a shame.  I really wanted this place to be good.  We live less than 4 blocks away and would love to have a decent German place in the nabe.", "author": "Josh M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-07-13", "description": "Came here to grab a drink at the bar and to watch the world cup.This German beer bar, opened by two Brooklyn residents that grew up in the Black Forest region of Germany.Great restaurant but I'm not a fan of the growing number of alcohol-serving establishments in the area.Great selection of beers, nice and friendly staff, tasty food with huge portions.", "author": "Rafael Y."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-13", "description": "Cool German bar with good food. Server could use a few lessons in things like giving a plate THROUGH two other guests at our table, not supplying napkins (things like that), but at least she was a sweetheart. Please note this place only has beer. If you want anything else, you'll have to go elsewhere.", "author": "William C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-29", "description": "The Mimosas are always on point! The additional $20 for unlimited mimosas is worth every penny.  The Flatbreads are the hitters here. I've tried each one but the mushroom and truffle oil is the best of all. I really enjoyed the omelet with your choice of three ingredients. The salad that comes along with it, is what a salad should be. The only cons of Black Forest is the self seating can be somewhat of a hassle and you having to flag down your server from time to time. Although there is a bar, it is family friendly, especially on Saturday's and Sunday for brunch.", "author": "Tammi B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-29", "description": "I had the gravy and biscuits. Good solid tasty meal that would suit as both breakfast or lunch. Radler on a hot day completed the meal. Friendly helpful waitress; excellent service. It hit the spot.", "author": "Dean J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-16", "description": "Great new beer hall. Awesome selection of German beer, sausages and a convivial atmosphere.", "author": "Ben A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-28", "description": "For our starter, we had the hot Riesenbrezel. A soft steamy hot pretzel with a side of two types of spicy mustard. These mustard had the strength to open up my sinus passages, and they were delicious.  And of course, I had to have a German beer from their vast selection. I had the half liter of Weihenstephan Kristall. This is a great tasting beer, with a not so strong of barley taste. It has a very smooth texture and a slightly sweet taste. It was the right beer to go along with my meal. This beer has now become one of my favorite beers. For dinner...For more of my review go to: http://activities-eatsandtravels.blogspot.com/2014/12/germany-in-fort-greene-brooklyn.html", "author": "Ron F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-02-14", "description": "Great restaurant for dinner and drinks but I had to take a star away when they advertise daily brunch and when you show up at 10 am on a Friday the doors are locked and restaurant is closed. Quite dissapointing when you set your sights on it and travel to the location only to walk away disappointed", "author": "Joseph S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-01-27", "description": "Just visited BFB this past Saturday night around 6:30. My mom had been previously and raved about it, so she was with us as well.  I wish YELP had a 'food rating' AND an 'experience rating'.  While we thoroughly enjoyed the food, getting it was another story.  \n\nFirstly please know that it is a 'seat yourself' establishment which can get a bit confusing when you have to hang around the bar area and watch like a hawk for a table not knowing how many other people are doing the same thing.  Also, how can you have a 'seat yourself' policy but also have a table with a 'Reserved' sign on it??? Doesn't seem fair.  Fortunately, our wait wasn't long.  \n\nOur waitress seemed a bit overwhelmed when she came to take our drink order. After our drinks arrived, we ordered our food which she seemed to want to get 'done'. I ordered the Jagerschnitzel w/mushroom gravy and Spaetzle. The pork was well seasoned and not dry like some schnitzel can be.  However the spaetzle was bland.  The other items ordered were the large wurst platter that came with a choice of 7 sausages (there are only 5 options on the menu?) and only four came out.  This was served with a variety of sides a few that came out room temp but should have been hot (e.g. mashed potatoes).  They also have a German type flat-bread that was really good. \n\nHowever, once the waitress took our food order, it was a good 30-45 mins. before we received anything plus we never saw her again until she dropped off the check.  We also had finished our drinks and had to hail someone down for a second round.  Right before we received our food, it seemed like 3 or 4 'runners' arrived and the service quality picked up a bit.  Plus a pet peeve of mine is when your server never comes back to your table to make sure everything is OK and you have everything you need.  Although they have been open for 7 weeks (according to Yelp) the service still seems a bit disorganized.  I noticed two kitchen staff visiting the basement to re-up on supplies.  Not something you necessarily want to take time to do during a dinner rush.\n\nSince the bar gets very busy, maybe the wait staff attending the tables should do the wine pours (like I've seen done in other establishments).  Also, we sat right by the office and observed the owners going in and out, and greeting friends but I didn't see any interaction or managing of the staff.   I've seen owners of restaurants who have been in business for years, come by tables and make sure everything is OK.  Certainly something you'd want to do when you are 'fulfilling a lifetime dream of opening their own business' (from the BFB website).\n\nAll in all, I would recommend the food.  I would definitely give it another try go again and would probably call ahead. ; )", "author": "Eurydice D."}], "servesCuisine": "German", "priceRange": "$11-30", "name": "Black Forest Brooklyn", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "733 Fulton St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/SeINe6YLs2K5rJB8tUD8rg/ls.jpg", "@type": "Restaurant", "telephone": "+17189350300"}