{"aggregateRating": {"reviewCount": 364, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-12", "description": "Ambiance was chill. Pretty standard biergarten so you won't be wowed by the decor. But you shouldn't expect to be when hanging out a biergarten so not an issue. The few times I've been it's been fairly easy to get seats. \n\nBut my favorite thing you ask? The big ass warm delicious pretzel. Yep. That would be it. F'ing yes please. So good. I haven't tried anything else food wise but I keep hearing about the shnitzel. I will be coming back for that. Trust. The beer selection is great, they have a patio, and our bartender Freddie was awesome. No complaints here.", "author": "Leilani L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-01", "description": "I ordered the \"two eggs any style\" and the waitress took my order for egg whites and then came back and said \"the chef says no he won't do just egg whites.\"  Why?  \"I don't know, I think it's a pricing thing.\"  \n\nWhat does \"any style\" mean?\n\nTo follow up, the waitress never said thank you and stormed away from the table after she took the credit card. It's the one with the yellow turban on her head in case you're the manager and want to settle this with her.", "author": "Richard F."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-24", "description": "I have been to Black Forest at least 10 times for dinner, drinks, and brunches. The service has always been lacking, however the good food and beer hall decor always outweighed the bad. My experience today completely changed my outlook and I will not be coming back. \n\nTo begin, we waited nearly 30 minutes for the server to come by. When we finally managed to catch his eye, he said he would be right over, yet every time we saw him he was taking orders of patrons who entered the restaurant way after we had. Once we finally ordered, it took another 35 minutes for us to get our first drink which is a very infuriating experience at the best of time, yet downright cruel when you've paid for the bottomless drinks (with a time limit). Another 20 minutes in, the waiter mentions that the kitchen does not have our sides and we need to order something different. At this point, we'd been there for an hour and a half and we're not even going to get the food we wanted. We told the server to please cancel our order and we'd pay for our drinks and leave. This was met with visible scorn, and our server walked away without a comment. Five minutes later, he waltzes out with the food exactly as we ordered. Weird. We tried to laugh it off and WE apologized for any perceived rudeness and thanked the server for our order. When we were finally ready to settle up, our bill seemed absurdly high. We looked down and 30% of our bill was for expensive cocktails that we did not order. Once we confronted the server, he said it was a \"crazy mistake he meant to rectify\" which I'd like to think is true, but the whole think reeked of impropriety. So Black Forest, I prefer going to restaurants that show respect for the patron's time and do not try to rob me. I will not be coming back.", "author": "Therese M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-18", "description": "The lighting in this place is good. It  is a good date spot, as their is nice music, but it is not overpowering. You can hear your date speak. The food is good. I like that they serve a side salad with the meal. Their potato leek soup is full of flavor and is filling.", "author": "Deirdre L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-21", "description": "SUPER DUPER IMPORTANT YELP UPDATE: THEY HAVE AVENTIUS!!!! Also the schnitzel and food's improved. yay! \n\nOLDE REVIEW: \nWhen I think German, I don't think Oaxaca, but that's exactly whats on the \"menu\" at this \"German\" restaurant. Look, at the end of the day the food is Americanized German, distilled for the american palate, their mashed potatoes come out of a box, they don't mash them, their \"German\" salads are more akin to something you'd get at a chain than something authentic, and the beer selection really does leave quite a bit to be desired, as they mostly have common faire. I guess it makes sense if you're catering to an audience that isn't familiar with German food or beer, and that's fine. \n\nThe decor is nice, but I reckon if you're eating at a place for the decor, well then... \n\nAt the end of the day, I live in the hood, and will make the trek to Cafe Katja in the LES, or ideally Zum Schneider (Alphabet City) for MUCH MUCH better German food (even though Katja is Austrian), or if I just want a good German Beer, DSK up the street offers a much better selection. Though both DSK and Black Forest would do good to get their hands on some Aventinus.", "author": "Michael G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-10-06", "description": "It was okay until we saw a roach crawling in our section. We alerted the servers immediately, one of which saw it and was too slow to kill it. I ordered some last minute fries and after the roach, I couldn't finish them... The servers apologized and said they would notify \"upper management\", but yet still charged me for the fries and sauerkraut that I could not finish. \n\nIt is not okay that roaches are crawling in your establishment while people who pay you are eating. A crew with good customer service would apologize, get the manager right then, and take my $5 fries off at the very least. Had that happened, I would've known they were doing their best to make things right. Their reaction was so nonchalant and really disappointed me.", "author": "Raquel W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-01", "description": "Just moved to this neighborhood and wanted to grab a drink and a snack with my hubby-what a pleasant surprise. The flatbread was really good and my dude was excited because he's ethnically German and loves having tasty food that reminds him of his time there. Great beer selection and friendly service. What made the night was that by chance it was the 500 year anniversary of the German brewing purity law and they tapped a keg of delicious beer and gave us all a free glass (with glass as souvenir) and held a beer holding contest which was hilarious-it really got everyone in the place laughing and talking! We'll definitely be back!", "author": "Allana D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-06", "description": "Made reservations for 9 before the hockey game. The hostess and waitress were pleasant and service was quick and efficient.  The beer and food menu had a wide assortment and the food was very good. A minor issue would be that while the place is somewhere  you can bring children,  they do not have any type of children's menu. Really do not\nlike to pay full price for a child.", "author": "Michael K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-09-04", "description": "The place wasn't full and there were plenty of servers walking around, but we didn't get ANY service. Not even a hello. As soon as we sat down the person didn't say anything and just walked away. No one offered us water even after 25 minutes, and it was a brutally hot summer day. No one checked in to see if we were going to order anything. I just don't understand how they forgot that they seated us. So disappointing.", "author": "Jenny C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-30", "description": "Black Forest is a great bar, my friend lives really close to so I've been here about 3 times before this last time and each time I only had drinks, this time I had food also celebrating that friend's birthday, ambiance is really nice there is a bar area but there are also dining tables and there are a few picnic style tables similar to Oktoberfest, there is a good selection of German beers and German food as well, they have hofbrau and many others, they have .5 liters, 1 liters and boots as well, they also have wine and cocktails, last time I went for a hot toddy since it was cold out and it was great but in this place you just want to have a beer, as far as food I was torn looking at the menu there were many things I wanted to try but I ended up having a bratwurst which comes with fries (no salt! Awesome) and sauerkraut, a good portion and perfect with beer, like I said earlier I had been here before but since the last time I visited Germany and I must say this place captured the experience well! If I'm in the area for a game I will definitely stop by", "author": "Jerry L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-31", "description": "I like this place. I stopped in for a drink before heading to BAM for a movie.  My boyfriend and I ordered some beers and a giant, warm pretzel to share. The little we had was right on, though I am curious about sampling their other eats. \n\nThe atmosphere is large and airy. Most of the tables of communal. On a Saturday night, it was crowded but we were able to score two seats at the second \"bar\" table.  The crowd was diverse and a mix of couples and grounds enjoying a night out. \n\nI will be back!", "author": "Maria M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-03-29", "description": "Place for quiet coffee but not for food. Server was nice but it was so slow to get foods and taste was not interesting..", "author": "Nuri H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-04-04", "description": "We're locals, have eaten here 20x, mostly out of convenience. Food is consistently average/acceptable, service is consistently beyond horrible. Grossly understaffed, never the same waitstaff twice. If your idea of ambience isn't 80s radio hits mixed with crying babies, stay away.", "author": "Tammy T."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-08-18", "description": "If you like German beers, they have a pretty solid selection of about 15 beers on tap. I had an Hofbräu Dunkel, followed by a Schneider Aventinus. They also serve Rothaus Tannenzäpfle, the only unpasteurized German beer available in the US. Drinks are not cheap, though: $8-10 for 0.5L.\n\nFood is actually more affordable. The Beer-battered, fried champignon mushrooms \u0026 aioli ($7) is a tasty starter, perfect for sharing. The Bauernmädchen ($13) is a tasty flatbread with sour cream, shredded spicy citrus kale, roasted pumpkin, cauliflower \u0026 toasted almonds. Kässpätzle ($14) are homemade German egg noodles with smoked slab bacon, shredded  Emmentaler cheese, fresh nutmeg, sauteed onions \u0026 house salad[1].\nAs far as wurst, my Lange Rote Bratwurst ($9; spicy pork, beef \u0026 veal sausage) was a bit disappointing: pretty bland, and not spicy at all. The shoestring fries were great, though. If you're very hungry, get the Wurstplatte ($28): a choice of 4 sausages that comes with shoe string fries, sauerkraut, mashed potatoes \u0026 spicy citrus kale.\n\nWhat drags the rating down is the service: sloooooooooooooowwww....\nOn a Thursday evening at 7pm, when we arrived we were told to sit anywhere. While we were waiting for our friends to arrive, we sat on one of the large communal tables, gave the waitress an order for two beers, and waited. And waited. And waited. And waited some more... In fact, some of the people who were sitting next to us on the communal table got up and left after about 20 minutes. I would not have minded to just go to the bar and get the drinks myself, but we were specifically told to place our orders with the waitress.\n\nWhen our friends arrived, after about 25 minutes, we decided to move outside. I told the bartender to bring our drinks outside. Once outside, our drinks never arrived. When the waiter in charge for the outdoor area arrived to take our orders, we placed our drink orders a second time. And waited some more... Same interminable wait happened when we placed an order for a second round of drinks: after about 15 minutes, we had to remind the waiter about our order.\n\nNot sure why service was so bad: the place was only about 2/3 full, and there were several waiters and waitresses working the bar, the main dining area, and the outdoor area. Just puzzling.\n\nUnless you don't mind having to wait half an hour just to get your drinks, go somewhere else.\n---------------\n[1] If you're vegetarian, order this without bacon.", "author": "Matteo R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-11-01", "description": "$11 for a 0.4 liters for house beer? That took all the pleasure away. I find this institution dishonest and will not come again.", "author": "Audio V."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-03-24", "description": "As an update, I received a message from Tobias (one of the owners) apologizing for the service we received. He also noted that he would address my feedback with their manager. I appreciate the reach out and hope that other customers have a more positive dining experience. \n\nDue to the message I received, I will add a star as I believe there is potential in this restaurant. I am still unsure if I will return but hope if I do, I can add some more stars.", "author": "Kate E."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-08-16", "description": "I should have known better than to give 5 stars after one visit. I went here a few months after my first visit and it was terrible. One of the worst meals I've had in New York.\n\nWe were a large-ish group of around 8 people. We ordered the flatbread things to start. They were decent. I apparently made a huge mistake by ordering the sausage with potato salad. It tasted like a cheap boiled hotdog. I could not believe they were charging money for it. We also had a side of sauerkraut and it was just okay.\n\nThe service was also terrible. Our server was not attentive and I had to hunt him down when I needed to leave.", "author": "Lia S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-16", "description": "Black Forest Brooklyn is really awesome, it has really great staff that are super friendly and relatively inexpensive and cheap prices. It features a casual bar atmosphere that is quite populated and loud (introverts beware!) It also features a great selection of German beers and a wonderful selection of the finest German sausages.", "author": "Bratislav B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-11-13", "description": "It had a cool, hipster, spacious indoor ambience. I loved seeing the ginormous beer glasses. It was a great time hanging out with my friend, and our server was really engaging and attentive, but honestly my draft beer wasn't too great. Perhaps it's my fault because I chose it. Furthermore, the sausages were OK. The bread or sausage weren't exceptionally fresh or tasty. I'd definitely come again, but it wasn't great.", "author": "Esther J."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-09", "description": "I was very excited when this place opened.  I work nearby, and it was a nice addition to the area.  It's a wide open space and a good spot to meet up with groups.  \nI've been here probably about 15 times (brunch, lunch, dinner, and drinks) now over the last few years, and almost every single time, there has been an issue with the service.\nIt seems like regardless of what hour of the day it is, they never have enough people on the floor, there is no sense of urgency, and no one seems to know what's going on.  \nThe food is actually decent, but the consistently poor service makes me not want to go back.  Every time I go in there are new people working, which also makes me question how the restaurant is run in general.  There have been times when simply getting change or an extra plate has taken over 10 minutes.  \nIf these issues are resolved, I would be happy to bump up my review another star or .5, but to me, service is just as important as the food you are putting out.  It can make or break the experience.", "author": "Laura B."}], "servesCuisine": "German", "priceRange": "$11-30", "name": "Black Forest Brooklyn", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "733 Fulton St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/SeINe6YLs2K5rJB8tUD8rg/ls.jpg", "@type": "Restaurant", "telephone": "+17189350300"}