{"aggregateRating": {"reviewCount": 364, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-09", "description": "Love this place. I shall drive there from Michigan to experience enchanting German atmosphere", "author": "Margaret A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-17", "description": "Good sausages and breakfast items for brunch.  Beer was very good too.  Casual place, you may share one of the big picnic tables.", "author": "D H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-24", "description": "I grew up drinking Rothaus beer during summers in Oberkirch. Its the PBR of the black forest. So stoked that they serve it here!", "author": "Markus K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-21", "description": "Fantastic selection of German beers, most of which I haven't seen on tap in the US before. And available in a big 1-liter maß if you want.\n\nGreat vibe, with a nice wood bar, long tables, and skylights.\n\nThe food looked great (I didn't order any).", "author": "Dave M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-07-10", "description": "I'll start by saying that the ambiance, food, and beer is pretty good here. But the service is so consistently bad that I can't, in good conscience give this any more than one star. Yes, it's that bad. I should also mention, it's kid central. Babies and children running around galore. That doesn't actually bother me, but it's note-worthy in case you care about that kind of thing. Every time I've been there, the service has been unapologetically slow. Whether there's 8 of us or 2 of us. But recently I was there with my husband and we walk in and ask a waitress if we seat ourselves and she rudely/dismissively said \"yeah, just sit wherever you want\". She did give us menus, but that was the last we saw of here. We sat there for 15 minutes, continually trying to flag down a server. Finally, I got up and asked a server to come over to us. I then saw him go to a table (for a second time) that got there 10 minutes after us. After a couple more minutes, we just decided to pick up some beers on our way home. No beer is worth that kind of service.", "author": "Marcy P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-14", "description": "Best schwarzwaelder kirschtorte outside of the black Forrest region so far, great beer selection including the best beer from that region on tap (rothaus tannenzaepfle)  , good atmosphere and all this for a decent price!\nStaff is friendly, also tried the landjaeger which was not traditionally (e.g. cold) but nevertheless delicious\nHave to come back for a full dinner", "author": "Philipp H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-26", "description": "Really good service, good food and a excellent selection of beers.\nCame here with some people to watch a World Cup game and the place was packed, so much that people were overflowing outside. But, that didn't hinder their service. \nWait staff was attentive and made sure we got our beers and food without a huge wait time.\n\nThe bar has both indoor (picnic style tables) and outdoor seating and during soccer games they have a huge projection screen.\n\nTry the german flat bread with sour cream and bacon. It is sooo good!\n\nI will definitely be back.", "author": "Marcie A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-04", "description": "I'm so stoked that this place is fairly close to my apartment--apparently so much that I actually used the word \"stoked.\"\n\nMy boyfriend and I were excited to try this place  before a Saturday Target run. Not sure what kind of coffee they brew, but it was one of the best cups I've had in a while, so I'm looking forward to finding out. We shared the goulash soup, which was seasoned really nicely, a \"brezel,\" which went perfectly with the mustard that accompanied it, and the bratwurst. Damn, that bratwurst was awesome, and it had just the right amount of smoke (sorry, you caught me mid-season of Top Chef, so I'm borrowing a little bit of Collichio speak). \n\nI really hesitate to take one star off for the slow service because I know they haven't even had their hard opening yet and they're probably in the process of hiring more waitstaff, but it did take forever to get our check. Once they get in the groove, if the food remains fantastic (and I don't see why it wouldn't), I'll tack on the fifth star in a heartbeat! Plus, I have to go back and try to tackle a piece of schnitzel that looks bigger than my head!", "author": "Alex C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-09", "description": "Really enjoyed this Biergarten.  We were so happy to find authentic Flammkuchen, which is hard to find in the US.  Brezel was also very good.  Actually everything we had was good.  We did see a guy sitting at another table drinking from a giant size \"das boot.\"  Yikes.  Wish they didn't even have it available.  So tacky.  But they have some seatings outside by sidewalk, which is nice to do some ppl watching.", "author": "Harue J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-21", "description": "The lunch special was amazing! Great service from Dirk. The food was nice and hot and well prepared. The atmosphere was also dope. Feel like im in Germany", "author": "Adjoa N."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-04-22", "description": "The wurst was great. Spicy citrus kale was interesting, I liked it. I normally don't like sauerkraut, but their preparation was ok.\n\nI also had a pretzel, which was delicious by itself. The spicy mustard that it came with was too strong, so I didn't use it very much.\n\nThe service was a bit lacking. We had a new waitress, and she had a hard time with the menu, which lists most items in German, so I can understand her difficulty. I also think the lighting was set a bit too low.", "author": "Mark R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-08-01", "description": "The food was good- nice and fresh salads, good sausages, good beer selection. The reason I didn't give it more stars is because of the terrible service. When we got to the restaurant it was busy so we asked the waiter if we could sit somewhere. He seemed frazzled and suggested we sit at a table a couple of guys were about to leave. When my friend said, \"are those people waiting for the table\"(referring to some women standing near it) the waiter told us in an annoyed and put upon tone that he didn't know. He then walked away. We finally sat down and after waiting over 10 mins., had to flag a waiter to order. Once the food came, our waiter didn't check on us once. In order to get the check I had to go to the service station and request it. \nI won't go back here due to the service issues.", "author": "Lake S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-25", "description": "Favorite place to work in Brooklyn. Great beers. Good beer hall food. Friendly people. And, plenty of table space for a laptop and whatnot. Just a solid place.", "author": "John G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-30", "description": "Near the Greenlight Bookstore. The place is fun and the food scratches that itch for German food without being stodgy.  The beer options are thoughtfully selected. You know you should be eating more sauerkraut.  Do something about that and head to this friendly neighborhood spot.", "author": "Jane H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-05-21", "description": "We came here for my cousin's birthday because she had wanted to try Black Forest for a very long time and was ecstatic to finally come. That night it was not busy when we arrived but none of the large tables were available for our group of 6. The waiter said a table would be opening soon almost an hour later but another group that showed up later sat themselves down and the waiter tried to get us to stay and eat in the waiting area on benches instead. When we reminded him we were here first, he said the other table has already sat down and he didn't want to ask them to move because he wanted to avoid a scene. \n\nI've never seen or heard of anything like this happen - usually employees are happy to stand up for their customers. And never have I witnessed a scene from asking a group to move if they weren't next in line. My only experience with both others being asked to move on our behalf and being asked to move is that people are happy to do so. The other party was not aware there was another party waiting - they were at the bar drinking - and it was the employee's job to manage everyone's wait. \n\nUnfortunately because of this experience my cousin's birthday was ruined and we ended up walking around the area to find dinner since we were all starving by the end of the wait and sadly, I can't review the food itself!", "author": "Vera H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-16", "description": "Great selection of beer in different sizes to cater to lightweights and lushes alike. The food isn't anything to gush over but it's pretty solid all around. Seems like a good place for large groups but I've also come here alone to read a book or work on my laptop for a couple hours. The staff never try to rush you to vacate the table and are always friendly and accommodating without being overbearing. I will definitely keep coming back.", "author": "Kay O."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-06-07", "description": "Walked in to join a table of 8, waited 10 minutes to order and finally went to the bartender to be told my server will take my order after his phone call. Beer was terrible so I asked for my second .5 liter of something with more hops. Server did not know what hops were and had to go to bartender to ask for his rec. Having served for years in the food industry myself, I ask you: what kind of place puts a server on a table of 8 his first day on the  job when the entire place is empty?", "author": "M G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-19", "description": "I was really, really excited to find this place. Seriously, I went back like 3 times in a week. I love coming here because its big and fun and family friendly and more importantly for yelp community-- the food is simple and delicious. From what I have read on the beer list, the drink selection is awesome too, I just can't stop ordering the same Tannenzapfle.", "author": "Abby W."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-03-22", "description": "Place looks cool, that's true, hipsters all over but the food is bad and terrible service.", "author": "Oren H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-28", "description": "Yum! \n\nHabana Outpost was way too crowded and an air-conditioned movie at BAM would provide zero food for our grumbling bellies, so my boyfriend and I saw this place on a search for dinner and were really glad we came in and sat down!\n\nGreat atmosphere, really nice, dim lighting w/ a casual mood. We were so hungry we overdid it a little bit by ordering:\n\n-A small wurst with mustard, saurkraut (yum!!), and french fries\n- A flatbread pizza with roasted cauliflower, shaved almonds, spicy citrus kale and butternut squash (SO. GOOD)\n- Potato latkes with apple sauce and a salad\n\nI ordered a cocktail with ginger ale and pear brandy and BF had a beer. \n\nOur waitor was super nice\n\nEverything was great, albeit a bit expensive. I took off one star for the high prices (what do you expect in Ft. Greene, though?) and only one single bathroom (one of the two was locked for some reason) for all patrons to use.", "author": "Meghan O."}], "servesCuisine": "German", "priceRange": "$11-30", "name": "Black Forest Brooklyn", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "733 Fulton St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/SeINe6YLs2K5rJB8tUD8rg/ls.jpg", "@type": "Restaurant", "telephone": "+17189350300"}