{"aggregateRating": {"reviewCount": 364, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-30", "description": "We were a couple sitting on the bar.\nBar tenders were both nice and service was good.\nWe weren't that hungry so we took the roasted beets salad with the goat cheese and lettuce.\nI must say it was quite simple, maybe too simple and not so appealing..\nThe lettuce looked kinda ragged also..\nOverall, it felt like the salad was not adequate to such place.", "author": "Yael I."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-04-04", "description": "Worst experience ever. The food was okay, but the service!!!! Went to have lunch today, maybe 4 tables were set. An annoyed unpleasant waitress served the shift. I waited for my food for almost 30 minutes. It wasn't that good to say it was worth the wait. And than, the waitress spilled hot sauce ALL OVER ME saying, while my phone is drowning in sauce and my $200 blouse spotted with stains- \"it barely reached you\". Needless to say I'm never coming back. Would not recommend at all!", "author": "Deena B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-16", "description": "Loved it - we had to wait a bit long for our food as there were issues in the kitchen. But that's life, and staff sure made up for it, anticipating our every need!\nFood was yummy, all worth it, very nice decor too. Home feel.\nWill be back!", "author": "Blanche B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-15", "description": "Black Forest has become my go to lunch and brunch spot now that I have a baby in tow. They are extremely accommodating for babies and families and also are really flexible with large groups, allowing us to pay individually and allowing us to order in waves as people come and go. The lunch specials are great and the beer is delicious. It's tough to find places in the city that have the space and flexibility to handle babies but this place has got it covered!", "author": "Michelle C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-21", "description": "Very nice place, great food, nice music too and the waitress Shena (I donno if I spelled it correctly) was really nice :) me and my friend had raspberry german pancakes and käserbratwurst w/ shoestring fries and both were amazing! Perfect sunday brunch!", "author": "Beatrice C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-05-15", "description": "My first and last time here. Went with friends who were here before and had good food and service but not this time. A couple people ordered bloody Mary's and waitress acted confused saying since its brunch drink they probably can't do it. Um you have a full bar right!? They did bring those, but we're out of almost every menu item we ordered \u0026 it took waitress a long time after we ordered to let us know. Also took a long time to just get napkins \u0026 silverware! The owner was there apparently and waitress said she would comp us a round of drinks. Great! So waited @30min for those they never showed, then different waitress came over, apparently ours left! \u0026 new waitress just handed us the bill! Owner never came over, we eventually got our first round of drinks comped \u0026 headed over to Mullanes nearby to recover from this bad experience!", "author": "Sarah G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-03-17", "description": "Interior is spacious, so it's perfect if you have a stroller in tow. I arrived around 3:30PM on a Tuesday. My toddler was still napping in her stroller so it was the perfect place to treat myself to a beer and lunch. Or so I thought. \n\nI've been in the neighborhood for almost a decade and live only a block away so was really hoping this would be another family friendly place to add to my list. Not so sure I will return. My server, Will, was awful! He was unpleasant and inattentive. I don't know about you, but I eat out for the experience - not only for the food and drink. He brought my food over and never returned. An hour and 15 mins later I had to flag down the other server (Redhead with glasses) to ask for the check. She was pleasant.\n\nBeer was great. Schnitzel sandwich was bland. Fries could have been better AND cheaper ($6 for a side of brown crispy fries is ridiculous)! Beet soup was excellent. \n\nIt is so important for the servers at these establishments to provide good service. I hope that the owners realize this and encourage their employees to maintain a level of quality service.", "author": "Naktastic B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-08-18", "description": "Food is priced very fairly.   The selection of German beers on draught are plentiful but pricy.  Service is average at best.  The place has s nice relaxed vibe, at least for a weekday lunch.", "author": "Michael S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-05", "description": "I love Black Forest Brooklyn. The place is great for big parties but also for romantic dinner for two. Prices are great, staff is friendly and welcoming, food is always fantastic. Will come back many more times!\nDanke shon.", "author": "Julia A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-12-11", "description": "Twice an overpriced burger came out overdone. Flammkuchen had the texture of stale tortilla and was a total failure. Im afraid to ever go back.", "author": "Brian C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-09-04", "description": "Burger was underwhelming and over cooked. Good place if you're just getting beers and a soft pretzel (looked good but didn't try it) but nothing really special.", "author": "Mike A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-12-09", "description": "Mixed bag here.  Fun space.  Good drinks, had beer and gluhwein.  Service indifferent.   Okay once you finally get their attention,  true at the bar and the tables.  Cause I sat down for a drink and muchies at bar, they pass over me on the waiting for a table list.  Loved to beer batter mushrooms.   But the wurst was not prepared as described and when it came with a different side than expected,  wait staff just couldn't be bothered to correct it.  Latkas were heavy, not that appealing.  Would go again for bar food, drinks and fun atmosphere.   Would try the wurst plate which looked good.", "author": "Beth H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-19", "description": "The food is so good here. I randomly stopped in one day on my way to the train and I am so glad I did. We started with the giant pretzel, I had the goulash and my bf had the burger. Everything was delicious. The atmosphere is great with the sky lights and the bench seating, the staff is super friendly and the music is great. Go her, you won't be disappointed!", "author": "Jillian V."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-11-15", "description": "This place is fine, but nothing spectacular.  I'm not a huge fan of their flatbreads, I had the one with goat cheese and caramelized onions (two of my favs) but it wasn't that great for some reason.  Not that much flavor, I guess.  The beer selection isn't bad and the prices are pretty standard.  It's a good spot to sit outside if the weather is nice, but nothing to write home about.", "author": "Cara M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-19", "description": "I've been here twice and really enjoyed my experience both times. The food is great with a lot of options to chose from and their draft beer selection is awesome as well. The atmosphere is great with a laid back, cozy vibe.", "author": "Tai M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-24", "description": "Pretty good, and to be honest they would have gotten a five star had they not had an issues and not been able to serve beer. That is kind of bad for a beer garden. I hate to penalize for that, but it did take away from the atmosphere and the fun we were having there. The food was great, though. The service was equally great. One point though, they do not accept American Express, so if you are travelling for work and have an AMEX for your corporate card, sorry folks you are out of luck. Other than that it is a cool place to grab a bite to eat and a good beer in Brooklyn.", "author": "Charles D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-11", "description": "There's really only one thing about this place that is 5 stars worthy, but it sure keeps us coming back at least monthly. UNLIMITED mimosas and brewmosas. What us brunch for anyways? We also enjoy the open seating at the picnic tables and the skylight. Good vibes in this place. Usually good for groups, you just have to have someone saving your spot pre-noon rush. Also, there are usually some babies in here (to be expected in the neighborhood) so I'm guessing the families feel it's a child friendly place. \nWe would prefer slightly more attentive drink service, but nothing to complain about. Also, did I mention the unlimited drinks brunch!? The food is ok. Really wish they had something on the menu worth mentioning. Maybe they will add something soon. I'll let you all know, bc I will be back monthly for as long as I live in NY.", "author": "Grace C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-01-16", "description": "My wife and I had brunch with my son and his boyfriend Saturday afternoon. They had been there previously for dinner and had a positive experience. We ordered drinks and a pretzel which was a bit burnt but OK. We ordered meals and waited for about an hour for service. The brunch snitzels were OK. The house Benedict was under seasoned. But the worst was my wife's order, the German brunch which was nothing like the description, no croissant, no sausages, no fruit salad and actually delivered 10 minutes after the other entrees...without the soft boilled egg delivered another 5 minutes later and was hard boiled. A very poor kitchen and management. Staff was lovely and made the experience tolerable.", "author": "Glenn G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-03", "description": "I will say I came in and sat at the bar my first couple of times here. Had some awesome German brews and a pretty tasty brat (fries were fries). I couldn't understand why this place wasn't a sure 4.0 stars. \n\nThen we decided to sit outside one day, and I realized that the service away from the bar is severely slow and lackadaisical. A server meandering around occasional clutching an iPad to place orders without any real objective. Should I check on the table with empty beer glasses? Ehhhh... I'll swing by the closer table first, take an hour to grab them extra napkins and then see if I make my way over to that other table.\n\nLook - I love the beers and the food is solid. I give it 4 stars based on these things. The service is a 2, and its just a lack of urgency. Beware if you are in a rush or are impatient - just sit at the bar.", "author": "Drew H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-02-20", "description": "35 min wait for a Brat and fries is just silly.   And it wasn't that good.   Can't blame it on a Saturday lunch rush hour given I ordered a little after 2pm.  \n\nPushed myself to write this after coming here at least 10 times.  From hair in the food to lipstick on the mugs.  Just stupid silly management.  \n\nWhy do I continue to come back? Convenience.  Stupid silly me.", "author": "Luis U."}], "servesCuisine": "German", "priceRange": "$11-30", "name": "Black Forest Brooklyn", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "733 Fulton St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/SeINe6YLs2K5rJB8tUD8rg/ls.jpg", "@type": "Restaurant", "telephone": "+17189350300"}