{"aggregateRating": {"reviewCount": 364, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-10-18", "description": "I really wanted to give Black Forest another try so I came back on a Thursday evening for dinner. I'm upgrading my review to 3 1/2 stars cause I'm not quite ready to round up yet. \n\nIt wasn't nearly as crowded as the last few times I went (all peak-hours in their defense) and the service and wait times were significantly better. The food was delicious and the experience overall kind of made up for that crummy night earlier this year. I'll definitely go again because the food is great and I can forgive the last experience, but I'll definitely never forget.", "author": "Mel G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-08", "description": "Awesome decor. Love the reclaimed wood tables and community style seating. Hipsters abound but the wurst, spaetzle and kale apple salad are all very legit making the mustache wax and baby bjorn toting hipster tools bearable. \n\nDecent lunchtime service. But $3 charge for gravy for spaetzle is a bit crazy. I believe $6 is enough for the flour/water that comprises spaetzle so please throw in the gravy.", "author": "Glen R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-06-06", "description": "Came here for lunch with my parents and had the schnitzel. It was pretty awful. Thin to non-existent, dried out piece of meat that was overly breaded, burnt and overcooked. Your basic French fry and a wilted salad came with it. My father who's from Germany also thought it was terrible. \n\nThe restaurant was empty and it took almost an hour for the food to arrive. We had to ask them to check on it. The food arrived almost cold. So I think it had been sitting back there and the waiter forgot about it. \n\nI would only go back for drinks.", "author": "Pete H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-06-01", "description": "The service is horrible and the food isn't good.\n\nI stopped by with my boyfriend on a Sunday recently.\n\nStrike 1: We sat in the outdoor patio and our table had a little water on it from the last patron.  Our waiter noticed it right away and said he'd wipe the table down, but he passed by our table a good 4-5 times afterwards without doing so.  Every time he passed by he said \"Oh yeah, I gotta clean that off for you\"...but kept forgetting.\n\nStrike 2 - 2.5: After that, it took a while for the waiter to come back and place our order (it wasn't that busy) - we finally stopped someone who seemed like he was part of staff to place our drink order.  We also ordered an appetizer and two entrees...the app came out at the same time as the entrees.....\n\nStrike 3: Our food arrives but they didn't give us any cutlery (I guess we were supposed to eat salad with our hands).  We waited for about 7-8 minutes before my BF finally got up and went inside to ask for cutlery and napkins. W...T...F... \n\nJust when I started to question whether I was being a diva about the whole matter, the patrons next to us started complaining about how they had been waiting forever to simply order food (they HAD been there a while...I just figured they were there for drinks). They went inside to complain and then stormed out of the restaurant.  Then we heard two other tables behind us complaining about the service.  I was definitely not having a diva moment.\n\nAnd I definitely won't be back.", "author": "Tara J."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-11-02", "description": "I left my new hat and called immediately after leaving.  The employee said he had found it exactly where I left it.  I asked him to confirm it was cashmere and that I could pick it up tomorrow.  He gave me his man and assure me that it would be locked up and safe for my pick up.  I just returned and the manager working was not so kind.  My cashmere hat was gone but another black on was in the office.   Basically, someone on the inside took mine and the manager was rude about it.   Just kinda bums me out so I writing this which I never do.  The manager just wasn't cool.   I trusted the employee and then management made me regret trying to believe someone could hold there word.\nMy fault but shit just admit someone took it after it was put in a safe place.", "author": "Brook K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-16", "description": "Great food. Awesome beer. If you want tasty sausage, defenetly you should go here! Price is reasonable for the taste. \nSalad was also fresh and good.", "author": "Akane G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-12", "description": "Cool place. Simple and good beer, for me this is enough for a Sunday afternoon. I got there at 7, and there was no place to seat outside. But enough room by the bar inside to enjoy few cold ones.\nI tried their sausage. And I must admit that it wasn't that great. The bread wasn't fresh and honestly just didn't taste that good.\nBut the beer and the atmosphere wasn't bad at all. So they definitely deserve a positive review. And yes, they will see me again!", "author": "Fred N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-31", "description": "Never had German food per se.  Came her with my brother and son who are curios eaters.  In saying that, son had a burger.  My brother and I had chicken and pork schnitzel with mashed potatoes, spicy citrus kale and shoe string fries with spatzle with gravy.  Can't remember the drink but my brother had a grapefruit beer that he enjoyed.  Vibe is very laid back, benches that you sit on, like an inside picnic.  Everyone is chill and I'm sure it great for beer drinkers.  There is an outside area for about 5 couples.  Not sure if I would come back again, not to say the food wasn't good, just not my speed.", "author": "Deb C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-04-08", "description": "Review is for a weekday lunch\n\nFirst of all, the \"lunch special\" isn't true - there is no free dessert with this. Multiple individuals around me ordering the lunch special at the bar did not receive desserts either, and I did not get one. So why even list it as being part of the (3) lunch special options? Basically this Wurst \"lunch special\" is the same as their regular all-day menu sandwich, so don't even bother looking at the lunch specials. Since, this isn't one.\n\nI just got back from eating lunch here and had to write this review right away. The dessert/lunch special thing just made me annoyed.\n\nThe bartender was super duper awkward.\n\nAlthough 4-5 German sausages are listed on the menu, there were only 2 available (I was never told why). I got the lange rote bratwurst (pork, veal and beef sausage) which tasted like a hot dog. The wurst came on a bun with nothing else on it. As a side there was sour kraut which had no taste, fries, ketchup and mustard.\n\nI work a few minutes away from here and was excited to potentially find a lunch spot but now I'm really meh about this place.\n\nOn the lunch special (WHICH DOES NOT EXIST IN REALITY) menu there is a jerk chicken sandwich listed, which sounds good... but not sure if I'll even return to try that.", "author": "Brigette K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-05-31", "description": "I finally had a chance to try their draft beers and food. Food was great, I really enjoyed their crisp and buttery flatbread pizzas covered in caramelized onions, toasty mushrooms and cheese, their warm, soft, salty pretzels and fried mushrooms with a creamy tangy aioli. I wasnt too fond of their beer options, I was really excited when I ordered their beer flight which includes 15 beer samples, but I was completely underwhelmed. I liked 1 (grapefruit flavored) out of the 15 beers but that 1 beer was good enough for me to return. I will definitely be back for a glass (ok probably a boot) of their Schöfferhofer Grapefruit beer and will definitely try the rest of their menu, oh and some Riesling too.", "author": "Maris F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-03-14", "description": "Newer is not not always better. \n\nBlack Forrest is the newer German Beer Hall (these are not Beer Gardens, people) in Fort Greene. It's about a year old and while I don't think it's bad, I don't see why I would come here. \n\nThe original German Beer Hall in Fort Greene is only a block and a half down. The prices are cheaper, the food is better, and it's more authentic. \n\nBlack Forrest seems like some commercial, money making, image, of a beer hall. As I mentioned the beer is more expensive, which would grant the owner more money. They offer more food options, but you must purchase most of them with sides. Like fries. Thus justifying why they jack up the prices. I'm sorry, I do not want their skinny burnt fries. After eating a brat from the place, my stomach was in knots. Not the best quality that I've had. The place doesn't even feel like a beer hall. I wouldn't know I was in one if someone blindfolded me and brought me in. \n\nIn the end, it's not awful, but the original one is just that much better. I could only see myself coming here if the other was shut down or too packed.", "author": "Mitch E."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-16", "description": "Food was good, service was fine, and space was roomy, but honestly this restaurant had some of the worst public bathrooms i've ever seen in my life. To the extent that I wouldn't even normally think to comment on a restaurant bathroom, but these were EXCEPTIONALLY filthy. And this was brunch time, not like 1am on a Friday night.", "author": "C.E. E."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-08-29", "description": "I would love to give this place 5 stars, because I have really enjoyed most things about it.\nI have been coming to this place every Wednesday night for the past several weeks because it is right next to where my company gets out of rehearsal. We then head from work to this place for a little drink and sometimes a snack. The vibe is cool, we like the decor, the menu, basically everything. But we have noticed a weird problem with the service...\n\nTo break it down:\n\nThe good:\nCocktails are tasty and creative, good beer selection, food is awesome. Sometimes we get this server who is super friendly and fun, and we love him. We only sit at tables now so we can get him.\n\nThe bad: When we drink at the bar (which we don't anymore) there is always the same bartender who is unfriendly and cold to us, takes forever to get our drink orders, and never checks back in. I was sitting at the bar with my friend and we were not greeted in any way. When we finally get to ask for our drink, the bartender is stony. We get our drinks (they are great) and say thanks (no response). We finish them, and decide we want another round and some food. NO JOKE--it took us an HOUR to get the bartender's attention to order a second drink and food. And we were sitting at the bar right in front of him the whole time. It was like he put blinders on and ignored us. \n\nThis guy has never smiled at us or had anything friendly or polite to say. As a group, we are not obnoxious, we always tip well, there is nothing for him to hate about us. The friend I was with works in food service, and has commented that his behavior and service is abysmal, and there's really no reason for it. \n\nI don't like to rant like a have a personal vendetta against this one server...it's just baffling to us.", "author": "Natalie J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-18", "description": "Been here twice for a birthday party and before a Nets game. The food is decent, the atmosphere is cool. I'm not into most sour German wheat beers, so....", "author": "Patrick O."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-02", "description": "Service is number one here and I really appreciate that.\nFood is a very close second with authentic dishes and portions.\nBratwurst is great with stringy crisp fries, sauerkraut, mustard, and ketchup.\nMy only recommendation would be to get some curry ketchup!I'd return regardless.\n\nBummer that the only garden area of this bier garten is the sidewalk dining.\nAll and all, a lovely place to dine with very good service which deserves a higher than usual rating of 4 stars.", "author": "Mitch B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-02-21", "description": "Stopped in for dinner + drinks with a friend before a performance at BAM.\n\nService was very slow. Food was very underwhelming. Environment was dull.", "author": "Dan R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-02-21", "description": "I chose to go there for my birthday. A very rude man did not allow us to get seated. There was an open table. The rest of the place was full. He mumbled something inaudibly and dismissively walked away. So we approached the bartender and other person working there who told us it was absolutely fine to be seated. The cleaning man came back and rudely told us to get up. Very unpleasant and inappropriate. \n\nWhat a way to put a damper on my birthday.\nWe walked out.\n\nRecommending training for customer service.", "author": "Lebleena L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-12-26", "description": "Stopped in for a drink on Xmas eve. The bar was sparse 1 bartender who didn't have the decency to acknowledge us, rude with his back turn a lax staff with same attitude. We sat at the bar patiently, he turned around and continued to ignore us! We promptly got up and left! which he could careless and went about his business with his head up his #@*! I do not recommend this place! lame bartender with no social skills along with an equally obtuse staff!!!! This is prime example of how a business who, in their smugness think that they've arrived/achieve some success take a HUGE nose drive, due to poor customer service!!! Good riddance!!!", "author": "gary s."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-06", "description": "Do you like rare imported German beers? How about wurst, bretzles, or landjager? If you do (or have zero idea what the hell landjager is and want to find out), Black Forrest is the place for you. Hanging out on Fulton St in the amazing bar/restaurant triangle formed by the aforementioned, Lafayette and South Portland, this indoor Biergarten is guaranteed to make even the most discerning beer lover smile. They have one of the most authentic lineups I've seen in a while; ranging from standards like Hofbrau (5.1%abv) and Radeberger (4.8%abv), to the super authentic Weihenstephan Kristallweizen (5.4%abv - fun to drink, even more fun to say) and Schneider Aventinus (8.2%abv - careful here this one is easy to drink and WILL sneak up on you). Best part about all of this though? They take debit cards! No need to pull out 100$ for beer like at die stammkneipe up the street (I love that place, not knocking them -  just wish they would take a card). \n\nThe authentic ambiance this place has going on cannot be overstated, you get the feeling that the owners are from a little town somewhere in the south of Germany (probably because both of them are). Walking in you will be greeted by one of my favorite looking bar tops in the city; it's simple, made of wood, and curved in a way that really highlights the crown jewel of this place - its tap lineup. In the front left corner adjacent to the bar, you will find an awesome corner nook complete with a fireplace - in the winter this is one of my favorite places to sit and have a beer in Brooklyn (if you can't find me and its December, this is probably where I am). The rest of the place is well lit, full of picnic style benches / tables, and has an overall authentic feel to it (the cuckoo clock collection on the wall is hysterical to me, not sure why).If you find yourself here while the sun is still up, or if you swing by on a weekend you'll find young families with kids in tow; Its cool to see such an authentic European vibe in the heart of Brooklyn. If it's warm enough, the outdoor seating is a perfect place to people watch and drink the day away. I haven't had too much off their food menu, but the bratwurst and original flammkuchen (sort of like German flat bread pizza) were very good, though a bit on the pricey side (authentic / specialty foods usually are in Brooklyn though).  They have Brunch (add 15$ to any entrée for two hour unlimited mimosas/beirmosas/Bloody Marys ), so this review is sure to get a food update soon. \n\nAbsolutely worth checking out the next time you are in Fort Green -  stop by for a half (or full if you're like me) liter of authentic German beir, in an authentic Brooklyn Biergarten.", "author": "Chuck C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-28", "description": "Having lived in Bavaria for a few years, I am pretty skeptical of any restaurant that labels itself as \"authentically German.\" This place has blown me away. \n\nTheir beer is delicious, don't be afraid to order it in the recommended hefty portions. In terms of food, what I love is that they add a little American twist to their dishes. The Käsespätzle were amazing- slabs of bacon were the perfect addition to this German-style Mac and cheese. The Schnitzel was juicy, crispy, and tender. The mashed potatoes were some of the best I've ever had. Even the side salads were delicious. I recommend getting a side of apple sauce to eat with the Schnitzel.\n\nThe service was great- communal style tables create a friendly, warm atmosphere. Our waitress was lovely, and gave us great suggestions. Needless to say I will be coming back here for their namesake dessert.", "author": "Matilda B."}], "servesCuisine": "German", "priceRange": "$11-30", "name": "Black Forest Brooklyn", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "733 Fulton St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/SeINe6YLs2K5rJB8tUD8rg/ls.jpg", "@type": "Restaurant", "telephone": "+17189350300"}