{"aggregateRating": {"reviewCount": 364, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-25", "description": "Popper into the Black Forest yesterday to unwind have a few beers. The beer selection is fantastic. Above all though, the service is awesome- \n\n Specifically Lee \u0026 Laura we're friendly and engaging, and happy to chat with me while I was there, which is great. I will be returning soon to get a real meal with some friends", "author": "Patrick C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-10-02", "description": "Makes a foot long hot dog and calls it a bratwurst. Not busy and can't get a soda to your table.", "author": "Michael S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-12-06", "description": "Good food, but not great.\n\nFirst time here.  Sitting at the bar and amazed by our bartender's long locks of blonde hair.  Might be envious were it not for watching the waist length tendrils dip in and out of drinks. DISGUSTING!\n\nAnd they don't take American Express.\n\nOh well, thank goodness for so many other options in the 'hood!", "author": "Lynn M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-11-29", "description": "Plenty of seating indoors but really noisy. They have a good selection of German beer on tap but it's a little expensive. Also,  the service is a little on the slow side.", "author": "Jesse B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-30", "description": "Fantastic beers, poured well from clean lines, knowledgeable (but busy!) staff that graciously and painlessly accommodates families too. Great food at good prices. What more can you ask.", "author": "Kunal S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-11-03", "description": "Feeling swindled. Beer of the day seemed to cost $26 each. Ask before you order. Mediocre response from management. Food continues to be edible. But only if you're really hungry.", "author": "Faizal K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-03-06", "description": "Great concept, bad execution. Food and service have gone way downhill since opening. The owners seem confused as to how to be consistent with good staff \u0026 food, makes for a short trip to the \"DO NOT TRY\" list. Clearly their first restaurant venture.\nIts basically one big system error. Things are happening but not for the good, staff is working, but in the wrong direction, orders are being taken, but to no avail.\nSuggestion: go for the beer, take a gamble on the food (pretzels are yummy) don't expect much for service.", "author": "Juliet F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-09", "description": "Very good German food and beer. Sausages are the standouts -- Schnitzels not quite as good. Potatoes are also quite fine. Staff is friendly and charming though service can sometimes be a little slow. All in all a delight. We're here once every week or two.", "author": "Doug H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-03-31", "description": "Oh, yay, ANOTHER german beer hall.\n\nService is a total disaster. Takes ages to flag down someone to order, takes forever for the beer to arrive, takes forever to get the bill, and takes forever to pay.  It's also overrun with babies.  Since the whole german beer hall thing is becoming a totally fungible experience nowadays, you can go to any of the 3 others (maybe even more) within a 10 minute walk, and have a less maddening experience.", "author": "Matthew S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-05-30", "description": "I was surprised to see they expanded their menu to include more vegetarian items. The service was  border line ok , I felt the server didn't want to be at work . The food was disappointing , however the beer was on point. If I do return I would only get beer . I would still recommend this place as a good spot for beer . As for service , the other servers were great and engaging , the server we got was just bad !", "author": "St George S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-28", "description": "This is definitely one of my favorite spots in Brooklyn. The atmosphere is great, and I've always had wonderful service. Beer choices are perfect (love Weihenstenphaner) and you HAVE to get a pretzel. I usually get their curry wurst which is good (not the best ever, but who can compare to Berlin right?). But the last time I was here I was blown away by two other dishes. I got the kasspatzle and fell in love. It's essentially german mac and cheese (with bacon) and while it's a bit heavy, it's truly exceptional. My boyfriend had the kasebratwurst, which was one of the best wursts I've ever had in the U.S. Even their fries are great. Get one of these two dishes on your first visit and you won't be disappointed!", "author": "Steff L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-08-28", "description": "Awesome location, space, and bottomless mimosas.  But service/staff could be a bit more with it. And each time I've eaten here, there's been something off with my meal: poached eggs cooked all the way through, stale bread for toast, side salad when I requested a sub for salad.  Really simple things where it seems like people aren't paying attention.  Easily fixable and I hope it happens!", "author": "Ali G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-02-06", "description": "This was my favorite neighborhood German restaurant as they always have great service tasty food and great beer. But this time me and my partner sat at the bar to eat and for some reason the Asian bartender must have been having a really bad night and was taking it out on me. I thought to myself does he think I somebody else whom he hates because he was very rude to me and kept giving me bitchy queen attitude for no reason. When I ordered the pretzel he judgmentally asked me if I was sure because it a really big portion (as if I was going to eat it on my own and why does he care what a customer orders as long as I'm spending money right?)it was the strangest thing with the eye rolling any brow raising. I was really offended! Anyhow we didn't have to deal with him very much as he decided he would just take our order but didn't come back to see if we needed anything else so another guy starter helping us instead. (Who was really nice) But by a the end of dinner I had such a bad taste in my mouth that I think I'll never come here again. FYI there's another German place right across the street and another down the street across from BAM. Ive had bad service in the past but this was so in your face that I didn't leave a tip and didn't feel any guilt for doing it.", "author": "Robbie G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-18", "description": "Food delicious, service is quite slow, didn't bother me but did bother my husband, overall we had a great two dates, the curry wurst is the best, very fresh food, and think that is why they take their time serving. Good overall price, wine is delicious, German wine, good beers as well, great range said hubbie!", "author": "Laura G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-06-15", "description": "They seemed a little overwhelmed the night I went. We were a large group but the place had space to spare so they shouldn't have been that flustered by us. In any case they did alright with service under the circumstance if I give them the benefit of the doubt.\n\nHowever, 12:45 rolled around and they were very rude and aggressive about last call and then kicking us all out. I get it you're closing and want to go home but some of your beers are rather big and making me and my friends chug while being shouted at from staff atop the bar and tables was unpleasant. Would have cost you maybe 10 more minutes to let us finish at a normal accelerated pace. Please stop closing this way it really puts an aggressive tone at the end of the evening.", "author": "Jesse S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-28", "description": "It's a beer garden with outdoor seating what more can you ask for. Ready Set Go! Perfect spot for the summer people watching!", "author": "Brian M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-31", "description": "I love coming here whenever I feel a bit homesick. Coming from the Black Forest region myself, I can testify that this food comes pretty close to what I consider authentic south-western German cuisine. Make sure to check out their Flammkuchen.\nOverall: Great place, great food, great beer! Can definitely recommend!", "author": "Alyssa M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-09-20", "description": "This review is for their brunch dishes; the sausages and other German fare might be better but I don't think I'll be giving it a try. \n\nI ordered the Black Forest \"Benedikt\" and have a couple of questions for the owners and chef: Do you realize that you are operating in NYC? Have you ever eaten Eggs Benedict at a reputable establishment in this City? Based on my experience as of this afternoon, the answer to both these questions is an emphatic \"NO!\" Never have I seen or tasted such a sorry excuse for a classic and ubiquitous dish such as this. They served the over-cooked poached eggs (yolks were fully cooked!!) on top of what they referred to as biscuits, which can only be described as a glutenous, tasteless mass of dough, whose only raison d'etre is to wick away every drop of moisture from your mouth. I tried to eat a second bite of this train wreck but gave up. Our server had no interest whatsoever in asking why I was sending my dish back uneaten. Perhaps she's used to it. \n\nMy husband ordered the French Toast -- again mediocre would be an undeserved compliment! It was soggy and underwhelming in every regard and that includes presentation. The food was dumped on a plate with no thought whatsoever. A single leaf of lettuce lay next to my dry eggs, making the whole dish look even more pathetic. \n\nI left the restaurant hungry and made a beeline for Baba Cool, a cafe right behind this place to pick up a delicious egg sandwich on my way home.", "author": "Ruchika M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-02-07", "description": "Decent food. Horrible wait staff. After we ordered our drinks the waitress, Gloria, disappeared. She was going to other tables but not ours for some reason. \n\nWe asked the bus guys to get her and they assured us she was coming but never arrived. It was extremely disappointing but oh well. The lack of effort by the waiters was extremely disappointing and ruined our dining and drinking experience. \n\nThe atmosphere was nice and the beer selection was good as well.", "author": "Bojan S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-04-02", "description": "My husband and I love German food so we were excited to find out about this place that's just a few neighborhoods over from us. The last time we went we loved everything -- pretty good food, a decent selection of draft beef, and a cool vibe. However, today when we went, my chicken schnitzel was incredibly rubbery. I'm actually shocked that they served something like this. I hope it was just a bad day for them and they don't serve chicken like this to others, but I'm too traumatized to go back to find out for myself.", "author": "Kathrine S."}], "servesCuisine": "German", "priceRange": "$11-30", "name": "Black Forest Brooklyn", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "733 Fulton St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/SeINe6YLs2K5rJB8tUD8rg/ls.jpg", "@type": "Restaurant", "telephone": "+17189350300"}