{"aggregateRating": {"reviewCount": 364, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-04", "description": "I love brunch.\nI love German food.\nI love beer. \n\nBlack Forest Brooklyn has all of the above. I rallied up some peeps to try out their brunch last Saturday. I was not disappointed. Actually, I already know that I need to go back. There are items I missed that looked mouth watering like the over sized pretzel!! And some of the crafty beers.\n\nFor an additional $19 you can get UNLIMITED drinks (mimosa, beermosa and Bloody Mary's) for 2 hours. I was on aunt duty after brunch so I stuck to the one beermosa. The beer actually cut back on the acidity of the orange juice. It was a great breakfast boozy brunch beverage. \n\nOn the food menu, I was drawn to the rolled omelettes. You get to pick three ingredients, it comes with salad and potatoes. I had to have kale, goat cheese and smoked salmon. When the food arrived the potatoes were cooked just right. The salad was well seasoned and actually had flavor. Normally the side salads are left behind because of their boring existence. On the table there was a collection of mustards and ketchups. Even the the Berlin fave condiment Curry Ketchup was in the basket. There was a lack of hot sauces. And what they brought when you asked was a tiny bowl of some sort of chili paste. Spicy-madness! \n\nThis place is located in Fort Greene. We had to move our chair a couple times to let some strollers through. \n\nI like that the restaurant has a variety of seating. There's the intimate window catching up sofas, the anti social bar, the small intimate four tops and the rager large tables. \n\nThere's also cute German decor like a collection of cuckoo clocks. Adorable spot for brunch and the food is a nice change of pace. And a great neighborhood to walk around and work off the feast.\n\nI will return for the German breakfast, spaetzle, potato latkes and apple sauce. Lecker! I can't wait.", "author": "Carolina S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-26", "description": "If there's 2 things I do poorly when sober, it's making low stakes decisions and understanding the metric system. That's what makes Black Forest so dangerous for me - a huge selection of beers all in liter measurements. \n\nTrying to do the mental math of how many pint glasses are in a liter (for the record, it's 2.11 pints), I decided to go big and have my beer in the biggest size they had - the boot! Thankfully for my liver, they had no more boots available, so I settled for a liter. \n\nWith the sizing questions out of the way, I had to make an even harder choice - which type of suds to get. Unlike some bars, Black Forest doesn't offer Bud Light or Corona on tap - only authentic German beers here! With a flavorful Radeberger pilsner I sat down with some friends, and dug into one of the biggest pretzels I had ever seen. Overall table service is a bit spotty - servers will show up right as you sit down, expecting you to know what you want, then disappear for what seems like hours once you've made your decision.", "author": "Edward M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-07", "description": "Stopped in for a quick bite. Was left in awe with the different flavors that exploded in my mouth. I had the savory sausage in a bun with string fries. The food was juicy and when i asked for hot sauce i was given traditional hot sauce and a chili oil type of hot sauce. Was the perfect topping to my sausage. \n\nI also had the truffle flatbread, which was to die for.", "author": "Irene P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-01", "description": "Nice and spacious. A great beer selection, even by bier halle standards. They have a large menu and the food is fine, but a bit pricey.", "author": "Randy H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-20", "description": "I love beer and I love yummy food. I dislike small crowded spaces and loud music that forces me to scream at my friends. It doesn't take much to please me and Black Forest Brooklyn is an establishment I fully support as a local and a foodie.\nBlack Forest Brooklyn introduced me to German food, and I will forever be grateful for this place! Spaetzel, schnitzels, warm toasty pretzels with OG mustard dipping sauce- I could come here just for these and be so happy! I also very much enjoyed the bratwurst gravy and biscuit on their brunch menu. Their house salad is colorful and the light touch of vinaigrette makes it so refreshing to pair with fried foods! The menu has a large selection of food and drinks but that is not something I am complaining about because I cannot wait to come back to try all their goodies!\nThe first time I came here I shared the beer flight with my best friend because we both had no preference (and no idea whats what lol) for German beers. This was a perfect introduction to 13 beers, each with their own distinct flavor. \n\nNow I opt for half a liter of my beer of choice so I can sit, relax, and eat like the queen I dream to be.", "author": "Jodie Z."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-25", "description": "This review is for the bar only - came here for beer, not realizing that this place is more food/dinner oriented. The bar area feels very distinct from the dining area. There were some people hanging out and reading or working on laptops while enjoying a few beers at the bar, which felt really casual and relaxed. The sizeable beer list is typically German, with a few craft options, and is accompanied by some cocktails and vino. \n\nIn contrast to the chill bar, the rest of the restaurant felt a little Disney-fied and almost tacky. The waiters are garbed in matching red flannel with suspenders and the decor is a little heavy on wood and wrought iron. Strangely, the music was mostly pop and rock oldies. Kind of created a strange atmosphere, which I want really sure I was down with. It is located in a central Brooklyn location and the dining area has a lot of huge tables, so this would be an ideal place for groups.", "author": "Natalie H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-24", "description": "Food took really long to get here. \n\nDrinks are really good. The food takes a very long time. I have a beer and a Mamosa mixed together. Not my favorite brunch place. But I will visit when in the neighborhood.", "author": "Angel N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-20", "description": "Cool beer garden with lots of indoor and some outdoor seating. Lots of German style beers on their draft list including a bunch of Hefeweizens and pilsners. They also have some great food. We had a small pretzel and the potato latkes which were great. I'd definitely recommend both. I also had the currywurst with fries. The service was friendly and attentive. It's a very cool spot to hang out at.", "author": "Joseph T."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-01-21", "description": "We ordered five bottomless mimosas and only received two mimosas in a one and a half hour time period. We finally had to call a manager over to even get a third mimosa and he told us they would take the bottomless brunch off of our order. When we went to get out check they had actually added a 6th bottomless brunch charge instead of removing all the charges as they had said they would. When we spoke with our waiter and the manager, they ended up only removing three of the charges (one of which shouldn't even have been charged). We consistently had to flag people down to even get water refills and the food is not worth the bad service. Save yourself some time and don't come here.", "author": "Patricia B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-03-03", "description": "Stopped in for lunch on a weekday afternoon. Not busy at all. The dining area was spacious. I can see how it may get crowded with elevated volume. I enjoyed the music being played and the staff was courteous. The menu looked okay.  As an extremely selective eater, I didn't try the more traditional menu items. I enjoyed my humungous fish sandwich, sides, and fries.  The very mini ice cream cup was a nice treat at the end. I'd go back for lunch in the future, but not sure if I'd be willing to go when it's more packed, or if I'm in a crunch for time. Service was good but a bit slow.", "author": "Empress P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-27", "description": "A nice German bar next to the Barclays Center. Have Aimee very good sausages, good wings and a big Corbin of beers.\nThe staff is friendly, service is not bad.\nThe waiters dress in traditional German outfits.\nI would recommend this place.", "author": "Joseph S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-28", "description": "Eh, a German beer hall-ish thing. Not even particularly cheap. Not that cool, decor-wise. Flat out average in my book. Sure, the beers they have are the classics you'd expect from a German beer hall. I'm sure the food is decent, but I didn't get to try it.", "author": "Fred A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-09", "description": "Such a great time. So much so that I wrote a review for my food blog. Have a read, and get yourself to Black Forest Brooklyn! \n\nhttps://ahangrywife.com/2018/11/09/black-forest-brooklyn-where-the-brats-are-big-and-the-pretzels-bigger/", "author": "Alisha A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-05", "description": "I've been to Black Forest for lunch many times. The service here is hit or miss but mostly it's okay. I felt the need to write a review today because the service today was exceptionally bad. \n\nWe sat outside today which was nice. The waiter came over and seemed nice enough. We ordered from the lunch menu and then I tried to order their happy hour beer. Two of the three were unavailable- it's a Biergarten- how do you run out of beer? Anyway, I asked the waiter if we could substitute a beer since they didn't have two of the three. He said no. That didn't make sense to me so I asked to speak with a manager. He told me there was none. No manager? I asked him if there was anyone we could speak to- again, he said no. Wow. I'd never been to a place with no management that a customer could speak to when there was an issue. \n\nOn to the food- we waited forever for the food to come out. I had to go in to the restaurant to check on it because, it's lunchtime on a weekday- we had to get back to the office. When it finally came out... it was cold. Whyyyyyy? We waited so long... but we didn't have time to wait for new food... so, it was what it was.\n\nWhile eating this cold food- I asked the waitress if there was a manager- she replied, \"sure, I'll go get him.\" Wait, what?... why was I told that there was no manager?!! I. WAS. LIVID. \n\nIt's one thing not to be able to offer your customers alternatives when you don't have something in stock. It's a completely different animal when you tell your customers that there is no manager you can speak to when there is. I'm not sure what that waiter's deal is- maybe he's new. Doesn't matter. I would rather have someone tell me they aren't sure and go ask- then straight up tell me no, and the guy is right inside. \n\nI like this place (normally) for their food- but if I was a first time customer today, I'd never go back. Even now, it will probably be a while before I even think about going back there because I'm so upset that I feel like the waiter lied to me. One star for you Black Forest- because Yelp says I can't give you less.", "author": "Lissett L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-04-07", "description": "The food was mid to bad, but the worst is the service! it took them 38 minutes to serve us a flat bread with cream cheese \u0026 smoked salmon and a German breakfast, something that in a slow place in NY will take 10 min, the place wasn't crowded and no one came to tell us anything (sorry, we arte late because...) do not come!", "author": "Claus C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-12-01", "description": "I want to start by saying that I don't know much about German food so I'm not expert on things like worst and schnitzel. I don't actually know what schnitzel is. Whatever this food was I wasn't too impressed. We never got some of our order. The process I had to go through to pay was insane. I couldn't get anyone to get me a check or take my card. I ended up going inside and waiting about 10 minutes for them to find the right person to pay.", "author": "Moles B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-03-30", "description": "While the food was very good, everything else about our visit at Black Forest was abysmal. They were extremely understaffed, so it was nearly impossible to get condiments or more drinks. Our waitress walked out before we got our food and we never seemed to have a new one assigned to us. The drinks were by far, the worst part of the experience. Stronger does not equal better where gin is involved. My gin \u0026 tonics tasted like lighter fluid. I switched to another cocktail and it was equally terrible. It was a shame since the actual food was great.", "author": "Linda M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-10-31", "description": "Wtf. I don't think you should order food here. Like ever. No matter what, especially if you're hungry because they will take your order but the part of the deal where they actually bring the food may never happen. Please Black Forest just serve the beers in the giant mugs and leave us poor hungry people alone.", "author": "Zack L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-12-01", "description": "I dont know how this restaurant has managed to stay in business let alone open another location. I stopped going there 2 years ago because the service was horrible. Went back tonight(because someone else chose it) and was shocked that its still terrible. Servers that dont seem to know the menu or have an opinion about it. Cold food. \nToo many choices in NYC to go back", "author": "Simone R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-03", "description": "Beer flights. Get their beer flights. Not alone of course, duh. Well unless you want to. But their beer flights are great. You get 13 beer, each at about 6.7 oz/0.2L and oh man. You can try it all! It's a good amount if you're just wondering--seriously. Granted, there were only me and a friend when we got it but still so amazing that you can literally try every single German beer on their menu (minus one, if I remember correctly)!\n\nAs for food, it was pretty good. I had a good time there and I love the ambiance. It's so chill and just a great place for you to hang out with friends. I would say this is a place where you hang out with a group of friends or a couple of your friends. It's a very casual and chill place. I would love to come back here because I actually miss it!", "author": "Suki W."}], "servesCuisine": "German", "priceRange": "$11-30", "name": "Black Forest Brooklyn", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "733 Fulton St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/SeINe6YLs2K5rJB8tUD8rg/ls.jpg", "@type": "Restaurant", "telephone": "+17189350300"}