{"aggregateRating": {"reviewCount": 217, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-11", "description": "This is probably my favorite middle eastern restaurant in the city. Very delicious food comes with warm hospitality, you would like to come over again and again, you will feel like home. Price Wise you get way more for your buck.", "author": "Samuel A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-22", "description": "This place is great for a casual dinner on the cheap side. We stopped in here after a walk across the Brooklyn Bridge and had a great meal.\n\nAs soon as we came in with our young son, our server brought over a large toy car for him to play with -- which he enjoyed, and we were grateful for his distraction during the meal. We had a falafel sandwich, the garden salad, and a labna salad with pita. The food came out quickly and was very tasty. We especially enjoyed the labna. \n\nWe'll definitely stop in again next time we're in the area!", "author": "Peter R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-02", "description": "I was very happy with this place the first time I went there. But now they have hired a very rude waitress. My husband and I were sitting there for about 20 minutes waiting for the menu and the waitress was making eye contact with us the whole time and just not caring. We ended up eating at another place nearby. This is not acceptable.", "author": "Leila N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-04", "description": "The food at Tutt Cafe is so good and their staff is incredibly kind. My whole office orders from here for lunch and it's always a wonderful experience!", "author": "Connor R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-01", "description": "My wife and I eat here one to two times a week. They recently went through a refresh of the restaurant but the quality of the food has remained the same.", "author": "Dan P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-02", "description": "Will never try this place again. Such a poor customer service! With almost three occupied tables in the entire restaurant, I sit there for 15 mins and no one even asked what you are doing here!", "author": "Saman A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-08-17", "description": "Meh. Can't figure out why this place is so highly rated. Restaurant is a dump. Staff is surly and difficult to communicate with, temp is uncomfortably warm, and there is an ATM right next to the counter (cash only.) While the food wasn't awful, it is far from the best middle eastern food in NYC. Falafel was dry, chewy and not particularly flavorful. They didn't offer any sauce and we didn't think to ask. Food definitely needed some tahini, hot sauce or yogurt to help it go down. Hummus \u0026 baba were fine but lacking in flavor and didn't leave us wanting more. We didn't order a pitza. Judging from the other reviews.... perhaps that's where they excel.\n\nIMHO Bedouin Tent is much better.", "author": "J A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-01", "description": "My lamb platter was solid enough and managed to tide me over on a pretty long flight. I wish the gave a bit more of the sauce.", "author": "Misha T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-14", "description": "This restaurant is incredible and deserves more attention! My girlfriend and I came in around 5:30 and we were the only ones eating inside the store. We felt very well taken care of. My girlfriend ordered the lamb plate and I had the chicken. The food was top notch, delicious, and affordable. They also brought us out a complementary serving of cake which was fantastic- like a sweet cornbread. I highly recommend this restaurant to anyone looking for authentic Middle Eastern food! Good, friendly service in a clean environment.", "author": "Ben F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-06-06", "description": "3.5 stars. I have mixed feelings about Tutt Cafe. On the one hand, it's a rock-throw from my apartment. And given my patience (or lack-there-of) for cooking, this is a huge plus. The wait staff is also very kind, the service is fast, the prices are right, and oh my god the complimentary Lebanese sfouf cake is So. Ridiculously. Good. Think cornbread... but better.\n\nOn the other hand, the falafels I tried at Tutt just weren't that fresh. When I cut through the falafel ball with my fork, the outer shell resisted and was rubbery. The inside was dry. This is a no-no for me.\n\nIn all, I think I'll come back for the convenience of it (and for the sfouf cake) but it's not my favorite spot in the neighborhood.", "author": "Shannon G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-19", "description": "I hate that I wasn't that hungry when I came here. I was showing a few friends the city and decided to catch a breather here. Very easy location to find. It was my first time here. We ordered chicken sandwiches and were not disappointed. Pita was incredibly fresh and the chicken was full of flavor. The only complaint I have of the sandwich is that I would have liked some more sauce, sandwich overall was a bit dry but still good nonetheless. I really wanted to try their falafel plate but unfortunately really wasn't that hungry hence my first sentence. \n\nThe waitstaff was incredibly friendly, I ordered a loomi (Egyptian drink) and it was my first time having it. After I tried it the waiter came up to me and said that if I didn't like it he would exchange it for another at no cost! A friend had the hibiscus drink which was really delicious but I didn't mind my loomi drink. They also gave us cornbread on the house which was really generous on their part. Decor leaves something to be desired but don't let that keep you from going in and trying the food!", "author": "Matheus D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-16", "description": "This restaurant is great. We walked by and saw the ATM sign and peeked in. Decided to stop for lunch and we were not disappointed at all. \nI had the falafel plate, and a vegetables pizza to share with a friend, and our order came super quick\nThe pita was super nice and warm and the falafel were amazing- not dry at all. The pizza was made on pita bread and was splendid too. \nThe only downside is that they didn't have credit cards. They did have an ATM in the store but as tourists we couldn't use it anyway.", "author": "Agus V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-27", "description": "The food is pretty good I was expecting a little more from the chicken plate I got. \n\nThe service was amazing, they are so welcoming and the server gave me a cornbread infused with honey and almonds it was so good.  I'm so glad I came here made me feel really great.", "author": "Gian Carlos D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-05-29", "description": "Food was excellent but I am appalled with the service here. Didn't know it was cash only (didn't see any sign), so I had to pay their ATM fee which sucked. Then I left a 13.5% tip because I tip based on my satisfaction with the service and the service wasn't good. \n\nThe waiter started yelling at me in the middle of the restaurant demanding a 16% tip (the bill was small so it was a 50 cent difference). Absolutely ridiculous and unacceptable. There's no such thing as a minimum tip. I wish I took back my whole tip and walked out.", "author": "monica r."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-04-04", "description": "Got a falafel wrap and was generally disappointed. It was relatively dry and I was expecting many more toppings, but pretty much got falafel, lettuce tomato and some light dressing.", "author": "Emmett F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-09-04", "description": "Pros:\n- Discrete hole-in-the-wall atmosphere\n- Best pita and hummus in the neighborhood. By far. \n- Huge portions!\n- Super friendly owner and staff\n\nCons:\n- Painfully slow service\n- Cash only\n- Lamb was dry and tough to eat\n- Chicken pitza was forgettable", "author": "Scott G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-29", "description": "The lamb at this place is amazing. The sauce it's smothered in taste like heaven on bread.", "author": "Alex C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-17", "description": "Delicious chicken kebob platter with fresh pita!! Babaghanouge and yogurt dip is my favorite!", "author": "Tony C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-17", "description": "My friend and I randomly stopped in here after wondering around the neighborhood.  We saw that this place had a 4 star rating on Yelp and decided to give it a try.\n\nI had the falafel sandwich and my friend had the falafel platter.   I think the sandwich was good...not your typical presentation, more like a wrap.  I was stuffed after and fell into a falafel induced coma afterwards.\n\nMy friend said her falafel platter was very good.  The balls were crispy and she opted for the side of baba ghanoush.  \n\nDecent option if you're in the area and craving Mediterranean food.", "author": "Neelam P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-25", "description": "You can find this little Middle Eastern gem of a cafe by taking a five minute walk down Hicks Street, a beautiful tree lined block of brownstone buildings, around the corner from the Clark Street station for the no. 2/3 train.\n\nFor me, it's always first and foremost about their pita.  I build meals around its chewy, doughy, fresh baked deliciousness.  The best in New York City.  Tell me it's not.  Get it wrapped around tasty slices of lamb or on a platter with falafel, their creamy smooth hummus or smoky baba ghanoush.  It's authentic and it's all good.  \n\nTry a take out.  Maybe bring it over to the Promenade, just a couple blocks away.  Sit yourself down on a bench and take a look at Manhattan while you munch away.  I think you'll like the experience, the food.", "author": "Lisa M."}], "servesCuisine": "Middle Eastern", "priceRange": "Under $10", "name": "Tutt Cafe", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "47 Hicks St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/y14pR0udRjoftBtR39bWCg/ls.jpg", "@type": "Restaurant", "telephone": "+17187227777"}