{"aggregateRating": {"reviewCount": 217, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-10-01", "description": "As always, I'm always very excited for middle eastern food, especially falafels with babaghanouj! Tutt cafe is a simple eatery in Brooklyn Heights that's close to the water front and DUMBO. They have amazing food and near authentic middle eastern food that is served fast. Try to opt for platters instead of sandwiches. You would never be satisfied with that tiny thing. Plus, you would want a side salad and your choice of babaghanouj or hummus. (Go for the babagjanouj, if you ask me.) On the down side, it can be very hot and stuffy inside the cafe. Unfortunately, we sat outside where the table service is super slow. I can't really blame him because he was the only waiter. I'll keep my rating at 3 stars for now, for their slow service.", "author": "Yimei M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-03", "description": "We sat outside on a glorious Saturday and had the falafel and salad platter.  Great for a quick bite.", "author": "Elizabeth B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-19", "description": "Cheap CASH ONLY Middle Eastern place in Brooklyn Heights.  \n\nI ordered the falafel platter and was more than happy with it.  The fresh pita bread was excellent, too, and the presentation of it looking like a small balloon made it even more impressive.\n\nThe staff is very friendly.  In fact, the server, speaking with a thick Arabic accent, asked me where I was from.  I told him from here, that I'm American.  He then responded with \"No, my friend, where are you REALLY from because you have a funny accent?\"  \n\nTouché my friend, touché.\n\nUpon paying my check, I made sure to sound like Arnold when I said \"I'll be back!'", "author": "Jaszon S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-20", "description": "Amazing. Amazing. Amazing. We have done it probably 300 times. Get their lamb sandwich, their lentil soup, their chicken. Their hummusssssssss get it all!", "author": "Paloma D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-09", "description": "The pita here is to die for. It's so fresh and fluffy. I ordered the chicken plate which comes with salad, hummus, and pita. The \"white sauce\" is the real thing--tahini based, not that sour cream/mayo crap that you find at other places. $10 for lunch sounds about right in this area. \n\nThe only problem is that I wish it was a bit closer to my work place. It's a bit of a walk from Dumbo, especially in the winter.", "author": "James L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-08-15", "description": "Amazing place!  During this last visit, I decided to try the hirara soup and the garlic bread.  Both were outstanding in flavor and fresh taste.  I am a big fan of Tuff Cafe due to the affordable prices, the nice waiter, and the huge fluffy pita pillow that is provided with most of my meals. I will upload some photographs so you can see the interior and my soup and bread.  This establishment also have a fantastically clean bathroom.  If I live longer from all the delicious food, then I will be back. This is a guarantee!  Did I mention that it is great for groups?  and you can bring the family?  the kids?  and grandparents?  There is outdoor seating if you do not mind the sun.   =)  Thank you for being walking distance from Brooklyn Bridge Park.", "author": "Polly H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-23", "description": "Wonderful Egyptian food. Baba was the best I've had in a while, the salads were all great, and the handmade pita fired to order was delicious. Very warm, hospitable service with homemade beverages and lovely semolina cake on the house.", "author": "Anthony D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-21", "description": "Why didn't I discover this place sooner! \n\nIt's a cheap Middle Eastern food in Brooklyn Heights. I am a huge fan of the chicken plate, comes with hummus and a salad. The staff are really nice and the food is cheap for the area. \n\nThe ambiance of the restaurant is casual and the staff are really friendly. Definitely try this place!", "author": "Crystal A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-12", "description": "Service is a bit strained but we got there just as the Watchtower let out for lunch so they were slammed. Still worth the wait. Lamb is exceptional , falafel is too. Merguez sausage has excellent flavor but a bit dry.  Bread is hit and hummus delicious try the hibiscus or loomi cold drinks. They are delightfully different flavored that will let your mouth feel happy   Great food experience in a very family run sort of place.  Definitely will be a favorite when I am on that side of the river!", "author": "Gina B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-31", "description": "Great food and staff is very friendly. Had the lamb plate which came with sliced lamb, salad with a lemon and oil dressing, freshly baked pita bread, and your choice of hummus or babaganouj. The babaganouj was delicious and the pita bread was my favorite part. Friends ordered the chicken plate and the chicken was delicious, will definitely order next time. Food came out quick and service was great. Tried turkish coffee which was very strong as opposed to what I'm used to drinking but smooth, for sure something to try if you havent already. And to top it off we had the baklava which had just come out of the oven and it was amazing. Nice place for a casual lunch or dinner with friends. Will definitely be coming back :)", "author": "Angela C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-28", "description": "If you ever need catering, this is the place! Tutt cafe catered our small wedding lunch and it was perfect! Delicious but also reasonably priced especially for Brooklyn heights!", "author": "May T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-19", "description": "I tried their sample appetizer, chicken pizza, and pita bread.  Everything is freshly made and we enjoyed our tiny outdoor table.  \n\nFood is 3.5 star but I am giving it a 4 because I know I will be back (it is minutes away from my apartment).", "author": "Juan J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-18", "description": "Thanks Yelpers!  Would have passed right by this place from the side street we were on thinking it I just a regular bodega or something.\nNot!\nHad THE most delicious pita ever here.. Not your normal pita.  Served piping hot, so soft and flavorful.  Have never had a pita like it!\nAlso THE best baba!  The beet salad was very regular.\nGood prices, good service and simply delicious and fresh.  A sure bet for a great lunch to walk over to the Promenade with!", "author": "Alexandra C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-21", "description": "What a delight to find good affordable Middle Eastern eatery on Hicks Street. Yes, it's no frills, but it's clean and the food is great.  The staff was friendly and attentive.  The Hibiscus drink was refreshing and fruity without being too sweet. The Chicken Pitza was filled with flavor and was juicy. It was too much for me to finish and I asked for a \"doggie box.\"  My meal ended with a delicious slice of complimentary Basbousa (Semolina Cake). The spices and flavors of my pitza made me smile all the way home to Bensonhurst.  It was still delicious the second time around tonight at dinner.", "author": "Brownstone P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-16", "description": "been coming here for years.. shocked I haven't reviewed it before. same great quality baba and hummus, fresh salads, great prices, chill vibe, outdoor seating. perfect place to grab some takeout to enjoy on the promenade or in the park.", "author": "Steph G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-26", "description": "We had soup, hummus and a chicken sandwich at this quiet casual eatery in Brooklyn.  I enjoyed the hospitality and kindness along with the pita bread.", "author": "Jacqueline M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-14", "description": "The yogurt was straight up divine. The beet salad made me fall in love with beets. Coming back here soon!", "author": "Janelle M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-10", "description": "The food is amazing ! Loved it all! The 5 salad plate for 10$ Is great! Highly recommend the soups too!", "author": "Pau A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-07-07", "description": "Food was just okay and service was not bad. However, one thing I really hated about this place is that they charge customers certain percentage of tips. They added about 15-20% of tip to the bill without asking me. WHY DO THEY DECIDE HOW MUCH TIP I PAY? It has to be cutomers' choice whether tipping servers or not; as well as the amount of tip. Customers are not obligated to tip. Tipping is just the way for customers to show their gratitude to servers. Tipping culture in this country is spoiled and ridiculous.", "author": "Joh P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-06-14", "description": "A waiter named Lucas, who was chubby and of course without a name tag, tried to kick the three of us out because we didn't order more than $20. Then he complaint of customers (of Asian ethnicity) sharing foods and drinks (instead of ordering more). He said \"go ahead, you can have the table, but better be quick.\" By the way, there were four empty tables around us when he made his command. Then he charged us 20% service fee, and with a condescending face said \"that's the rule, and I told you it's table service.\"\n\n\nThe stars are because the falafel is pretty good. Otherwise, the waiter's quasi-racist, deprived service attitude would be negative four stars.", "author": "John D."}], "servesCuisine": "Middle Eastern", "priceRange": "Under $10", "name": "Tutt Cafe", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "47 Hicks St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/y14pR0udRjoftBtR39bWCg/ls.jpg", "@type": "Restaurant", "telephone": "+17187227777"}