{"aggregateRating": {"reviewCount": 217, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-15", "description": "This no-frills place has cheap, great mediterranean food. \nWe go quite often since it is down the street from our apt, and it is consistently good.\nThe decor is nothing to write home (or yelp) about, but it is clean and there is always a table if you decide to dine-in. In the summer, there are outdoor tables and palms on the sidewalk for people watching.\n\nService is friendly, but a little slow; the reason it seems to be slow is because everything is made to order, including each pita. When we order (usually for take-out) we see them start with pounding out our pita and popping them into the oven; when they come out, they are super fluffy and puffy delectable carb clouds! Great fresh pita! \nAnd usually one of the staff serves complimentary tea while you're sitting and waiting for the food.\n\nNote: no alcoholic beverages served here; signs are posted everywhere, almost comically.\nAlso, CASH ONLY (with ATM inside)\n\n\nBest food we've had here:\n***Chicken sandwich (this is our standard, go-to here)\n***Pita and [fill in the blank; humus, babaghanouj, nothing but pita]\n***Spinach cheese pie\n***Beet salad\n***Merguez sandwich (although kinda greasy)", "author": "Briggs S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-18", "description": "Tutt a find! All puns aside, this place is fantastic. Friendly service and great food! They always go the extra mile to make sure you've enjoyed your experience. A true gem in the neighborhood.", "author": "Lauren G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-22", "description": "I ordered delivery, despite not being able to see a menu!  I called and the guy was friendly so I decided I couldn't go wrong with a falafel plate.  I ordered it with hummus and then got a garden salad with feta.  The bill for 2 plates and the salad was only $20.  The plate was really good it came with salad, 4 falafel balls, pita bread (warm and fresh!) and a scoop of hummus.  I couldn't get over how much food we got for the amount of the money!  I could definitely order again and try a different sandwich or one of the specialty pizza's!", "author": "Kimberly L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-28", "description": "Good food and reasonably priced. \n\nFelt like it was my first time eating real middle eastern food.  Generally very aromatic tastes with spice forward (not to be confused with hot) flavor.  Well made. Their pita bread came out steaming hot. The falafel was full of flavor but my taste buds wanted more salt. It was well made with a nice crispy outside and moist crumbly inside. \n\nChicken pitza was our other dish which is as also good. Again my taste buds wanted more salt but the food was definitely spice forward. Not sure what spice but it wasn't a cumin base. Heavy on the peppers. The green onions were also a nice compliment. The pizza bread had a subtle smoky flavor. Crispy crust with a nice doughy base. Ther was no cheese to hold things together but it was still a well made pitza in my book.", "author": "Steven N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-30", "description": "One of the best meals I've had in my first four months in NYC. Very friendly service, broad menu for vegetarians and meat-lovers and (bonus for my very picky Muslim family), all the meat is halaal. Definitely bringing future visitors here.", "author": "Sieraaj A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-03", "description": "Delicious! So much food for a great price and nice service. Came for lunch with a group of co-workers. We shared some dishes and each ordered our own. I tried a little of everything and it was all great!", "author": "Jeanne L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-10-26", "description": "A friend and I stumbled in here a few months ago, and it has become my go-to haunt ever since.\n\nLet's just dive right in, shall we?\n\n1. The ambiance -- It's tucked away in this quaint part of Brooklyn Heights. The atmosphere is a little kitschy, but in an absolutely endearing way. It's unobtrusive  and charming all at the same time. \n\n2. The food is a pleasant surprise. I've probably sampled 80% of the menu and everything has been fantastic. The falafel are really good, but their 'pitzas' are truly remarkable. The Green Pitza gave me convulsions (in a good way!)\n\n3. The service is warm and friendly. This is a consistent theme every time I've been here. One of the servers remembered us from last time. Totally awesome. \n\nWay to go, Tutt. You've got yourself a regular.", "author": "Greg C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-11-29", "description": "So Bobby C. has been advocating for this place since he came here a few months ago, going on and on about their delicious falafel. Blah Blah. We were in the general area on Saturday, and after storming out of Waterfalls Restaurant due to their horrible new owner, he persuaded me to make the cold walk down to Tutt's for his precious falafel. While we sat there after ordering 2 falafels and a chicken Pitza, he made 2 bold statements:\n\n1) This is the best falafel you're gonna have ever.\n2) After this you won't be able to eat at Cheep's again.\n\nOf course refering to Cheep's Pita Creations, my go to spot for cheap falafel goodness. Now the Tutt's cafe falafel finally came out, and here's what's up: it's smaller than Cheep's, but I guess that's to be expected. They didn't put enough white sauce in it for my liking as well. Outside of that though, it was the best falafel I've ever had. Fresh baked bread, right when you order it, the actual falafel that's fried up has so many spices that you really barely notice the lack of sauce. Oh man is it good. And it better be too, because it's $4 (compared to the new city standard of $2.50 for Cheep's or even Mamoun's). And despite it's small stature, it's actually quite satisfying.\n\nIt was great ordering that chicken Pitza as well. I've never had anything like that, chicken with lots of spices on a baked pita, with herbs and peppers and stuff, it had a very unique taste, almost magically delicious. Everything we had at this place was amazing, including the beers we bought at Key Food earlier because Tutt cafe is BYOB (sweet).\n\nThis is the best falafel around, but there's a very good chance I will be eating at Cheep's again, I mean, it is open really late, cheaper, and a lot closer to places I'm usually at than Tutt's. Having said that, this nice little spot is worth the trip...", "author": "Clint H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-15", "description": "Amazing pitza very delicious n different, crunchy thin crust loads of chicken!! Happy I stepped in!!", "author": "Dhiraj G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-30", "description": "Tutt Cafe is a great dining option if you're in the Brooklyn Heights neighborhood. A great place for a sit down meal or takeout, It's a cheap but delicious option that was really necessary in the Heights area. \n\nWhile I did have takeout, I noticed on a Saturday lunchtime how packed the place was. There was young families, older individuals, and some more college aged kids all dining. The place is very relaxed a there were a lot of kids. Their menu is very affordable and I like how they offer pizzas and more traditional Middle Eastern fare.\n\nI had the lambajin, which can be described as a lamby spread on pizza dough.  A large pizza for 1 (it's approximately 10 inches), you will be full afterwards, though it does taste significantly worse after the first bite. I loved my first bite, but it slowly lost it's appeal as the crust was not as crisp near the center and was not as good when it was not piping hot. The topping was something like a middle eastern sloppy joe (with lamb) and you'd really have to try it before you explaining what it tastes like.\n\nAll in all, I think it's a 3.5 star joint, but I think its prices and its uniqueness gives it that extra bump up to 4 stars", "author": "Dawei L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-07-27", "description": "Great service and chill vibe. But be advised that their style of mediterranean food is not the same as other places. It is Egyptian...a little grittier, not as much flavor. Still good and fresh though. Also warning that they will insist on a 17% tip.", "author": "Tiffany O."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-07-31", "description": "I've only been here for takeout. The hummus is good, the pita is good, the spinach pie is great, the falafel is bland and the foul is nothing special. \n\nIt's a good, quick reasonably priced takeout option in the area, but I wouldn't go out of my way to go here.", "author": "Bee C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-06-06", "description": "The party I was with ordered a shrimp and a chicken pitza which was not bad. Interior was ok, kinda small. And baklava was yummy. Overall ok, I'd probably go again if I was in the area.", "author": "Wilson Z."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-30", "description": "Great place for Lunch. Solid Falafel \u0026 the \"lamb pit-za\" thing is very good. Note: it is not licensed, but very reasonably priced - falafel is about $5 and the Pitza's are about $7-8.", "author": "Zarbrook S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-05-20", "description": "Great local spot that has simple delicious food at very reasonable prices. We tried the salad platter (you get to choose five different salads) and the lamb platter which came with either babaganoush/hummus. The salads I tried were the feta, beet, hummus, babaganoush, and falafel balls. The falafel balls were not as crunchy as I liked but they were well seasoned. The hummus was so good I ordered a large to go! The pita comes out like a pillow and deflates as it cools. Tutt cafe has some of the best middle eastern food I've ever had. \n\nLove this cute cafe.", "author": "Vanessa T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-09-12", "description": "Was good, but I wasn't overly impressed. Great service and good pricing, but falafel didn't taste freshly cooked and the hummus was so so.", "author": "Zennon K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-05", "description": "Homemade pita bread, hot out of the oven. Try the loomi if you are a fan of Mexican waters. Fresh ingredients, great price, and good service. Generous portions and vegetarian options.", "author": "Mary A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-08-25", "description": "A small place that looks rundown. food is not bad but not outstanding either. Service was fast. There is something similar to AC but it just makes noise. That's all. I tried harira soup. It was standard. Falafel and lamb was delicious. And the price is reasonable", "author": "Fatma G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-04", "description": "Great meal especially enjoyed the beet salad and chickpea salad.  Great and personable service.", "author": "Liz D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-11", "description": "Food is cheap and good. I ordered the falafel platter which came with salad, 6 falafels, choice of hummus or babba gahnoush for only $6.\n\nGreat lunch place or pick up food to go.", "author": "Katy H."}], "servesCuisine": "Middle Eastern", "priceRange": "Under $10", "name": "Tutt Cafe", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "47 Hicks St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/y14pR0udRjoftBtR39bWCg/ls.jpg", "@type": "Restaurant", "telephone": "+17187227777"}