{"aggregateRating": {"reviewCount": 217, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2019-04-24", "description": "Cool little restaurant in a Brooklyn neighborhood that I randomly stumbled onto.  I had the chicken wrap and it was good.  Staff was friendly and it was cool to sit at the dining tables outside the restaurant on a sunny day and watch the neighborhood bustle.  I recommend this place if you're ever in the neighborhood!", "author": "Justin S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-18", "description": "The three best foods at this longtime BK Heights spot:\n\n- their creamy labneh: unstoppable good, packed with flavor \n- their hummus: I'm not a big hummus fan but this one is really well balanced and dotted with olive oil \n- their hot, homemade pita bread: dip in the labneh and it's especially heavenly\n\nOn a warm day, the outdoor seating here is prime and the service is kind and lets you stay a while.", "author": "Bonnie G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-03-18", "description": "One star for the fresh pita bread. Otherwise I had a terrible meal here. There's only one guy working here so service is very slow, albeit friendly. The roasted leg of lamb was so tough and looked and tasted like it was boiled. My jaw hurt after eating it. Interior is drab. Avoid this place at all cost.", "author": "Michael P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-08", "description": "Had the falafel combo and was not disappointed. Great hummus and baba ganoush, the pita is legit. They mail in the salad, but I'm willing to overlook that. No frills and easy seating.", "author": "Adam S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-30", "description": "Read all the great reviews, but was pretty disappointed by them when I had food delivered to my office.\n\nThe portion sizes were generous, but the food was just okay.\n\nThe mixed salad was boring. It came with 5 types of things - we got 2 different types of chickpeas, a regular salad, stuffed grape leaves, and hummus.  The pita was good.\n\nAlso split the mixed grill. The rice was bland. The pork chops were too burnt. The lamb was the best part, but not extraordinary in any way.\n\nThey also didn't give us any hot sauce. Maybe you have to ask specifically?\n\nTutt Cafe may be better if you actually go there, but I won't be ordering delivery from them again.", "author": "Kenny C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-02-24", "description": "Love Tutt Cafe - one of the gems of Brooklyn Heights! At least once a week I get a craving for their pitzas. It's like a pizza meets flatbread meets Mediterranean. My default order is their $12 chicken pitza.", "author": "Judy S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-03", "description": "This no-frills gem is friendly, clean, delicious and fresh - not fancy or trendy/sexy. Come here for deliciously fresh falafel, shawarma, freshly baked pita, green \"pizza\", and babaghanoush. Beer and wine are now served - yeah!!", "author": "Jen O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-20", "description": "A hidden gem in Brooklyn Heights. Great option 5 min walk from Brooklyn Bridge. Great hummus and Lamb Pitza.", "author": "Sandra M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-19", "description": "Tutt Cafe is amazing, it feels so homey and is so so so good. Super friendly and cheery people here.\n\nBut the food.. The green pitza is the greatest most interesting pizza you'll ever try (leeks, scallions, fenugreek mix topped with lots of cheese). My boyfriend exclaimed it was the best pizza he's ever had. \n\nAlso had zaatar bread, a little more oily than usual, but still really good. I got it with the baba ganoush, spread it on the zaatar bread and it is heavenly. They serve it with some pita bread....really fresh and delicious. Cant wait to go back and try more of this amazing food.", "author": "Michele B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-19", "description": "The food was really good!! We enjoyed the green pizza!! When we come back we are definitely ordering this again! We also got a decent sized portion of marinade chicken which was not dry at all and babaghanoush accompanied with pita bread. I really enjoyed the babaghanoush. The only downside that I have is the fact that we waited awhile before we got our food. We weren't given like an appetizer like pita with some hummus while we waited which would have been nice! Anyways we were really impressed with the food and that everything was reasonably priced which means we will definitely be back!", "author": "Miriam W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-03", "description": "The wait was quite long to have our meals to our table and there are also lots of pesky flies but for some reason it was all worth it for the delicious 15$ grilled lamb chops!!!!  You will not be disappointed and the pita bread is fresh and to die for. Love it! The veggies were also fresh, crisp, vibrant, and and super refreshing. Yum! I'd definitely come back if I find myself in the Dumbo area.", "author": "Seri A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-07", "description": "Tucked away on Hicks St on the north end of the Heights, this middle eastern joint screamed Egypt!   The usual middle eastern fare w many vegan options \n\nThe soups were good, especially Harir though the lentil soup seemed under-seasoned.  The beet salad was fine, the tabouli a bit dry and the falafel over-cooked. \n\nService was speedy and the place is kid-friendly.", "author": "Jim C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-29", "description": "They have great pizza that my son loved but there delivery person is awful. He almost never has change for a 20 and isn't the most pleasant. Plus it took 45 minutes for a pie to be delivered 2 blocks and I had to tip him extra because he had no change, again.", "author": "Clarita H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-29", "description": "The waitress was nice, very attentive. My food was good. We weren't a fan of the lamb pizza, but other than that we enjoyed aré meal. The area is cute and very peaceful and the restaurant isn't crowded so that's nice as well. I would recommend.", "author": "C J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-16", "description": "Been in Dumbo for 6 months and have been here 10x times. Always ordered the doner lamb gyro - it's some seriously good stuff. I had better pita here than anywhere else. It's a lowkey hole in the wall that doesn't cut out quality.", "author": "Jeff T."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-01-05", "description": "Food: falafel was dry, lukewarm, not crispy, didn't taste homemade. Gyro - never tried such version of the meat - some sort of minced meat with spam-like consistency. Sauces were just ok, bland. Pita was the only thing which was good and seemed homemade.\nService: with 3-4 tables had to wait more than 10mins to get our card back after it was swiped. Our order was initially wrong and they changed it which is no big deal typically if the food is worth it - too bad it isn't. \nDon't recommend.", "author": "Vi T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-24", "description": "This is the best spot near the Promenade - super casual, family-run type of place. The pita bread is so fresh and homemade tasting. I also particularly like the grape leaves. Otherwise, I've had the falafel and the harima soup - both good. Both times I came late afternoon on a Saturday and there was no wait.\n\nI've got to come back and try the green pizza! And the desserts!", "author": "Kim G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-23", "description": "Rechristened as Tutt Heights, with a shiny new menu, Tutt is still sensatioal.  BYOB is back for the meantime (yay!).  Great food, fresh ingredients... OMG the old Tutt is back!  Beware...slooow", "author": "Undercova A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-08-17", "description": "After researching yelp for Middle Eastern places in Brooklyn Heights settled on Tutt Cafe.\n\nWhen you walk into Tutt Cafe it's a little confusing because it is essentially a Middle Eastern Pizza place.  Imagine pizzeria with Middle Eastern spice smells and some Middle Eastern art works on the walls.  The pictures say a lot about the atmosphere of the place, not ambiance, but atmosphere.  The pictures in the frames are super weathered and look as if they have been through a really bad rain storm.  Expect it to be humid and sort of warm.\n\nThere's sort of waiter service but not really.  The waiter service was just one of the guys behind the counter.  Don't expect service to be good.\n\nThe service is very slow.  For drinks we got water and cold mint tea.  The best thing is there is a little tiny cooler filled with ice next to the drinks on the left hand side of the restaurant towards the counter area.  That's where they scoop out the ice!  It was pretty silly and I had a good laugh.\n\nWe ordered falafel as an appetizer, which I would not recommend.  Dry, underseasoned and actually pretty small portion for how much you pay.\n\nThe sandwich and plates on the other hand are quite a deal with pretty sizeable portions but the food itself is really just average.  The plate comes with the meat you chose, a small salad and hummus or baba ghanoush.\n\nWould definitely come back but to try the pizzas people rave about or get another plate.", "author": "Kent C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-15", "description": "2nd time coming here and the food is good!\n\nI came in to grab dinner before my last class of the semester.. \n\nFood is great here and the price point is good, the small toubeleh was a little overpriced though for the amount you get. \n\nOrdered: Leg of Lamb plate $13, small toubeleh $6, food was good, I'm a big guy and I was full, I think the last time I came they gave you more hummus. \n\n4 out of 5. It's a staple in my list of local spots to goto as a new resident of NY. The only other place to date that has been better is Istanbul on Bay Pkwy/86th (Bensonhurst) area off the D train @ bay Pkwy stop. \n\n\nNote: the older server guy couldn't stay off his phone and had to be flagged down to place my order; mind you he's legit 5 feet away... Now we all know ain't nobody texting him like that Lol", "author": "Lamarr H."}], "servesCuisine": "Middle Eastern", "priceRange": "Under $10", "name": "Tutt Cafe", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "47 Hicks St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/y14pR0udRjoftBtR39bWCg/ls.jpg", "@type": "Restaurant", "telephone": "+17187227777"}