{"aggregateRating": {"reviewCount": 217, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-12-05", "description": "Nope. Prices 1.5x what's listed on the menu, food tasted like... nothing. Except the beans, which tasted like soap. Waste of money for flavorless, dry food and chewy, rubbery pita.", "author": "Jordan B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-04", "description": "Great authentic Egyptian food with a great price and great service. Lamb with mint is wonderful.", "author": "Bruce A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-08-25", "description": "Had the lambajin and chicken pizza, no one liked the lambajin, the tomato sauce kills it but the chicken was good, so was the feta salads and stuffed grape leaves. The meat sandwich wrap was also ok but nothing was mind blowing. I've been to the middle east and i absolutely love manakeesh, but the pitza (manakeesh) here is nothing like that experience.  The place is quiet,  mostly empty,  The guy behind the counter is nice but It's not a memorable experience. It's okay for a bite.", "author": "Sadia H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-04-03", "description": "Not a bad place if you're in a hurry. I ordered the chicken plate. The chicken was just ok. The Baba ganoush was very good and the plate came with a warm soft pita and a salad. I would order take out again.", "author": "V M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-05", "description": "I wasn't sure what to expect from their chicken pizza but I was more than pleasantly surprised with it.  The chicken was nice and juicy and the spicing was perfect.", "author": "Ryan P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-25", "description": "It's a small, relaxed, no frills, sit-down cafe. The food was delicious. We got the 5-salad appetizer which came with tasty (but somehow not overly-filling) pita bread. The \"sandwiches\" were packed with meat and flavor. You get a good amount of food per $, especially compared to Manhattan. \n\nCASH ONLY", "author": "Asavari G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-11", "description": "That's a great place with great stuff which are help you geat what ever you want easily and really tasty", "author": "Hassan A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-16", "description": "Tutt Heights is an unexpected spot tucked in the heart of the gorgeous Brooklyn Heights neighborhood. It's a cafe type spot that has tables both inside and out. They do offer delivery and I've heard that they're BYOB. I just stopped in for a side of falafel to test out the waters. A small side of falafel ($4.25) includes 4 large falafel balls, a small container of sauce and made to order pita bread. I was impressed that the pita was made to order and was delicious. The falafel was warm and well seasoned but wasn't crispy. I love the contrast between the soft moist interior and the crispy exterior so naturally I'm taking away a star. I'll be back to try something else, like the $7.50 lambajin pitza.", "author": "Matt E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-27", "description": "Very unassuming place. We came in the earlier side of the evening, after walking over the Brooklyn Bridge. No one was eating inside so we were a little suspect. But we decided to give it a try since there were many positive Yelp reviews. So glad we did! Everything was delicious!! My husband got the merguez plate and cleaned the plate! I shared the shrimp pitza with my 8 year old and also ordered a small falafel plate. Don't expect your standard type of pizza! It's better! Definitely going to come back when I am in the hood and try different things.", "author": "Lisa M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-07-02", "description": "That place simple, litte grill cafe. Don't expect so much taste. I ordered lentil soup, mix appetizer platter and leg lam grill. Soup wasn't really soup. Loos like slime. Appetizer plate has cold  chickpea ,hummus and babaganus. Lam leg was awful and cold. Well.. Try babaganus ! It was very tasty.", "author": "Murat O."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-30", "description": "A very casual middle eastern eatery with outdoor seating and good middle eastern food. And very good home-made pita bread that arrives to the table like a poofy balloon.  It's all about this bread, folks. That and the availability of outdoor seats in a very pretty neighborhood block.", "author": "Kayo N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-28", "description": "An unassuming, even unkempt little Egyptian cafe-restaurant in a very pricey part of Brooklyn, Tutt or 'Tutt Heights' does a good range of mezze, platters, pies and grilled meats. Service is friendly, though usually down to one overworked waiter, and there is a steady stream of regulars. Prices are great, with our large falafel platter ($5) and spinach \u0026 cheese pie ($5.50) substantial and filling. Khoobz bread is freshly baked and really quite wonderful, but they just don't do a proper ful medames (fava beans) stew, which is one of the highlights of Egyptian cuisine. Their babaganoush has a thicker texture than Lebanese moutabal, and just isn't smoky enough in my opinion, but that is a small complaint in such a remarkable neighbourhood institution.\n\ndelusionaryculinary", "author": "Paras G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-01-23", "description": "This is a very casual spot where it is easy to stop in and have a meal. The night I went, there were plenty of seats The service was friendly and the place was clean. My friend ordered the chicken platter with hummus and I had a falafel platter with hummus. We each got a large, yummy puffy pita and then I heard the ping of the microwave, twice. The next second our plates were on the table with large portions of fresh salad, a modest amount of very good hummus and microwaved chicken and falafel. Microwaving this type of food ruins it. My falafel where chewy and dense rather than crispy and my friend's chicken looked steamed and rubbery. What a shame!", "author": "Ellis S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-16", "description": "Awesome food! We order a couple of soups and they were delicious. The service was great and quick. The waiter was very kind and gave us a complimentary dessert!", "author": "Juan Domingo P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-07-17", "description": "Sandwiches are okay enough.  I got falafel and my hubby got spicy lamb.  I got yogurt salad/dip, but it was plain yogurt with olive oil/olive on top, and it had no seasoning or flavor.  Skip the baklava because it was stale.", "author": "Su S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-08", "description": "Fantastic customer service and absolutely delicious, affordable middle eastern/Egyptian cuisine!", "author": "Reese B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-12-15", "description": "(Lambajin pitaza: 8.00$) \nI have a couple of things to say. When they say pictures are deceiving ... They mean it ! Looks great huh? That's what I thought too but meh not that good at all ! Tastes like tomato paste and onions barely any meat. On top of that the service was horrible! He was constantly on his phone and we had to keep asking for things that weren't on the table (ice water, napkins...) he barely waited us and had the decency to tell us after we payed \"where's the tip\" ?!? no.", "author": "Mariam S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-05-03", "description": "This place was hoppin' on a Saturday late afternoon. I got the salad platter (choice of 5 salads) and the dish was very pleasant... until I encountered a hair in my dish. I guess things like this happen? I did think the pita/bread that they serve with the platter was on the harder side than other Middle Eastern places and I prefer the softer pitas.\n\nIf I happened to be in the neighbourhood again and was hungry, I think I'd come back here? ... I'm unsure, but its a possibility.", "author": "Pam H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-08-01", "description": "Really disappointing, really terrible - I just can't understand the positive reviews.  \n\nGiven the high ratings on Yelp my husband and I were excited about trekking to Tutt Cafe for lunch but the food was tasteless and just a major disappointment.\n\nWe had the much touted chicken pizza which had absolutely no flavor.  I had to add copious amounts of salt and ask for tahini sauce to spice it up and still, it barely made a difference.  The chicken had very little seasoning and this dish was just a total waste of money and stomach space.\n\nIn addition to the pizza we shared the sampler platter that included falafels, grape leaves, babaganoush, hummus and chickpeas.  The grape leaves were good, the chickpeas and babaganoush decent but once again, the hummus had ZERO flavor. Did someone forget to add salt to this batch? There was no flavoring whatsoever.  The falafels were nothing special and the pita was overly thin\n\nThere 's no reason for us to eat at Tutt again.", "author": "Kathy L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-20", "description": "I must confess something here, im a bit addicted to falafels, i dont know what it is, these little balla are so yummy, i need to have them several times a week! This place has the best ones, the only thing is that they only take cash, it would be more convenient if they take cc, other than that this place is perfect for middle eastern food.", "author": "Melody M."}], "servesCuisine": "Middle Eastern", "priceRange": "Under $10", "name": "Tutt Cafe", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "47 Hicks St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/y14pR0udRjoftBtR39bWCg/ls.jpg", "@type": "Restaurant", "telephone": "+17187227777"}