{"aggregateRating": {"reviewCount": 217, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-03-25", "description": "BYOB!\n\nBYOB!!\n\nBYOB!!!\n\nThis is a cute and cozy, hole-in-the-wall place. They make awesome, cheap mediterranean food - homemade pita, great falafel, great labneh. Definitely try the spinach and cheese filled bread. My friends love the hot sauce.\n\nAlso, if you want to drink out of a wine glass, you have to bring your own. Break out your picnic-ready unbreakable polycarbonate wine glasses!", "author": "Eric W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-10-09", "description": "Anything with the chicken is good. I thought their food was ok. Unfortunately when I arrived, there was one waiter scrambling around. I don't think this place is byob anymore. I heard the pizza was good so perhaps I should have ordered differently. There is outdoor seating but it is a little awkward to sit.", "author": "Vanessa O."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-07", "description": "After taking hundreds of Brooklyn Bridge Park photos in a hot summer day on  September 04, I really need a cool and relaxed evening without lots noise or large crowd.\nI really want a fresh cold dish and just a quiet place to sit.  This place was it.  I took the fellow \"Yelpers\" recommendations and ordered the lam sausage with fresh green salad and hummus dip (you have egg plant as other option).  My best friend had the chicken felafel.  Lam was dried and tasteless only gets good with the hummus dip.  The chicken felafel was very juicy and tasty.  So why 4 stars?  Because the staffs were very friendly, and genuinely nice.  We didn't order any drinks but we've got a pitch of ice cold water with fresh slice of yellow lemon.  Very affordable price, fresh food, quiet, calm, and good hosting brings me back to chicken felafel for the next time.  10 minutes waking distance from the Brooklyn Bridge Park entrance.  (NYkers walk, not a touristy walk). Let's go back to the \"tasteless lam\", hey if you're on the \"low fat, low salt, low cholesterol\" diet, get this!", "author": "Cheff W."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-12-30", "description": "The food is ok. Poor service, doesn't seem clean, and cash only making it inconvenient. They clearly care nothing about service.", "author": "Mk T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-12-12", "description": "I would give 6 stars to Tutt, if Yelp was allowing it. I love their Merghez sandwich, the freshness of the hummus, the taboule, the lentils soup. Their baklava is also so good. I can't wait to be back and try new specialities.", "author": "David B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-15", "description": "Great everything: prices, food, service. I am extremely picky when ordering chicken from a restaurant, even high-end ones, as not everyone goes to the (admittedly obsessive) lengths I do when preparing chicken at home to remove sinew and other \"crunchy\" bits. But I've had all the meats at Tutt's (except maybe the lamb, can't remember) and not once have I had a problem. It's not the greatest Middle Eastern in the world, but the quality of food you get for the price you pay is phenomenol.", "author": "Aaron F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-05", "description": "Fresh and tasty were the bread (in-house, hand rolled), falafel, vegetables\n+long, thin handmade pita\n-sauce reminiscent of taco seasoning weirdly\n-missed hot sauce :(\n\nFluffy, gentle crisp baklava \n+sweet, cinnamon, nice portion\n\nReasonable/cheap prices: $4 falafel sandwich,  $2 baklava\n\nI recommend take-out because there wasn't any air conditioning, the decor was gaudy, the dining area felt strangely hollow and empty.", "author": "Ian M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-05-13", "description": "So i came here last night after an outdoor concert at Brooklyn Bridge Park.  It's about a 5 minute walk from Pier 1.  I know we had our choice of Grimaldi's... but who wants to wait in line?  Anyway, we walked in, it was almost empty... promptly sat; quickly ordered (1 falafel sandwich and 1 chicken sandwich) and then waited...\n\nSeemed like quite a wait for 2 'sandwiches'... but when they came they were very good.  The falafel were not greasy but did lack sauce so I asked for more plus hot sauce which was very flavorful. My BF had the chicken sandwich which I thought was better.  The fresh pita out of their pizza oven was also very good.  \n\nOverall, for around $11, this was a good spot that I'd come to again. I wouldn't go out of my way to come to Brooklyn Heights for it since I don't live around there, but if I was in the neighborhood, I'd stop in again!", "author": "Jen G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-03-02", "description": "Average Middle Eastern joint, nothing too special... but then again, there isn't much competition this far north in The Heights. The falafel was old and stale. The hummus was alright. Even this cheap, it's overpriced for what it is. Ironically, the so-called \"pizzas\" is the way to go.", "author": "Nicolay S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-17", "description": "I stumbled upon this place when I was walking  around  Brooklyn and I was absolutely  blown away. I have yet to taste something  so authentic  and delicious as far as middle eastern food in NYC go. The food was so flavorful but light at the same time, not greasy like all the fast food and high end joints in Manhattan.  The spinach  and cheese pie, chickpea and spinach  salad, and baba ghanouj  are a must!", "author": "Pallavi Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-09-29", "description": "Not familiar with Brooklyn Heights, my husband and I were wandering around on a Sunday afternoon, looking for an interesting restaurant that was open -- a lot of places are closed for lunch and / or on Sunday period, so it was a little disappointing until we came across Tutt Cafe.\n\nThis place is casual and cheap -- which makes the delicious, freshly baked dishes even more tasty, in both my estimation and my husband's opinion!  The only downside is that they don't take credit cards -- but if you've got cash on you, then it's worth shelling out the currency to order a wide-cross section from the menu!\n\nWe ordered falafel balls, which came out quickly (about ten minutes) and were steaming; they were crispy on the outside, soft on the inside and had a delicious nutty flavor.  Immediately following that, the waiter served us piping hot pita bread (that was still inflated from baking) and very smooth hummus.  For our main courses, my husband ordered a Mediterranean sausage -- which was much less greasy than an Italian style sausage.  It almost had the consistency of a more dry meatloaf, except it was all meat, and pretty spicy!  It was great, although I don't think I personally would enjoy a whole meal of this particular sausage.\n\nI loved what I ordered, though -- the Chicken \"Pitza.\"  I don't know if there really is such a thing as Mediterranean pizza (\"pitza\"), but even if this place invented it for their menu, I don't care.  It was great.  The lemon chicken was extremely moist and well flavored / spiced.  The concept of Mediterranean pizza, I guess, is that you don't have any cheese or tomato sauce -- the delicious crust was steaming, crunchy and doused in olive oil instead of the usual toppings.  Then the chicken and diced red and green peppers completed the trimmings.\n\nThe atmosphere was, as I said, casual -- but cozy -- and we enjoyed ourselves immensely.  It's tucked away on a side-street in Brooklyn Heights, not too far from the Brooklyn Heights Promenade, which offers an incredibly view of the Manhattan skyline.  If you're wandering around the area, definitely check this place out.", "author": "Lauren S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-12", "description": "Brooklyn Heights is one of many charming neighborhoods which is pleasant to stroll through on a lightly cool March evening. With its historic, high-sealing-brick row homes, sporadically scattered bars, and quaint cafes, it's a calmly romantic excursion.\n\nTutt Cafe is nestled on a quiet street between the gorgeous, extravagantly mortgaged apartments. As we walk in we're a bit hesitant due to the initial, Chinese take-out atmosphere (aka non-atmosphere). With a flashy green awning, empty dining room with few tables (half of which were nude, while the others sported a double layer of cloth), random Christmas lights throughout, a soda fridge, and explicitly cheesy menu item photos, our initial reaction was plan B...which, due to its non-existent nature, left us with the opportunity to sit wherever we pleased (see pics at mariyayufest.blogspot.com).\n\nThe pleasant waiter/phone attendant/cashier/expediter/host rushed to our table with two menus and asked us if we might be interested in any beverages (non-alcoholic, as Tutt Cafe is BYOB). We chose the finest NYC tap water they had to offer, which was delivered in a large pitcher accompanied by lemon and two metallic glasses; a positive sign. As we made our choices, the phone rang non-stop, as the friendly multi-tasking, aforementioned gentleman hurriedly rushed to please everyone. A few more clients entered, all seating themselves and all greeted with the same respect and welcoming nature.\n\nFor appetizers we chose the plate of mixed salads (babaghanouj, humus, stuffed grape leaves, lentil \u0026 bulgar, and laba salad) as well as spinach and cheese pie. Our initial request of falafel was regretfully rejected, due to the fact that they just sold their last order of the fried savory balls. Nonetheless, we moved on to the Lambajin (middle eastern pitza with lamb) and leg of lamb sandwich.\n\nOur colorful plate of salads was brought out after a much anticipated ~20 minute wait-with a surprise! Two, perfectly cooked, fluffy, fried falafel rounds topped our flavorful and delicate grape leaves (perhaps this contributed to our wait). The most tender, not over fried, appropriately crispy, and exceptionally sized falafel drops were a great start to what was going to be a tasting adventure. The humus and babaghanouj were fittingly flavored, while the laba salad (a middle eastern yogurt, flavored with mint), had a slight sourness and was a great dipping sauce for the puffed pita (which came with the plate). The lentil/bulgar salad was tender and the grains were perfectly cooked, however it's flavor was lacking. The fried onion garnish provided a nice texture alternative, yet did little in adding flavor.\n\nOur next course-the spinach and cheese pie-was served on a wooden peel, escorting a lemon wedge. The puffed, homemade pita was stuffed with tender spinach-cut into bite size pieces, allowing for full enjoyment without the stringy mess which sometimes is encountered when the spinach is too large. The cheese was just melted and when combined with a tiny squeeze of the lemon, provided a fresh flavor to the large pie.\n\nAs we filled our bellies, our final courses emerged out of the open kitchen. The liberally served, extremely tender lamb, cradled by a fresh pitta, lettuce, and tomato, had mild flavors and virtually no tendons. The generously sized pitza filled the restaurant with a strong aroma of cumin. Topped with ground lamb and tomato, it encompassed an incredible blend of middle eastern spices, while being carried on freshly baked pitza dough-with a golden crust,which once more made a great vessel for the left over laba salad.\n\nAs we slowly finished our exorbitant menu, the initial hesitation was completely forgotten. Feeling completely at home in Tutt's extremely warm (literally and figuratively) space our appreciation flowed for the abundance of variety, flavor, and hospitality. As we waited for the check, the distinctively pleasant waiter hurried over with a small plate of basbousa (semolina cake with yogurt and honey) \"on the house\". Being fabulously surprised, yet intensely full, we thanked our gracious host and had no choice but to immerse ourselves in the sweet. Semolina's particular texture, combined with the strong honey flavor gave this pudgy cake a pleasant mouth feel, however, was a bit dry (perhaps a bit of Arak-the milk of lions-a Middle Eastern distilled alcohol would have done the trick).\n\nThe last delight arrived in a little black book...our indulgent, multi-course evening set us back only $30.00...tax and all! An incredible find for a two person feast! Overall a satisfying self-made tasting menu in a great neighborhood and an embracing atmosphere awaits you at Tutt Cafe. See pics at mariyayufest.blogspot.com", "author": "Mariya Y."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-26", "description": "I thoroughly enjoyed eating here. They have a great selection of the usual mediterranean options such as hummus, babaghanoush, and fresh pita. I ordered the chicken pitza which was delicious. I've never had a pita pizza before but the crust was crunchy, chicken was uniquely flavored, and green onions all formed a great mouthwater experience. Definitely will be back again next time I'm in the area!", "author": "Ming L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-05-31", "description": "Docked two stars for truly bad service. The waiter mixed up an order, forgot about us for long periods of time (there were only two occupied tables in the restaurant), forgot things, and waited over ten minutes to bring us the check once we'd asked for it. Then he waited another ten minutes to come get the cash we left, even though we were trying to get his attention (and again, empty restaurant!)\n\nDocked one star because the food was just decent, nothing great. No one at the table with me looked happy with their food. I had a falafal sandwich (which is long and thin, rolled in one of their admittedly fresh pitas) and though the falafal itself was tasty, the sandwich was meh. I'd stick to Heights Falafal one block over.", "author": "Priti T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-03-04", "description": "Good falafel platter with baba ganoush and tahini sauce. Quick service for takeout. Pita bread soso,, but I ate it cold later in the day. There websites is not upto date with there prices causing them to loss a star.", "author": "H P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-13", "description": "Dropped by after reading the Yelp reviews on my Iphone...we loved it...sat outside.  Had the 5 salad plate, the falafel plate and some amazing pitta bread...great place and tremendous value...three blocks from the Brooklyn Heights Promenade...great place!", "author": "Regina P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-15", "description": "Nice place, tasty food! Vegetable pitza and humus is amazing!", "author": "Mihai C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-09-23", "description": "The homemade pita bread was made right in front of me. The falafel sandwich was good, but next time I would order it without onions, which over powered the falafel.", "author": "Sam D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-08", "description": "Excellent food and service. Garden salad and soup was incredible...the falafels were good and the humus was excellent.", "author": "Sylvia L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-13", "description": "Really tasty, nice neighborhood place. There's not much in the way of ambiance, but it's nice to sit outside on a summer night (and byob) or take it home. I always order a platter of salads -- 5 salads for $9 is a great deal.", "author": "Ariel H."}], "servesCuisine": "Middle Eastern", "priceRange": "Under $10", "name": "Tutt Cafe", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "47 Hicks St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/y14pR0udRjoftBtR39bWCg/ls.jpg", "@type": "Restaurant", "telephone": "+17187227777"}