{"aggregateRating": {"reviewCount": 217, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-07-13", "description": "Handmade pita!!!!! Light, fluffy, and pillowy pita. aah..what a delight.   Why can't every middle eastern restaurant have this? And the spinach cheese pie was perhaps the most delicious food I've ever tasted that did not have some sort of meat product in it. This little place is a gem--a scruffy, not very well polished one--but a gem nevertheless.  Wish I lived closer so I could go back again and again.", "author": "J. A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-10-23", "description": "Excellent destination for Mediterranean. Menu is what you'd expect of a Mediterranean place. Food is very good and their bake-to-order pita is to die for, and don't miss out on the Baba ghanoush.\n\nInterior is nothing special, a good for casual lunch. Staff is friendly and quick. Very reasonable prices.", "author": "dotCOMmie d."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-12-13", "description": "One would think that finding great cheap middle eastern food in the nyc area would be a snap.  Well... I haven't found that spot in my hood.  I had to stumble upon this little gem on an autumn walk-about last year.  The prices are right, the food is great and the staff is friendly.  What more does a girl need?  Oh yeah... open one up in my neck of the woods!", "author": "bethany r."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-06", "description": "the pita.... perfect, so warm and fluffy.  nicest guys who work here too.", "author": "Rebecca S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-08-24", "description": "Damn it was hot in there.  I'd stick to the appetizers and pizzas.  The lamb pizza was good, thicker crust than i'm used to, and the spinach pie/calzone was one of the best i've every had-super fresh.  We shared the chicken plate that came with not enough hummus and dry chicken.  The upside is that this is a great place to go to after walking over the brooklyn bridge on a warm summer night.  Double upside is the BYOB without a corkage fee.  I'll stick to Sip Sak in the city, but it's a good option if you want to share plates and dont care about atmosphere.", "author": "Allison H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-06-27", "description": "This place does not live up to its reviews.  The staff was very pleasant, but did you ever have to send back water?  We did.  Ours was laden with detergent.  My husband spat his back into his cup, and the water turned into foam.   (A few more sips and he would've been reenacting the Little Rascals scene where Alfalfa sings with bubbles coming out of his mouth.)  It's also a good thing he was wearing long pants.  Otherwise, his leg would've gotten injured by the exposed fan blade that blows toward the beverage fridge.  (Be weary if you bring in your little ones; it's a severed finger waiting to happen.)  Some bites of the food were really good, while other bites were sub-par.  Unfortunately, my toilet would not agree that the food had any redeeming qualities.", "author": "A S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-05-15", "description": "Home delivery was too slow\nFalafel plate was unusually spicy.  I would not recommend it.\nSalad plates were good, average.", "author": "Dan E."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-06-23", "description": "This place has a cool friendly vibe to it.  I ordered the spicy lamb sausage which was rather...err...not attractively presented (looked like a turd on a plate), but boy it was delicious!  Wonderfully spiced, but not overly hot. The hummus and salad on the side were fine.  The plate also came with an outstanding hot pita the was puffed up right out of the oven.  A big miss, IHMO was the garlic pita.  I normally am quite the garlic fan, but the garlic was so raw and overpowering that the pita had a bit of a bitter after taste. If not for the garlic pita, I would have easily given this place another star.  Service was both friendly and efficient.", "author": "D W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-07-16", "description": "A hidden gem. Just of the busier Henry St lies Tutt Cafe, with it's excellent pitzas and salads. Great food, great prices and great service!", "author": "Matthew S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-03", "description": "I have found my new lunch place!  Had the babaghanouj, beet salad and harira soup delivered from Bklyn Heights to Dumbo and everything arrived delicious and fresh. Even the soup was still hot.  It's not often you get this kind of top quality food, large portions and great service at such a decent price. Very impressed.", "author": "Jill S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-12", "description": "Came here for a simple, light lunch last week and had a great meal. Everything was very fresh and well-seasoned. We split a mezze type platter of salads. Amazing babaghanouj, fresh pita (still warm) and lebneh, fava beans and tabouleh. Kind of wish we'd ordered falafal after reading all these reviews. We also split a pitza, or a lambajin, a pita covered with ground lamb and seasoned with onion, tomato and sumac. Great accompaniment to the salad platter. It's just one of those places where if you like one thing on the menu, you probably like everything. Very difficult to pick just a couple of items to eat.", "author": "Shoshie G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-05-13", "description": "My wife and I are new(ish) to the neighborhood of Brooklyn Heights/Dumbo and we are systematically trying every restaurant in the area, searching for what's good and what's not.  \n\nWe passed by Tutt Cafe numerous times, and I'll admit, the facade doesn't seem promising: plastic chairs, weirdly redundant signage, and that huge, gaudy Coke machine inside.  \n\nThen we finally tried the food.  One can always tell when a restaurant's food is  prepared with inordinate care and pride, and that's what Tutt is all  about.    We got their assorted salad plate, picking 5 salads of our choice, and every item was a winner.  The food is incredibly tasty and very, very light.  The pita bread comes warm out of the oven.  They could work a little on the ambiance, but we will be back again and again.", "author": "Daniel P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-01-30", "description": "YUM!!!!!  My husband and I are huge, huge fans of Tutt. We go there for dinner regularly and are never disappointed. The food is consistently fresh and delicious, the pitas are perfection (seriously, you will go back for the pita alone) and the staff very friendly and attentive.  From the delivery people to the cooks to the waiter - all friendly. (We never have an issue with slowness - though maybe it's more packed at lunch?) The \"pitzas\" are great, too - all in all quality, taste and *price* is right on. I've tried a lot of middle eastern food around Brooklyn and Manhattan...Why pay more *and* have bad pita? We keep going back to Tutt. \n\n-note: they are cash-only.", "author": "liza t."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-10", "description": "Nice to find a good falafel joint in the neighborhood.  And looks like you could actually have a comfortable meal in their dining room.  Fresh pitas are a very nice touch (although I let one of mine sit for a half-hour and it got very hard).  Doesn't beat Mamoun's in the city or even Oasis in Williamsburg, but it's down the block so I'll be back.", "author": "Ryan P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-04-23", "description": "Amazing Middle Eastern food! The Baba Ghanoush is so wonderful, especially with a hot pita. Another favorite is the Lambajin (Middle Eastern pizza). It is very reasonably priced. It's a great place to go in Summer cause you can sit outside for as long as you like. Their Turkish coffee is also really good.", "author": "Eva G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-11-08", "description": "Tutt is a great lunch place. All dishes that I have sampled so far (lambajin, merguez, tabouleh, hummus, chicken plate, leg of lamb) are fresh, light and tasty. The merguez is particularly flavorful but achieves a high mark on the burp-o-meter...", "author": "Alexis L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-16", "description": "This is a wonderful little place with fresh, delicious food for a great price.  The staff is friendly and service is fast.  The decor is pretty no-frills but for the quality of the food and price, it's a great neighborhood find!", "author": "Rebecca D."}], "servesCuisine": "Middle Eastern", "priceRange": "Under $10", "name": "Tutt Cafe", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "47 Hicks St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/y14pR0udRjoftBtR39bWCg/ls.jpg", "@type": "Restaurant", "telephone": "+17187227777"}