{"aggregateRating": {"reviewCount": 217, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-26", "description": "Quaint, casual middle eastern cafe in DUMBO. Food is alright and pretty cheap, but stray away from the smoothies/basbousa. Lamijun was delish and I highly recommend. Right by the waterfront at Brooklyn Bridge park so super cute to take to-go and walk 2 blocks over to enjoy the views.", "author": "Isabella D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-04", "description": "Sat here for over 35 minutes, when there was only one other couple seated in the restaurant, without even an appetizer put on the table. The owner kept barking orders at his 10 yr old looking son to continue making their delivery food orders. When I went up to inquire about why it was taking so long to get at least my appetizer, the owner rudely retorted that it was taking so long because I ordered the mixed plate for my entree?!! What the heck does my entree order have anything to do with how long it was taking my appetizer to come to my table? He was so rude! Instead of being apologetic and offering good customer service, he blamed ME for ordering the entree that I did as to why my appetizer was taking so long. SMH! And worse yet there was a dead roach in the bathroom, underneath the soap dispenser! Disgusting! I left this restaurant in disgust. Shame on you Tutt Cafe.", "author": "Lila S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-28", "description": "Lovely staff and friendly people at this Brooklyn heights staple. Excellent take out too. I recommend the salad plate, healthy portions and fresh ingredients, and you can choose from several types of salads. Also great hummus and meat plates. Grateful this spot is right up the block from us!", "author": "Mosh E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-02", "description": "Alright, so one of those things you learn after many years of being a New Yorker is to spot a hustle, i.e. know when you are gonna be overcharged for things.  Take, for instance, the DUMBO (District Under Manhattan Bridge Overpass) dining options near Brooklyn Bridge Park.  DUMBO used to be a bit of a boony until the yupsters and dotcommers moved in, and with the park, Fulton landing and St. Ann's warehouse nearby, getting a cheap quality meal nearby become a bit of a tall order.  Grimaldi's isn't run by a Grimaldi anymore.  Juliana's (run by a Grimaldi) is decent but catering mostly to yupsters and out-of-towners.  The gastropubs on Front/Water/Washington are either Upper-East-Side meh, ridiculously expensive, or both.  Shake shack is okay but boring.  Suppose you and your lady (substitute subsequent pronoun \"young lady\" for \"beau\" if you are a lady or you play for the other team - love is love and I don't judge) are in the area with a picnic blanket on your backpack, a pair of Jacksons between the two of you and the sun is setting in 90 minutes.  Where could you go for maximum return for minimum investments?\n\nSituate the young lady down with the blanket on the Pier 1 lawn facing the skyline.  Make a phone call, ask for a Lambajin, a chicken pitza, a zaatar bread, a lentil soup or tabouli, a hisbiscus and a loomi (or an iced mint tea), and ask for a pickup order.  Wait 10 to 15 minutes, give her a peck on the cheeks, walk out of the Brooklyn bridge park at Pier one, up Old Fulton until you get past the crowds around the two pizzerias, the BQE underpass onto Hicks street, and into the cafe.  Hand the man the 2 yuppie food stamps and receive thy change (should be $10 left over) and you shall be greeted with a hot bag of goodies - ask for extra hot sauce and/or spices on the side.  Carry it back to the park and laugh at the idiots still waiting on line for Grimaldis and Julianas.  Walk back into the park and present the meal al-fresco to the young lady at your presence, unbox the goods, serve her a choice of hibiscus or loomi, watch the sun set over the greatest city in the United States.  Prepare to receive much subsequent lovin'.\n\nOkay, some stuff I should talk about - their food is actually solid, but when it comes to run-and-gun outdoor eatiing, nothing beats their levant-style pitzas.  The chicken pitza is really a large zaatar bread with tomatoes, peppers and a small amount of cheese, and unlike their Italian cousins, it does not leave you feeling bloated or gross due to butterfat from the mozzarella.  The Lambajin is basically their take on Lahmacun, which is ground lamb, spices, tomtaoes and whatnot.  If the young paramour in question is a vegetarian?  Spinach and cheese pizza.  The tabouli is refreshing on hot summer days and the soup warming on cool autumns afternoons.  The hisbiscus tea is pre-sweetened but it's at least healthier than downing a soda.  The Loomi is a chilled, dried lemon sun-tea which is a little tart, a little bitter, but quite refreshing at the same time, and is available during the summer.  \n\nNow, suppose you don't want to eat outdoors?  What about dining in?  Well, the atmosphere of the place is like a quieter neighborhood pizzeria, except much more laid-back.  Don't expect doting attention from the staff, but they will come by to say hi but generally leave you alone with your thoughts.  Order an Egyptian coffee and a Bambooza (honey soaked polenta cake) or a baklava, and just chat.  They got reasonably comfortable chairs.  Munch on their mezzes, and maybe order a pie within.  The good thing about Hicks is that unlike Henry street, it's quieter, so you can conceivably go there to have a quiet meal.   The place isn't that expensive, and is one of the better options bang-for-your-buck wise in the neighborhood.", "author": "Kevin K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-21", "description": "Super cute little Middle Eastern place in a lovely Brooklyn street. They had amazing hummus and pita, and the portions were generous. The service was a little slow, although it wasn't that busy, but the waitress was still friendly and helpful. The Google translations on the menu were also quite hilarious and will make you laugh!", "author": "Silje S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-24", "description": "The food was ok, maybe a bit too pricey, but I guess for Brooklyn that's fine. Service was pretty good though. \n\nI would suggest not taking pizza, but rather some meat dish for $12-14. It's pretty big and can easily feed 2. Pizza wasn't particularly good.", "author": "Hayk H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-21", "description": "Spinach and cheese pie appetizer was veeeeery tasty, large portions too. Then had the leg of lamb sandwich. Ordered tahini and hot sauce to go with it, which made if perfect. \n\nEfficient and polite service.", "author": "Michelle C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-11", "description": "Probably one of my favorite meals I had last week. \n\nThe cafe was quaint. Which isn't really a word I use much, but I think it fits the place well. The waiter was good to us. Gave us time to think about what we wanted, told us the smoothies were delicious, and laughed at our jokes. \n\nThe pita is freshly made. Which is a BIG PLUS. I mean, have you had fresh pita? Most places just pull it out of a bag. Which isn't so bad. But when you can have fresh-out-of-the-oven pita, why would you ever go back to bag life? I don't know. \n\nI got the chicken plate. Salad (yes, yum), chicken (flavorful and plentiful, and yes, yum) hummus (so good) and the bell of the ball, the pita (delicious). I left very full. It was enough food for two people, easy. Or just one person who really loves that kind of stuff (me). \n\nGo. It's a good way to spend an hour on a Saturday. And if I lived close by, I think it would be the way I'd spend a lot of my hours on a lot of my days.", "author": "Coby G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-26", "description": "Found this place on yelp, what a treat. Despite being tourists it was nice to get away from them. Everything from the food to the fantastic waiter, A+++ hideaway.", "author": "David B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-24", "description": "When I saw this post, I thought maybe is a good restaurant, but I was wrong, it was AMAZING. I've been in many restaurants and around the world and I will choose this place over so many other places. I really love it.", "author": "Owenn H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-12", "description": "Hey look, this place is what five stars is. And that's all there is to it. At least so long as your yardstick doesn't over prioritize up-to-the minute layout and design- decor or whatever you wanna call it- of the physical space. I often wonder what psychology would be revealed if you could measure two hypothetically identical restaurants, exactly alike in all ways but for their dining room appearance only. Further, it adds interest that the moment you walk out the front door of the place after enjoying a delicious and unpretentious experience, you're in one of the most remarkable residential locations on, dare I say, planet earth. \"Remarkable\" does its best to avoid subjectivity, but c'mon now tell me there isn't something special just there on Hicks? And I'm not just talking about Tutt Cafe. Well I sure think so. But I am certain that's obvious. FOOD: All the things I generally enjoy, I enjoy extra here. It's true I added a new dish to my list of likes by rolling the dice at Tutt and discovering lambajin a few years back. Here remains confidently where I like it best. Any spot where you've successfully taken a chance on something new deserves special recognition of some sort does it not? I suggest recognition by way of an automatic star- at least cause to round up perhaps? The staff are all delightful; every time. Without giving it a tremendous amount of thought, nice staff has got to be no less than three times more influential on the rating as compared to decor. Please give a shout if you disagree and are so inclined; I'm a very patient listener and always open to new ideas. Anyway, the damn food is good. And what your eyes will tell you about your surroundings, both inside and out here, warrants recognition yes, but not overrated reflection in the star rating. 5. Five. FIVE.", "author": "Noah N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-02", "description": "The food was fresh and delicious! Had the leg of lamb, falafel and grape leaves. The even gave us complimentary cake at the end of our meal. Service was very friendly I'll definitely be back again!!", "author": "Angelica D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-09-26", "description": "I was here this past weekend for an early dinner with a few friends, and the place was empty. \n\nThey have a varied selection of appetizers and mezes, and their mixed salad options seemed ok. \n\nHowever, the lamb was horrible. It was an old cold dry piece of tough meat thrown on the plate with the rest. \n\nThe family-own restaurant is welcoming, but what we had here was uninspiring, and quite frankly pretty forgettable.", "author": "Giacomo C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-10", "description": "My friends were coming out of a couple hours playing squash down the street at Eastern Athletic Club, when we did some Yelping and discovered Tutt Cafe. To be fair, we were ravenous and anything would have tasted great in the moment. However, Tutt did not disappoint with its casual atmosphere and pop music selection.\n\nI ordered a Lambajin pizza for myself along with baba ganoush for the table. I have never seen Mediterranean/Middle Eastern-style pizza before, and I must say I am hooked. The healthy portion was hugely appreciated, regardless of our hunger, The baba ganoush was also delicious, and not a piece of eggplant or pita was left behind.\n\nI so dearly wish my neighborhood had a place like Tutt Cafe on the corner, but alas Manhattan will have suffice with Jewish delis and bagel joints. Until next time, Tutt!", "author": "Arthur C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-06-04", "description": "COCKROACH in the food!! Yep, you read that right. AVOID this place!\n\nHow are these guys still in business beats me... \n\nI tried this place a few times, finding the food mediocre, but the last experience topped it all...  \n\nThe merguez plate I ordered had dead COCKROACHES in it!!! It's 2017 and this place supposedly passed the hygienic tests?? \n\nGranted, the dirty windows and uncouth appearance of the place never instilled me with confidence, but this???", "author": "Bora Y."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-26", "description": "I have to say that my love for Mediterranean food began in Brooklyn as odd as that may be. I visited this place on my second visit to Brooklyn, but this time I didn't have enough time to go into inner Brooklyn. We spent time near the bridge as typical tourists do, and ended up stopping by Tutt's since it was a good location near by. \n\nWe ordered a regular falafel plate as well as a chicken pitza. The pitza was something I've never seen in a middle eastern restaurant, so I definitely appreciated their creativity. It was a thin crust pitza with just the right amount of crunch to maintain its shape. I liked that the flavor wasn't overly powerful which allowed you to taste the different ingredients used. The chicken was tender and genuine, unlike every chicken pizza I've eaten lol. Many restaurants usually over season chicken to \"give it flavor\" instead of using good chicken meat to begin with and just seasoning it enough to complement its natural taste instead of masking it\n\nThe service here is just wonderful. It seems to be a family owned place, though I am not sure if that's the case. The prices are also very decent for a place pretty close to a tourist attraction site. I am only giving them four stars because I felt like their falafel could use some improvement. I think every Mediterranean restaurant should have delicious falafel. Their Hamas was also very mild in flavor, so perhaps this is the general goal for the restaurant. Our whole meal itself was very refreshing and filling in a good way so I definitely would go back :)", "author": "Fran S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-01", "description": "This place is great! I order pizza (and the occasional smoothie) from here all the time and it never disappoints. The staff are very friendly and attentive - definitely recommended.", "author": "Michael O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-23", "description": "we choose a spot not over-tourist and over expense and here we are . very afford. very deliciumundo (ha ha ha) very nice staffing and a fun atmospheric with carpets that were very nice and fun with the fun that was nice here PLEASE OCME IF YOU ARE IN THE AREA", "author": "Mosirabelyupopuo M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-02", "description": "Such a great hidden gem. Unsuspecting but delicious. Stumbled upon this while riding thru south Brooklyn. Will come back the leg of lamb and baba ganoush was delicious.", "author": "Marcos L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-29", "description": "Just came back here after a two-year hiatus of forgetting about this place - how could I! I hyped it up to the friend I brought and was genuinely nervous that it would disappoint...but it didn't! We had the Chicken Pitza again - A MUST order - and I was in the throes of a mouthgasm once again. We also had the assorted salad - Tabbouleh, Babbaganoush, Beet Salad, Hummus and Lentil. Everything was fair, but we were craving more Babbaganoush and Beets when it was all done. Overall, super quick and friendly service and delicious noms that hasn't deteriorated over the years.\n\nWho needs Grimaldi's when you have Tutt Cafe? {Note: Their Storefront says \"Tutt Heights\"} The Arabs always do it better!", "author": "Tony L."}], "servesCuisine": "Middle Eastern", "priceRange": "Under $10", "name": "Tutt Cafe", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "47 Hicks St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/y14pR0udRjoftBtR39bWCg/ls.jpg", "@type": "Restaurant", "telephone": "+17187227777"}