{"aggregateRating": {"reviewCount": 217, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-03-07", "description": "Nice people but rather slow service. Good food.", "author": "Datan B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-19", "description": "Went in because it's only a 2 minute walk from where I live and had heard good reviews about it.  The staff is super friendly and the atmosphere is pretty nice.  They cook everything to order, including the pita bread.  I ordered a falafel sandwich and it was delicious.  I'm definitely going to become a regular here.", "author": "Rafael B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-28", "description": "Simply Awesome !!! \n\nThe first thing I would like to mention is that the food that's served to you looks exactly like the food photography on their website and menu. What I find really irritating is when you go to a restaurant and are served the complete opposite of what they display on their menu. I read the good reviews but one of the reasons why I wanted to eat here was because they have Merghez Kebabs on the menu.I last had Merghez Kebabs when I was on holiday in Tunisia and fell in love with them, so was curious to try them here. OMG ! The kebab was so fresh and tasty and the baba ghanouj was awesome. We also ordered the Chicken Pitza, Simply Amazing ! Juicy chunks of marinated succulent chicken with delicate spices on top of a crusty pizza base fresh from the oven, too good for words. The iced mint tea was really refeshing as well and the service top notch !  One of the best foodie experiences I've had in New York. They also have shawarma sandwiches for $6. Great to take with you for lunch along the Brooklyn Promenade. You can tell that everything here is made fresh on the premises. Tutt Cafe really care about the food they serve to their customers. I hope it stays this way. \n\nLoved it !", "author": "Sadia S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-23", "description": "I ate here with a friend weeks ago, but I will never forget the meal!\n\nThis restaurant is such a great place with delicious food at an incredible price. Homemade pita bread for $1! The hummus was amazing. I tried their gyros and they were pretty good. For about $20, we got pita bread and hummus, two soups, and two dishes. Not bad!\n\nI will definitely be revisiting this place. :)", "author": "Samantha P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-03-20", "description": "This is a quaint neighborhood restaurant with a small menu, but everything they do is excellent.\n\nChicken plate is superb, all very fresh, and they hand roll their freshly baked pita bread, which comes out piping hot and in a huge puffed ball like a poori.\n\nVery good babaghanough and hummus. Also a nice spinach pie.\n\nThey have a memorable hibiscus tea (iced or hot).\n\nSave room for desert. They have the best cardamom flavored thick arabic coffee, and their basbusa (honey cake) is sublime.\n\nI'm here at least 3x a month, usually after the gym. It's casual and also makes great take out and delivery.  They guys who run it are very friendly and accomodating.\n\nDog friendly during the summer at the outside tables.", "author": "Matthew P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-12", "description": "Great prices. BYOB with fresh, tasty dishes and sides.", "author": "Charlie S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-02-17", "description": "I have, excuse me, had been happily joyfully ordering from this restaurant for a decade.  Tonight I was verbally attacked by the man on the phone as I rang to find out why their delivery guy called and hung up on me 3 times in a row.  Then the man on the phone proceeded to get mad at ME for wanting my order and not wanting to go outside and find the delivery guy to get it.  Then the man on the phone came TO MY HOME and proceeded to raise his voice and aggress me in my hallway?!!!??...without my order???!!  This is SO beyond, as a young woman at home alone, I don't know whether to be scared or mad.  The prices have gone up and the service has gone down in the past few months and now is desperately, frighteningly ill-equipped and  aggressive to the point of being prosecutable.", "author": "B D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-14", "description": "All the sandwiches are awesome.  Good, clean, healthy food and for $6 you can't go wrong.  They also have quick delivery.  My go to sandwich place.  I'm not a fan of the hummus, but the baba ghanouj and spinach/cheese appetizer is excellent.", "author": "Taimur A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-12-09", "description": "I really enjoyed coming here in late summer, sitting outside with a bottle of BYOB wine. But the food was just ok. Knowing there are other great places for Mediterranean near by, I wouldn't return.", "author": "Anna S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-09-12", "description": "Love it.  Clean, friendly, affordable, delicious.  Not a fancy place by any means, but if you just want a comfortable place for good inexpensive food in the neighborhood, it can't be beat!", "author": "Mike P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-16", "description": "Pretty much everything is fresh and flavorful but the most delicious items come from the pizza oven -- we get the zaatar bread every time and love the spinach pie, too.  And as others have mentioned, the falafel is delicious as are the meat dishes and there are lots of vegetarian bean and grain salads as well.", "author": "Karen D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-12", "description": "We live around the corner from this little place, and had yet to try it out until tonight. It's everything everyone else has said and more. \n\nWe got the garlic pita to start and I am not kidding you it was unbelievable. Also had 2 falafel plates with hummus which were equally good. \n\nWill definitely be back!!!", "author": "Rachel D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2007-12-18", "description": "Tried Zaatar pita, and Babaghanjouj.\n\nI thought the zaatar pita was pretty solid, sesame seeds gave strong flavor on a very flat pita....\n\nThe baba ghanouj itself wasn't particularly interesting, but the fresh pita---a very thin pita which is kind of puffy with bubbles---was hot and fantastic. I am definitely going back.\n\n\nok just went back again.\n\ngarlic pita is ridic amazing! lemon and garlic on a pita...\nspinach cheese pie is a puffy delight....\n\nmy friend had a lamb merguez sandwich is small for the price but good...he said he needed to have a real meal after that....\nbetter to order the plate and cough up the cash instead of a sandwich...\n\nservice is slow....but due to preparation time probably", "author": "Mo C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-04", "description": "This is a neighborhood gem.  It is reasonably priced and good for take-out or sitting-in.  The hummus is fresh and creamy and the pita is also freshly made for each order. ...and even better Cafe Tutt allows BYOB.", "author": "Felicia M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-21", "description": "Tutt is tucked away on a rather off the beaten street in Brooklyn Heights.  There wasn't any crowds; just a slow stream of customers going in/out.  My friend and I met here for dinner Saturday night and we enjoyed the opportunity to talk  without having to yell across the table from each other.  The staff was doing there own thing and only came to our table to get our order and to give us our food.  They were attentive without making my friend and I feel rushed.  The food was excellent!  I order the leg of lamb plate and my friend got the chicken pizza.  The leg of lamb was perfectly seasoned and the meat was not tough.  I would definitely go here again! :)", "author": "F N."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-01-14", "description": "Cheap, good, homey arabic food. The setting is OK-kind of looks like a stereotypical casual Arabic place, with the classics we all know and love- Merguez sandwiches, Kebabs, Baba, Hummus, Yogurt dip (highly recommended), etc. It's also BYOB. It's a great little place if you live in the neighborhood, but not really anywhere I'd make a trek for.", "author": "Rebecca A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-01-10", "description": "Tutt is a wonderful little Egyptian cafe on a beautiful tree-lined street in Brooklyn Heights.  The people who work here are friendly and attentive.  The food is cheap and plentiful.  I'm in love with the freshly baked pita bread that always comes straight out of the oven.  I'm also crazy about the beet salad, the pitzas (kind of like a pizza made with pita bread), the homemade soups, the... ok, I really like everything I've tried here, not to mention the fact that the most expensive thing on the menu is a ten dollar leg of lamb plate which leaves me stuffed and content for the rest of the day.   I'm really going to miss Tutt when I move out of Brooklyn Heights next week.", "author": "Jeanne E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-12", "description": "We stumbled upon this place when our two Zagat choices failed us by being closed for lunch.  It was really good middle eastern food.  I got seasoned grilled chicken with hummus and they make fresh pitas there that were soooo good.  The waiter was very friendly and they gave us free cake at the end that was also really good.  Try it!", "author": "J K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-10-12", "description": "I love their PITZAS! I am a big fan of thin crusted pizzas, but the idea of a pizza made with pita crust is quite unusual in comparison and well worth a trek over Brooklyn Bridge for a taste test. \n\nThese pitzas are 10 inches in diameter \u0026 come in 6 or 7 different varieties. The cheese can be mild, but the amount of toppings they offer is plentiful. I usually get mine with mushrooms, artichoke, garlic, \u0026 parsley. \n\nIt is a very light pizza, so a whole pie is enough to feed one person. Also, for $7-$8 a pie...that's quite a bargain!", "author": "Wendy C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-05-16", "description": "Tasty stuff. I am huge fan of their Murguez (sp?) not really sausages (? no casing) but wonderfully spiced little ground lamb treats. Everything here is tasty - as people have said things have a nice tart flavor that really is something special. Good hummus, good pitas. Service in the place is slow and they are cash only so be prepared but its always worth the wait. You can cram a lot of people in here around lunch time.", "author": "Carl C."}], "servesCuisine": "Middle Eastern", "priceRange": "Under $10", "name": "Tutt Cafe", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "47 Hicks St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/y14pR0udRjoftBtR39bWCg/ls.jpg", "@type": "Restaurant", "telephone": "+17187227777"}