{"aggregateRating": {"reviewCount": 217, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-08", "description": "I've never been to their location but get delivery from TC at least once every 2 weeks.  Very affordable, free delivery, good sized portions and awesome food!\n\nI'm stuck on the chicken plate and can't seem to get away from it not matter how many times I tell myself to get something else.  The chicken is grilled; tender, juicy and very well seasoned.  You can taste a good amount of garlic as well as many other of Mediterranean spices that are used.  They give you a good amount of chicken for $9.00.  \n\nI been wanting to try their baba ganush, but am stuck on their hummus as much as I am with the chicken.  The hummus is creamy with a touch of olive oil....good stuff here.  And it comes with FRESHLY baked pita bread, that, even when delivered is still nice an steamy.  \n\nI've also had their falafel, which was also very tasty.  But ordering a side of falafel with the chicken plate seemed to be too much food for me.   \n\nTheir pitza is supposed to be the hype, but again, I haven't been able to venture past the chicken plate. If you're in the delivery area, TC is legit in my book -- cheap, good and filling.", "author": "Roger C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-04-22", "description": "I have been to Tutt Cafe many times now.  It is a little gem hidden in Brooklyn Heights on Hicks St.  Unless you knew it was there, you would never go looking for it on that block.  But, when you stumble across it is worth it to stop and sample the cuisine. \n\nThe menu is a Mediterranean fare, spinach pies, falafels, salads. and fresh baked pita.  They have a pizza oven where they make the pita bread while you wait.  They also serve pitza.  A pita pizza...  They have various toppings... I really enjoyed the Lambajin pitza... a middle eastern pizza full of lamb, onion, tomato, parsley, and spices... Good stuff..  For dessert they have baklava and basbousa (semolina cake) and great smoothies.\n\nThe atmosphere is a little dark... but I have seen them have successful parties there. I believe they are cash only also...  But, if you are in the heights this is a great place to check out.", "author": "Scott B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-18", "description": "Three delicious suggestions:\n\nMerguez sandwich --- spicy lamb sausage, lettuce, tomato, onion and little sauce wrapped in a freshly grilled pita.\n\nLamb sandwich --- i wish they had shawarma but this is close.  Tasty grilled leg of lamb, tomato, lettuce, onion and a light spicy  sauce in a freshly grilled pita.\n\nLentil soup -- served with a lemon wedge.  The lemon joice gives a delicious zesty tang to a wonderful vegetarian lentil soup.\n\nGreat stuff!", "author": "O U."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-17", "description": "I lived next door to this place for a year and a half and it is hands down the thing I miss most about living in that neighborhood. We were just back in the heights the other day for other reasons and decided to have lunch there. After having stopped in only one other time in the last year and a half since we moved to park slope, they still remembered us! Granted we had been in there all the time before we moved (when I say next door, I mean they could lean over the gate and hand me my food while I was in the doorway!)\n\nAnd the food was just as good as I remembered! My favorite is the Green Pitza. I barely ever had to tell them what I was ordering, it was my regular! My husband had the Lentil and Bulgar salad, his favorite, and we shared some Babaganush. \n\nI sure do miss going there regularly, but it's a nice treat whenever we're in the area. :)", "author": "Rebecca S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-02", "description": "Omg this place is so cheap and soo good! The seating is not the best but you can always buy takeout and go near the Brooklyn bridge promenade and eat while enjoying the downtown manhattan skyline view! The falafel sandwich and the merguez sandwich are really good. The green pitza is by far THE BEST in NYC! I've tried at 4 other places and nothing comes close to this!", "author": "Shakir T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-18", "description": "Love this place. Lived right next door. Truly a hidden gem. Chicken Pizza is so delicious! Staff is so friendly and the prices reasonable. Ps--byob-- not that we ever did since we lived right there...always a nice perk.", "author": "Jenna S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-01-06", "description": "I love this place, they serve fresh, clean, healthy, and delicious Egyptian fare, and the guys who work there are a fantastic bunch - friendly, warm, and attentive. You can also bring your own booze if you want to dine in, and the place has a nice relaxed pace; you can sit, relax, and eat, and they are always welcoming.\n\nThe food is simple, well prepared, and really tasty. I love their spinach pies with cheese, the lambajin pitza - basically a flatbread pizza with ground, spiced lamb - and the falafel plate, which comes with a side of baba or hummus, both of which are excellent here. They do nice grape leaves too, and a large grape leaves with a side of hummus and a fresh pita from their pizza-style ovens is a nice healthy way to have a quick dinner, and won't cost more than $10 or so.", "author": "Justin C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-30", "description": "Excellent falafel!! Delicious dolmas, baba \u0026 hummus. Affordable too. Can't wait to return for more falafel!", "author": "Kenna C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-05-11", "description": "5 stars all the way. A plain restaurant in Brooklyn Heights, right off Brooklyn Bridge. Delicious middle eastern food, homemade pita. The leg of lamb is moist, nicely flavor with herbs and garlic.The staffs are super nice and quite inexpensive food. BYOB, BYOB, BYOB...", "author": "SK C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-30", "description": "When I traveled to Egypt in 2001, I was amazed by the complex of tombs and temples in Luxor and delighted by the colorful fish that populated the Red Sea.  The fertility that hugged both banks of the Nile was as thick as a butcher's furrowed brow, but the food that was harvested from that narrow strip of green and swaying palms was bland and mushy.\n\nWhen I returned home I had memories of Picasso fish and still felt the eerie shadow cast by the Colossi of Memnon, but the only memory registered by my palate was the curiosity of fresh dates whose flesh seemed like wooly cotton candy and whose skin was crisp and red as an apple.  Still, I preferred the dry ones.\n\nIt comes as little surprise that I greeted Tutt Café with a bit of suspicion when my beautiful fiancé mentioned a small, Middle Eastern BYOB not far from her apartment.  The Astroturf and plastic lawn furniture scattered in front of the restaurant did little to allay my fears, and the menu read like a primer for the standard falafel, chicken pita and tabouleh dishes that are ubiquitous at establishments of this ilk.\n\nAfter ticking off foul (Egypt's national dish, a staple made from fava beans and almost any other bean, pulse, lentil or small-dye pasta: but in this case, tossed with tomatoes, parsley, onion and garlic) out of habit, and ordering a bowl of harira soup (a chickpea and lentil stew) I began to take interest in some more unusual salads.\n\nA spinach and chickpea salad is more accurately a fried onion and wilted spinach dish that is better than it sounds. Lemon juice livens it and the chickpeas fill it out.  Lentils and bulgar--two of my favorite foods--are as substantial as they sound and, also garnished with fried onions, have a deep caramelized flavor.  I love dolma (grape leaves stuffed with spice-flecked rice) and Tutt's are as serviceable as any you can find, if not outstanding.\n\nThe menu is a bit heavy on onions, fried or raw, and chickpeas (which also appear in a hummus that is lightened by a prudent portion of tahini).  This could be a criticism, but I remember Egyptian food in much the same way.  Somehow, Tutt manages to makes and remake these staples in ways that are just challenging enough for the palate to refresh itself, rather than surrender to the intense flavors of sumac, zaatar and garlic.  Choosing the selection of five salads (almost larceny at $9) and a cold loomi (citrus) or hibiscus drink will give you a healthy, delicious meal for under $15 (with tip) that would be $25-$30 at a mediocre tapas bar.  And the fresh pita, arriving like a flour-dusted pillow as wide as a steering wheel but, probably, too hot to grab right off, will round out a generous lunch or dinner.\n\nThe pitas are outstanding.  A bit of water, flour and yogurt rolled out like a pizza crust and cooked on a skillet in a matter of minutes causes passersby to wonder what youthful memory is being conjured.  Was it the first time they smelled fresh bread or waking up and making toast before their parents poured them a bowl of cereal?  This is \"the small, good thing\" Raymond Carver's baker crafted.\n\nOther dishes that will surprise and delight are a Green Pizza that reads fairly awful: leaks, scallions, fenugreek and mozzarella.  Mozzarella?  Hardly native to Egypt, this soft, young cheese melt over that green and mild leaks, alarming scallions and grassy fenugreek leaves in one of the city's best kept pizza secrets.  This dish is so good that I abandoned the lambajin (a etymological and culinary relation to the lamajhoon or Armenian pizza which was my favorite childhood treat) after the first and have since ordered a green pizza on each visit.\n\nThis is not gourmet food, and it is not the type of countrified comfort food that has crept into the Brooklyn culinary milieu.  The dishes are limited, somewhat repetitive but they hit familiar notes in delicious ways.  A leg of lamb pulls apart with a gentle push of a fork and almond-shaped slivers of whole garlic slide out of the crevices in which they were flavorfully imbedded.  The mint mayonnaise is thicker than it would be at a fine, or finer, dining establishment, but on a sandwich it works.\n\nThe only weakness of Tutt is ironic.  The foul suffers from constant insipidness.  Perhaps it's a hardheaded refusal to use canned tomatoes in winter (cans of San Marzano tomatoes would be amazing) rather than the mealy, pinkish dice currently employed.  Maybe a simple concasse would add some concentration, but as of now the foul suffers.  \n\nJust a few blocks from Henry's End or Noodle Pudding and within shouting distance of Jack the Horse Tavern, Tutt Café contributes to a flavorful few blocks of dining out that is as varied as any other part of this burrough.", "author": "Kevin K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-03", "description": "The food is delicious and the service is excellent. The chicken plate was outstanding as well as the fresh pita and feta salad.", "author": "Angela D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-02", "description": "This place was fantastic for the price, and the salads are all awesome.  Unfortunately, the falafel is not as crispy as I'd want it to be, and I actually found it to be a little over-seasoned (or maybe just over garlicky).  The humus, grape leaves, labna, and beet salad are all fantastic.  The babaganoush wasn't as awesome as I was hoping it would be - again, it might have just been that the garlic flavor overpowered the smokey eggplant.  The pita is SO fresh and amazing and warm and fluffy, so I will definitely be returning for the pita and salads...I'd pass on the falafel next time, though.", "author": "Lily E."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-06-07", "description": "Food was Ok. Service was not good. A.C. wasn't working.", "author": "Mike A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-22", "description": "The food here is delicious, authentic, and at a great price.  The only downside is that the men I dealt with while placing my order did not speak the greatest English, leading to some difficulties... disclaimer: I'm the type of person who likes to ask questions 1) the first time eating at a new restaurant 2) when I get excited about the food at this new restaurant", "author": "Michelle R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-08-17", "description": "Good food, slow service, though. Important note: CASH ONLY.", "author": "Anders B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-03", "description": "A hidden gem in Brooklyn Heights, Tutt Cafe is reasonably priced and always fresh. Sam, the owner, is from Egypt and is involved in the cooking and preparation. The food is simple and very tasty. The homemade pita is what makes this place. I also love the lentil soup. This is a no frills place. Everyone who works there is from Egypt and is very polite. Bring your own wine or beer, they dont have a liquor license. Tutt Cafe is great for large parties for dinner. Good people always equals good food.", "author": "Kamuti K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2006-09-21", "description": "Tutt Cafe is a hidden gem of fresh and delicious egyptian food hidden amongst brownstones on an entirely residential block. I've tried just about everything on the menu and you really cant go wrong. The choices for an entre are variations on a theme - sandwhiches, platters or pitzas of lamb, chicken, falafel, or vegetables. A pitza is a Pizza made with a pita crust and not necessarily with cheese. A single pitza can be eaten by one person - and thats a big portion. \n\nI really cant convey how amazing the pita is here. I lived in Israel for a year, and this is the only pita I've had in New york that compares. It comes out hot and fresh, straight from the large brick ovens. Also make sure to sample the babaganouj which has more flavor then every package of store bought baba you've ever bought COMBINED.\n\nMy only complaint is that I wish there were specials or more choices on the menu so that I could justify going there more.", "author": "Aaron Q."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-02", "description": "I recently went back and had the green pizza:  leaks, scallions, and fenugreek with mozzarella cheese\n\nDELICIOUS", "author": "Maha C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-24", "description": "great place to pick up a wrap before heading on your brooklyn bridge walk, freshly baked puffy pita bread is a must. This is more of a take out place, due to the interior.", "author": "Nana K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-20", "description": "Always good! I usually get the assorted mixed plate--you can choose 5 salads from their selection. Its totally healthy and totally delicious- happy combo.  When Im just in the mood for delicious I go for the merguez sausage.\n\ninside decor--average.  Outside during warm weather is better.\n\nIts my reliable neighborhood take out spot.", "author": "suzanne k."}], "servesCuisine": "Middle Eastern", "priceRange": "Under $10", "name": "Tutt Cafe", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "47 Hicks St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/y14pR0udRjoftBtR39bWCg/ls.jpg", "@type": "Restaurant", "telephone": "+17187227777"}