{"aggregateRating": {"reviewCount": 217, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-06-13", "description": "Great neighborhood food in Brooklyn Heights.\n\nExcellent Egyptian-style Middle Eastern food.  The pita is made in house and is worth the trip.  The babaganoush was the best I've ever had, my wife had the Egyptian \"pitza\" and loved it. Get it?  pita + pizza = pitza.  Pizza topping on the homemade pita. I had the lamb sausage plate: spicy lamb sauage, salad humus and pita..  With all that we had more than we could eat and the bill for two came to $22.00.  \n\nI don't think I'd go out of my way to go to Tutt, but you are in Brooklyn Heights and looking for a quick, tasty, inexpensive meal, go with the Tutt.", "author": "Charles S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-08", "description": "Great place for lunch. Awesome freshly made pita, non-greasy falafels. George is extremely nice, friendly \u0026 helpful. Highly recommend if strolling in the Dumbo area.", "author": "Frantz P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-27", "description": "I got the chicken plate, it comes with a fresh pita and was delicious! I would definitely come here again. The server was very nice and the food was over all very fresh and tasty.", "author": "Kayla B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-01-25", "description": "The falafel wrap was pretty good. Not amazing. I've had amazing. Many selections available on the menu. Cheap. Middle Eastern music blasting in the background. Fairly large portions, be careful not to order too much. Menu has lots of pictures. Not easily accessible by public transportation. Can sit there for 3 hours, no one will rush you. \n\nWill probably go back again for takeout.", "author": "Jamylin W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-27", "description": "This has been one of my all-time favorite places for years now.  As a gluten-intolerant vegetarian, I find their soups (options of harira or creamy lentil) irresistible; top that off with a side of grape leaves, and I'm in heaven.  My friends are addicted to the varied mini pizzas (made with fresh pita bread) and falafel.  The baklava and basbousa cakes are excellent.  You can linger, relax, and enjoy.  The service has always been excellent.  This is a simple, relatively bare-bones place - we may not be talking 5-star atmosphere, but the food is wonderful, the prices are excellent, the staff is always welcoming, and if you have little ones, they are very family friendly.  Enjoy!", "author": "R. A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-02", "description": "Amazing service! Most friendly servers, make you feel like family. George is the best! Not to mention great food. Try the chicken plate!", "author": "Susan F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-26", "description": "I love the people here as well as their food. I always feel at home. The vegetarian platter, and the succulent lamb platter are my favorites, and the fluffy pita bread they make fresh is delicious.", "author": "Michael B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-06", "description": "I've been looking forward to stopping by Tutt's after good friend of mine recently moved to Brooklyn Heights.  It's only a short walk down the street and I just can't resist middle eastern food. So last weekend on an empty stomach, we stopped in for an incredibly satisfying yet affordable meal.  We ordered à la carte and shared a lamb sandwich, chick pea soup with fresh baked pita, some really incredible roasted eggplant babaganoush, with fresh baked pita and a fresh baked mini pita pizza.\n\nWhatever you do make sure you order pita bread in some form, it's amazing. It arrives quickly from the oven to your table as a huge puffed up steaming pillow of awesome. Their pita really couldn't be better and they offer so many choices of toppings, so enjoy. The pricing is very reasonable; for all that I mentioned above think we paid $25 for two which really can't be beat.\n\nKeep in mind this is not  fine dining but that's ok, here's what to expect. Tutt's is an oddly decorated \u0026 smallish cafe that comes complete with 1 overworked server and a bunch of bakers scaling dough behind the front counter. What's funny is they recently closed for a short time for renovation. After visiting however, I'm thinking the renovations were not cosmetic. Perhaps they installed more ovens but who knows, either way, I like it. In fact, a group of people we met up with later overheard us raving about it and ran down to pickup some lamb sandwiches to go. I'm pretty sure only one lamb sandwich made it out the door.  Tutt's is just another excellent choice for an affordable meal in Brooklyn Heights, which seems to be expected for the area. I also enjoyed a meal at one of the best sushi restaurants just off Henry St. a few weeks back and I'm looking forward to exploring the area.", "author": "Semi Chef C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-27", "description": "My favorite neighborhood place for a quick Middle Eastern lunch. The food is inexpensive, with good portions and arrives quickly. The staff have always been friendly. It loses a point since it's kind of a dive and the tables are wobbly, but I will definitely be headed back again.", "author": "Emily P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-05", "description": "Why has it taken me this long to order from here? This place is literally a minute from my apartment and it is delicious!\n\nThis review is for their delivery and food - I haven't eaten in the restaurant - YET!\n\nI had a desperate crazing for pizza and Fascati's was on one of their many holiday hiatus so I decided to finally give this place a try. The gentleman who spoke to me on the phone was lovely, as was the deliveryman. Delivery was prompt and my food was piping hot! Just like it was fresh out of the oven.\n\nI did get a pitza, which was really tasty, with a nice, flavorful sauce, ample amount of cheese, and fresh veggie toppings - but everything else blew the pizza out of the water! Fresh hummus and fresh baked pita = YUM. The falafal was really good too and the salads were huge and super fresh. A side of stuffed grape leaves had my boyfriend yell at me from the kitchen: THIS IS INCREDIBLE! All this for under $30 including tax and tip! Enough food for lunch and dinner! That's dirt cheap for Brooklyn Heights. \n\nI definitely have a new take out standby, and I am excited to sit down for a proper meal in the cafe.", "author": "Jennifer S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-16", "description": "Please order the spinach-cheese pie. It really is a pastry filled with delight (said Mo C.). At $4.50, the cheapskate skeptic in me declared, \"No.\" But it was recommended by Yelpers AND the other items were around the same price, so I added it. The pastry was 19 cm+ (7.4 inches) and fairly thin. It was soft and loosely filled with fresh spinach. The stringy mozzarella cheese was a wonderful accompaniment to it, adding a satisfactory chewiness to the pie.\n\nFalafel sandwich had flavour and seasoned goodness. The onion stood out the most in freshness, and gave the sandwich/burrito styled item an extra crisp taste. \n\nIf you're ordering items to go, it may take 10 minutes, as they appear to freshly bake and make most items. Love you, Tutt Cafe!", "author": "Debbie F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-28", "description": "So I came down here to grab a salad during the arts festival.  Their garden salad is so good other garden salads soups take that name off their menu until they equal the quality of this place.  Very friendly staff and good price especially for the variety of vegetables yet great taste of the salad.  Will definitely be coming back here often!", "author": "Jason C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-06-09", "description": "so i gave this joint another shot and quickly regretted it. once again, the service was deplorable. all i wanted was a piece of baklava. it was already made. no work to be done. just take my money. don't even give me a bag. i'm cool. but noooo....two dudes behind the counter. one of them was laboriously packing a takeout order. he was confused like he had never seen the food before. it was taking hours. the other one was fixing a plate. he would take rest breaks and kind of stare vacantly into the distance. after about 10 minutes of this pantomime, i was done. left without baklava. went on henry to heights falafel and had a sublime lady finger for half the price and in 1/8 of the time.  tut tut...", "author": "Milly M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-09", "description": "Love the chicken sandwich and it was cheap. They do take a while to make the food so call ahead.", "author": "Benny A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-03-12", "description": "If the place is going to advertised their delicious stuffed pitas, you would expect them to put some more care into them. My lamb pita consisted of some sparse sauce, sad tomatoes, lettuce, and some very bland lamb. Considering that the man at the front desk recommended the dish, I was especially underwhelmed.", "author": "Christopher R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-09", "description": "I thought Tutt Cafe was delicious and a great value. My boyfriend and I dropped in for dinner after wandering by. The restaurant we had planned to go to was closed, so we sort of stumbled into Tutt on a whim.\nWe had a small plate of grape leaves, hummus with extra pita, a sun dried tomato pitza (pizza on a pita) and two mint iced teas. Dinner was $25. Which easily makes this one of the cheapest dinners we've had out recently.\nThe grape leaves were divine. I dislike when dolmades are overly greasy without enough lemon juice to cut the oil, but these were perfect. I really could have made a meal out of them on their own. Also, the pita was super fresh, right out of the oven and full of steam.\nMy only complaint would be that it was not overly air conditioned inside the restaurant. It was a little stuffy, but worth the lack of a breeze for the meal. We would go back.", "author": "katie h."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-09", "description": "Great stuff. I live in the heights so this is a five minute walk from where I live. I love Middle Eastern / Mediterranean food so I was eager to try this place out. \n\nI ordered the hummus and the falafel sandwich (Only $4.00 for each item!). The hummus was good, except I felt like it was a bit too smooth and could have used a bit more spice. Just a quibble of mine (I'm used to more flavorful hummus). The pita they serve is made fresh to order, which is a nice touch. Some of the best pita I've ever had. Great texture (a bit crispy, a bit chewy). The falafel was quite good as well. It was served in the same pita with tahini and tomato and lettuce. Sounds simple, but could not have been better. I'm eager to try the other items on the menu ^__~\n\nThe overall feel of the restaurant is very relaxed. A nice place to have a casual, quite lunch with a couple of friends. \n\nOverall, very good food for a cheap price. Call it in and pick it up in order to save money. Free delivery too!\n\n**Cash only**", "author": "Spencer W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-15", "description": "I found about this place when i worked in Dumbo and there was nothing to eat there so I would have to venture out for lunch. \n\nI love Tutt Cafe! Now that I no longer live in NY I feel as if I took this place for granted. Every time I'm home from CA, I must stop at Tuff cafe. I love the Chicken plate with a side of falafel (although they raised their price on the falafel, which I don't like). This place makes fresh pita bread, and I have yet to find any place that does the same. I also get the chicken pitza with basil and garlic. \n\nIt's not much of a pretty place to eat inside at, sometimes I do takeout or just eat it along the promenade. \n\nLove love love this place! It's a must go to!!!!", "author": "Adriana B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-11", "description": "By now reading the reviews you see a theme:\n1. The fresh pitas are awesome\n2. It's not too spendy\n3. Get the combo plate if you are ready to eat a ton. \n\nNot sure that it beats Mamoun's, and it's def not the same as Tanoreen's sandwich. (which is also awesome) This spot Is sorta out of the way, but def worth the trip!", "author": "Erik C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-03-03", "description": "The food/price/BYOB combination has made this my favorite restaurant ever. I will NEVER get tired of fresh baked pita with the most flavorful falafel balls ever in them. I love you Tutt cafe. Please don't change a thing.", "author": "Bobby C."}], "servesCuisine": "Middle Eastern", "priceRange": "Under $10", "name": "Tutt Cafe", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "47 Hicks St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/y14pR0udRjoftBtR39bWCg/ls.jpg", "@type": "Restaurant", "telephone": "+17187227777"}