{"aggregateRating": {"reviewCount": 152, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-22", "description": "The Quarter is a real gem of a place in Fort Greene. Amazing drinks, food and ambiance! Very friendly service! Will definitely be back!", "author": "Sarah D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-10", "description": "I was surprised to see the hidden garden, very cozy and nicely decorated. Good service, we had 12 pieces of oysters, 1 chicken dish and bottle of wine, it was under 80 bucks..\nStaff was friendly, certainly knew what thy are doing.\nWhen our server heard about my birthday celebration outing last week , i got a mini belated birthday cake which I thought was very cute. Wow!", "author": "Alan K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-03-27", "description": "This is a review for brunch. \n\nMy husband and I made a reservation here on Sunday for 12:30. The location is great, and the building was very charming. The decor and ambience inside was really nice. I love their gorgeous ceiling! After being seated, it took 20 minutes for us to place our drink orders. I'm not sure what was going on or if they were short-staffed, but the person who sat us at our table was just walking around wiping off tables and putting silverware out. There was another older man who wasn't in uniform, so I'm guessing he was management of some kind. He was just kind of wandering around aimlessly. We made sure to attempt to grab their attention, but they weren't really having it. The thing is -- I know that people have bad days and that employees call in sick or come in late. It would have been nice if our server had apologized or told us. Instead, he mostly continued to ignore us. Someone else brought our food and checked on us a few times. The food and drinks were outstanding. I had their take on a Kir Royale, and my husband had the New York Sour. We both got the bacon eggs benedict, which is just your normal eggs benedict with fries and bacon on the side. It was fantastic! I'm not sure what they put in their hollandaise to make it so delicious, but I could have literally eaten that hollandaise out of a jar with a spoon! We ordered our next round of drinks from a random person. It was strange. Eventually our actual server came back, and I asked for the bill. Of course, he was very attentive after that. \n\nThe food was really good here, and there are so many other great reviews. I'm sure we went on an off-day, but I'm still taking two stars off for the lack of communication and just general confusion. We'll definitely be back for dinner, and I hope that I can update this review at that point!", "author": "Jessica G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-20", "description": "Been here twice, once for brunch and once for dinner. Both meals were amazing. The Mcquarter breakfast sandwich was especially good.\n\nGreat vibes, friendly staff, and beautiful atmosphere, so glad fort Greene has a new go to spot, and can't wait to take advantage of their backyard dining when it warms up!", "author": "Ryan G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-28", "description": "Came here after being treated poorly by the staff at Prospect on Fulton. Manager greeted my friend and I Friday evening and regretfully informed us they were booked solid and we were disappointed but understood. He then asked for us to wait a moment and he managed to craft a spot for us in the corner of the bar within just a minute.\n\nWe got drinks and oysters and some small plates. I'm an oyster snob and this place knows what they're doing! Food was great, service was impeccable and I will most definitely be going back. Shout out to TJ I think his name was, the manager who made room for us to experience this adorable restaurant!", "author": "A.Marie S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-03-23", "description": "I usually review for food only and don't care much about service. However, when a party of 3 comes in at 10:40pm, tells the waiter we are here for food, the waiter sits us, brings 3 food menus, then 5 minutes later returns to tell us the kitchen is closed, and so we end up \"eating\" under-sized pours of overpriced wines, the review has to be about the service.", "author": "Sasha M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-06-24", "description": "We were sitting in the garden if you can call it that. All the flowers looked dry and there were bugs around it, not pretty. Then my ginger martini didn't taste like ginger at all, we ended up getting cheeseburgers which were badly burned. Staff was nice and it was pretty quiet but over all not a good experience.", "author": "Kay P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-09", "description": "Really happy to have a new spot for oysters in the neighborhood. And here's the good news - the oysters are AWESOME. They have a big selection, they're MEGA cold, and there are no shells leftover from the shucker! If you're big into oysters, please come here and check them out. We also had a foie gras type of toast, a steak toast, brussel sprouts, and fish tacos. A lot of randomness but all of it was really good! \n\nThe front of house could use a couple of tiny tweaks. 1) The music playing was cheesy club music and it was a little loud. More like cab ride music than date night dinner music. 2) There's a big \"Brooklyn\" sign on the wall. That will make some of the locals turn their nose up because it looks more touristy than neighborhoody. \n\nThe service was great and everyone there was super friendly. We will definitely be back!", "author": "Karyn S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-04-18", "description": "Came here yesterday for brunch.  I was really debating what to rate this place but I think it's best that I settle on a 3.\n\nIt's a quite little place just right outside of the Fulton Street subway stop on the G line.  You really definitely got it going on the convenience.  The Quarter is down a small flight of stairs and once you enter there's a few tables in the front then there's the bar on the right hand side which extends to the back of the restaurant.  In the back there are about 5 or 6 tables and then a courtyard which has several tables.\n\nFor a Sunday this place wasn't very busy for brunch.  Though there wasn't much staff, the service was definitely spot on.\n\nI had ordered the crispy bacon eggs benedict, since it's been a really long time since I have had them.  The hollandaise sauce was kind of weird since it was this unnatural red color and a bit on the chunky side.  It came with 2 strips of bacon that were kind of haphazardly placed on the plate with a raw sprig of watercress.  I sort of expected Canadian bacon which would be placed nicely under my egg, but that wasn't the case, which made adding the bacon into a bite that much more work.  I know saying that makes me seem like the laziest person in the world.  I still ate it, but have to say I was not the biggest fan.  Not just because I had to work a little bit more to get a bite with bacon in it, the hollandaise was not my favorite, I suppose I should have expected that since it was kind of chunky...  Then again it was pretty late for brunch, so the hollandaise might have sat there for too long.  The fries were okay, but probably could have been a slightly larger portion.\n\nEverybody else liked their food which consisted of the mexican chilaquiles and the brooklyn chicken sandwich(I think that's what is was called).  The chicken sandwich was fried chicken with coleslaw and some sauce.\n\nI didn't feel well afterwards, not sure if it was the hollandaise or if I just ate too late or too much.  Anyways if you decide to come here I would probably steer clear of the eggs benedict depending on the time of day.", "author": "Kent C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-09", "description": "Dollar oysters all the time?! Yes please! The atmosphere and lighting was perfect for romantic date, or a nice night out with your girlfriends. My boyfriend and I enjoyed a dozen of blue point oysters and if you have fancier taste, there are other more expensive choices. Followed by their duck roll, essentially is an egg roll with duck as the stuffing. Definitely Vietnamese inspired served with bok choy and hoisin sauce. For the main course we had BBQ sandwich, which I thought was juicy and topped with a sweet BBQ sauce. By boyfriend thought it was a little too charred so that's why it's one star less. Dessert: delicious bread pudding served with vanilla ice cream. \n\nWould we come back here again? For sure!", "author": "Regina R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-19", "description": "My husband and I went here for dinner on a Friday Night and it was wonderful! The ambiance is cozy and lively for a cold winter night and the food and service is excellent. We ordered the lamb tacos and general Tso steam buns and they were incredible! Not to overlook is the kale salad which has a wonderful ricotta cheese and is very tasty!", "author": "Yael G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-09", "description": "Been here 3 or 4 times now. Adorable back patio, especially when the cover is pulled away. The sides of the neighboring buildings are covered in ivy and it's very charming. The inside of the restaurant is quite cute, too. The oysters are great, as is the fresh ginger sauce they come with. My favorite entree is the pan-seared chicken - DELICIOUS. Our favorite side is the spicy cauliflower with raisins - to die for. Will definitely keep coming back here. A great neighborhood staple! Only warning is that the service can be a tad slow, so if you're in a hurry, I'd suggest ordering and asking for the check as far in advance as possible.", "author": "Emily H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-12", "description": "This has quickly become my Fort Greene go to spot. The menu isn't extensive, but it doesn't need to be. The food is fantastic and elegantly presented. The cocktail menu is great and the bartenders clearly know what they are doing. I absolutely love the decor and atmosphere. It's welcoming, cozy, and classy.", "author": "Samuel B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-07", "description": "The food and drink were great and staff were friendly. I had the seabream and the Barolo. Both delicious! And it's close to BAM and Barclays AND they take reservations. What's not to love?", "author": "Walter W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-08-20", "description": "I'm only giving this place 1 star based on the awful service from our waitress last night. This place is very nice and the backyard garden is beautiful. However, this was our first time here, we were meeting friends here who hadn't arrived yet on Saturday 8/19 around 6pm. Originally we made a reservation for 6 but it turned out that just 2 of our friends were coming so we only needed a table for 4 people. The waitress originally sat us at a table for six but I noticed a table in the back that would probably be better for our group and asked if we could be seated there instead. She said well if more ppl show up this table has more seats but we let her know again that it's only going to be 4 people so she hesitantly let us move to the 4 seater instead of the 6 seater since it was only going to be 4 people. She then proceeded to throw down our menus down and turned over all four glasses by slamming them down on the table. She was clearly angry we asked to be moved for some odd reason even though this place was almost completely empty and not very big and we hadn't even sat down yet, why was this a problem with her? I would think if we know for a fact we are not going to be occupying 6 seats, why should we take up a big table when there may be another party of 6 coming in later? Our friends came and we told them about the waitress awful attitude so we decided just to stay for one drink even though we originally planned on having a few. I really hate spending money at places that treat customers poorly. When we told the waitress we were just ordering drinks(no food) she had an attitude about that! She also refused to do two separate checks. Lol Guess some people are just full of misery they feel the need to project their negativity on to others. We left and had drinks at Madiba and the service there was so amazing that we stayed for hours and had multiple drinks. Probably will never be back here. There's so many great places in Brooklyn that have excellent customer service, why spend money at a place that hates customers?", "author": "Dana L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-02", "description": "Looked to order something to take back to apartment we were renting nearby, and we were glad we tried this place. We tried the pan toasted chicken and pan seared salmon. The pan roasted chicken came with an assortment of winter root vegetables (strange in May) but they went well with the perfectly cooked boneless chicken - tender and moist with nice crispy crust. The pan seared salmon was equally good with the fingerling potatoes and kale.", "author": "Bob P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-02-08", "description": "Was looking at the menu outside one night and a passerby said \"The food is great!\" so came for brunch this past weekend. Meet a friend at 12noon and got a table quickly, wasn't that busy yet. I ordered the Oysters and Eggs, my friend has the Brussel Sprouts with Eggs. My dish was good, eggs were done just right and the 3 smallish fried oysters were fine. The best part was the tomato and onion salad which is very tasty and a nice compliment to the dish. My friend's dish was also good, you could taste the butter which means there was probably a good amount of it used in making the sprout egg scramble. Overall, we had a good meal not amazing but solid. I could tell they were trying to rush us out since the brunch time crunch was approaching. Would come back to try dinner next.", "author": "Emelyn O."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-01", "description": "Definitely my new go-to spot before seeing a show or a movie.\n\nHad a wonderful time here. Came during beginning of happy hour on a weekday. Totally empty which I liked so I could quietly read in the garden seating area. Had the fried chicken sandwich and fries, everything was delicious. Was originally going to head over to Mo's for some cheap HH drinks after eating, but the drinks weren't very expensive for Quarter's HH. We were having such a nice time in a beautiful restaurant, so we stayed. The service from the day and evening bartenders was great! Cocktails were delicious. Good date spot.", "author": "Bea L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-11-02", "description": "Salty Calamari. Over cooked steak. Horrible service. They brought both my app and main course at the same time. I've given this place several chances and every time there has been something to let me down. This was the final straw.", "author": "Warren A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-23", "description": "One of my favorite brunch places. Great service, nice location and for excellent food. The dishes are well prepared and you'll find things on the menue here that you won't find elsewhere. Highly recommended!", "author": "Koen V."}], "servesCuisine": "American (New)", "priceRange": "$11-30", "name": "The Quarter Brooklyn", "address": {"addressLocality": "Fort Greene", "addressRegion": "NY", "streetAddress": "87 Lafayette Ave", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/Bk0h1qWuqnpmcxPiUbVZPA/ls.jpg", "@type": "Restaurant", "telephone": "+13479874012"}