{"aggregateRating": {"reviewCount": 152, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-17", "description": "The atmosphere here is really date appropriate.  The bar tender was nice enough not really warm or anything. My drink and my friends drink were just OK, nothing to write home about.  I made a reservation but because I wanted to sit in the garden we had to wait a bit, but the staff was very gracious about it.  Our waiter was awesome! Extremely personable and attentive.  We bot got the salmon and while it was an extremely fresh and quality piece of fish it was under-seasoned as well as the veggies that accompanied it.  I'll prob be back, but to try the chicken sandwich and the oysters that everyone raves about...", "author": "L N C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-22", "description": "Great for dinner before BAM. The lobster tacos and kale salad were excellent. The stuffed dates were good too. \n\nFriendly service and affordable menu.", "author": "Melissa D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-06", "description": "I'm a big fan of the city location so was excited to be in the area to try this one out! Awesome cocktails/selection of whiskies and delicious food!! Will def be back soon and highly recommend. Their Gorg Patio is a bonus.", "author": "Tyler W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-27", "description": "I was sad to see Stonehome close, but I do not regret that the Quarter has come to take its place. I've been here twice now and both times couldn't get past the dollar oysters and delicious toast appetizers to try any of the main courses! The second time I did manage to order the kale salad with roasted squash and ricotta salata, which was excellent! Mostly, my husband and I just come here for good wine and oysters.\n\nThe oysters are very fresh and tasty - they take a while to come to your table because they have one guy freshly shucking them per order, so you know they haven't been sitting out. They come with the standard cocktail and horseradish, but also with a ginger sauce that really goes well with the briny oysters. The toasts are also excellent, filling and a good deal. Next time I will have to try some of the tempting main dishes.\n\nI wish I could give this place 4.5 stars because the only real downside is the high price of the wine list. With the rest of the menu being so reasonable, it seemed steep, but I guess they have to make a profit somewhere. Anyway, I highly recommend this place, particularly if you love oysters and don't love paying an arm and a leg for them!", "author": "Olivia T."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-10-07", "description": "The good, everyone was pleased with the food. \nThe bad, service was D-. Server was combative, and only came to the table once and that was to take our order. After we waited 40 mins and tried to get our servers attention, we finally asked the manager who walked by, what the deal was... He apologized and our food was brought out by the manager. After our food came out, server still MIA but did drop off the check \n\nSafe to say, will not be back there again.", "author": "Christina P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-18", "description": "Stopped in for a drink and some oysters Good oyster deal and variety, very knowledgeable staff (at least the staff member that I was talking to so I'm going to infer that the rest of the staff is pretty on the ball when it comes to oyster knowledge) friendly staff (not bad to look at either) and nice ambiance.\n \nI checked out the menu and they had some cool looking small plates. I wasn't that hungry so I just tried one, The Uni toast, the menu says, \"Uni Toast- Melted leeks, lemon, sea salt.\" What it should say is, \"Uni Toast: leeks softened in heavenly MELTED BUTTER, lemon, sea salt.\" I think either there was a mistake in the menu or it was purposefully left off so the very fitness minded local crowd doesn't get scared off ha ha!\n\nBut menu copy aside, I think that Uni Toast had to have been one of the best things I've ever tasted. Granted due to its richness I can only probably have it once a month so I don't have a heart attack before the age of 40 but I will only have it when I need food to soothe my weary soul after a rough day/week. It's that good. The flavors blend so well creating this savory dish that is just sinful. Please sir... may I have some more?", "author": "Duey Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-27", "description": "Love this place! This fish is always fresh and the cocktails are delicious. They also have a great happy hour special. The atmosphere is cozy and welcoming and the garden is perfect when the weather is warm.", "author": "Lauren S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-21", "description": "A fun place to get drinks with friends and snacks. I met a friend who is a huge fan of this place and I became a fan myself. Uni toast is to die for!!! The house red wine is Malbec which was so great. Malbec happens to be my favorite so maybe I am really biased. This is a cozy hidden spot with a beautiful deck with classic ambience.", "author": "June K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-04", "description": "Great Birthday lunch !! Loved the food and service. Top of the line wine and food . Brooklyn is lucky to have the quarter", "author": "Ajax J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-25", "description": "There was once a lovely wine bar at this location so at first I was unhappy to learn that they had closed. \nBut to my pleasant surprise, The Quarter has a made its debut and turns out to be a welcome addition to the Fort Greene neighborhood. \n\nThe decor has a nice, lived in feel typical of many New York bar/restaurants, but not without charm. the menu is mostly American, sprinkled with Mexican and other influences and some nice twists, like the Chicken Tinga Tacos, which have an agreeable snap or the Crispy Pork Shank, for example. But the main reason to come by for me has been the fresh oysters. All based on the catch of the day. \n\nThe atmosphere is relatively casual, but also a has a comfortable vibe that would make or a great spot anytime, whether a business dinner or a date. The hipster factor is minimal, music is at an acceptable level and no annoying TV monitors lining the walls!", "author": "Keith B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-30", "description": "The font used throughout the joint is confusing, we counted 4 and maybe that's why they are called quarters.  \n\nService was friendly but a bit slow, which is understandable because it was memorial day.  \n\nThe decor looked pretty standard for a new Brooklyn aestetic, exposed brick and edison bulbs.  The backyard looked promising.  \n\nFood was very solid!  We started off with the grilled sausage lollipops, which had a nice smoky flavor.  We then got the fried chicken sandwich and burger which were both tasty.  Only minor annoyance was the oysters came out after the main dishes, but is probably attributed to the lean staff that day.  \n\nOverall, a comfortable and cozy neighborhood spot.", "author": "Jon L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-01", "description": "I met some friends here on New Year's Day for brunch. It's beautiful inside - love the details like the tiled roof and hooks under the bar for your purse, along with power outlets to recharge. Very thoughtfully done. There's a patio but it we sat inside. So to the food- The Bloody Mary was excellent, and I had the chilaquiles, the perfect excuse to have nachos for brunch. We lingered for a while after eating since it was such a cozy spot. Friendly and attentive service. My water glass never made it to half empty since the refills kept coming. Oh, and I can't forget the biscuits. Wow. Yum. Dangerous. I'm adding this to my list of favs.", "author": "Jess F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-29", "description": "I live in Harlem, so I'm not often in this neighborhood, but I went to the Quarter for the first time after running a half marathon in Prospect Park a couple weeks ago, and it was so good that I returned for brunch this weekend with a friend who just moved into a place in Clinton Hill. The first time I was there I had the Mexican chilaquiles, which really hit the spot after the race. They were fresh and flavorful and just the right level of spicy, and the corn chips soaked up the tomatillo sauce and as I ate and were nice and soft by the time I was finished. It was awesome. The second time I came I got the breakfast tacos, which were great and just the right amount of food. This time my friend and I also had a couple cocktails--the blood orange gimlet is . The service was super friendly and attentive both times.  I will definitely be making the (long) treck back there again!", "author": "Sophie B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-31", "description": "Really enjoyed our first visit to The Quarter after it came strongly recommended. The service was prompt and friendly, the food was delicious and the menu was unique. We ordered lots of things to share for dinner - the pork buns and mini tacos in particular were amazing! Love their covered backyard. Will be back in warmer weather for sure!", "author": "Liz A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-21", "description": "Came here for after work wine, oysters and some small bites -- love it!!!! Staff is incredibly friendly and attentive, the decor is cute (especially love dining in the backyard) and the small bites we had were delicious. My favorites were the warm oyster mushroom toast and the cheese \u0026 charcuterie plate with sopresata, aged manchego and tete de moine (the presentation of the tete de moine cheese was beautiful). \n\nDefinitely returning.", "author": "Jen B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-23", "description": "Now that Berlyn is gone, this is our go-to place near BAM.  Not too expensive, large pleasant room, some very good dishes (the fish tacos, burger, brussel sprouts and cauliflower, in particular) and lovely service.", "author": "C.K. W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-02", "description": "Simply lovely!  Celebrated a friend's birthday here in their beautiful back-garden.  The staff was super friendly, gave good advice on food/drink selections, and were very accommodating of a large party.  They even let us bring our own cake, which they cut for us - thanks!  Last, but not least was the yummy food.  I ordered the steak toast and a side of brussel sprouts - both were delicious!  Plus, I got a taste of someone's risotto - which was also fantastic.  All in all, there were lots of good options to choose from and I'd gladly come back to try more!", "author": "Jennifer S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-25", "description": "Really nice neighborhood spot. I love their outdoor seating area! It's very peaceful. I've only come for appetizers and drinks, but have loved everything I've had. All of the flat breads are great. You really can't go wrong with them. The baja tacos are phenomenal, but are gone within two bites. I'd eat 40 of them if my waste and wallet would allow. The servers are always incredibly friendly and attentive. I'm looking forward to trying the brunch in the future.", "author": "Allison P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-16", "description": "We went back to the Quarter last night - sat at the bar with my husband and had a wonderful dinner. Mushroom toast/crostini to start with cocktail made by Joao our bartender extraordinaire! Then the flank steak and crispy chicken sandwich - two more cocktails and our plates wiped clean the food was SO good! This place is a gem and always has the best atmosphere. A song come on and the women next to us sang quietly and I did a little dance on my way to the restroom. It's our neighborhood place and we are thrilled to call it our favorite dining option close to home.", "author": "Anthony R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-16", "description": "How in the world does this place only have 3.5 stars? Yelpers are the absolute worst. Here are some things:\n\nEach dish is more delicious than the last, with a mix of flavors and textures. From the general Taos sandwich to the fish tacos and the lamb tacos to the crispy Brussels sprouts to the calamari to the smoked trout toasts to the chicken sandwich to the risotto and on and on. \nGreat and super friendly staff. \nBeautiful outdoor seating with vines and bistro lights\nElegant indoor setting that's great for dates\n\nSeriously, Yelpers. What are you liking for? Sorry that it's not another beer garden.", "author": "Benjamin T."}], "servesCuisine": "American (New)", "priceRange": "$11-30", "name": "The Quarter Brooklyn", "address": {"addressLocality": "Fort Greene", "addressRegion": "NY", "streetAddress": "87 Lafayette Ave", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/Bk0h1qWuqnpmcxPiUbVZPA/ls.jpg", "@type": "Restaurant", "telephone": "+13479874012"}