{"aggregateRating": {"reviewCount": 152, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-17", "description": "Nice service and food, well it's kinda little bit humidity stay out of the back yard, but we are cool to stay inside the nice decor :) nice and good food", "author": "Mandy L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-12-26", "description": "New favorite place in BK based on ambiance and service. Prices were also decent. Cant wait to return. Loved the vibe so much and especially loved the back garden area. Magical! We had a lite dinner before seeing Michelle Obama and there were several large groups also headed to barclays after. It was nice to be able to make resevations on line. The lentil soup was ok, the fish tacos were amazing, the brussel sprouts were ok. The $1 happy hour blue point oysters were meh. Would return to try other dishes.", "author": "Jen S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-10-29", "description": "Went here recently for a Saturday brunch. The backyard was very nice! However, the service was pretty bad. The hostess took our order and never did anything with it because about 10 minutes later the server asked us for our order. Obviously no communication. \n\nWe ordered the Mexican Chilaquiles and Brussel Sprouts omelette. They were just ok.... nothing had salt or seasoning so everything was bland. Definitely sad I had to spend $12 per dish. \n\nMexican Chilaquiles- the menu mentioned everything was on a corn tortilla. However, in reality it was just tortilla chips. The bean on it was just black beans you would put on a summer salad medley. And it was just over sprinkled with onion. PHOTO INCLUDED. \n\nOverall: Will never go back.", "author": "Vicky S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-02", "description": "By far the best brunch I've ever had. It was suggested by an older friend. A little difficult to find, as it's one of those downstairs establishments, but never the less lovely and quaint once in. Not to mention, I'm a huge oyster fan and to know this is kinda something that's a frequent here, I was extremely happy. Oh and the bloody Mary's are quite delightful:) \n\nI posted the pictures I shared on my Instagram! Doesn't it look great!", "author": "Tasha W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-06", "description": "What a find! We stopped in for an early dinner after visiting Escher exhibit (also amazing) at Industry City.\n\nThe restaurant is very pleasant looking, and there is outdoor dining in a rear courtyard. We will try that when we return on a cooler day.\n\nWith so many delicious options (which is not easy for us as we eat no meat), the 3 of us decided to eat family style, and the wonderful staff were more than happy to accommodate us.\n\nWe loved the avocado toast, the mushroom and goat cheese toast, followed by a delicious homemade Cavatelli, a pan-seared salmon, and an order of caramelized brussels sprouts. And the desserts? OMG!\n\nGood selection of wine and beer and a very nice bar.\n\nDefinitely worth a visit!", "author": "Neil Z."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-03-30", "description": "In a word...meh. Why it exists, I am not sure. Will it last? I think not. Incredibly mediocre food and a kitsch Euro vibe, complete with annoying \"dance\" music.", "author": "Adam S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-08", "description": "Nice cool romantic place. Great food. Great portions. \nWent there pre movie friendly fast service too. \nSat in the back yard. But the bar looked cool too.", "author": "Nixon G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-12", "description": "Hard to review since I only had a salad...but it was delicious.  And the service and ambiance were excellent.  So I'd return for a second try.", "author": "Michael C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-16", "description": "This was ok. Needed to try based on the awesome reviews and I'm glad we did, but also curious to come back and try more things. We popped in around 8:30 on a Friday and it was bustling with a dinner crowd but we were able to snag a small table by the door. We were starving so we skipped apps and went straight for the meal which for me was the eagle sandwich (fried chicken, coleslaw with fries). I'm always iffy on fried chicken sandwiches (whether or not to order, because there's nothing worse than soggy fried chicken in a sandwich). This was kind of falling into that realm which was a little disappointing but the coleslaw was amazing and had a nice kick to it. The fries were REALLY good. Probably my favorite part of the meal. Would love to come back for dollar oysters and to try other menu items. And yes, as others were saying - very cute inside!", "author": "Ali C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-21", "description": "I came here yesterday and I was pleasantly pleased with my overall experience. The ambiance and decor were great, the vibe and customer service were amazing! My waiter was extremely knowledgeable with the menu and the staff itself was accommodating and welcoming as soon as I walked in the door . Now let's get down to the food! It was phenomenal! I had the chicken sandwich and it was awesome! I mean awesome! It was perfectly seasoned and the Cole slaw they had on top just gave it an added flavor that worked pretty well. My friend had the burger which was also delicious. It's safe to say that I will definitely be back here and to top it all off the menu was very affordable. I would highly recommend that if you're in the area to check this place out.", "author": "Nichole R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-20", "description": "YESSSSS DOLLAR OYSTERS!\n\nI've been waiting for dollar oysters to return to the neighborhood, so I received The Quarter with open arms.\n\nThe place is a tucked-away semi-basement spot on Lafayette. We came here after a night at the theatre (okay fine, after seeing a movie at BAM). We sat at the table near the bar, where you could see all the oysters being shucked.\n\nStarted out with oysters (Beausoleils and Fanny Bay's), the shishito peppers (great and with varying levels of spicy!) and the uni toast (not as good).\n\nFor my entree, I had the truffle risotto with a quail egg. While it wasn't the most aesthetically pleasing, it was very good. Rich and buttery, and of course, using truffles is basically cheating.\n\nI also tried their burger, which was actually really good.\n\nTheir cocktails are okay. Nothing great, but overall, a pretty good dining experience!\n\nHope to come back for their fried chicken sandwich, which I hear is awesome!", "author": "Kenny C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-09-02", "description": "Occupying the same space that once was my beloved Stonehome, this place is certainly gorgeous: beautiful, long bar, pressed tin ceiling, exposed brinks, and a super-cute backyard. Unfortunately the food we had was disappointing.\n\nThey have a nice cocktail selection, with about 15 cocktails between classics and signature ones, and the bartender will happily come up with a tasty mocktail if you ask. I wish their beer list was more substantial.\n\nOur evening started with oysters. We skipped the $1 Bluepoints, and got some Alpine Bay (PEI, nice salinity, clean taste) and Beau Soleil (small cub, briny taste, one of my favorite oysters). I wish they had some sort of oyster HH instead of just Bluepoints for $1, but the oysters we had were certainly excellent.\n\nMy main course was the whole grilled branzino. The fish was a bit dry, and it came with a side of a few leaves of mesclun salad in a small bowl, plus a grilled lemon. This dish made me sad.\n\nThe risotto with truffle butter was certainly more interesting, and the sunny side up duck egg gave it both flavor and originality.\n\nBottom line: great place to sit at the bar for a drink and some oysters, and then move on someplace else for dinner. Perfect for a Tinder date with a semi-classy sheen.", "author": "Matteo R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-29", "description": "This place is just amazing! The service is excepcional and the food is reaaaaaaally yummy. This is a hidden gem, the decor is beautiful and the bar has a great variety of wine and cocktails   I ordered from Grubhub last night, apparently there was a problem with the system so I received my food 2 hours later after several calls and miss communication between Grubhub and the restaurant, however, I can't say enough good things about the restaurant's service... the owner himself called me to apologize for the problem, he went above and beyond to get my food to my door as soon as possible and he even delivered it himself to avoid any extra wait on top of the already long time I had to wait because of technical problems from Grubhub. I love love love this place!! Try the general tso's chicken buns, absolutely delicious!!!!!!", "author": "Belen P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-14", "description": "Never would have found this place if it wasn't for Yelp, and so glad I did! I chose it because I wanted to go to Royal Palms after brunch which we all know is a pain in the ass to get to. My strategy was to pick a brunch restaurant near a lot of subway lines so everyone could subway there, and then share cars to royal palms.\n\nThey accommodated a really large group (est 20 people) with late notice and didn't complain when the last people to arrive (me) were extremely late. Important: make sure you write \"The Quarter\" and not just \"Quarter\" into Uber!\n\nThey treated us so well which is not always the case for large groups at brunch. All of the food was delicious. We ordered a few plates of biscuits to hold us over and each individual entree was enjoyed.\n\n\nDefinitely recommend!", "author": "Sara G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-21", "description": "We are fairly new to the neighborhood and were looking for a nice quiet place on a Friday night.... nearly impossible to find in NYC. The Quarters great reviews led us here and upon entering its dimly lit with a great ambience, it was summer time so there  was a wait to eat in the outdoor seating but plenty of space indoors. Great options for cocktails and wine, they are probably not know for their burger and chicken sandwich but we were wanting something a little simpler that night. The chicken sandwich I would suggest passing on and ordering something more in their wheelhouse but the burger was perfect cooked, juicy and delicious! Highly recommend! Service was great", "author": "Kimberly E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-03", "description": "We came for brunch around 1:30 on a Sunday. There is seating inside and outside, and it was not very crowded. The servers were attentive, refilling our glasses several times, and checking that we had everything we needed. The food was a decent portion (did not get hungry for several hours) and quite delicious. I'll be back for the fairly-priced brunch and delightful ambiance!", "author": "Adriana G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-05-20", "description": "Really wanted to love this place. It was just FINE. Food was pretty tasteless except for the charcuterie. But even the charcuterie wasn't without flaws...weird prosciutto. Service was atrocious. I know how hard nyc servers work, but I have to call it as I see it. Bad service all around. Lastly, made the reservation online...special requests/notes section, I indicated this was a birthday celebration. They made no mention of this to us whatsoever. Why have that section in your online reservations if its going to be ignored? \nIm quite surprised by the many good reviews. This is not the typical Brooklyn standard for dining out.", "author": "Jase M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-14", "description": "I've been to The Quarter Brooklyn four times now and I have enjoyed it each time. I've had the quinoa salad, fried chicken sandwich, burger, fried calamari, fries, and fish tacos. The calamari is among my favorites because the breading is thin and crispy and the pieces of squid are nice and plump, not shriveled and overcooked. The truffle oil on the burger is a nice touch without being over the top. The fried chicken sandwich is juicy which was a nice surprise because I've had plenty of dry chicken sandwiches.\n\nThe service has also been good each time and the cocktails are a hit. It has a cozy, comfortable vibe that makes you feel relaxed. I will definitely be back again, no doubt.", "author": "Star P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-25", "description": "This place is one of our favorite spot for Brunch ,especially sitting in the Garden in plenty of plants and greens. In fact, they should start serving at least a light brunch or breakfast during the week. Love the atmosohere,service was attentively done. The only  thing I can complain was  about delivering the food on the table a bit unorganized. Luckily, The Manager was super kind,  patiently to handled  the situation and made us leave the place happy. We'll be back soon!!", "author": "Francisco B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-03", "description": "Always great food, friendly staff... intimate atmosphere... all around neighborhood staple!\n\n*Tidbit* Was in the \"She's Gotta Have It\" series...", "author": "Erica S."}], "servesCuisine": "American (New)", "priceRange": "$11-30", "name": "The Quarter Brooklyn", "address": {"addressLocality": "Fort Greene", "addressRegion": "NY", "streetAddress": "87 Lafayette Ave", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/Bk0h1qWuqnpmcxPiUbVZPA/ls.jpg", "@type": "Restaurant", "telephone": "+13479874012"}