{"aggregateRating": {"reviewCount": 152, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-01-06", "description": "Really shocked at the good reviews here. The decor is very cheesy - feels like something in a mall or airport. Should have known from the sign outside and the \"brooklyn\" sign on the wall what we were getting into. \n\nWe ordered a cheese board and then a few apps. The cheese, steak toast, general tsos buns and shishito peppers came out all at the exact same time. Cheese was fine, steak toast was small pieces of fatty steak that wasn't edible (there's also a weird orange slimy thing between the steak and burrata that had no flavor-\ncouldn't figure out what it was), the buns were rock hard and cold (couldn't bite into them), and the peppers were so salty we couldn't eat more than a few. \n\nWe considered ordering something else but instead paid and went to another restaurant nearby. This place is trying too hard to be trendy, they should stick to the basics and stop with the mix of Asian, Mexican, Italian and American on one menu.", "author": "Stacie P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-26", "description": "We went here because of the posted reviews and we were not disappointed. The restaurant is cozy with an eclectic menu that has a lot of variety. We had the lamb tacos, calamari, and lentil soup as our apps and they were very tasty, essentially the tacos. \n\nFor our entrees we had the gnocchi, chicken, salmon, and seafood linguine- all were excellent. I recommend trying this place out.", "author": "John D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-22", "description": "My kids took us mom's out for Mother's day dinner on Saturday, May 13. We were a party of 8 we had a 645 pm reservation. Arrived in time for our reservation. We had to wait for our table close to 35-40 minutes, table was not ready.  Then when i said to the Host well we have a 645 pm reservation. He left and started putting a table together in the middle of the bar and walk in area where there were ton of noise. We have two elderly guest with us, so we said no, i hope that is not our table.  He said well you wanted a sit right away so i was getting this table ready for you.  We said no, we will wait for a better table in the main dining area.  \n\nWe get ready to place our order, first cocktails then appetizer, then dinner. We were told that we can not order appetizer because the kitchen can't handle it.  We all looked at each other and said OKKKKKKK...We placed our drink order and entree order, again we were told the Kitchen can't serve one of the meals with mash potatoes, instead of kale (my elderly mom can not eat kale).  The menu was so limited, I am not sure what the rush is for this restaurant, as i sat there all i see customer ordering is hamburgers and fries. The meal took close to 45 minutes to come out, we are all starving.\n \nTime to pay the bill, guess what they did, the added on 30% gratuities on our bill and did not say a word to us. There is no where on the menu it states 30% gratuities. We have wined and dined at 5 Stars restaurants in the city and the world and never had we have to pay a automatic 30% in gratuities.  This was absurd! Ridiculous? and very shocking for such a small restaurant with such a small menu choices and you can't order appetizers or make adjustments to your entree;  It's crazy that they would look to charge customers a 30% gratuity.  We had guests with us so we didn't want to make a big scene, paid the bill and left; X-ing off this restaurant.  The food sucks by the way. The only thing that was good was the cocktails was good.", "author": "Casey G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-29", "description": "This was a nice solid place for dinner. Extensive cocktail list, and decent food. I found the small plates better than the full-sized entrees -- the burger and fried chicken sandwich were just alright. The feta-stuffed dates and the smoked trout toast (even though it was really just warm bread) were excellent!\n\nAlso an excellent enclosed garden in the wintertime, though I was right near a corner where t became exceptionally drafty under the table. I bet this backyard is perfect when the roof comes off in the summer though.\n\nThe service was a bit slow, but overall very polite and helpful. Guys had no problem seating us despite our lack of a reservation or our friends who were running late.", "author": "Brad M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-25", "description": "Had a solo dinner here. Came for the oysters which I enjoyed. There is outdoor seating in the back which would be really nice in the summer. I forgot the name of my cocktail (blood orange something) which was good.\n\nThey had some oyster specials going on so I ordered a few. Also had the lamb tacos. I wasn't too crazy about them. I ordered some more oysters after I ate the lamb tacos.\n\nI had spied their bread pudding dessert prior to arrival and already had in mind I wanted dessert. It was somewhat disappointing. The bread pudding part wasn't that hot, it was kinda warm like they didn't \"microwave\" it long enough. So it was meh. \n\nFor the non oyster meal, I would give it 3 stars\n\nFor oysters, i will return for a tasty treat. I didn't look at the other menu items.", "author": "Kemi A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-01-20", "description": "Just had brunch here. The food was great. I had the lentil soup, biscuit, and fries. First, let me say I love biscuits and most places just give you one, Quartetly, gives you 2 biscuits, and big Ones too. Fries were delicious, soup was creamy and well seasoned.  You can have a conversation and hear your friends. Its a cool, cozy place, with attentive and good service.", "author": "Julie C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-08", "description": "Great service and food. Brussels sprouts are the best. Very good oysters at reasonable prices. Chill, friendly atmosphere. Great for cocktails with friends or a quiet date night.", "author": "shanna m."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-09", "description": "So, this place is a little expensive, but if you want to treat yourself it's great.  The decor is relaxed yet slightly upscale and the garden area in the back is so chill.\nThe cocktails are inventive and delicious and they have something to suit all palates.  Actually, that can be said about everything here!  I've been here twice and tried some of their cheeses and the bacon wrapped dates as appetizers-delicious!  Both times I got the mussels frites as a main entree-to me, it's great comfort food : )", "author": "Allana D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-30", "description": "We enjoyed our dinner at the Quarter, which is a really pleasant restaurant in Ft. Greene. I would love to give them more stars, but am kind of stuck at the 3 range for service-related issues. Started with cocktails at the bar while we waited for our friends. The bartender was very friendly and the cocktail selections were very interesting. We were then seated almost in the greenhouse area at the rear, which is a lovely space. I say almost because we were put in a corner under the bit of circling prior to the glassed-in area, which was kind of a bummer because the ceiling above us needed repair, plus I had made a reservation and there was an open table further in (didn't notice it until we were seated and into things). Our waiter couldn't have been nicer when he took our order and brought our wine, but then he disappeared. We had ordered starters, but they never appeared. We had theatre tickets and finally hailed another server. Our starters and mains then arrived together. Fried calamari was not a good side with our sandwiches. The food was great though. Then we needed to pay and again had trouble getting our bill. I'd like to come back here though to enjoy a leisurely meal. Maybe I can give another star.", "author": "Denise P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-01", "description": "Walked over it this place a Friday evening with a couple of friends. The place is nondescript, however once you enter the restaurant the ambience is amazing. The lighting is great as is the seating.\n\nThey have a good selection of cocktails and other beverages. We ordered a few appetizers and a salad and pasta as the main course. The spicy cauliflower was a table favorite and I'd highly recommend it. The calamari that was recommended by the server was not out of the ordinary. \n\nThe salad and pasta were quite good as well. We all enjoyed our dinner.\n\nThe only weird part of the night was the check as we asked for the check and gave them a credit card. We then waited for a good 15-20 mins after which the server came back and told us that they were having trouble with their internet and the credit machine wasn't working and requested we give them a few mins. We waited for another 10 mins after which he came back and and asked if we had cash. Unfortunately we didn't . He then asked us what we would like to do. I was a little confused and told him that he would have to tell us what he'd like us to do. He then said he would record our credit card information on a piece of paper and we could add the tip to it and when the machine was back on line he would charge us. I wasn't very comfortable doing it but agreed as we wanted to get out of there. He came back after a few mins with a mobile app that he could use to charge us and proceeded to do so again directing us on how to relate a tip. Anyway, we got through that and left. I covet for the last 30 mins while we dealt with payment our experience was quite pleasant as was the food.", "author": "Subodh M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-04-08", "description": "Nice service, mediocre space, bad food. They couldn't even do good french fries. I won't be coming back.", "author": "Mordecai B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-25", "description": "The worst meal I've had in New York City...anywhere. The food was absolutely bland. Ordered 4 or 5 small plates. Coursing was completely off as it all came out at once and some of it was cold. No flavor. Absolutely no flavor. Drinks were ok. But avoid this place. It's not worth the wait or your money. Did I mention this was the worst meal I've ever had?? WORST.", "author": "Bos A."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-09-02", "description": "Went here for brunch. The place was practically empty for good reason. The only thing this place has going for it is the atmosphere or it would only be worth 1 star. I'll pay whatever for a good meal but the food on the brunch menu, however, isn't worth half the prices charged.  Got the Brooklyn Eagle spicy chicken sandwich and it was chunks of mystery meat that was more fat than meat. If I'm paying that price for a basic chicken sandwich, I expect a fried chicken breast. It was served with what appeared to be yesterday's fries re-fried twice over. Horrible. My significant other got a breakfast sandwich. The egg was way over cooked and the bacon was undercooked. Would have been better quality at McDonald's. If the drink menu and ambience is all you care about, this is your place. You can get better food anywhere for much cheaper.", "author": "Michael B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-02", "description": "Found no Happy Hour drinks specials at all- went to meet a friend for an early evening drink and only found a 1$ special for oysters.  The space is cozy and warm.  The service was good at the bar and I really did enjoy the drink.  I definitely want to go back and try the food.  Is it too much to ask for some type of happy hour drink special? Even if it is 2$ off 14$ cocktails?", "author": "Jackie B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-09", "description": "Very nice space by the Barclays Center. Came here as a group of 4.  Service was EXCELLENT. Everyone in the building greeted you and food was great. We liked the $1 oysters and drinks were also very good. I would go back again for sure.", "author": "Carlos S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-10-20", "description": "I'm not one to review restaurants, I've worked in the industry for many years in every capacity. Reason for this review is because I wish I'd walked away from the beginning. I ordered the quinoa salad with a side of grilled chicken and while the salad was meh the chicken was absolutely horrendous. I don't understand how a thin peace of breast, dry, colorless that would serve best as a dog treat was placed in front of a paying customer. Just plain disrespect is the feeling I walked away with. Upon entering the place smells like spices so when the dish was placed I wondered where the spice went(very deceiving).", "author": "Evelyn E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-12", "description": "Went on a Saturday night before a talk at BAM.  They were slammed early on and it was clear that they were short-staffed.  The pros: nice atmosphere; the salmon and mussel entrees were both excellent; and the cocktails were well-made.  The cons: the service was sub par (ie: no bread, no specials recited, long time to pay); the restaurant had bad acoustics; and the calamari appetizer was tasteless and chewy.  Overall, I would return and perhaps get the oysters...they looked really good and of course a cocktail.", "author": "Jeff C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-09", "description": "Dátiles con beicon and the rose Cava were delish we also had pimientos del padrón and charcuterie board all great, my best friend lives In the neighborhood and we definitely decided that this is our new little spot! The ambiance is very warm and cozy and the service is on point the only thing that I would recommend for an perfect dinners experience is the table by the door should be moved it's a little uncomfortable but just my opinion. We will definitely be back soon for some more delicious food.", "author": "Emily G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-07", "description": "This is such a beautiful space. Inventive and organic. From the moment you walk in you are in awe. The food is excellent. The patio is surrounded by green and feels like a Mediterranean garden. Excellent service as well!", "author": "Vanessa V."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-12-25", "description": "We made a Christmas Day reservation weeks in advance, and they cancelled today (Christmas!) an hour before our reservation. They offered a weak apology and nothing else. Normally not a big problem, but on Christmas, on short notice, they should have compensated for their failure. Really unprofessional and very disappointing.", "author": "Tina M."}], "servesCuisine": "American (New)", "priceRange": "$11-30", "name": "The Quarter Brooklyn", "address": {"addressLocality": "Fort Greene", "addressRegion": "NY", "streetAddress": "87 Lafayette Ave", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/Bk0h1qWuqnpmcxPiUbVZPA/ls.jpg", "@type": "Restaurant", "telephone": "+13479874012"}