{"aggregateRating": {"reviewCount": 152, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-03", "description": "First off - it's cool as hell. And everyone at the other tables looked a lot cooler than me. Definitely styled well in here with cool light fixtures and a tin roof.\n\nAnd drinks...I only tried one thing and it was phenomenal - the Bourbon Brûlée.  MUST try! I'm not a bourbon drinker, but I easily took down two, and would have easily done a third, but knew i had to be up the next day!\n\nLast, but certainly best - DINNER!!!! Top faves - lamb Tacos (so freaking tender, the meat was perfectly cooked and seasoned.), and General Tsao's Pork Buns(the perfect kind of messy, delicious appetizer).  I didn't try anyone else's entree, but I'm still confident saying mine was the best - the PEI Mussels.  First, it's a HUGE portion of mussels, which is rare. And the sauce is not only perfect for the mussels, but also for dipping the fries it comes with. Heaven - pesto white wine sauce. Hea.Ven!\n\nGo. Go quickly. I'll be going back to do oysters as soon as possible!\nExtra Plus: Owner was exceptionally involved and accommodating throughout the night, not just to us, but all of the guests.  Truly appreciated in a local Brooklyn establishment.", "author": "Kimberly E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-25", "description": "The Quarter has a very warm vibe, even with the tin ceiling. We stumbled upon it by chance while looking for an open place for brunch on Christmas. I ate the Green Benedict, which was amazingly good. The 'English muffin' tasted home made and their pesto Hollandaise was divine. We sat at the bar and the staff was very friendly, knowledgeable and recommended the perfect dishes to us. This is a great spot for a date, and they have a cute garden they are planning on opening for the winter!\nI'm definitely coming back for dinner! A must try if you are in the Fort Green neighborhood of Brooklyn or coming to see a show at BAM, which is literally 2 blocks away.", "author": "Brigitte V."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-14", "description": "The garden space is amazing. The staff were very friendly. The food was just ok. \n\nBecause a friend and I shared a bunch of small plates I'm wondering if we missed out on the 'amazing' entrees. The brussel sprouts were disappointing as they were cut up and not crispy. Not how I like them. The mushroom flatbread was flavorless. The bacon wrapped dates were good but that should be a given because #bacon. We also ordered a salad to share and that was ok as well. The wine selection however, was great.\n\nNot overly impressed with the food but I will be back to explore the entrees and other side dishes. Definitely not writing this place off yet!", "author": "Leilani L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-03", "description": "Dollar oysters and they're meaty, I'm there! Great deal and everyday after 4pm. Love that I stumbled on this place if even just for the oysters. Sometimes I get skeptical about places offering raw oysters. Raw can be a bad thing if not served up by the right place. However, these were fresh, meaty and were served with horseradish. I usually have to request horseradish. The music was way too loud and resembled club music which didn't really go with the Sunday crowd that was in there. Know your audience. People were conveying that it was a little loud but nothing seemed to change in regards to  turning it down. I even had a couple of women squeeze in the table next to mine while trying to avoid the speakers placed by some of the empty tables. Anyway glad that a place is offering up this type of oyster deal. Didn't try anything else. I was content with my wine and oysters. The music probably had us leave sooner then we would have. Oh well, still giving it 4 stars because of their special.", "author": "Jamie C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-05-21", "description": "Warning: If you're looking for pre-BAM drinks and food, heed the one- and two-star reviews describing the questionable service.\n\nWe gave ourselves a little over an hour to eat and drink before we had to head over to BAM. Restaurant was not too busy, but it took some time to get our drink and food orders taken. Our appetizer showed up, followed by a long wait for our cocktails. Despite the wait, everything was good--we finished our appetizer and drinks, figuring our server would check in any minute to bring our main courses and ask if we wanted another round. \n\nWe patiently waited about 40 minutes for food that never showed up. During this time, the server never stopped by our table. I guess none of us wanted to be the complainer, so we just carried on with our conversation, our empty high ball glasses sitting on the table. I figured, worst case, we'd have to forgo another round and eat quickly--whatever.\n\nFinally, I flagged down the manager (?) to let him know we had to leave soon to make it to a show. He did the thing where he made eye contact but then looked away and tried to keep walking, so I had to almost corner him. The guy was too proud to muster up any sense of urgency or hustle--we weren't even registering on his radar. After waiting another 5 minutes, it became clear that our food was not coming. and we ended up having to leave without eating to make it to our show. When he brought us the bill, the server claimed that he had \"comped\" us the four main courses that we were never served--funny.\n\nThis place seems to be going for something like a scaled-down The Smith, kind of a well-done, if not completely authentic, artisanal experience for the crowds. However, this is just so far off from the real deal, and the service is so rotten, that I really don't know how they plan to stay in business. Maybe all the 4- and 5-star Yelp reviews will keep this \"cool as hell\" place that \"deserves more hype\" and serves \"glorious\" hamburgers open for a while longer?", "author": "Ike F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-19", "description": "Walk down the stairs into a brick clad, iron and Edison bulb decorated space that is at once inviting and trendy. Plenty of dark wooden tables here, as well as high tops near the window and a delightful garden to choose from. \nThere is a raw bar with a few different oysters at varying prices. Blue Points are $1 each - a bargain at just about any place within 100 miles of here. They have a happy hour on the raw bar and drinks which makes an already reasonably priced place even more attractive. \nWe ordered steaks and burgers - all absolutely perfect. They accommodated our requirements and changes easily. \nService is attentive without being cloying, and everything was on time and perfectly served. \nNote: Get the burger. 3 different cuts of meat make a juicy, fatty burger that is ensconced with a perfectly thin brioche bun, and is smothered in 2 cheeses and mushrooms. Glorious.", "author": "Jay H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-28", "description": "UPDATE: This is an update on my original review which I wrote a year ago. I gave it 5 stars then and wish I could give more. The staff here are amazing! So friendly and when you're a regular they really look after you and remember what you like etc. the truffle risotto is also the best risotto I've probably ever tasted. It is seriously to die for! They've expanded the menu recently and there is so much choice whatever your taste. Love this place!", "author": "Rachel K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-25", "description": "Was really pleasantly surprised by this place. Came here for brunch on a warm summer late morning and it was quiet. I think most diners were eating in the patio outside in the back.  We opted to sit at a high table by the window. The place is very charming on the inside. The servers were super friendly. I will go back for their biscuits alone. They were warm, buttery and melted in your mouth.  I had the oysters and eggs and it was delicious. Really enjoyed my Bloody Mary too. Now I'm craving those biscuits...", "author": "shana l."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-05", "description": "Tasty food, great service and cute ambiance!  We had the chicken sandwich, tacos and Brussel sprouts. Good cocktails combined with outdoor seating for the win.", "author": "Isela B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-30", "description": "When I'm home in Brooklyn, the Quarter is my Favorite place to dine! I love the Oysters, the Fish \u0026 Lamb Tacos, the Shishito peppers, the cheeses, THE KALE SALAD OMG! The Cavalatelli Pasta, Pan toasted chicken... OMG, the TRUFFLE RISOTTO! When I want to be responsible with the calories, the Pan seared Salmon... Let's not even talk about the Peppercorn NY Steak is to DIE FOR! Ok, the Caramelized Brussel Sprouts!! What else can I mention... Oh, the ROSÉ... Vie Vite Extraordinare LOVE!!  Ok, I love EVERY DAMN THING! Come \u0026 see for yourself, the experience is worth it!!! Staff is amazing!", "author": "Tiffany S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-30", "description": "This place deserves more hype. Came in for brunch and pleasantly surprised by the taste, value, and service of this place. The Brooklyn Eagle (fried chicken) sandwich is much better than other brunch spots. The scrambled eggs are good, too. Everything is served hot and fresh. I rarely go out for brunch but I will for sure return to the Quarter.", "author": "Simon T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-22", "description": "This place is a staple. Nice place to dine in with its ambiance or to take out with its quality food. Great place all around. Eaten here a number of times and the food has always been great.", "author": "Daniel S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-24", "description": "Since the day The Quarter opened 2 years ago, it has become a Fort Greene icon for excellence in cuisine \u0026 ambiance. Not just for BAM goers, it is a staple for locals who demand quality and value in a Brooklyn cool venue.", "author": "Anders C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-14", "description": "Pretty alright food. Served me a very well done burger even though I asked for medium. Kale Salad could've used a lot more kale especially for the whopping price. Overall, pretty good and nice atmosphere. Other yelp reviews were misleading.", "author": "Ally L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-10", "description": "Came here for dinner on a Sunday night and it was perfect. Great food, service and nice wine selection. Oysters are THE BEST!!! Definitely will be back!", "author": "Jasmine B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-09", "description": "My best friend just moved to Brooklyn a few blocks away from The Quarter and we were looking to grab something quick but a little nicer in her new spot. This is an incredibly charming neighborhood restaurant - down a couple stairs, into a fairly dark interior, and then out onto the patio. It was quiet and romantic and lit with string lights - would be an awesome spot for a date. \n\nOur drinks were good - her mojito was better than mine (the one with the mezcal in it). Food was also good - not the best I've ever eaten, but definitely would go back if I was in the neighborhood. We ordered the kale salad (my friend is veg) and she liked it and the fish tacos for me. The slaw on the tacos was really good. The tacos were small and not super filling, but tasty.\n\nOur waiter was friendly but I think the only one. We were not in a rush, so didn't mind the leisurely pace.", "author": "Zoe G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-20", "description": "This place is amazing. Great ambiance. Great employees. Great food. Really like this place. Highly recommend it.", "author": "D O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-14", "description": "We were glad to get a seat at the bar without a reservation for brunch. The chiliquiles were awesome!", "author": "Angela B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-08-30", "description": "The waitress asked us if we ate our oysters already before we got our order. There was mold on our charcuterie plate. Canceled the rest of order and left.", "author": "Jessica H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-21", "description": "Warm and cozy on a cold day.. This place is warm, quaint and friendly, with AMAZING food!! The oyster happy hour is the best! Be sure to try the ginger butter sauce.. Will definitely be back soon and frequently..", "author": "Opal G."}], "servesCuisine": "American (New)", "priceRange": "$11-30", "name": "The Quarter Brooklyn", "address": {"addressLocality": "Fort Greene", "addressRegion": "NY", "streetAddress": "87 Lafayette Ave", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/Bk0h1qWuqnpmcxPiUbVZPA/ls.jpg", "@type": "Restaurant", "telephone": "+13479874012"}