{"aggregateRating": {"reviewCount": 152, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-28", "description": "SUCH a cute place in the heart of Fort Greene. The staff was welcoming and accommodating, and food is excellent. We will be back!", "author": "Christal P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-01-23", "description": "This review would absolutely be one star if it weren't for our delightful and attentive server, but this place was just awful. We went for brunch and sat at a tall table by the window, there was a strange smell hovering around, maybe potpourri gone bad? At the table next to us a man was practically encouraging his child to scream (I come from a big family and generally have no problems with kids at restaurants, but there are limits), and our first pot of coffee was so burnt that we had to send it back. That's right, we sent back coffee. Then the food came. The biscuits were actually great, I have no regrets there, but everything else bombed. The chilaquiles were soupy and the egg on top smelled off, the salad was bland and overpriced, one person just got a bowl with banana and strawberries, and then another got a rather unremarkable plate of eggs. Boring food, badly done. I left my chilaquiles untouched, and ended up paying for a full brunch with only a cup of burned coffee and half a biscuit to show for it.", "author": "Ellen E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-29", "description": "The decor and ambience were great- for romantic date, or out with friends. Can't wait for outdoor patio to open. Great cocktails and the risotto and the Uni toast were to die for!! \n\nGreat staff and service, chef has a great menu - very creative ! Kale fries were unique never had anything like them.", "author": "Charlene R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-03-11", "description": "I was a huge fan of Stonehome, the former restaurant and wine bar that occupied this spot. WIth great food and an inspired selection of wine, Stonehome was a frequent neighborhood favorite of mine. Because of the stellar location, and the need for more sweet spots for cocktails in the neighborhood, I decided to give it a try with my friend. We sat down at the bar and ordered. The first drink I ordered off the menu (a mint julep, I believe) couldn't be made because they didn't have the proper glasses. I thought it was pretty weird to keep it on the menu if they couldn't offer said cocktail, but being a good sport I ordered a ginger mojito instead. The drink was seriously watered down and uninspired. To add insult to injury, the music selection was very dated and creepy. The ambiance reminded me of a cheesy airport bar I'd be forced to hang out at on a layover. There were fake tin ceilings and really strange lighting. One thing that was so distinctive about Stonehome was the chill energy of the place and the really wonderful and diverse selection of wines. The people that worked there were really friendly and personable and made you feel right at home. The Quarter is the complete opposite. I honestly couldn't wait to be out of there.", "author": "Lady P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-17", "description": "I have nothing but great things to say about this place! The setting including decorations, ceilings , and overall presentation is so welcoming. Everything off of the menu was made and presented perfectly. I got the Brooklyn eagle chicken sandwich and I got peppers for appetizers and they were beyond amazing. The  service was so good!! I've been there a couple of times and whether you sit at the bar or sit at a table the service is amazing. They also recently opened up a backyard and the ambiance is the best I've seen. The bartenders are extremely friendly. They're a 5 star restaurant for surprisingly cheap prices. I would 100% recommend this place to anyone looking for great quality that won't hurt your wallet!", "author": "Jadine P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-23", "description": "If I was able to give more stars then I would . I don't know where to start but the ambience was so nice , very cozy a great date night out or just drinks with some friends . The service was very good we didn't feel rushed and they wasn't being annoying by constantly coming over to ask if we need anything . The food was really good they aren't huge portions just nice little bite size pieces . We ordered calamari and Baja fish tacos it was very good. Will def be back again", "author": "Fbot B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-03-07", "description": "I loved Stonehome wine bar which closed at this location.  When we saw a new place we decided to give it a try. The experience went from bad to worse. We ordered a side dish, Brussels sprouts, as an appetizer. We made sure to be clear that we wanted it as an appetizer.  It came with our main meal not as an appetizer. There wasn't room on the table for it and when I said something to the waiter he just whispered something about the ticket being wrong- which was a very annoying response. Moving on to our mains. I ordered the steak. I had a long conversation with the waiter about medium and asked if I should order medium rare as I do not want it well done. He insisted that medium would be fine.  When my meal arrived I started at one end -a little too cooked but close to medium. 1/2 way through the steak it was completely well done. I brought this to the waiters attention. He said nothing. Just took my plate. He returned 5 mins later and said it will be a bit. At this point I told him I was done and didn't want anymore.  He said nothing and walked away.  After they cleared the table he showed up with some pineapple cake on the house, which I'm allergic to, and couldn't.  When I told him I was allergic, he offered anything on the dessert menu, which is what he should have done to begin with.  The waiter also kept pushing Barolo wine. We order a less expensive bottle $30. At the end of this disaster he asked if we wanted another glass of wine.  He again pushed for the Barolo and we agreed. My bad as I thought this was a gesture to make up for the horrible experience.  Instead we were charged $30 for two glasses of Barolo, the same price we paid for the whole  bottle of wine we had ordered with our meal.  Horrible service, expensive and the food wasn't anything special. Don't waste your money as there are many other great places in this neighborhood.", "author": "Maria S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-07", "description": "excellent oysters, great vibe and beautiful decor. prices right with excellent service. the drinks are tasty and made to perfection, I highly recommend stopping by and enjoying all this spot has to offer, it's intimate, cozy and totally awesome.", "author": "Timothy M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-12-19", "description": "Terrible!  Absolutely terrible.  Pros: good lighting.  Cons: awkward staff, warm wine, corporate menu, and worst of all, under cooked chicken!  Fried chicken that was raw one bite in.  So gross!  And dangerous!  I guess the neighborhood needs to wait for one more iteration of this space to get something even decent.  Disappointing to say the least.", "author": "Vanessa M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-19", "description": "fantastic food. Best dining experience I've had in the Fort Greene area in years.", "author": "Daniel D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-01-22", "description": "The staff are disgusting..Let me tell you a little bit about this place..I had never been to this restaurant before and I went in on a Friday evening with a girlfriend and sat at the bar.  The bartender was pleasant and the kale salad we had was pretty good..So the guy that appeared to be in charge (I had seen him giving staff directions) stood behind the bar and openly glared and me, I am a dark skinned Black female and my friend is Biracial and very Italian looking.  He glared in an intimidating manner and we felt that he was trying to make us feel uncomfortable. This continued through out the entire meal, we also noticed other staff walking by and giving me hostile looks.  Our meal was delicious and we ignored his rudeness and stayed extra long just to show them that we will not be intimidated.  The same guy that was glaring came and collected the check from me (not anyone else at the bar but just us) both my friend and I wanted to split the bill on two cards.  He came back and said one card did not go thru and then I instructed him to put the entire purchase on my card.  The next day my girlfriend called her bank to see why her charges were declined, only to learn that a transaction was never attempted. This place wants to cater to a certain crowd and it is not Black folk friendly, they wanted my experience to be bad so that I would not return.  I saw another post on yelp where someone said the place had hints of White supremacy and that's exactly what it felt like..i'm disgusted and as a Brooklynite I have never had this experience before.", "author": "Kay H."}], "servesCuisine": "American (New)", "priceRange": "$11-30", "name": "The Quarter Brooklyn", "address": {"addressLocality": "Fort Greene", "addressRegion": "NY", "streetAddress": "87 Lafayette Ave", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/Bk0h1qWuqnpmcxPiUbVZPA/ls.jpg", "@type": "Restaurant", "telephone": "+13479874012"}