{"aggregateRating": {"reviewCount": 152, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-30", "description": "I went for brunch last weekend. It was so hard to choose from the menu because there were so many tempting options.\nI was super happy with what I choose and the service was perfect\nDefinitely recomend this place!", "author": "Andrea B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-05-18", "description": "I tried a few items at The Quarter, each with a varying but never super positive degree of enjoyment:\n\nOysters: several options ranging from $1.50 (Blue Points) and up on a Saturday night, which is definitely not a bad bargain. Exactly like you would expect oysters to be served.\n\nBBQ Lamb Tacos: thought these were just ok. The flavor was good but they were super soggy and messy to eat. \n\nCalamari: ouch. They were so incredibly chewy and the breading way too salty. Some of the least satisfying calamari I have ever had. The smoked paprika yoghurt on the side added nothing to the experience, but then again it was already doomed. \n\nHad high hopes for The Quarter but the food didn't deliver. Nice staff and pleasant garden, but highly doubt I'll return.", "author": "Rich B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-05-18", "description": "You can lure me just about anywhere these days with a promise of a green, lush garden. Having survived the winter, drinking beers outside and eating quality food is all I daydream about. This restaurant has a patio in the back, and I was seeing Aziz Ansari down the street at BAM later that night so that is the story of how I ended up here.\n\nHere's how I would summarize my Quarter Brooklyn experience: adorable cozy environment, friendly staff, decent oysters, below mediocre food.\n\nWe started the meal with oysters, which were fine enough, and I did enjoy the ginger butter they came with. Calamari was overcooked and bland - just super tough and rubbery (check out my pictures to see how much we left untouched). Lamb tacos sounded exciting, but ended up being soggy, and turns out the combination of lamb and sweet bbq sauce is really not my cup of tea - I ate half of one of four tacos.\n\nThis was a pretty whatever experience, and I personally would not recommend this place. Thank u, next.", "author": "Nataliya M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-02", "description": "The hubby and I had a fantastic experience last night at The Quarter, we've walked by this place so many times. We always thought it was a basement bar, but do not let that deceive you - this is an excellent and quaint restaurant.\n\nThe food was outstanding, we had oysters with butter/ginger sauce... and they were out of this world. Oh the burger, I would try to describe it but I fear drooling on my keyboard. \n\nMostly it was the service that impressed us, they were super friendly and attentive. We felt at home and comfortable the entire time. Truly, if you're in Fort Greene you need to check this place out. *dools on keyboard*", "author": "Jesse M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-01-07", "description": "I've visited the Quarter Brooklyn two times for brunch. Most recently I visited on Sunday. I've had excellent experiences for a few reasons listed below:\n\n1) They accept OpenTable reservations which makes it really easy to reserve a table for brunch or dinner\n2) During the summer they have a great patio located in the back of the restaurant\n3) The food is great! I highly recommend the biscuits with jam and butter to start. They have delicious breakfast tacos and many egg dishes. Even their salads are good too.\n\nThe Quarter is casual and a nice spot to stop by for brunch. The entrees are reasonable, usually about $12-16 and they have a variety of coffee and alcoholic brunch beverages so you don't just have to choose between a mimosa and a bloody mary!", "author": "Lauren R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-05-13", "description": "This place was pretty medium. It has a cute interior with a nice covered patio out back. We ordered the mini lamb tacos, which were yummy. I got the salmon, which was disappointingly overcooked. My dining companion got the chicken, which he said was good; the vegetables that accompanied it were cooked in the richest, most delicious butter sauce. Nothing was bad, but nothing to write home about. I don't think we'd go back.", "author": "Victoria R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-03-02", "description": "We came for brunch on a Saturday, and pretty much everything we ordered was \"not the worst we've ever had\"..  \nOur latte + cappuccino came out looking exactly the same and even the waitress apologized that she can't tell which is which.\nThe pancakes were a bit dry, slightly salty (if you like that kind of thing), and not fluffy at all.\nThe french fries were obviously 2 different batches thrown together - half were cold and a totally different color. It's as if they decided to refry half the batch.\nThe benedict was meh as well.\nDefinitely not coming back.", "author": "Yu C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-27", "description": "Don't let the outside fool you. The decor inside is amazing. The transformation that hits you when you walk in is outstanding. \nCame for brunch on a Sunday afternoon. \nFood and drinks were great. \nThe Brussel Sprout omelette is what dreams are made of. Like. I can't stop thinking about it. \nSo much that I made a reservation for this coming Sunday. \nMust. Go. Back. \n\nService was a bit slow. I saw it mentioned in other reviews and always assume Service is hard to balance during the busy brunch time. However, when I was there- it was fairly empty and Over-staffed and Service was still slow. \nThe staffs vibe is great. Don't get me wrong. The issue is simply the speed. I don't mind slow when it comes to enjoying the meal and not rushing for the check. I love that. I mean slow like- drinks have been empty for 15 mins (my case) and main course completed without sides arriving even after inquiring multiple times (table near mine). \nHowever, it won't stop me from coming back. \nI really enjoyed this place and see multiple visits in my future.", "author": "Molly Z."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-06", "description": "I have been remiss in not writing this review sooner.  This is my go-to spot in Ft Greene and I have dinner there at least 2x a month.  Great food, great service, friendly staff.  The bartenders are the best and the owner is charming.  Love this place.  I'm a single woman and I usually eat alone at the bar.  Never once was I made to feel unwelcomed or unappreciated as a customer.  Its simply the best restaurant/Bar/before performance spot in Ft Greene.  Do check it out.", "author": "Yolande B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-24", "description": "Went to this lovely place for brunch with my family and had a wonderful time, the food was delicious and the staff was very nice. The pancakes were fluffy and the fruits fresh. The omelette was light and filling with great potatoes ( not greasy)  the chicken sandwich was spicy but amazing esp with the lemonade !!", "author": "Luana Q."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-01-01", "description": "good brunch place! We walked in early around 10am on a Sunday and were seated for 2 immediately. \n\nThe food was tasty- we ordered pancakes (good, solid, average) and a rice and beans based dish that was a surprisingly excellent and flavorful - more like a chili with rice, spice, cheese, and salsa. \n\nAlso got a piece of pie. Yum.", "author": "Asavari G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-20", "description": "Excellent foods and drinks. Friendly staff. Cozy bar seats with dimmed lighting. Music is not too loud, so you can actually have a conversation with a date or friends. This place is a gem in Fort Greene.", "author": "Kasumi N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-12-20", "description": "Came here last night before heading over to the Barclays center.\n\nWe had calamari as an app and burgers for the main dish. Burgers were fantastic and I'd definitely recommend, we also paired it with a red wine that was really good as well. \n\nOverall I would give -a 4.5 for food and 4 for service. The waitress was slow to warm up but after that she was great.\n\nWould recommend and would be back", "author": "Amber M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-03", "description": "A relaxing place with phenomenal atmosphere, friendly staff, great food. The place was slammed, and they still were very attentive to get us seats quickly. We will definitely back to try more food and desserts.", "author": "Fulger T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-09", "description": "Dollar oysters, mini botanic garden in patio and spectacular atmosphere for events,dates and meetings. In the heart of fort green. The only place you can enjoy with a very well balanced noise level,full bar and great staff. Can't wait to go back", "author": "Fatih Y."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-10", "description": "Very nice and romantic place in Fort Greene, Brooklyn. We had dinner in the backyard and it was very nice. The cheese table had very original and good cheeses. The pesto pasta was good too, but in my opinion a little tasteless. Very good service.", "author": "Julia S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-29", "description": "This place is so inviting and soft. Warm atmosphere and if your looking for a relaxed, comfortable setting this is the place you should try. \nService was prompt. Charlie our server did an excellent job. Food was great and tasty. I had the pan seared salmon with potatoes and Kale. I loved the texture of the salmon and it was seasoned just right. The avocado smash toast was our appetizer and I finished my  meal with a glass of wine \nPerfect date night...well spent and I will definitely visit again.", "author": "Demora F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-25", "description": "Best friggin' romantic/cozy/intimate/sexy/delicious spot in Ft. Greene hands down! I'm never disappointed when I walk down the set of stone steps and enter this majestic cove. Sunday's are by far the best days to check-in. It's not too packed and you get extra attention on behalf of the already uber attentive/friendly/good-looking staff. Oysters go for $2 a pop, the drink menu has a variety of sexy drinks. My guy refers to himself as a \"professional drinker\" and was blown away by TQ's Bitter South. Seriously, he was talking about it for days. This is a great date spot. It's dark and easily gets you in the mood for \"enter activity here\" lol! Enjoy!", "author": "Dae D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-02-11", "description": "We made a Sat Pm reservation on open table for 9 people and it was an awesome table with plenty of space, and we were seated on time. The server was really great and I felt that we had everything we needed through out the meal. Food was pretty good- our table mostly went for the crispy chicken sandwich. The cheese board wasn't the best- cheeses lacked flavor. I'd come back to try more!", "author": "Diana S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-28", "description": "I stopped in for brunch at 10:30 Sunday and initially was the only person there, but groups began drifting in quickly. I had the home fries, which were fine but needed salt, and the lentil soup. Although the menu just said \"lentil,\" it was a red lentil soup - pureed smooth and bursting with complex flavor. The toasted bread was a great accompaniment. I liked it so much I ordered another to go! Decor is cute, service was good - I will be back.", "author": "Karen W."}], "servesCuisine": "American (New)", "priceRange": "$11-30", "name": "The Quarter Brooklyn", "address": {"addressLocality": "Fort Greene", "addressRegion": "NY", "streetAddress": "87 Lafayette Ave", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/Bk0h1qWuqnpmcxPiUbVZPA/ls.jpg", "@type": "Restaurant", "telephone": "+13479874012"}