{"aggregateRating": {"reviewCount": 152, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-09", "description": "Nice atmosphere - low key, laid back, and great service.  Would make this a stop for a drink and an app if you are in the area", "author": "Sean T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-11-26", "description": "Went for brunch on a Sunday. The ambience is cozy and welcoming. It looks like a lot of fun. The food is just so-so, though. I ordered the tacos - a bit bland and underwhelming. I also got a Bloody Maria - a twist on a regular Bloody Mary. That was also a little disappointing :( it was a little watery and didn't have much of a kick to it. Service was friendly, but maybe not the best place for brunch", "author": "Sam S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-02", "description": "This is my FAVORITE neighborhood spot! Great oysters and brunch and fabulous drink/wine selection! I used to live in west village next to the quarter and when they opened up the Brooklyn location I was ecstatic!! The staff is so friendly - I always have great conversations when I go in to eat on my own! Perfect for big groups in the beautiful courtyard out back! Highly recommend and I'm not easy to please .", "author": "Brittany B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-18", "description": "The best place in the neighborhood, food is great especially the oysters, they are to die for.  I'm literally addicted. The lamb tacos, pork tacos are beyond delicious. If you order oysters and like spicy crunchy tuna ask the chef if he has that special going on. He garnishes the oysters with a topping of spicy crunchy Tuna, once you try that you will be hooked forever. I go there twice a week. And on top of that, the staff is amazing. Friendly,competent, hip, funny and kind.\nMy favorite place in Brooklyn without a doubt. \nP.S. music is great too", "author": "H G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-16", "description": "My husband and I just had brunch here for the first time and were so pleasantly surprised. It really exceeded our expectation on all levels. The ambiance is beautiful, particularly the garden area. They really elevated it significantly compared to the previous business that occupied this location for years. For drinks we got the fresh watermelon mojito and cucumber Moscow mule. Both were refreshing and delicious, and not overly sweet as mojitos and mules traditionally can be. For our entrees we shared the Eagle and the burger. The burger was incredible. The quality of the meat was amazing, and the truffle mayo and mushrooms really took it to a new level. The Eagle was very flavorful and juicy. Next time I will probably request the slaw on the side since it impacted the crispness of the chicken, but it was still delicious regardless. Looking forward to returning for dinner and checking out their raw bar soon.", "author": "Jane L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-08-10", "description": "I used to love The Quarter when they first opened.  The food was inventive and of great quality.  The service was warm and attentive.\n\nOn our last visit for dinner, the experience was not at all the same.  It appears that the restaurant, in an effort to cut costs, has been cutting corners.\n\nKale Salad - half the size it used to be, almost no cranberries or butternut squash and drowning in balsamic reduction.  This salad used to be good, multilayered textures and flavors.  Now its oddly imbalanced.\n\nFish Tacos - still delicious, but only a couple of small pieces of fish were discernible in each taco, which were then heaped with an inordinate amount of slaw.\n\nThe Toasts were especially off mark.  The Steak Toasts had three small (1/2-inch) bites of meat on each, which would have been ok if a couple of the pieces weren't pure gristle.  For that small amount of meat, the chef ought to make sure it's all edible.  The \"Lobster\" Rolls were absolutely inedible.  It was obvious from the smell, texture and taste that the chef substituted tuna.  We flagged down our server to ask him whether there was tuna in the lobster rolls and he was unsure-- a big no-no.  We then asked him to speak to the chef to find out.  He went downstairs to the kitchen, came back upstairs and then proceeded to avoid our table, walking to the front of the restaurant and chatting with other guests.  That was no-no #2.  When we finally flagged him down, he made a pained face and said (paraphrasing), \"yeah, the chef didn't really tell me too much.  That's the way they always make it.\"  No-no #3.  So we asked whether it was indeed tuna.  His response:  \"well I asked whether there's lobster in the lobster salad and he said yes.\"  So I alerted the server that I do not eat tuna and that our inquiry was not whether the lobster roll contained SOME/ANY lobster, but whether there was another fish (e.g., tuna) in it as well.  After another disappearance downstairs, the server returned and proclaimed that the only ingredients in the lobster salad were \"celery, salt, pepper, mayo and lobster tails.\"  How insulting, when what was in front of us was clearly not lobster and DEFINITELY not lobster tail meat.  In either case, lobster meat, no matter how finely it's shredded, does not have the smell or taste of tuna-- IF it's fresh.  And who wants to pay $14 for two mini rolls of not-fresh questionable lobster?  Or tuna?  We had to send them back.\n\nUpside:  Spicy chicken buns are still yummy.  Our busser was fast and friendly.\n\nWhomever owns this establishment needs to snatch it back to shape quickly.  Consistency is key.  Get a manager and waitstaff that actually care and a chef who executes properly.  Don't substitute sub par ingredients (and don't lie about it... ugh).  It seems from the reviews that most diners in the neighborhood actually like this place and want it to stick around.  If you continue to disappoint, well... BUH BYE!", "author": "May B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-10-21", "description": "I really wanted to like this place more, as I'm always looking for places near the BAM Harvey to eat, but I was disappointed.  The burger was okay, but the bun smelled weird/stale, however, the fries were fabulous, as were the Brussel sprouts, so maybe I just \"lucked\" out with the bun.  Also, the creme brulee was decent.\nThe biggest issue was the server.  He was very nice \u0026 personable, but extremely inattentive, until I told him I had to leave in 15 minutes.  The busser was fantastic, though and kept an eye on all his tables, constantly filling low water glasses \u0026 clearing the tables when the customers finished their meals.\nI might try them again to see if it was an off night, as the sides were so good.", "author": "Elena B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-23", "description": "Yum! Total neighborhood gem. Delicious food, wonderful and super fun and friendly staff, and really lovely setting. The back garden is incredibly charming, as was our server. For 4 for dinner, we had 2 apps, a dozen oysters, 4 entrees, and a bottle of wine and got out of there for about $50/person, so also extremely reasonable (especially considering the great quality of everything!). Highly recommend!", "author": "Alit E."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-02-07", "description": "I settled on Three Stars for one reason only....the music. Was here for Sunday brunch....in Brooklyn....at noon. The music was a 50's pop vibe. What? Completely disturbed my brunch-vibe. I suggest they try to channel the neighborhood a bit more. Try jazz or Motown or 80's hip-hop....or anything else. \n\nThat said, the food was great (pretty traditional but done well), my drinks were great and Trent the bartender was great!\n\nUpdated 8/27/17\nI actually had high hopes for this place. No longer. The music has gone wack-er if that's even a word (Currently playing Boogie Woogie Bugle Boy.) The service is bad (Why exactly can't I get a biscuit for my breakfast sandwich instead of an English muffin? Just charge me if it's that big a deal.) This place is completely empty despite a good location and patio. I suggest that the vibe is just way off for Brooklyn.", "author": "Kim S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-10", "description": "I stopped by here last night for a quick drink with my friend. Lovely decor. Exposed brick, dimmed lights make it very cozy and welcoming. My drink was excellent. ( I don't remember bartender's name, but I know he is from Portugal :)). Very nice, attentive and talented bartender..  Looking forward to come back and try their food!", "author": "Natis M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-10-25", "description": "Last night I met up with two dear friends to see Moonlight at BAM Cinema. We made a mistake and Moonlight hadn't yet started its run at BAM, so we saw Birth of a Nation instead. I had wanted and not wanted to see this film due to both it's Sundance hype and the rape allegations surrounding Nate Parker (the film's writer, director and star). Being backed into the film like this made sense somehow and we went with it but afterwards we needed to debrief and walked along Lafayette Avenue to find a place to eat.  We stopped in The Quarter, a new restaurant on the block. We told the hostess that we had three people for dinner and she immediately looked confused, glancing around at several empty two tops, but no empty table already set up for three people. \n \nNotes on the politics of seating a party of three: Any restaurant with table service knows that a party of three has to be outwardly treated like a part of four, occupying a table intended for four. A chair can't simply be pulled up to a two person table because that third person will have nowhere to put their plate and their chair will likely block a planned walkway. A restaurant plans for many of their two tops to push together into four-tops, anticipating the necessary adaptability of a floor plan during the course of an evening. \n\nWe were still standing at the entrance. There were seven empty two-top tables in plain view. Another group walked in, a party of four. A second hostess came over and asked if we'd like to sit at the bar. We immediately said no, but he said we should have a look and gestured for us to follow. Now we were standing in the back of the restaurant being shown three bar stools in a row. \n\nNotes on the politics of movie seats: I was running late to BAM and Birth of a Nation started a little earlier than we had planned so my friend met me at the entrance with my ticket while his wife, saved us three seats in the theater. I followed him into the dark theater, the opening scene had just gone up. He went into the row past her and left a seat between them, gesturing for me to take the middle seat. They are newlyweds. I thought it was a sweet and awkward gesture for them to seat me between them, in the middle of their love bubble. Twenty minutes in and we're watching a close-up scene of a shackled man getting his teeth hammered in and then being force fed with a metal funnel. I'm using both hands as protective blinders over my eyes when my friend leans over and asks me to switch seats with him so he can hold his wife's hand. It's another sweet and awkward gesture, moving my single white self to the adjacent seat, where I belong.\n\nWe all tell the hostess that we don't want to sit at the bar. We want to sit at a table and catch up and see one another's faces while we talk and eat. My friends are the only people of color who are also customers in the restaurant. The hostess says, we don't have any tables for three available. We immediately say, can you make one out of the many empty two tops in the restaurant. The hostess says, We can't do that. \n\nIn the front of the restaurant, the first hostess is pushing two tables together and seating the party of four at the newly made table. At this point it feels bad, the white party of four is seated and ordering drinks. The three of us are awkwardly standing in the back of the restaurant and no one is saying they will fix it, get us a table right away, comp us drinks while they pull it together, gesture at the visibly racial aspect of what's happening. Nothing happens. My friends both speak up, they say this doesn't look or feel right. We were here first and we should be given an available table before the next party. I am mostly quiet. The hostess and now bartender aren't apologizing or making an effort to keep us there, to make it right. I feel a pit in my stomach as we walk out of the restaurant. \n\nNotes on white supremacy: I know that it is the job of white people to speak up for racial justice and work to end our legacies of violence which are perpetuated through white supremacy. I keep telling myself this and trying to anticipate my actions in these kind of scenarios. Sometimes I fail and later try to reflect on how white supremacy was at work within me, driving my feeling that we didn't belong there even when I consciously know that we did nothing to deserve that unfortunate scene. I don't believe that anyone in that restaurant consciously didn't want to seat black people, but I do think that white supremacy is at work when staff immediately moves to accommodate white patrons ahead of people of color, going the extra step to make white folks comfortable while being unable to recognize that they're actively blocking black and brown customers from feeling welcomed or accommodated for. \n\nIf you are still going to eat at The Quarter, see Birth of a Nation first and if you're white, try to think about how much the slave master in the film looks and acts like a gentrifying hipster in Brooklyn.", "author": "Shane S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-16", "description": "New to the neighborhood. They have a sister restaurant by the same name in The Village. Excellent food. Great, friendly staff. Looking forward to returning for many meals to come. Try the Blood Orange Gimlet and the Lamb Tacos.", "author": "Carey H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-27", "description": "I had the peanut butter and jelly French toast, really good and totally unique. Solid cup of coffee as well.  Sat at the bar and enjoyed my time. Mellow vibe at 11 am on a Saturday.", "author": "Jason P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-22", "description": "Fun restaurant, loved the waiters and ambiance. Food was great. We really liked the spicy chicken sandwich and shishito peppers. Nice addition to fort green!", "author": "Dre F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-22", "description": "I really liked this place. Not sure why it's $$$$ - they have dollar oysters almost every day and a lot of reasonably priced delicious food options. Super cute spot with great small plates.", "author": "Annie F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-05", "description": "Went to The Quarter on a Thursday night and the ambiance was vibrant. Happy to see this new spot get some more traffic. It was vibrant, but not too busy. We were able to get a table to have a drink and dessert. Cocktail list has something for everyone, and the dessert is homemade. Will definitely go back for food next time.", "author": "Z. Michelle O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-17", "description": "Best place to go hands down, service is really good, managing is excellent! Went here with my girlfriend and everything was delicious, we just kept ordering, it's a nice and relaxing place, if you haven't tried it out yet, you guys need to head over there right now!!! Just became my favorite place. Oh and try the burger with smoked onions with cheddar cheese , best burger I've ever ate! Recently opened a backyard and it's beautiful, ceilings are beautiful, just everything about the place is perfect!", "author": "Cem S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-30", "description": "Went to this place for brunch, awesome food, service, and atmosphere. Beautiful outdoor space. The biscuits and burger were highlights. Also tried the chilaquiles and mcqurter. Both great, can't go wrong!", "author": "Alyssa P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-03", "description": "THIS IS MY NEW FAVORITE PLACE! I'm from LA and I may have to fly all the way back to NEW YORK for the incredible feta stuffed dates WRAPPED IN BACON! The Chinese Chicken burgers with that special bun dough was to die for. The Brulee's Bourbon was the best drink I've had in a while. The owner, Hakan, was so gracious and kind. And his wife was there and she was so beautiful and kind too. The lamb brisket tacos...OMG. BEST FOOD EVER.", "author": "Melody F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-02", "description": "Not extraordinary, but quite nice. I dropped in there having heard about the $1 oysters and needing a quick place to grab an inexpensive (for NY) bite and a drink. The staff was very attentive, getting me seated quickly at a lovely table despite my being alone and getting my food and drink to me promptly. They have a number of light snacks, appetizers, etc. for decent prices; I got the BBQ lamb mini tacos (4 to an order, $10), and they were tasty--the $1 oysters (Virginia, the day I was there) were slightly bland, but hey, they're a dollar! The space and ambience are both nice, and being able to combine the appetizers with cheap oysters made a pretty robust meal. Be warned that entrees (except for a burger) seemed to run on the more expensive side, around $20+ each. The outdoor seating area is very nice.", "author": "Nicholas O."}], "servesCuisine": "American (New)", "priceRange": "$11-30", "name": "The Quarter Brooklyn", "address": {"addressLocality": "Fort Greene", "addressRegion": "NY", "streetAddress": "87 Lafayette Ave", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/Bk0h1qWuqnpmcxPiUbVZPA/ls.jpg", "@type": "Restaurant", "telephone": "+13479874012"}