{"aggregateRating": {"reviewCount": 36, "@type": "AggregateRating", "ratingValue": 2.5}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2019-05-06", "description": "Ordered delivery. Came quick! I was pleasantly surprised by their roast pork sandwich. You don't really need any of the fillers as the meat speaks for it self. Their sandwiches are HUGE and the bread is a bit too greasy. I wasn't a big fan of their cheesesteak.", "author": "Scott G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-05-07", "description": "I walked in no one greeted me. 4 minutes later Mohammed took my order. I asked for a cheesesteak with the onions.  I wanted L \u0026 T so I was told that I wanted a hoogie.  I asked for onions and he nodded his head yes.  I felt as though I was being rushed.  I saw that they were short staffed and waited for my order.  A few people ordered before me; the wait not too long.  \nMy Oder was to go. 15 minutes later I'm home and I cannot smell any onions.  I bite into my sandwich and tasted none.  The meat was tough and cold. Tasteless; no salt, pepper, onions.  I was so disappointed by this bland steak.  It is the worst I've ever tasted.  I called the store and was told to come back for the onions.  I explained that I was not close by. The man said they were short staffed. I asked what did that have to do with my order not heard because of an arrogant worker? I quickly realized it was the same man that took my order.  I asked for his name and he stopped talking and hung up on me.  Mohamed needs customer service training.  He is not an asset to this business . I came in because I saw it on the news. I threw my dinner away. $24 for 2 tasteless sandwiches.  Do not waste your time.  I'm sorry I did.", "author": "Lisa H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-04-09", "description": "TERRIBLE!! I first tried Tony Luke's when the wife and I took a trip to philly. Since we dont est red meat we ofcourse went for the chicken cheesesteak. It was amazing. We even bought a few sandwiches to bring back with us. This is a perfect example of what happens when you try to franchise. Quality goes down. My wife and I were excited when we found out they opened up on flatbush. We both got chicken cheesesteaks and holy shit they were bad. Chicken tasted processed and rubbery, the sandwiches were half the size of what we though were getting. You could get a better cheesesteak from your local deli. Just do yourself a favor and take a trip to philly location if you want the real deal.", "author": "Lloyd P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-04-02", "description": "The other day they had a phone recording saying they would be open for business on a certain day. I go the day after that day, around 1-2pm. A bunch of people are in there and at the door I'm told \"we're not open yet we're training we'll be open next week\". \n\nI message their official Facebook saying I would like some compensation considering I live 35 miles away and drove there for nothing. I'm told to fuck off and they block me. \n\nI then try to get food at 930pm on a day they're open. They advertise they close at 10pm. I say don't you close at 10? They say yes we close at 10. So why are you closed? We have to clean so we really close earlier than 10. \n\nThese people are assholes. Don't even bother. Just go to the corner store and get a sandwich.", "author": "Jay O."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-04-20", "description": "I rarely ever leave reviews but I had to let people know how bad this place is. Like astronomically bad. I LOVE Tony Luke's in Philly and it's one of my favorite cheesesteak places so i was hyped when I saw they opened this place in my hometown of BK.  Trust the reviews and save your money and time. You will leave not only disappointed but disgusted. There was barely any meat that did not taste fresh at all on bread that was no where near fresh. I could have gotten a better cheesesteak from the random cheesesteak place in my neighborhood.  This place is not the same quality as the original. Not even close.", "author": "Joey P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-04-08", "description": "wanted to love it.  product quality and overall experience was NOT EVEN CLOSE to Tony Luke's in Philly - which i count among the best sandwiches i've ever had.  In Brooklyn, however, the bread was flavorless, and the tiny bit of grey unseasoned meat was lost, as were the onions and provolone that i ordered but literally couldn't find. i actually threw the sandwich away after a couple of bites. yuck.", "author": "A N."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-04-09", "description": "Tried the roast pork Italian. It just doesn't compare to DiNic's at all. I'm not sure if they are even roasting the pork fresh on site. Hope they step it up.", "author": "Jason G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-14", "description": "Delicious steak sandwich! A must try.  Order the cheesesteak with the wings. Very clean area, very nice workers and the manager is very sweet. There is seasoned fries are to die for", "author": "Sarah P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-05-04", "description": "Not the same as Philly, we've eaten at the OG.  Way to expensive.  We spent $60 on three people.  Just as good cheesesteaks are half the price down the street.", "author": "Allyson K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-05-06", "description": "First off the costumer service was very dry, lifeless and bad. What a waste of 16.36$, I purchased a philly sub no cheese toasted bread mustard lettuce tomatoes peppers onions and bacon. They got my order wrong by adding pickles with no mustard and the bread wasn't even toasted like i requested, i was standing there confused watching them put my food together all wrong like the instructions of what i specifically wanted wasn't on the receipt, the food was overall tasteless, sloppy and just a mess! I can't wait to sh*t this food out tonight. Never going back", "author": "Curtis H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-30", "description": "Hands down the best cheesesteak i have had outside of Philadelphia. Food was prepared fast. Food was fresh. Only downside is this place has no seats so be prepared to stand. Place is also extremely expensive as a sandwich and soda where 13.50", "author": "James M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-04-07", "description": "The one star is for the fries. They were decent, and I wasn't aware that the cheese wiz would be on the side and the fries thrown in a bag, but hey. If you've ever been to Ginos, Pats, or Jims in Philly just take the 2hr drive there and spare yourself. The chicken cheesesteak is a no go. They don't even have fresh onions on the grill. They scoop grey colored onions from a container on the side of the grill and slap it into the meat. The chicken is a thin slice of weird processed slime looking breast. They throw it on to the grill from the parchment paper and start cooking it(yuck). The sandwich is half the size of most places and barely any cheese. The staff is extremely loud and unprofessional. They talk over the grill and very loud within the restaurant. I do not recommend this place under any circumstances. Spare your money and your stomach, I warn you!!! I do not think this place will last a year. Your local bodega or pizza place can make a better cheesesteak. My local pizzeria has made chicken cheesesteaks with real chicken breasts. I say shut it down!", "author": "Angie H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-26", "description": "Best cheesesteak I've ever had!  Had it with onions and wiz.  Also had the pork sandwich and now I know what the fuss is about.  Everything about this place was perfect.  The staff was extremely pleasant and helpful.  I plan to come here forever.", "author": "D O."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-04-11", "description": "Im always excited when a new eatery comes in the area especially when it offers fresh cooked food but bad service trumps my review our their food. My first time and may be my last - lets explain. I see our crowded it gets so I called my order  ( ie. I work literally across the street.) but it made no difference. Its like fifty ppl in this little cramped spot( fire hazard) three ppl cooking the food - way to little, few ppl behind preparing- way to little. They need a better system when in store or phone ordering( have phone orders prepay, ask and give ready time before they arrived) designated place to pay. I ordered boneless wings( my coworker said they were alright but nothing to brag about).. the skinny sandwich was VERY good. The salt and vinegar fries is great idea but u really cant taste it as the sauce is no where to be found. I would have thought the lady with the blond hair would have checked my order but she was so fast I go back to work to find ONLY one order of fries. She then proceed to tell me that the bottle soda I order I have to trample through 30 ppl to get it myself. Crazy right- I KNOW. I did callback and girl explain to owner Mo - who advise I could comeback for the fries or get refund $3.99.  The young lady who took my phone order was the second best thing about this place. They need to revamp their policy and procedure...Left to be seen. I HOPE to follow up IF I RETURN.\n\nP.S.  I never went back for fries: DIDNT FEEL IT WAS WORTH IT.", "author": "Emerald R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-04-10", "description": "i was just at your BROOKLYN NY store.  i asked them for the bacon cheese fries , to go with my cheese steak, and it to be made with Provolone, and the employees answer, to me,  perplexed me.  because she said , that she didn't know how Provolone would MELT, as in , she had no clue how to do it.  my first reaction was shock, my next thought was, should i give her , my grandmas secret recipe , how to make ICE ? so i decided to just leave", "author": "David G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-04-09", "description": "I mean, cheese steaks aren't exactly a gourmet food but I was curious, especially having seen many previous iterations of restaurants come and go at this location. (RIP Papaya Dog.) I had the cheesesteak with provolone and onions. The sandwich was okay - not as dry as Shorty's, I'll give you that - but what I was most impressed by was the fact that Tony Luke himself appeared to be there training and spot checking the employees for quality control. While I was waiting for my food, I watched him go up to an employee and demand \"a single fry,\" which he promptly said was too salty. He then schooled the employee on proper salt spreading technique  and instructed him to make a fresh batch. I know this seems like a small thing, but  given the number of restaurants in downtown Brooklyn that have been wrecked by indifferent employees, I was impressed. I don't plan on making cheesesteaks a staple of my diet, but I'm sure I'll eventually stumble in one evening for a pork sandwich with the hope that it's up to the same standard even without the namesake (namesteak?) watching.", "author": "A L."}], "servesCuisine": "Cheesesteaks", "priceRange": null, "name": "Tony Luke’s", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "6 Flatbush Ave", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/r3gsmHb4VC-PQj3H0QJARw/ls.jpg", "@type": "Restaurant", "telephone": "+17188558669"}