{"aggregateRating": {"reviewCount": 36, "@type": "AggregateRating", "ratingValue": 2.5}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2019-05-15", "description": "A cheesesteak is a delicate sandwich. \n\nWait, that makes no sense. It's the least delicate of sandwiches. What I mean to say is that within this indelicate sandwich exists a delicate balance...of cheese and steak. And maybe onions and/or mushrooms. \n\nIt needs to be chopped and seasoned right, and the cheese melted in just so. Liquified cheese is what makes a cheesesteak oozy and delicious, which is why whiz is such a popular choice. \n\nPersonally, I prefer a mix of American and provolone, but it still has to be chopped up in there and melted. The cheese on both my steak and the Pork Italian I got was just slapped on at the end, and pretty much unmelted (see photos). \n\nDon't get me wrong, these were both still solid sandwiches, but not up to the top-notch cheesesteak quality that Tony Luke's is known for. \n\nBut the bread is good, the ingredients are right, and the place is still new. I feel confident they'll get it, and I'll finally have a real deal cheesesteak down the street so I can bring heart disease on sooner rather than later.", "author": "Peter D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-05-08", "description": "I wanted this place to be better so badly. Both for their sake, and selfishly, to promote a culture of cheesesteak competition in Brooklyn.\n\nThis place was supposed to be a no brainer - \"watch out Shorty's, the REAL place is in town now, so step up your game\". That, sadly, didn't happen. First of all, the staff here was super nice when I came in, I didn't have the heart to give them less than three stars, though honestly, it's more like a two star place. \n\nThe main problem? The bread sucks. I mean, these guys are supposed to know better - hell I KNOW they know better as I've been to their spot in South Philly many a time. But ugh, just an awful representation, they should be embarrassed by the bread. The steak was also small, and the guy on the griddle didn't really seem to know what he was doing (I saw them doing training, think they need a bit more).\n\n\nShorty's is still king in Brooklyn. Their steaks cost more, but the dough is from Philly and the steaks there are twice as big....and twice as good.", "author": "Chuck C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-05-01", "description": "I went to the original Tony Luke's location 2 weeks ago. With that being said, I know what a standard Tony Luke's cheesesteak tastes like. The cheesesteaks (if you call it that) served here don't even come remotely close quality-wise to the Philly location. \n\nThe bread was hard and the meat was flavorless. The staff took about 10-15 minutes to make 1 cheesesteak when the store wasn't even crowded at all. \n\nJust do Brooklyn a favor and close. Better yet, just make the 2 hour trek to Philly and you'll see what a legitimate Philly cheesesteak tastes like.", "author": "Henry T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-05-17", "description": "My visit to Tony Luke's satiated my cheese steak craving. Short of magically and instantaneously being transported to Philly, I was fulfilled. There was no queue when I showed up, I ordered as I would have at any \"real\" cheese steak establishment (whiz wit), paid and then watched the men work the grill behind the glass. Everything is made to order, so fresh, and while my husband felt the size of the sandwich small, I thought it was a bit bigger than the traditional length? It was greasy and delicious and I am happy.", "author": "Christin M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-04-05", "description": "I was really excited to try Tony Luke's, a good cheese steak spot is very hard to find and now still is. It's a basic to go place with no seating, but you can stand and eat your food. Eh...:. Not for me when I'm super hungry. \n\nI had a beef steak with American and onions. The bread was awful and almost tasted stale. The meat was your typical steak ums from your local supermarket. And the onions were just onions, nothing special. Plus it was not filling at all. \n\nThe staff was fast and friendly, that's about it.", "author": "Chre G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-04-16", "description": "I took the reviews with a grain of salt and tried out Tony Luke's of Brooklyn for 2 reasons.  They are in Brooklyn and they sell philly cheese steaks from a familiar haunt in my cousin's neighborhood.  As I sit here with a scratched up mouth like I ate apple jax or another rough textured cereal, I wished I couldve give more stars.  I really do.\nThe cashier was very professional, with a relaxed demeanor. Good sign. I kept it simple. Whiz it wit, a standard. If you can make this right, other sandos can become an option.  My sandwiches ready in about 3 minutes which was a pleasant surprise and a red flag at the same time. I went over to the counters (there are no seats) and took a bite. I was so sad that all I tasted was cold, stiff bread with a hint of overcooked, dry beef and a skim of wiz. Mind you, I am starving and I still couldn't chew the damn sandwich, lol. \nThe cashier was obviously annoyed with this issue and asked them to remake it properly. Two dudes came from the back making all sorts if nonsensical excuses, until they touched  it. Then the trainer guy comes out and does a little of the same but stands firm that they better fix it. It was begrudgingly remade, and of course I tried it out immediately.  I didnt have the heart to tell them it was slightly better due to the temperature. All else remained.  I have some advice for the biz.\n\n1. Check your grill. It may not be getting to the temperatures that is infamously associated with Philly Cheesesteaks.\n2. Stop pre-making meat, it is cold and super dry.  Even big chain stores make them to order unless the grill is old and well seasoned with 10 orders on deck. \n3. Add a bit more meat.  The bread shouldn't overpower the flavor of the sando. You have serious competition less than 3 blocks away.\n4. Buy a breadbox, like the corner store has to maintain the freshly baked quality.  You will save yourself money and preserve quality.\n5. Stop letting the two guys who defend poor quality talk to customers, it may infuriate the average Brooklynite. \n6. Step back, watch the masters do it at the original store and trust the process.\n\nFin.", "author": "Farrah B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-04-08", "description": "This is Tony Luke's first restaurant in NYC from its renowned Philly location. Having never visited the OG Tony Luke's (and having a fairly low cheesesteak IQ), I'm not sure how this location ranks comparatively. But, I did eat a pretty delicious sandwich, on fresh bread, and for a reasonable price. \n\nThe restaurant itself is on a busy corner and has a decent amount of eat in space. The menu is simple, and includes everything at their OG location sans the chicken cutlet hoagie. \n\nFor my first trip, I decided to keep it simple with the classic beef cheesesteak with American cheese and grilled onion. They used white American that actually looked like sliced cheese rather than a gooey orange slab - I really appreciated this! I was also pretty impressed with the quality/freshness of the bread.\n\nI wouldn't come here anticipating a life changing cheesesteak experience, but it seems to be a reliable choice for a craving. I'm definitely coming back to sample more of the menu!", "author": "Katey G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-04-17", "description": "Not as good as Philly, staff was more playing around and forgot my sandwich and it was rapidly put together my famous pork sandwich and forgot the cheese I paid for. Pork was dry and broccolini was bitter \n\nDefinitely would not come back", "author": "Knick O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-02", "description": "We went in Monday for dinner. Decent amount of people in there, which was nice to see. Since they make everything fresh but the bread, I imagine that there will always be a bit of a wait. \n\nOrdered the beefsteak wit whiz (the only way to eat cheese steak, in my opinion), a chicken with provolone (because we thought our 4yo would like it), and bacon cheese fries. \n\nAfter about a 7 minute wait, we received our food and went home. (Everyone working there was very friendly.) \n\nUpon opening our food, we discovered that were given a beefsteak with provolone as our second sandwich. That was very irritating at the time because a) I was hangry and b) I was excited for our daughter to try the chicken. \n\nBut everything was good. Our cheese steak was great and we added some mayo to hers and she liked it, too. The fries were the big stand out - really excellent. The bacon was really good, too. Ample amount of cheese included. \n\nI called and let them know that we received the wrong sandwich. The manager apologized and offered to make it right. \n\nI considered 4 stars because of the mistake, but it was their first day. Unless they make the same mistake again, I feel comfortable recommending Tony Luke's at 5 stars. \n\nAs a side note for comparison, Shorty's was previously our closest cheese steak option. The fries at Tony Luke's are better for sure. I think the sandwiches are comparable in quality and flavor, but $9.99 vs $13 is going to win out every time, even though their sandwich is smaller. It might be perfect for us because I can finish the Tony Luke's and not feel terrible about how much I ate while saving a few bucks.", "author": "Benjamin C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-05-28", "description": "Ordered the Philly with Provolone, it had no flavor, very bland, very disappointed. As a new facility I hope they tweak things.", "author": "Laurelton Q."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-05-05", "description": "The cheesesteaks are not bad though the meat is a bit on the dry side as is the case with all philly styled cheesesteaks. The bacon cheese fries are quite good. Everything is made to order which means theres quite a wait for everything to cook. \nThe locale is small \u0026 has no seating or counters for you to eat, so everything is to go. Will continue to come for cheesesteaks.", "author": "S D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-14", "description": "I'm 5-starring this because it is quite possibly the best cheesesteak I've ever had. The portions were right, the ingredients were tasty, and while the location has no seating (only counters and limited space), I can't really expect too much more from a corner cheesesteak joint. \n\nI ordered the traditional cheesesteak with American cheese and \"wit\" onions. You can go with the Whiz if you choose, but I liked the American because it's a little less salty than Whiz, and blends a bit better than provolone. Just my opinion.\n\nThe roll was phenomenal--a nice and tender chew that didn't force me to chomp away at my sandwich like a lion chomps on a gazelle in the jungle. The meat was incredibly flavorful and as I mentioned, the cheese and onions complimented it extremely well.\n\nWhat really clinched it for me, though, was that I didn't feel like I needed to reach for a defibrillator after I finished. These sandwiches are not healthy by any stretch, but sometimes a cheesesteak can be nothing more than a Nuclear GreaseBomb that practically falls apart in your hands before declaring war on your digestive tract. Everything on my Tony Luke's sandwich was tucked into the roll properly so it wasn't too messy, too greasy, or too heart attack-y. Will definitely return.", "author": "Ryan G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-04-30", "description": "i went a few weeks ago, and I'm a fan. The bread was fresh, and complimented the steak and cheese well. The only thing that I was a little bothered about was how long it took to receive my food. Many people have also complained about the wait time. Whilst there, this woman was trying to tell them how to make cheesesteaks, and the placement of ketchup on the sandwiches. lmao. The customer service from the girl on the register was A1... she was nice. I don't know if they're (and this isn't Tony Lukes fault) done with cementing the sidewalks in front of the store, but the drilling, pounding, and construction noise subtracted from the experience for me. I'll swingby again in the summer.", "author": "G O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-08", "description": "Thought I would chime in.. seen some bad reviews but this place is very good. I'm was hyped when a friend told me about this place opening.. originally from Philadelphia. It's super good and a great bite if you're going to a Barclays event (it's a few blocks down)", "author": "Augustin A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-01", "description": "This place is in a spot previously occupied by Papaya King.  There was a very long line to order (not a big surprise on their first day). \n\nI had the Chicken Cheesesteak with \"mild\" provolone cheese (\"sharp\" provolone is 99 cents extra) and mushrooms.  I also ordered the salt and vinegar fries.  The total came to $14.97 before tax: $9.99 for the cheesesteak + 99 cents for the mushrooms + $3.99 for the fries. (Their regular fries are $2.99.)\n\nI really enjoyed the food.  The prices seemed a bit high at first, until I tasted the food and decided it was worth it.  My cheesesteak was delicious.  Having grown up in a country where packets of vinegar for your fries are standard at fast-food places, I greatly appreciated the vinegar fries.\n\nThere is no seating here, just counters against a wall and window, so I did take-out.  \n\nI will be back, no doubt many times.", "author": "Jamie M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-05-04", "description": "Tony Luke's has some the best philly cheesesteak. I ever tasted. The bread was soft and toasted. The meat melts in your mouth. A great  tasting sandwich. They also have some really good boneless chicken wings .you can stay or take your order to go.tony Luke's nice spot in Brooklyn. I recommend it", "author": "Norman J."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-04-05", "description": "Not up to par with Tony Luke's in Philly, and not close.\n\nTried three different steaks.  The pork was the best, with just the right mix of pork, broccoli rabe and cheese.  There was a fair amount of meat on that sandwich as well.\n\nThe chicken cheesesteak seemed weird - the chicken was almost processed, not like chicken cutlet diced up on a grill, and not much cheese at all.\n\nThe big disappointment was the beef sandwich with onions and cheese.  I didn't see the onions, I'm assuming they were cut up with the beef.  The amount of meat was sad - like two ice cream scoops worth of mixed meat and cheese for a hero sandwich.  Every bite was mainly bread, with a little of that mixture, which itself lacked flavor and seasoning.\n\nBrooklyn has way better cheesesteaks to offer than this location.  I'm hoping this was just a learning curve in progress and that they'll go up from here, because otherwise they won't last.", "author": "John N."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-04-12", "description": "I knew this was a franchise before I stepped in the place...and I tried to balance my expectations between a franchise sandwich (low expectations) and the 10.99 price tag (high expectations.)  I got the Roast Pork Sandwich with broccoli rabe...it was tender and delicious.  The broccoli rabe allowed me to pretend I was eating something healthy as well (as opposed to their cheesesteak.)  My conclusion is that Tony Luke's is a good chain sandwich and a decent $10.99 sandwich.\n\nI would come here again, probably late at night, to sop up the alcohol in my belly...but otherwise, I don't see craving this sandwich in the future.", "author": "Joey C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-05-11", "description": "I came in at 11:50pm knowing that they close at midnight. As soon as I opened the door, they yell, \"We're closed.We close 10 minutes early.\" This is the most ridiculous thing I've ever heard. They leave the door open and refuse to serve you. I'm disgusted.", "author": "Aaron S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-04-05", "description": "I have been wanting  to try this new tony Luke's but I work across the street and my coworkers haven't been giving good reviews. I've eaten at pats and Gino's so I'll be comparing to the product they put out. I'll be back. \n\nTried tony Luke's   Have to get it with extra meat. Muck too little meat as a regular. Very flavorful enjoyed it will have it again. Only complaint too small a sandwich for the money.", "author": "Alexander D."}], "servesCuisine": "Cheesesteaks", "priceRange": null, "name": "Tony Luke’s", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "6 Flatbush Ave", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/r3gsmHb4VC-PQj3H0QJARw/ls.jpg", "@type": "Restaurant", "telephone": "+17188558669"}