{"aggregateRating": {"reviewCount": 43, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-12-31", "description": "This is my go to pizza when I'm around the Brooklyn Cultural District / Fort Greene area.  This area is going under massive renovation with new buildings popping up so it can get a bit busy.  I usually order their squared pizza with a drink which is reasonably priced and head down to Fort Greene Park and eat it there", "author": "Re L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-05-29", "description": "I've always operated on the idea that all pizza is good, even bad pizza. But this is bad. Ordered delivery because my normal place was already closed. \nJust meh all around. Bland and clearly poor ingredient choices.", "author": "Julia P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-20", "description": "I pass this place frequently being that I work in the area and go to the dentist in the area. I needed a quick bite to eat and a way to stay out the heat. I ordered my food and when it was done I asked the man behind the counter if there was a restroom I could use. He didn't hear me accurately and he handed me a bag. So I repeated the request. He stated there was no bathroom. While this conversation is going on another man behind the counter who seems to be the manager overheard this and just looked at me and said nothing. After 15 mins I'm done w my food and a guy walks in and the manager said \"yeah you can use it. Just walk in\" and the man was walking towards the back where the BATHROOM WAS LOCATED. As he's in the bathroom I say to the manager I thought you didn't have a bathroom. He didn't reply \"oh I'm sorry I didn't know you needed one\" or something to that affect he stated \"yeah we don't have a public restroom\". To me that means he's aware I asked for the restroom. I didn't comment on the fact that someone from the public just walked and went to the bathroom without saying much. But a paying customer isn't able to use it. Really. He proceeds to say \"yeah my worker told you that because we don't have a public one\". I just reply ok. \n\n2 mins later another guy walks in and uses the bathroom. Lol. \n\nAnother 2 mins later he keeps looking at me. Then he says \"if you want to use the bathroom let me know and I'll open the door\".  THE DOOR HAS BEEN OPENED. IT WAS NEVER LOCKED. I simple say I'm fine. \n\n\n\u0026 I leave. Before this happened I was about to purchase more food but I'm so happy I didn't. They will never get a dime out of me. \n\nThe first guy I spoke to \"the worker\" looks of Latino descent. \nThe manager who also works and handles pizza is White. \nThe guy who used the bathroom is White. \nThe last guy who used the bathroom is Indian.", "author": "Sade L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-11", "description": "INCONSISTENT, BUT STILL MY GO-TO PIZZA JOINT IN FT GREENE!\n\nI really struggled with writing this review of Pipitone Pizzeria. On some days, this is some of the best pizza in Brooklyn. Other days, it's mediocre and nothing to write home about. \n\nMy wife and I order from here regularly. It is our go-to spot whenever we want to order some pizza to be delivered to our apartment. 75% of the time, we absolutely love it and would recommend it to everyone. The remaining quarter of the time, it's not particularly great and not worth recommending. I wish I could figure out WHY it's so inconsistent, but have been unable to do so. BUT, it's absolutely worth the risk and in general I'd highly recommend this pizza.\n\nI also wish that they were open on Sundays, a prime time for pizza delivery orders.\n\nAnd lastly, to those complaining about burgers and other non-pizza related items...WHAT DO YOU EXPECT? This is a straightforward NY-style pizza place. Order pizza!!!\n\nBottom line: When they're on their game, this is some of the best pizza around!!", "author": "Gregory H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-03-17", "description": "Lapin and I went to here because we wanted to try \"better\" pizza than 2 Bros. We ordered three plain slices and the total came up to $9. The place to be honest was a little filthy and the seasoning jar was crusted with black mildew along with the tables being filthy.  The pizza itself lacked flavor and the crust was medium thickness but lack crunchy. The guy who served us had an attitude and he never cleans his hands after touching money...instead he goes right back to making that pizza..", "author": "Andie B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-21", "description": "This place makes some really good pizza. I'm especially fond of their squares.", "author": "Mike G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-04-28", "description": "Horrible delivery.  The burger I noticed was green on the outer bun.  I flipped it over MOLDY BREAD!  Amazed me they would try to sell it.  The health department needs to take away the A that is probably faked!", "author": "Ken J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-02", "description": "Solid NY pizzeria - simple cheese pizza is very good, with nice crispy crust. Limited selection of pizzas by the slice, but what they offer is usually quite good.", "author": "Bob P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-11-17", "description": "I am very unhappy with my order today. The display was beautiful and I was drawn to a slice with tomatoes covering the top. I wasted four dollars on tomatoes atop crunchy bread! I was expecting a sauce and cheese, and tomato pizza. That was extremely disappointing, but thank you for the kind service.", "author": "Erisha B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-17", "description": "A little bigger and nicer than the other pizzeria on this block. They have a decoration or two on the wall. Their plain slice is solid and they have enough sense to heat it up NOT to the point that it burns your mouth.", "author": "Dominik D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-12-21", "description": "This is a decent little spot for a quick slice. Their plain cheese is decent, sauce is savory and not too sweet, crunchy crust, and the right amount of cheese. The specialty pies are very good, the chicken Caesar salad pizza is particularly tasty, lettuce and all.", "author": "Sean L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-09-12", "description": "- for trying to swindle change, if i did not ask for a receipt the guy was going to charge me 21 for 2 heros and 2 snapples. I asked for receipt he grumbled and what you know the bill was 19.55,  he then toss the change on the counter.  so folks always ask for a receipt. would give 1 start, but let's say we will give the clerk the benefit of the doubt he overcharged... and was being a con....\n\n- for luke warm food, the eggplant and meatballs should have been piping hot they were not\n\ntaste was OK , not good and def not great.  not original or special in anyway.", "author": "Rachel P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-14", "description": "Love this place. I used to walk by every day from Dekalb Ave station on my commute home from work, so occasionally, I had it for dinner.\n\nReasonably priced, fine pizza. Great staff- A few times, when I stopped in right before closing, they'd ply me with free slices.\n\nAs said, it's a fine pizza joint, but what keeps me coming back are the chicken and tomato slices. They're just absolutely delicious, and you can't find anything else quite like it in the neighborhood.", "author": "Trey K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-03", "description": "Stayed at a nearby hotel, just wanted normal pizza not hipster pizza. Glad I found this place.. great pizza! Ordering online was super convenient.", "author": "Tim L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-11", "description": "Small hole in the wall type place.  The entire room only seats 10.  Great pizza and nice employees.", "author": "Tim B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-05", "description": "I've had a lot of pizza in Nyc but by far this has to be my favorite pizzeria in Brooklyn. I go to visit my friends in LIU college and we always go to get pizza from there it's like a ritual. Every time I go in there the workers are very friendly and they know me by name and they make me and my friends feel welcomed.", "author": "Brandon C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-30", "description": "I think this is the best NY slice in Fort Greene/Clinton Hill.  I like their pizza slices much more than Not Rays, Luv-N-Oven, Luigi's, etc.  It is a quality slice.  \n\nTheir prices are a bit high, but I can deal.  Of course a gas oven place like this can't compete with Graziella's or Franny's, but when you just want a slice, this is a good place to go.", "author": "Joey C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-10-09", "description": "1 1/2 hours for terrible food! Ugh. Two time I called to ask where it was. The guy was rude and could only say give it a little time. I did, and it didn't come. When it did arrive(an 1.5 hrs later), the delivery boy proceeded to give me attitude when I asked him what happened. \nFood was definitely not worth the wait.", "author": "Jeremy L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-09", "description": "I love thin crust pizza. This place has really tasty crust. Sauce and cheese also had great flavor. Stopped in just for a slice while visiting a friend in the hospital. I asked a hospital worker who mentioned Pipitones. The staff were great and friendly. Will go there again when in the area.", "author": "Karen W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-11", "description": "I have no complaints. I love the pizza and they are friendly guys. I've been going there for at least 5 years and still haven't had a bad experience. \n\nThe crust isn't too thick, which I love. The worst thing that ever happened was I opened the box after delivery and the cheese kind of slid a bit.. I'd just move the cheese back and eat it.", "author": "Aileen A."}], "servesCuisine": "Pizza", "priceRange": "Under $10", "name": "Pipitone Pizzeria", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "100 Dekalb Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/mkfzo8iY3TjZJADk9wb_Eg/ls.jpg", "@type": "Restaurant", "telephone": "+17188584376"}