{"aggregateRating": {"reviewCount": 43, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-02-02", "description": "My go-to pizza spot when im at Brooklyn Hospital.  Fast, friendly service for a pretty decent slice.  I really dont understand how this is 4 stars right now as its just a hole in the wall spot that basically is in existence to serve hospital patients and employees.  \n\nYou order your pizza at the counter, the guy throws it in the oven for 2 minutes, not too hot or youll burn your mouth, you pay, you sit down, you eat it.  This sounds all too familiar...", "author": "Nathan L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-03-23", "description": "Soggy, burnt bottom, lame dough. Maybe I havent had the better ones, but the napoletena seriously sucks.", "author": "Enrique V."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-09-27", "description": "i ordered a large pie from this place, the entire pie minus 1/2 slice went into the garbage, I was going to call to complain about the OLD pizza that was being passed off as fresh when I realized that any complaints would fall on deaf ears, On a moving forward basis I will not be a repeat customer", "author": "derrick u."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-10", "description": "The best Pizza in Brooklyn, I think the best Pizza ever.......Love this place...I will recommend to everyone....always fresh...and served with politeness....Real taste! the best from the best....Will go there everyday......the best pizza ever...", "author": "Monica L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-13", "description": "Good spaghetti and meatballs, but it's one of those places that you should probably just order from Seamless instead of going to because you'd rather not see it (if you catch my drift).  Nothing obviously gross/dirty, but definitely way below expectations compared to the food.", "author": "Jaime G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-01", "description": "I have to disclose to you that I am very biased about Pipitone's.  A few weeks ago I was coming home from work around 9:30 or so, starving of course.  I love the margherita pizza at Graziella's and haven't really strayed since I found the place, with the exception of an awful slice at one of the other places on Dekalb and reasonable late-night delivery from Not Ray's.  \n\nSo anyway, walking home from the subway, I paused to take in Pipitone's storefront, wondering if it was the same place where I'd gotten the aforementioned awful slice.  Just as I decided that it wasn't, a very nice gentleman greeted me and asked if I'd like to partake of Pipitone's 2-slices-and-a-soda special.\n\nThinking of my upcoming September wedding, I had just decided to defer this offer in favor of a single cheese slice when, to my horror and embarrassment, I found that I did not have my wallet with me that day.  Mumbling an apology, I tried to make a speedy exit, but my escape was foiled by the simple expedient of a slice on \"credit.\"  And I had to refuse their offer of a second slice and soda.\n\nI know a slice doesn't cost a lot, and it was near closing, but in this day and age, a little kindness goes a long way.  And of course it was smart business sense too, because that slice was the best I've had yet in the neighborhood.  I'll still go to Graziella's when I'm looking for a margherita pizza, but when I want a Brooklyn slice, oozing with cheese and with the perfect chewy, crispy crust, Pipitone's is my new favorite pie.", "author": "Christina H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-27", "description": "I stumbled upon this little place and ended up in a pizza coma. Good crust. The pepperoni was good. The eggplant was delicious. I love NY.", "author": "Michael R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-19", "description": "Kool spot, Albanian dude speaks Spanish while watching headless chicken on discovery channel... Try the upside down pizza great tasting, lil difficult to eat.", "author": "Abe C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-21", "description": "This is my go-to pizza delivery place in the area. I've tried other places, but keep coming back to Pipitone's. Good balance of crust / sauce / cheese. The sauce is tangy, the mushrooms are fresh, and delivery is fast.", "author": "Carina H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-11-18", "description": "Way too expensive at 2.70 a slice, a lame boring slice, a rather tasteless slice, an un characteristic slice, ANOTHER Mexican slice.", "author": "Joe S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-15", "description": "Ordered here for the first time and was very good. They were very quick and the pizza was some of the best I have had in Brooklyn. Their garlic knots were also very good. This will be my go to spot if the quality continues.", "author": "James J."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-03-28", "description": "Maybe I got a bad pizza considering the other reviews are so high, but I thought it was sub par.", "author": "Chris H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-07-07", "description": "BAM!!\nYou think you know good NYC pie? you wanna' slice o' heaven? Get you silly trash talkin self into Pipitone's and don't order anything 'cept what i tell'z'ya.  The \"Supreme\" dumb name i know for a fresh motz, basil and dabs of home-made sauce but you add a bit of garlic on this sucker hot outta' the oven and it's the only thing you have to know...\n\nLeave the rest of the food here for the tourists, it's not very good, this is the slice to get....nice\n\nAnd sorry i have to disagree with the other yelpers- i think Lov-n-Oven is terrible by comparison", "author": "Furyk C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-29", "description": "They were happy to sell me  dough to make my own pizza -- and explain the intricacies of using it!", "author": "Ben K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-04-15", "description": "I absolutely love their food. They're very friendly and, despite the crowds of kids from both Brooklyn Tech and LIU and the hospital workers and visitors, they always get your order done right. They also received an A as their sanitation grade. I recommend the garlic knots.", "author": "Alissa O."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-05-04", "description": "Was much better but has slipped over the years (new owners I suspect)  if you look most of the 4-5 star reviews are a few years old... still not a bad spot, decent selection. No reason not to eat there if you are there but no reason to walk a block or 2 out of the way.", "author": "Alan N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-27", "description": "Good pizza, very tasty. I have had a few different slices here but my fav is Brooklyn slice..nice owner also!", "author": "Matt P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-02-18", "description": "Seriously, this place has the most awesome garlic knots with pepperoni.  I have never had knots stuffed with pepperoni anywhere else.  Maybe they exist, but these are redolent with garlic, dusted with kosher salt and just so succulent.  The pizzas look great and I plan to have the \"supreme\" slice soon (fresh mozzarella cheese).  Until then, I will just day dream about those knots. . .", "author": "Undercova A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2008-11-29", "description": "Some pretty good pizza around the block from Long Island University's Brooklyn Campus. I love their pepperoni slices and chicken rolls. Great place to grab a cheap bite to eat before or after classes. Nice staff and never crowded.", "author": "Andy K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2006-07-08", "description": "This understated pizza spot is pretty good! Ironically, it isn't their pizza that is the winner -- it's their pasta dishes. On more than one occasion, I've gotten an awesome, overflowing container of baked ziti that was incredibly tasty. The best thing is that they deliver and it tastes as fresh and good as when it came out of the oven. The guys there are lots of fun, especially if a game is on. They have a little TV in the place that they look at. You can eat there, but there isn't much in the way of decor. Standard pizza accoutrement.", "author": "Christine J."}], "servesCuisine": "Pizza", "priceRange": "Under $10", "name": "Pipitone Pizzeria", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "100 Dekalb Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/mkfzo8iY3TjZJADk9wb_Eg/ls.jpg", "@type": "Restaurant", "telephone": "+17188584376"}