{"aggregateRating": {"reviewCount": 23, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-07", "description": "This is my favorite store and the  only place i trust for vitamins,supplements  etc. The staff is friendly knowledgable and attentive. Their inventory  is huge and the prices are unbeatable.  I am regular customer here.  The vibe is great and its a well run business", "author": "Leslie M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-17", "description": "Finally tried one if their juices, and while the variety isn't high, the choices are really strong. Combined with all the other items you can get here, this is my new spot.", "author": "Curtis J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-22", "description": "I got a shake from here today for lunch and it was healthy and tasty! $6 for a good size shake. I got the women's vitality shake and it tastes like a milkshake but healthier. I ate that more than two hours ago and I'm still full! Plus they make slightly more than the cup size so when you drink a little they'll put in the rest in your cup! Good find!!!", "author": "Diane L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-28", "description": "Five stars for the employees who opened the already closed store back up to let me and a few other people shop. \nThank you. \nBoo to whoever put the hours on Yelp, as they close at 5pm on Sunday, not 7pm. \nI like this store because it's larger than the other Downtown in Flatbush and I think the people are a little friendlier. No one is following you to see if you're stealing (like Flatbush).\nThe juices are on point and they have patties (sometimes) too.\nA great go too and thanks again to the employees who let us in!!", "author": "Alicia G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-22", "description": "I came with my friend and her daughter.  She came in for soap, and also price check some cough medicine/called chestal from france.  I was amazed by the selection and location (right next to the Jay St metrotech train).  I caved and bought some Dr. Bronner's peppermint soap. I talked to some of the store owners who seem attentive and pretty friendly.  In the back of this store is a man who juices freshly made smoothies and shakes.", "author": "Polly H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-01", "description": "I usually purchase from Downtown Natural Market weekly and always find the manager and staff knowledgeable and pleasant.  Today, I was in the store while a lady was advertising her line of natural products.  She was very engaging and at the time 3-customers, including myself, planned to purchase her products and she was giving a discount to customers.  The manager or owner, who may be new, I had never seen him before, approached the lady to speak with her on the side.  He was loud and rude to her and said she could not give a discount to customers.  Then he had the nerve to approach the customer who planned to purchase two sets of the products and told her that she could not any discount.  So, she only bought one set.  I planned to buy a set and the cashier had to check the price and raised it twice.  I decided to not purchase.  As a result of his poor management skills and not wanting to give a discount, he lost out money from three customers.  Decency and good customer service should have allowed him to give the three customers the discount. Good customer service should have allowed him to speak product developer in a professional and civil manner.  I suggest he this man improve his management skills.", "author": "Carolyn J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-14", "description": "Serious bang for your buck! $5 for a medium fruit smoothie is worth it in my opinion. I ordered the mango pineapple (?) and it was delicious! I just wish I caught what time they open. They don't really answer the phones or maybe I'm calling too early.", "author": "Holly G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-20", "description": "A nice store with a majority of the products I need. Plus their pricing is wonderful, with sales from time to time. Workers are nice, as well :)", "author": "Cynthia F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-28", "description": "Stopped by to grab a few scented oils for a massage party *don't judge me* lol.\n\nWalked in, started looking around, and before I could turn and ask for help, someone was waiting to assist me. A little creepy but VERY HELPFUL. The gentleman was well informed, patient with my ignorance, and even offered a few tips. \n\nPrices are very reasonable, location is convenient, and the service is prompt. I will definitely be back...once the oil runs out at least.", "author": "Quincy T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-05", "description": "Over the years of visiting this part of Brooklyn this has become my go to spot for anything health. From the fresh juice bar down to the back of the store, blackstrap molasses and all things in between. It's a great repository for all things health, homeopathic and organic. The front store staff is always helpful. Juice staff varies in disposition but I won't take away a star for that. Overall great health spot.", "author": "Hans D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-20", "description": "4.5 stars\nThis little health food store has some pretty good prices!\nYogi tea currently $2.99/box, and the big 28/32 oz bottle of Wholesome brand agave nectar is $10. \nGreen \u0026 Black's Fair Trade chocolate is $2.50/bar--compare with $3.79 at Garden of Eden. \nSpoke to a very nice employee who keeps the shelves stocked and negotiates deals and discounts for customers who's there on Tuesday and Thursday evenings. The store didn't have GF all-purpose baking flour and the employee told me to stop by on a day when he works and he would make sure the flour was in stock and available for a good price!", "author": "Adrienne Z."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-22", "description": "They have a very good smoothie and juice bar,  I really like the carrot smoothie and I added spinach to it, very tasty,  and I love that they let you drink the leftovers.  I also had their lunch which is also pretty good.  They usually have 2-3 types of \"meat\" which always taste good,  veggies, brown rice or quinoa", "author": "Mick E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-23", "description": "Definitely offers the healthiest and most diverse line up of fresh juice in the area. I was sick for most of winter and so I'd drop by to get me some of that \"ginger ale\" to clear my sinuses. Prices are reasonable and they let you drink the leftover juice :) Love the chill and friendly vibe here.", "author": "Linda S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-05-01", "description": "I looove this place! their prices are reasonable, the staff is friendly and knows me when I come in. they don't always have what I want but they will definitely order it if i need it, like my bio-k and such. \n\nI wish they had a produce section, but that would mean expanding the store. Either way I love it! Go to this market if you can!!!", "author": "akynos s."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-30", "description": "The staff is very knowledgable of what natural remedy will help heal that which ails you. Also, a plethora of teas from around the world, largest selection in downtown BKLYN.", "author": "Catherine M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-03", "description": "I live in the bronx But this is my rest stop when i bike through bk.. I usually come here for the smoothies in the back. They make awesome smoothies and i usually get the green shake (kale spinach banana and a few other ingredients).. They have a variety of patties (veggie, soy, beef, chicken) and also have  a vegetarian salad bar. The health food store itself is big and has all your needs. I dont shop here since I live uptown. However the prices here seem to be reasonable, especially for a mom and pop health food store. I saw coconut water on sale last time, better than TJs prices. Overall a good bargain in downtown brooklyn and definitely a spot to grab a smoothie and pattie for lunch and not feel so guilty.", "author": "bert r."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-10", "description": "It's the downtown Brooklyn version of Lifethyme. A little shabbier, a little slower-paced (you have the feeling that some of the items have been sitting on the shelves longer than it's been since your last trip to the dentist, and the selection can be spotty and even odd sometimes), but despite the differences, you know that when you walk in here you are going to end up overhearing portions of what is presumably a three-hour dialogue between a staff member well-versed in vitamins, and a customer with a slew of ailments. I don't know why, but I love this. I guess I just don't see many interactions that take longer than 20 minutes in this city--especially when it comes to what is essentially a business transaction--so it's a contrast that somehow registers as pleasant, although it's only a matter of background noise...", "author": "Lee J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-27", "description": "This market is old school in vibe (reminds me of health food stores in Europe where there is a tiny area with prepared foods, and a few aisles of vitamins, tonics, health \u0026 beauty aids, books, pamplets, etc.).  It's small, and looks like they haven't done any remodeling since it opened (I'm guessing in the 80s), but clean and the staff is overall nice and helpful.  It lacks a ton of variety in health foods if you compare it to, say, Whole Foods, of course, but let's keep supporting the mom \u0026 pops, please!\n\nall that aside...\n\nwhat really warrants FIVE stars is that crack cake, I mean, carrot cake.  The BEST carrot cake I have ever eaten and yes, it's vegan!!!  It's superb--moist enough that it sticks to your fingers and a scrumptious, not too sweet, white frosting.  This carrot cake blows away the varieties the higher end vegan bakeries offer in Manhattan for twice the price.", "author": "Joi B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-21", "description": "Great to pick up fresh smoothies and juices. they do have good veggie lunch options with SOY, never tried it. but great selection here as well.", "author": "Pluto G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-06-12", "description": "Downtown Natural Market is the S*IIIIIIIIIIIIIIIIIIIIIIIIIIIIIIIT!!!!!! \n\nCheapest prices on natural goods, anywhere (minus buying in bulk on amazon.com, but I don't have a family of 12 and picking up packages from the post-office makes me want to hurl on myself). \n\nBasically, I am resigned to buying my essential gluten-free products from health food stores. Let's do a quick comparison to Downtown Natural Market and Green Planet on Fulton (i.e. the closest health foods store to me). \n\nQuinoa brand pasta: \nDNM: 2.29 GP: 3.69 \nRoasted Tamari Almonds: \nDNM: 5.59 for a large canister GP: 9.99 for a large canister \nBob's Red Mill All-Purpose gluten-free flour mix: \nDNM: 3.69 (Ahhhh!) GP: 5.59 \nNori Crackers: \nDNM: 2.29 GP: 4.49 \nJo-sef's gluten free Oreos: \nDNM: 3.29 GP: 4.99 \n\nYeah. I feel like a victim of repressed sexual assault.", "author": "Anne H."}], "servesCuisine": "Salad", "priceRange": "$11-30", "name": "Downtown Natural Market", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "51 Willoughby St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/tSHGcAUWLfLAc_Cu-5mhVg/ls.jpg", "@type": "Restaurant", "telephone": "+17188341215"}