{"aggregateRating": {"reviewCount": 72, "@type": "AggregateRating", "ratingValue": 1.5}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-05-03", "description": "Terrible. We ordered two pizzas and the stated time was that they'd be delivered in 40 minutes. An hour and 30 minutes later the pizzas still didn't arrive. We called them 3 times and no apology, nothing. Ruined my night.", "author": "Rosanna L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-08-13", "description": "I had a HAIR on my pizza and wait an hour and half for a COLD pizza replacement! \n\nDO NOT EAT HERE!!\n\nAlso the driver yells at me as if its my fault. \n\n2 weeks before they send me the wrong pizza and have to wait again for a replacement.\n\nTerrible service and poor quality!", "author": "Sat N."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-04-27", "description": "DO NOT ORDER FROM THIS PLACE!!!!!!! If I could give zero stars I would!!!! I ordered 16 parmesan bites and cinnamon stix and it took 2 hours to get here. And when it did it was cold and the driver told me to come outside and get the food, I had to call him and insist he come to my door. I've ordered from here before and it wasn't so awful but I will NEVER go back to this place again!!!!!", "author": "Rebecca J."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-03-27", "description": "I will give it 3 because of:\nI went in at 1:50 receive my pizza by 2:10. Sped was not the factor, it actually came quick and hot to me so kudos to the girl who made my pizza. But I gave a 3 because I'm not sure who she was speaking to on the phone but she was shouting at them and questioning their order. \nDespite other conversations here I think going into the place is better than ordering online however I have had a great experience both ways.", "author": "Ryan D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-02-28", "description": "wish i could give 0 stars!!! \ni ordered literally 2hrs ago at 7:30, and have been trying to contact the restaurant to correct it! long story short im still on hold,  my order just arrived with no sauce, and cold! also i used a coupon for a 2 topping pizza i had one! this all could have been avoided if they would answer the phone!\n\n\nok someone just answered me. why does he sound frustrated though? now let me guess its going to be another to hours before they send the replacement, this location needs to undergo an all around re-training or rehiring because the customer service is horrible! and the delivery man zhen qi  is rude as hell! this location has never been this bad till recently smfh!", "author": "Chamil S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-06-03", "description": "Coworkers wanted Dominos so I ordered despite the fact I dont like pizza. If I had come here first I wouldve never ordered. We placed order at 12:25, tracked it online at   12:44 it was out of oven and being checked and there it stayed...for 2 hours!! I called twice and kept getting the \"we have one biker\" line. Biker?? Dominos cant afford cars?? It is now 2:51 and it is still not here. I can only imagine how disgusting this is going to taste. This is a disgrace. I will be contacting Dominos corporate. NEVER AGAIN. Ok so an hour after she told me he left still no pie. I call to find out he BROUGHT IT BACK!!Saying he was told it was wrong and to bring it back. He never showed up here! I kinda lost it with the girl on the phone and feel a bit bad about that as she did say she is issuing a refund. Unreal. Avoid this place at all costs.", "author": "Tory L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-10-29", "description": "More than an hour and my pizza still isn't here. No point of calling them either, it just goes on hold forever. Never again.", "author": "Akash J."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-12-13", "description": "Worst delivery experience ever. The pizza arrived almost two hours after I ordered it. Very rude staff (person who I spoke over the phone to and the delivery guy) The pizza was cold and overdone.", "author": "Tamara C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-02-02", "description": "I'm upset that I have to give them a star!  They're undeserving of even that!  I ordered a pizza via the app and then phones the store to tell them I didn't want the garlic on the crust (my family has never been a fan of that) and I was on hold for 3 minutes before they picked up the phone and hung it right back up!  I called back hoping it was a mistake, and sat on hold for 7 minutes.  I finally decided to walk into the store while still on hold, since I live on the block, to tell them I don't want the garlic crust.  I walk in and see 3 people standing around while the phones are going crazy.  A upbeat girl asked if she can help me and I immediately ask her why they don't answer the phone.  I show her my phone and that it's been 8 minutes and I can hear the phones ringing in the store.\n\nWhat makes matters worse she gave me an attitude as if I inconvenienced her by calling or better yet interrupting her conversation!\n\nI'm done with this Domino's!", "author": "Jillian K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-12-28", "description": "Yup, attempted once again because I received a $20 gift card in the mail from Domino's after my original complaint. I stayed home sick from work yesterday and thought, fine, pizza sounds good. \n\nI ordered one pie for delivery at 3:20pm; after lunch and before dinner time.\n\nI was quoted 30-45 minutes. After an hour passed I called and was told \"sorry, we only have 1 driver, it should be there soon\"\n\nDid I mention I live approximately less than a 2 minute walk from the location. No exaggeration.  \n\nPizza arrived at 5:26pm.\n\nAnd not like I was expecting it to be hot at that point but I was slightly hopeful, and was wrong of course. It was ice cold. \n\nOver 2 hours for a freaking cold pizza delivery from a location that is literally less than 2 minutes away. \n\nUmm yeah... just go out of business already. This is pathetic. It's like you are actually TRYING to give the worst service possible, like there's an award for it or something. Well if there is, congrats you guys win! \n\nAnd even though I paid using a gift card I still feel like I got ripped off, that's how bad this place is. Just save yourself from wasting your time.", "author": "Ruby D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-03-04", "description": "Really Bad-Driver Rude refused to bring upstairs-with a $2.00 delivery charge and a $2.00 tip-I expect delivery at my door.\nI called corporate they refunded and are sending a coupon.\nThis is the second time I complained to corporate-I am done this place should go out of business-worst delivery in a NYC!", "author": "Chris K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-17", "description": "First off for what Domino's is which is cheap pizza I'll consider this into my review. Yeah there is better pizza out there specially in NYC but it is expensive to buy even a plain large pie in Brooklyn. I buy pizza a lot so spending $7.99 + tax and etc on a take out deal is a good deal but you do get what you paid for which is typical corporate pizza. Pizza itself is decent but quality wise doesn't hold a candle to the pizza places in the neighborhood like Pronto Pizza which is only a few blocks away but costs more. I have been ordering pizzas as a carry out since they have a coupon for a large pie for $7.99 Monday through Thursday and since I'm on my way home from school on the train I just order it while I am on my way home and pick it up. I have also ordered delivery from there for as long as I remember and found it pretty good delivery service. I never had an issue with them taking to long to deliver the pizza myself.", "author": "Benjamin D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-01-29", "description": "I eat more healthy these days and only order from these guys once in a blue moon, but once upon a time when I first moved into the neighborhood after college, I'd order from them with some frequency (they're open pretty late).  Anyway I'll probably order something for the super bowl, and am preparing in advance for what always promises to be a nightmare.  I have never ordered from this particular Dominos that something hasn't gone wrong (Usually time Wise.)  It's taken them over 3hrs to get me my food, and they're about 5 blocks away.  On that occasion I refused to tip, and the charming young gentleman handling my food told me to go F--- myself.  On top of that Dominos is meant to be cheap isn't it? At least I remember (a thousand years ago) it used to be thirty minutes or free. But somehow the cost of ordering from them always comes to more than much better food quality/service places in the area.  How this particular branch has stayed in business flies in the face of the most basic  economic/customer service principles...it's a real head-scratcher.  The five dollar delivery charge which is not a tip mind you, is also a pain.  So really the question is do you feel like Dominos?  If so you don't really have another choice, but  you will be waiting for your food...I think a lot of people feel less and less like Dominos these days.", "author": "Flem B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-09-24", "description": "We usually order Domino's a lot... But this place is Horrendous!!!! After waiting for 1 hour for the pizza (I was really hungry!) I call the guy to ask where it is.. He's like the driver called this number 3 times. He mentioned the number he saw on his caller id. I said that's not possible since the number I wrote on the order is not this number. \nWe he realized I caught him lying, he put me on hold for 5 minutes then hung up the phone on me. I tried calling him again several times but he wouldn't answer because he saw my number on his caller id.\nHe finally answered after I used another number to call him. and gave me another lame excuse. The driver only had to buzz the door.. he didn't need to call any number!!!!\nThe customer service guy was extremely rude, lying, and unprofessional. I am getting in touch with Domino's HQ as they should either fire this guy or close this branch down.\nNEVER USE THIS PLACE TO ORDER YOUR PIZZA EVEN IF YOUR LIFE DEPENDS ON IT!", "author": "S M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-05-18", "description": "It took 2 hours for the order to come. If you send out delivery flyers to a certain location, you should make sure that you can deliver to that place in manageable time. This place  is ridiculous. Never ordering again.", "author": "Liang Z."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-01-26", "description": "This location takes everything that's fun, joyous, and convenient about the online Domino's ordering experience and turns into that unhappy place you go to in the middle of a dentist appt...\n\nAfter a full 8 hrs of LSAT studying on Sunday night, I received a lukewarm/cold pizza about an hour after I was told it would arrive. The temperature of the pizza indicates that this was definitely on the driver. But wait! There's more. The driver then tells me he didn't bring my credit card slip to sign, is that okay, and where's my tip? My response was \"well I can't give you tip without the slip! Not to mention this took forever to arrive, and there was a delivery charge added on when I ordered.\" I then called the store back (my 3rd time calling I believe) and told them to leave a reduced tip from what I normally leave for delivery *and* that I'd be watching my accounts to make sure that they don't attempt to upgrade the tip since the driver \"forgot\" the credit card slip for me to sign...\n\nAt least it was the right size/type pizza, and they believed me on the account-monitoring because they didn't try anything. Could've been worse.", "author": "Shea D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-09-14", "description": "Never had an issue with this spot. When it comes to late night food, it is what it is. As long as you get my order right and get it to me within the proper time frame, I'm good. At the end of the day its still late night pizza so don't expect more than an A-OK rating.", "author": "Mark G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-02-17", "description": "This is a review of the location, not the pizza.  This is the least consistent, most erratic service I've ever experienced from a pizza place.  The last time I ordered from them, I never even got my pizza, and I was five blocks away. (I couldn't leave my place to pick it up because of illness.)  After 1 1/2 of waiting, I called and was told there were only two delivery people working that night, but that my pizza was on the way.  It never came.  When I called back, they simply stopped answering the phone.\n\nPreviously times were pretty bad too, but sometimes I just wanted a Domino's Pizza and was able to look past it.  I have now been cured of that particular desire.\n\nThere are a few really great reasons to not order Domino's in New York City.  If you live in the area of this store, I would urge you to look into other pizza places.\n\nEDIT: July 2015 Service has greatly improved per some friends of mine, so I did order again from them. Much better service so I will bump up the star rating, which hopes that they will not slide back into the poor service from before.", "author": "G Y."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-12-21", "description": "Fast service. Convenient location. Friendly staff. Opens late. Not bad at all!", "author": "Siv L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-11-23", "description": "I am from Long Island and was working in the area hungry for some sandwiches.   So i ordered from this Dominos and asked them to deliver.  The pizza was delivered 45-60 later by a guy on a bicyle and the sandwiches were cold", "author": "Conrad S."}], "servesCuisine": "Pizza", "priceRange": "Under $10", "name": "Domino’s Pizza", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "146 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/v6gG3thNpXj36KHhO61wNg/ls.jpg", "@type": "Restaurant", "telephone": "+17185967000"}