{"aggregateRating": {"reviewCount": 72, "@type": "AggregateRating", "ratingValue": 1.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-31", "description": "I don't wanna be \"that guy\" but...\n\nI've never really had a bad experience with this location. I live in the area so instead of having them deliver, I always walk a few blocks to get my order. I usually do this:\n\n1. Go to dominos.com and order from offline. \n2. Watch the tracker and when it's done, go downstairs and get my order. \n\nThis method has been convenient because it allows me to see when my order is ready.\n\nCustomer service is decent and usually ready in 15/20 mins from the point of ordering which is cool. \n\nI dunno maybe I'm jinxing myself but I've never had a bad experience with this place.", "author": "Emmy K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-04-13", "description": "I know Dominos is convenient trash pizza, but a $5 delivery charge that isn't even considered too is wild. I'll never be ordering delivery from them again.", "author": "Christopher B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-03-26", "description": "Totally agree with all the other negative reviews. This dominos store is awful. They never give a fair amount of cheese on pizza or stuffed cheese bread.", "author": "Kevin X."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-04-26", "description": "We've ordered from this store a few times and it was fine but this experience tops all the bad ones.  The delivery driver refused to come up to delivery the order to my door and wanted me to come to his car to pick it up.  Not only was he rude and demanded I come to his car he said he wouldn't deliver it to me but insisted that it was car side pick up only.  I can't tell you how unsafe that is for a female to have to go to a strange mans car to get a pizza that you pay a delivery fee for.  I did call the store and the manager was nice and said he wouldn't have that driver deliver our order any more but I will not be ordering from there again.", "author": "Ashley C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-11-13", "description": "I'm pretty confident you've got to be fairly intoxicated or mentally challenged in some way to be ordering from Dominos while in NYC, especially in Brooklyn. In which case, are you really reading this review? Stop it. STOP. IT. The acceptable time to order Domino's is when every other possibility is closed or won't deliver and you can't leave the house for some reason. That typically means it's about 2am, you're drunk, and just need some pizza. At which point you probably won't care that Domino's just charged you $24 for a large pepperoni pizza (about the same as just about any mom and pop pizza place in the city would have charged you for a significantly better pizza) or that they somehow messed up your very simple order. Just try not to be too drunk where you don't hear your phone and/or buzzer because rather than leaving the pizza on your doorstep or refunding your card, they'll keep both the money and the pizza. But I'm sure you wouldn't do that, after all you're responsible enough to call Domino's in your state, there's way worse decisions you could have made. When all is said and done Domino's does make a decent super-late night pizza to indulge in on rare occasions. Just don't make a habit of it.", "author": "Matt E."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-11-30", "description": "Horrible Customer Service! They are located 5 minutes away from my home, my order took and hour and a half to deliver! I called the store to make a complaint no one answered the phone! Absolutely horrendous!", "author": "Tammay S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-12-24", "description": "I order pizza and everything else for about 80 dollars for my family and about 10 minutes later they call was like my food is on it way that was fast but so I went downstairs waiting about 30 minutes till they show up and they like about 5 minutes away by car so it shouldn't be 30 minutes to get here he pull up didn't come out the car or something wanted me to go to him ok I did that than gonna wanna ask for a tip he'll no I didn't give them a tips you didn't do nothing but sit in the car then after all of that got it upstairs open ever pizza box and everything else and every box was 8 box's everything in it was burnt like I NEVER GONNA ORDER FROM THEM AGAIN. ONE STAR", "author": "Joseph C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-21", "description": "This place consistently takes an hour plus to deliver even though we are only about 10 min away.  Not sure who runs this place but its got the worst service and they routinely screw up the order even though we use the app.  I dont know how they stay in business, but I guess there arent any other pizza chains around.  They wont even answer the phone, it just rings forever.  I will never order from here again.", "author": "Rakesh M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-10-12", "description": "Are you fucking kidding me and rude delivery man ! Why would you even send this too any one I'm so disappointed and my last time ordering from this dominos period.", "author": "Danaysia B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-12-15", "description": "I'm so mad I'm laughing. \n\nI previously left two 5star reviews but twice since then I've have been very disappointed! This evening I ordered a BBQ chicken pizza - no tomato sauce, double BBQ sauce.\n\nThe pizza came with no sauce. I really can't. It's so damn dry \n\nThey're careless and I waited 40minutes to speak with someone.", "author": "Emani D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-10-08", "description": "Thieves: The delivery charge PLUS having to tip the delivery guy is obnoxious. So we are paying what the company should be paying their workers PLUS they ask for a tip!?!?! If I ever order from them again, I'm not tipping the delivery guy. Delivery charges are just a way for the company to pocket and steal more money from their customers. \n\nDon't order dominos, especially since there are so many better options for pizza right up the road and all around that area that would never charge a delivery charge and expect a tip on top- such a low, scumbag move!", "author": "Tiffany R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-11-11", "description": "Bruh literally I ordered lava cakes and then after waiting for 40 minutes w out them showing up I called back and they said there was no delivery to my address, when I literally went through the process of placing an order.. and when we tried placing another order the guy said we \"sounded fake\". Like what does that mean.. I'm so mad", "author": "Bit C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-12-28", "description": "Inattentive, rude staff. Every time I go in for pick up, they let my pizza just sit there.\n\nDespite me going in, taking my order from me, knowing that I'm the one that the pizza is for, they make me wait to say something before they'll give it to me.\n\nI'm not sure how anyone here has a job. The manager is probably just as inept.\n\nDon't go here.", "author": "Brian M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-02-09", "description": "Worst Domino's ever! Ordered a pizza and a salad. The salad that came had an expiration date that was 3 days past due. When I called back to get a refund they told me that I should have called back immediately after I got the expired food instead of a few hours later when I decided to eat the salad. They decided that they would refund me, but instead I was called back to be told that they were not able to do refunds on the same day of service and that I would have to call back tomorrow. When I instead requested a non expired salad to be delivered they waited an hour and then called me from the car to say it was against Dominos policy for the delivery person to leave their car! What a joke this place is! Who does deliveries by car in nyc?!", "author": "Jill W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-06-27", "description": "Awful, the worst Dominos pizza. Consistently undercooked or burnt. I've ordered from them a half dozen times on different nights and it is always poorly made food.", "author": "Lucien D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-04-14", "description": "The time says 3am it's 2:20 and you guys picked up and said you're closed this is crazy", "author": "Miyah M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-04", "description": "On July 4th I ordered a pizza at 8:25, the man told me it will take about 64 minutes. 2 hours later I checked my order on line and it wasn't there, I called them and they never placed the order. That's messed up when you are hungry and they make you wait a long time and they say they can't find the order. Never again", "author": "Danny S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-09-28", "description": "It took them more than an hour to deliver my food. I called and the guy said he was right outside when he was not. He did not show up outside for another 15 minutes. by the time i got my food it was freezing and i was in a rush to eat it. Would not order from here again.", "author": "Alanna H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-01-29", "description": "I'd rather have my pants pulled down in public (sans undies) than order from this place again. Cold, slimy snot of a pizza that took an hour to arrive, after lovingly sitting on the oven, per the delivery tracker, for 30+ minutes. What a joooooooke.", "author": "Daniel J."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-02-05", "description": "This is the worst pizza ordering experience I have ever had.    I ordered at 9:15, the max estimated delivery time was 10:30.   I just now received the pizza at 11:30.   That is an hour over the estimation, and a 2+ hour wait overall, which is unacceptable. \n\nThe delivery guy couldn't find my apartment, so he started calling out to random strangers on the street to see if they knew anyone who ordered a pizza.    I happened to hear his voice and called him over through the window.  Turns out his phone was dead, which is unacceptable by all accounts, but asking strangers if they knew anyone who ordered a pizza?   Weird.   \n\nThe pizza is now here an hour late and  ice cold.     I am currently reheating it in the oven.   Rest assured this is the last time I'll ever order here, and you shouldn't either.", "author": "Trevor P."}], "servesCuisine": "Pizza", "priceRange": "Under $10", "name": "Domino’s Pizza", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "146 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/v6gG3thNpXj36KHhO61wNg/ls.jpg", "@type": "Restaurant", "telephone": "+17185967000"}