{"aggregateRating": {"reviewCount": 72, "@type": "AggregateRating", "ratingValue": 1.5}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-02-21", "description": "I must admit I only go to this Domino's after a long night of partying/drinking/clubbing or if there is some special going on (ie, $5.99 for large 2 topping pie or free pie via MLB no hitter promotion). It definitely fulfills the targets of i) food available late late night, ii) good value when on sale.  I get made fun of ordering Domino's pizza especially living in NYC/Brooklyn where there are so many authentic choices available. However, Domino's hits the spot with its ordering efficiency via the web/app. I usually only do carry out/pick up and thus cannot comment on delivery times. Pizza taste and quality are okay. I've had better but beggars can't be choosers. What other pizza/food joint is open until 2/3AM in the area?", "author": "Andrew C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-10-24", "description": "Absolutely awful service. My pizza took almost 2 hours to get to me. Everything was cold by the time I got it. The first time I called the store to follow up, I was told the driver was on his way and would be here in 5 minutes. 40 minutes later, I called again and was told the driver's car had broken down, and that they were sending another driver out to pick up my pizza from the original driver. 2 minutes later, my pizza showed up. Something in their timeline doesn't add up...\n\nNever ordering from here again.", "author": "Drita D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-03-20", "description": "I have ordered from there to give them another chance and I have to admit they really have upgraded their work. The food is on time, in fact on two occasions they were at my door way before I taught they would be. \nI would give them a 4 however I ordered the specialty chicken without pork and unfortunately I got pork still. I had to discard it.", "author": "Lola B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-03-02", "description": "Ordered a specific number and type of condiments and they screwed this up.  I ordered bread sticks, end up with the dessert cinnamon bread.", "author": "Pravin B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-02-28", "description": "I gave these bastards 2 more chances on sending the garlic crust, even called to make them confirm not to forget....well these mf'ers dun trolled me because once again it came without it.  If you really intent on getting the standard garlic crust on your pizza, let it go. It's not happening. The chinese management won't apply it because it probably saves them 3 cents.", "author": "Ralph L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-01-01", "description": "\"DO NOT EAT HERE.\" -- Multiple previous Yelpers, all of whom, it turns out, knew what they were talking about.\n\nI don't know why I thought this time would be different--the last time I ordered a pizza from this location, it didn't show up for two hours. (I was told by the very surly woman on the phone that the driver got in an accident. I think she's a liar.) \n\nAbout an hour after this latest order, I opened a can of Pringles because I just couldn't take it any more. It's now coming up on two hours, and those Pringles are long gone. I've called the store, and it's busy. I'm not on hold; it's just a busy signal. I think they've skipped town, with my pizza getting cold and hard on the counter in an empty store.\n\nPicturing it there, alone, makes me want to cry.", "author": "Lauren E."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-03-01", "description": "It took 1 hour for my pizza to arrive. I went down to pick it up, the guy was no where in sight. It snowed earlier this day. I call to let him know I was in the lobby. I say \"hey I'm in the lobby but can't come to the street because I have on slippers and didn't have keys to get back in the building; he yells that he's not coming to the building and pulls off with my food. I called him back to tell him that I paid for the food that he just pulled off with and his lack of English indicated that he didn't give a shit. \n\nOh and don't even bother calling! You'll be on hold forever. \n\nI better get my money back!", "author": "Joel C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-10-08", "description": "Ordered online and I called to edit my order. Smh, they never picked up after multiple calls. That is horrible customer service and I will never be ordering from them again unless it is a desperate emergency.", "author": "Slim B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-03-07", "description": "The guy literally walked out on me. I went into the store to order a pizza, the guy heard me, and ignored me and freaking walked out of the store. And he was an employee- domino's pizza shirt and had keys to a Domino's Car. Maybe he was going to a delivery or something? \n\nBut that's just absolutely rude. He didn't take down my order for the other guys in the back making the pizza. He didn't acknowledge my presence. He literally just heard what I wanted and walked out on me. If this was an phone- order only Domino's Pizza shop, I would understand. The guy could've at least told me or said something to me. Instead he ignored me like I wasn't even there. And I knew he saw me too. This guy wasn't deaf. \n\nSeriously, I was trying to give him money to buy pizza and he decided to be super rude about it. \n\nNever going there ever again.", "author": "James D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-11-25", "description": "Terrible terrible terrible. NEVER ORDERING FROM THIS DOMINOS EVER AGAIN.\nThe first time I ordered 2 medium pies and lava cakes the only thing the driver got right was the lava cakes he dropped off a small pie and a medium pie along with the lava cakes messing up the whole order not to mention it was COLD.Yuck! The second time I ordered from there I ordered at 12:50 at 1:40 it said the quality of my pizza is STILL being checked after calling the place the customer service rep told me that the driver is still out with OTHER deliveries and it will take another HOUR for the pizza to get to me.I called back asking if I can come pick it up from the store since it was about a five minute drive and he said ok.We pick up the COLD pies and an hour later we get a phone call from Dominos saying we never PAYED FOR OUR PIZZA.So they basically accused my boyfriend of walking out the store with two pies and the lava cakes that HE DID pay for. Very unprofessional customer service and their delivery system is terrible.I will make sure to tell others not to order from them as well!!! Totally Unacceptable.", "author": "Natalia T."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-01-10", "description": "The worse service ever. Over two hours for a pizza that was done within a half an hour. And everytime I call they told me the driver was out it will be another 30 min. This is the second time they did this and I had to cancel my order and when speaking with Shaneequa on the phone it's like she doesn't care to reassure u that your order will be there soon it's just like oh well it will be another 30 mins. Never will I order from there again. I'm surprised this place is still open as all he other reviews are the same all negative... Btw I didn't even want to give it one star but I can't post without doing so..  Smh", "author": "Alaina C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-08-23", "description": "They have an average delivery time of an hour and a half.\n\n\nHad a serious craving for Domino's this afternoon, ordered around 2:40... I called around 4:15.... \u0026 the pizza still wasn't here. Apparently \"he left already\"... The WORST Domino's location of all time. 1 star isn't enough for this crapfest they're running here.\n\nUnless you're able to pick up your pizza or willing to wait at least an hour for pizza... DO NOT ORDER HERE!!", "author": "Plain J."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-04-25", "description": "This is BY FAR...THE WORST experience of my life and it wasn't even the first. This is the FOURTH SHITTY experience with that INEPT bunch of slack asses. The delivery guy REFUSED to get out of his car!! He shook his head and flat out told me no... I call the manager \u0026 she tells me that she can't force the driver to do the job that he's getting paid to do and that I'm getting charged for. The unmitigated disregard for professionalism exhibited by this particular store is disconcerting.", "author": "Romel N."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-12-06", "description": "BEWARE THE DOG!!! It has been 2 1/2 hours. I've called this joint over 9 TIMES now and have been on hold for at leAST an hour total.  I wAnt my money back, I want this place to answer their phone, and I waNT THE FOOD I ORDERED?! I'm already regretting the cold food I'll MAYBE be receiving. This place doesn't even get the one star I was forced to put to write a review.", "author": "Kyle P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-05-26", "description": "They took TWO HOURS to deliver a pizza to me and I live less than five minutes walking away from them. The pizza was soggy, and the delivery driver (yes, he drove a five minute walking distance!!) even had the guts to demand a tip for the \"service\". Order Papa John's if you want pizza, stay away from this joke of a place.", "author": "Sergey S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-05-22", "description": "I know, I know.  You're thinking to yourself, \"I'm drunk, I'm starving, it's 1AM and nothing else is open.\"  You've seen the 1.5 Overall Rating (1 Star being the absolute lowest possible score), but you think to yourself, \"Oh, come on.  It can't be all that bad.  It's fast food delivery pizza.  What do people expect???\"\n\nHere's what people expect even from late night fast food delivery pizza:  They expect their food to ACTUALLY ARRIVE AT SOME POINT in the night.  They expect to not be ROBBED of their money when they give their credit card information, are then charged- sometimes twice and thrice, and THE FOOD NEVER ARRIVES.  They expect AT THE VERY LEAST to receive a refund for the full amount of the missing order.  But this will never happen.  What, never?  No never.\n\nI have come to this site to find that, alas, I am but the most recent in a string of late night robberies by those villains over on Smith Street.  I shall never receive my chicken tenders.  I shall never receive a refund.  My stomach aches, and my purse sighs...\n\nWe Yelp reviewers need to put together a class action suit against these monsters! ;-) ;-)", "author": "Carrie M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-06-27", "description": "Don't order from here. I've lived in the neighborhood for five years, and I'm ashamed to admit that I keep making the mistake of doing it. They burn me, I take them out of rotation for 6 months or more, and then something will happen (like today, where I just got home from an 8 hour flight- an overseas trip full of hideous food, and I just wanted easy, cheesy, greasy comfort), and my misplaced optimism led me down the Dominos path. So they called today, right around the time they should have been at my door, to tell me they were out of Sprite. Seriously? How do you run out of Sprite? Whatever; I told them a Coke was ok. Then, when they delivered my order (Coke, cinna-stix, and a medium pan pizza with pepperoni, mushrooms, and green peppers), the pepperoni was missing from the pizza. When I called, they said that delivering the correct pizza would take at least another hour (and I had waited 45 minutes for the first one). And they refused to refund me, even though I didn't get what I ordered. \nThis is probably the third or fourth time they have delivered my pizza without the toppings I paid for in my online order. One time they took my order, and an hour later when I called to find out where it was, they told me I wouldn't be getting it because it was after closing and the drivers had gone home.\nSo many issues over the years, I just can't anymore.  Will avoid the temptation going forward.  Trust me, you should too.", "author": "Melanie R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-03-27", "description": "After careful thought and consideration two weeks after the incident, I am still acutely upset and because the worker encouraged me to file my complaint, I am sharing this with you good folks on Yelp because I hope this pizza tragedy never, never happens to you. My significant other also was hesitant for me to complain because he doesn't want to be on Domino's blacklist, but this is seriously, the worst service I have ever received in my life (no exaggeration). \n\nHere's what my letter to corporate looks like:\n\nDear Customer Relations at Domino's,\n\nIn good faith, I can say that I have grown up with you guys. Through thick and thin, from college days to my successful adult career, you've always been there. I've survived your old recipes, use of canned mushrooms, and the evaporation of your '30 minutes or it's free' moniker. I was OK with all that. Because I know you have a better product now and you have that cool online delivery tracker. \n\nBut an incident that happened on March 15, 2013, was quite honestly, the most degrading customer service I've ever received. \n\nI was running a huge project where I needed to cater lunch to a group of busy office workers that were so busy, we couldn't leave our office.\n\nI called up Domino's at 12:50pm. When I asked about the specials, he ran through them so fast and it was quite incoherent. I understand he's probably asked to repeat these all the time, but to me, I was paying attention and trying to make a decision from his words. I asked him to repeat one of the specials and was given the voice of irritation. So then I just decided to go ahead and order a basic large pizza, so we could move on. \n\n\"I would like the entire pizza with mushrooms on it. Then, half of it bacon and the other half sausage.\" I was asked three more times about what I wanted on my pizza, and I had to repeat this entire session. I'm not sure if this guy was new, but I think this is a moderately-easy pizza order. \n\nI was given a total and then sensing the staffer was going to hang up on me, I had to shout out, 'Hey! Do you know when I can expect this to be delivered??' \n\n\"Yeah, I'm going to tell you 45 minutes. Actually, no, an hour,\" he replied. \n\nI was pretty amazed at how long this order was going to take (is it easier to order from my local pizza shop?) but my hands were full and I didn't have time to call another place. I told the staffer, \"Thanks,\" and then told my hard-working yet hungry staff that it would be here in 45 minutes or so (I didn't have the heart to tell them an hour). \n\nSo we are all plowing through the lunch hour, and I check my watch, 2:18p. It's an hour and a half later? I call Domino's. I live on a main street, on the ground floor, in a place that's easy to find. Should I help the delivery guy? Did he get lost? \n\n\"Domino's. How can I help you?\"\n\n\"Hi, I ordered a pizza an hour and a half ago. I haven't seen it. Can you tell me what the status on this is please?\"\n\n\"Hmm, let me check. Did you order it online?\"\n\n\"No, I called in. My hands are too full to jump on a computer.\"\n\n\"Ok, what did you order?\"\n\n\"A large pizza. To address XX Smith St. Apt XX.\"\n\n\"Hmm. Ok, what toppings did you have?\"\n\n\"I don't quite remember.\" Honestly, I was just floored at the moment about where this conversation was going. \n\nAll of a sudden, a rushed voice came from this same guy (I have a trained ear in music, and I'm pretty sure that I spoke to the same guy both times on the phone with Domino's) and just quickly said, \n\"Ok, the order was not placed. Tell me what you want now and I will give you 50% and it will be there in 45 minutes.\"\n\nI was aghast. Seriously, no apologies, no explanations, it was almost 2:30 and my staff would have to eat lunch at 3:15???\n\nThis guy was obviously not the responsible type, so I calmly said,\"I am beyond furious right now. I have an entire group that has been patiently waiting.\"\n\n\"Well, I can get that order in now.\"\n\n\"No, that's OK. I can't wait that long. I have to call the shop closer to me, because I need something now. Also, can I have the name of your regional manager.\"\n\n\"He's on vacation right now.\"\n\n\"That's quite alright. May I have his name please?\"\n\n\"Tony.\" I could tell that he did not want to disclose this information. \n\n\"May I have his last name please?\"\n\n\"It's just Tony. And he's on vacation.\"\n\n\"Ok, not a problem. I will be sure to contact corporate to get in touch with Tony.\"\n\nAfter this calm conversation, he yells out, \"Oh yeah, well, you do that. Here, just call the number, 1 800 DOMINOS!\" \n\nI hang up.\n\nThe ridiculousness of this staffer who failed at his job, failed to deliver customer service information, and then decides to yell at me over the phone? I felt like I was disrespected and scoffed for trying to place an honest order and waited with a lot of patience. In return, I received a petulant answer that challenged me to file a complaint. \n\nI hope this level of service can turn around. I quit Domino's.", "author": "Sarah T."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-01-31", "description": "This place is horrible!! I love dominos, but when I ordered online they nearly got everything wrong! The only thing they got right was the side sauce. It came cold, although I live 7min away from them. So I called them and told them that they made a mistake with my order, and he tells me that they will reorder my food, but it will take long. Guess what, I never got my food.", "author": "Nemah N."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-03-11", "description": "I'm sorry but this place should be closed permanently! Not only are the employees \u0026 managers rude \u0026 simply disgusting but so are SOME of their drivers. One Chinese driver tried ALL of my patience last night but he certainly picked the right one. He has to be the most down right rude delivery driver I've ever come across. I had my hand out so that he could give me the CC slip to sign and he threw it along with a pen. I looked at him, didn't say anything \u0026 picked it up. As I'm signing the slip I looked at him \u0026 said \"you know you are so rude\" \u0026 he says \"what\" as if I would be scared to repeat it so I repeated \"you are so rude\" and he tells me \"you talk too much\" I think that's when I completely lost it and let him sample the whole box of pizza. I hope he enjoyed it. I will never ever again purchase anything from this crappy dominos \u0026 I would suggest anyone that doesn't like cold pizza, rude managers and employees STAY FAR AWAY. Everyone at this location beginning from the managers on down to the delivery drivers with the exception of one or two delivery bikers are ALL disgusting and lack customer service!", "author": "Priscilla S."}], "servesCuisine": "Pizza", "priceRange": "Under $10", "name": "Domino’s Pizza", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "146 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/v6gG3thNpXj36KHhO61wNg/ls.jpg", "@type": "Restaurant", "telephone": "+17185967000"}