{"aggregateRating": {"reviewCount": 72, "@type": "AggregateRating", "ratingValue": 1.5}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-11-16", "description": "Worst experience with Domino's ever! My roommate ordered from here a few times and i decided to give it a try. The pizza arrived burnt (inedible) and hour and half later. It was cold and my cheese sticks were missing the garlic sauce i ordered. I called the store, and Elan or Ilan was extremely rude. I explained that my pizza was inedible and he replied \" well you can call the dominos corporation and complain\".. I was in shock that they refused to send me a new pizza and started shouting. The guy just laughed and said \" I really dont care\". Paid 21.00 bucks for nothing. Absolutely nothing. That guy should get fired for such \" outstanding\" customer service. DO NOT ORDER FROM HERE!", "author": "Lily S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-02-28", "description": "This is the first time I've gotten so peeved at delivery service that I had to say something about it. I ordered a simple bread bowl of pasta primavera (simple, right?). It took nearly two hours to get to my destination and this Dominos location is only 9 minutes away by car, so what could have possibly taken so long to deliver something so small? When I tried to call the location I was on hold for 20 minutes in total (two, separate phone calls). No one answered me or even made contact with me within those two phone calls. When I finally got a call the delivery guy told me he was outside, but clearly wasn't until 10 or so minutes later (he probably thought it would take more than 10 minutes for me to pick up my order). My food was, sad to say, cold. I emailed corporate about this awful service and they told me they would contact the supervisory team. If I don't hear back from them within a day or so, I'm emailing corporate again and I want a refund.", "author": "Jemma V."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-02-25", "description": "1,30 minutes wait and still no pizza , put on hold for 30 minutes. Never ever again. Papa johns is way better and quicker", "author": "Patricia R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-02-06", "description": "This place is the absolute worst. They always take at least 30 minutes longer than they say it will. But my experience tonight sent me over the edge. The delivery person called me, asking me to meet them on the street. When I asked them to come up to the apt, they refused. It's called delivery. They're supposed to deliver the pizza. When I finally got my coat on and went downstairs, they had already driven off. I called the store to complain and they put me on hold with an endless loop of promotions for almost 10 minutes (I'm not exaggerating) before I hung up and gave up. Never again.", "author": "Sally J."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-09-12", "description": "It is 3 stars for living up to what it is and a little beyond not as a comparison to NY pizza.  I mean it is almost sacrilege to live in Brooklyn and order Domino's, but Fascati closed for a month in August for vacation so...\n\nMy kids like to watch the pizza tracker and so do I.  I like knowing that [insert name here] just put my pizza in the oven and that [insert name here] just put my pizza in heatwave bag and then finally [insert name here] left with my delivery.\n\nMy orders are always correct.  There are always online coupons.  The pizza is always better than your regular Domino's.  The thin crust, regular hand-tossed and Brooklyn style are all good crusts.  My pizzas don't arrive in 30 minutes, but I am in a spot that could not be further from this particular outpost.  They are probably pissed when I order online and they see the address, but this is my location for delivery.\n\nYou can not beat the streamlined service of ordering online, just not possible.", "author": "Jonathan G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-02-15", "description": "I placed an order at 834pm, called the store at 930pm to check on the order and was told it was out for delivery. called at 10pm, was told to be patient. Called again at 1015pm, was told once again to be patient. Called again at 1030pm and was told that the order is at the store......2 hours later!!! Spoke with the \"manager\" Duri who told me someone tried to deliver the food and no one answered for the pizza, mind you I have a doorman who confirmed no deliveries came. Asked why if that was the case didn't the driver call the cell phone# on the order, no response. Asked why the store never called once the food came back undelivered, once again no answer. Then the \"manager\" Duri hung up the phone on me. I Called back and she said the line must have disconnected. Asked for a refund to my card and for a confirmation number to it and was told that i have to wait 7-10 business days for a refund and could not offer any type of confirmation. This is horrible customer service. I have never had such a horrible food delivery experience and even worst, the store manager was extremely rude and offered no help. Last time ordering from this dominos.", "author": "Luis A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-12-24", "description": "OMG I can't believe I'm getting a first on a domino's. HA!\n\nWell, I've got one word for you... PIZZATRACKER. This is the most amazing invention of all time (it's a part of their website), it shows you EXACTLY where your pizza is in the pizza fabrication process. Prep, Bake, Box, Delivery. SO COOL. I went and asked them how it worked and they gave me a tour. Also, you can vote on things while you wait like who will be president or who will win which bowl game. \n\nSeriously, this place is super professional and they are all really nice. Plus once we ordered a pizza at exactly 1:59 am (they close at 2) and they had it there by 2:11. WOW.\n\nIs it pizza? No, but it tastes like it and is the future.", "author": "Scott P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-01-31", "description": "I have never ordered from dominos since living in the city, but I was craving the thin crust from when I lived in FL. I almost never write reviews but this was just offensive. It took over an hour and when it got here the pizza was lukewarm and the crust was burnt all the way around.  The reason I ordered food is because I'm sick and then wasn't told until the delivery person got here that I had to meet him downstairs in the lobby rather than have him come up to my apartment--which is what every other delivery person in NYC does. I also find it absurd to charge a delivery fee, when no one else does, especially when it's not even full delivery. I recognize that no one really cares at a chain like that b/c of just that reason. It was a good reminder why I do NOT order from them.", "author": "Erin S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-01-09", "description": "Consistently late and rude workers. Can't believe they are still in business given the many other choices around.", "author": "Emily K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-12-21", "description": "Wrong pizza was delivered.  I called store to complain and they promised to deliver the right pizza.  After waiting one hour, called back to find out about the re-delivery.  No one in the store knew about my complaint and redelivery.  Pizza never came.  The rest of the order--chicken wings--- was absolutely disgusting (very fatty and unappetizing).  I was hung up on several times while trying to find out about why the food never arrived.", "author": "Vanguard F."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-09-26", "description": "There's something about Domino's (McDonald's, Burger King, Wendy's, etc.) that attract people with no teeth. Maybe I should stop coming here...", "author": "Regi P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-02-05", "description": "3 stars for providing consistently good pizza and for being reasonably priced.  Online ordering is great - I'd much rather do that then make the call for various reasons (I'm usually online anyway; placing the call feels like it takes extra effort; you can see your order being made right away).  My one complaint is that I live one avenue block away and my pizza never gets here in 30 minutes!  Isn't that what they are known for?  I know I can just walk over and pick it up..but as you can probably tell from my previous comments, I'm pretty lazy.  Anyway, if I could, I'd probably give this location another half star since my order is always right and I'm sure they are nice people.  But just couldn't bring myself to give 4 stars.", "author": "Victoria C."}], "servesCuisine": "Pizza", "priceRange": "Under $10", "name": "Domino’s Pizza", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "146 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/v6gG3thNpXj36KHhO61wNg/ls.jpg", "@type": "Restaurant", "telephone": "+17185967000"}