{"aggregateRating": {"reviewCount": 223, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-02", "description": "Best cheese pizza slice !! Went Saturday for my first time just happened to stumble across Ed it while walking back from the bridge and was searching for pizza place open and Here Fascati was. So glad i found this!! Cash only so go prepared definitely getting a whole pie soon! Thanks!", "author": "Ami M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-01-29", "description": "Me: Hi i'd like to order 10-15 pies for saturday.  How big are your pies?\nFascati: 8 slices\nMe: Ok, but how big are they? Is it a standard 18\" pie or smaller?\nFascati: 8 slices\nMe: Ok great, but how big is a pie? I'd like to know so I know many to order.\nFascati: We're pizza men, not carpenders\nMe: buh bye\n\nI'll spend my money elsewhere - where people display basic kindness.", "author": "Sabs B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-05-03", "description": "This use to be the best pizza in NYC hands down. It is now the worst. Don't even bother.  You will be disappointed.", "author": "Claudia C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-16", "description": "Pizza is toasty crunchy and has a delicious sauce and taste. The pepperoni was so yum. People are friendly and quick. Small place but has a few tables to sit", "author": "Jen S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-23", "description": "How does a Brooklynite, the Wannabe Ramen Snob, a son of a mom, dropped in the middle of a forgotten spot in California by providence, once impoverished in squalor, find a pizza shop with an iota competence? Definitely not in the West Coast! For the best you have to come to this pizza parlor!\n\nIn my frustration eating at awful pizza joints, I reminisce of the best pizza from my childhood and I am basing this review on my experience 35 years ago when I frequented Fascati's.  This was when the borough was grittier and before Brooklyn became trendy.  (If I had a dollar for every ball team these days with a girl named Brooklyn on it...)\n\nI went back to Fascati's 5 years ago and they did not change, although the patriarch was no longer there, but fortunately the baton was passed.  I checked in with my bro who is still in Brooklyn, and happy to report Fascati's is still strong.\n\nYou will see them hand twirl and shape the dough. The crust is thin and not burnt.  The sauce is tangy.  The amount of cheese is right on.  No avocado or fufu toppings, since a well made pizza will shine regardless.\n\nI read reviews of the slices being pricey now.  When I was a boy, they were 75 cents.  Though The Wannabe Ramen Snob came from humble beginnings, he got a taste of the American Dream and would be happy to pay $10 a slice!\n\nNow if I can only find a Yelper to agree to freeze a Fascati's pie and send it to me in California...", "author": "Ray C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-04-07", "description": "Ordered stuffed shells without any red sauce because I had just got my teeth whitened and could only eat white foods. When I got my $12 dish, it was so small. It had maybe six shells and sauce less than halfway up the side. When I called to complain that it was small, they were unapologetic. They seem to have no ethic about giving value to the customer. Yes, their pizza and food is yummy, but I told them we would not be frequenting their restaurant often like we used to.", "author": "Siobhan G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-27", "description": "I've been coming to this place since I found it in college. Lived nearby and was hesitant because I am a picky pizza person, but friends of mine convinced me and 10 years later, 2 moves out of BK, I still find my way back to Fascati. Jeff is awesome, as is the rest of the staff. The food is amazing! Cant stress that enough. Im not going to rant and rave although I should because I could go on forever about how good this place is but you get the point! 10 years and Im still a fan. Says a lot about this place.", "author": "T L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-28", "description": "Got a last minute pie yesterday for my roommates and it was super good. Highly recommend the sausage and pepperoni pizza.", "author": "Andrew L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-01", "description": "Pizzeria is awesome. My fiancé and I came here after visiting Brooklyn Bridge Park in the summer and I had two slices with mushrooms and the were so delicious it's a nice little cool pizza spot I would visit again.", "author": "Shade B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-03-09", "description": "I ordered from this restaurant using the menu I found online. The menu said the garden salad with chicken would be 6$ and each meatball sub would be 6.25. I find that the subs were each 10$ and the salad was 11. The salad was tiny and had cardboard tasting chicken. I called the restaurant to tell them I was overcharged and the manager (or whoever answered the phone) called me sweetie which I find sexist and gross and he told me that anyone can post on the internet. I would have asked how much it was going to cost when I was on the phone but he hung up before I thought of it. I am never eating here again and I don't recommend it.", "author": "Haana M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-02-01", "description": "Very good old school pizzeria, they even have their own brand of sodas, cherry, cream soda, and root beer. Looks like they have been around for a while, since 1971. Not surprised, these slices are solid. Its not the best pizza, but its very good.", "author": "Mike L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-22", "description": "Solid pie, served quickly.   I came here for a couple of slices before an event at Brooklyn Historical and the pizza was hot, the seltzer was cold and the service was quick.  Win, win, win.", "author": "Bill T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-23", "description": "One of the better pizzas I've had in NYC. They don't skim on toppings and charred crispy bottom like the brick oven ones on Cali", "author": "Bryan P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-13", "description": "Our fav local pizza shop.  Perfect crust and right amount of cheese and sauce.  $15 a pie.", "author": "Paul L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-09", "description": "Great place for a classic NY slice! Get cheese, cuz duh! It's cash only so make sure you head to the ATM beforehand. Good sauce to cheese ratio and great crust. I'll definitely be coming back.", "author": "Deborah A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-31", "description": "Best pizza in the neighborhood.  Friendly staff and fast service.  If you want great pizza, go to Facati's.  Don't waste your time standing in line at the tourist traps.", "author": "Cam M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-11-18", "description": "Bland, tasteless slices. Went twice because I was in the area and the reviews were so good I thought I'd give it another chance but both the cheese and the pepperoni tasted like nothing. Give this a pass.", "author": "Fatima L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-26", "description": "Very good pizza! Had cheese \u0026 pepperoni. It was hot \u0026 very tasty. It's small restaurant with only 4-5 tables so we stood up at bar \u0026 ate. It was a super busy place with a line at the door, but super good!", "author": "Lisa G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-22", "description": "It's hard to stand out when you're a pizza shop in Brooklyn, especially in this neighborhood.  But Fascati is completely unpretentious, serves up fresh slices, and they're pretty damn good. The square slice was my favorite, but they also do a ricotta slice. They're also the type of place that adds toppings on plain slices before throwing them in the oven, in case that peeves you.", "author": "Kenny C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-08", "description": "Old time neighborhood favorite.  I always get a \"square\" and a \"slice\".  Usually the \"square\" wins, but today the \"slice\" was perfect. It was thin, evenly baked, but still had a chewy-ness, well distributed cheese, tangy red tomato sauce and it folded just right, down the middle and had just a drop of red oil run off.  The square today was thicker than usual and not as light and airy. \n\nService is always quick and friendly, and not waiting for a table was a plus.", "author": "Conni M."}], "servesCuisine": "Pizza", "priceRange": "Under $10", "name": "Fascati Pizza", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "80 Henry St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/ZhAN47D620KEYSYCv1W1GQ/ls.jpg", "@type": "Restaurant", "telephone": "+17182371278"}