{"aggregateRating": {"reviewCount": 223, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-02-12", "description": "This is the only place in Brooklyn Heights where you can get a slice (come on Grimaldi's, step up!).  Thankfully, Fascati's is so good that it makes up for the dearth of pizza options in my area.  Customer traffic is high which translates into consistently hot and fresh pies and slices.", "author": "Jeanne E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-05-18", "description": "No eateries in Brooklyn Heights merit a special trip.  Fascati might come close.  Slice of white pizza: to. die. for.", "author": "Chris K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-05-16", "description": "I work down in DUMBO but it always worth the walk up to Fascati's to get some Pizza - especially when the sun is shining and you can grab it go and eat it outside. In this part of town, this is the place to grab a slice. Great sauce, great crust, always hot slices available.", "author": "Carl C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-18", "description": "Fascati has great regular slices. You an have pretty much any topping such as pepperoni, sausage, meatball, basil etc. Pretty much anything. The key is they're plain slices are always fresh out of the oven. But their sicilian is not too great. They don't really keep coming out with new pies every 10 minutes. But anyway, I urge you to go get some pizza from Fascati.", "author": "Johnnie C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2007-04-01", "description": "I'll give this place three stars for convenience alone.  The pizza is a greasy mess, the people are assholes, the food is expensive and the place is tiny.  The only good thing to come from this place is the house salad.", "author": "Thomas D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-19", "description": "I was taken aback by the charm and authentic atmosphere of this place. I've eaten here two days in a row and am currently debating on whether to make it a third. There's not a lot of other options in the area. I had the white pizza with pepperoni the first day and the second I had plain pepperoni. Try the white immediately but you won't be dissapointed with a slice of pepperoni.", "author": "James L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-04-29", "description": "surprisingly good!\nthe sauce is really good.  the cheese is not the fresh, thinly sliced, sparingly-placed mozz like Grimaldis.  it the shredded, cover the entire pie (twice) kind.  But its good im telling you.\nThe pepperoni is thickly sliced which is awesome.  The mushrooms are tasty.\nThose are the only two topping ive gotten.  \nIts an above average NY pie that people in the hood can appreciate.  But no, theres no reason to run to Henry Street for it.  you can walk.", "author": "suzanne k."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-01-24", "description": "OK for slices only.  We ordered a pie for delivery and regretted it.  The guy who answered the phone acted like I was an idiot for asking the diameter of a large pizza (as opposed to how many slices it was) and said \"We're not Domino's.\"  The pizza took over an hour to come and wasn't worth the wait--kind of leathery, as it it had sat a long time after cooking, with scant toppings and little flavor.  Not recommended.", "author": "Jack F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-05-16", "description": "There's not much choice as far as pizza goes in the section of Brooklyn Heights that borders DUMBO.  Fascatis is pretty much it.  They are dependable, and all the staff are very nice.  The pizza however could be a lot better.  It's best eaten when very hot, their mozzarella is not the best quality, so it's quite hard, rubbery and oily if it gets cold.  The crust and sauce are very nice though, so that helps a lot.", "author": "Bx L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-04-16", "description": "Easily satisfied by any sort of pizza, but Fascati is strange (in a temperamental sort of way). Having frequent here often, I find their pizza is best fresh from the oven. After a minute or if they have to reheat it (which they almost always do for slices), its a whole different experience. The crust becomes very dry and the cheese hardens. Their pizza also has a very salty taste. The guy who compared it to eating a saltine cracker was dead on. There is definitely better pizza in the heights and dumbo.", "author": "Richard A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-03-26", "description": "So much for David Rosengarten's suggestion that this was a nice place for pizza.  No exhaust fan so my clothes reak of pepperoni.  Pizza is like cardboard, dried out and salty with very little sauce.  The owner is a rude, grumpy prick who lied to my face when I ask to wash my hands before enjoying his crappy pizza, telling me that I could not because the bathroom was ....mumble...  spineless idiot.  Meanwhile his employees are using the same 'out of order' toilet one after another.  Just tell me to my face that you don't want your customers to use your toilet you coward.  NEVER EVER will return to this joint.", "author": "Brian Q."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-03-11", "description": "What happened to these guys? Their lack of consistent product is so disappointing we started going to My Little Pizzeria instead (not always as good, but at least we know what to expect). It's almost like they have three different pizza guys with three completely different styles -- and two of them are rebelling against the original recipe. Plus their weird schedule (randomly closed for weeks at a time) makes them too unpredictable to bear any longer. Too bad, we used to love this place. Maybe they'll turn it around but until then we have other options.", "author": "Lisa F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-06", "description": "i have not been there in over 12 years but if its still the same it's a very bood slice of pizza , the guy who use to make pizza for the original queen pizzaria on court street thats no longer there went to fascati's with his recipe so if you liked queen pizza back in the day , then you will love it cause its the same , a thin firm crust and good sauce and cheese , make sure you tell the server not to hot or you'll burn your mouth some places are famous for that like davinchi's on 18th ave  which is also a great slice , if your in or around brooklyn height's fascati's is the best by far , check it out .", "author": "Francesco B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2010-11-27", "description": "I have to admit, I'm constantly shocked to see how high Fascati still rates on here. I have lived a block away for the past 38 years, and to my palate, the quality took a STEEP decline when the older generation turned management over to the younger family members there now. I grew up on Fascati and am not exaggerating when I say it used to be one of the best, if not the best, slice pizza I'd ever had in the city. But the last couple of years... eh. Ingredients and prep have both suffered, even though the manager and staff deny it when asked if anything has changed since the change in management. And perhaps most gallingly, it's remarkably inconsistent... one day you'll get a slice that, while not the Fascati of old, makes you think something's going on for the better in there and there may be some hope, and then the next, you'll have an entire pie delivered on soggy, undercooked crust (not that the cheese and sauce layer leaves much to live up to). The younger me would be shocked to hear me say it, but I'm done with Fascati. My Little Pizzeria on Court isn't a match for Fascati at their peak years, but it's a way better slice of pizza than what Fascati serves up now, and they deliver no problem. \n\nI guess nothing stays the same as it used to be...", "author": "rev r."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-24", "description": "perfect new york pizza, the crust has just the littlest bit of crunch, the sauce and cheese are right.  perfect.", "author": "sarah b."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-07-31", "description": "Best place to grab a slice in the neighborhood. Nothing fancy, just consistently good quality pizza. The price per slice has gone up a little bit in the past few years, but it's still a solid value.", "author": "Stacie C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-12", "description": "really fantastic plain slices--  though not too impressed with the slices with toppings (they literally just toss them on and heat in oven a bit). not much. if you're in the area, stop by for a quick (plain) slice!", "author": "Christina F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-05-07", "description": "I happened upon fascati's unsuspectingly when i went to a movie nearby, grabbed a plain slice and gradually came to the realization that it was amazingly good.  ate every morsel, marveled at the crust, felt sort of exhilarated (i know, but it was kind of one of those \"only in new york\" moments for me). That was several years ago.   This is the best by-the-slice pizza I have ever had.  (I haven't tried the place in midwood or the one in coney island, but i have lived in new york since 1983 and was broke and eating pizza all over town for too many of those years...)", "author": "patrick d."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-01-12", "description": "Pizza is fine. Nothing to write home about. The reason I will never go here again is becuase the guys who work behind the counter are horrible.  I was there one night during a rain storm when a man and his 5 year old daughter came in.  He ordered a few slices and then asked to have them \"to stay\".  The guy behind the counter said, \"No we are closing up, you'll have to take them to go.\"  Meanwhile, my husband and I are sitting right there enjoying our pizza -so it's a little confusing, like why can we sit but this guy and his daughter can't?  Did I mention is was POURING out??  The man asked nicely to sit so he and his daughter could eat and he was told no.  The poor girl was starving and erupted into a tantrum (who could blame her?).  Even still, no go on staying from guy behind the counter.  The man left, didn't take his pizza and didn't pay.  The poor girl being dragged behind the dad saying, \"But I'm still hungry Daddy.\"  I felt terrible. This place is heartless and has no customer service.  I would starve before I would eat here again.  They should be ashamed of themselves.", "author": "Marie I."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-05", "description": "The best pizza by the slice shop in Brooklyn.  No contest.   I take the 10-15 minute walk for the fantastic pizza, and tasty fountain soda.  It's pretty cheap, and also gets points for the authentic exposed brick wall.  Loses a star for minimal seating.  Hey Fascati, put a bench out front in the summertime.", "author": "Zach L."}], "servesCuisine": "Pizza", "priceRange": "Under $10", "name": "Fascati Pizza", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "80 Henry St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/ZhAN47D620KEYSYCv1W1GQ/ls.jpg", "@type": "Restaurant", "telephone": "+17182371278"}