{"aggregateRating": {"reviewCount": 223, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-03-09", "description": "What's not to love?  The BEST neighborhood NY style pizza place I've ever been.  Consistently good too.  I like Grimaldi's down the road too, but if you want to get a taste of what and how New Yorkers eat, take the short walk to Fascati's.", "author": "Ken K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-22", "description": "I like the pizza here but if you only want slices, you pretty much have to be in the mood for a plain slice because they never have slices w/ toppings available (unless you order a pie).  If you order w/ a topping they put on the topping and throw it in the oven.  That never makes for a good slice.  Also, they always run out of rolls (e.g. chicken roll) even if it's early in the day (like noon).  They also close for 1 month a year (early August through early September).  That said, I do tend to eat their plain slices fairly often (partly out of convenience).  The slices are not all that filling though 2 slices is usually good enough.  If you're pretty hungry, though, it'll leave you wanting a little bit more (at least to me).    Their pizza is good but not terrific.  Honestly, I'm a little surprised at how good the reviews are of this place.  This is NOT amazing pizza but rather a better-than-average slice.  I'd probably rate them 3 1/2 stars if yelp allowed that.", "author": "Kevin S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2006-09-30", "description": "fascati's is what starting my love affair with new york pizza.  it's nice and thin and crispy.  so good.  not my favorite but it's right around the corner from me so it's a given.", "author": "Paula M."}], "servesCuisine": "Pizza", "priceRange": "Under $10", "name": "Fascati Pizza", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "80 Henry St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/ZhAN47D620KEYSYCv1W1GQ/ls.jpg", "@type": "Restaurant", "telephone": "+17182371278"}