{"aggregateRating": {"reviewCount": 223, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-01", "description": "I do not understand how this place has low rating. This pizza is wonderful! As a native NY for 25 years, I think I know what good pizza taste like.", "author": "Crihs M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-10", "description": "We love living so close to Fascatis! I've never gotten anything but pizza, but it is some of my favorite pizza anywhere in New York. \n\nI haven't tried anything fancy, just slices. And I wish their hours were more predictable. But overall this place is awesome (and not just awesome 'for the neighborhood,' which is sort of lacking great food options).", "author": "Lynn B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-09-06", "description": "One of my old friends took me to this place.  I believe it was Fascati's!!  He said he went here for years when he was in grade school as he grew up.  And I remember the place being very narrow on the inside, near Promenade Park (one of the best views of NYC from Brooklyn), and looking aged on the inside of the building.\n\nThe pizza I had was thin-crust, very delicious, and it's known for its authentic Italian flavors.  It is supposed to be THE BEST PIZZA PLACE!  Instead of NY-style, it is Brooklyn-style thin crust pizza!  I will have to visit it again to confirm my memory!!", "author": "Hanh T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-09", "description": "If your walking by and want a slice, this is the best pizza in the heights. For some reason I dont like to order hole pies from here, I guess more than 2 or 3 slices at a time and the pizza begins to feel heavy and greasy.\nAlso you can order from the street in decent weather, so it makes it dog freindly.\n\nIf you just couldnt wait to get into Grimaldi's, this wont do the trick (very different style) but for a quick slice, one of the best around.", "author": "Geoff C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-03-26", "description": "We ended up coming here because the line at Grimaldi's was too long to deal with.  (We'd never been to Grimalidi's, but were playing tour guide to my visiting parents...)\n\nWe ordered by the slice and got a table pretty quickly.This is your typical run-of-the-mill no frills NYC pizza spot. The pizza was fine, but nothing to write home about-- seemed pretty comparable to all of the other by-the-slice pizza I've had in the city. The crust and texture were great, but I found the sauce and, as a result, the whole shebang to be relatively bland. I was also disappointed that they didn't have more options for veggie toppings.", "author": "Sara B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-02-15", "description": "I think Fascati's blows Grimaldi's out of the water. The pizza is just as New York Pizza should be, with a great ratio of sauce to cheese to toppings, and lots of flavor without too much seasoning. The prices may be high, but the pies are huge.  This has been my go-to pizza place ever since I discovered it.  Crust can be overly crispy though, especially when eating leftovers.\n\nNote - cash only.", "author": "Kara B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-10-07", "description": "Wow! What an awesome random find!\n\nThe food - mmm mmm mmm! The place serves your basic \"design your own\" pizza by the slice! I ordered my slice with mushroom + pepperoni and my fiance ordered the white ricotta napolitana pizza. WOW! Upon the first bite, I immediately exclaimed, \"California pizza's got nothing on this!\" The crust is firm and crispy, the sauce isn't too heavy nor overwhelming, the cheese is not overdone such that it'd be dripping with oil. I'm typically not a big fan of \"white pizzas\" but the riocotta was pretty good as well! It was just overall GREAT pizza.\nThey also serve cal zones and spaghetti etc. Check out their menu here: http://brooklyn.citysearch.com/profile/7330975/brooklyn_ny/fascati_pizzeria_corp.html\n\nThe price - Reasonable. About $2.50/slice. \n\nThe ambiance - Your basic clean little pizza cafe, good amount of seating, lots of window space to allow light to come in. Plus it's not too loud. What a great casual hangout place! Plus, the scenery outside this cafe is excellent (near the water)!\n\nThe service - Friendly. You order you stuff, you get it and you eat it. Want anything else, just ask for it. Gosh, that was one good pizza... I miss it. =\\", "author": "Mimi C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-19", "description": "If you are looking for GREAT walk up, pizza by the slice, come here! This isn't a place for large group, sit down dinners. But so much better than those generic places in the city. Love the sauce and the thinness of the pizza. I will take it as thin as it goes! They have different types of slices, but I get plain cheese and a slice of white, slap them together, and chow down! If you are walking the Promenade and need to bite to eat, stop here!", "author": "Sara W."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-05-25", "description": "Disappointment of pizza. I still don't undarstand how someone can mess up a simple slice of pizza, very flavorless with almost nothing of sauce. I would rather put pasta sauce and shredded cheese on a slice of bread. ... it would have a better taste.", "author": "Luis B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-26", "description": "This is one of the best pizza places in NYC that does not get the love.  It's more of a take out slice kind of place but the pies are excellent.  Luckily they deliver to my neighborhood and I always order pies from here when I have a group of people over.", "author": "Stephen S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-04", "description": "Best pizza ever    We live in the neighborhood and grimaldi's is just for tourists    The locals eat Fascati", "author": "anthony v."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-14", "description": "My wife and I have been fans of Facati's pizza since we moved to the Heights many years ago and here is what you can look forward to: Delicious family sauce recipe that is quite seriously PERFECT. Not too sweet. Not too acidic. Its sauce as IT IS SUPPOSED TO BE. I like their crust too and usually ask them to make it crispy for me, which they always do with a knowing smile. The boys have taken over, but their fathers are very much missed. One time I was in line and some guy butted in in front of me and boasted that he'd get preferential treatment because he'd been a customer for seven years. I piped up that I'd been a customer for more than 25 years... And Mr Fascati (whose hearing was not the best) looked over his shoulder and gave me a wink. \n\nI was served first.\n\nLove this place. When they go away for the month of August my wife and I have pizza several nights in a row and ALWAYS get a pie the night before they close. Just when the withdrawal pain is at its most acute, they return. YUMMM.\n\nIf you are a picky pizza patron, not at all interested in bougie weird pizza (pineapple and ham, broccoli and brie...) this will become a favorite, go-out-of-your-way restaurant.", "author": "Datan B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-11-05", "description": "Bad service, so so pizza, long waiting time for delivery and bad attitude if you call about your pizza being late. Don't go to fascatis. There are better pizza places out there.", "author": "Samuel D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-02", "description": "Unless you like crunchy, paper-thin pizza that you can actually pick up with one hand, I wouldn't recommend Fascati's.  Fortunately, I do.  However, I'm withholding a star because the texture was the most interesting thing about the pizza.  Not to say that it wasn't good (it was)--it just didn't stand out as an amazing slice. \n\nOne thing that bothered me was that a small fountain drink (and I mean small--10 oz. maybe?) is $1.25.  I expected 50-75 cents.  Meh.  I'm used to $3 getting me a margherita slice and a small drink at Original's.", "author": "Gabrielle G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-01-20", "description": "Not worth the walk from the Brooklyn Bridge (and it's not a long walk). \n\nKind of rude, the pizza was ok.  Hole in the wall place to duck into for a slice. I asked for 2 slices then after he put the pizza in the oven he asked me if I wanted anything else, it was a little busy, I said diet coke and he just ignored me.  It's not like I asked for a tall non fat double mocha or like the pizza was that great.", "author": "Tom Y."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-03-24", "description": "Fascati Pizza is one place where I enjoyed a slice on my most recent visit to New York.  I had just a slice of cheese and a root beer, my spouse had the same.  It was ok - no more or less.  Someone else mentioned the fact that is is pretty crispy, as in, if you fold it, it breaks.... 'tis true.  Further, for as long as we waited for them to heat our slices, it should have been much hotter.  The only available spices to jazz it up were hot peppers, salt, pepper, \u0026 garlic powder - which seemed odd to me.  The space is  a long counter \u0026 maybe 6 small tables at most.  There is no ambiance.  I would not recommend this place as anything of note.", "author": "ChaCha C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-04-29", "description": "I was not a fan of the don't-you-dare-fold-me-or-I'll-crack crust. I know that they're known for the extra crispy crust but it was clearly overcooked...beyond just a little toasty. \n\nCheese and sauce were pretty good. I would definitely go back to try another slice.", "author": "Craving Cholent X."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-17", "description": "my friend and I were strolling along dying for some pizza on a pretty cold day and we ran into this place. Loved it! First of all, it was warm inside second of all we were hungry! For the price it can't be beat..one slice is all you need to hit the spot in a hurry.. it was so good I wanted another slice but I was trying to watch my portions so i had to say no ): My Pizza slice came out fast and was baked to cheesy perfection. Come here if u need a quick pizza fix!", "author": "Dana J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-27", "description": "I was given a great tip from a friend when it comes to trying authentic New York pizza: look to see if locals are eating there and make sure there are, um, certain people working behind the counter, if you know what I mean. \n\nAnyway before I unintentionally offend anyone (again) the pizza here is good. Now I can't say if its the epitome of New York pizza because it was in Brooklyn--does that count? and  well, I have no other comparison...so anyway, judging by the line of locals (think moms \u0026 babies, regular people not schleping tourist bags, etc) I think this place was a good find.", "author": "Angelica d."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-08-07", "description": "I don't get it. People really like this pizza? We went here because we were in the neighborhood, and yelp gave it good reviews. It's honestly the worst pizza I've had in Brooklyn or Manhattan. The crust was horrible.. dry, and the flavor reminded me of a saltine cracker. The sauce was bland. \nThe place was also ridiculously hot. It was a hot night already, but with the pizza ovens going and no AC on, it was almost unbearable. They have a small front door to open, but no windows that open. No industrial fan to suck the heat out.  No outdoor seating. \nThe 2 star rating is for the friendly staff. Even in that heat, they were nice and gave good service.", "author": "Abbey C."}], "servesCuisine": "Pizza", "priceRange": "Under $10", "name": "Fascati Pizza", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "80 Henry St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/ZhAN47D620KEYSYCv1W1GQ/ls.jpg", "@type": "Restaurant", "telephone": "+17182371278"}