{"aggregateRating": {"reviewCount": 223, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-06-25", "description": "I hate to say it, but really nothing special.  I came during lunch and got the lunch special (slice and can of soda, $5).  The cheese slice was basic.  \n\nI read a review once saying you know it's good pizza when even the crust has a flavor.  Needless to say, I threw away my crust.  \n\nNot worth all the hype.  Fine pizza place, but as I said, I don't think it was anything special.", "author": "Mike P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2009-12-16", "description": "Great slices do not equal great delivered pizzas.\n\nMy friends and I ordered a regular and a Sicilian from here. The delivery was half an hour late (strike one). When we opened the boxes, the Sicilian was super slimy (strike two). Upon eating the food, we all felt gross (strike three). I definitely won't eat here again.", "author": "Jess H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-10", "description": "Fascati's is the unsung pizza hero of BH.\n\nThe pizza is bomb, especially when it's well done, and you can order by the slice. It reminds me a lot of Johnny's in Mount Vernon, with slightly thicker crust. Not too greasy, not too drippy and perfectly (perfectly) crunchy. Fascati's has a charming storefront, too, where you can order from outside and watch other pies being prepared by the super friendly guys inside. \n\nSadly, it's closed for vacation until early September.", "author": "Dani C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-09-15", "description": "This is the kinda place that doesn't change. I have been eating fresh, tasty pizza there for 14 years. This is the place I think of when I think of NY pizza. You don't go there to sit, though they have a few tables if you want to. You go there to get the awesome pizza and take it home, and enjoy the melty, yummy cheese ...\n\nAlright, I can't review anymore. I'm stuck in Washington state till December and it doesn't help me to start salivating over something I can't have.", "author": "Kaitlin F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-02", "description": "If you're in the mood for a real NY pizza and not the perfect gourmet fancy shmacy kind that you eat by candle light in a nice restaurant but the kind you have delivered or go pick up and watch while polishing off a pack of beer, this is your place. Fascati is awesome pizza at a reasonable price. For those too far to get it delivered or bring it home, they do have a bunch of tables to eat-in.", "author": "Matt E."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-12-22", "description": "Pizza is great - except it's frustrating having to wait for it.  There seems to never be a pie ready, and there are always 6 in the oven.  So as long as you don't mind the wait, this is a great spot.", "author": "Joshua G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-05-24", "description": "Grabbed a slice on the way back from work. Had hot cheese slices ready, but only had cheese versus other slice selections. Piece was solid (sauce, cheese, taste) but the crust was mediocre. Slices were only 2.50 so for a decent slice in a big city, I would most likely go again.", "author": "Alex G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2008-11-16", "description": "For breakfast, I had pizza.  I admit it.\n\nMy sister and I were taking a late morning walk around Brooklyn Heights.  We passed by Fascati and she started raving about how good their pizza was.  Well, we went and they were closed till 12.  We walked around the area for another half hour and came back again.  I was craving a good NY slice.\n\nWe sat down and ate our pizzas.  I hate to say I was disappointed.  Not that I was disappointed for real, since it is NY pizza.  But it didn't live up to my expectations of what good pizza should be.  It wasn't bad either, I just had high hopes.  The one thing I did love was the super thin crust.\n\nAt $2.50 a slice, it will hold your appetite over for a bit if you're walking around the area.", "author": "Susan N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-11-17", "description": "Great pizza. Best in Brooklyn Heights and Dumbo. Been eating pizza here since it opened. (If, however, you think Grimaldi's pizza is better, which I don't, you may not like this typical NYC-style pizza. I don't think ANY pizza is worth waiting on line for an hour.)", "author": "Anne S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-10-24", "description": "Look, it's no Grimaldi's.  This is not a coal oven place.  It's a slice place for people that live in the hood.  And if you do live here you are lucky because it's the best slice around.  By far.  Re-heated it's not so hot, but if you order a new pie it is always fantastic.  Crispy and saucy and good cheese.  There is a reason its always busy.  Plain and simple.  The best slice in and around Brooklyn Heights.", "author": "Optimist O."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-16", "description": "I am a regular here.  Good pizza, good food, and good service.  The owners and staff always are friendly and always say hi.", "author": "Michael M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-21", "description": "Great pizza by the slice....crispy crust \u0026 delicious mushroom \u0026 sausage.   Super friendly staff.", "author": "Kathy M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-01-15", "description": "Ordered a cheese pie and it was just mediocre at best.\nWhat happened? This used to be a good pizza place. Whose idea was it to put oregano on the pizza? It tastes awful. Very disappointed. Have been eating Fascati pizza since we moved in seven years ago but will not go back. Someone should let the owner know that the pizza is just not what it used to be.", "author": "Linda T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-03-30", "description": "I have tasted both Grimaldis and Fuscati and truly Fuscati  is way better. Plus you don't have to wait on line in the street in all  types of weather. You get treated nicely and they deliver a great quality pie. They even have specials. Grimaldis doesn't even offer slices. Let's be honest Grimaldis is for tourist and Fuscati is for people who want to taste a true slice of New York pizza. they also make great Italian dishes, the veal parmagian is my favorite.", "author": "Sara P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-11-02", "description": "I've been an avid visitor of NYC since I was little, since most of my family lives here, I'd visit several times a year. So I've been all around, eaten at all sorts of different places etc, but it was never really personal until I moved here.\n\nSo I set out to find my own little places to love and tell my friends about.\nFirst I wanted to start with something that seems simple, a pizza place.\nFascati's is only 2 streets over, I noticed it while walking the neighborhood, so I figured I'd start there.\nAnd wow :D\nFantastic pizza, I mean really, I've eaten at countless places on my visits here, but this place is really great.\n\nThe customer service is friendly, it's always super busy. They don't seem to ever be too talkative/personal, which doesn't bother me.\nWhen you order slices they add the toppings you want and throw it back in the oven for a few, so the pizza is always hot/fresh and you can get whatever you desire.\n\n\nSince trying Fascati's, I've tried about 11 other pizza places, and it's still my favorite, and lucky for me it's just a short walk away.\nPizza is a very personal thing, I personally would highly recommend their pizza to everyone, I doubt anyone would truly dislike it. \nThe prices are fair, there isn't much seating room or anything amazing decor wise to write home about, but it's a pizza parlor, do we care?", "author": "Michael C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-22", "description": "When I moved from Hells Kitchen to Brooklyn Heights, I was in mourning for my old pizza place (Sacco) until I discovered Fascati.  It is a great place to grab a slice, although if you are in the mood for a sandwich, their chicken parm is pretty tasty as well.  My only complaint is that Fascati closes pretty early, around 10ish, but I guess that is typical for Brooklyn Heights.", "author": "Kelly M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2009-10-03", "description": "Damn you Fascati's!\nYou pizza Nazis!!!\nHow dare you serve us a pie with chewy crust!\nFound myself choking in flour dust.\nThe sauce is pretty bland.\nCheese tastes like rubber band.\nBlah...This pizza I cannot stand!", "author": "Wendy C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-05-02", "description": "I spent the summer of 2007 interning in Manhattan, but I was living out in the SVA dorms right at the Clark Street stop on the 2/3 line. Fascati's, being half a block away, was the closest pizza joint around and boy did it not disappoint. I'm someone who likes their pizza plain and simple: give me a relatively thin crust, a good helping of cheese, and a little flavoring in either the cheese or the tomato sauce and I'm set. This became my go-to dinner spot after a long day at work...nothing beat hopping out of the subway, walking down to the open window at the side and asking for a slice or two of plain cheese. The pies are made fresh on the spot, and on the weekends when it gets pretty busy in the summer, you might have to wait a little bit for fresh pies to be made...but it's definitely worth it. They do take the entire month of August off, which left me without my pizza fix at the end of that summer, but I've made it a point to get out there every now and then for a slice or two. It's not as famous as the pizzeria down the street (Grimaldi's), but the pizza speaks for itself and you won't have to wait in a long line to get in.", "author": "Asuka N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-19", "description": "Delicious. Ordered a Sicilian pizza with sausage for delivery on Sunday. They were great on the phone, delivery was prompt, and the pizza was delicious...which is especially good because our leftovers will be dinner tonight for the 3rd night in a row!\n\nNo complaints at all!", "author": "Jenny H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-04-03", "description": "Used to be so yummy. New owners, I guess...really went downhill. Burnt pizza \u0026 really, really rude staff. Keep away!!", "author": "Ileane S."}], "servesCuisine": "Pizza", "priceRange": "Under $10", "name": "Fascati Pizza", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "80 Henry St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/ZhAN47D620KEYSYCv1W1GQ/ls.jpg", "@type": "Restaurant", "telephone": "+17182371278"}