{"aggregateRating": {"reviewCount": 223, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-04", "description": "The pizza is thin and tastes very delicious.  \n\nThe dishes and sandwiches portions are generous. \n\nThe staff is very friendly and accompanying.  \n\nI always pop in when I'm in the area.", "author": "Carlos P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-11-12", "description": "This place is popular due to location more then quality.  Don't get me wrong. The pizza is ok. However I have never been crazy about it. I guess I am more of a sauce guy and I'm not a fan of there sauce. Overall there are many other places to get a better NYC slice.", "author": "Joseph L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-23", "description": "What's not to love about this place?!?  Besides great a NY slice and very high quality pepperoni's --- probably the same ones you get from Grimaldi's--- the owners are fantastic they open when they want --times and days vary without much notice.  Staying power! The customers are okay with that and I am sure the workers are treated really well, the restaurant is closed every year for two weeks during August for vacation/cleaning.  \n\nAll the bad complaints about being Cash Only can go to Domino's instead this place doesn't adjust to your needs you will have to follow theirs.", "author": "Jj L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-06", "description": "My favorite pizza. By the slice, a whole pie. I've never had better. Every other slice I'm always comparing to this pie - I love pizza , I love this pizza the most.", "author": "Sam D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-04", "description": "I usually hate thin crust pizza, but they do it well. It's a small place with little seating. People generally just take out. It's only $2.50 (plain cheese) / $3.25 (white ricotta) per slice and pretty speedy turnaround to get food. Perfect size for folding and nomming. I'd say go for two slices if you're hungry; one if you are not super hungry.\n\nWhen you add toppings, they just put it on a cheese pizza and reheat. So, get either the white ricotta or the plain cheese.", "author": "Judy S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-05-05", "description": "It's what a decent New York slice should always be.  It's not fantastic, but it is so consistent and satisfying.  There are so many sub par slices to be had... they really should be praised for the constancy of quality.  If I'm in the neighborhood, I'm definitely getting Fascati's.", "author": "Danielle F."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-05-28", "description": "Not up to NYC pizza standards. I can only describe the crust as tasting like a cracker. I like thin crust but this crust is unusual. Would only come back if I was desperate for some reason.", "author": "Leslie M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-17", "description": "Best New York-style pizza in the neighborhood.   Hands down.  Whether you grew up in the neighborhood or are visiting Brooklyn for the first time, grab a slice of Heights history at Fascati's.  \n\nThe pizza is what dreams (and cravings) are made of.  Super thin and crisp crust, perfectly-seasoned sauce and just the right amount of cheese. \n\nThe owners still work in the shop and ensure quality control.   But that means the shop is closed for most of August, while the family travels back to the old country for some much-needed R\u0026R.", "author": "Hey A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-27", "description": "Old school BEST pizza. The sauce and crust are always perfect and the no frills atmosphere makes me nostalgic for my childhood pizzeria.", "author": "S A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-05", "description": "Perfect cheese slices. Consistent from day to day, year to year. For by-the-slice pizza without frills, it doesn't get better than this. Thin, foldable crust (not that cracker-thin stuff), neutral sauce that doesn't taste like jarred crap, plenty of cheese. The slices that were sitting out for a few minutes and then reheated are my favorite because the crust gets a little extra crispy with the reheating.", "author": "Alycia Z."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-08", "description": "This place sets the standard for a NY slice. The pizza is consistently good- not too greasy, the cheese and sauce isn't a mess atop of the slice, sauce is great and they use tiny pepperoni that crisp at the sides in the most delicious way. Thank you Fascati for not disrespecting pizza. This place is no frills, cash only, tasty pizza.", "author": "Daniela L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-09-23", "description": "I had high hopes and felt left down. The service was good the crust was good but I just wasn't impressed with the sauce or the cheese or condiments. They seemed to skimp on my pie a bit. \n\n\n\nIt's a good neighborhood pizzeria but I will be going elsewhere only because I was underwhelmed.", "author": "frank K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-29", "description": "Consistently good traditional New York Slice. Not the nicest bedside manner on all the guys but it kind of adds to the charm. Only downside is that they are successful and take advantage of that success by closing when they feel like it. Closed most holidays and for the month of August. \n\nHeroes are also very good. Chicken Parm is excellent. Definitely the best \"New York\" slice in the area!", "author": "Mike C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-05-13", "description": "It's pretty average. OK for a slice on the run but nothing special. Crust is good, maybe a B+. Sauce has little flavor, not more than a C- .  Toppings are right out of the can (not fresh). Cash only.", "author": "Mipi A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-28", "description": "There should be 2 entries for \"Frascati Pizza\":\n1) When the Fathers and Sons owned it\n2) When the Fathers and Sons didn't own it (currently)\nLet me first say that I've been going to Frascati's since 1974...when the interior looked a '70s poly-plaid shirt that hadn't been washed since the '60s.  The old Italian brothers who owned it were stoic and the sons who took it over, talked even less...when men were men and pizza \u0026 lounge singers were cheesy.  However and luckily, the sauce recipe and the thin crust have stood the test of Brooklyn gentrification time.  It continues to be my favorite and best tasting pizza place in NYC.  Note, when you grow up in a Brooklyn neighborhood, you can't help being biased, but it really is a fantastic slice.  Order a slice, add garlic powder, fold it (lengthwise...newby), start walking up the street and chow down (watch out for the orange-cheesy-oily droplets that will invariably come out the back and stain your corporate-white shirt).", "author": "Rock G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-17", "description": "My sister and I bought some heroes here the other day.  Phenomenal!  I had meatball parmesan and she had chicken parmesan.  Heroes were huge.  For 2 heroes, it costs $18.  You can make several meals out of them.  Meatballs were homemade and delicious--just the way I remember heroes being when I was a kid.  Now every time I visit my sister, I'm stopping by for a hero.", "author": "Katharine G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-24", "description": "Was waiting until I went here at least twice before reviewing, and glad I wasn't disappointed either time.\n\nAfter living in NY my entire life I've had fantastic slices and horrible ones, the latter mostly in the past 10 years.  There's so many places that make pizza in the city now that are tasteless. And I'm not even talking about the 99 cent pizza places - you get what you expect out of those - I mean the ones that seem like they should be quality (yes, I'm talking about that somehow popular place in DUMBO, among others).\n\nAnyway, Fascati, as you can glean from my high amount of stars, is in the fantastic category. The crust isn't too thick (though sometimes that's good) and both the cheese and sauce are placed in perfect combination.\n\nI mean seriously, I got off the train a stop early to get a slice.  \n\nAnd oh yeah, they're actually affordable at $2.50 per slice. The next time I'll get a special slice and see if that stands up quality wise. If so, you just may see 5 stars from me.", "author": "Curtis J."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-10-19", "description": "A solid 3 for a few reasons - it's a monopoly in this part of the Heights - no rivals to keep them edgy or affordable. Also, they rest on their laurels a bit, which are mostly deserved, however, a slice (ONE slice,) with ONE topping should NOT cost $3.50. It's great that you can custom order a slice (they make fresh plain pies all day, you order your topping, they throw it on the plain slice and throw it in the oven for a second - great - but NOT worth $3.50!)\n\nIt's no Lombardi's by any stretch (and strangely, it's WAY more expensive,) but if you're in a jam and you want a solid NYC slice in a flash, it's great. Just a little too pricey, considering that, in Manhattan, where rents are 3x what they are here, I can get a comparable slice for $1.50.. Capitalism necessitates competition, and they don't have any. That's all I'm sayin'... Just like the one girl in Catholic School who rocks the thigh-high argyles and Ranger Rick eyeliner, of course she's going to stand out, because she's adorable - but when she has no competition due to the stringent uniform code, is she really captivating, or is she just compelling because she's all alone in the hallway that is Henry Street...?", "author": "Brad D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-11", "description": "Super delicious pizza. I came here recently and couldn't decide between the cheese or white slices, so I got one of each. Both were excellent! The cheese was a delicious, straightforward, New York Pizza. Thin crust, delicious sauce, nice \u0026 hot. And the white pizza! On top of having excellent flavor (seriously), the dollops of ricotta were still soft! I never realized how much I hate it when those ricotta blobs are hard and crusty at other places, but Fascati has shown me the light. It was delicious! So soft and creamy...\n\nI have yet to try the slices with the toppings, but I'm sure I'll be back.", "author": "Sarah R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-03-15", "description": "Brooklyn Heights definitely needs some competition when it comes to pizza. This place is definitely overhyped. Prices are totally reasonable, but there's really nothing all that special about the pizza. The crust is dry and will crack if you attempt to fold it. I'm partial to a crust that's chewier. I'm also partial to a sauce that's tastier. The tomato sauce is good in that it's not acidic, but it's lacking flavor. And by flavor, I don't mean just salt, which is what it has too much of. \n\nService is very non-chalant. Cash only, and there are no washrooms. I think they survive because of their great location (near the A/C and 2/3 trains) and the students. Can someone open up a proper pizza joint in BK Heights?", "author": "Heidi C."}], "servesCuisine": "Pizza", "priceRange": "Under $10", "name": "Fascati Pizza", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "80 Henry St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/ZhAN47D620KEYSYCv1W1GQ/ls.jpg", "@type": "Restaurant", "telephone": "+17182371278"}