{"aggregateRating": {"reviewCount": 223, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-14", "description": "Some of the best pie in town, thanks guys! Cash only and not open on Mondays are the only cons.", "author": "Wesley B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-13", "description": "My favorite pizza place, hands down.  Been going here for over 30 years!  And more than their pizza I love their heros - meatball or chicken parm especially. xoxoxo Fascati!", "author": "Barbara Ann R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-29", "description": "The best regular slice.  This is how pizza should be made...clean place. Cleant professional workers .sadly many pizza joints today lack the quality of fascatis..", "author": "Frances N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-13", "description": "When I lived in Brooklyn in the late 70's Fascati's was our favorite place for Pizza. We moved out west and I have really missed our favorite. On our last visit we decided to check out our favorite pizza. I have to say still the best pizza ever. Thin crust right amount of sauce and cheese.", "author": "Dawn L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-11", "description": "So weird confession, I've never eaten the pizza at Fascati....\n\n*crickets*\n\nI do, however, order their baked eggplant parmigiana dish and house salad about 3 times a month for delivery or takeout. I really do like their baked eggplant. The breading is very light and the dish tastes like the perfect harmonious balance of vegetable, sauce, and cheese. They give a very nice sized portion and I always split it in half and save the rest for my lunch the next day. The house salad tastes very fresh and reminds me of a plain but tasty insalata mista that you would get at a high end Italian place. Iceberg lettuce, chopped green bell pepper, tomato slices, thinly sliced marinated white onions, and a tasty red wine vinegar dressing with herbs in it. Sometimes if I'm trying to be good I order a large house salad and grill half a chicken breast at home to make the perfect (and highly affordable) light dinner. Always ask for the dressing on the side though because sometimes they tend to overdress and by the time it gets to your apartment it's a little too wet. Delivery takes about 45 minutes at night so plan ahead accordingly. They always seem to be super busy!\n\nOne of these days I will try the pizza at Fascati but till then I've got their eggplant and salad to keep me company on Sunday nights.", "author": "Leslie D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-04-06", "description": "I grew up in Bay Ridge and was surprised when I moved to the Cobble Hill/Carroll Gardens area about the lack of amazing places to get pizza by the slice. There were some good places, but none that could compete with Bay Ridge (like Pizza Wagon on 86th and Vesuvio's on 3rd ave).  That was, until I found Fascati's!", "author": "Christine J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-06-30", "description": "I'm impressed with how many people - not all of whom claim to be BH natives - are talking up Fascati.  It's just that damn good.\n\nMaybe it's the nostalgia.  Maybe it's moving to Los Angeles.  See, in LA, they make a single pie of everything and serve you up a slice.  So it's been sitting all day and it's soggy.  At Fascati, they leave out a cheese pie, throw on the toppings, and toss it back in the oven.  It never sits for more than ten minutes, and it's always crisp.  Swoon.", "author": "Jena B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-02-28", "description": "The best plain pizza I ever ate. They use good cheese \u0026 the pizza are always baked to perfection... I eat Fascati pizza weekly... I love it!", "author": "Francisco T."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-09-23", "description": "We NEVER order pizza but we had friends over last night and we splurged on some pizza: the caloric supernova.  My favorite pizza in the hood is Lucali's but they don't deliver so we ventured onto Yelp and picked Fascati's.  I was all geared up after reading the reviews on here to have this \"perfect pie\" as some on yelp have referred to it.  Oh! - what a disappointment!   We ordered 2 Napolitana pies: one plain (a good test for any pizza joint) and one 1/2 sausage 1/2 pepperoni.  The pizza was...well...bad.  The sauce nondescript.  The crust was bland.  We will never have Fascati's pizza again.  That old adage - \"there is no bad pizza\" did not apply. There was nothing even standardly good about the pizza at Fascati's.  \n\nThe saving grace from our order was the chicken parm - hence my 2 stars rather than 1.  Now the chicken parm wasn't extraordinary or anything but it was tasty and what you'd expect from a standard chicken parm dish.", "author": "S C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-07-20", "description": "This place was great 15 years ago, but it has really changed.  2.75 for a tiny tiny plain slice, and they rarely, if ever, open their kitchen to make real food!  I asked for a veal and peppers at 3:30 pmand I got turned away b/cthe kitchen wasn't openyet! WTF!  This is a pizza shop--if you are open, your damn kitchen is open!  This place needs to go out of business--b/c the kids of the deceased owners, who were awesome, SUCK at running a business!", "author": "michael g."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-02-08", "description": "We live in the neighborhood and unfortunately have few options for pizza. I really have a love-hate relationship with Fascati's. The food is consistent and very good but their service certainly leaves something to be desired. When I order from the counter the staff is frequently short and rude and when I order delivery the delivery person never bothers to say thank you despite tipping 20%. In my opinion great food is about the entire experience so Fascati's would benefit from focusing on their personnel.", "author": "Katie D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-12-03", "description": "Even though I'm a couple neighborhoods over from Brooklyn Heights, but I still try to stop in at Fascati's when I can; in my opinion, it's the best slice I've tried in NY thus far. The crust and sauce are perfect, which is important when you're just a cheese (or sometimes pepperoni) guy. I could easily do lunch 7 days a week there.", "author": "Sam R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-21", "description": "Slices are too expensive and not particularly distinctive. But it still gets my fourth star because of how tasty it is to get a regular slice and a ricotta slice and alternate bites between them.", "author": "Prentiss M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-07-29", "description": "Seriously...go to Grimaldi's instead. Really. It's only like a five-minute walk from Fascati--it's just down that way, the one with the giant line and all the tourists taking pictures. You can't miss it.\n\nWhy did I give this restaurant five stars while referring you to the competition? Simple--more Fascati pizza for me.", "author": "Michele W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-25", "description": "Really good pizza for the last 30 years.  I used to go here almost every day in grades 4-7 and that was a long time ago.  Now I am back and loving it again.  It is just as it should be, a pizza joint, no different than 25 years ago, but it maintains high quality in the pizza department.\n\n$2.50 for a regular slice and they are the kind of pizza place that actually knows how long to place it back in the oven so the roof of your mouth does not end up feeling like you ate a box of Capt'n Crunch.  The sausage is good too.\n\nThe pizza is not greasy at all and for any type of pizza stomach, 2 slices is really ideal.  One just is not enough and two does the trick without pushing you over the edge.\n\nWhen in a rush, they have a window on Henry that you can just tap on and order through it without ever going in and you have a slice to-go in seconds.\n\nThere is a lot of good pizza in New York, but I had remembered this place through all my travels for 25 years and now come back to it and love it as much as I did when I was a kid.", "author": "Jonathan G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-02-11", "description": "I got off the train in DUMBO very close to Grimaldi's Pizza.  I felt like I could have smelled their pizza.  I crossed over into Brooklyn Heights and there was a very humble looking storefront with no fancy awning or colorful fonts.  I had found Fascati Pizza.  I was first told of this joint by a very colorful customer that I waited on a few weeks ago at The Modern.  His business card proclaimed that he was (among other things) a pizza expert.  And he suggested Fascati.  And so here I am.\n\nI could tell by the atmosphere why he likes this place.  Because you feel like you're at home.  I overheard one couple talking to the guy behind the counter (the owner?) about his newborn babies.  Everybody said hello to each other.  And a caravan of mommies brought their little ones for what I can only imagine is their favorite neighborhood pizza.\n\nNow I'm from a different neighborhood so I was here strictly for the grub.  I was amazed at how little grease was on the pizza and how the steam continued to linger after I let it sit there for a while and cool off. Generally gas ovens (which is what Fascati uses) don't get as hot as coal or wood ovens, but this pizza was smokin' - literally.\n\nIt took a little while for the flavors to open up.  Maybe it was the smoke getting in the way, but the first few bites were rather flavorless.  As I chewed on, the buttery crust really came through (in fact the buttery flavor lingered on my lips as I walked to the R train).  The cheese didn't have too much flavor and I wish there was more tomato sauce.  So many of these slice joints go so light on the sauce so by the end, I'm left with nothing but the bread, which was thin and chewy and quite delicious.\n\nThere was nothing wrong with the pizza really, but there was nothing special either.  I don't think it's worth a trip to the neighborhood, but I can understand why locals enjoy the food and feel welcomed and comfortable.  And I bet, soon enough (when that employee's newborn twins are grown), they'll be running around the shop causing trouble.\n\n-eatthisny", "author": "Brian H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-03-24", "description": "Did you know neuroscientists could rap?  Check it out, yo.\n\nI want me some Fascati's\nCause they know how to pah-ty\nWay better than Grimaldi's\nDat pizza's never faulty\n\nSo hot and good and greasy\nand cheese that's supa cheesy\nYo, throw some olives on my pie\nand mushrooms too, 'cause they so fly.\n\nI'd make the trek to BK Heights\nfrom down in DUMBO any night\nto eat yo' slices 'til I'm full\nthen roll my ass back down the hill.", "author": "Becca S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2006-12-08", "description": "The best slice in the neighborhood, hands down.  It's been around since I was a kid and I remember getting excited whenever I heard my parents mention that name, because it always meant that they were too busy or too tired to cook up something healthy like brussel sprouts and we were going to have wonderful PIZZA for dinner!!!!  YAY, said the little Martha!\n\nIt's something about the cheese that they use there.  Maybe there's an overdose of salt in there, maybe it's crack, I don't know.  Maybe salt is crack's sister and maybe that's why I like it so much.\n\nVery old school vibe there.  Get a grape drink to go with your slice.", "author": "M V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-19", "description": "last time I stopped by to see some friends of friends who were in town waiting on line for grimaldi's (which recently lost all character/charm), I gave them some sage advice: \n\n'order fascati and have them deliver to the line'\n\nthey ignored me and proceeded to wait for another 2 hours for less pizza (amazing pizza, but still) in an environment that to me from the outside resembled a friday's. but enough grimaldi's bashing... go to fascati, order a whole pie (they're huge! and delicious.), bring cash, and make sure you're not there during the month the whole family takes a vacation... because that can be hugely disappointing.\n\non a side note. you know they're doing something right if they can afford to go on vacation and close for a whole month every year.", "author": "Jake D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-12", "description": "Fast, cheap \u0026 good!  Awesome little spot to have right around the corner when you need a quick slice :)", "author": "Christina S."}], "servesCuisine": "Pizza", "priceRange": "Under $10", "name": "Fascati Pizza", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "80 Henry St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/ZhAN47D620KEYSYCv1W1GQ/ls.jpg", "@type": "Restaurant", "telephone": "+17182371278"}