{"aggregateRating": {"reviewCount": 223, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-13", "description": "Great pizza.  NY has become so innundated with artisan pizzas and specialty slices that it has become harder to find a really solid, regular NY slice.  Fascati's does it right.", "author": "Jessie D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2006-08-26", "description": "This pizza place is right next door to the Chinese restaurant, Fortune House (see my review) and is similar to it in that it's a good unspectacular but solid neighborhood joint.", "author": "Neilson A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-03-27", "description": "Basically, I grew up eating Fascati's so I'm biased.  It might have accounted for 10% of my caloric intake and 90% of my yumminess intake between the ages of 7 and 17.  Brooklyn Heights has never been the Italian-American bastion that other nearby hoods were/are, but Fascati represents massively. The pies and slices never disappoint and consistency is king here.  For over 30 years, through a couple of generations, Fascati has turned out a beautiful high-quality product.  While I am a purist, the toppings are great and don't wreck the crust.  The Sicilian slices are good, but the winner is the Neapolitan. Other menu items are tasty, particularly the hot heros.  Salads are generous. Go if you live in NYC. Go if you are visiting.  Go.", "author": "Thomas H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-17", "description": "Absolute perfect crust. Little skimpy on the cheese and no liquor sales so only 4 stars.", "author": "Tawn N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-12-26", "description": "Hands down the best pizza in Brooklyn. It's a shame that the tourist trap called Grimaldi's get's all the attention. well...maybe it's not, let all the tourists go to Grimaldi's and the local's can get a real slice at Fascati's!! I'm not going to go into a 4 hour explanation about pizza, if you want to understand...go there, if you are critical of this place, you don't know what a real slice of pizza is. No offense.", "author": "James J."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-04-15", "description": "The first few bites made me think ,\"wow this pizza is amazing\"...but then towards the end I thought it was okay.  It got a bit dry after awhile for me.  But I'll probably come back again.", "author": "tiffanie n."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2010-09-12", "description": "Hope you aren't hungry now! Every time we order they make us wait over an hour. Usually 1 hour 15 minutes. They are rude and expensive. Their is a taxi service that operates right next door. They idle their cars outside for hours...Fascati keeps their doors open so the pizza tastes like exhaust. There are now several nice places in the neighborhood that offer comparable pizza and for about 5 bucks cheaper or more! Forget Fascatis. Not worth being treated poorly and waiting forever.", "author": "Adam K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-05-27", "description": "When we first arrived in Brooklyn, Fascati's was closed for remodeling or vacation. Its taken me 9 months to get back. It just happens to be conveniently located for jury duty obligations.\n\nThis place is clean and neat. The menu has a variety of pizzas, garlic twists, garlic bread, heros, rolls, and pasta dishes. My pizza slices were reasonably priced. The service was fast and friendly. The heavy lunch time crowd is conducive to shared tables (I ate with two neighborhood Fascati fans).\n\nThe new york style pizza consists of quality cheese, a thin, crisp crust (which is a rare feat). and a bland sauce. The pizza could be nearly perfect with a brighter, spicier sauce.\n\nCondiments might have gone a long way in providing what the sauce was lacking. I'd suggest: black pepper, crushed red pepper, oregano, etc. Fascati only provides garlic powder and salt -- the two things I never add to pizza.", "author": "Nancy S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-13", "description": "I live right around the corner from Fascati, and this place is BY FAR my #1 pick for low price food in the area.  I usually like all sorts of toppings, but I think Fascati makes a great plain slice and I usually stick with that.  It's clean and well run as well.", "author": "Chris J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2007-04-17", "description": "This place has the best slices in Brooklyn (the best in Manhattan is Joe's). Whenever I come back to Brooklyn, I always make a point of going to Fascati's at least a couple of times. I've been going to Fascati's for about 10-12 years now, and have always been pleased. Back in the day, the \"Fascati special\" (2 slices, plus soda can), was only 3 bucks. However, sadly that price has risen to around 4 bucks (maybe even $4.50 now). But, I'm a loyalist and won't let that get in my way of phenomenal pizza. \n\nThe pizza here is thin with crispy crust...simply the best. I think the most amazing thing about Fascati's is its consistency. Whereas some places are hit or miss, the pizza here is consistently between a 9 and 9.7 (higher scores reserved for Grimaldi's). In addition to the delicious pizza, I highly recommend the garlic knots (5/$1). I've also tried some of the pastas a few times and have always found them to be delicious as well. The next time you find yourself in Brooklyn Heights, be sure to hit up Fascati Pizza. You won't be disappointed.", "author": "Jonah P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-05-20", "description": "You will find great, no frills slices at this neighborhood standby. You can walk up here if you're tired of waiting on line at Grimaldi's. Some say the slices get better when they are reheated in the oven.  There's other stuff on the menu, but  I've never been tempted to try anything other than the plain slice (and the white slice, which is also quite good.) They also have a take-out window, which is handy if you have a dog.", "author": "Maureen W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-07-13", "description": "Fascati is phenomenal if you're picking up a slice or two but not so much if you're ordering a whole pie.  For some reason they always put the toppings underneath the cheese so instead of getting nicely crisp pepperoni I get greasy, chewy pepperoni.  Yes, I've asked them not to do that but when the pie is delivered, it's still done the same way.  \n\nTheir mushrooms used to be amazing but not so much anymore.  Still, a great slice.", "author": "Peter W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-22", "description": "They definitely know how to make pizza here.  Just do not expect anything more than pizza.  And don't expect grated cheese either.  :/", "author": "James A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-12-01", "description": "This place is the truth. Loaded with toppings, crisp tasty crust, good prices, and an Yankee hat dress code for employees. What's not to love", "author": "Cory S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-02-06", "description": "It is ok. Nothing great.\n\nI will eat again if I am passing by and hungry.", "author": "Todd M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-02", "description": "Good NY style pizza; and a good price. I order from here all the time. The sauce and cheese are great. My favorite part of the pizza here is the crust; they are thinner then most, and perfectly prepared.", "author": "Layne B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-11-11", "description": "Real Brooklyn pizza at its best.  \n\nIts not fancy, but it's real and it's good.  I mean really good.  And isn't that all that really matters when it comes to pizza?", "author": "Alex O."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-01-04", "description": "Very good pizza but not necessarily worth the wait or the attitude you have to deal with from the staff.", "author": "Ron M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-04-26", "description": "Somewhat frustrating establishment in my mind.  In many ways I love this place, I really appreciate the retro look from the outside and the sidewalk window for ordering is appreciated. However, this place really suffers from a lack of consistency. Sometimes the pizza is outrageously good and sometimes lackluster.  Not only is it inconsistent but it doesn't even have consistency with its faults... sometimes the pizza has too little sauce, sometimes the crust has a crunchy stale taste, sometimes the cheese is unbearably salty... All this having been said, when they get it dead on this is some of the best pizza I have ever had.", "author": "Jeffrey S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2009-05-28", "description": "Only a fair pie. The crust is winsome -- almost cardboard in contrast to Grimaldi's, just down the road.", "author": "Jeff M."}], "servesCuisine": "Pizza", "priceRange": "Under $10", "name": "Fascati Pizza", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "80 Henry St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/ZhAN47D620KEYSYCv1W1GQ/ls.jpg", "@type": "Restaurant", "telephone": "+17182371278"}