{"aggregateRating": {"reviewCount": 223, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-09", "description": "Nice slice in the heights area. The place was busy when we walked up to the outside ordering but we were greeted quickly and our order was ready to go  in 20 minuets .", "author": "Lucas C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-06-29", "description": "This place is so sub par when it comes to NY Pizza. The only advantage is that it's close to the train and rely heavily on tourist and student foot traffic.\nCash only, weird hours, and the pizza is not that great. \nFor a good slice, go to Monty on Montague-- it's a 5 minute walk away but the pizza, ambiance, and service is WAY better. They also accept credit/debit cards.", "author": "Mastershot F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-24", "description": "Those tiny pepperonis tho....  One of the last true NYC slice joints.", "author": "Chris D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-21", "description": "If you walk over the bridge from Manhattan and need to refuel for the trek back, this is the place.  Convenient location near the bridge, excellent thin crust and tasty traditional toppings - we tried the pepperoni and the anchovies.  Best anchovy pizza I've ever had (not that I eat it all that often, but this was really good).", "author": "Ted P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-31", "description": "The Large Pizza is enough for at least two people. It tastes good but its nothing Special. The toppings are kind of overpriced (Garlic 2$ Basil 3$). The Service is good and i quite like the ambience.", "author": "Philipp O."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-06", "description": "Forget the Lemmings. The Real Pizza is Here.\n\nThere are about 50 lemmings waiting in line at Grimaldi's a few blocks north. Let them swoon on a chase for some stories. At Fascati's, you got the real thing.\n\nHere it's outstanding cheese and sauce. The cardboard-like crust brings you back. Some may take offense, but if you embrace it you may find love.\n\nOpened: 1971\nDistinction: Crust. Realness.", "author": "Jeff O."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-09", "description": "This is yet another great classic NY slice-joint pizzeria in Brooklyn, and in many ways could serve as a companion to my recent review of Antonio's pizza on Flatbush Ave.  Both are classic NYC slice joints in virtually every way.  Both have been vital neighborhood assets for roughly half a century at this point. Both of their respective locations are right atop busy Brooklyn subway stops.   This doesn't  simply enhance the classic New York vibe, but crucially it also greatly increases the odds of you getting a FRESH slice rather than a reheated one.  As I have reiterated countless times over the yelp years, you know that I strongly advocate of doing whatever possible to acquire a slice of a pie freshly pulled from the oven, as opposed to one that is reheated after sitting out sometime in the display case.  Some say the reheating it with a pleasing crispness, but I would make the argument it is at the expense of flavor, which for whatever reason decrease at least by 1000x during the reheating process.  The pie here has a nice salty/creamy consistency with a sauce less sweet then many pies across town.  It reminded me of the pie at the UWS's great Sal \u0026 Carmines, and that is always a very very good thing. \n     Like I sid the place is classic NYC, particularly the exterior.  The combination of the vintage sign of the neighboring Chinese is so picture-perfect, you may feel that you have been transported into a  70s Woody Allen film.  Inside the 70s vibe continues with hideously great wood and formica everywhere, showing everyday of its 50 something years.  The staff is efficient as it gets and keeps things moving as well as the pies happily fresh.  This Neighborhood skews older in most senses of the word and stepping in here in particular gives you the small comfort in the fact that in a city, and a world that is constantly changing in drastic and sometimes incomprehensible ways, that some things, and particularly good things manage to stay the same.", "author": "Brendan T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-22", "description": "Mini pan pizza, repeat- mini pan pizza. Three little words \u0026 you will die and go to pizza heaven. Where do I begin. Fascatti's- good neighborhood slice joint. Old style plastic booths. A little hot in warmer weather. They have a great system here. The workers- mostly Mexican make the pizza and the owners watch the pies. They use a good, fresh dough here so all slices are \"Brooklyn good.\"\n\nThe mini pan pizza is $7 and made to order. It takes fifteen minutes. You know who makes it and watches it till it's done. It comes out beautiful- deep dish- that is what this is, made just for you. The sauce is a little sweet, the cheese is super fresh and oozing. Enough for 2- this is a formidable pizza and one of the best old school pizzas, I have ever eaten. I just can't get a regular slice after this. Bingo!", "author": "Franny A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-11-13", "description": "Pizza is fine, but the service is really annoying.\nMy phone was on really low battery and asked if they can help me charge my phone, especially that i was dependent on it at the moment. No help whatsoever, no even a willingness to help. \nPlus they don't have restroom.", "author": "Astghik P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-07-27", "description": "CASH ONLY \n\nThis place makes a pretty serviceable pizza but is nothing special.  Unfortunately, there actually are not too many quick take out pizza places in the area.  \n\nThe pizza here is generally a little more thin then I would have liked.  The taste of the pizza is pretty good but there is nothing here that is going to have you coming back.  Try Front street pizza around the corner for faster service, more seating, and more pizza variety.", "author": "Ryan R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-05", "description": "Fascati is one of the first places I stopped into when I moved to Brooklyn Heights. And it was a pretty tasty introduction to the neighborhood! \n\nThe cheese slice at Fascati gives you exactly what you want out of a NY slice -- nothing more, nothing less. Is it super memorable pizza? No, but that's ok. Because at the end of the day when I'm craving a greasy bite of childhood, Fascati does the trick.", "author": "Shannon G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-07-17", "description": "The pizza was pretty good, but it's NYC. Good pizza isn't very hard to find. The reason they get 1 single star is their service. \n\nHow do you run a pizza joint and not have any Parmesan or black pepper???? Really, how is that possible?! And you only take cash??? I could understand if it was a stand, but a brick and mortar shop and cash only?? \n\nGuys there look miserable. Too many guys behind the counter scrambling. Why have five just bumping into each other wondering wtf each of the other is doing, when you don't need more than three. \n\nWon't ever come here again. Too many other great pizza places.", "author": "Pablo F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-30", "description": "At $2.75 per cheese slice, it's a little steep, but the pizza is good. The sauce is flavorful, with some small tomato chunks and a hint of oregano. The cheese is a bit on the salty side, so definitely get a beverage. \n\nThe crust is very thin, but not so thin that the slice flops around in your hand. It's a nice crunchy finish to a meal.", "author": "Jack L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-17", "description": "Delicious Pizza! Go try a slice or two! In the winter it's exceptionally delicious piping HOT! The sauce is delicious and crust is crispy!", "author": "Tony C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-07-18", "description": "Dry. Maybe it had been sitting out for too long. It needed more sauce. I'd possibly try a slice with additional toppings if in a pinch. That might help. Cash only. $2.75 cheese slices.", "author": "V M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-11", "description": "Best NY style place in the vicinity. Thin crust, slightly tangy sauce, weird hours, cash only = old NY in a nutshell. It's a pizza joint, not a charging station, grated cheese purveyor, or support group. If those things are more important to you than the product, go somewhere else.", "author": "David G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-13", "description": "Stumbled upon this place on our way to Brooklyn bridge... so good! Satisfied our NY pizza craving!", "author": "Zulay C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-05", "description": "I've been working in Cadman Plaza for the last two years and looking for the best pizza spot for lunch. At first I thought Monty's was the only okay option until one day someone put me onto Fascati Pizza. Its a small shop that specializes in thin crust pizza with a great sauce. They also use quality ingredients, their pepperoni is a step up from that used at Monty's and the other places in the neighborhood. \n\nOnly thing is that sometimes its a hassle finding seats at lunch, but most of the time the customers are friendly and we make it work,", "author": "Justin F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-18", "description": "This place was great! I had a regular cheese slice and a white ricotta slice - both delicious. Very reasonably priced - fed a family of 4 (including a male teenager) with drinks for under $30. Service was good. Would be nice if they had Parmesan cheese, but it didn't bother me much that they didn't. Would definitely recommend. FYI - it is cash only, but well worth it!!", "author": "Gina B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-08", "description": "Best pizza ever. Whenever I am away for work or vacation this is my first stop back in NY. Cash only and they take the entire month of August (and some of Sept) off.", "author": "Steve N."}], "servesCuisine": "Pizza", "priceRange": "Under $10", "name": "Fascati Pizza", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "80 Henry St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/ZhAN47D620KEYSYCv1W1GQ/ls.jpg", "@type": "Restaurant", "telephone": "+17182371278"}