{"aggregateRating": {"reviewCount": 223, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-04", "description": "Our go to local pizza stop.  Solid pizza that's definitely better than your typical pizza.  The white slice (ricotta cheese on top of a cheese slice) is excellent, and their special pies are solid too.\n\nYou definitely can't go wrong with Fascati, and while Grimaldi's is better (in my opinion), you don't have the long lines and wait.", "author": "William S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-14", "description": "Get the meatball hero. Awesome. \nBread is soft and chewy. Meatballs have great flavor and are light with perfect texture. Crazy good, not messing around. \nPizza is really good. Not all puffed up. Get it well done with a little burn on the crust. Trust me. \nService isn't bad at all, not necessarily friendly, but so what I'm not looking to be friends.", "author": "Ben P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-23", "description": "Great Pizza. It's not the artisonal genere of pizza but just great delicious tasty pizza. \n\nCash Only.", "author": "Evan G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-03-10", "description": "Pizza was delicious. However, one of the chefs kept on playing on his phone then making the pizza. And if he rides the subway here, I just ate a subway-pole-pie", "author": "Kyle L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-05-31", "description": "Mediocre pizza, bad service = avoid. \n\nI heard a lot of good things about this place but after a few tries I will get my pizza from somewhere else. Seems like getting a decent NY slice is impossible no matter how overpriced a place might be. \n\nI ordered two slices, one plain and one pepperoni both were greasy, soggy and salty (despite the lack of added salt). Tto add insult to injury - I asked for a small box to accommodate my two slices and was charged an extra 25 cents! \n\nI'm all for supporting local businesses and was hoping I had found a new pizza spot to frequent during the work week - boy was I disappointed.", "author": "Jaydie O."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-07-09", "description": "I don't know what happened to this place.\nThe original owners kept the place great and pizza was always on point. Now everttime you go there it's hit or miss as to I'd they are open or not. The guys running it all have nasty attitudes and pizza is definitely not what it used to be. I can't believe that this is the only pizza place in that area. Sad", "author": "John D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-01-25", "description": "This is a nice pizzeria where I occasionally will get a cheese or white slice. The pizza is a bit on the salty side. Wouldn't eat it everyday but its nice to have it every now and then. They use an authentic wood-burning oven to make their pizzas which impart a nice smoky flavor. \n\nService is not that great and the people working there always have an attitude. I'd put with the attitude if the pizza was 5-stars BUT it's not that good. You can find way better pizza elsewhere in the Brooklyn. This is probably the best pizzeria in Brooklyn Heights BUT that's not saying much.", "author": "Jimmy G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-08", "description": "This is really great, thin crust pizza. I love this place \u0026 just being near it starts a craving. Old school for sure. I hope they don't get run out by high rents \u0026 trendy food.", "author": "Lucia P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-07", "description": "When I first moved into this hood in mid-August Fascati was closed for the summer which resulted in a near 3 week pizza hiatus for me. While Monty's is also a quick walk, the lunch time work crowd is just not for me. \n\nDuring their first few days back I came through for a slice and a bottle of water. For a pretty simple order it could not have been more disappointing. The pizza crust was cardboard-y, the sauce was meh and the water was ridonk expensive. I was done.\n\nThen comes football Sunday and the BF orders in an entire pie, an order of garlic knots and an order of baked ziti. Changed my world! Everything was AMAZING. The following Sunday the BF orders a sicilian pie. Again, amazing!\n\nI've heard similar comments from other people, that the delivery orders and the dine-in food are incomparable. I dont really get the dynamics behind that but whatevs, you've been warned. \n\nSide note, their root beer sodas and red juice are a must. \n\nCASH ONLY", "author": "Cydney T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-17", "description": "We love the flavor of their garlic pizza, with pepperoni \u0026 mushrooms. After comparing it with other gourmet pizzerias like Lombardi's \u0026 Grimaldi's, Fascati's garlic pizza tasted better. It was the underrated pizza that ran out first at our pizza parties.", "author": "Rick H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-23", "description": "Basic, great food.  Slices are good, but Chicken Parm is better.", "author": "Laura W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-08-11", "description": "My mother and I used to have mouthgasms at the mention of Brooklyn \n\nPizza. Every trip into the city would mean delicious to die for pizzas from our \n\nfavorite joint- Fascati's  We would gush at the mention of the warm flaky tender \n\nthin crust gooey joy that only Fascati's could deliver. Until our beloved joint \n\nshredded us to pieces- literally. \n\n To be fair, my mother had ordered three \n\nslices to go a few nights prior and it most certainly delievered...We \n\nhad family guests over and thought why not order a bunch of subs and a large \n\npizza with mushrooms added.? The subs were fine;however the pizza was honestly \n\nthe most atrocious thing we had ever consumed...It appeared they had reheated \n\nit...It was basically a biscotti pizza ( as in twice baked) with same shrivled liver \n\nontop ( I guess mushrooms). I called and complained and told them it was burned-  \n\nthey blew me off. My mother called and complained and told them if we spent $40 \n\non a pizza and subs the could at least resend a new pizza since the last \n\none was overcooked and inedible ( we couldn't even fricken fold the pie)- the \n\nmanager responded: \" The last girl said it was burned and I personally inspected \n\nthe pie. Don't tell me you know pizza better then me\" . And HUNG UP ON HER.. I \n\nwas so pissed I walked across town after our guests left in the ninty degree heat ( \n\nwhich is WHY WE ORDERED OUT) to show them that indeed THE PIZZA WAS \n\nINEDIBLE. I walked into the resteraunt with the pie. They kept me waiting for ten \n\nminutes. Then the manager took me aside opened the pie and said , look, I know I \n\ntold your mother, I'll tell you, THERE IS NOTHING WRONG WITH THIS PIE. I was \n\npissed. Especially since I can't believe he couldn't even inspect the armagaedon \n\nthat had taken place on the crust and most of the bottom surface....So I said as camly as possible, okay this pie is inedible were not going to be eating it do If you won't reimburse us a pie or cash value then I'm leaving ir here. He grabbed it and said FINE. Took it to the back room where I'm pretty sure he doctored it up and resold it as a choking hazard to his poor customers and made double profits. Honestly, I hope no one died. I also hope that this review insures that no one eats at such a rude, low class neighborhood joint that disrespects its customers and made my family have indigestion for the rest of the day. \n\nAlso, forgot to mention, the subs weren't even that great because my grandmother has a sensitive stomach and they never listed there ingredients....Tomato sauce and her do not agree and , well, to say the least her pepper sausage sub and her had a fight and the sub won. So no one enjoyed there food. And someone may have died in the process of me returning the pizza. \n\nMoral of story: don't ever go to Fascati's.", "author": "Gaia P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-18", "description": "My Lord I love this place - it's the kind of establishment that justifies my move to NY.\n\nThe irony is that it's so hard to find a real New York slice in New York anymore, but here it is - the perfect crust, sauce, cheese, toppings, amount of grease, ALWAYS CRISPY FRESH.  \n\nWhat makes this place perfect for me is that if you order a slice with peppers, you get huge, juicy fresh slices of longitudinally cut red pepper.  \n\nAlso, some of the pasta dishes and heroes are delish.  I highly recommend the pepper and egg hero - and halfway through an order of ziti with tasty sausage and the aforementioned red pepper, I could have died pretty happy.", "author": "Seth P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-18", "description": "I grew up across the street from this place.  I went back last week and the place is EXACTLY the same as it was in 1981.  Old school.  I suppose the pizza doesn't drip orange oil like it used to, but that's okay with me.", "author": "Cate R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-11", "description": "If you are heading down to Brooklyn Bridge Area and want to save time, money and hassle of tourist traps, take the short walk to Fascati Pizza.  Local join servicing more residents than visitors.  Not as trendy but very high quality and flavor.  In truth THIS is more authentic New York Pizza than the big guys under the Bridge.", "author": "Michael F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-03", "description": "Fascati's is the quintessential NYC pie place. It's the best in the area. It has nothing to do with grimaldis. This is the place you call up where you just want a pizza... Soon...  Hot... Freshhhhh.\n\nYes, the mushrooms aren't local organic and fresh--but does that mean the perfectly balanced slices don't hit the spot? I didn't think so.", "author": "Annette C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-05-11", "description": "The pizza here was good. I got a white slice with dollops of ricotta and the hubby got a traditional Sicilian square slice. We were both happy with our choices; however, after waiting 15 minutes for them to open, there seemed to be a disconnect in the service arena. \n\nFirst, no one person made it clear that they were taking orders. So I finally pointed out the slices we wanted to one of the guys while another took my money and between my ordering the pizza and getting it, he took TWO other persons' orders (obviously regulars- so I can sort of understand), completed their transactions, and gave them their pizza. It was so strange and a bit insulting to tell you the truth. Esp. considering I had the pizza and just needed to pay!\n\nI like the addition of their own drinks- we got a tasty root beer. All in all, I'd still go back, but I thought the service was worth mentioning because it was so strange.", "author": "Angela E."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2007-06-13", "description": "Before I get to the review, a complaint: I've been in NYC for four days.  It's looked like it was going to rain every day, so I've been hauling around an umbrella.  Today, I leave without it and, as I'm carrying my pizza back, it starts to rain.  So awesome.  Don't worry: the pizza was fine.\n\nAnyway, I'm staying in Brooklyn, and had to get some pizza.  Fascati was well reviewed here and it's close to the mediocre $400/night hotel I'm at, so i figured I'd give it a shot.  I'm glad I did: it's pretty good pizza.  The crust is thin, brown on the bottom, and the sauce is great.  It took about 10 minutes for a pizza. A small with a salad was $19.  And that small could feed three people, easy.\n\nBut is this the best pizza in the universe? Meh. The pepperoni slices were small, which I like, but the mushrooms were freaky. (Canned or sauteed and then left to sit a while.  Everything else looked fresh, so why not the mushrooms?)  Worth noting, however, is that some of my local Chicago pizzerias could take a lesson from these guys on how to do a decent garden salad.  Yes, it had iceberg in it, but it also had tomatoes, green pepper, onion, cucumbers and what tasted like a fresh, made very recently vinaigrette.  \n\nOverall, not the end-all-be-all in my pizza universe, but very decent.", "author": "Reid C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-12", "description": "Initial feelings were negative, but I warmed to the place. Pizza is a little bit spendy but worth it. You can taste the quality ingredients especially the sauce and dough. It was a little warm in there as they lacked a/c--so not a great spot if it is really hot out. You can go by the slice or whole pie.", "author": "Jon H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-04-06", "description": "I don't recommend the eggplant parmigiana. Too much bread, not enough sauce. Eggplant itself is tasty. A bit floppy, but not bad. Flavors are good. \n\nThe pizza looked great.", "author": "david j."}], "servesCuisine": "Pizza", "priceRange": "Under $10", "name": "Fascati Pizza", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "80 Henry St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/ZhAN47D620KEYSYCv1W1GQ/ls.jpg", "@type": "Restaurant", "telephone": "+17182371278"}