{"aggregateRating": {"reviewCount": 223, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-03", "description": "This little establishment does not look like much from the outside, but it's served me the best pizza I have had in a while. I love that it's only a few minutes away.  They are like the opposite of Grimaldi's- very under the radar, no long waits but excellent pizza, made by people who have been doing it for years.    I should also add I'm not a huge pizza fan in general, Il'l eat it, but it's nothing I look forward too, Fascati  however is something to look forward too.", "author": "Tara K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2007-01-08", "description": "Fascati's is the bomb diggitty and then some. I've eaten probably upwards of 200 pies from there over the past 4 years, not to mention they've got the meanest meatball parm this side of gardenia. Also, in a neighborhood somewhat devoid of decent delivery, in a pinch you can get a decent spaghetti \u0026 meatballs or sausage from them. I recomend topping your pie w/ ricotta and sausage - divine! It's the more BK pizzeria alternative to Grimaldi's, which is equally divine in a different way.\n\nEvery time I pass by Fascati's in August during the summer closing and see the sign that they are closed for vacation, I cry a little.\n\nMartha, they definitely put crack in their cheese.", "author": "Justin C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-02-20", "description": "My friend and I got off the train to head to Grimaldi's, and took a moment trying to figure out which direction was south when a Brooklyn native took a moment out of his busy schedule to chat it up with us.\n\nBrooklyn Dude (BD): The good part of the city is right over there (points).\n\nMy Friend: Cool, hey which way is Grimaldi's?\n\nBD: You're going to find it down that street, but let me tell you, you're going to find much better pizza for half the price at Fascati's (points in the other direction).\n\nMy Friend: Oh ok well-\n\nBD: And at Grimaldi's you're going to have to wait an hour and order a whole pie.\n\nMe: Yeah I know I've-\n\nBD: The only people who go to Grimaldi's are tourists.  Which you guys very obviously are.\n\nMe: ...Look, I just I need to know which direction is south.\n\nBD: (Points over my shoulder) and walks away.\n\nLo and behold, after 40 minutes in line at Grimaldi's I ended up back at Fascati's anyway, half expecting to see the Brooklyn snob grinning behind the counter.  Anyway, the pizza was good, but not amazing.", "author": "Philip N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-10-18", "description": "Definitely the best slice in Brooklyn Heights...and probably in the vicinity too.\n\nI usually just get two slices of cheese and a soda -- I definitely miss their special though which was a killer deal -- about 6 months ago you could get that for $5.  \n\nBut the pizza is consistently good -- cheese is good and the crust is just perfect.  I kinda wish there was more seating though.  And I tend to forget that the place is closed on Mondays.  Ugh.  I live like 3 blocks away and sometimes I forget and I have my Fascatis craving only to walk up there and see it closed.  I only stick to their pizzas, but they offer a variety of subs and heroes and they look pretty amazing.", "author": "Victor S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-04-11", "description": "The inevitable pizza comparison!  My friend and I went on a little pizza tour over the course of a few days and tried Fascati, Bleeker St. Pizza, Ray's Pizza (in NoLita).  I've also had Grimaldi's, Lombardi's, and John's Pizzeria.  This is not counting My Little Pizzeria, which is my regular pizza joint, being one block from my apartment or Lucali's, which I haven't tried yet.\n\nOf this formidable collection, I have to say, Fascati is my current favorite.  The crust is perfectly crisp underneath, and overall nicely chewy and flavorful.  The cheese was gooey.  The sauce was great.  I was also really impressed with the white ricotta slice, with thick portions of creamy ricotta (no wimpy dollops here).  \n\nIncidentals?  The service was friendly, the other customers were willing to share the red pepper flakes, and pizza was so good we had to trot out to the ATM across the street so we could order seconds. \n\nThe others on the list -- well, Bleeker St. Pizza is probably the runner up.  Their slices were deeelicious, and the sicilian slice looked like heaven.  It would've been perfect if the crust hadn't been overdone.  Grimaldi's is a great experience, but the line and the lack of slice-availability sort of detract.  Lombardi's is great for a plain pie, but as soon as you add some toppings on it, my experience is you get a soggy and overloaded pie without enough crust to hold it up.  Ray's was nice, but the crust was sort of flavorless and a little too thick for my tastes.  John's Pizzeria was good (there's no such thing as bad pizza, in my book... well, unless you're talking about Domino's) but unmemorable.  \n\nNow, now, now, I know pizza-preference is a highly controversial (lol) and very personal decision... but unless my forthcoming Lucali adventure is mind-blowing, I'm gonna have to say... Fascati Pizza, IMHO, is the best in the city.  :)", "author": "Kyu K."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2008-07-23", "description": "after reading lots of good to great reviews of this place, I have to say that I was severely dissapointed. I wasn't expecting anything out of this world (I hadn't heard anyone paint it as the best pizza in new york, by any means), but I was expecting a good little neighborhood pizza place with decent slices (since no one else in the neighborhood offers slices, that was my main incentive). \n\nit wasn't horrible, but really, when is pizza ever truly horrible? it's bread with tomato sauce and cheese... no matter what goes wrong it's pretty tough to make a repulsive pizza. but with so many options for the stuff in new york, I don't see why anyone would come here regularly. I had one pepperoni and one cheese, and both were about as limp as a wet dishrag. should have gotten takeout from grimaldi's instead.\n\nI'm sort of miffed. what's the deal? am I missing something (maybe their whole pies are better) or am I just alone in thinking this place isn't anything special?", "author": "Caroline N."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-04-17", "description": "This place would have 1 star- but I tossed in another for the affordable calzones which are as big as your head.\n\nStaff does not comprehend simple orders.\n\nPizza is revolting.  There is a reason people pile outside Grimaldi's a 10 minute walk away.  Even Monty's on Montague St has better pizza! Less \"New York style\" but I'd take that over the tough, bready crust with disgusting sauce and barely any cheese.  I'm serious.  I have left this place a long time ago, but it still astounds me to see people inside.  Likely because it is the only pizzeria on the Henry St. stretch.\n\nYou want real pizza? Go to Vesuvio in Bay Ridge.", "author": "Diana K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-08-18", "description": "This is one of the best slices in the city, hands down.  The plain slice is perfect.  The dough is always crispy on the bottom and gooey under the slightly salty and oily cheese.  The sauce compliments everything by having just the right amount of sweetness.   When I think of quintessential NYC pizza slices, I think of Fascati's.    If I am getting take-out or delivery, I often prefer their 7\" pan pizzas, as they survive transport a bit better.  When you get delivery or takeout of their normal pie, the dough rises and gets a bit thicker during transport which makes it not as awesome.  The pan pizza still states amazing after a delivery, and has a nicer dough texture.  \n\nI haven't tried their pasta or hot sandwiches, but I assume it's at least adequate.  Their spot was one of the first in Brooklyn to recently receive an A in the health inspection rounds, so you know it's clean.  Anyway, do yourself a favor and get a true NYC slice here.", "author": "Peter K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-03", "description": "After walking the Brooklyn Bride, my husband was craving a slice of pizza. We came here because of the Yelp reviews and were not disappointed. Pizza was hot and delicious (though Chicago Style is better). You can also watch them make the pizza.", "author": "Meredith B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2007-01-31", "description": "I love this pizza.  I love this pizza so much that I still have their number in my cell phone and I haven't lived in Brooklyn Heights for over a year.  I know that Grimaldi's is the big thing in the  area but when it comes to 2 slices and a soda for $4.50 nothing can compare.  \nTry their meatball subs as well, they're big but I always managed to eat the whole thing in one sitting.  \n\nIf you're in a rush you can even order through the window, grab a slice to go.  The staff is great, very friendly small town feel.", "author": "drea c."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-06-22", "description": "Disclaimer: I grew up in Brooklyn Heights and have been eating Fascati's since, well, since I was first eating. If you are at all into pizza, especially if you are into the \"best pizza in NYC\" thing, go to Fascati's. Just go.\nNo, it's not an amazing interior, and no, I don't think I've ever gotten anything there but the pizza, but it's Brilliant. If you can manage it, get a slice that's been cooked, cooled and then needs to be reheated, I don't understand the science, but it's better that way. Delivered pizza doesn't seem to be as good either.\n\nBut seriously, if you don't like Fascati's Pizza, just get the hell out of Brooklyn. Really, I'm fucking serious. Take the train, get in a cab, or walk over the Bridge, but leave Brooklyn, because you, asshole, don't deserve to be on the majestic shores of the 718...", "author": "Rudolf S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-11-01", "description": "yes, just A-OK. not so impressed with this pizzeria that has been in the area for more years than many can remember. the pizza is just average. wish the pizza was better, as we bought quite a few pies. one point that was really bad was the pepperoni, it seemed to be quite a cheap meat, that was a big mistake. front street is a better option.", "author": "J P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-07-02", "description": "I was in town on business and purposely chose to stay in Brooklyn to get out of the hustle and bustle that is NYC. Being by myself, I wanted a place that I could find individual slices and not whole pies. Based on the Yelp reviews, Fascati's seemed like the place to go. \n\nThey had a couple of pizzas on the counter ready to go with toppings. I ordered two slices: 1) pepperoni and olives with 'red sauce', and chicken and mushrooms on my 'white sauce.' I was disappointed to find out that their mushrooms were canned and not fresh. Is that typical for NYC?\n\nWhen it comes to pizza crust, I enjoy a variety of crusts--thin, thick, medium, chewy, crispy, whatever, as long as it's done well. Their crust was medium thick and crispy, not thin and limp like what I had envisioned for a NY-style pizza. (You definitely can't fold it half like I always see people do on TV with NY-style pizza.) Although it wasn't what I expected, it  was a nice change of pace in terms of crust.\n\nOverall, the pizza was good, not great, but I definitely felt like I got my money's worth. I would go back if/when I'm in the area again.", "author": "Patrick W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2007-01-16", "description": "An old-fashioned (I'm talking 1960's, not 1910's) no-pretense pizza joint.  GREAT pizza. Hot, cheesy, consistently good everytime I've eaten there.  I've only ever had cheese pizza, because it's so damn good that I never want to try anything else.  Grimaldi's is good too, but there ain't no fresh mozzarella slices and basil at Fascati's!  And I like it that way, when I'm in the mood for it.  (i.e. always)", "author": "Mark H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-01-19", "description": "This place is Aiiight\nTruthfully, expecting a little bit more just from the location and the longevity of this place.\nBut, its wasnt bad and I might even stop back in next time im in the area buying  illegal viagra (look for jimmy under the Watchtower walkway).", "author": "Andrzrej K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-03-12", "description": "The eggplant was soggy and the breading was damp.  Very bland.  The pizza was sub par.  Once and last time:(.", "author": "Jesse C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-09-05", "description": "It's Pizza, what do you want?\nI've gone in at all times of the day and had a decent slice with no complaints. great for a quick lunch, or a light dinner. Good crunchy crust and a good sauce to cheese ratio. The white slice is also pretty good. \n\nThe place is often crowded, but it's easy enough to stop a guy behind the counter, hand him a $5 and yell \"2 for here.\" \n\nThe only time the slice is ever mediocre is after a long re-heat. But even then it remain good for a while after being \"fresh.\"", "author": "Matthew K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2007-01-08", "description": "I grew up in the Heights and just moved back after a 6 year absence. \nA lot has changed - new stores, more people, different resturaunts.\nFiscatis hasn't. Consitentley delicious and fresh pizza. The price of a slice has gone up (since I was 5) but thats about it.\nAlso, delicious italian ices in the summer.\nNote: If you like toppings, best to order a pie - otherwise they just stick them on and put the slice in the oven again.", "author": "Aaron Q."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-05-01", "description": "The only pizzeria in the neighborhood in my opinion.\nPatsy's/Grimaldis is over hyped and over priced.\n\nFascati is a Brooklyn Heights staple.  One of the oldest businesses in the neighborhood (a long with Mr. Video on Clark St.) that still contribute and are responsible for keeping that old school feel of a community to the area.\n\nThis is an old school type of pizzeria so don't expect to be able to get crazy toppings on your slices or pies.  \nThe pizza is delicious of course, and their other hot dishes are excellent as well (love the stuffed shells!).\nAnd their calzones are fantastic!\n\nThe service is fast and friendly (Jeff and Mike are great!) and it is always a pleasure to go in there.\n\nI have been going to Fascati's for over 20 years and hope to be going there for 20 more! \n\nThanks, Fascati!", "author": "Dean R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-06-04", "description": "Just ok for me.  They have nothing on Totono's!  I am admittedly a born and bred Brooklyn pizza snob (yes we make the best pizza in the world - get over it!).  The slice I had most recently was rather dry and lacked cheese.  I remember it being better the previous few times;  but still nothing amazing.  My Little Pizza ob Court Street is the best value for a regular unpretentious good slice of pizza.", "author": "Scott C."}], "servesCuisine": "Pizza", "priceRange": "Under $10", "name": "Fascati Pizza", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "80 Henry St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/ZhAN47D620KEYSYCv1W1GQ/ls.jpg", "@type": "Restaurant", "telephone": "+17182371278"}