{"aggregateRating": {"reviewCount": 223, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-05-25", "description": "Ordered up two pies to go, one pepperoni one half and half with cheese. Pizzas were hot, greasy, crispy crust, pepperoni was spicy and salty. Folded it up, and it went down smooth like Johnny Walker Blue. So freaking delicious. They also have great sizes, the large pizza can feed 3-4 big dudes and the slices are super generous. I love when the grease soaks through my plate, because that's NY pizza. No artisan, no frills, no fanciness, no pretentiousness, and delicious.\n\nMy heart is already skipping beats (ate 3 bigass slices).", "author": "Jon H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-04-22", "description": "Its pizza.  But its not good pizza. its just average pizza, not even really that good for average pizza.  Its average in the same way that a C is a good grade in school (its really not).  This is usually ok.  I'm usually fine with average pizza, in fact, I'm fine with below average dollar pizza...wanna know why?  Because it costs a dollar.  I'm not picky, I'm ok with eating cardboard with a thin layer of sauce and a sprinkling of cheese on it if it costs less than a ride on the subway.  In other words, I'm ok with getting what I paid for.  \nBut Fascati thinks that because they are located in beautiful Brooklyn Heights that they can jack of the price of a mediocre slice to 300% of what its worth.  If this place was located next to a 2 Bros they'd be out of business.  \n\nAgain, the pizza was ok, under normal circumstances they would get a 4 star for being a pizza place that sells pizza... but it wasn't worth what they charged for it and they are taking advantage of the neighborhood.  Poo poo on you", "author": "Dan L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-07", "description": "A really solid slice. Tasty, with great cheese to sauce ratio.", "author": "Josh B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-17", "description": "I walked over the Brooklyn Bridge and was heading to Grimaldis Pizza until I saw the line and almost fell ova when I was told there was a 45 minute wait. While I was walking back I noticed people coming in and out of this place so I decided to give it a try. I'm sure glad I did.\nThe staff is super nice and very quick. I ordered a slice of cheese pizza and loved it. It was perfectly cooked. The crust was nice and crunchy and perfect amount of cheese on it. I am a fan and will be back", "author": "Allison F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-17", "description": "This place has one of the best unremarkable slices of pizza in the city.", "author": "Justin G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-07", "description": "A really good pizzeria in Brooklyn. However there is many good pizzerias, this one stands out. Try the plain margerita pizza style. The mozzarella and the tomato sauce . Anyway, their homemade cokes are really good too.", "author": "Ethan F."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-02-16", "description": "Fascati's used to have the best slice in the Heights/Dumbo area. Over the years the quality has just gone down hill. Sauce is too sweet, cheese is bland, crust tastes like yeast and everything needs salt. \n\nThey were doing something right for years and that is why the pizza place stood the test of time against rivals like Ignacio's or Patsy's. They need to go back to that formula.", "author": "Steven G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-05-17", "description": "The good reviews of this place led us here after a walk across the Brooklyn Bridge.  Although we considered Grimaldis we really only wanted a slice - which they don't offer. What a mistake. We couldn't wait for authentic New York style pizza and this was such a disappointment. The pizza was well below average, and the crust/dough tasted like it had been frozen. There was really nothing good to say about it.  I've had better frozen pizzas from the grocery store. If you are looking for a pizza place in Brooklyn go to Grimaldis (even if you have to get a whole pizza) - we had it later in the week and it was 100% better.", "author": "Mary M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-01-07", "description": "Since leaving NYC, my taste in pizza has changed.  I guess my standards have been lowered, and I will accept many different things as \"pizza\".  \n\nWe ordered from Fascati the other night.  I am very indifferent about this place.  The pie was just OK.  Nothing memorable, but nothing I would call bad.  \n\nI uploaded a picture since without it, I would not be able to write a review.", "author": "Steve L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-10", "description": "Fascati lives up to it's hype. Opened in 1971, Fascati is one of those neighborhood gems still run by the same family. \n\nThe pizza, which isn't expensive, starts at 2.50 a slice, while toppings are 75 cents each. I just want to stress how simple ingredients can work together to create something wonderful. Cheese, tomato sauce, and a thin crust of dough are really the only ingredients you'll see or taste on their basic slice and that's really all you need. Like any traditional New York Pizza, the crust is so thin you can fold the large slice in half.\n\nThe toppings aren't amazing (they basically throw some toppings on your pizza and then heat it again), but they do add an extra bit of depth to the pizza.\n\nI think Fascati's a joint you should always check out if you're hungry and in the Brooklyn Heights neighborhood. Though I would not go out of my way to have it, I truly enjoyed their pizza.", "author": "Dawei L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-06-17", "description": "Sorry but who does not give parmesan cheese for you pizza???? This is a pizza shop wth? One star for this no matter how good the pizza is and its meh! Walk down the block to grimaldi's trust me its worth buying the while brick oven pie !", "author": "Robert A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-15", "description": "Best Pizza in town been a loyal customer 20 years. I get the large pie light sauce well done . Also the house special sandwhich great !!!", "author": "Napolean P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-28", "description": "One of the best slice places, especially when it's a fresh one. Go for the plain since they sometimes take the topping request literally.  I once got a plain slice with a spoonful of green peppers on it rather than a slice of green pepper pizza.", "author": "Cindy C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-06", "description": "We ordered yesterday for the first time. I was at the pier and the kids got hungry so I searched for the closest pizza shop that's would deliver to the pier but that was hard. Until fascati saved the day lol. It was really amazing pizza. I'm a newyorker and it's definitely in my top 5. The delivery man couldn't find us but he was very nice. Thank you so much for delivering us tasty pizza. Can't wait to order again.", "author": "Amina A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-27", "description": "Best Sicilian i've ever had (though i'll admit, I haven't had spumoni gardens.) Regular pizza is great too. nice staff", "author": "Bethany W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-08-13", "description": "Terrible pizza. Only would come here as a last resort. I overheard a local pedestrian one time exclaiming this place was the best pizza in Brooklyn....definitely not.", "author": "Cindy K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-12-14", "description": "The slice at Fascati is a strange beast. Fresh out of the oven, it's a shining example of New York pizza in all its glory. It's when you let the pizza cool down (as what would happen if you ordered a pie) that things get a little weird. The cheese rapidly hardens and becomes the texture of pasta. This new texture is not nearly as enjoyable.  If you order a pie to go, I recommend keeping it warm in an oven set to a low temperature as you work on the slices currently on your plates. \nAnother noteworthy aspect of Fascati is its choice of pepperoni. It uses the kind of pepperoni that curls up in the oven. Many brick-oven pizza restaurants use this kind of pepperoni and I was pleasantly surprised to find it on an average neighborhood slice.", "author": "BT F."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-08-18", "description": "It was raining, late, and I was in Brooklyn Heights looking for a quick bite before heading home.  What did I find at Fascati?\n\nMediocre pizza\n\nMushroom topping comes from a can and isn't actually baked into the slice\n\nService is disinterested, even for a slice joint\n\nAnd they charge extra for a small box that accommodates two slices\n\n--\n\nIn short, you can do better", "author": "Daniel K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-30", "description": "I've been meaning to try Fascati Pizza for almost 8 months, ever since I moved to the Heights.  But I love my Front Street DUMBO pizza...so why switch?  Well, I finally placed a delivery order over a long holiday weekend...and I am a happy girl!  Fascati Pizza is AMAZING!  Delivery was fast (under 30 minutes).  The crust is crunchy and thin, but not too thin, and very tasty.  And the cheese is great, too...perfectly cooked so you get some of those dark cheese spots...love them!  \n\nFascati Pizza has some weird hours though...they're closed one day a week, and go on a long August vacation.  It's a nice throwback to a family business of the 50s, but I need my pizza 24/7 in NYC. Now I know why they can pick and choose their hours, though...their customers really will come back to them, because the pizza is truly delicious. \n\nThough I won't give up on Front Street, I love having two choices for a pizza delivery rotation!", "author": "Krista J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-10-24", "description": "Having lived in NYC for over 5 years now, I've had my share of New York thin crust pizza.  Until recently, the best pizza I'd had was Bleeker St pizza in the west village.  Then I had a baby, moved to Brooklyn Heights, and one day walked past this place, got a whiff of the pizza and stopped dead in my tracks.  I ordered a slice from the window immediately.  In true New York fashion, the pizza guy placed my slice in the (wood burning?) oven to crisp the crust and melt the gooey cheese.\n\nDon't take this lightly.  This perfectly thin and crispy, just-the-right-amount-of-grease pizza was, hands down, the best slice I've had in New York City.  \n\nI might run and grab another slice now just thinking about it.", "author": "Tiffany L."}], "servesCuisine": "Pizza", "priceRange": "Under $10", "name": "Fascati Pizza", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "80 Henry St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/ZhAN47D620KEYSYCv1W1GQ/ls.jpg", "@type": "Restaurant", "telephone": "+17182371278"}