{"aggregateRating": {"reviewCount": 106, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-29", "description": "Excellent service and delicious food! We came here for Iftar and had a nice time. Definitely recommend.", "author": "Gigi F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-11", "description": "We ordered several of the vegetarian dishes, which were all delicious, very different from each other, and healthy tasting. The dishes are reasonably priced, as well. It's a family owned business that has been in the same place for the last 30 years--this was the first time I'd tried it though and I'm very glad I did. It's a little hidden because it's downstairs in the building (there's a coffee shop at the street level).", "author": "Rachel S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-09", "description": "Absolutely loved the food here! We ordered the mixed grill plate and the appetizer mezze, and everything was delicious. This place is also BYOB and doesn't charge a corkage fee--which is unheard of. \n\nAs others have mentioned, it's kind of hard to find. The location is below a coffee shop, so it's hard to spot if your just passing through the neighborhood.", "author": "Ali G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-31", "description": "I won't speak much about service as my experience ordering take out was very awkward. First the restaurant is in the basement and it looks like a basement.  They could have cleaned it up s bit. Also, they need to find a way to fix how they serve as it seems like who ever is available jumps up.\n\nSo straight to food, the falafel and hummus I ordered was the bomb.  They're not far from the pier so I walked down and ate by the water.  I put the falafel on top of the humid and went to town. Falafel is amazing and so is hummus-I'd come back just for that. \n\nHopefully they straighten out their weird entrance.", "author": "Ahmed M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-19", "description": "Food was good, authentic and reasonably priced. Excellent hummus and mixed grill. Hot bread and pickled turnips / olives to start. Will go again to try rest.", "author": "Sparkle B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-19", "description": "I'm going to round up from 3.5 stars. Food was great. Service was fine. The restaurant is downstairs. It is nice but definitely feels like your sitting in a basement. The table next to us had kids running around the place screaming so it was kind of hard to really enjoy our meal.   Restrooms are upstairs.", "author": "Jennifer D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-08", "description": "The hummus and baba ghanoush were amazing. It's a little hard to find being on the lower level below a coffee shop, but totally worth it. It's a slight \"hole-in-the-wall\" vibe, but completely authentic and incredible food. 10/10 would recommend.", "author": "Megan D L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-01-03", "description": "I ordered their food via seamless and it was cold, stale and old. Never will I EVER order from this place again.", "author": "Laura P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-12", "description": "I first came to Tripoli almost 30 years ago, last night was our first time back in many years. Why did I wait so long! Simply the best Lebanese food you can find outside of Lebanon, ans one of our party is Lebanese. We sold them out of Kibee Nayah, it was just amazing. The felafal were the best I've ever eaten. The bill for five people was absurdly cheap. We will be back sooner than later!", "author": "Howie H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-10", "description": "I have been enjoying the food at Tripoli for a decade. It's just about as good as the Lebanese food my mother made when I was growing up. I'm always struck by the freshness of the ingredients. The kibbe is fantastic both baked and raw (think lamb tartar). The mezza dishes are all top notch - hummus, baba ganoush, tabouli etc. There are some great salads (my favorite is the fatoush). There are great options for meat lovers and vegetarians. \n\nI recently asked Tripoli to cater my birthday party. We had 30-40 guests. Everyone was wowed by the excellent meal and made the effort to ask about the restaurant. The manager helped me choose items and quantities. We had no leftovers!\n\nTripoli has been in the neighborhood for decades. It has withstood the test of time because they put a lot of love into the food. If you are a longtime fan of Lebanese cuisine like me, or if you want to try something new, come to Tripoli. You'll be glad you did!", "author": "Michael K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-03-18", "description": "A good Lebanese restaurant offering up traditional Middle Eastern dishes. \n\nThe Tripoli Meza was a good value order and is a great starter (well, the only proper starter for the real experience). Bread was lacking, but the falafel was pretty good. \n\nThe shish taouk was tasty, but lacked the garlicky-lemony flavor I'm accustomed to. \n\nThe fattoush was unique in that it contained \"pomegranate nectar\" (pomegranate molasses?). Call me a traditionalist, but while interesting, I actually thought that this quirk subtracted from the enjoyment of the dish. \n\nThe service was very attentive and nice. The actual restaurant (which is now located in the basement, which apparently used to be a function room for special events) looks nice, but it's sad that it was so empty. \n\nBrooklyners, instead of just gentrifying Cobble Hill, pass up on Trader Joe and KeyFood's subpar and whitewashed \"Mediterranean\" spreads and frozen foods and try the more authentic \"Lebanese\" meza at Tripoli for lunch. Restaurants like this shouldn't be relegated to basements. Your support equates to a better authentic neighborhood product rather than an interpretation of it.\n\nWhile I find nothing extraordinary about this average to above-average restaurant (I'm a harsh critic since I was raised in a vibrant Lebanese and Syrian community, have lived in Beirut, and have been exposed to the cooking all my life), I'd consider coming back for lunch to introduce friends to this cuisine.", "author": "George S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-14", "description": "Awesome good, did the 42$ appetizer sampler with seasoned fries and complementary baklawa!! So good and service was amazing.", "author": "Tanay S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-01-10", "description": "My first card out of the Diner's Deck ($10 off $30 at a ton of restaurants) was for Tripoli in Brooklyn Heights/Downtown Brooklyn. A friend was in the neighborhood so I took my girlfriend and we headed over there. Do note it is NOT near Atlantic Ave station (my friend was confused). There isn't much around and this restaurant is in the basement below a coffeehouse.\n\nWhen we walked in, it was dead. Literally a 2-top and 4 people on a 6-top round. That's it. The guy who was the host/server/busser/kitchen help/cashier met us and brought us to a table. He was very quiet and showed no excitement to be there on a Wednesday night.\n\nAfter scouring the menu, we found the \"Lebanese Traditional Meza $42.95\" which is described as:\n\"An array of twenty different mouth watering dishes appetizingly served in the best specialty restaurants of Lebanon. Recommended for parties of 2.\"\n\nWhen we got the waiter back, we asked what was in it and he gave us a run down, primarily small plates of dips and salads with a ton of vegetarian options (which we were all fine with). Since we didn't like olives, he said he could switch it out, but we didn't learn what we got instead.\n\nIt was very quiet and a bit of an odd environment. It is a huge restaurant, very nice decor, but with no one there, we had the place to ourselves pretty much. My two co-diners got the special tea, which was like $3.5 or so with no refills. It was tasty, but a small 8-oz tea was overpriced.\n\nEventually there was food...a lot of it too. We had about 20 different dishes to share: Hummus, babaganouj, cheese, lebni, falafel, vegetarian and lamb kibbeh, lamb kebab, chicken kebab, pita, and so much more. It was a great feast, even with enough for 3 people (more affordable too!). If you've been to a Greek/Middle Eastern/Mediterranean restaurant with mezze appetizers, this is pretty much on par with those. All pretty good, some just needed more seasoning or spice.\n\nI would be open to going back and trying an entree or two, but I would want better service. It felt awkward asking for water or trying to have him explain to us what the dishes were (we couldn't decipher it all on our own!). The guy just didn't seem to want to be there so it wasn't the best experience, but would go back for the food.", "author": "DK S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-29", "description": "Best lebanese food in the area!\n\nThe fatoush salad is my favorite! The grilled chicken is perfect.\n\nI have been coming here for years with family. Would love to go back again!", "author": "Deirdre L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-15", "description": "I am always a fan for Mediterranean cuisine. Large portion of veggie and little bit of meat on the side. \n\nI think the ideal way to order here is getting that veggie platter and just 1 entree for 2 people. The appetizer comes pretty quick therefore the veggie platter will keep you filled and happy. It's a large platter and plenty of food. \n\nThis place is in the basement and after reading other reviews, They ARE BYOB?? \n\nPrice wise is around $10 to $15 a plate. A bit pricey but hey, you should think about those wrong decision you made paying for that $15 martini or overpriced bar drink. \nAt least you get a healthy dinner.", "author": "Kevin Z."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-01-27", "description": "Quite the disappointment. Ordered dinner from this restaurant over the weekend and picked up the food in person. The pita came in the plastic bag that it's sold in the super market in. No pretense about making it there I guess. The chicken was chewy and rubbery. The salads were mostly lettuce with a few slices of tomatoes thrown in here and there. The combination platter of appetizers had a total of 2 falafel balls (which were not very good anyway). The okra cooked in tomato sauce was mostly sauce and mostly flavorless. Overall, all six of us sharing the meal agreed that it was no good and it is highly unlikely I will be ordering from Tripoli again.", "author": "Lana V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-04", "description": "Just had a pleasant dinner at Tripoli restaurant this evening( Saturday, march 4th, 2017 , yes this restaurant  is still opened after being in business 45 years)...the falafels were great and tasty, some of the best I've ever had. The hummus and the baba ghannouj were great and flavorful...The chicken kabab ( shish taouk ) was delicious, tender and moist.. can't go wrong with those items..\nBy the way, for those who have said Tripoli has closed...well they are still opened and now serving in the lower level dining room just below Swallow cafe, at the same location of 156 Atlantic avenue just in case some people are lost or confused.", "author": "Safa S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-19", "description": "This is my second time at Tripoli and I'm very pleased. The food is absolutely delicious and the service is excellent. The staff are friendly and very polite. I will definitely come back.", "author": "A B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-05-13", "description": "We got delivery.  The pita came in the bag from the store.  Like, the \"homemade pitas\" came in a bag that was directly store-bought.  The food was OK.  I ordered a pelligrino (I think it was six bucks) which did not come with the meal and when I called to request my beverage the delivery guy came back with what was no-doubt a pelligrino from the store, warm as toast.  Made a man want to go back to drinking.  But then, after a minute of quiet reflection, I realized the next AA meeting would be terribly weird if I tried to blame a delivery meal for my back to boozing ways.  \n\nAgain the place looks awesome on a corner of Atlantic, but the delivery was below \"meh\", BEH.", "author": "Ryan D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-13", "description": "The food here was delicious. The atmosphere was wonderful. The service was good. \n\nI ordered the Malfouf (cabbage stuffed with lamb) and it was so tasty. My friend had the Shish Kabob \u0026 Kofta Mishwiye Combination - the kofta was even better than my dish!! My friend grew up eating middle eastern food and she said the kofta was probably one of the best she's ever had, and definitely the best she's had in NYC. \n\nI've been walking by this restaurant for years and have always wanted to try it. Glad to say that the inside is as well decorated as it looks from the outside. It can be intimate atmosphere and it can be great for family and friends. We came on a Friday night and it wasn't too busy. I've walked by here on a weekend night though and it was packed. It's hard to say when is a good time, but I highly recommend it!", "author": "Elaine C."}], "servesCuisine": "Lebanese", "priceRange": "$11-30", "name": "Tripoli Restaurant", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "156 Atlantic Ave\nLower Level", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/wUpuiivACa85H73VwF8izg/ls.jpg", "@type": "Restaurant", "telephone": "+17185965800"}