{"aggregateRating": {"reviewCount": 106, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-28", "description": "Great lebanese food, Try Shish Tawook my favorite,, Chicken breast marinated in garlic sauce and grilled to perfection served with rice and salad Yumm!!", "author": "Noinya B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-02", "description": "I have lived here for many years, and only in the last few years have I come to truly appreciate Tripoli. We have a lot of good restaurants here on Atlantic Avenue now, but, apart from the wonderful food, Tripoli offers something that is becoming more and more rare - a welcoming environment where you can actually hear each other talk! This is now my go-to place when friends from out of town come to visit.\n\nSpeaking of the food ... if you're a vegetarian, there are some terrific choices. As someone who does eat meat and really enjoys their lamb kibbee, I was surprised how much I loved the meatless kibbee b'ziat made with potatoes, cracked wheat, onions, walnuts and raisins. I recommend that and their deliciously smoky babaganouj. And back to dishes for meat fans, their coussa b'leban (squash stuffed with ground lamb, rice and pine nuts in a yogurt sauce w/ mint) is also yummy.", "author": "Ronnie A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-20", "description": "The food was delicious. We started off with some of the best hummus I've ever tasted, and I had the Mixed Grill for dinner. The service was a bit slow considering we were one of the only parties in the restaurant on a Sunday night. Overall, good food and good ambiance outweighed average service.", "author": "Gregory D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-05", "description": "I really enjoyed it, food was good, light, and i didn't feel sick when i left.  I am always happy with middle eastern food and this place hit the spot.", "author": "Robert D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-04-03", "description": "I am from the Middle East and this place probably has some of the worst ME food I have had in NYC. \n\nWhat a shame.. the flafel was almost burnt.. the ix grill consisted of meat the size of my tiny fingers...\n\nwill not come back here..", "author": "Sera A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-22", "description": "I am not quite sure why so many reviewers below were unhappy with their experience at Tripoli.  I live in the neighborhood and pass by rather frequently, but last night I stopped in for the first time, and I couldn't have been more pleased.\n\nFirst, this is one of the only BYOB restaurants in the city, and they did not charge me an uncorking fee.  It's nice to have wine with dinner without having to pay the ridiculous markup charged by other restaurants.\n\nAmbiance: The restaurant is really well decorated.  There is a giant wooden ship that lines one wall and literally extends the entire length of the restaurant.  It's really quite impressive.  The music is typical of middle eastern restaurants, and made for a nice background.\n\nService: The service was friendly and quick.  While it wasn't over the top impressive, it was more than sufficient for a nice evening out.  The waiter was there when we needed him and not there when we didn't.  Our appetizers came out within 10-15 minutes and the entres followed almost immediately after we finished our apps.\n\nFood: The food was delicious and tasted very fresh.  The portions were perfect, and the fish entre we ordered was perfect.  Presentation clearly isn't a priority for the chef at Tripoli, but who cares when the food is so tasty.\n\nOverall, I had a great experience and will certainly be returning.  Don't expect to have a fancy midtown Manhattan dining experience, but Tripoli is a very nice, low key option for a simple night out.", "author": "Michael L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-12-20", "description": "Lebanese mezze, tons of good vegetarian stuff, coffee with cardamon", "author": "Sara D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-10-20", "description": "Very underwhelming.  Spinach pies with little flavor.  The salad accompanying the dishes could have more dressing, herbs, flavor, olive oil.  A big missed opportunty.  The rice that came with my entree could have been from an Uncle Ben's box.  The cauliflower and tahini dish I had was so flavorless I had to dump tons of salt in it.  Their foul was, however, outstanding.", "author": "Kendrah R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-02-05", "description": "My husband and I have been going to Tripoli for years now, and have generally enjoyed the experience.  Last night we went for the first time since it moved into the basement of its building.\n\nThe food hadnt changed much, which isnt a bad thing.  Service took longer than I remember.  Although it is quite a different ambiance, I didnt mind it too much.\n\nWhat happened at the end of my dinner, however, really soured my otherwise long-standing affection for the restaurant.  My husband and I had recieved a gift certificate from Tripoli about a year ago from a family member in the amount of $100.  When our relative bought this, they paid the restaurant up front (obviously), so the restaurant pocketed $100.  We tried to use it lastnight at the end of our meal, and aparently there was small text at the bottom that said it expired 12 months from being issued, and it was issued 13 months ago.  Althought the restaurant is under the same ownership, and despite their being closed, and then relocated so that you really couldnt even tell they were an operating restaurant in the basement of their old building, for half a year, they refused to honor it.  I get that it was on the gift certificate, and I dont blame the nice man working at the front who was clearly humilitated to have to act so cheap and classless.  It was just so chintzy and tacky that it left a horrible taste in my mouth.  To me this says a lot about the owners of the restaurant.  Also, I am pretty sure this is illegal-- but I am supposed to be working now, so more on that later.\n\nWould rather go to Sultan's down the street: the food is amazing, and when I forgot my wallet on one occasion, the owners LITERALLY said no worries, you can pay for your bill sometime in the future (we went back 20 minutes later btw).\n\n** EDIT**\n\nAlso just want to point out, despite what the owner of the restaurant is suggesting below, this gift certificate came straight from the restaurant.  My sister-in-law confirmed.  She called the restaurant and paid for it directly-- said they were very friendly.  Certainly Tripoli would have recognized its own gift certificate when I tried to use it last night.", "author": "Vanessa B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-20", "description": "It was the first time we went there since the restaurant moved downstairs at the same location. The food was excellent, as was the friendly service, and it has a nice decor.  Prices were very reasonable. We were so happy to find that there still is a Lebanese restaurant left on Atlantic Avenue, a neighborhood that was known for its middle Eastern cuisine.", "author": "Viviane H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-06-29", "description": "I know these guys have been here for an eternity, which counts for a lot, but I was not satisfied with my meal here. Just so so. I had a mezze plate (I've had better babaganoush and hummus elsewhere) which was okay.  The chicken curry was also just okay.  Portion size was large, but the flavors were one-dimensional.  I like complexity in my flavors and yeah, there wasn't really any.", "author": "Kayo N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-02", "description": "Had dinner at Tripoli on Saturday and really enjoyed it.\n\nStarted with the hummus and then had the Minazli (eggplant) and my wife had the Mjudra(lentils). Food was excellent and the service was attentive. The non-vegetarian dishes looked just as good. \n\nGood, moderate priced place to eat. We will be back.", "author": "Robert L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-24", "description": "Great falafel and hummus! Chicken shish is not dry like other places. Ambiance is not that great, but food here is decent. Not really crowded as well usually and service was on point. BYOB if you want any alcohol with dinner.", "author": "Wayne K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-09", "description": "Had an amazing lunch here. Selection of meza and some kebabs totally hit the spot! Our waiter was attentive and the food came out fast. Why all the haters?", "author": "Billie C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-19", "description": "Kifta kebabs are amazing. Hummus is great. Real Lebanese food.", "author": "Hana A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-09-20", "description": "Chances are you will be the only customer in the restaurant for dinner ... but don't let that scare you away. The food is fresh and delicious. The Fatoush salad was perfectly dressed, and I really enjoyed the felafel.", "author": "Katie G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-23", "description": "My wife and I, along with our granddaughter and her man, had lunch at Tripoli on Sunday, July 21st.  My wife and I had been there on 3 other occasions, beginning in late 1970s, 1989, and 2007.  I grew up on my grandmother's wonderful Lebanese cooking, and Tripoli had always come very close to meeting her high standards.  We were not disappointed.  It was a very special occasion, with food to match.  The lebna immediately brought back the smooth tartness of my grandmother's, and the babaganouj and hummus were equally delicious.\n\nOur main dishes were Kifta Mishwiye, Malfouf, Kibbee Mishiye, and Mjudra with fatoush.  Each was a wonderfully prepared and presented dish.  I had the Kibbee and was impressed with the taste and delicate aromas that, again, brought back memories of the generous table my grandmother always presented for our family dinners.\n\nAfter leaving my native Oklahoma, many years ago, I have searched from coast to coast for a Lebanese restaurant that satisfied my tastes.  Tripoli is the best--though many years ago, there was a Lebanese restaurant in Manhattan--somewhere in the 30s that came very close.\n\nOur service at Tripoli was excellent.  Friendly, attentive without being intrusive, and helpful in answering our questions.\n\nIf you are interested in beautifully prepared, authentic Lebanese fare, this is the place to go.", "author": "Ed H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-07-16", "description": "For those of you Brooklynites who don't know, Tripoli is probably the best Lebanese restaurant in New York City. Yes, its a blanket statement, and yes, it's probably the only Lebanese restaurant I've ever been to. I recommend it to all.\n\nPlease be warned: You will experience The Worst Service you've ever had. I truly believe the waiters take turn sharing one brain. They spend more of their time gathered around one of their cellphones like cavemen who have just discovered the wheel. If you have a lot of time to kill, head on over to Tripoli for a meal that is well worth the atrocious service.\n\nIf you do go I recommend ordering the Fassoulia, which is a hearty stew of dried white beans cooked in a tomato sauce with garlic, onion, and lamb chunks served with rice. Also order my favorite dish, Sumki Hara, sautéed fish fillets cooked in a spicy sauce made with chopped almonds and walnuts, served with rice.", "author": "Camille N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-11", "description": "Bring a bottle or two of wine, get the full meza (twenty small plates of awesomeness, best shared by two people), and enjoy a couple hours of bliss.  Everything is really good and you will leave happy and sated, and it will set you back less then $50.  Cannot go wrong.", "author": "Kate A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-10-14", "description": "Came here with a group of friends. We're Arab so we wanted to try out some of this food. Service was good. But serving sizes are way to small. We ordered a Mediterranean platter for $10 and it had one piece of falafel, a lick of cheese and some hummus. Main dish was small too. 3 lamb Keftas and some rice. Too expensive for the quantity of food. Tastes great though. Tea was good as well.", "author": "Zaid A."}], "servesCuisine": "Lebanese", "priceRange": "$11-30", "name": "Tripoli Restaurant", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "156 Atlantic Ave\nLower Level", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/wUpuiivACa85H73VwF8izg/ls.jpg", "@type": "Restaurant", "telephone": "+17185965800"}