{"aggregateRating": {"reviewCount": 106, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-20", "description": "Ordered takeout using the Eat24 app. Wish more restaurants would participate in the program as it makes ordering very easy once establishing an account. Anyway, on to the review. \nThis was my first time ordering from Tripoli. Food arrived hot at my door in under 30 minutes which was great. Had the meza plate and grilled chicken plate. Both were very good and it was enough for two of us to share. Also had leftovers for lunch the next day so that makes it kind of a bargain to me. \nChicken was tender and rice was so good. Had tons of flavor. Enjoyed the hummus and babaganoush.  Falafel were really good and nutty with sesame. \nWill definitely order takeout again or visit in person.", "author": "Rick S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-17", "description": "Such authentic, delicious Lebanese food. The hummus was especially good!", "author": "Maria D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-11-27", "description": "I got mine to go, so it was cold by the time my wife brought it home to me in PA.  It was only ok. The rice wasn't that yummy and the lamb didn't really jump out at me.  Maybe it's better when you eat in the store.", "author": "Sava P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-09-17", "description": "We went on a Wednesday and found the place completely empty. We ordered the hummus (serviceable but coupled with dry pita), the spinach pie (supposedly fresh but dry and unappetizing), the cous cous (dry and unpleasant), and the shish kebab (which was good, but sadly overshadowed by everything else).\n\nThe service was polite and friendly, but the food was a disappointment. We were hoping for better.", "author": "Olivier D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-10-17", "description": "Yuck. A generally disappointing experience in a dingy basement setting. The meza platter was lacking in flavor and freshness: falafel that disintegrated into crumbs when touched, flat hummus and baba ghanoush, a fluorescent pink radish bleeding dye onto the plate and unimpressive baby olives. The Yachneh B'leban was practically inedible with three lonely morsels of lamb floating uncomfortably in a broken watery yogurt sauce. To top it all off, the store-bought pitas were disappointing.", "author": "nik b."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-25", "description": "Fresh and delicious ! Tripoli is a bit different from the other Middle Eastern restaurants along Atlantic Avenue; all the food is home made, authentic,  and super crisp. Nothing is too salty , over- marinated or less than 100% fresh. I've been told the olives served in the meze platter are imported from Lebanon and cured in a labor-intensive process, and they do have a mild, special taste. I 've had the assorted appetizers, fattoush , cous cous , black eyed pea, and lentil dishes--all wonderful . I've never been disappointed. Nothing tastes mass produced or super market - quality. And the pita is just as good. \n\nThe restaurant is downstairs. Another business, a cafe , is on street level , so don't walk by the Tripoli entrance or hesitate to go down one level. prices are reasonable \u0026 service is quick.", "author": "Nancy c."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-05", "description": "This place continues to be great!! I've been coming here with my family for over a decade and the quality of the service and food hasn't changed--it's excellent. We always order favorite starters (like Tripoli Meza, fava beans, tabouli) and then our entrées (chicken shish taouk \u0026 mixed grill). We were here tonight (Sat.) and everything was perfect!! (However, weekdays hours are different--they open at 5pm) Last but not least, I highly recommend this fantastic restaurant.", "author": "Shirley M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-01", "description": "Incredible dishes that go way beyond hummus and baba ganoush. Highly recommend the Bamia and the Sheik al M'ehshi. Great service and is also byob.", "author": "Mary A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-11", "description": "Good food. Ordered chicken kebab which was well marinated and had a smokey bbq finish, rice, and salad with a balsamic vinaigrette. The order came with included with picked radish, olives, and pita. Their lebaneese coffee was rich and reminded me of a cross between turkish coffee and italian espresso. Friendly and attentive waitstaff who made sure we had a pleasant meal and didn't make us feel rushed to leave. The resturant is in the lower level it was dim, cool, and had a Middle Eastern ambience. I loved the lantern ceiling fixtures.", "author": "Jane D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-27", "description": "This is my 4 time in 2 months going to tripoli , it is not so fancy inside  but the food is great , the service is nice. Try the chicken with rice plate , with hummus , and tabouli. At the end don't forget to try the home made crunches pastries. I recommend this place", "author": "Omar N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-05", "description": "Place rocks . Quiet as hell - they hook you up. If you love mediterraean food . BYOB and you are good to go.", "author": "Ryan D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-09-26", "description": "Sadly, this old favorite has changed. The patriarch perhaps died or retired? He used to regale us with stories when we brought out-of-town guests and we would leave with bars of olive oil soap. They have sold or rented the street-floor space to Swallow, a yuppie coffee shop chain and Tripoli is downstairs only. \nWe were there from 7:30-9:30 on a Saturday night and not another soul appeared. The kitchen area is separated by a makeshift curtain. Used to be such a wonderful environment. The menu is reduced. Some old favorites just aren't there. The grilled chicken is still good, but and the lamb in yogurt sauce was a step away from inedible. I thought long and hard before reviewing because I am attached to them, but they need to be aware that they need to change if they wish to stay around. Maybe they don't care.", "author": "Mary R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-06", "description": "Such a spacious place with authentic Lebanese goodness. The chicken was exactly what I wanted and very quick service.", "author": "Desiree Michelle M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-03-15", "description": "As the two-star rating suggests, \"Meh, I've experienced better.\"  The food was alright and the service was inattentive.  It probably doesn't help that as a Lebanese gal, I have a pretty high bar when it comes to Lebanese food.", "author": "Jennifer S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-11", "description": "Update, having been here many, many times since my initial review. Actually, um, pretty much every Friday night for the last two months. \n\nLet me put it this way: It's Friday night, and you're exhausted after a long week at work. You and your boyfriend drop your bags at home, schlep to the wine store and get a nice bottle of red, before crossing the street to Tripoli. You walk in, get a table with no trouble, and relax while the server opens the bottle and pours you a drink. Hell yes. You sip on wine while he brings out plate after plate of fresh, delicious, filling Lebanese food...heaven...and all for less than $50. \n\nThis is the perfect spot for an inexpensive, relaxed dinner date. Delicious food, low-key but attentive service, and there's always a table waiting. I highly, highly recommend you give it a try this Friday. Just don't take my table (adjacent to the window, far right corner).", "author": "Katie E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-02", "description": "A few weeks ago I was too overwhelmed from a crazy week to decide on dinner plans, so thankfully my boyfriend stepped in and suggested Tripoli, a place we've passed by many times, but have never tried.  \n\nAs we sat down, of course we noticed how empty the place was, but also noticed how cool the interior was!  There's a raised section that looks like part of a ship, and all the wood makes it feel authentic and rich.  Yes our waiter was less than welcoming, but he did show up with free hummus and hot pitas, so...yeah.  Had I known this place was BYOB I would have been prepared, but we were happy enough with the food even without getting our buzz on.  \n\nI got the Shish Taouk, the grilled chicken in garlic sauce, that comes with salad and super fluffy rice, and the boyfriend got an eggplant puree with ground lamb on top and rice on the side.  Both were great, and the extra garlic sauce they gave me for my chicken went really well in my boyfriend's dish as well!  \n\nI would totally return, this time with a bottle (or two) in hand.", "author": "Maeve C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-13", "description": "Authentic, like your Lebanese grandmother used to make--according to my bf, who swears it tastes the same--in a nice environment, with lots of seating!  Homey space with hand-painted murals (tasteful), high ceilings, and beautiful carved wooden chairs.\n\nWe had a fantastic service experience!  Came on a Sat. around 2pm for a late lunch.  Our server checked on our 5-person party every few minutes.\n\nAnd the food was really good!  We ordered...\nMinazli (eggplant, ground lamb, tomato sauce, pine nuts with rice) -- LOVED, delicious, moist, flavorful\nMa'ani (lamb sausages, pine nuts, salad, \"fried potatoes\" = fries) -- LOVED -- salad was unexciting, but the sausages were YUM and fries were good.\nKibbee Nayeh (Raw Kibbee) -- rave reviews from bf's Mom, who said it was authentic\nHummus \u0026 pitas -- the bread was fresh and soft, hummus some of the best ever, couldn't stop eating it!!!\nStuffed grape leaves (veg.) -- moist, light and savory, could eat these all day\nM'judra B'riz (Lentil dish) -- good, slightly less complex than others but still good\n\nAll of the entrees had complex spiced flavors, especially the eggplant/lamb dish \u0026 lamb sausages.\n\np.s. The mango juice is like a burst of ripe mango with a hint of rose water, amazing!  The baklava is some of the best I've had--not too sweet, but flavorful and very moist.\n\nHighly recommend!!  Definitely want to come back here for a date night (or with  friends) and BYOB.  (Note: There is a small fee to BYOB but reasonable.)", "author": "Betty H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-19", "description": "Visited Tripoli for dinner after the Atlantic Antic street fair.  Friendly service, delicious food... love the hummus, baba ganoush, tabouleh salad...it's a vegetarian's dream.  Also love the desserts -- especially the \"bird's nest\" -- wonderful.\n\nThere is a private room downstairs... Please bring back live music and belly dancing! Would be a wonderful addition to this fine establishment.", "author": "Julie F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-30", "description": "I feel ashamed that I have lived in the neighborhood for a year and only tried Tripoli last night.  It's refreshing to go to a family owned restaurant that's been in the neighborhood for 40+ years, and if you look carefully the restaurant is shaped like a ship, which is pretty cool.   The food was awesome.  I am sure all the lamb dishes are fantastic.  We got the Kifta Mishwiye which is a lamb kabob and the Sbanegh which is ground lamb and spinach served with yogurt which was really flavorful and different from anything I've ordered from a middle eastern restaurant.  Big portions, plenty of food.\n\nDon't worry if it's not to crowded.  It only means you'll get better service and the food will be great.  It's really easy to get caught up in trendy brooklyn restaurants, but this place is a gem.  They absolutely deserve your business.   \n\nOh, and it's byo wine and beer (minimal corkage fee)", "author": "Daniel C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-04-20", "description": "It's been about two weeks since I've been and I haven't stopped thinking about the food. I had the shish taouk (garlic flavored chicken breasts, served on a light and fluffy bed of rice) while my fiance had the stuffed kibbe (seasoned lamb and bulgur formed into hollow balls, filled with more seasoned lamb, then fried). I wish I could have eaten all of my entree, and then all of his. Everything was cooked and seasoned perfectly. And the labneh to start the meal was superb. I honestly can't fathom the poor reviews. I'm Lebanese so I know what I'm looking for in Middle Eastern food, and this joint hits the spot. \nNote: BYOB. We bought a bottle of arak from a nearby store. It was an excellent decision on my part, if I do say so myself.", "author": "Michelle E."}], "servesCuisine": "Lebanese", "priceRange": "$11-30", "name": "Tripoli Restaurant", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "156 Atlantic Ave\nLower Level", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/wUpuiivACa85H73VwF8izg/ls.jpg", "@type": "Restaurant", "telephone": "+17185965800"}