{"aggregateRating": {"reviewCount": 106, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-09-24", "description": "I'd passed this restaurant several times, before actually going in one day. I can't say that I eat Lebanese food often, but the last time that I ate Lebanese food a few years ago, I loved it, so I was anxious to try it from another restaurant. Inside is pretty big though there were only about 4 tables filled when I went on a Wednesday night. I ordered food, checked in on yelp (got a free order of hummus when I checked in, which was awesome), and just took it all in. Nice enough ambiance and they got quite a few pick-up orders while I was there. The prices are reasonable. The waiter seemed to be running a one man show and was literally running back and forth trying to manage the load. He was relatively attentive given the number of large parties that were also dining. He was pretty cute too, so it was nice to watch. Now to the food- I found my main meal to be kind of bland, but it could be what I ordered. I got the Bamia, which is okra and lamb in some sort of tomato sauce. You rarely ever see okra on menus and it's one of my favorite vegetables to eat at home so I figured I'd order this- probably not my best decision of the day. I would go back, but definitely would pass on that dish.", "author": "Nyota W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-15", "description": "We stumbled upon this restaurant very hungry after a dance performance and long walk. Wow, did we feel like we got lucky. The service was excellent and the food was fantastic. We shared an appetizer of hummus, feta, olives, and felafel--outstanding. Husband had a grilled chicken dish that he loved. I had a dish that I have never had before and will not soon forget--not sure of the name (shika al-mashi, maybe), but it was eggplant, ground lamb, pine nuts in what I can only describe as a yogurt broth (with rice pilaf on the side). LOVED IT!!! Looking forward to eating there again next time we go to BAM or Mark Morris Dance Center. Prices completely reasonable.", "author": "Karen B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-31", "description": "I love this place! I live nearby and have been many times. I think I've waved at Moo, the waiter, a thousand times. Nice guy! It's family owned and operated with authentic, delicious Lebanese dishes. Relaxed, nice decor but not pretentious, in business for over 4o years. Everything is great, from  vegetarian to meat dishes, appetizers and desserts. GO there and see for yourself.", "author": "Gail C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-02", "description": "This place is amazing hands down!!! I came here with my family and friends for my birthday and they took such great care of us I never thought I'd fall in love with food but can you blame me? the hummus was to die for, the eggplant stew was orgasmic and well portioned, the shish kabob was on the money, they had this dish called kibbie mishwie omg forget it Love This Place Will be back", "author": "Willy L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-26", "description": "My husband and I always stop in here when we're in Brooklyn stocking up on Middle Eastern food and spices available on Atlantic Ave.  It is very tough to please us when it comes to Lebanese food.  The first few times we were in here we ranked Tripoli in our \"It's OK\" Lebanese food category.  More recently, however, its jumped to a place we really look forward to getting back to.  The hummus, falafel, fattoush, and tabouli are all very good.  I'm also a big fan of their vegetarian kibbe (potato).  We're looking forward to our next trip there!", "author": "Kate P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-12-04", "description": "I love this place! The food is great! The service is questionable depending on the night you are there. However, i always visit at least once when I'm in the city. If you like middle eastern food then it is definitely worth a visit! The vegetarian kibbeh is delicious! We went there with a group of 20 people and they were very accomodating.", "author": "amara k."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-05-14", "description": "* All points out of 5\n\nService -- 4 -- Did everything he was supposed to for an average waiter. Was attentive to refilling water glasses, made suggestions on the menu when asked, and was overall around when we needed him.\n\nFood -- 2.5 / 3 - overall the food was lackluster in flavor, and the portions were kind of small. The salads that came with the food were what you could throw together at home without trying - more white than green romain lettuce doused with a vinaigrette.\n- Spinach pie. Triangle shaped pastry thing, filled with soggy spinach. Sort of like a large samosa if you've had one. Tasted like it has been reheated. Not impressed\n- Mixed Grill. Shish taouk (chicken) and shish kabob (boneless chunks of grilled meat) were alright. The flavor was there, I just wish they could have turned it up a bit more. The Kifta Mishwiye was the highlight of the evening. The flavors were on point and it was grilled to perfection. If I could do it again, I would order just this.\n- Ma'ani - Eh. Again, it would have been alright if the flavors were a bit more pronounced.\n\nDecor - 2.5 -- I've passed this place a few times on my way to the Yemani Cafe down the block and thought, \"Goodness it looks so cute! Look at that chandelier through the window. Look at those beautiful chairs.\" However from the inside it looks like a weird pirates ship theme restaurant. The chairs are beautiful though.\n\nPrice - 1 - And this is what really got under my skin. The food would have been fine, if the prices were a third less or half of what they are. The spinach pie is worth $3, $4 max.. not $8. The entrees, considering the small portions, should have been $10.. not $15-$16.", "author": "Aaisha S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-06-07", "description": "The food was really good and reasonably priced.  Despite the murals and carved chairs, this place doesn't have a great ambiance.  It needs a little updating.  It was eerily empty both times that I've been here (I wasn't even sure it was open on the first occasion).  I really don't mind a quiet meal, though, so this doesn't bother me particularly.  I will definitely come back with a nice bottle of wine and some friends.", "author": "d. t."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2010-12-27", "description": "The food was simple but fresh and good. I can't say good things about the sevice (that's why the lonley star). Two tables, two tables in the whole restaurant and I had to go find the waiter after 30 minutes I was waiting for the check! We got out drinks with the check...", "author": "Chiara Z."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2009-08-03", "description": "The food was great (really I'm a falafel snob) but the atmosphere was strange.  Huge place, few diners, fewer staff and loud music- kinda like being at someone's birthday party when no one else shows.  You just feel bad and are on edge waiting for their tears to come.", "author": "Becca F."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2009-07-05", "description": "Service was horrendous.  Food was just okay, could have been much better.  stuffed cabbage and kibbeh were both good, okra and dolma dishes weren't that good.  Won't return and don't recommend.", "author": "Aaron S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-01-13", "description": "I have been to Lebanese restaurants before and this was very bad compared to them. The service is not good. At first I was thinking maybe they cannot speak English because the first waitress talked a few words when I asked him questions. He disappeared and another waitress who served us the food did not say even hi and just put the food on the table and left.  A few minutes later he was talking in English to someone.  We were the only people there and still they were not able to provide a good service. \nWe ordered mixed grill and the food was not even enough for a ten year old kid! There were a few tiny pieces of meat, each of them half finger size, less than 5 cm! The plate was filled with lettuce a small piece of grilled tomato and some rice. I was shocked when I saw the amount of food. It was a high price for that food. I will never go back again. When we came out, I was looking for another place to go and eat, as we we were all hungry! It was a total waste of money.", "author": "Hannah M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-14", "description": "The most authentic Lebanese food you will find in NYC by far. All the dishes we tried (and there were many) were delicious and light. If you are looking for real, authentic, healthy and made-from-scratch Lebanese food in town this is the only place I'd consider. \nThe decor and atmosphere are definitely not that of a Soho hotspot, but who wants that in Cobble Hill anyway? We had friendly and pleasant service, amazing food, all at a very reasonable price.\nI wish I lived closer so that i could eat there more often!", "author": "Anis K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-05-11", "description": "The restaurant is generally OK, but here's a little-known secret: it has what may be the best falafel in New York. No joke.", "author": "Jason S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2009-07-13", "description": "My husband absolutely loves Middle Eastern cuisine, so we are always looking for new spots.  From the outside, this place looks great.  We went there for dinner on a Sat night and the place was fairly empty (bad sign) but since we were new in town, we thought we'd give it a try anyway.  Eh.  I ordered the okra dish, and what I got was a mushy lukewarm soup.  The hummus was fine, but the pita bread that came with it had a strange aftertaste that I later realized was freezer-burn.  Bottom line, there are plenty of other spots that offer much better food than this place.", "author": "Cynthia S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-03", "description": "I actually like this place a lot despite their tacky, trying hard not to be tacky, interior.  They have this nautical theme going in the restaurant, which is fine, but they have a painted sunset scene, that just doesn't do it for me.  None-the-less, the food is quite good, although super duper rich.  Expect to gain a couple of pounds eating here.  I do hope it does stay though,  it doesn't seem too full whenever I pass by.", "author": "M F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-04-07", "description": "Like quite a few people, I was enchanted walking by the restaurant, but while the food was good and reasonably priced, the almost-empty restaurant was a little unsettling. Is it the best Middle Eastern in the neighborhood? No, I would say it's good, but not outstanding. There are many more worthwhile options in this area.", "author": "Zoe H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-03-17", "description": "I would never eat at this place again nor would I recommend it to anyone. First of all the service was unenthusiastic and just plain disinterested. The waiter made it obvious that he couldn't care less about serving us. He screwed up our appetizer order and forgot to bring my drink. The food wasn't even that great. The portions were small and the taste was bland. This restaurant has not one redeeming quality. There are a number of other Middle Eastern restaurants in the area with much better food and service. I'll take my business there next time.", "author": "Angie A."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-11-16", "description": "I went to this place by myself on a Sunday afternoon. I always thought it looked nice from outside and so this time I went in.\nAfter waiting for about 5 min the waiter seated me. I ordered a yogurt drink, an appetizer and a main dish. After 10 min the drink arrived, and after another 35 min, the appetizer came. I should mention that I specifically asked for the food to be authentic and well spiced, not 'Americanized'. I ordered Kibbee Nayeh, their 'signature appetizer'. It had no flavor whatsoever and was drowned in old olive oil. After adding salt and pepper myself, I was able to finish most of it, but I was very hungry. My main course, a Fassoulia, arrived another 15 min later. It was basically a tomato based bean soup with some junks of lamb, but the beans were still not fully cooked and very 'grainy', whereas the meat flavor was very pungent and reminded me of mutton, not lamb. Note to chef: Lamb / mutton = beef / veal.  Again, apart from the meat, nothing had any flavor yet the meat flavor itself was too strong and I did not enjoy it. At least the sheep must have enjoyed a long and happy life ...\nTo summarize, 'lackluster' everything I would say, kitchen and service. \nNext time I pass by I will again enjoy the look in from the outside - and now even more, knowing that it is the better vantage point.\n\nPS:\nAll the photos here seem to be provided by the owner ...", "author": "J P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-04-10", "description": "Tripoli is as good as it gets for Middle Eastern food in Brooklyn.  I had some Lebanese American friends in town - one of whom had eaten here years before and was excited to return.  I rely on Yelp for food reviews all the time, so I foolishly led my party of six to Zaytoons because it was closer and seemed to have better reviews.  Once we arrived and realized it wasn't really authentic, we left to press on to the real deal.  One of the deciding factors was that the meat at Tripoli *is* halal which is very important if you want to share your delicious meats with your Muslim friends.  \nWe had Fattoush (salad) which I thought was great, others thought was missing something.  Falafel, baba ganoush and hummus all good.  Tripoli makes their own olive oil in Lebanon and imports it, so make sure you sample some of this with your pita.  We were all really happy with our entrees, which were rich and savory and like grandma used to make.  Highlights included the kiftas, the eggplant with yogurt sauce and ground lamb, the shish barak (beautiful tiny dumplings/raviolis in the delicious yogurt sauce), kibbee b'siniye (this was one of nostalgia for a lebanese friend).  The stuffed cabbage was a bit sweet for my taste, but I feel that way about stuffed grape leaves too.  The desserts and pastries were amazing too and they do all their own baking in house.  All in all, we had a great meal and were treated very well for arriving after 10pm and leaving 90 minutes later.  Tripoli is more than just a restaurant, it is a cultural service and a beautiful example of the wonders of the Middle Eastern kitchen.  And to think I had wanted to go to Zaytoons just because it had more stars on Yelp!", "author": "Lady A."}], "servesCuisine": "Lebanese", "priceRange": "$11-30", "name": "Tripoli Restaurant", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "156 Atlantic Ave\nLower Level", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/wUpuiivACa85H73VwF8izg/ls.jpg", "@type": "Restaurant", "telephone": "+17185965800"}