{"aggregateRating": {"reviewCount": 106, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-05-31", "description": "Not a fan of the place: service was ok, but food was very blend and fresh? Definitely not close to the Lebanese food I had at other places. The setting of the place is awkward, very old-fashioned in a dusty way, and drinks limited.\nIn a nutshell, very unexciting. Hope they would try a relooking of the place and the menu to shake things up.", "author": "Nif R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-02", "description": "Not unlike the other reviewers for this restaurant, I too would like to commend the chefs on the delectable culinary repertoire of middle-eastern cuisine. Not to conform, but yes, the shish taouk (the grilled chicken dish) was better than my mom (or any mom for that matter) makes it. The \"family-run\" dynamic it offers unveils itself in the dishes, accurately encapsulating the \"home-cooked meal\" feeling. If you are looking to dine in the depths of Lebanon without leaving Brooklyn, I highly recommend the Tripoli restaurant.", "author": "Drew G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-06-06", "description": "Tripoli had really adequate/friendly service and decent food. I would recommend this place for groups. I would not go back there as I can find a dozen better places to eat Middle Eastern food.", "author": "Steven P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-19", "description": "we went to tripoli last night .we ordered tripoli meza for appetizer .. humus and Babaghanoush were excellent especially pickle was perfect .. that is the best pickle i have never tasted in my whole life.. they have the best shish tavouk .. service was friendly and really fast .. we stayed there almost 2 hours.. and we enjoyed it every minute of it .. it is fantastic atmosphere.. I highly recommend it!", "author": "Shawn T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-03-13", "description": "I want to start by saying that this was the best Lebanese food I've had in NYC so far. My friend and I noticed on the menu that you could bring in your own wine or beer to drink so she ran to get a bottle of wine at Brooklyn Wine Exchange. They charged us for opening a screw-top bottle of wine without letting us know that they would, and when a friend of ours arrived, they paid absolutely no attention to him. We had to ask for a glass for him, and they never bothered to ask if he wanted something to eat... which he did.\n\nOverall I would rate:\nFood = 5 stars\nService = 2 stars\n\nWe ordered the sampler which consisted of: Falafel, Hummus, Baba, Feta, and Olives with fresh warm Pita Bread.     5/5\nand then we also ordered the Mjudra, which consists of Fatoush and cracked wheat with sauteed onions 5/5\nAnd for dessert we ordered the Bird's Nest 4/5", "author": "Adrianne E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-02", "description": "Delicious food, Unique atmosphere, over all good experience. The only critique is that I order the Chicken Shish Taouk and there is never enough chicken. the dish is 14.95, and the chicken that comes with it is delicious. But there is never enough. There is however more than enough rice and salad. So for $15, where is the MEAT!", "author": "Jason P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-06-24", "description": "Delicious Lebanese food.  We ordered the mezze platter of appetizers, and 2 veggie dishes. Everything was tasty, but not the best Middle Eastern in the area in my opinion. Dessert wise, the baklava was dry and uninspiring, and went straight into the trash.  Beware of delivery they are very slow, our 45 minutes took 90 minutes to arrive.", "author": "Tara K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2008-01-02", "description": "First things first - if you are looking to have any kinda alcohol with dinner, buy BEFORE you go - this place is BYOB.  There's a supermarket right across the street for some beers and about two blocks west on Atlantic there's also Heights Chateau (great selection of wines but overpriced).  \n\nAnyway, that part of the meal was definitely a big bummer (this did effect the rating, if you're wondering).  We sat down for about 5 mins and the place was empty.  I mean, no one there save a Middle Eastern family of about 10 in the way back.  The ambiance is nice, and the location is key (we got a corner window seat as well) so we'd thought to try it.  We started with the Tripoli Maza a combination appetizer plate consisting of hummus, babaganouj, cheese, olives, \u0026 falafel - FANTASTIC!  We dipped and dipped and it was awesome....not too salty, not too tangy, just right and just enough for two. Then two vegetarian entrees that were also good - not great.  Can't recall what they were but mine was eggplant.  Again, ambiance is so-so, the place is usually dead but the food is good.  The service was by some 15 yr old kid that seemed to be cordial but not really attentive.  Would order out but not eat there.  The food was definitely very good.", "author": "Joe O."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-07-15", "description": "Ordered delivery through seamless. The quantity was insultingly slim and we spent $40 on two main courses. We had to go make some additional food from our kitchen after eating here. A total waste of money for mediocre food considering there are so many good Lebanese restaurants in NY. Stay far away from this and hope that a better establishment takes over.", "author": "Chris N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-25", "description": "Its great if you want to try Lebanese food and don't know what to order... Get the Meza platter!! Its $42 for 21 small plates of all the basic Lebanese dishes. You can sample it all!   BYOB is great, keep in mind there is a $5 corking fee.", "author": "Jill Z."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-11-13", "description": "I absolutely love this place. No, it's not elegant and no it doesn't have a ton of diners... but this place is totally authentic.\n\nI grew up in a Lebanese family with big dinners and decor like Tripoli's. I'm always looking for homemade, delicious Lebanese food prepared the way my grandmother makes it. And this place stacks up. This is true Lebanese food (with just the right amount of parsley in the Tabouli). \n\nIgnore the snobs on here that want ambiance or whatever. If you want good food, Arabic music and a new favorite place to eat -- go here.\n\nI ate there for my birthday and the waiter went out of his way to put a dessert plate together for me, complete with a lit candle and all. This family-run place has now shot to the top of my list.", "author": "Kaylee K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2007-08-24", "description": "Tripoli has wooden chairs that are vertically long and beautifully wrought with designs on top. Combined with the very silent atmosphere, I almost felt like I was in some Lebanese temple. \n\nSitting by the windows, though, lends a very nice atmosphere for a quiet dinner. My friend and I split an appetizer: a plate with hummus, an eggplant spread called bubba ganush (which name I only thought was a joke on Wedding Crashers--guess not!), pink beets, falafel, cheese, lettuce, tomato and olives. We made a few tasty sandwiches combining the appetizers onto flatbread. Although it was delicious, it seemed a little too salty for my taste, and I wished there was at least more tomato to offset the sting. \n\nPrices were okay, and the staff was quiet and serious. \n\nOverall an interesting experience. Judging from the quietness of the place, though, I almost feel like I'm saying too much. \n\n.", "author": "Natalia M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-11", "description": "I think this place is completely underrated and I never understand why it's so empty especially with the shortage of Lebanese restaurants in NY.  We ordered the maza so got to taste a lot of what they offer. The service was mediocre--we were one of two tables seated and somehow there was a bit of wait time. Also we weren't sure why they delivered all the food at once, which left us with 20 plates to eat at once, some cold and some hot. We'd have preferred to have them a few at a time, BUT THEY WERE DELICIOUS! I wish they'd do some kind of makeover because the interior is a little lackluster and may be a reason why people aren't drawn to it. Anyway, the food is enough to get me back there anytime!", "author": "Alissa C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-01-10", "description": "I liked this restaurant for the food - the ambiance was weak. We were one of two or three tables being served... and it kinda spoils the whole \"let's go out\" feeling when you can hear your own fork clanking against the plate, and it echoes in the room!\n\nThe food was tasty and I would recommend the lamb kibbeh.\n\nIf you want to drink, remember to bring your own", "author": "Andrea C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-09-30", "description": "I appreciate the manager's comments, but the food was not good, not right ( I was served fattoush and the waiter, who could not have been Lebanese, insisted it was tabouli ).  I also ordered mint tea and was brought some sort of cardamom tea.  No mint to be found.  Must have been an off day if the restaurant is as good as others say.  Sadly, I won't be back.", "author": "Christine S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-30", "description": "I've been here several times and I have yet to leave disappointed. The wall is painted sky blue with what I assume is the coastline of the city of Tripoli; it's beautiful! There are never many people in the restaurant but that doesn't stop me from eating there. I've had appetizers and mint tea (which is imported- I love it!). My favorite is the combination platter with rice, it has 3 types of grilled meat (chicken, beef, and lamb) and it comes with rice and a salad. The chicken and beef are always superbly grilled and very juicy and tender. However, the lamb is always problematic, to me it seems very rubbery. The hummus and babaghanouj are also quite tasty. If they can improve their grilled lamb, I will give them 5 stars!", "author": "Sidrah M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-13", "description": "Being Lebanese we are difficult to please when it comes to food in general, and when it comes to Lebanese food we are damn near impossible.  Tripoli is the best I've had in NYC yet, and yes Tanoreen its even better than you are.  \nWe had the mezze platter, which included Labneh, Hummus, Baba Ghannouj, Falafel, pickles, olives and fluffy white Arabic bread.  It was all delicious.  I mean seriously mind bogglingly perfect.  Just like home.  The falafel was especially delectable as it was crispy on the outside, warm fluffy and light on the inside.  We then had the kibbe nayye, which is a raw ground lamb with cracked wheat, olive oil and spices.  Nelly's mom who makes amazing kibbe would have almost smiled.  It really was excellent, fresh and very tasty. \nWe had the sausage, mjaddara (a dish made with rice and lentils), the fattoush salad, and grape leaves.  It was one of those moments that go down in history as we took food home because we couldnt finish it! Blasphemy.\nThat said, it really was as close as it comes to the real deal.\n\nIts a 4 because its REALLY expensive.  I mean mindbogglingly so.  For $80 in the real Tripoli you could feed a family of 8 plus their camel (I'm joking there are no camels in Tripoli, only donkeys).  So yes, a 4 but we will be back!", "author": "Lama B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-02", "description": "There is nothing like Tripoli for incredibly sumptuous Lebanese food! We got the mixed grill, kibbe, and ground lamb with eggplant, pine nuts and yogart. Prior to that we had pita bread, babagnosh, hummus. We come all the way from Westchester Co. And will be back soon!", "author": "Candace A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-03-30", "description": "I'm really a little puzzled by the poor reviews for this place.  My family is from the middle east, and the food I had here was quite good.  The place is a little old and dusty, and service haphazard, but the food is really tasty and as authentic as I've had in NYC.  For example, we ordered the mezze platter, and got some excellent falafel, cheese, hummous and baba ghanouj, all tasty and all with acceptable pita bread.  My meal, stuffed squash with yogurt soup, was also spot on.  If you think the food here is bland, as I notice several people suggested, I'm a little at a loss at what you expected.  This is more or less what Lebanese food tastes like.  What else would they serve?", "author": "Raffi M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-24", "description": "I went to Tripoli with a craving for Lebanese food on my birthday. It was great. The food is delicious -- loved the eggplant and the foul mudammas -- and reasonably priced, and the service is very friendly. We had a party of 8 and there was plenty of space. Also, we didn't tell them it was a birthday party, but they overheard us and brought dessert on the house. Great neighborhood restaurant.", "author": "Seyward D."}], "servesCuisine": "Lebanese", "priceRange": "$11-30", "name": "Tripoli Restaurant", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "156 Atlantic Ave\nLower Level", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/wUpuiivACa85H73VwF8izg/ls.jpg", "@type": "Restaurant", "telephone": "+17185965800"}