{"aggregateRating": {"reviewCount": 106, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-10-06", "description": "OK, first off, they'll all chipper and say it's BYOB.  When the bill comes there's a $5 charge for a \"wine fee\" (cause they set glasses on table?).  Yes, I'm cheap and hoping to cost them more than that with this review, but I had the Eggplant Stew.  It took nearly 40 minutes for the food to arrive and it was essentially a can of, less good than Campbell's tomato soup, with-I kid you not-two peices of eggplant in it.  Also a few hunks of some potato type thing.  Also the Spinach Cheese Pie should only be eaten in Greek restaurants.  Skip this place, way not worth the time or BYOB feeeeees...", "author": "J C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-05-18", "description": "Just came back from a horrible, nausea-inducing and overpriced meal at Tripoli that literally made me sick to my stomach. My husband snd I read some positive reviews of this place and decided to give it a try, but boy, were we wrong! My first clue to get up and leave was the 'imported' Lebanese mint tea that tasted just like generic Lipton. It was followed by microwaved pitas from a grocery store with babaganoush - the only saving grace of the entire meal. Real trouble came when i ordered cous-cous with chicken, beef and lamb stewed in tomato sauce. Sounds good, doesn't it? Well.. what was brought to the table was a small bowl of gray chunks of mystery meat with large pieces of boiled, limp veggies in weak tomato water devoid of even a whisper of flavour. Alongside it was served a plate of bland cous-cous with no seasoning at all and about five raisins, topped with thin strips of chicken. My husband got the mixed grill plate that was barely edible. In conclusion, we spent $50 and left with stomach aches. Never again.", "author": "Snij F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-07-10", "description": "I remember this place of 15 - 20 years ago. It was wonderful and bright and the food was a treat. Now it's slightly disappointing. The food was good not the great I remembered. Especially good was the appetizer plate Tripoli Meza and my friends enjoyed the mixed grill. My Ma'ani was dry but maybe that's the way it's supposed to be. The servcie is what I had issues with. The place was by no means packed but service was still very slow. I owuld have rated it 5 stars 15 years ago but not so much now.", "author": "Bonnie P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2010-03-13", "description": "Awful, awful food.  I know tasty Middle Eastern food, and this place does not have anything tasty or delicious.  I'm sorry, but people who claim otherwise have never had really good Middle Eastern food.  Save your money.", "author": "Stephanie A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2007-11-20", "description": "I've been there a couple of times with big groups.  Its BYOB which helps keep the price VERY reasonable.  I've always had great meals.", "author": "Julie T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-03", "description": "This was a fabulous restaurant!  After searching for an authentic Lebanese restaurant for many months I have finally found one.  The service and food were wonderful.  My husband and I will definitely make this a regular in our rotation.", "author": "Johanna G."}], "servesCuisine": "Lebanese", "priceRange": "$11-30", "name": "Tripoli Restaurant", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "156 Atlantic Ave\nLower Level", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/wUpuiivACa85H73VwF8izg/ls.jpg", "@type": "Restaurant", "telephone": "+17185965800"}