{"aggregateRating": {"reviewCount": 143, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2019-01-31", "description": "I've been wanting to try this place for the longest time especially after watching that video of Rick Ross glorifying Wing Stop on First We Feast.  \n\nI decided to give the spicy Korean and hickory bbq boneless wings a try alongside some of their signature fries. Man when I opened that bag, the smell of hickory smoke from the wings hit me right in the face. I don't think I've ever had that experience with bbq wings before. Usually when I go to Buffalo Wild Wings I stay away from the bbq wings cause it's just plain and boring. But here at wing stop, that is definitely not the case. The bbq flavor was amazing, the batter had a nice crunch to it, and the chicken was very tender. \n\nThe spicy Korean wings were too sweet for me though and wasn't spicy enough either so I'd probably opt for a different flavor next time...maybe I'll try out their famous lemon pepper. \n\nFries here were great as well. They were seasoned very nicely and were very crisp and flavorful. This place is pricier than the wings I usually get but in terms of flavor and quality, it is much better. I'll be back to try their other flavors!", "author": "Phil L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-10-13", "description": "Items Tasted:\n- Original Hot: The chicken is not that spicy, but it does has a heavy buffalo flavor. It's mediocre \n- Garlic Parmesan: This is nicely flavored \n- Lemon Pepper: It's more salty than peppery\n- Honey Mustard Dip: This is slightly sweet but super tasty \n- Fries: They are just okay", "author": "Jenny C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-06-01", "description": "Went to get wings because my son is in the hospital and he was craving them ...... asked for them to be well done. They were definitely not well done let alone cooked, there were undercooked parts of the chicken it was gross..... call back not even rude and this jackass tells me first there's not enough oil to cook the chicken I'm like wth.... then tells me there's no way my chicken is under cooked and that it only takes 10 mins to cook the chicken and they cook it for 13 so I couldn't be telling the truth. What in the entire fuck I'm not asking for a discount I dont want my money back I just want my foor the way I asked and paid for tf ..... never ever again !!!! Freaking ridiculous and hes a fucktard should probably not be working around people.... the guy with long hair dont know his name.", "author": "Victoria S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-30", "description": "Really friendly service!!\n\nYou can order online, phone it in, eat in, or order to go at the counter. I opted to order online, and went in to no patrons. Food was hot and fresh for apartment eating.\n\nOrdered the Hawaiian and mango habenero. Their wings are quite a bit smaller, but so juicy and meaty nonetheless. They put a little paper divider between my flavors, which I really appreciated.\n\nMango hanenero wasn't too spicy, I was nervous to get their atomic. But apparently the habenero is right below the aromic spice level, so I'll try that next. \n\nThe guys there are also super friendly. I was greeted well and treated kindly.", "author": "Maggie C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-02", "description": "Saturday = cheat day. What better way to cheat then some wings, fries hard and lost if ranch. I love this Wingstop because my order is always correct, hot, and yummy.\n\nThe BBQ were shockingly good. I always get the lemon pepper and the original, but this was my first time trying the BBQ. Def would get them again. Last time i got the tenders in mild, which were great, but lacked the kick I wanted.\n\nI'll probably be back next weekend.", "author": "Mia N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-04-21", "description": "I STOP for Wingstop. I discovered this spot because it was close the Planet Fitness I used to frequent. The wings are amazing. The mango habanero, lemon pepper and Korean BBQ  are a must. Dont forget the rolls and fried cajun corn. Trust me you wont be disappointed. Enjoy", "author": "Todd M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-07", "description": "I loved this Wingstop it was my fiancé and i first time there. It's so big. tables were a little dirty but hey good thing i had my wipes handy. the guy forgot his name but he was very nice and helpful. I loved my wings i had the spicy Korean sauce it was awesome.", "author": "Shade B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-11-11", "description": "I usually like going to this spot once I finish my kickboxing class, but honestly I'm going to have to find another place to eat. Before I even placed my order I distinctly asked the cashier\"can I have half boneless wings and chicken wings for the Family meal plan?\" Needless to say my entire order was messed up. When I got home and I checked my order there was only boneless wings. One of the sauces spilled all over my veggies sticks which was a waste because they got soggy. I mean the food is really good. My only issue is they need to Listen!!\nNext time I will check my order before I leave!!!", "author": "Kisha R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-02-11", "description": "Yo dudes... get your god-damed act together.  Super Bowl Sunday is your marquee time of the year.  That's when you gotta step up your game and make a good impression!  What is the point of your incredibly detailed online ordering mechanism if you're just going to screw up the order??  Here's the deal:  I ordered the 50 pc party pack + 12 rolls (helpfully suggested add on by the online ordering mechanism).\n\nPack comes with two large fries, I got one.\nComes with two sets of veggie sticks, I got one.\nComes with 4 dipping sauces... well I got 4 but none were the flavors I requested.\n\nAND my rolls were missing too.  Step your game UP Wingstop!  Your wings are good.  I would actually like to order from you again!  But not if you can't get a simple order straight!", "author": "Ajay R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-03-05", "description": "DO NOT ORDER ONLINE HERE. When I got here, I asked the man if my order was ready and he kept talking under his breath like he had an attitude. On top of that, it turns out my order was never printed out so I had to wait 30 minutes. What was the point of ordering online? I understand mistakes can happen. But at least don't be rude about it or throw in some extra wings.", "author": "Jada M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-12-05", "description": "Very unfriendly and unpleasant lunch time crew. A middle aged carribean man took my order and seemed like I was ruining his day by doing so. An overweight light skinned woman had an attitude with my wife and I when we told her the drink machine wasn't working. Her exact words were that she was aware of the issue and we can have a bottled drink instead but must pay extra for cokes because they cost more. \nCostumer service here is awful for lunch but great for the evening. Management needs to look into retraining. I will certainly second guess coming back.", "author": "Andrew M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-13", "description": "The cashier was friendly and I even received an extra wing! The food was good and though the wait time was long, it is worth it!", "author": "Sophie T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-19", "description": "If your craving for wings, this is the spot to go to. They have a variety of rub options. Boneless chicken and bone wings. Takes awhile to make, but comes out fresh and crunchy.\n\nOrdered the 8 piece combo. Half Louisiana rub and half Lemon Pepper with fries and a drink. The Lemon Pepper was very good! Salty, sweet, and spicy. Louisiana Rub was flavorful and spicy. Both are not saucy type, which I prefer. Fries were ok. Was kind of soggy.  Would come back to try other win flavors.", "author": "Cory D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-24", "description": "Boneless honey bbq wings and the Potatoe salad are delicious and that's all I come here to get.", "author": "Jessy L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-03-29", "description": "my husband and i love wing stop! the lemon pepper is the best non spicy flavor and the habanero mango is the best spicy flavor. bone-in is the way to go! theres much more flavor. do not order the atomic wings! they are aweful! as far as flavor, there is none and the smell is bad. the hotness level is beyond anything ive ever tried! it literslly put my stomach in knots and sent me to the bathroom after only 1 wing!", "author": "Jessica G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-11", "description": "Mmmhmmm these wings are TASTY!! For the price I feel I got a great value and will most certainly be back.\n\nFriendly staff and helped me pick the garlic parmesan and Louisiana rub. I enjoyed both but felt the garlic Parmesan seasoning was coated on a little thick - some like the seasoning this way but I just do not prefer it. Louisiana rub had great flavor.", "author": "Lexie M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-06", "description": "Ricky was extremely helpful. He explained the menu and all the flavor options available. Food and service was amazing!", "author": "Gabriel G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-01-04", "description": "Tastes good and it's filling. There's a good variety of flavors. I love the soda machine. They have one of those new soda machines inside. The baked rolls are worth trying. They're so good. I gave 4 stars because the food was pretty salty.", "author": "Vincent S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-12-08", "description": "The food is great a customer service is also great I just wish you Guys had Cable so your customers are able to watch the game it really sucks guys please work on getting cables", "author": "Bklyn's F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-17", "description": "Left my eye appointment and it was pouring raining so I stopped here to grab food and wait out the rain.  It wasn't crowded during the afternoon, but this could also be due to the rain. I had 3 mild wings and 3 mango habanero wings with fries. The fries are delicious, and this is the case at every wing stop that I've been too. The mild wings were good but a little too oily. The mango habanero wings were very delicious and also very spicy. If you like a little kick to your food, def give it a try. I found myself having to drink some of my juice after each bite (my heat threshold is pretty low, FYI). \n\nOverall, the food was good. I think I'd skip the mild next time I'm at this location  and  try something different. Also, they are open until MIDNIGHT which is a huge plus", "author": "Robin T."}], "servesCuisine": "Chicken Wings", "priceRange": "$11-30", "name": "Wingstop", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "289 Livingston St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/3bsBbRiofGhCljCT4rtYAA/ls.jpg", "@type": "Restaurant", "telephone": "+17182609464"}