{"aggregateRating": {"reviewCount": 143, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-21", "description": "I. LOVE. WINGSTOP.\n\nWas so glad to hear this location opened so that I wouldn't have to trek all the way to Queens for my beloved wings! I always seem to come here later at night so I have no problem with parking or waiting long for my food (although the min. wait at any given Wingstop is like 10-15mins which is no biggie since I know what I'm waiting for is worth it!)\n\nI always get the garlic parm and lemon pepper and they never disappoint! They have that coke machine with all the different flavors that you could mix and match and the music always seems to be good in here too!  Decent amount of seating, but looks like it could get packed when busy.\n\nNom, of course I'll be back! Hopefully sooner than later now that I'm thinking of those delicious wings!", "author": "Renee G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-03", "description": "The best Wingstop that I've been to. Their wings are huge and always taste delicious. Their sauce and spices are terrific and the fried they make are on point. Wish they could come show the Cali Wingstop how it's done!", "author": "Dmitriy N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-17", "description": "After a long day of criss crossing the city through the day, I met up with some friends at Wingstop last night.  We all ordered the Hawaiian, teriyaki, Louisiana rub, garlic Parmesan, and original hot wings. The friends who were very familiar with the restaurant highly recommended the Louisiana Rub as their favorite, but I wanted to try others as well.\n\nThe Hawaiian, as you can probably imagine, was sweet but hard to describe. If you can imagine a cross between teriyaki and honey mustard, that might be it.\n\nThe teriyaki was teriyaki.\n\nThe original hot were, hot wings.\n\nThe Louisiana rub was true indeed extremely good. It was a well-seasoned dry rubbed wing with plenty of flavor, just the right kick, and as all the other wings, super juicy bust still done on the inside.\n\nThe garlic Parmesan was also phenomenal. Imagine a garlic dry rubbed wing then sprinkled with parmesan cheese.  Nice!\n\nAll the wings were very juicy and the NBA Finals game complimented them very well.\n\nTo put in perspective of what I think of these wings. I went back to Brooklyn from Manhattan and picked up some Louisiana Rub and Garlic Parmesan wings today, a day after.", "author": "Sheldon S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-10-22", "description": "This post has nothing to do with the food and everything to do with the service. I recently ordered using the mobile app, pre-paid and when I arrived to pick up my order the confused looking cashier asked didn't I send someone else to pick it up because \"someone with the exact same name had come and pick up the order already\". Now keep in mind that it's not impossible to have the same name as someone else, but what are the chances that two people with the exact same name would order the exact same meal on the exact same day??? Maybe it's just me but that doesn't seem to right. I honestly would have respected it more if he had just said \"I fucked up and gave your order to someone else\", but to l insult my intelligence and say someone with the exact same name had come and pick the order up already, come on bro!!! Then to top that off, they had the nerve to offer me someone else's meal that was already prepared with less than what I had ordered initially. No refund, nothing extra, not even the original order, but something less with a damn roll. Oh and when I asked for a managers name, I was ignored as if I didn't ask a question. Now I understand mistakes happen, but own up to it. I'm very disappointed in the service this visit and corporate will be hearing from me about how unprofessionally this situation was handled.\n\nWORD OF ADVICE: DO NOT PRE PAY FOR YOUR ORDER. I bet know one will get your order then.", "author": "Zee G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-01-30", "description": "The food is great of course but the service at this location is bad. I ordered online went to pick up and cashier tells me a order never went through online. Showed him the email confirmation and looked at me as if I was lying.  had to wait 30minutes for my order I placed almost an hour and a half ago. Smh", "author": "Ismael M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-08", "description": "LEMON PEPPER WINGS.\n\nSo glad that this place is in Brooklyn. I was a frequenter of the Wingstop franchise out in Cali when I lived there and being that I've been to several locations I have to say that his is probably the cleanest one I've been to.\n\nAll ya'll giving them anything less than 5 stars don't know how good ya'll have it at this location compared to the other Wingstops I've been to.\n\nI actually found the staff to be pretty friendly and attentive IMO for BK...lol. I'm a regular.", "author": "Jeanna L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-04-10", "description": "Hmmm I have so much things to say about this place.\nThe wings here is pretty good, but it can still never beat buffalo wild wings hahaha!\nLike everyone here says THE SERVICE SUCKS ! I never had such a bad fast food experience before. So I got there and got on the line to order. I waited literally 15 mins just to order my food and to mention there is only one person infront of me and he has been there since I got there. Finally it was my turn I told the guy that I wanted a 8 pieces hot wing combo with fries and he said okay 20 seconds later he says HUH what you want. Are you fricken kidding me ?!  How ridiculous is that ! Then he ask what is my name and I said Liliann\" , had to repeat it 4 times before he got it correct.\nNow comes to paying I gave him my credit card and he stared at it for a good 30 seconds not know where or how to swipe. It was pretty ridiculous. There was about 10 people behind me after I was done paying. Even the lady behind me got annoyed too when she was ordering she repeated her order too many times. He even forgot my cup for my drink :(. Now the wait was about 10-15 mins as I expected. The workers there are really really talkative and slow. Once my food was ready some girl called my name with a really nasty attitude I went to pick up my food next thing you know she says Oh hi liliann with a sarcastic voice. -_- MEH. I brought my food home since I didn't wanna eat there the music was too loud. The wings and fries are delicious, however the wings aren't spicy enough. The blue cheese here is so fricken good ! They don't have take out boxes here which is really annoying cause your food gets cold faster then it would with a takeout box. And its pretty pricey here about $12 for a 8 wings combo with fries and drink.", "author": "Connie L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-02-13", "description": "No! No! No! \n\n\"She thinking Phillipe's, I'm thinking Wing Stop\" \n\nRozay is definitely not thinking of this Brooklyn franchise! Trust!  This place is the ultimate worst place I ate downtown Brooklyn. Like the service is ridiculous on so many levels. I ordered my food at 10PM. I got there around 10:20 PM just because I wanted to make sure I wouldn't have to wait.. I didn't leave until 10:50PM. That is pretty ridiculous! It's a FAST FOOD/CHICKEN JOINT! There were at least 4 people on staff for the night.. and they were so slow \u0026 talkative \u0026 just waddling around. So I paid and waited - after 25 minutes, the cashier says an employee dropped my chicken on the floor by accident.. would I prefer a wing chicken (since some are boneless).. I was like whatever.. anything to get me out. \n\nThis review isn't strictly about the service. Trust - I'm not one of those anal people when it comes to long food preparation -- especially if the food is incredibly good.\n\nHOWEVER! This chicken may hands down be the worst excuse for a chicken wing in history. The chicken was inedible because it was fried so hard. You couldn't even break it apart. It was also 1/3 of the size of an average chicken wing. YES 1/3 - it looked like scraps.. I was so appalled \u0026 couldn't believe how wack my experience turned out to be.\n\n Why didn't I upload any pics! Huge fail on my part... But this place is pretty ridiculous. Like on all levels - Eat at your own risk. It is by far the worst chicken spot I been in.. I'm pretty sure it's because of the staff.. so I have to try the one in Miami.", "author": "Jul B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-03", "description": "Love the wings here! Sauces are good. Great customer service, food comes out quickly, clean and is well managed.", "author": "Angie B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-01", "description": "I actually really love this place.  If I checked in all the times I've had lunch here I'd be a dutchess or something, but i always forget *shrugs.  My favorite flavor is the lemon pepper, and I squeeze the lemons for you iced tea on em to make them extra sour, yum!   Oh, and the fries are really, really good as well, i dip them in ranch and it's so good.  \n\nThe staff is very friendly and professional.  The restaurant is always clean (as is the bathroom, bonus points). There is no trash can, (which i find weird since they've been in business for months now)  but you can leave your trash on the table and they clean it up right away, or you can take it to the counter and they'll throw it out.  \n\nI only have 2 gripes: for one, they take forever, BUT if you're smart like me you learned after the first epic wait to call in the order 20 minutes early and it's ready when you arrive.  Second, to me it's a bit pricey for what you get.  It's good food but a lil steep for a chicken spot.  Other than those two things, no complaints.", "author": "Jessica B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-24", "description": "Found my new favorite fast food spot for wings.. The order came super fast. Although the wings are tiny they're good. The fries aren't your ordinary fries. It had a sweet taste to it and I'm not a fan of fries. Good stuff.", "author": "Jasmine T."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-02-27", "description": "I'm so disappointed. The hot wings were soggy and not spicy. The boneless teriyaki wings were horrible. I won't be ordering from here again.", "author": "Olivia G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-06", "description": "This was my first time ordering out at this location. I pre-ordered for the Super Bowl over the phone about two days in advance. They took my order and triple checked to make sure everything was right. I even got 5 free boneless wings from a deal on the Wing Stop app! And even though I ordered through the phone, they gave me the app deal anyway! So sweet!\n\nWhen I got there around 5pm Super Bowl Sunday, it was packed! Apparently, it didn't occur to people to order a day or two in advance. I think I saw Nichelle M. (who left an earlier review) when I was there too. She was yelling at the counter guy because she couldn't place an order over the phone. My response is:  what did you expect? Of course it was going to be packed. Of course their phone lines are going to be tied up. It seemed like a lack of planning that resulted in her dissatisfaction. I feel personally offended by her bad review because I do have a certain love for Wing Stop; especially after they took such good care of my order today. \n\nI was completely pleased with my Super Bowl order experience! I pre-ordered for a 5 o'clock pick up. Like I said, it was a damn jungle when I got there. It seemed like more people were waiting for their food than there were people ordering-- which makes sense since they cook to order. A woman in non-uniform clothes took my order. She looked up my preorder and had someone else ring me up. After I paid, it was about 5 minutes before my order came out. I checked the peek through window on the side just to see HOW crazy it was and let me tell you... They probably had about 15 employees cramped back there all on top of one another.\n\nAnyway, my chicken was fresh and piping hot! It came in a huge brown bag with no handles. I kind of balked at how big my order was. The non uniformed girl (I'm guessing the manager) offered to get me a big plastic bag but I declined. She was frazzled enough! I was in and out in 15 minutes!\n\nKnocked off a star because:\nTheir wings are smaller than other locations I've been to.\nPackaging! They packaged my veggies and fries in open faced containers. Couldn't they have put them into one of those closable to-go styrofoam containers?", "author": "Stephanie F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-04-28", "description": "The wings are good, but the buffalo sauce was ok and the blue cheese is terrible.  This was a last minute stop due to indecisiveness. A friend recommended this restaurant, so we ordered the 10 piece boneless strip combo with the hickory smoked BBQ sauce and buffalo sauce, and a side order of boneless wings with the hickory smoked BBQ sauce. \nThe wings with the smoked BBQ were the best.  We'll definitely come back for those.", "author": "Krys V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-21", "description": "Wing Stop! Yes!! !\n\nA friend and I had lunch recently at the new Wing Stop in Brooklyn, and it was a excellent!\n\nThe food came out quickly (which was great cause we were pressed  for time), and we were pleasantly surprised at just how good it was!\n\nWe ordered wings, fries, veggies, and some rolls- everything was very fresh. \n\nThe lady behind the counter helped us figure out what to get. She was very sweet and made some great suggestions...Now I look forward to trying out the rest.\n\nThe restaurant itself was very cute \u0026 SUPER clean. I especially loved the soda machine!! ! \n\nBottom line: Wing Stop has great service, EXCELLENT wings, and fast!\n\nI can't wait to go back.", "author": "Tia B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-12", "description": "Amazing .. The only word that comes to mind when your mouth waters over these deliciously made wings, infused with amazing flavors and such fresh ingredients. I recommend coming here with anyone and everyone.", "author": "Henry F."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-08-24", "description": "Absolutely no good.  Fries were sweet n burned,  the wings were not tasty at all,  let's just say never again.", "author": "Define_Me N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-02", "description": "The wings and fries were both crispy and amazingly good. My only complaint is the wait. It took forever to get my food ( luckily I wasn't in a rush ). Also, there is no WiFi.", "author": "Sade E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-15", "description": "I love wings and I'm so happy I found this place in BK. Their service is really good and the wings are cooked to perfection. My favourites are the Louisiana rub, lemon pepper and the atomic. I eat extremely spicy food and their atomic sauce was hot with ample flavour, something that other wing places don't have. I hate heat and no flavour and I'm happy to say that this place does not disappoint. I literally went there three weeks in a row after the first time :) Definitely using them for catering next time.", "author": "Sadikchhya B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-07", "description": "Great wing spot! many different flavors. Soda machine is one of the highlights of the shop, loves the choices. The environment feels hip and television screens to accommodate with eating XD Reasonably priced 5stars cause you'll see me again.", "author": "Li H."}], "servesCuisine": "Chicken Wings", "priceRange": "$11-30", "name": "Wingstop", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "289 Livingston St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/3bsBbRiofGhCljCT4rtYAA/ls.jpg", "@type": "Restaurant", "telephone": "+17182609464"}