{"aggregateRating": {"reviewCount": 143, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-20", "description": "I found this place while at work. One of my co-workers had a small order of the Mango Habanero Wings and they looked delish and all shiny and glazed...I was inspired to check the restaurant out.\n\nI ordered a to go 24piece 3 flavor mix of wings (I'll be having wings for a week) not cooking much these days ...long hours. Anyway I ordered Teriyaki, Hawaiian and Mango Habanero wings to go.\n\nThe order of Wings come with fries and veggies well, I get the Wings home expecting the Wings to be plump, juicy and full of flavor. Well all three of the sauces taste a bit similar to me the Mango Habanero is clearly more spicy...but honestly these Wings in my estimation just okay. \n\nI simply didn't experience juicy plump wings. I think they were over fried, yes flavorful but not juicy. They look pretty but Mmmmm they're just okay. I did however enjoy the fries and veggies. The Wings come with a dipping sauce. I asked for blue cheese...the blue cheese was very liquid and tasted more like a ranch mixed with mild blue cheese with pieces of blue cheese in it.\n\nOverall it's not the absolute worst or the absolute best...to me it's just average.", "author": "Nzingha Z."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-08", "description": "This place is AMAZING: 11 flavors (from mildest to spiciest), which all are actually _flavors_ in the first place, you know what I mean here :), legit fries, veggies, and the soda machine with tons of drink combinations (yes, that one famous Coke's). Extremely recommended for wing lovers :)", "author": "Peter O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-19", "description": "I love wingstop and this wingstop is very good.  Some wingstop are not well run but this one is good.  Food always fresh and clean.  I really love to get the spicy wings here.  I could eat like 20 by myself.  It is a really bad habit because then I become a real fat ass.  If you in the area I would recommend this wingstop.  Clean place as well so you know they care.  I hate dirty restaurants.", "author": "AL C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-19", "description": "I like this location. It's clean and the employees are friendly. The wings are good and the food is freshly made. Expect a few minutes wait as the wings are fried to order. Their sauces and rubs are good too. I've had the classic hot which is a go to. The park garlic is butter, Park, and garlic. I like to mix that one with the buffalo. Lemon pepper leans towards the lemon. Their mango habanero is sweeter than say Buffalo Wild Wings hit still brings the heat. Fry seasoning is awesome and has bit of sugar in it. They offer ranch which is great here in NYC where people hate ranch.", "author": "Scott B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-25", "description": "Best place for Wings in Long Island;fair price;good quantities;fast service considering how busy they are....Energetic and skilled staff.Wing experts indeed!!", "author": "Saj V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-26", "description": "A good wing place in the area. they have lots of sauces and flavors.\nIt's listed here as a sports bar though they have only one tv and they don't play sports all the time.", "author": "Joseph S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-11-10", "description": "My husband and I used to be obsessed with Wingstop for their famous lemon pepper wings. It has been over a year or so that we haven't ate from Wingstop so I decided to try this location for the first time. It was horrible. They charge you for extra flats. The wings were below mediocre. In fact, the lemon pepper tasted like soap and it was just plain horrible. I guess I should've trusted my gut when I saw that the kitchen was filled with smoke and it didn't seem clean in here. Never again.", "author": "Amy W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-05", "description": "I do not know if I like Wingstop or just this location. They make the food exactly how I prefer they are professional! The establishment is clean and the staff is sooo friendly. Lol I love coming here! They do an awesome job. Friendly, clean and the food is made to the customers preference!!!", "author": "Vanessa L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-23", "description": "I was a regular of Wingstop for years while I was going to school around here but today I ordered bone in wings to go and of course they gave me boneless. Sometimes they mess up the order even when you order on the phone. Either way I love Wingstop when they have their act together. Their seasonings are really good and worth it.", "author": "Josie J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-05", "description": "I've been here twice and they by far have the best customer service that I have experienced at wing restaurants in Brooklyn! I walked in last night after having just had a horrible experience at Buffalo Boss in Downtown Brooklyn! Diamond who was working the cashier was kind and personable! She asked me how I was, and I told her honestly. We struck up a conversation and she took my order. To my delight the food was prepared nice and hot and she even gave me 3 extra wings to brighten my day! I highly recommend going here!", "author": "Brittaney H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-07", "description": "Because of all the commercials I've seen on TV recently, I just HAD to try them. They did not disappoint! The wings took a while to come out after ordering but I did not mind it because that just means my wings are fresh out the fryer. We tried their parmesan garlic, louisiana rub, and lemon pepper. We were a little hesistant to try the lemon pepper because of the strong lemony smell (doy!) but it just somehow works! At Wingstop, you do have to pay for everything, you have to pay for the dipping sauces, or the side veggies if you want them ofcourse. I personally think that's better because not everyone eats the side veggies. Overall, the wings are very fresh and crispy and finger lickin' good!", "author": "Axl-Rose A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-12-06", "description": "Please the change of hours of operation. If it is not correct. No one picks up the phone when it is advertised it is open. This is thd second time.", "author": "Tasha S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-20", "description": "Super busy for 11 pm, the only cashier on a young lady \nDiamond was running the show. She had control of the whole store and the phone orders. She was calm friendly accommodating. Overall experience was excellent two thumbs up A+. Also and most of all food was good as we expected it to be.", "author": "J P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-02-04", "description": "Probably the worst wings I had in a while. I waked in not in a busy night and placed my order on 11:04pm. Not until 11:35pm I received my order. There was no people in front of me. The wings were super bad: over cooked, under seasoned, and bland.\n\nThey all ended up in my trash bin.", "author": "Charles S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-21", "description": "A great example of of great food as well as attention to detail...Always fresh and the staff is on point! Plus, lady at the register has the hottest old school playlists. Never left this establishment disappointed!", "author": "Wayne J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-16", "description": "Elaine is amazing!!! She has a very vibrant personality! She's a multi-tasker with a great customer service skills!! \n\nFood:\nBest Chicken Wings ever!!!", "author": "PJ F."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-23", "description": "I am extremely disappointed at the level of customer service recieced. 12am closing time but you stop taking orders at 11:30p? I called at 11:25 but they did not pick up. I'm very disappointed I ubered here and wasted a roundtrip cab fare.12am closing time is deceitful to customers, wastes customer's and is a bad business practice", "author": "Jordan T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-04-29", "description": "I went to a wing stop location before so I decided to check this out. First of all, tell me why the soda machines are always broken. LAWDDD. so I had to get bottled (which means no refills basically). Anywaysssss. I feel like their menu is super confusing as u get two sodas (fountain sodas w refills??!) for a combo and one side. Super strange. but you get two sodas and your chicken of your choice of sauce and ranch or honey mustard. \nThe lady was patient with me but it was so awkward talking to her because she was busy. And then I had to ask for the bathroom number since it wasn't on the receipt. But anyways the food was supposed to be done in 13 minutes like she said. But it took about 25 minutes for some chicken. \nChicken is pricey here.... I got garlic Parmesan and it was super oily on the bottom topped with parm. Loved the teriyaki and there is also a new flavor(  I forgot it's name). Also their fries taste just like five guys!", "author": "Wendy L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-03", "description": "Louisiana Rub on traditional wings... Bursting with seasoned spice and perfectly cooked meat. One of the best wings I've ever had. \n\nThe atmosphere was good. Service was great. Not too slow but not fast in getting our food. The boneless wings were not bad, but not as memorable as the traditional with Louisiana Rub. Cheese fries were very good! \n\nIf you like wings, you've found your place.", "author": "Dan P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-05", "description": "Overall the wings here are pretty good. They offer a nice selection of rubs and sauces to choose from and either classic bone in wings or boneless- if you're into that. \n\nThe chicken is cooked to order so it's fresh and hot when you get it. In terms of price I find them expensive... 6 bone in wings, a side of potato salad, and medium drink- $10. But you get what you pay for, the quality is pretty good. Try the Louisiana rub wings if you like your wings with a kick but don't want to deal with messy fingers from the ones with sauce.\n\nOne star short of perfect because I've never seen more than one person working the front counter and it's annoying to have to wait to order on a short lunch break.", "author": "Justin H."}], "servesCuisine": "Chicken Wings", "priceRange": "$11-30", "name": "Wingstop", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "289 Livingston St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/3bsBbRiofGhCljCT4rtYAA/ls.jpg", "@type": "Restaurant", "telephone": "+17182609464"}