{"aggregateRating": {"reviewCount": 143, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-07-13", "description": "Was ok wished it was crispy wings maybe I can order without the sauce but it was too soggy for my taste", "author": "Renee S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-02", "description": "Probably the best wingstop I've been to! The chicken was perfectly seasoned (Louisiana rub and lemon pepper).... there was a 15 minute wait but that'll do for some fresh out the oil wings  customer service was pretty good the girl at the counter made sure my order was correct when I forgot what I ordered and it was pretty late with a line so I appreciate that l! Definitely recommend Livingston wingstop the chicken even taste better than the few I been to!", "author": "Destiny M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-12", "description": "Pretty good food. Service could have been better and the place could have been more organized. Overall, an enjoyable meal.", "author": "Antonio M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-03", "description": "My second time coming and I was greeted by managment. She is awesome and a great people person. She knows how to work well with customers. My order came out super fast so it wasn't a long wait. \n\nI ordered lemon pepper and hot wings. The chicken was cooked great! But the fries!! The fries were so good I wish I had more. I would've ordered two fries if I knew they were that damn good. \n\nOverall great customer service and food.", "author": "Jaznea B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-02-01", "description": "Potato salad is the worst ever I had in my life can't believe they would sell some shit like that", "author": "Da N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-10", "description": "I ordered the 8piece combo with fries and drink via postmates. My wings were perfectly coated in hot sauce and BBQ super hot too!! My fries were fresh and super hot as well. Like nothing was lukewarm or cold! My Dr Pepper was crisp. The only thing that annoyed me was the abundance of ice in my drink lol. Other than that? My meal was delicious and worth the 10$ plus delivery fee and tip.  You guys never disappoint me with your quality. :)", "author": "Kimberly H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-13", "description": "Being a restaurant owner myself, I approach food establishments slightly differently. Things that may catch my eye, the lay person usually may not think about. That being said, this establishment is clean, the staff is friendly, and the food is consistent \u0026 delicious every time.\n\nIf like spicy, I'd say go for the mango habanero!", "author": "Ron L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-10", "description": "This place is absolutely my favorite wing place! Wingstop always hits the spot in the times of chicken cravings! The staff are super friendly, order as completed in a timely manner and a very clean inside.\n\nThe habanero wings are to die for, a must for any wing lovers in the area. Okay time to go back to eating more wings!", "author": "Jean G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-05-29", "description": "The wings are delicious when they get your order right. However, I am convince someone doesn't know how to read. They always seem to get the wrong orders. When you have a half an hour for lunch you do not have time to go back and forth because they got it wrong. If your willing to wait and deal with them then your okay. If not find somewhere that sell better wings.", "author": "Maylin S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-29", "description": "Got the 20 pieces for 19.99 with 3 flavor options and was very satisfied!  I received 6 Louisiana rub,  7 lemon pepper and 7 mild with blue cheese dips! Lets say we were very satisfied everything is made fresh and tasty and not salty like other wing places tend to be..............\nWorth a trip, they have tables but I always get mines to go!", "author": "Amy W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-27", "description": "4 Stars BC the service is quite slow and there isn't any delivery.\nHowever, as far as the food..... Lemon Pepper and Louisiana Rub are my favorites.", "author": "Ray-Ray M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-07-10", "description": "Not a fan. We may have ordered the wrong flavours perhaps. Some lemon, buffalo, cheese - 20 in total for 2 of us. The flavours were too strong and you couldn't taste the chicken. \n\nAlso not helped by the weird lady commenting on our food and then talking to herself.", "author": "Neelakantan N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-11", "description": "I had to come here and try the lemon pepper wings Rick Ross is always talking about.\nI can see why he's always talking about it.\nI only had one of my boyfriend's \u0026 I regret not ordering my own.\nI had the teriyaki wings, they were pretty good, but not as good as the lemon pepper wings.\n\nTwo things I didn't like, register girl spelled my name wrong. She was so adamant about getting my name before getting my order too.\nRhonda without the H is NOT normal, I don't care if it's silent! /rant.\n\nSecond thing, register girl kept going in the back with her long weave dangling. Put on a damn hair net, I don't care if you're not preparing the food. I don't need Mei Ling's hair in my food. /rantpart2\n\nI love that they have a window where you can look in and see how they're preparing your food.\nOh and the soda machine, yes I do want grape Sprite!\n\nIf I'm ever downtown brooklyn, I'm definitely coming back here to eat.", "author": "Rhonda A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-25", "description": "Just had lunch here. Had the 6 piece with mango hab \u0026 bbq smoke flavoring w veggie sticks w blue cheese.  Counter person very polite, patient \u0026 explained didfferent items on menu.  Food came fast.  Veggies wete fresh.  They were prob cut then plsced i.n water.  It was very quiet atmosphere \u0026 clean.  \n\nI dined here a few years back.  The prices have jumped tremendously. I got one of the cheapest items combo w drink it was over $10 with tax.\n\nWhat happened to the garbage cans?  There are none.  You have to leave you tray on tbe counter for them to throw your trash out.  Dont know why.  Perhaps recycling issue.", "author": "J G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-21", "description": "Wangsssss! This spot is good. We came after 9pm on a Friday night and there were a few people there but not crowded at all. The cashier was friendly and helped us decide on a sauce since it was our first time and had no idea what to get. She even gave us a little sample of the mild sauce to taste when we were trying to figure out what to get. For the price I think you get a good amount of food. We got the 12 piece combo which came with fries. Add in 2 sodas and we still paid under 20 bucks. We waited about 15 mins for everything to come out which was great because that meant it was freshly cooked! Everything was nice and hot when it arrived. I liked the flavor on the medium sauce and the wings weren't too big or small. I loved the fries they were so salty with a little bit of sweet. I couldn't stop eating them. We had enough for leftovers the next day. We will definitely be back to try other sauces and flavors. If you like wings this place is a must.", "author": "Suriyati B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-08", "description": "My husband and I decided to pick up a variety of chicken wings for the 2016 Election Day results. We purchased five different flavor of wings... All of the wings were cooked just right! \n\n(1) Garlic Parmesan - this was pretty mediocre to me. I personally did not taste the garlic or Parmesan on it. \n\n(2) Cajun - this was spicy and flavorful! It was a very intense flavor that drove our taste buds completely wild! \n\n(3) Mango Habanero - SPICY AND SWEET HEAVEN! Habanero sounds pretty spicy right? To be honest, I'm very used to spicy and hot flavored foods, it didn't make me run for gallons of water NOR did it make me need some ice cold milk with it. \n\n(4) Louisiana Rub - This is similar to the Cajun, except it's not as spicy. Perfect for those who cannot handle a little heat. \n\n(5) Teriyaki - This sweet goodness was perfect to satisfy any salty and savory wing craving. \n\nI didn't give it 5 stars, because I was hoping the spicy wings would be a bit more spicy! \n\n-----\n\nThe staff was friendly and talkative, also very helpful for first time customers trying to explore their menu! \n\n---- \n\nI will be definitely eating here again! See you soon Wingstop!", "author": "Raye M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-20", "description": "BEST !!!!  Wing stop I've been to plenty \u0026 this one is the absolute best. Chicken fresh as always \u0026 the restroom is clean keep up the good work.", "author": "Ebony S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-19", "description": "Amazing place to grab wings in Brooklyn. Love all the flavor options (Louisiana Rub and Mango Habanero are my favorite) and their dips (ranch and blue cheese) are delicious and homemade. They also have fresh baked rolls that are amazing. I have used  this location several times for parties and large orders and the food is always a crowd pleaser. They cook their food to order so if you don't have time to wait I would suggest calling in your order ahead.", "author": "Constanze H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-27", "description": "The wings are made to order with a perfection of flavor. I have only had Mango habanero. My friend Nikki loves the BBQ flavor. The ample seating, sports on the TV's ,the openness of the kitchen and the fancy multi-option soda fountain set the scene. \nTake a seat and await the call of your name. When you hear your name, grab papertowels and wipes to clean up what you do not lick off your fingers. I am currently on a health twist so no fries, veggie sticks for me. \nUpon my last visit on Sat. 1-24-15, I had the Mango Habanero boneless version with potato salad. I had been craving chicken salad, a different salad for my palette accompanied by yummy chicken.", "author": "Tamiko B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-03", "description": "Came from California \u0026 was missing home so we decided to stop here to feel close. This location exceeded our expectations. California wing stop's should be ashamed. Morning Sunday crew were perfect. Attentive, friendly \u0026 they looked like they enjoyed working there. Our food was phenomenal! The wings were huge \u0026 the service was refreshing really. \nPeople are more willing to write a bad review than a good one but I'm thoroughly impressed. \nBilly \u0026 Ricky, it was a great pleasure this morning. Thanks again.", "author": "Princess L."}], "servesCuisine": "Chicken Wings", "priceRange": "$11-30", "name": "Wingstop", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "289 Livingston St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/3bsBbRiofGhCljCT4rtYAA/ls.jpg", "@type": "Restaurant", "telephone": "+17182609464"}