{"aggregateRating": {"reviewCount": 143, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-12", "description": "solid: Clean, friendly service, good food.\n-ay", "author": "Eric K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-10", "description": "New staff since my last visit, thanks Constanze for the free wings, and excellent customer service.", "author": "A J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-01", "description": "One of the best wings place I had dine. Tried the spicy korean, not spicy at all but I do like the sweet tangy flavor. Didn't like the atomic which is the hottest on the menu. Not because of the spiciness but it was the spice that i do not like. The blue cheese sauce was rich and creamy. I like the chunkiness of the cheese too. \nThe cashier was friendly and she has the best smile ever.  I believe that her name is Bernice. \nHope to see wings places like this at financial district, st marks \u0026 chelsea.\n\nOverall: 3.5", "author": "Jasmine W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-22", "description": "I always get their Honey BBQ wings and French fries. The wings are smothered in bbq sauce which is great and I loveeee their seasoned fries. Their yeast rolls are good too.\n\nI've tried their lemon pepper wings, the ones Rick Ross infamously speaks about. Their not bad but I find them very salty. \n\nThis location has very good customer service too.", "author": "Ayaa H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-16", "description": "Gotta agree with Reginald on this one. This place is dope.\n\nEvery now and then someone opens up a food joint in the neighborhood and of course people flock to it just because its something new, then they realize its crap and find something new...case in point the Five Guys in Metro tech.\n\nThis wing spot brings a new flavor to Livingston with it multitude of fountain drinks, flatscreen tvs, happy go lucky staff, prompt service, and not to mention the wings are well seasoned. The wings are just dipped in the sauce and served to you, they taste as though the sauce was part of the cooking process...the flavor lasts to the bone. \n\nBoth time visiting this location I encountered a young lady named Diamond who always went above and beyond to get me what I needed. From my individual 8pc combo to the behemoth order I placed yesterday, she had it covered. The entire staff at the location are amazing and know the worth of their product and customers.\n\nI would give 10 stars if I could.", "author": "Quincy T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-01-01", "description": "I did not know about this spot prior to about a month ago...saw it on someones facebook page and being how I love new wing spots (no pun intended,) I had to try this place out.\n\nNow I didn't EXACTLY have wings upon coming here though. Had the boneless chicken, fries and a root beer which came to about $8. The boneless chicken was actually fairly small but still good nonetheless. The fries were of good portion but HEAVILY salted! Felt like Morton came to the restaurant himself and just sprinkled his product all of the fries...\n\nI would still come here again though. They have some good options as far as wings, sandwiches and flavors of chicken. If I remember correctly they also serve milk shakes here as well which I would not mind trying during a warm day out. Probably will make my way here again sometime in the near future but definitely will ask them to hold the salt on the fries...SHEESH!", "author": "Jay L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-01", "description": "Ok so my family and I have been coming here a lot almost every two weeks and there's two ppl that stick out with amazing customer service Elaine and Ricky. Seriously i have watched familiar faces walk in  and Elaine already knew the order. Ricky is always calm and pleasant. I recommend coming to this wing stop again. The wait time isn't too bad either.", "author": "Monica P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-08", "description": "Wingstop has never let me down. Wings were on point, fries were crispy and the coke machine gave me access to the rare cherry/vanilla coke combo. \n\nA star was left off because instead of three dipping sauces we got two. Also, they don't have the 10 piece combo which is a minus. 8 piece combo for over $10+ is a little on the high end. \n\nIf you haven't been, it's worth checking out. If you're a regular you know what you're getting.", "author": "David M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-11-19", "description": "The food is great but waiting was a lil hassle. The prices are good but the front ordering needs a little organization other than that , it's good.", "author": "Tri A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-10", "description": "Wingstop is always a good call but this one did great! Very clean, great service and on top of it all bomb ass wing! Medium hot and lemon pepper wings FTW", "author": "Alvin C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-06", "description": "I just realized  that I place my review for the wrong Wing stop. My review is for the one on Fulton Street(Bedstuy) I have never been to that one but I will definitely  check it out. The manager Alexis  contacted me and wanted to know wht happened. And she will fixed it. I was very surprised but happy at least one of those restaurants have great customer service and care about theit customers.", "author": "Dinah G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-27", "description": "The service can take a little long because of the time it takes to make the wings, but the wings taste amazing, the fries are full of flavor, and it's a really great place. Favorite flavors would be Atomic, Mild, Cajun, and Original Hot.", "author": "Jonathan S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-23", "description": "My new guilty pleasure. I think they even taste better the longer there sitting around as left overs. Very easy and convenient ordering process. I will definitely be back again, thanks!", "author": "Daniel A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-13", "description": "Food was good and very fresh.  Would definitely get lunch/dinner/snack from here again.  Prices were decent too.  Menu is a bit limited but hey they are really pushing the wings angle and I can't knock that.  The rating mostly reflects the food.  I'm pretty selective and rarely give out 5's.  The food was very good though.", "author": "Ladislao B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-19", "description": "Was on a late night excursion with some friends when I came upon this gem! Hands down one of the most incredible wings establishments I've been to. I don't leave very many reviews but I was so pleased with my experience here that I just have to. First off, the place itself was really well maintained compared to many others of its kind. The floors and counters were spotless, the atmosphere was warm and welcoming, and from what I could see of the kitchen, everything looked clean and super hygienic. Honestly, this place looked brand spanking new, which is always a good sign for a place that primarily serves fried food. The servers themselves were also incredibly considerate and friendly and tried their best to serve us as efficiently as possible, even though it was near closing time. \n\nBUT the food itself is what takes the cake!! I don't think I've ever had a real chicken wing in all its juicy, flavorful glory until I tried the ones from this particular Wingstop. They were perfectly fried and the spicy seasoning made them to die for. Seriously I wonder how they get their wings to taste so good. For a late night order, the sides were also still really fresh and delicious. Props to the management for getting it right. Similar restaurants need to learn something or this place could drive them out of business!! LOVEE, will be coming back for sure to taste all of the other flavors/varieties. If you're in the area, you NEED to try this place!", "author": "Jazzy H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-08-27", "description": "idk if its because I havent been here in a while but this is an epic fail. Usually when Im in the area i get the same stuff so im like nah lets get some parmesan \u0026 lemon pepper wings.  its like the fried the chicken n just tossed the cheese on it. Both mixes are dry. Current grade is a B...is this a result of rick ross goin healthy lol uuggghhhh", "author": "Nell d."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-02-28", "description": "Wings was okay. Lack some flavor doesn't taste as good as it looks. Don't thing I will be going back here.", "author": "Jannaia A."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-02-19", "description": "So, to be fair, this review is for an order I had delivered via Postmates. I imagine that in-store food might be better. I ordered boneless wings and fries with a roll. I deeply regret ever eating this meal. The boneless wings were very dry and not completely dissimilar to salty rocks. The buffalo sauce was weirdly separated and very sparse. The blue cheese was pretty decent--more of a sour cream taste, but did have chunks of actual cheese. The fries were an abomination. They would have been fairly average-bad fries if not for the slimy cheese sauce that made them inedible. Trust me, this goes beyond just regular this is gross but I'm going to eat it because it's secretly good cheese sauce: this stopped at gross. The MVP of the meal was most certainly the roll. I honestly wish I had ordered 4 rolls as a meal and just foregone the rest of this experience.", "author": "Lauren S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-06-12", "description": "So I just finished eating at Wing Stop, sorry to say but I wont be returning. Now dont get me wrong the place was fairly decent but its just not my cup of tea. The atmosphere is boring, bland, and basic. \nI dont like the fact that there are no garbage cans leaving you no option but to leave your unwanted food on the table. So you know what that means. You walk into a dirty eatablishment. I understand the wings are cooked to order but a 20 minute wait for 5 wings are ridiculous especially if you are as hungry I was just now. And finally the wings: boring, bland, and basic just like its establishment.", "author": "Ronnie M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-28", "description": "The wings here are delicious! Try the garlic parmesan with a side of the lemon pepper seasons! Yummy. Also, Valerie is super helpful and answered my 12million questions over the phone so I could figure out my call ahead order. Bone in wings take 14mins but you can always call ahead. This place is great!", "author": "Cherina B."}], "servesCuisine": "Chicken Wings", "priceRange": "$11-30", "name": "Wingstop", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "289 Livingston St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/3bsBbRiofGhCljCT4rtYAA/ls.jpg", "@type": "Restaurant", "telephone": "+17182609464"}