{"aggregateRating": {"reviewCount": 143, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-12-13", "description": "Wings are delicious I went here on a Sunday and it was not a lot of people I order the Parmesan , Cajun and pepper lemon wings with French fries and a drink all for about $26 I sat down a ate there and enjoyed the atmosphere is cool and the food worth it.", "author": "Ara B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-05", "description": "Shout out to Elyane for the amazing service  I highly recommend the BBQ Wings as well as the Lemon Pepper wings. Will be back.", "author": "Christian H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-23", "description": "love the wings love the bread i came here after the other fulton location had no \nAC wtf... it was the hot inside and cool outside but i wasn't gonna tear up my $50 dollars in wings outside...\n\nso i came here instead... loved it each time i came after that. \n\nthe wings are excellent but the bread rolls are to die for...... i can eat the bread and wings all day... omg and there ranch sauce is out of sight.....", "author": "Jason S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-20", "description": "I think I have a new favorite wing spot!! I placed my order online, and it was ready within 5 minutes of my arrival. I had the Louisiana rub that everyone suggests, and they were good. However they have this spicy Korean wing that was AMAZING!! I'm already heartbroken that it's available for a limited time only. The fries and rolls were good too!", "author": "Karen H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-29", "description": "I enjoyed my first experience here. Customer service was very friendly, informative and welcoming! Elaine and staff went above and beyond to guide me through the fan fav flavors. Loving me some lemon pepper wings now! See you soon ladies!", "author": "Best G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-29", "description": "The wings were amazing!! I recommend the Cajun and parmensan, but stay away from atomic wings. (**Don't ask why!!!**)\n\nNot only the wings were great, but the mix and match soda machine was the best part. A soda machine that lets you combine multiple soda beverages into one. No one can judge you because its  unlimited self service. \n\nOverall, it's a great late night spot!", "author": "Will N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-10", "description": "The lemon pepper and louisianna rub are my favorite! I can eat wings for days from here and never get tired of them. It's good if you call in your order. I would advise that if you're driving down here, to have someone in the car with you in case you have to sit at a hydrant really quick while you pick up your order.", "author": "Tasheena S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-04-07", "description": "After venturing downtown Brooklyn for a Macy's run, my mind began to race as I walked back to my car thinking, \"what the heck am I going to eat, shopping makes me so hangry (not misspelled)\"! Out of nowhere appears Wingstop and my belly was happy for it.\n\nThe woman working at he counter was very friendly and immediately noticed my confused look as I gazed at the menu. The wings are small and no they won't come out as quickly as if you were ordering a burger at McDonald's. But hey, that's because it's not sitting under a heat lamp waiting for you to place an order. I Actually think it gave the place a bit of character.  I like that there are several options of wing flavors to select from. I also ordered one yeast roll for my wait. It tastes like potato bread basted in butter- yup it's a 39 cent treasure. \n\nThough several combos are available, I decided to go strictly wings on this first trip by splitting my order into half Cajun and half hot. Tasty! I also opted to get a side of ranch dip and a side of bleu cheese. 7 minutes into my 14 minute wait (they told me exactly how long my wait would be) I was told that they were out of bleu cheese. The manager was so apologetic, offered me several alternatives and then quickly refunded my 89 cents. \n\nThey also have self service on beverages that I'd like to think of as the fountain of options: touchscreen that allows you to pick powerade as an example and then a sunscreen opens up that offers like 10 different flavors of Powerade. \n\nIt's pretty much half step from being a fast food joint, but as a lover of wings, I'm thinking that I'll be back.", "author": "Nyota W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-28", "description": "Great wings at an affordable price. Def try the Louisiana rub, lemon pepper and garlic parm flavored; you won't be disappointed! Love that it's made to order and not sitting under a heat lamp. The wings come out piping hot, crispy, and juicy--perfection.", "author": "Anna L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-14", "description": "Fatoumata rocks! Very professional and always greets you with a smile. Great employee!", "author": "Gabriella K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-30", "description": "I love this place!! The cashiers are great \u0026 the food is awesome. There's really no complaints, well besides the loud teenagers that stop by occasionally.", "author": "Stan J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-23", "description": "Typical wing place, good atmosphere with all the jibberjabber left and right. Wings were delicious! Just a little to less meat on them in my taste. Other that that, waiting time was not long, very nice personal and the French fries are hard to beat!", "author": "Martin S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-15", "description": "Ma fav spot always eat from here wen  I'm in da area... Great service... Better food... \n#wingstop", "author": "Basheer H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-09", "description": "I love wingstop. I've had almost all the flavors except the spicy ones. Ever since I heard Rick Ross said he liked the lemon pepper flavor, I usually get that lol. But the hickory smoke is also really good as well. N I LOVE the soda machine. Even though it has 140 choices I always get the strawberry lemonade", "author": "Adriana B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-14", "description": "Love the variety of flavors! MUST try the Louisiana rub or if you like a bit of spiciness then def get the Cajun. Wings are always fresh and flavorful!! Definitely my Go-To wing place!", "author": "Hannah C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-28", "description": "Hooters was my favorite spot until I came here today for the first time. I thought it was going to be mediocre wings bc it looked more like a fast food joint rather than a sit in but boy was I wrong. These are probably the BEST wings I've had in NYC and I went to school in Buffalo so I'm a big wing fanatic. On top of that, super friendly staff and managers and got the food fairly quickly. Will definitely be coming back very soon.", "author": "Albert H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-13", "description": "Hands down best garlic parm \u0026 lemon pepper wings in NYC. I'm from the south so I know wings. Though small because Wings + is a chain restaurant, the wings \u0026 fries [especially when eatin shortly after being prepared] are beyond awesome. They are all fried in a light batter then season/sauce tossed in a bowl and prepared. Sooo good! Rated A in my book.", "author": "Jared F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-24", "description": "Great service. Elaine had me laughing the entire time. She was extremely responsive, attentive and accommodating. The habanero and Louisiana wings are pretty good as well as the French fries.", "author": "Omar G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-26", "description": "Billy and Mike are awesome and professional at the register. Wings were so good really clean place !", "author": "Johenny T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-18", "description": "Great wings! I love spices so I got the cajun and atomic. I definately regretted the atomic though... it was good but I did not expect that level of spiciness. It was like 5x stronger than the cajun. The wings are average sized, not the sterioid enhanced wings you might see elsewhere. The service was very friendly, and expect at least a 10 minute wait. I guess they make sure your wings are fresh, not the ones you refry\n\nOverall I enjoyed this place and wouldn't mind comjng back for more, just not for the atomic! Ouch", "author": "Juan M."}], "servesCuisine": "Chicken Wings", "priceRange": "$11-30", "name": "Wingstop", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "289 Livingston St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/3bsBbRiofGhCljCT4rtYAA/ls.jpg", "@type": "Restaurant", "telephone": "+17182609464"}