{"aggregateRating": {"reviewCount": 143, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-25", "description": "I love this Wingstop location!!! Friendly staff and always clean. And the lemon pepper wings are amazing!", "author": "Nachelle A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-02-21", "description": "This was my second time coming to Wing Stop and honestly it was a major fail. The food was beyond salty.. \nEverything was laced with a thick layer of salt from the fries to wings ... \nI think even the soda had a hint of saltiness. \nVery unsatisfied customer and sad that I have wasted so much money on not but two meals. At the end of the day, the money lost isn't the issue but the taste of the meal. I have decided to never go back.\nYuck!", "author": "Naphtah M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-07-06", "description": "I've been a long time fan of Wing Stop.  Stemming from my college days in Florida and continuing through my years in California, I have long loved the lemon pepper wings.  When I realized there was a location in Brooklyn, I was thrilled!  Unfortunately, that excitement was short-lived.  It's not that the wings at this location are bad; they just weren't very good.  I tried the mango habanero, which was not nearly as flavorful or spicy as it sounds.  I also got the lemon pepper (of course).  This was the saddest part.  There was so little lemon pepper spice.  It tasted like I was eating plain, unseasoned wings.  I saved up the tiny pieces of seasoning at the bottom of the container to at least make my last bite worth it, but by the time the last bite rolled around, I was already drowning in disappointment.  I'm hoping this was just a bad day and that their wings are generally better.  Once I recover from the shock, I'll give it one more shot.", "author": "Candis D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-06-22", "description": "This place is just not very good. I had been here a bunch of time because it was close to my office. The prices they charge these small wings are crazy---you dont even get a whole wing and a combo with 6 wings is almost $10. I wanted to just get 16 wings because it dont like their fries but I think they charge like $15 for 16 wings. Thats just crazy. And their fries have some sweet seasoning on them--nasty. Then after they rip you off on the wings, they have the nerve to charge you for dipping sauce and celery and carrots. The different sauces they have for their wings are really not any good anyway---i'm sure they could come up with something better. I've also have the chicken fingers here and they taste like they had been frozen and they were also very salty. Just don't do it.", "author": "Robert S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-06-02", "description": "Since I work in the Downtown Brooklyn area I happen to dine at this establishment very often.  I learned the hard way never to wait in store for your order to be prepared. They claim that it takes 14 mins for your order to be prepared.....NOT. I have waited much longer than that, but I learned my lesson quickly and always call ahead so I can just walk in the store pay for my food and leave.  I have never visited this restaurant in the evening, so I have no idea how long the wait time is at night. \n\nOverall, I like the food especially the lemon chicken wings with the veggies on the side.  Not a fan of the fries, but many people tend to like them.  I also like the buttered dinner rolls they go well with the chicken wings.  BTW the rolls are extra. \nThe staff is always friendly and the place is usually clean which is a plus considering its location.  I enjoy the food and will patronize Wing Stop again.", "author": "T. L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-04-25", "description": "These ppl have lost their minds. How dare you charge extra  $$$ for blue cheese with buffalo wings when you're only getting 1/3 of a wing for $1. Nope not my $. Take it over the bridge this is BROOKLYN NOT manhattan.", "author": "Precious P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-02", "description": "I have ordered here several times. I love the wings and especially the fries. Last time I ordered ,about a month ago , their online ordering was down so they never got my order. I ended up having to wait but the manager( Rodriguez ) was really great about compensating me for the long wait. This was the only time this happened. In general the food is good and the wait is well worth it.", "author": "Alicia B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-02-19", "description": "Not a bad \"fast-food\" restaurant.  I use quotes there because while it is technically a QSR, it does take a considerable long time to get your food.  That said, it's not bad food.  I definitely recommend the sliders.  Just don't pop in if you think you're going for a quick in and out.", "author": "O C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-03-08", "description": "Wings are small, you can taste the fat when eating them, hot sauce taste like hot tabasco and has no flavor, bleu cheese has no chunks of cheese, tastes like ranch but it isn't and it sucks.  The only good thing are the free soda refills.  Definitely not worth it.  Never again.", "author": "Joshua W."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-02-21", "description": "Can't say I was impressed by these wings. Sauces were bland and uneventful. Fries were good. Won't bother ordering from here when buffalo boss is better and delivers.", "author": "Stacey G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-08-04", "description": "I came to this place being that in the area there is nothing else but chinese and mcdonalds. I wanted to have a good meal but settled on this wing place. I say the place is a nice clean spot to have some wings. oh, the wings are made very well and taste good too. I love the high tech machines for the sodas. They are so much fun to try out how this machine works. If I'm in the area again, I can see myself going her again.", "author": "Theresa M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-03-24", "description": "Service is slow, staff was nice but service is slow. I would  chose another location to order wings from, I cannot stand a business that make you wait without some sort of explanation.", "author": "William C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-05-01", "description": "I wanted to satisfy the craving I had for boneless buffalo wings... this didn't happen! In fact I am turned off from them now! Ordered my wings online. When I arrived 30 minutes later, it was not ready. Ok its lunch time, so they're busy, no big deal. Staff was nice. But when I was given my order, the fries on top were cold and soggy. I asked for them to be well done. They took them back and after waiting another 10 minutes, they gave me back the same fries, warm but still soggy. Having took so long, I just took them. When I got back to work, I opened the wings to find cold wings that weren't even the ones I ordered. So I had to drive all the way back. The cashier gave me extra wings for my trouble, however, when I got back to work again,  I found that they did not include any ranch or blue cheese. The wings themself are dry and just not good. I WILL NEVER eat here again. Go find an Atomic Wing or Buffalo Wild Wing instead!", "author": "Erica Z."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-11-12", "description": "I ate here twice and both times the traditional wings were AWESOME.  Everything is made fresh, so no stale fries or dried out wings. Be mindful of this fact and be patient when waiting for your order. Try it, I bet you'll like it :)", "author": "Tina T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-22", "description": "Wings here are great, it's as simple as that.  If you want tasty wings and you're in the area, then this is your place.  Also, they have a large variety of sauces if you aren't in the mood for traditional hot.", "author": "Joseph D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-14", "description": "The wings are good as long as you tell them well done. Their fries are really good. I found they put sugar on them or a few other spices at your request.  The prices are little high but the food is good. They dont deliver but you call for pickup. Make sure you give some time. However long they tell you. 7 or 14 minutes is the usual add like 10. lol.", "author": "Paulie X K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-07", "description": "I had my first experience with Wing stop yesterday, I was not disappointed. I'd heard my wife talk about how she missed the lemon pepper wings from the south for a  few months (she's a southern girl). I didn't even know there was a Wing Stop in Brooklyn, we happen to be driving down Livingston and there it was. I can't even tell you how excited she was. She immediately ordered the lemon pepper and the new Louisiana rub. I was thinking oh they're just wings how good could they be... then I tried the Lemon Pepper. Lawd.... it was an eye opening experience. Besides the service being good the wings are just so damn addictive. You can taste the seasoning down to the bone, which is rare these days. I do have one gripe though... the wings are small but that won't stop us from going back today!", "author": "Poppa T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-20", "description": "Boy oh boy, do I love wings, and Wingstop does not disappoint! Once I heard that Rick Ross was a Wingstop owner, I knew I had to give this joint a try. If it's good enough for da boss, ya know??\n\nAnyway, upon entering Wingstop, I noticed how clean this establishment was! I was greeted promptly on my arrival by an extremely friendly staff. I was able to order quickly and before I knew it, I had my delicious wings and fries! Let me tell you, the options for flavors of wings is INSANE! I tried the Louisana Rub, and I was not disappointed. The fries tasted fresh and were nice and crispy. The rolls were next level. Hot, buttery, and melt-in-your-mouth good!\n\nI will definitely be returning on my next trip to the Fulton Mall. Great job, Wingstop!", "author": "Cindy L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-04-19", "description": "I cannot tell you how the food is but I can tell you that the customer service is terrible. I placed an order online and received an email confirmation. I drove to wing stop. When I got there I told the girl that I had placed an order online. Without asking my name, she boldly states...\"you placed an order online, we didn't get it.\" She wasn't friendly in anyway, didn't offer to place an order for me. Just brushed me off. If she had been friendly and said, \"we didn't get the order but I can place one for you...\" Or something like that I definitely would have ordered. But she didn't... She brushed me off and I walked out.Maybe she was overwhelmed with the one other customer in the restaurant. Anyway, if the customer service is any reflection of the food, I definitely will not be returning. I wish I could give zero stars.", "author": "Domenica H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-03-03", "description": "Meh is exactly right, I came in and there was a couple in front of me that couldn't figure out their lives.  Unfortunately for me there was only one cashier so I had to wait 15 mins for them to decide what they wanted which wouldn't have been annoying if there wasn't another cashier standing near the one at the register just hanging out.  Its cool and all that you're on your break but please take your useless self elsewhere, you can't possibly love this place so much that you even want to spend your break at the register.  Ok rant over...for now.  I ordered the garlic parmesan wings and the Louisiana rub.  I haven't had such greasy, bland, depressing wings in a really long time, actually no I don't think I've ever had wings this bad before.  There were fresh and a decent size but the lack of flavor was just ridiculous.  I felt it was so obnoxious for the wings to be covered in what looked like seasoning only to bite into them and taste nothing.  The garlic parm had the most promise cause the parm offered some saltiness but that wasn't enough to justify the price I paid for a basket of greasiness. Not interested in giving them another shot", "author": "Samantha U."}], "servesCuisine": "Chicken Wings", "priceRange": "$11-30", "name": "Wingstop", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "289 Livingston St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/3bsBbRiofGhCljCT4rtYAA/ls.jpg", "@type": "Restaurant", "telephone": "+17182609464"}