{"aggregateRating": {"reviewCount": 17, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-06", "description": "Update : thanks for the attitude guys working the grill. You think just because im not hispanic means i dont understand spanish and you can talk about me? Woo. A**holes.\n\nJohnson Gourmet Deli \u0026 Grill is a pretty popular deli considering how convenient it is for people in the area (located right near the housing project, police precinct, various businesses, jay st).\n\nYou can find alot of products at this grocery store like deli but I'm basing this review on the grill area in the back of the store.\n\nFood wise, the food is awesome. Why ? Because taste wise, it really is on you since you're telling the workers what to put in/on your sandwich, omelette, burger, wrap, and much more.\n\nThe people that work here are hardworking. I could come here in the morning and late in the afternoon, and some of them will still be on shift. They're also really quick and efficient considering that at rush hours, the whole store could be full and you'd still get your order within the 10-15 minute time frame. Haha, they'll also joke around while working at times, and you can't help but smile. Some of us know the guys working by name (Carlos, Mario, etc -they hire new people at times-)\n\nOverall, If you're looking for a supa-convenient and friendly deli to go to for lunch or breakfast, Johnson's is a good choice.", "author": "Jenn Y."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-11-06", "description": "The customer service is terrible and the environment is beyond dreadful \nAnd the food I order wasn't even fully cooked so I had to throw it away", "author": "Chris P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-12-09", "description": "I ordered 5 sausage egg and cheese sandwiches on a roll and the guy immediately assumed it was Scrambled eggs. I was willing to just let that go. Then he proceeded to thoroughly over cook all of the eggs and the sausage was borderline burnt. How do you dry out sausage??", "author": "Doris C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-11-02", "description": "After moving to a new neighborhood, I am without a deli. ::sad face::. With a massive craving for Oreos, we braved the wind and walked two blocks to Johnson Gourmet Deli and Grill. I feel like this place is still getting on it's feet. It looks to be newly remodeled but isn't fully stocked and isn't fully put together i.e. the produce refrigerator isn't set up and they aren't fully stocked with products but, it's also not a hole in the wall news shop with stale candy. \n\nThey do deliver, but at their convenience. Only when the deli counter guy isn't busy. Overall Johnson has potential but needs work. At least they're good for snacks.", "author": "Valerie V."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-12-19", "description": "This place is dirty and has an unsavory clientele. I have two friends who were both threatened by other costumers on two separate occasions.  You can see the owners don't care much about cleanliness just by entering the vestibule. It's dirty, unsightly, and unkept.  Try Khim's Market close by at 111 Lawrence Street.  It's open 24 hours 7 days a week, it's clean and you'll be greeted with a smile.", "author": "Damian J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-03", "description": "This store is great. It's a stone throw away from my job and the prices are reasonable. \n\nI order breakfast from this place almost every morning and never has it been messed up or undercooked. The chefs are friendly but professional. The store itself is very clean (major factor in my book) and the selection (for such a small store) is surprising.\n\nYou can call in your order and they even deliver for free...did I mention they really credit cards.", "author": "Quincy T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-06-28", "description": "I live in the area and am eagerly awaiting the Toren's and the Andrea's grocery store(s) to open. In the meantime, I pretty much go to this deli for any last minute items and it's conveniently located. \n\nThey have some of the most random assortment of grocery items, but I like the recent improvements - a bigger cold storage area and an aisle for fruits + veggies. I also spotted a spice rack recently and food coloring (again, totally random, but I'm not complaining!). The fruit and veggies are a gamble (not what I would call the freshest items), but they will check the stockroom for produce if you ask. \n\nThe people who work there are friendly, it's a no-frills place and it's convenient. It will be interesting to see how they plan on staying competitive once neighboring grocery stores are open and fully operational.", "author": "Shu Jin S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-24", "description": "Basic neighborhood deli. Its convenient to be able to walk a few short blocks when you need to pick up a few things. I recently found out that they are open 24 hours which makes them even cooler. \n\nThey have all the back-in-the-day after school snacks and are actually still the same price from all those years ago. It has that nice \"corner store\" feel (we don't call them deli's in NJ).  Speaking of prices, some are reasonable, others not so much. You can get all types of seasonings here for $1.00 which is considerably cheaper than getting it from an actual grocery store. Cereal on the other hand is a little out of hand at almost 6 bucks. \n\nThe guys who work here are friendly, especially the short older guy. He's always smiling. The deli in the back makes pretty good sandwiches too.", "author": "Marla B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-04-11", "description": "Conveniently located around the corner from the 84th Precinct and the NYPD Leadership Academy, this place will do in a pinch when you don't have time to go walking all over the place on your meal break. \n\nA okay, with reasonable prices.", "author": "Gregory C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-07-27", "description": "I am in this area often working on a project with one of my friends. This deli is very convenient for us, but at the same time consistently good. I LOVE the tuna melt  with Swiss cheese. I actually get cravings for it.  They also have a small selection of snack foods and household basics. We often pick up cheese and crackers here to go with our wine.\n\nThere's a 5 dollar minimum for cards, but its really easy to do (as I wouldn't say it's the cheapest deli around). The sandwich orders can get backed up sometimes, but they are really nice behind the counter and make some delicious deli sandwiches.  Overall a good neighborhood \"go to spot\" for a quick bite.", "author": "Christina R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-22", "description": "I am the pickiest food person on earth. So the fact that I might have to eat at a corner deli grossed me out to no end. How fresh is the food? Cleanliness?  To my PLEASANT surprise Johnson Deli has yet to disappoint. Whether it's the pizza, chicken parm sandwich, fries, it's all yummy!! So whenever I don't feel like cooking I'll head down there for a quick bite. And did I mention it's cheap? And entire meal including fries and a drink for like $5. Love this place. \n\nThey also have anything you can think of if you can't make it to the grocery store. Although I was kind of sad that they didn't carry frito lay products when I was craving some cheetos. =(", "author": "Leigh F."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-05-12", "description": "By far the worst delivery I have ever had. Over 1 hour for a wilted lettuce salad. I only am 2 blocks away from th is deli. When I called to tell them my salad did not have the ingredients I asked for they replied by telling me anything that is missing we didn't have. I will never bother with this place again.", "author": "Jonathan P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-01-08", "description": "This is a location that I would not normally patronize but....it is quite convenient and the hot food is decent/bareable., The sandwiches are good as is the breakfast items. BEWARE, during lunch time this place can become swamped (the grill area) especially with the near-by construction projects. Also across the street is a public housing development so at times it can get a little loud or less than desirable of a place to frequent. The staff is slow, sometimes makes mistakes but are nice people and that goes further than some occasional errors.", "author": "Tony C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-02-23", "description": "Johnson is a no-frills cut to the chase \"market\".  On the way to and from I may pop into this place to grab a carbonated beverage which is Inexpensive by any standards (think 1.25 for a 20oz soda).  \n\nWhen in a quandary about dinner I will head over to Johnson's for a burger, a slice of pizza, or sandwich and it is decent.  Also, my doorman advised me that they have hot coffee throughout the day and late night.  This place is open 24 Hours (or so it seems I have never gone and it be closed) and was a god sent during the \"Great Blizzard of the day after Christmas 2010\" as the grill was on and the food was flowing.\n\nAs far as the \"Market\" aspect of this place they have your necessities cereal, beverages, chips, canned goods, milk, and tylenol (I mean what else could you ask for)?\n\nDecor Wise: it is set up with aisles that lead to the back where the food is made.  The guys behind the register are funny and they have a very eclectic mixture of clients.  \n\nAll and all a-Ok place to satisfy simple cravings.", "author": "Carlos S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-07", "description": "These guys are amazing. We shop here so much they know us by name and even bought us a bottle of whiskey for Christmas! We come here for our late night munchies or to grab cereal and milk. This place has evolved over the year and a half we've lived in the neighborhood.", "author": "Stacey G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-26", "description": "They have Fage yogurt and kale chips! Surprisingly good selection, and only two blocks from me. It's awesome to finally have a place so close by where I can pick up some healthier junk food and decent cup of coffee late at night.  Compared to other delis in the Downtown Brooklyn area, this is definitely my top choice. Not 100% sure if they're open 24 hours but i've been there pretty late, and so far, have never seen them closed.", "author": "Sarah G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-06", "description": "When we tell clients about nutrition, this is one of the few places near this block where our clients can surely find fresh fruit, healthy meals, and decent nutritional bars or protein shakes. I'm glad they also have \"grocery type\" items as well like Gallons of water and some dairy. They have a very good breakfast and lunch. The staff is always helpful when we come in, would be better if better stocked on a regular basis and if they delivered.", "author": "Bayo O."}], "servesCuisine": "Sandwiches", "priceRange": "Under $10", "name": "Johnson Gourmet Deli \u0026 Grill", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "176 Johnson St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/gK7VxbRtYtYscOA8NOzG0A/ls.jpg", "@type": "Restaurant", "telephone": "+17185226960"}