{"aggregateRating": {"reviewCount": 12, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-26", "description": "Very good Chinese take out spot in Brooklyn. Very reasonable prices and exceptionally quick service. Would highly recommended the sesame chicken as well as the General Tso's chicken. Highly recommend to anyone looking for good simple Chinese takeout.", "author": "Jake W."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-02-25", "description": "They came on time but the food sucked. The fried dumplings weren't fried all the way, the chicken and broccoli tasted awful due to a lack of sauce...and their chicken didn't taste like chicken...probably rat meat. BEWARE!", "author": "Shenia R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-12-17", "description": "Trying to find decent and authentic Chinese to deliver in this area has always been a challenge, particularly if you're not looking for some weird fusion type dishes. Which is why I'm a Happy Garden. For the most part, the food is authentic Chinese cuisine so I can't really understand the subpar reviews. Beef and Broccoli, the beef was tender and protein to vegetable ratio proportionate. The broccoli was fresh, crispy and vibrant green, NOT soggy and overcooked (my pet peeve) that you often find with Chinese take out. The Fried Chicken wings were somewhat bland but it came in a paper bag that i just added some salt and pepper and shook it up. It was not deep fried in old dirty oil and the wings were clean, golden and perfectly cooked. Beef Fried Rice was a little disappointing, there wasn't much beef and virtually no other vegetable apart from onion. Food arrived fast and piping hot! Will happily order again from Happy Garden.", "author": "Elle S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-10", "description": "FINALLY, a decent sesame chicken and chicken with broccoli delivery option. The dumplings are good to (as well). This has quickly become my new faux Chinese food go-to, for sure!", "author": "Shu Jin S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-09-05", "description": "The food is okay but they close randomly.  It seems like half the time I call they aren't open.  It makes me wonder about the freshness of the food.", "author": "Liz C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-05-06", "description": "In the search for the best Chinese delivery in my neighborhood (Cobble Hill), my girlfriend and I one night took the 3 best reviewed places that could delivery to our address and ordered the same thing from all three places (pork fried dumplings, chicken lo mein, and general tso's chicken with brown rice) and had a taste test. We tried Happy Garden, China Wok, and Hunan Delight. All three had the same size and quality of brown rice and arrived in 26-32 minutes. Here I present the other conclusions of that test:\n\nHappy Garden: In the middle in terms of pricing (China Wok was $17ish, Happy Garden was $23ish, and Hunan was $27ish). They used reusable plastic containers for 2 of the 3 dishes but they were too thin and cheap to actually use again. The general tso's chicken was made with bite sized pieces but was very average in that there was a lot of breading that was not crispy and they used cheap cuts of chicken and included very few pieces of broccoli. The sauce was sweet with no kick or real flavor to it. The lo mein was also very average. They were our number one choice for dumplings. The dough was properly thin and they used tasty meat and included a decent dipping sauce. Unfortunately they were no longer crispy but that could be expected from delivery I suppose. \n\nChina Wok: This was the least expensive of the bunch. Everything came in the typical disposable tin containers. The general tso's chicken had larger pieces than Happy Garden and more broccoli but was also average at best in terms of quality and taste. The lo mein wasn't that good as the noodles were thin and not chewy the way lo mein should be. The dumplings were also extremely doughy, the meat had little flavor, and they did not include any dipping sauce. They too were not crispy at all and did not seem like they ever were. We threw these away. They were the only one of the three to include a can of soda but did not let us know this ahead of time so they chose Pepsi for us (which neither of us drinks).\n\nHunan Delight: At over $27 this was the most expensive of the three places. It did end up being our favorite of the three but not by much. They included a nice thick reusable plastic container for the two main dishes. They were the only one of the three to include fortune cookies. Their general tso's chicken also lacked a crispy texture or high quality chicken but their sauce had slightly more flavor to it, though not by much. The lo mein came with properly thick and chewy noodles with the best flavor. It also came with a bunch of mushrooms which could be a pro or con depending on who you ask, we're not big mushroom eaters but picking them out wasn't a problem. The dumplings were disappointly doughy but had much better flavor and better seasoned meat than China Wok and came with a dipping sauce. The downside besides the non crispy thick dough was that they only gave 6 dumplings while the other two had 8. \n\n\nThe conclusion was that if we're hankering for dumpling delivery Happy Garden is the way to go, if we want chicken lo mein then Hunan Delight is the best choice, and if we want general tso's then it's really a crap shoot as no one in our neighborhood seems to excel at this dish, a slight edge goes to Hunan for flavor while if price and having a bit more broccoli is important, China Wok would be the better choice. We'll definitely have another round with the next best 3 choices but it will be awhile before we can justify gorging ourselves on Chinese like this again.", "author": "Matt E."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-11-19", "description": "Saw a new listing for this on Deliver dot com yesterday and since my office is always looking out for new places that deliver we gave it a go. Ordered 2 Boneless Spare Rib lunch specials and 1 Hunan Chicken Lunch special. When the order arrived there was only 1 rib order in bag. I call up restaurant and explain it and she says something to the effect of yeah he coming back. Ok so I thought maybe he just forgot to give me a second bag, my coworker goes out front to wait for her order and nothing. Apparently they thought that I was just asking about the original order. After she called back and tried her best to explain this and how they had charged our card for it they finally agreed to send a new one. \n As for the food my Hunan Chicken was spongy, had way too many onions and the rice was that awful very yellow kind and had little pork or flavor. The long delayed ribs were very fatty and greasy. Never again for these guys.", "author": "Tory L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-18", "description": "I ordered the basic. Lo mien with fried chicken wings. The Lo mien was great , not oily, vegetables were nice and fresh. The fried chicken was good. Was not refried like other places. The homemade ice tea was good.  Quick delivery. Would order again. No complaints", "author": "Nika G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-08-15", "description": "Awful food, must to avoid. Order Happy Family with lobster, and no lobster; just fake crab legs. How stupid do they think we are!", "author": "Paul S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-15", "description": "Just finishing the last bite of my egg roll...I'd be hard pressed to find better Chinese food  for the price. I've been living up the street and been going here for years. This place is tucked away in sleepy cobble hill where the owners of million dollar brownstones phone order $6.50 General Tsao's chicken and $2.50 wonton soup...and clearly don't use yelp. The place is take out only but the food is inexpensive fresh, clean and well prepared. I'm always keen to pair my wonton soup or hot \u0026 sour soup with beef chow mein or moo shoo pork. Wonton noodles are soft but firm. I visit my parents in the 'burbs and scoff at the Chinese food they have! But they have the luxury of a car and I don't...so let's call it even.", "author": "Christopher O."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-06-04", "description": "I wouldn't change from my current take out Chinese food spot for this one.  It was edible.  Nothing more, nothing less.", "author": "J C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-18", "description": "Just to clarify, this is no Chinese wedding banquet. But it is as good as it gets within the category of inexpensive Chinese take out food (it's take out only). I've lived around here for 5 years and probably have eaten at all Chinese places in this category in the neighborhood and there isn't any better. If you like straight fried chicken, try the wings. Four whole wings (both parts of the wing) for $4. It's way better than McNuggets", "author": "m l."}], "servesCuisine": "Chinese", "priceRange": "$11-30", "name": "Happy Garden", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "402 Henry St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": null, "@type": "Restaurant", "telephone": "+17186258583"}