{"aggregateRating": {"reviewCount": 222, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-09-05", "description": "Came across the Kimchi Taco truck the other night - three tacos for $7 and four for $9, which I thought was pretty cheap.  I tried pork and korean bbq beef.  The pork was actually pretty good, so it deserved a  star.  However, I wasn't a fan of the korean bbq beef - was soggy (totally fell apart) and bland.\n\nWas not blown away from my taco experience, so I don't think I'll try this truck again...sorry...", "author": "CeeCee A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-08-13", "description": "My rating is 3 overall...However, these tacos have to be eaten in the first 2 to 3 minutes from when they are given to you.  If they are, it gets a 3.75.  \n\nI have had several of the tacos a couple of times.  The first time I had them, I was given the 3 minute rule advice.  I took it pretty seriously, sat on the floor and ate them.  I liked them a lot.  They weren't orgasmic, just a decent time on a day when I needed a decent time.\n\nThe next time I got the tacos, I ran an errand and went back to the office.  The meat juices had supersaturated the taco and it was melting at my touch.  This was lunch, not dating, so I wasn't too happy.\n\nI have had similar results when I violate the three minute rule.  So get in, get out.  Its all about the quickie.", "author": "Jamel O."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-23", "description": "This truck seems to ALWAYS have a line. Sometimes crazier than others... But is it worth it? For the tofu edamame falafel taco? OH HELL YES.\n\nI love when 2 amazing cuisines have a party... and when Korean mixes with Mexican? Forget it. Sweet, spicy, sour, salty... all the right notes resound loud and clear. As you know, I don't eat meat, so I eat tofu... I love Japanese, so I also eat edamame... and I love falafel. So ordering the tofu edamame falafel tacos was a no-brainer. Almost immediately I was a fan of the kimchi-pico de gallo mixture. The spicy tang of the kimchi and the nice pops of flavor from the scallions were key. The tofu edamame falafel was moist, hearty and flavorful, although I'd like a little more doneness to them. A little more crisp could add to the texture... and flavor.\n\nOverall, I'm a fan. My only slight negative is that the tacos are just a tad on the small side, but that's why you get 3 for $7!, which isn't a bad deal at all. Super tasty and filling... it satisfies my fix for Asian... my fix for Mexican... and my fix for DELICIOUS.", "author": "Elvir C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-06", "description": "I was excited to see the truck was at WFC yesterday and went right over.  I have ordered from here in the past but it has been a while. I ordered the 3 taco special and had one chicken, one pork, and one fish ($1 extra for the fish).  Everything was delicious and the fried fish was my favorite.", "author": "Ginger B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-11-04", "description": "I was afraid I'd be the only 3 star review, but then again, it really wouldn't have made a difference.\n\nThe aroma that floods the street unfortunately does not equate to the taste of the taco. 3 for $7 isn't too bad given that there are some places that charge upwards of $4 for one taco. I had the first three tacos on the menu, don't' remember the names, probably because they all tasted the same! They all looked the same and all tasted the same: spicy tacos.\n\nI have to agree with Dave H. I did not want 3 tacos and really only wanted one so I can try it out. Kind of disappointed that these tacos weren't amazing. So much potential...that's about it.", "author": "Michelle W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-28", "description": "When I googled \"cheap food finds in NYC,\" Kimchi Taco was one of the places that showed up and it was our first stop. You can find it on 45th and 6th and we got there a little before it opened and the line was not bad at all. The wait for food was probably 5-10min. One of my friends got the burrito ($9) and my friend and myself shared the taco combo which was three tacos for $10. I think the cook there had gave us the wrong ordered so I couldn't even tell you which tacos we actually ate. The crispy chicken was the best I believe. At least thats what I thought it was. Cheap food truck and cool concept. Worth trying out.", "author": "Plina N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-02", "description": "I don't really understand what's not to like about the tacos here.  Just a thought, but if you are patronizing \"Kimchi Taco,\" it's probably wise to start with their tacos before you begin veering off into the nether regions of their menu and pass judgment on them.\n\nI like being punched in the face with flavor and every time I eat their tacos, that's what happens to me.  I have tried all of the tacos except for the tofu/edamame/falafel one, and found all of them to be delicious.  I've also had the spicy rice cakes, or gnocchi as they're called on the menu now, and really liked those, too.  If you're a purist, they really aren't rice cakes or gnocchi in the traditional sense, so you might be disappointed.\n\nOverall, I'm always happy to stumble upon this truck at lunch time.  Not too $$$ and always tasty.  The staff are friendly and cool too, which is a bonus.", "author": "Joe L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-05-23", "description": "After trying korean tacos from Big D's a few months ago, i decided to give it another go with the Kimchi Taco Truck.\n\nI thought this truck will be better than Big D's,  but I was pretty disappointed with everything. The cashier who was taking the orders was a nice guy, very friendly, so i feel bad that I have to bash the food, but it just wasn't that good. There was no wow factor. \n\nI tried the 3 tacos for $7 (1 beef, 1 pork, 1 chicken). All three had kimchi topped on it. First of all the kimchi was too fermented. I prefer my kimchi fermented, but I thought this was over the top. Secondly, i thought the kimchi was not spicy enough. They were overly fermented so they were stinky. Note to all readers: don't eat this at your desk because your coworkers will stare at you and hold their noses. At least the tacos were held up nicely by 2 corn tortillas. Thats def a huge plus.\n\nLet's break it down per protein:\nBeef - severely dry. I was disappointed. The flavor was there in the marinated beef, but I couldn't get past the dryness of the beef. I have to say that I preferred the bulgogi taco from Big D's over this one.\n\nPork - The pork was flavorful and fatty. It was still moist and oily. I thought this was the best taco of the platter, and i ate it with the quickness. Again, it could have been spicier, but this def still beats Big D's.\n\nChicken - Wayyyyy too dry. It was like chewing on shoe leather. It was tough and more dry than the beef taco. I def could have done without this taco.\n\nI also ordered a side of the spicy rice cake. It was a waste of my money. The rice cakes were undercooked and very tough to chew on. I rather have them overcooked, but this was ridiculous. The sprinkle of queso blanco was minimal too, so i just thought i wasted my money when i could have gotten better spicy rice cakes in ktown. \n\nThis truck looks like a well oiled machine with a bunch of cooks working their stations. There is always a huge line with ppl waiting for their orders. However, I feel that they lack in execution, and they need to make sure not to overcook their proteins and under cook their rice cakes. \n\nNext up is Korilla. Hopefully that truck is better than Kimchi and Big D. I also need to re-try Big D's because i heard that they refined their dishes.", "author": "Thomas A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-06", "description": "If you haven't noticed, I'm a food truck/cart enthusiast. There's something about tracking food trucks around the city that brings out the hunter-gatherer in me. \n\nHappened upon this truck while tracking a lead on a Cuban spot (future review) in midtown. Been wanting to try some Korean tacos after reading about a truck in Cali and seeing Korilla on Food Network. Luckily the Kimchi Taco Truck is in my area twice a week.\n\nFor my first visit, I went with 4 tacos (2 beef, 2 pork) and a side order of chips n beans. They did not disappoint. Both meats were so tasty and all of the toppings (kimchi, pico, etc) made for one great bite of food in a compact corn tortilla. The chips n beans were a nice surprise too. Wonton chips, with kimchi infused refried beans and queso-blanco. The chips made it back to the office still crispy. \n\nTried the kim-cheesesteak for my next visit. Nice play on the Philly cheesesteak even offering whiz or provolone. \n\nBrought some co-workers unsure if they would be open to the new flavors (mainly the kimchi). All have loved the taste especially the beef and chicken kimchi bowls which consist of meat, lettuce, rice, pick and of course kimchi.\n\nThe guys in the truck are great. Very friendly and efficient, getting the food out quickly and consistently.\n\nThey move down to lower manhattan for dinner service. Wish they were closer so this hunter-gatherer could spear some tacos for my New Brunswick clan ;-)\n\nJ", "author": "Jason I."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-04-09", "description": "I was real excited when I heard that Korilla BBQ finally had competition for selling Korean Tacos in NYC.  I really like Korilla BBQ but competition could only help to spur better quality food.  Keeps them from getting too comfortable from being the only one of it's kind in NYC.  Who knows?  Maybe the Kimchi Taco Truck would even be better.\n\nWhen my friend told me that the truck was parked near her work place for the day, I immediately told her to help me buy 3 tacos and kindly deliver it to me after work.  She informed me that when she arrived at the truck at around 1:30 PM, they already ran out of beef.  Damn.  I wanted to try one of each meat flavor.  GRILLED KOREAN BBQ BEEF, BRAISED PORK, and PULLED CHICKEN.  There was a tofu edamame falafel too but... I couldn't make myself eat tacos with tofu.  I have nothing against tofu mind you.  I like tofu but tacos and tofu does not interest me.  Two braised pork, and 1 shredded chicken was my order.\n\nFor the rest of the day, I waited..... and waited.  Visions of tacos went through my mind..... then the hour came and they were finally in my hands.  Excitedly I opened the eco friendly paper container ( bonus points right there ) and stared at it contents.  I stared at it some more.  That sure looked like some bland dry tacos.  Ok.  Looks could be deceiving.  Maybe it taste like heaven right?   Wrong.  The meat was as bland and dry as it looks.  The chicken and pork seems to need either a stronger marinate or more time marinating.  The chicken especially needed more seasoning. There was also no distinctive Korean flavor to either of the selection. The tacos did have a decent amount of meat in them though.\n\nI've read from their web site and from other reviewers that there was supposed to be some kind of kimchi inside the tacos. All three of mine was missing any sign of them.  Not a speck.  What I did find in abundance were these little tiny white cubes that upon careful nibbling, I figured they must be diced radishes.  Radish are used to make kimchi but these weren't even marinated.   The radishes adds more texture than anything else because they  don't have much taste to them as is.  So what made these tacos Korean? I wished I knew.  It tasted almost like a regular taco, and not even that great of a regular taco at that.  I'm hoping that they simply forgot to put kimchi in my order although in my opinion, that would only improve the flavor slightly ( I know because I added my own kimchi in it ), and would still barely qualify it as a Korean taco.\n\nAs if that wasn't enough to give these tacos a two, the \"Asian Pico de Gallo\" used for salsa was watery and the hot was really mild.  Not only that, but I was surprised at how little they give out for three tacos.  You know those little plastic sauce container that many places uses?  The one with the lid?  Well, the salsa came in those but it was only 1/4th full.  I had enough for one small splash per taco.  I wish I remembered to take a photo of that.\n\nAll in all.  I was disappointed.  Korilla have little to fear from this new competition.   I'm hoping that because they are new, they would still find time to improve on their recipes.  Until then, I've heard of another new truck that serves Korean Tacos. Big D I think was the name. Maybe I'll try that next and report back.\n\n2 stars for the tacos.\nadd .5 stars for being eco friendly.  \nTotal score:  2.5", "author": "Wing L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-06-26", "description": "WAY WAY WAY OVERPRICED for the amount of meat and the size of the taco!\n3 small corn tortilla discs for $7 from a food truck, is way too expensive.  They give about 2 pieces of meat the size of a quarter in each tortilla.  \nI'm better off making it at home, will cost me $0.50.\nAlso, the pickle/cabbage did not taste like Kim Chi at all.", "author": "Serena N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-01", "description": "It may not be the Korilla BBQ truck and there's no bacon kimchi fried rice but Kimchi Taco is still a very solid option for sampling Korean style tacos and burritos.\n\nFor $7 you get three small tacos and I chose Korean beef (short rib meat) and spicy pork.  Both are excellent choices and they are topped with kimchi, cheese and spicy sauce.  The meats were very tender and fresh, the service was quick and friendly and it is as good a food truck as I've ever run across.  Next time I run across it I will try their burritos.\n\nThere are so many food truck options in NYC but Kimchi can hang with the best of them. They put out good product that is very tasty and keeps you wanting more.  What more can you ask from a food truck?", "author": "Paul P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-04-06", "description": "*The rating for this review is 2.5 stars*\n\nWhen I found out about this truck I was very excited to track it down and try some of their tacos. When they first started last week, I went after the truck and only to find they were kicked off the street by building owners. And they were done for the day when I checked back on their site. Today, I found out they were in my work area once again. So I ventured out and there were so many people waiting for their orders and on line waiting to place their orders. I've waited 20 minutes on line to finally place my order. Maybe because it was already 1:30pm, a lot of things were already sold out. Bummer.\n\nThe guy who took my order had a great smile and was very friendly. I ordered the braised pork taco, pulled chicken taco and tofu edamame falafel. I stood aside with the rest of the people and I've waited about 15 for my order to come. I ordered mine with the mild spice.\n\nBrought it back to the office. Opened the box and took out the container of hot sauce. Looked at the hot sauce and thought it spilled in the bag, but realized it didn't. Holy taco! They gave me so little sauce for three tacos? I guess I'll live. So I poured the hot sauce on each taco sparingly. The braised pork was okay, it needed more flavor. The mild spice sauce was I guess too mild? So mild I wouldn't have guessed it was spice at all. The pulled chicken was very tender, but again it needed more flavor. The tofu edamame falafel was interesting. I never had a tofu edamame falafel before, but the falafel wasn't really crispy - it was rather hard and dry. The kimchi fillings in each taco was pretty good - it was really fresh and crunchy. The corn tortilla was really soft, but not soggy, so that was good. Overall, I think the tacos lacked flavor.\n\nWell, maybe because they just started, so they need some time to pick up the pace and the flavor. However, I can't complain that they are eco-friendly because all of their containers, utensils, napkins and bags are compostable.", "author": "Sandy C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-01-15", "description": "Got the three taco combo at 46th \u0026 6th - Short Rib, Spicy Grilled Chicken, and Spicy Pork....because they were out of Fried Chicken, Fish, and Falafel. \n\nTacos were underwhelming, some good flavors but overall not very balanced, and they didn't taste as fresh as I expected. The service was extremely quick, but the tacos were cold, and it may be my fault for expecting them to be somewhat warm, but that's that. \n\n$10 for three tacos ain't bad though.", "author": "Griffin R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-11-09", "description": "This is certainly a unique fusion . . . one I've never thought of before, so I decided to give it a try.\n\nSo I got online and ordered the three Korean marinated beef tacos that were topped with traditional taco ingredients along with kimchi.  The kimchi was definitely a unique topping.  The beef was marinated nicely and was tasty and all of the ingredients fresh.  And although I have never had kimchi before, I believe that it was good and fresh . . . just not sure if I appreciated it as a taco topping.\n\nWould I come back?  Yes!  Am I in a rush to come back?  Not really.  Lots of good trucks out there and plenty worth exploring.", "author": "Jeffrey K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-28", "description": "I really like kimchi tacos! It is different from Korilla because the focus is \nmore on kimchi than on meat. We tried the beef and pork tacos and they are very flavorful. 3 tacos run you $7, which is not bad. They are not too spicy but they have hot sauce on the side for you if you wish. \n\nIf you want a very meaty taco, you should go to other trucks. If you love kimchi though, this is a good alternative.", "author": "Athena C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-20", "description": "We hired this truck as a thank you to our hard working film crew. Tina was so friendly and helpful to deal with. They charged us exactly what they quoted and there were no hidden extras. Her team (headed by Caitlin) were super friendly and fast with their food. \n\nThey had a fantastic attitude and made our crew's day with their amazing food and great approach. We loved having them and would recommend this truck to anyone!\n\nThanks Kimchi Taco!!", "author": "Naomi W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-04-14", "description": "A friend suggested visiting the Hell's Kitchen Flea Market last weekend, to check out the assortment of food trucks, mostly.  One name jumped out at me from the list of participants--KIMCHI!  TACO!  TRUCK!  OMFG it was a dream come true!  I had to do a double-take to make sure I wasn't hallucinating.  \n\nShowed up for the flea market, and the truck already had a huge line.  That was because it hadn't opened yet, even though all the other trucks were up and running.  So I sat on the line and patiently waited.  Eventually the doors opened and they started serving tacos.  Because they're pretty much making to order, you generally wait to order, then pay, then wait a little while longer to pick up your food.  It wasn't an obscenely long wait, but I personally wouldn't have been able to stick it out that long on a working day.  (I've since gone back to the truck at one of its regular weekday spots, and experienced a similar wait--figure if you're 5th on line, it'll be about 10-15 minutes before you actually get your food)\n\nAs for the kimchi tacos, they are savory and delicious.  Perhaps not as kimchi-esque as I'd like, but I guess they can't make them TOO spicy or else they'd have people tearing their heads off or something.  They do have hot and mild sauces on the side, but I kinda wish they gave you the option to have a more daring kimchi on your taco.  I've now had all four varieties (beef, pork, chicken \u0026 falafel), and each has its own special appeal, beyond simply being from different protein sources.  The actual overall taste of the taco is distinct, and that's very cool.\n\nLove love love the KTT.  I'll check them out at the flea market as often as possible, for sure.  And on days off, I'll seek them out too.", "author": "John W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-01", "description": "So delicious and highly recommended if you have time for a long lunch break.  When I went there was a long line and it took a while to get our food.  You can tell the staff was hustling though. \n\nThe short rib and fried chicken tacos were really amazing.  I could have done without the falafel one.", "author": "Maria A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-10", "description": "Finally tried kimchi taco at governor's ball! DELICIOUSSSSSSSSSS. We got 3 tacos for $10 and everything was delicious and I loved the flavor!", "author": "Lavi W."}], "servesCuisine": "Korean", "priceRange": "Under $10", "name": "Kimchi Taco", "address": {"addressLocality": "New York", "addressRegion": "NY", "streetAddress": "", "postalCode": "10281", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/Q-ut8XpilC2YjYRbYZh4hw/ls.jpg", "@type": "Restaurant", "telephone": "+17183601839"}