{"aggregateRating": {"reviewCount": 222, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-29", "description": "TOFU EDAMAME FALAFEL TACOS. so unique and delicious!!!!!!!!!!!!!!!\nnuff said. worth the 40 min line :-/", "author": "Hannah L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-06-03", "description": "I trekked down to the Kimchi Taco Truck with my coworker assuming 1 hour would be enough to take the 13 block walk there, get our food, and walk back - wrong!  I've gone that far before and waited in longer lines and still made it back in less time.  For a food truck, which is supposed to be a quick lunch (aside from lines), they sure move at a glacial pace. \n\nI got the pork bowl which was pretty tasty.  I like that they offer whole grain rice and thought the pork was much better than Korilla's - however, Kimchi totally lacks in added veggies.  You get 1/4 of a pickle, a TINY serving of Kimchi, a little pico, and some random lettuce thrown in.  The kimchi was only \"meh,\" not the best I've had and not the worst.  I was most disappointed by the hot sauce, I used at least 3 tbsp of a mix of both kinds and STILL needed to add sriacha at my desk.\n\nBottom line:  Kimchi Taco was OK, but just OK.  I certainly wouldn't walk that far for it again.\n\n2 hours after my original review...\nUpdate:  Both my coworker and I are sick...lowered to 1 star.", "author": "Margot A."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-10-01", "description": "If you want yo try something different, it works. But I wont try this again, the serving have barely any meat and I ordered the bowl.", "author": "Joaquin A."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-08-02", "description": "Being from Cali, I was looking forward to trying KimChi Taco.  I happened to walk by the truck one day and hadn't ate lunch yet so I said what the heck?  I ordered the Beef Bowl which was $8.\n\nA few minutes later, out came the food.  The results;  it's not very good and I've had better.   If they integrated the korean/mexican style then it would be good.  But they just throw in some korean beef, kim chi, mexican rice, and salsa which just doesn't work.   I've had the famous Mo-Go truck in CA and this is just not on the same level.  \n\nWith all the good food out here in NY,  I won't be coming back.  It's just ehhhhh.", "author": "Albert L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-20", "description": "Yesterday, Prospect Park at Grand Army Plaza.  There was the Kimchi Taco Truck.  Was it a mirage?  No! It was really really good tacos. \n\nThe Kimchi Beef was wonderful, spicy and sweet all at the same time.  The pork and the pulled chicken were both just as good.\n\nThird Sunday of every month through October.  The food trucks will be there.  And so will I.  Looking for Kimchi Taco Truck wherever it parks!", "author": "Elliot P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-04-07", "description": "I've seen this truck around my workplace every so often but haven't had the chance to snag a sample until today.\n\nOn the downside, I had to wait a while (20+ mins between standing in line and then waiting for my order), but that's not their fault. And I think it is overpriced for the amount of food you get. I ordered the Korean BBQ Beef Kimchi Tacos. You get 3 small soft tortella shells which are filled with kimchi and beef. While it was the right amount of food for me (not too much, not too little), I wish they had put in a bit more of the actual kimchi - I only had a sparing amount. It cost $7 for the 3 small tacos, which I think is pretty expensive by $1 to $2 dollars. \n\nI also wasn't that impressed with the Korean BBQ beef. I've had good Korean BBQ before and this didn't quite live up to my previous tastings.\n\nHowever, it was still tasty and flavorful and I am glad I gave it a try. I probably won't go back, but it was worth checking out and was a nice lunch for me this afternoon.", "author": "Crystal M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-07-17", "description": "Long lines and not that special. Not a place I'd revisit. But decent tacos worth trying once.\n\nI got beef, pork, and chicken tacos. The beef and pork were fairly indistinguishable from each other. The chicken was actually my favorite and I wasn't expecting that since I enjoy beef and pork more. \n\nSomething in the tacos made them too sweet. I think it was the seasoning on the meat. They were also really watery making the tortillas mushy.", "author": "Peace Y."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-01-02", "description": "Came here on a Thursday because I could find my usual Hibachi heaven truck that I love. It was a freezing cold day and I had to wait 30 minutes to get my food! This is not acceptable for a food truck. I got the spicy chicken bowl. The only flavor I could taste was chili. I got a side of arancini balls which I ended up putting inside my bowl for some flavor.\nDefinitely not with the 30 minute wait. Will not be coming back.", "author": "Monique M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-04-29", "description": "As part of my hub's food list, we embark on a vendor hunt in the village. We had the BBQ Short rib, Chicken, Spicy Pork, and tofu edamame falafel (4 for $9). The Spicy pork stole the show with its juicy flavors of tender, pulled pork marinated in red pepper paste topped over pico de gallo and fresh kimchi. If I had known it was the best one out of all of the tacos, I would had ordered only spicy pork. The BBQ short rib was a bit messy over the pear kimchi slaw. It felt I was eating sloppy joe instead of short rib on a taco. The chicken was extremely dry and plain. No flavors whatsoever to make it come alive. And the falafel was the spiciest of all but very mushy and hard to chow down. Skip this one! Be prepared to stand on the side of the truck since there is no seating. Another tip, don't count on the tacos as a quick meal, it's more of a snack.  If you're starving, save it for another trip! These tacos are equivalent to a size of a slider.", "author": "Linda W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-08-05", "description": "The tacos were not bad. I think the pulled chicken and Korean BBQ beef tacos were good, but the tofu edamame falafel was a little dry. I recommend eating them right away.. they will get soaked with the kimchi sauce after a while. \n\nThe chips and beans were interesting... the dish contains \"Kimchi infused Refried Beans\" with fried wonton chips.\n\nOverall, the food was ok, but the experience/idea of combining Korean and Mexican cuisines together is interesting.", "author": "Andrew H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-12-22", "description": "This truck is a winner. I had the kimchi bowl with pork and extra spicy sauce sauce. Just the right level of kick, nicely seasoned pork which brings out the flavor of the meat and the kimchi blends in perfectly well.  Perfect portion / size for lunch but leaves you yearning for more even though your stomach may be full. \n\nI can't wait to try the chicken and BBQ beef options next time I go (which will probably be tomorrow given how good this first time was).", "author": "Shiven S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-09-18", "description": "I always passed by on Wed when they are in Midtown, the huge line deterred me from ordering as normally, my days are super busy and I would rather cut my lunch hour to 15 minutes and leave work on time.  But, yesterday things were a bit slow for a change, so I decided to give it a try.  I ordered the 4 tacos special, 2 short ribs, 1 grilled chicken, 1 fried chicken.  The food tasted OK, nothing really stood out, and I would have probably rated it 3 stars if it weren't for the miniscule portions.  I understand that these tacos were just the 4 inch tortillas, but 2 out of 4 had barely any filling in them, they are literally a one-bite each.  I was hungry in an hour and had to supplement with 2 snacks.", "author": "Baby S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-03-23", "description": "I waited two weeks for my schedule to sync up with Kimchi Taco, so I was elated that I had a day off on Friday when they were parked on 46th and Lex.\n\nThe line was deep w/10 people, but it move quickly. That said, after I placed my order, I waited 20 minutes (perhaps more. I stopped looking at my watch after awhile) for my order of 3 tacos - pulled chicken, braised pork and edamame falafel. I also ordered beans and chips (refried beans on top of crispy wontons).\n\nThe food in one word - DISAPPOINTING. In midtown during heavy lunch rotation, I feared eating kimchi outdoors, because we all know some of the best stuff reeks like a mofo. Unfortunately, I didn't have to worry about that. There was barely any kimichi on any of my tacos. The few (small) cabbage leaves looked like they were in a wet, watery sauce, b/c the kimchi was not a deep red, but a faint orange. The pulled chicken had no flavor. The pork was indistinguishable from the chicken. And the falafel was dry, dry dry. Part of the reason why my order took so long was because I saw them take frozen falafel balls, deep fry them, and then wait for them to cool. A good Mediterranean falafel is crispy on the outside and soft inside with a nutty taste. All I got was a mouthful of dry crumbly matter. Again, seasoning and texture was problematic.\n\nAnother problem I had was that the \"taco\" part of the meal didn't add up to the \"fusion cuisine\" idea of Kimchitaco. The corn tortillas were not heated on a skillet prior to plating. FYI, you cannot treat a flour tortlla and a corn tortilla the same. Corn tortillas need to be heated in lard or oil before you plate the meat on. If you don't know, they're RAW out of the bag.  Also, there wasn't any cilantro, nor white onions, nor NOTHING that indicates Mexican or Latino flavors in the food. The beans and chips, for example, could have easily indicated the blending of two cuisines, but the refried beans had a burnt aftertaste to it, and the wonton ships were soggy from the weight of the beans.\n\nIn sum, the Korean part of the cuisine, while largely represented in the food, had minimal flavor. And the Mexican/Latino part was completely absent. I do hope they revamp their food, because I DO want them to do well. But I won't be chasing them around the city for awhile.", "author": "J D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-04-18", "description": "I got a falafel edamame tofu burrito with refried beans.  All I got was a burrito weighing 2 lbs full of rice with some kimchi it it. There was no edamame,refried beans,tofu visible to the naked eye and few really dry falafel ball in between.  Maybe there Tacos and Bowl are better but burrito was a big disappointment.  Why do these food trucks which don't have to pay rent etc, skimp on food?  They charge the same price as restaurants.  I could have gotten better falafel burrito from Hale and Hearty or Pret for the same price.", "author": "Farooq C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-14", "description": "the truck was parked outside of Trader Joe Union Square store.\ntacos were delicious,   very flavorful...  3 tacos for $7 is a plus.\nwill definitely try this again!!", "author": "Young S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-04-03", "description": "If you love big flavors, these tacos are for you! Kimchi tacos are equivalent to haute tacos going for $12 for 3 at fancy nouveau Latin restaurants and bars, with $18 cocktails. The price is comparative to tacos sold from taco trucks in East Harlem. Especially when they come to midtown east, the spicy, tangy, and salty options stand out both flavor, cuisine, and budget; in comparison to the total lack of interesting food options available in the area for budget-conscious midtown lunchers who want something more interesting in the sea of delis and sushi bars.", "author": "Lei P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-13", "description": "We chased this place down and were very happy with it. $7 for 3 tacos: one beef, one pork and one chicken... Beef won although the pork came close. Took a long time to order and then pick up.", "author": "Susanna S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-07", "description": "I only had one  grilled chicken taco because it was my first time trying this food truck and I wanted to play it safe. I regretted that decision once i bite into my ONE and ONLY taco :( Surprisingly, it was very, very delicious. If the line wasn't so long (Sunday Food Truck Rally at Prospect Park) I would have definitely bought more! I'm looking forward to trying other menu items.", "author": "Chris C. B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-11-26", "description": "Yummy food truck... Looking forward to trying out the brick and mortar spot to compare. Service was quick. And the hint of siracha in anything gets me on a food high. We tried both pork, and chicken tacos. Small in size but for someone on portion control, it was the right compliment for lunch.", "author": "Nicole N."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-06-09", "description": "Food: I ordered 3 spicy pork tacos. \n\nExperience: No wait which is great. It is a food truck so put in your order and wait.\n\nValue: It was $9 for 3 spicy pork tacos I believe and I found the tacos to be relatively lackluster. I was very excited to eat them but the pork marination left me wanting. I would suggest you give them a try though as they have a variety of interesting combinations", "author": "Andy T."}], "servesCuisine": "Korean", "priceRange": "Under $10", "name": "Kimchi Taco", "address": {"addressLocality": "New York", "addressRegion": "NY", "streetAddress": "", "postalCode": "10281", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/Q-ut8XpilC2YjYRbYZh4hw/ls.jpg", "@type": "Restaurant", "telephone": "+17183601839"}