{"aggregateRating": {"reviewCount": 222, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-01-23", "description": "I really wanted to like this place.  I heart food trucks and their mobile culinary delights, but this was not for me.  The tacos had potential to be great, but the flavors did not meld well.  The combo of the kimchi's strong pickled flavor didn't taste right with the corn tortillas.  Perhaps I may like it better in a different vessel, but as for now my rating will remain.  Good try, but not for me.", "author": "Lisa R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-05-15", "description": "Solid lunchable.  I had the beef bowl with grains, kimchi and some kind of cabbage salad for $8.  The price is pretty standard for a NYC lunch.  The combination of grains, protein and salad made for a filling, balanced meal.\n\nThe beef bowl was tasty plus a healthy heaping of kimchi is known to lower your appetite.  It wasn't the best kimchi though as it was a bit on the dried out and spicy side, the spicy comparable to the spicy Chipotle sauce (red) was not too bad (I asked for non spicy).\n\nThe meat was a bit bristly and the pickle was bland and bitter, I definitely expected more from the pickle.\n\nMidtown location.", "author": "Mishkin L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-11-29", "description": "Happened upon this truck near Madison Square Park and decided to try their version of Korean tacos. As this truck is named Kimchi Taco, it offers mainly tacos. No burritos on their menu which is a shame. I ordered the chicken and 2 beef tacos for $7. These are the mini tacos and not the full size tacos. The beef was well marinated. Overall I enjoyed the tacos but not wowed. I could not really discern the separate taste from the toppings. I assume it had kimchi but not a very strong flavored one as I didnt notice it. I preferred the beef to the chicken. The chicken was more spicy than expected with just the regular spicy sauce. I got the extra spicy sauce on the side for my bf who likes extra spice :p I would probably get 4 tacos if I wanted it as a meal. \n\nI would say I prefer Korilla to kimchi taco when compared taste-wise. When I passed by, they had just opened so no line. Not sure I would wait in a long line for these tacos though....", "author": "Brenda M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-09-26", "description": "The guy who took my order was very friendly, chatty, and even held my umbrella so I could get out my wallet. \n\nI ordered one of each kind of taco. I was bummed the way they packaged it. I got the three meat ones for my friend that works right down the street to try and just wanted to try one tofu taco after having already eaten at the crisp falafel truck. The four tacos were all squished together and the ingredients were touching, so as a vegetarian I couldn't eat my taco and risk meaty contamination. Next time, I'll specify that they be packaged separately. \n\nMy friend said the tacos were good, but not great. I think the beef was his favorite. Apparently do have a very strong smell and his whole office was complaining that they stuck the place up haha. This is probably a better food to enjoy outdoors, and when you have gum or mints with you. \n\nI'll have to ask more detailed questions about shared grills/cooking utensils next time to see what they have that is actually vegetarian and I'll give it a try :)", "author": "Angela K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-04", "description": "I always get their tofu falafel bowl with multigrain rice and ask them to hold the crema sauce.  When going vegan, these guys have been so accomodating with my requests that they rock.  I've tried a bit of their other products and they're okay, hence the 4 stars but the rice bowl is the way to go.  I try to find them whenever I'm downtown.", "author": "Dorim L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-10-21", "description": "I was in the neighborhood where they were handing out free samples the other day at the Earth Institute Columbia.\nI had the veggie kimchi taco with falafel and it was yum.\nI am definitely going to buy their tacos if I spot their truck.", "author": "Pallavi B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-04-08", "description": "I didn't eat here but my coworker had a horrible experience. He complained nonstop about how terrible the food was, claiming it tasted like plastic. He also thought the portions were too small (like that Woody Allen quote). He doesn't have a Yelp account so I'm reviewing on his behalf. His name is Ben. Kimchi Taco, shame on you.", "author": "Barry J."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-08-22", "description": "Review from PARKED - Food Truck Rally - South St Seaport 8/20/11 \n\nSo my dear friends stood on this line for about 35 minutes - while I sat in the shade - salivating and waiting..... and Boy oh boy... were we let down.... \n\nWe had 3 soft tacos - beef/pork/chicken and a side of nachos with beef/pork. \n\nCan I just say - UNDER SEASONED - and borderline - BLAND! \nLike WTH? the Kimchi hardly had any heat to it! \nThe tortillas were rubbery and cold.... (I'm thinking - a griddle would have done them well - or even tossing into a deep fryer for a few seconds)... \n\nNot sure if it was the massive crowds that brought the food quality down? or if this is normal? but I'll give them a try on another day to be fair.... but seriously... we threw away just about 1/2 of it all.... \n\nDisappointed :(", "author": "Alysha R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-07-31", "description": "Tried the Kimchi Taco truck for the first time at The Lot at the Highline on a Saturday. Even though they have a variety of menu items, from tacos to cheesesteak sandwiches, to nachos, we decided to keep it pure with a sampler of 3 tacos.\n\nThe tacos are small, but pretty packed with meat and toppings. In fact, I realize that the focus in their tacos is on the kimchi rather than the meat. The pork taco I had was pretty flavorful, with a ton of zest and spiciness from the kimchi, pickled radish and chopped jalapenos. The meat itself had some nice char from the grill, but was chopped in too small of pieces. While the corn tortillas encasing the filling was relatively tender (especially compared to Korilla's raw ass tortillas), they got quite soggy from the meat and kimchi juices. Picking up the tacos to eat was altogether a very messy affair, as a lot of juice from the kimchi ran down my fingers. But hey, at least they provide wet naps.\n\nI think this truck has a lot of potential, especially as it is still pretty young on the food truck scene. Service and speed is pretty lacking, especially when there's a long line... but I'm giving them the benefit of the doubt and will come back to try some of the other menu items.", "author": "Cecilia Z."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-21", "description": "I was perfectly happy with this food truck fare... my trio of pork/beef/chicken tacos had a tasty core and kicking pico de gallo/Kimchi toppings.  Even after a 40 minute ride on the F train, the tacos - and tortillas - stayed intact.  Lindsay Lohan, on the other hand, starts breaking down the moment served.\n\nWhen ordering any meat from a wallet-friendly place, one can often get blah, greasy, grizzled or generally hard-to-chew cuts.  I was impressed that the KT truck's fare was nicely marinaded and tasted slow cooked.\nHappy to \"fall off the bone\" is how your girlfriend describes her favorite meat.  Or was that favorite position?  I forget.  \n\nWhen I asked the chef/driver if it was smart to add hot sauce, he said the basic fare was already pretty well spiced... and he was right.   All hail the drunk bastard who melded Korean and Mexican fare, be it on purpose or an accident.  Both cuisines love heat and chemistry. \n\nFor some reason other reviewers were less impressed, but maybe this crew is working on smoothing out kinks/getting more consistent in service... which can be a challenge in the back of a truck.  Ask your mom.", "author": "Jonathan E."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-08-26", "description": "I'm so disappointed with my food truck lunch selection today.\n\nSo I decided to give this food truck a try and went for the 3 taco combo meal.  I ordered the Grilled Korean BBQ Short Rib, Spicy Seared Pork and the Krispy Fish.    The 3 taco combo meal goes for $7 bucks, but my meal came out to $8 because of the \"specialty\" taco Crispy Fish costs an $1 extra.  I was especially excited to eat the fish taco, yum I love me some fish tacos. I took one bite and said WTF! Is this? I had to examine my other tacos to make sure if what I was eating was a fish taco.  At some point I almost felt they gave me the wrong taco. This protein had no resemblance of a fish.  The 'fish' pieces looked like fried gizzards it was extremely hard, dark and chewy and dry as if they over fried it.  Were not even gonna talk about the dry ass BBQ Short rib taco, dear lord did I get stuck with last week leftovers? Eh!  The pork taco was the only savior to my meal. The pork taco was moist and well seasoned.   The abundance of Kimchi garnishes on my tacos which added much flavor made my lunch a tasty meal, but my protein selection was a letdown.  \n\nIf I ever....ever...ever...ever get a hankering for some Korean tacos I will take my caboose somewhere else, but since I'm trap in this new work area Battery Park/WFC. I will only have faith to order the pork taco and pray that it will be good as the first time.", "author": "Esther A."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-05-25", "description": "So I'm meeting the girl out for an evening of drinking, the likes of which we both knew were going to be remembered (though portions blacked out) for a long time to come. In fact, later this very night, after bar number 3 and a rum punch that could fuel an engine, she actually tried to talk to a text message.\n\nHowever, enough of her drunken shenanigans, let's get back to the review. And the fact that there are few words more fun to say than \"shenanigans\".\n\nShe calls me as I'm getting off the train to excitedly proclaim that she's found a Korean food/taco truck, and that this is, with literally no doubt in her entire being, where we are eating before we drink. So I catch up with her and the truck over by Lafayette and Astor Pl and we begin scoping out the menu. These guys have a solid, though not overwhelming menu. It's kind of reminiscent of Taco Bell in that most things seem to be variations on a theme and revolve around your option of protein. \n\nShe gets 3 tacos: One falafel, one chicken and one beef.\nI order the burrito-in-a-box (sans tortilla, basically just this truck's version of street meat from what I can tell) with the pork filling. We stand around and wait, and after about 5 minutes they call out our order and I pick it up.\nThey have these cool recycled paper boxes that they put your order in, instead of the typical styrofoam containers, and I gotta say I dig this. Unfortunately, this was the last time I was impressed with this truck.\n\nThe kimchi is salty. \n\nActually, the kimchi is like drinking the Dead Sea, which has so much salt content in it that you simply are incapable of sinking in it. It's like that.\nIt was so salty I couldn't have more than one piece, and the girl, who I'm pretty sure was raised on a diet of seawater and salt licks, couldn't eat more than 3 pieces. \nOther than that, the meats were ok, with the pork actually being pretty good, but my box was a lot of white rice and kimchi, neither of which made any sense for my having just paid $8.\n\nIf I see this one again, I'm skipping it.", "author": "Garrett P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-04", "description": "I love Korean BBQ from a truck, usually from the one that rhymes with gorilla. I jumped at the chance to try a new one when I saw they were parked in Union Square. I tried the three taco set first and that left me with mixed feelings. The fillings were good but lacked the spicy kick I expected. It didn't help that it was nearly impossible to eat the tacos by hand, since the thin corn tortilla nearly disintegrated by the first bite. \n\nI was going to ignore the truck when I saw the truck for the second time after my poor first impression but I decided to give it another shot.  This time, I tried the Kimchi Korean BBQ Beef bowl instead and had a much better experience. The bowl was pretty huge for $8 and was packed with a lot of beef and kimchi. The multi-grain rice they have for it is great and tastes much better than the normal white sticky rice I'm used to.  I highly recommend getting that instead of the white rice.  They don't have a selection of toppings you can pick and choose to put on top but the generous portion of kimchi vegetables makes up for it. \n\nBest advice if you run across this truck is to pass over their namesake tacos and go straight for the bowl. It's well worth the price for some Korean BBQ heaven", "author": "Kevin L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-09-09", "description": "On the 31st we took a walk on the highline and decided to eat at the 30th Street lot.\nI enjoyed the food until I bit on something and could immediately feel that there was something really wrong with my tooth.\nYesterday, my dentist confirmed it. I need a partial crown thanks to the Kimchi Taco truck. $8 dollar bowl and $900 tooth! Yeah. NOT.", "author": "Wendy D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-08-04", "description": "If this is the kind of food you're putting out to expose people to Korean cuisine, you should STOP. Really. It's embarrassing.\n\nDisappointment. Skip it.", "author": "Katee L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-08-21", "description": "Although korean tacos have been the craze amongst the New York food truck scene, the Kimchi Taco truck always delivers with consistent quality that I have yet to see from other trucks. \n\nThe tacos are always prepared with the proper corn tortilla and doesn't try to overwhelm/mask the flavor of the protein with additional condiments. I normally go with the short rib or the pork as the marinades for both are authentically Korean and perfectly grilled with a nice char. \n\nI'm a sucker for nachos as well and a hidden gem on the menu is their nachos at only $4. Many times, I find myself ordering two for lunch and being completely satisfied.", "author": "Dan L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-11-07", "description": "This place has a store front in Prospect Heights and the truck is routinely parked out there but they do not offer tacos from that location - only the truck. Pourquoi? \n\nI was fortunate enough to enjoy a tofu edamame falafel kimchi taco while the truck parked at the highline's seasonal beer garden. It was pretty spicy but I really liked the flavor. Didn't seem to complicated that I can't make it at home though. And for being in NYC I would expect to see a larger variety of veggie options. They only had one. Or maybe just add a fish/seafood choice to the menu. I get that it's a food truck but lots of things are food trucks these days.", "author": "Marin G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-19", "description": "So good.  Have been threatening to try Kimchi Taco for a while now.  I was not disappointed.  I had tacos of the spicy seared pork and short ribs variety and the boyfriend had short ribs and chicken.  Everything was really good.  We agreed we liked the spicy seared pork the best.  It also seemed like a really good deal.  We spent $14 all told for both of us with bottles of water.  \n\nI wanted more but only because it was so tasty!", "author": "Alexis R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-11-11", "description": "After hearing good things through reviews and a friend I was not expecting a five star but not a one star either. So at 5pm the food truck comes by Astoria so I went there right after class. \n\nThere was a line so I thought that I must have made the right decision if people were willing to wait in line for it. So when it was my turn, I got the four taco deal which was $9 dollars. The guy who took my order was a little rude and not very friendly but I can get over that. He was yelling at his workers and the environment was not very good, if you know what I mean. \n\nI got chicken, 2 beef, and a pork. The meat did not taste like meat, it tasted just weird, I don't know how to describe it. The meat tasted doughy like mush. And they don't actually put kimchi on it. They put paste. They also took like ten minutes to make it and it's not even fresh. I will never eat from here or recommend it to anyone. The taco part was not hot. It had a kind of hard texture and wasn't enjoyable to chew. The portion is pretty meager for what you pay. And the main worker had to keep yelling at the other workers to hurry up. \n\nDid I wait that long and pay that much for this crap. Usually when you don't get quality you at least get quantity. I also ordered a diet coke ($1) and the guy must have forgot so I had to reorder it. I didn't make it a big deal to him. As a Korean I have to be honest. It' s one star through and through. So don't come here expecting the hype to be true. Spend your money wisely.", "author": "Grace H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-07-06", "description": "I've never been impressed by any of the \"major\" food trucks and thus don't see a reason to spend more than a few minutes in line.  That usually means I can't hit spots like Kimchi, Mexicue, Korilla, Luke's Lobster, etc unless I go at an inconvenient time.\n\nIn this case, while I still feel like I ate way too early (lunch at 11:40 means i'm definitely going to need something later this afternoon), it wasn't quite so inconvenient because I was walking back towards the office after running errands.  I stumbled upon Kimchi with ZERO line and thus figured I had to try it.\n\nI'm glad I finally got the chance to experience the hype, but I'm somewhat unimpressed with the reality of the food.\n\nFor $8, the beef bowl portion was somewhat pathetic.  No ingredient (kimchi, rice, assorted vegetables, beef) was at a desirable portion--lettuce, one of my least favorite foods in the world, was the only thing that came en masse.  The kimchi was admittedly quite tasty, but the rice was bland and the beef was dried-out and somewhat flavorless.  I guess that's why they don't outright call it bulgogi--I've never had that dish served so dry.\n\nI actually felt like I got far more mileage out of the nacho side dish, which only cost $4.  Maybe a bit less meat, but with the kimchi, salsa and cheese more directly mixed with the beef and pork, the whole thing was a little bit wetter and a lot more flavorful.\n\nHad i just gone here for a side of nachos, I'd be looking at a 4-4.5 review for Kimchi Truck.  But with the bowl coming in at a soft 1.5-2 (and that being the main reason I came), a 3 is all I can offer.", "author": "Brian C."}], "servesCuisine": "Korean", "priceRange": "Under $10", "name": "Kimchi Taco", "address": {"addressLocality": "New York", "addressRegion": "NY", "streetAddress": "", "postalCode": "10281", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/Q-ut8XpilC2YjYRbYZh4hw/ls.jpg", "@type": "Restaurant", "telephone": "+17183601839"}