{"aggregateRating": {"reviewCount": 222, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-08-15", "description": "actually 2.5 stars. \n\nGot Korean BBQ taco for weekday lunch. I'm originally from Korea so I had a great expectation for this, but I was disappointed. I could barely find/taste Kimchi inside the taco; the tortila was so dry; and the beef was little tough. I don't think that this food truck is run by Koreans or Asians.\n\nWill try Korilla next time.", "author": "Somin Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-10-11", "description": "mmmm...my new favorite food truck.  the chicken taco is perfect.  Best taco I've ever had off a truck.", "author": "Minto S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-11-22", "description": "The tacos aren't huge but are filled with lots of deliciousness. The flavors were bright and complex and melded together well. Service was speedy. Very enjoyable at the Grand Army Plaza Food Truck rally after a long walk and a bunch of grocery shopping.", "author": "Elizabeth B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-07", "description": "The spare rib taco is fabulous.  The flavor is fantastic, and the taco has a great texture.  It's a great deal, too.  Fast and friendly.  What else do you want?", "author": "Noah J."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-08-27", "description": "the hype was huge, but it was still good. had the kimchi shortrib rice bowl and it was tasty.  It was actually quite filling as well.  I think if i was a bigger meat eater, and a bigger fan of kimchi i would probably give it 4 stars.  Would eat again", "author": "Vanessa O."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-16", "description": "We look forward each week to the smiling faces and quality Korean food at this, one of our favorite trucks in the City. Friendly service, fresh meats and a variety of kimchi draws us back again and again. The owner, Mr. Lee, takes care to listen to diner feedback in a constant effort to improve. And now, the restaurant is in full swing; we can't wait to visit!", "author": "Crimson E."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-02-07", "description": "BOY, was I excited to hear that rumor had it, food trucks were coming to the World Financial Center area for lunch! I immediately looked up which food trucks were participating and saw that Kimchi Taco was partaking. Now, I've tried Korilla before and it was delicious, just a tad far so I was going to give Kimchi Taco a shot.\n\nI ordered a set of three tacos for $7: 1 Grilled Korean BBQ Short Rib, 1 Spicy Seared Pork, and 1 Tofu Edamame Falafel. I was unsatisfied with ALL THREE. To start, the beef rib was too dry and was missing one main ingredient.. FLAVOR! Ugh. Moving on, the pork taco was a little better, and by a little better, I mean, it didn't taste like cardboard. Last, and the least, the Tofu Edamame Falfael taco was by far my LEAST favorite. Again flavorless and I felt like I was eating mush.\n\nService was amicable and attentive. Overall, the long line was not worth waiting 20 minutes for subpar \"Korean\" tacos. Disappointing start to the food truck bonanza..", "author": "Joanna Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-23", "description": "Great place for some healthy tasty food. Try it for something new and refreshing.", "author": "Leonard L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-08-21", "description": "Very disappointing. I was so excited to try them as I am a kimchi nut and went to the food truck rally truck in Prospect Park just to have some. Judging by the line in front of truck (longest out of all trucks), I was like\"they must be awesome\". We ordered the falafel, chicken and korean bbq. The falafel was the best out of three and it was decent at best- the falafel was not crispy or spiced up, the chicken was disgusting, like boiled chicken and I did not even bother with the Korean Beef-seriously you call that korean beef, it looked like boiled sausage....my friend had the guts to try it and said it was worse than the chicken. Major disappointment", "author": "Nezl B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-14", "description": "Overall my experience with this food truck has been good. The service is good and the servers try their best to accommodate you. It definitely isn't the traditional Korean food you find in Korea Torn. So if you're looking for that, you'll be disappointed. If you're looking for a fun mix of korean inspired Mexican dishes. This is the spot. I loved the rice cakes and rice with beef dish.", "author": "Florence K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-04-16", "description": "I've only had the Edamame Tofu Falafel bowl, and it was so good the first time, that I got it again, and it will probably continue to be the only thing I order from now on. I'm not too big on tacos, and I love that they offer a vegetarian option that is actually flavorful. The falafel is definitely different than any I've ever tried. It's a little dry, but the flavor is great, and it's nothing a little hot sauce or crema can't fix. They also give you a choice between white and multigrain rice. For $8, you get a heaping bowl of falafel, rice, kimchi and a mix of pickled vegetables. They also throw in a pickle slice for good measure. My tum and tastebuds are more than satisfied after eating this bowl.", "author": "Alyssa B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-10-03", "description": "Went at the Dumbo Arts Festival. They were out of pork, got the chicken and short rib. They were both really yummy, the short rib tastes like the marinade. The tacos are small. Maybe I would prefer it a little spicier next time. I didn't really taste the kimchi. I wouldn't think 3 small are enough for dinner.", "author": "Bee C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-11-07", "description": "The pork taco is really great.  It's smoky and sweet and tart with the kimchi.  I haven't tried the extra spicy sauce yet but next time I will.  Could use a little more sour cream.  The other tacos were kind of eh, but I haven't tried the falafel/tofu.", "author": "Charlotte S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-30", "description": "Downright tasty with the perfect hint of heat that describes the tacos from the Kimchi Taco Truck.  I tried the BBQ beef, pulled chicken and the nachos, which all were on the money and speaking of money I walked away with my arms and legs in tow.  These guys are fast, courteous and deliver a good product.  As for truck and street meat venues this comes recommended.  I know many people complain about the size, but for lunch or a late night snack the size is on the money.", "author": "Windell C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-03-16", "description": "As I indicated in my last review I wanted to go back to the Kimchi Truck this week and give their other meat-based tacos a try. I had only tried the falafel tacos and the Arancini side up until this point. My experience previously was met with mixed results. I did not like the use of a single corn tortilla to carry the weight of the falafel. The falafel itself was pretty good but the taco was cumbersome and fell apart too easily. The arancini was ok but a little overpriced for what you got.\n\nThis week I am happy to report that the Kimchi Truck is learning on the go. They stopped toasting their tortillas and now include two soft corn tortillas to carry the weight of the taco. I was excited to give their beef, pork and chicken tacos a taste for the first time. I also ordered a side of the chips and beans ($3.00) for good measure. However, unlike the mixed results I found previously, today was simply terrible. \n\nLet me start with the BBQ beef taco. Looking at this taco you can tell they put plenty of meat and kimchi on the tortilla(s!). They certainly do not short change the experience. However even before consuming the taco you can tell the beef is over cooked and dry. This dryness blunted the sweetness of any BBQ that is also supposed to be present in the flavor. You can taste taste the salt yet the sweetness was horribly muted. The kimchi saves what little respect I can give this taco. Kimchi truck does deliver on good kimchi in their tacos. However, they do something that really shouldn't be done with these sorts of tacos which is they put the wet kimchi on the tortilla first when constructing the taco. This holds true for all three tacos I had for lunch. This wetness combined with the heaviness of the plentiful meat destroys the taco even with the added security blanket of the additional tortilla. The tortilla literally disintegrates. It took two bites before I was picking up the contents of the taco with a fork. Perhaps this can be fixed by putting the kimchi on top of the protein. \n\nNext I ate the pork taco. Again, the meat here was dry and bland. While the kimchi was potent and good, it was also wet and made the taco fall apart one bite in. Also, the sheer amount of bland meet blunted the taste of the kimchi rather than complementing it. I have to add the way they prepare the pork is closer to pulled pork rather than the marinated meats of Korean bbq.  The chicken taco was tender but lacking flavor. It also muted the flavor of the kimchi. Finally, the chips and beans were ok. The beans were made into a paste and spread on a decent helping of oily chips. However, there was not enough bean on the chips for my liking. Also   a quick note on the spicy and mild sauces that kimchi provides for the tacos. Neither are spicy and they are very watery. They help with the dry meat but not the crumbling taco. \n\nI still want to try the kimcheesesteak and probably will visit the truck one more time before I finalizing my review. However, for the meal I had today I cannot give it anything higher than 1 star.", "author": "Jonathan H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-04-20", "description": "Pretty good, but not worth the wait/hype. I like the Korean-Mex taco trucks in L.A. better. Had the pork, chicken and short rib tacos. Wanted the kimchi rice balls as a side but they said the fryer wasn't working properly so I ordered the nachos side instead. The chicken was a bit dry and bland. The pork was pretty good and the beef was pretty darn good although a bit tougher than I expected. The nachos have the pork and beef on it and were awesome. I wish they'd make an entree size nacho item.", "author": "Lola K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-12-02", "description": "We love Kimchi Taco/Grill!\n\nWe recently used their food truck for our wedding reception and we were super pleased with this business. Tina helped us w designing a menu, sampling the food and setting everything up.  Every question and concern was attended to.  \n\nOur reception was the weekend after Hurricane sandy and needless to say, our guest list changed at the last minute.  Tina was able to accommodate to these changes.\nThe service on the reception day was impeccable. The staff was organized, efficient and friendly. The food was great and our vegan guests had their culinary needs met too - There was a separate batch of vegan kimchi set aside for them.\n\nA week after our reception, Tina emailed us to inform us that we overpaid and sent the extra money back...unbelievable!  \n\nRecommended dishes: rice gnocchi, beef nachos, and the edamame pancakes. We wish we had a chance to eat more of these dishes :)\n\nPlease support this great business!", "author": "Shirley W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-03", "description": "Why such little love for this truck? I've had both Korilla \u0026 Kimchi Taco and enjoyed them both. Kimchi Taco bowl was solid - good portion, good food, not too spicy. I'm too lazy to track it down, but love that it's usually close to Union Square around dinner time and satisfies my monthly Korean food cravings.", "author": "Ms S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-07-20", "description": "I tried the kimchi truck at the Highline Park. I got 3 tacos, one of each meat if i recalled correctly. I thought it was mediocre and the portions were small. I probably need like 10 tacos to be full. After reading the reviews here, I am glad I didn't have to wait for these tacos. I say, skip it if they have a line.", "author": "Man Chi N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-12", "description": "Grabbed lunch on a Thursday when they were in SoHo parked near Hudson and King.  I ordered the pulled chicken bowl, spicy, over multi-grain rice.  For $8 it was a good size amount of fresh veggies and delicious chicken with just the right amount of kick.  I'd certainly hit em up again if they were around.", "author": "Ira M."}], "servesCuisine": "Korean", "priceRange": "Under $10", "name": "Kimchi Taco", "address": {"addressLocality": "New York", "addressRegion": "NY", "streetAddress": "", "postalCode": "10281", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/Q-ut8XpilC2YjYRbYZh4hw/ls.jpg", "@type": "Restaurant", "telephone": "+17183601839"}