{"aggregateRating": {"reviewCount": 222, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-03-29", "description": "This truck is average.  I am a huge korean food fan, and this just wasn't that great.  The beef was too sweet--even for bulgogi/korean bbq.  The white rice was meh, and there was definitely not enough kimchi.  Compared to the bowl you can get at korrillabbq, this was a clear step down.  Plus, the 30 minute wait was not enjoyable.  If I'm going to wait that long, I will only do it for korilla, whose food kicks ass and is creative.   I found nothing creative about their bbq beef bowl.  So only 3 avg stars....", "author": "michael g."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-05-15", "description": "This was probably the worse Korean food I ever had. I'm always on the lookout for food trucks and stumbled to see what the hype is all about and stumbled on this one in williamsburg one night. Hungry, I couldn't wait to give it a try. I ordered the tacos with 3 different meats (pork, chicken and bulgogi). It took forever for the order to be filled as I probably waited 25 min for the food. Considering that food trucks are supposed to be fast in service, this truck did not pass. There wasn't a line however, because of how slow the service was, the orders were adding up and the crowd began to gather around waiting for their food. I don't understand how they can service people quickly especially during lunch if they can't even handle things off hours. I can imagine them being overwhelmed and having impatient customers. Anyway, the food finally came and I devoured the tacos not because it was good, but because I was hungrier than ever over the wait. The meats all tasted exactly the same...salty. I expected the bulgogi to have more of the sweet flavor found in most korean bbq meats but I couldn't taste it. I couldn't tell the difference between the pork and chicken except for the texture. The portions were good though; each taco had a decent amount of meat and vegetables and I especially liked that they put 2 tortilla wraps on each taco so it doesn't break apart. Prices are decent but if the food isn't good, then what is the point?", "author": "sally w."}], "servesCuisine": "Korean", "priceRange": "Under $10", "name": "Kimchi Taco", "address": {"addressLocality": "New York", "addressRegion": "NY", "streetAddress": "", "postalCode": "10281", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/Q-ut8XpilC2YjYRbYZh4hw/ls.jpg", "@type": "Restaurant", "telephone": "+17183601839"}