{"aggregateRating": {"reviewCount": 222, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-20", "description": "We got some awesome tacos, nachos and the beef kim-cheese steak when this truck was parked at the Northside festival. All were delicious and different, prices are great (3 tacos for $7, 4 for $9) and the sandwiches are huge! now I need to get myself to their new restaurant in Pro Heights!", "author": "Hannah B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-05-23", "description": "Not good.  My people, they have let me down.  Dried-out, overcooked meat, puny portions, kimchi overripe, taco contents poorly proportioned. :(", "author": "Georgiana M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-13", "description": "this place is no joke.  korilla truck gets too much attention cuz the food network show.  Im from los angeles, the home of the korean taco truck and this is as good as any west coast korean bbq taco.", "author": "Jesse S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-08-24", "description": "When going up against Korilla, in the Korean Taco sector, this is definitely not as good as them. The bulgogi tacos itself its pretty bland and soggy to eat. However, the rice bowls is not bad, considering they use black grain rice. The kimchi I feel overpowers the other flavors of the beef. Overall, for the price you pay, its not worth it, and I still think Korilla is the better truck in the Korean-Taco game. If you have a craving for Korean Tacos, and Korillas not around, I guess this can temporarily deal with that craving. Not terrible, but not great either. 2.5 out of 5!", "author": "Sean W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-03", "description": "This taco truck is great! My bestie has a gluten allergy so the man who helped us gave us a great recommendation! He served her some falafel chick pea with corn tacos! They were delicious. I had the Korean beef tacos with the extra spicy sauce. Tacos were on the small side, so I ordered three for myself, and two for her. We were happy with everything overall.", "author": "Jerrica J."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-05-08", "description": "People have got to stop hyping this up..\n\nSure, the tacos are a pretty great deal at 3 tacos for $7, but you're better off spending your dollars elsewhere, especially when all you're getting is three tacos of dry meat (tried both the chicken and the pork) with some kimchi tossed on top of it.  The filling was not only dry but flavorless, and therefore was completely overpowered by the kimchi.  I might as well have just ordered a taco without the meat.. basically was the same thing.\n\nThough I only tried the kimchi tacos, my disappoint with them has made me disinclined to take another chance at anything else on the menu.", "author": "Jessica L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-10", "description": "Great kimchi bowls and tacos. A little slow, but comes out fresh and hot, probably the best truck that comes to the world financial center area.", "author": "Shawn S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-04-02", "description": "Not for me! I'm so disappointed.\nI love korean, mex, spice, food with 'home cooked/ local flavor'. This doesn't taste Korean, and the fusion with Mex is not a winning combo in my book. I split 3 tacos (beef, spicy pork -- these were reasonably bland, the mex accents made them worse), chips and beans -- super unhealthy flavor wise nothing special but the most edible of everything, and spicy rice cake (fully inedible -- can't believe they ruined the sauce). \n\nThe people who work the truck are lovely. Worst food I've put in my mouth in a LONG time (including my own bad cooking). I was so glad I had a mint in my bag to get rid of the aftertaste. Blech!", "author": "Cathy M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-02-02", "description": "I was really curious and excited about this unique fusion but it fell miles short of expectation. The tortilla was soggy--I just ordered and went to Mad Sq Park, so it wasn't like I let it sit in the sauces for too long. The kimchi was very mild and not tasty at all.", "author": "M A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-20", "description": "my first nyc taco truck! and overall, a very impressive experience.\n\nmy current high marks, it should be noted, reflect a single meal. reading the other reviews, it seems this truck may be inconsistent or yelpers are an irrational lot with wildly high expectations and low thresholds for error.  either/or.\n\nbut tonight, this very night, under the high line, me and two friends got all of the following:\n\nbbq nachos\nrice cakes\nkimchi\npork cheesesteak with provolone\nbeef cheesesteak with whiz\n3 taco deal (beef/pork/chicken)\n\ngrand total: $31 even\n\nand even though the nice lady at the window warned me when it was finally my turn to order that sandwiches take longer, by the time we got our beers and found table space, she was a bit exasperated that our food was ready and getting cold and where were we?  \n\nthe pork has the best bite to it. the chicken is very mild but everything was nicely seasoned.  the cheesesteak rolls seemed to be amarosa's even - or a very impressive facsimile thereof. \n\nbbq nachos were sweet - think sloppy joe meat but dryer\n\nthe rice cakes are actually more like chunks of rice-pasta-material cut into large, bendless, solid elbows.  which isn't necessarily a bad thing (unless you are expecting a patty of something a little crispy on the outside). the gravy it was in was good though, and much of it was sopped up by unused taco wrappers, which reminds me:\n\npower-eating taco hint #1: taco trucks serve their ware in two wrappers. save stomach space and only use one.", "author": "Will R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-03", "description": "Amazing taco's here, all served from a truck.  I was amazed how good they were, and 3 for only $7.  Can't beat this place to quench your taco craving.\n\nIf you see a truck...you have to try it!", "author": "Matt S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-13", "description": "Friendly great tasting Tacos. The cheesesteak had too much sauce on it, the hero tasted fine but should have been wrapped better.  Get the Tacos or the bowl.", "author": "Danny W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-07-01", "description": "I finally got a chance to return to this truck after my disappointing first experience, and a failed attempt at a second try at the Hells Kitchen Flea Market.  I decided to go with the kim-cheesesteak after reading some great things about it, and went with spicy pork as the meat.  I must admit, the cheesesteak was pretty damn good.  It was a good amount of cheese, was really filled with meat, and had some onions and other vegetables thrown in there.  The meat is very juicy and was kinda running everywhere, but the bread held together very well.  For $7, it was definitely a filling sandwich.  2 problems I have with it.  First is a problem i had with their tacos as well, and its that there isn't enough kimchi taste.  I didn't see any kimchi in the cheesesteak and definitely didn't taste any.  It was basically just cheese and meat.  The second problem is how long it takes them to make the food.  Once you place your order you're waiting another 10-15 minutes for the food to be made.", "author": "John P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-02-07", "description": "Tried the kimchi arancini (crispy rice balls). The description read: \"kimchi fried rice combined with queso Oaxaca and Parmesan coated with panko and Italian bread crumbs\".\n\nThe rice balls were indeed quite crispy on the outside and soft on the inside, but overall, it lacked in much flavor.  I was a bit disappointed that my kimchi fried rice inside didn't have any kimchi in it. It seems the rice was just sauteed with the leftover juice from kimchi.\n\nThe rice balls also came with a side of spicy sauce, which tasted like gochujang (spicy korean chili paste) and water mixed together. It was spicy but did not have much flavor. \n\nOverall, 3 stars because of the texture, but I wasn't impressed with the taste. I'm still kind of curious to try the short rib rice bowl.", "author": "G D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-06-11", "description": "My coworkers and I went here for lunch once and we were hoping for something along the lines of Korilla (or maybe even better!)  In the end, we were disappointed.  The tacos were just eh and the spicy rice cakes were not good (and I *love* Korean rice cakes.)  The wait was long and while the food was cheap, I'd much rather pay more and actually enjoy it.", "author": "Kathleen Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-03", "description": "I'm excited to find a food truck that serves fresh and tasty meals. I was pleasantly surprised to find that the kimchi taco bowl is packed with so many different traditional and new flavors and spices, without any one flavor dominating it. Their combination of kimchi and cheese is soooooo good (i.e. Kimchi Arancini). Kudos to Kimchi Taco for their original and savory menu. And the staff is very nice and friendly.", "author": "Yun S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-08-10", "description": "I've been here twice - once while I was passing by the truck on a whim, and the second time purposefully.\n\nThe lines fluctuate a lot and can be long, but they are fairly efficient at getting your food out.\n\nThe first time, I ordered the three-taco combination. They weren't very filling and were more like samplers. If you like a lot of food for $7, don't take this option.\n\nThe most recent time I tried their chicken kimchi bowl for $8. It comes with your choice of white or multi-grain rice, chicken, kimchi and what looked like a version of pico de gallo. I thought it was pretty delicious, and finished everything.\n\nI think your mileage will depend heavily on what you order, so if at first you don't like your food, it might be worth trying something else.", "author": "Miguel C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-30", "description": "Though I wouldn't consider myself a food-truck connoisseur by any means, I do love food and was quite pleased with my experience when I stopped by the kimchi taco truck.  It was rather a dreary day, and as I told the guy taking orders that I was pretty famished, he steered me toward on of their burrito bowls.  Definitely a delicious and filling meal for $8.  I went with the barbecue beef over their multi grain rice.  Both were excellent choices.  The bowl was like a burrito that had been separated into all of it's components which allowed me to engineer my own perfect bite each time.  I love burritos and all, but I'm not a fan of hoping each bite I take will happen to include a little bit of everything.  The bowl was a neat spin on a burrito. \n\nService was great.  The guy taking orders was super friendly and helpful in suggesting that I go with the bowl.  My only complaint was that I noticed a couple of tacos go out ahead of me and saw they put some kind of sour cream on top of them.  I didn't open my bowl until I got home, but was disappointed to see that the bowl didn't come with that too.  Please make that an option kimchi taco??", "author": "Lilith D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-04-20", "description": "My first attempt to try this truck was a total fail.  I waited online for 45 minutes, in the rain, only to walk away.  I was early to work, I had time to kill...so I thought I would give this truck out to see what all the hype was about.  45 minutes later, there were still 10 people in line in front of me, and I had to get to work..so I just left.  \n\nBut I am persistent, if nothing else.  So I went back today to see if maybe they were just having an off day last week.  There were about 8 people in line before me.  To place my order and then wait for the food, wound up being a half hour.  \n\nI was intrigued.  Korean tacos?  \n\nI got a combo 3 pack of tacos (beef, chicken, and pork) and the arancini.  $10 for the 4 items.  \n\nThe arancini was good, but definitely didn't taste Korean at all.  If there was kimchi in it, I certainly didn't taste it.  I wound dunking it in hot sauce, drowning it, to get some exotic taste to it.  Without the hot sauce, I thought it tasted exactly like any rice ball you can get in any pizzeria in NYC.  It seemed like a good idea, but I think they need to increase the amount of kimchi they add into the mixture.  \n\nI was disappointed also in the tacos.  The corn tortillas were soggy.  The fillings were ok, but nothing to wow me.  Am I jaded?  The beef bulgogi one was interesting, and I would recommend you stick with this one.  The chicken and pork tasted like a taco that you can get any other Mexican stand, truck, or store..for cheaper.  The tacos can not compare to Tehuitzingo on 10th, and can't compare to Mexicue truck...they both blow these tacos away in their dust, in my humble opinion.  \n\nI am still interested in trying the bulgogi cheesesteak.  I must say I am reluctant to wait on line for a half hour or more to get a cheesesteak.  Is it worth it?  Perhaps I will wait for another truck to hit the scene, dissipating the line at Kimchi Taco to an acceptable lunch-time wait.", "author": "susan n."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-03-07", "description": "Kimchi Taco Truck's Manhattan launch was in the FiDi today.  I had the beef short rib tacos.  The beef was cubed (instead of ground) and a little dry -- the hot sauce helped.  The tacos were good,  but I guess I was a little disappointed since I understood this truck is run by alum of Momofuku and Ruby Foo.  I thought the food compared unfavorably to both Korilla and Big D Grub Truck.  I'll give them another chance, though.  It was their first day.  Next time I'll try their kim-cheesesteak.", "author": "SERENE N."}], "servesCuisine": "Korean", "priceRange": "Under $10", "name": "Kimchi Taco", "address": {"addressLocality": "New York", "addressRegion": "NY", "streetAddress": "", "postalCode": "10281", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/Q-ut8XpilC2YjYRbYZh4hw/ls.jpg", "@type": "Restaurant", "telephone": "+17183601839"}