{"aggregateRating": {"reviewCount": 222, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-18", "description": "This truck is not as flashy as the Korilla or Seoul food but the verdict is in and the meat here is THE BEST OF THE BUNCH (at least the BBQ short rib is)!!  I had the Korean BBQ Short Rib Provolone Cheeseteak with kimchi AND BBQ Nachos on the side topped with Short Rib AND Spicy Pork with kimchi, queso blanco, etc.\n\nFirst the cheese steak.  The two most important things about a cheeseteak are the meat and the bread and this truck nailed BOTH of them.  The roll had a nice crunch on the outside but was nice and gooey on the inside.  I almost thought that this was an Amoroso roll, it was that good.  The beef was phenomenal!!  Very tender, well flavored and a plethora of it on the sandwich.  This truck is much more generous with the amount of meat it slings to you than Korilla or Seoul. \n\nThe BBQ nachos were also very good.  Loaded with both pork and beef, it was an assault on the senses.  The chips were crisp enough to withstand all of the toppings and all in all this was a very good dish.  Not a complaint, only happy crunching sounds while I was eating this!\n\nMy only complaint is again about the kimchi.  While it IS very good, Korilla's kimchi is just OUTRAGEOUS and blows away the competition.  However, with beef this good, I will be back time and time again to get my shot rib on!!!!!!", "author": "Adam L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-15", "description": "Have randomly happened upon this truck twice. The first time, I was running extremely late for work *ahem*, and needed to grab some food. Luckily, I happened up the Kimchi Taco truck, and arrived at work well-fed.\n\nThe second time, I was wandering around Prospect Park when I happened upon a mass of Food Trucks. Apparently they all gather there every third Sunday. I looked around, and lo and behold, the longest line (by far) was for the Kimchi Taco truck. Being the herd animal that I am, I was delighted to wait in line (it also happened to be an exceedingly nice day, and I was in no major hurry). After waiting for about 15 minutes (the line was pretty quick), I received my Kimchi bowl (sans rice). \n\nQuite good, actually. A bit spicy for some peoples' tastes, but I thought it was just about right. Haven't had the tacos yet, but the people around me seemed pretty pleased. Overall, the next time I randomly happen upon this truck, I will happily eat here.", "author": "Dana L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-09-01", "description": "I was at the Highline Park today and decided to give this truck a try. I got the Chicken and Spicy Pork BBQ taco. I believe they were $.4.50 for 3 tacos. What did I think of it? Not really up to par with my favorite Korean Taco Truck Korilla. \n\nService: A little pushy and a bit slow. There is a bit of a wait after you order your food.\n\nPrice: I don't it's worth it, tacos are really damn small and there weren't that much meat on it and I thought it was quite pricey for the small tacos.\n\nFood: The Spicy Kimchi Pork Taco was good but the Chicken one---don't even bother, the meat isn't seasoned and tastes like plain grilled chicken breast with no taste.\n\nI think this place has potential but it's just not there yet. Korilla Tricl will still be my favorite Korean Taco Truck in the city and then comes The Krave Truck based in Jersey City.", "author": "Old Fart M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-03", "description": "THE BEST BBQ BEEF TACOS, EVER!!! The marinated beef in the taco was moist, rich and savory. Meat that is seasoned and cooked this well is very rare to find. The dukboki with cheese sprinkled on top left my taste buds tingling all over. \n\nAs a kimchi lover, my only request is that they add more kimchi to their beef taco. However, I must say when merely mentioning  this to the owner on my visit, he happily added more to help satisfy my kimchi cravings. \n\nIf I could, I would track down the Kimchi Taco truck every lunch hour.", "author": "Katie G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-03-24", "description": "Is it sad that every morning, as I walk to work, the things that I look forward to is what next food truck is parked outside my work?  Yes, food is always on my mind; I  guess it's one of the unpleasant symptoms of being a foodie.\n\nWhat is this new white truck that I see? Oh my goodness, a Korean Taco Truck? I love Korean Food and since moving to the big apple, I'm starting to appreciate food trucks. This MUST be good! Realizing that I am late to work from standing outside looking at the menu far too long, I quickly went to work, with kimchi taco on my mind.  Unfortunately, my excitement for the tacos was greater than my actual experience with the food. Here's why:\n\nI ordered the Spicy Pork Bowl, which comes with spicy pork, rice, kimchi, and some pico de gallo.  I had the option to choose multi-grain rice but they said it was sold out. Really? At 12:30? I like white rice so it was still fine with me.\n\nThe name \"spicy  pork\" is misleading. You pretty much had to pour the hot sauce over it to give it some mild kick (read: not spicy, just a tad).  It was such a tease because my tongue  would dance around the spice for a few seconds and that was it.   If you can handle some spice, don't even bother with Mild; I could have drank this as water!  Opt for the \"HOT\" instead. Also, the spicy pork wasn't very hot (temperature-wise); it was luke-warm.  If i had to pour my own hot sauce into the spicy pork, that requires labor on my part and thus, it should be $1-2 cheaper!\n\nThe pico de gallo was flavored well-very citrus-y. However, was it sad that I thought this was spicier than the spicy pork? They might as well named the dish \"Spicy Pico De gallo with not-so-spicy pork until you throw hot sauce on it\" Bowl.  But, that'd be too long of a name to pronounce and I'm guessing inefficient.\n\nBeing a rice bowl, I'd need to review another staple ingredient: the rice.. Unfortunately, it was cold!! As an Asian, that's like a slap in the face: how can my rice be cold? Shouldn't it be kept warm in the rice-cooker?  Unacceptable. \n\nThe kimchi felt diluted.  I know this may sound gross, but I like my kimchi as fermented as possible. I wanted the whole office to smell the pungent fermented cabbage and be the talk of the crowd during lunch/ watercooler.  Yes, I crave attention. It tasted like regular cabbage with vinegar and some chili flakes. No es bueno!\n\nFor a rice bowl, I'd rather have Chipotle and at $8, I'd be paying around the same price but have a satisfying, full meal.  But, perhaps their tacos are better?  I would give them a 3 but seriously, I've had better taco trucks (Korilla BBQ) so I think my review is fair for the meat and kimchi I've tasted.\n\nGuess its back to my boring salads and ham and cheese sandwiches on Thursdays.\n\nI will give this place another chance another week. Hopefully, they improve and I will give another score again.", "author": "Wing L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-25", "description": "Really enjoyed these tacos.  They are very small, but packed with flavor.  The beef one is by far the best,  that beef is marinated to perfection and will just melt in your mouth.  I suggest you you try all the flavors. But you will undoubtedly come to the conclusion that you should have ordered more beef ones.   Stumbling by this truck with a hankering for tacos was defiantly a wonderful treat.", "author": "Chris D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-03-07", "description": "I'd like to thank Serene for letting me know that it was the launch of this truck.... now I know why I spent 30 mins in the cold waiting for my tacos.  I'm chowing down on my 2 chicken tacos and 1 pork taco ($7) and they aren't bad. The food is definitely fresh, but the meat is a bit dry. By the time I got there, they ran out of BBQ Beef.\n\nI'd also try them again, but its prudent that they speed up the service.", "author": "Randi C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-26", "description": "Tofu Edamame Falafel tacos were soooooooooooo good. Like, I've never found anything like this anywhere else good. Kimchi, falafel, taco?!?!?? The best flavor combo!!!\n\nThank you, Kimchi Truck, for catering something unique to vegetarians instead of throwing bland (Korilla) or fried tofu in it or trying to make it taste like meat. Some vegetarians actually LOVE vegetables. \n\nThe ddukbokki was not too spicy and perfectly soft. It was a perfect portion to have on the side. \n\nThis veggie loving korean was one extremely happy woman.", "author": "Emily T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-06", "description": "I had the beef and pork kimchi taco.\n\nIt was well prepared, the meat was well seasoned and the kimchi on top had a nice kick to it!\n\nI wasn't crazy about the tortilla it came wrapped in, as it did fall apart a lot quicker than I would have enjoyed.\n\nRegardless, it was super tasty!", "author": "Melinda W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-09-02", "description": "They were servin up at the highline.  i tried the beef, pork, and chicken tacos for $7.  The price is steep for these little tacos, with the tortilla probably having a 1.5 inch radius. \n\nThe kimchi was a good add to this traditional mexican dish.  The tacos were delicious but I wish they had more toppings to add to the tacos.  \n\nNext time I will try the steak sandwich, if they dont lose my ticket. I had to wait 10 minutes for these cause the dude said somehow my ticket got lost.  I thought they were still pickling the kimchi.", "author": "Shauna D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-06-22", "description": "Meh. \n\nThree tiny tacos off a truck for $7 is enough to swallow, but you're wrapped up in the romance of the Highline and 'Rainbow City'. The taste of the meat (1 pork, 1 chicken, 1 beef) in all of the tacos was overwhelmed by peppers and garnish and hot sauce. Once you pushed past the burn, the pork left a slightly sweet and gamy aftertaste. \n\nI've experienced better. \n\nTwo stars is quite apropos. \n\n\nRANT: Aren't these food trucks getting a little out of hand and high on their hog? For these prices and no overhead I expect manna.", "author": "Dayna A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-11-11", "description": "Just ate here today w/a co-worker. I got 4 tacos for $9, 1 with each of the 4 different fillings:\n\n- chicken (I think it was mostly, if not all, chicken breast, not sure if there was any dark meat mixed in, though)\n- beef (Note: They used the bulgogi beef \u0026 not the kalbi beef - which was better for me b/c I hate kalbi, too fatty/chewy!)\n- pulled pork\n- tofu edamame falafel (which just tasted like regular falafel to me, I didn't taste anything tofu- or edamame-like about them)\n- regular spicy sauce (they give you a choice of regular \u0026 extra)\n\nThey give you 2 napkins, a fork, \u0026 a wet nap.\n\nTacos are all in a soft shell, with the fillings, topped with diced kimchi \u0026 cheese (at least I think it was cheese).\n\nSize of each taco wasn't huge, but after I ate my 4, I was left full but not uncomfortably full.\n\nHotness/spicyness: The regular sauce was pretty spicy. I'm assuming extra spicy would be ... um, extra spicy.\n\nWait time for order wasn't bad, either, I think like 5-8 mins. But I think this also depends on how long the line is. Line wasn't long today b/c it's Veteran's Day \u0026 not too many people are working (except for me! Bah!), there was no line when I walked up (just a few ppl who had already ordered \u0026 were waiting for their food).\n\nOverall, it was good. Or better word would be interesting. I liked the chicken \u0026 falafel the best.\n\nThe only bad thing:\n- Kimchi wasn't ripe enough. I like my kimchi very ripe (like super stinky \u0026 pungent) but this wasn't fermented enough (it was stinky but lacking on the ripe part). Edible but not the way I usually like it.", "author": "Christie S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-18", "description": "Starving and in a hurry? Got only $10 in your pocket and want good food? \n\nTry their 3 for $7 tacos... its amazing. I tried the Koren BBQ Short Rib, Spicy seared pork and Pulled chicken!!! For me, the spicy seared pork is the best!!! Its full of spices and flavor, yum!!!!", "author": "Shel B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-07-14", "description": "Tried Kimchi Taco at the DUMBO food truck lot today. I got the chicken bowl. It tasted good, but man, for $8.25 you expect to get a decent amount of food. My portion was measly, and it was mostly rice. I probably won't go back. 2.5 stars.", "author": "Nolan S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-08", "description": "A pretty good truck option; probably not as good as Korilla but good service and tasty food makes it competitive with other trucks.\nYou get 3 small tacos for 7$. We tried the korean bbq rib,  spicy pork \u0026 the pulled chicken. On hindsight, we should have taken the edamame instead of the chicken. Maybe next time :).", "author": "Swarnadeep M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-04-06", "description": "I've had Korean tacos once elsewhere and the Kimchi Truck didn't live up to it or prove to be unique...but I would go back.\n\n-$7 for 3 tacos (beef, chicken, pork or falafel).\n-Nice employee took my order\n-Despite the lunch rush and seemingly long line, I ordered and got my food within 10 minutes. Would go when they open though.\n-you can get mild and/or hot sauce with your tacos", "author": "Ashley L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-06-16", "description": "So I came back on Tuesday, as they were by my office and I didn't want to wander too far to get something to eat. I decided to finally try the Kimchi Cheesesteak with Provolone and beef, as I have been hearing good reviews for it. \n\nThe paper wrapping the Cheese steak actually stuck to the bread, so it became quite a messy ordeal to separate before I actually started eating. Eating the sandwich is messy, but it is actually quite delicious. There is a lot of meat and cheese, and all the flavors go together wonderfully. Therefore, I am upgrading the Kimchi Taco truck up a star. I would only come back for the Kimchi Cheesesteak, and only if there was not that long of a line.", "author": "Linda L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-03-22", "description": "I wanted to love you Kimchi taco truck. Your Kimchi is delicious but the little pile that you gave me for my falafal rice bowl was disappointing in size. Also, the ratio of rice to toppings was far too rice heavy. Finally, although the falafals were tasty, there was no sauce with the bowl so the texture with the rice was far too dry. \n\nCan I just order sides of your Kimchi and call it day please?", "author": "Melissa V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-01", "description": "It was a dark and stormy evening...the perfect one in fact for a pos-work out meat-filled pick me up. Kimchi taco truck to the rescue! This place is not reinventing the wheel. And their \"extra spicy\" is hardly spicy at all...but for $1 (that's right folks, on 3/1 it was (is) Kimchi taco trucks' 1 year anniversary...so get em' while supplies last...) you really can't beat it! \n\nGranted my sample size (of all 4 varieties) is so far just 1 (Korean BBQ Short rib - their most popular) - but it was a pretty good one. So until next we meet...I'm a fan!", "author": "Samantha C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-08-21", "description": "Finally tried this at the Food Truck Rally at Prospect Park.  I tried 3 tacos: the BBQ beef, pulled pork, and tofu edamame falafel.  Out of the 3, I would choose the tofu edamame since it was breaded/fried, and the kimchi flavor complemented it perfectly.  Although the beef and pork were marinated in different flavors, I felt the kimchi overpowered them both.\n\nJust like the other reviewers, the soft taco shell didn't last too long; it basically tore/broke by the 2nd-3rd bite.  I think it'd be cool if they offered a crispy taco version!\n\nI sadly wasn't able to try anything else since I wanted to save room for another truck (I can't eat a lot at one time) but I am willing to come back and have another try.", "author": "Michelle M."}], "servesCuisine": "Korean", "priceRange": "Under $10", "name": "Kimchi Taco", "address": {"addressLocality": "New York", "addressRegion": "NY", "streetAddress": "", "postalCode": "10281", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/Q-ut8XpilC2YjYRbYZh4hw/ls.jpg", "@type": "Restaurant", "telephone": "+17183601839"}