{"aggregateRating": {"reviewCount": 222, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-02-23", "description": "On the way to dinner I peeped the taco truck. 3 for $7 tacos = perfect pre-dinner snack. I ordered 2 grilled short rib tacos and 1 spicy seared pork and received 2 pork and 1 short rib instead. It ended up working in my favor cuz the short ribs were burnt to the point where burnt was the only prevalent flavor in the taco, overwhelming any flavor which might have come through from the cabbage or pear slaw. The pork tacos, although better cuz they weren't burnt, were still underwhelming. These just didn't cut it for me.\n\nFinal Verdict: Two thumbs way down!!", "author": "Wahed K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-03", "description": "After battling traffic and some crazy meetings, we stopped at Kimchi Taco and it was AWESOME. We did the fish tacos and the carnitas tacos. A little on the small side, but delicious. Well seasoned and not too busy like most tacos can get. We decided to order more since we were definitely still hungry and did the kimchi quesadilla. DEFINITELY worth it. The drinks are strong here and the staff was very nice. Good thing they're not too close to me otherwise I'd be there far too often.", "author": "Kimberly T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-05-07", "description": "Decent; I've had worse. Meat is decent. Kimchi slices are decent. Prices are decent.\n\nI dislike how you're seemingly forced to buy three tacos (for $7) - if I'm not that hungry, can I just have one? Or two? (Maybe you can? I'll ask next time.) Their menu does not make it apparent if this is possible.\n\nGripe aside, they're an efficient operation, and you won't be waiting long for your spoils.", "author": "Dave L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-06", "description": "The atmosphere was perfect, low key and friendly. They tacos - I tried the beef short rib, fish and chicken were all delicious. I wish had more room to also try they falafel edamame but that means I will have to come back. My friend had the pork burrito with hot sauce and guac and raved about the kimchi refined beans.", "author": "suzanna r."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-08", "description": "I can't believe the Kimchi Taco Truck isn't on Yelp yet. Had I know, I would have taken a picture of the truck itself for this review.\n\nThree little, glorious Korean tacos for $7: \n-Ground beef, pulled pork, chicken or tofu edamame falafel\n-Garnished with pickled radish, pico de gallo, green onions and kimchi\n-Served on small grilled tortillas\n\nConsider this: KIM-CHEESESTEAK. $7\n-Choose your meat\n-Garnish with kimchi, Cheez Whiz or provolone\n-Done up on a hoagie bread\n-WHAT.\n\nYour choice of spicy or mild sauce to-go. Spicy is tasty, not really that fire-hot spicy.\n\n\nThe truck moves locations:\nMon: Can't remember\nTues: Flatiron - 24th between 5th / Broadway\nWed: Can't remember\nThurs: Can't remember\nFri: Midtown East - 46th between Lex / 3rd", "author": "Pamela K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-01", "description": "First time at this truck near Grand Central Station on 47th and Park.  Line was long but it moved fast.  I ordered the 3 for $7 taco special, which if you order a special taco costs a dollar more.  Got the beef short ribs, the Al Pastor Pork shoulder, and the Korean fried Chicken.  Should have been $8 but she charged me $6.  Psyched.  Got back to the office and devoured these beauties.  This truck is a must go and the service was snappy.", "author": "Scott S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-20", "description": "Unique Sauce blend of Tacos a must try!!", "author": "Sumit S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-04-22", "description": "I was all happy and exited to eat at the truck but it was just a blah..\n\nThe deal was this, 3 tacos for 7 bucks, not bad to be in manhathan, so went for it. one beef, one chicken and one tofu/edimama. The line was 4 people deep and it was moving pretty quick. i also got an order of nachos, kimchi and rice balls.\n\nThe flavor of the tacos: they were a bit dry and so was the tortilla, i asked a friend to take a byte thinking it was just me but he said the same thing. The taco sizes are ridiculously small, they are made for a kid, you will need 2 orders to get a decent meal. The sides are better off, the nachos were excellent and had more meat on them than the 3 tacos combined and the nachos were 3 or 4 dollars. The rices balls were really good and the homemade kimchi was also decent. I just cant digest paying 7 bucks for miniature dried up tacos. Maybe was just today and i might try them once more to see, but this is just sad.", "author": "Juan T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-01-17", "description": "Kimchi Taco sells crazy-named things like Kimchi Arancini and Big Belly Burritos and Spicy Korean Rice Gnocchi and, I swear at one point (although no longer on the menu), Kim-Cheesesteaks. But if I'm going to a food truck called Kimchi Taco, I'm getting the tacos.\n\nAnd so I have. Four different types, to be exact. Not all at once, but across a handful of visits. OK, so I've ordered four at a time before. Four are $9! Individually, they are $3, so the fourth one is basically free. Step back.\n\nAnyway. If it means anything to you, these are some sexy tacos. I mean, they really look beautiful - corn tortillas packed tightly with meats and veggies and other ingredients of all colors, sprinkled with scallions, and then drizzled with miso crema. I just have to stare at them for a moment sometimes. But only for a moment, because then, you know, I gotta eat.\n\nHere's the obligatory breakdown:\n\nSpicy Seared Pork - Juicy, tender, and flavorful, between the spiced meat, red pepper paste, pico de gallo, and fresh kimchi, it's in my humble opinion that this pick's ingredients play best together out of the bunch.\n\nKrispy Fish - One of their specialty tacos (meaning a bigger tortilla at 6\" and a dollar more each when you include them in your combo), this one's definitely crispy, and even a bit spicy. I really like the batter, partially made from sweet potato starch.\n\nGrilled Korean BBQ Short Rib - It's got a great smoky taste, and it's nice and hearty, but I could've done with less red cabbage and more miso crema because it's just a touch away from being too dry.\n\nTofu Edamame Falafel - Honestly, the bland kimchi-infused refried beans made up about 50% of this taco, so I barely tasted any tofu or edamame. It was a wild card pick on my part without much chance for repeat business anyway, so no love lost between us here.\n\nA common theme with this truck is that their tacos are stuffed with (surprise!) a lot of kimchi-inspired items that look great on paper (i.e. pear kimchi slaw, kimchi chipotle aioli), but rarely wow beyond the aforementioned aesthetics. Perhaps the subtleties here get lost among the plethora of other ingredients. After all, there is an average of six components in each small taco (yes, I did the math), and that's excluding the tortilla, scallions, and miso crema that come with all your choices.\n\nBe advised, if you are expecting Mexican, look elsewhere. There is little Mexican about Kimchi Taco aside from the fact that they use a tortilla. It's Korean food, from a truck, served to white corporate types on their lunch breaks. Guilty as charged. And, for me, it's certainly satisfying enough. Plus, I now know which ones I like (Spicy Seared Pork, Krispy Fish), which one I will include to fill out a multiple taco order (Grilled Korean BBQ Short Rib), and which one to avoid altogether (Tofu Edamame Falafel). In the end, Kimchi Taco's not a truck I'll readily chase down, but it's a nice treat to see it parked outside my office as an option.", "author": "Dan R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-17", "description": "Kimchi Taco was a sponsor at an event I helped plan. We loved their flavor and unique menu items. They were a little slow at first to deal with the crowd, but once they got a groove, they worked really well with a large group. They also comped us some delicious food after the event, which was super nice. Great to have them as a partner!", "author": "Jess L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-10-17", "description": "This place was pretty eh. I spotted this truck in Long Island City, actually (don't know if they have a second truck at the La Guardia College location, but the logo/signage looks the same as the pictures for this truck). Similar to other reviewers, I got the 3 tacos for $10 and was kind of sad it cost that much. I'd chosen the fish, short rib, and grilled chicken. The meats tasted as if they were cooked last night and dried out under a warmer all day long as they were pretty dry and chewy. The fish tasted a little less old, but still not juicy. The corn tortilla was kind of stale and a bit cold. And I've definitely had better kimchi and sauces with korean tacos elsewhere. Granted, it was a little bit of a late lunch, 1:30 or so, but I really expected more. At that price point, it really shouldn't have been so lackluster.", "author": "Christine C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-11", "description": "This truck was at Electric Zoo. Saw their interesting concept and had to try it.\n\nGot the Korean BBQ short rib, pork, and crispy fish tacos. Overall were definitely good, but I felt the amount of meat was just a little small. And I'm not sure how well the kimchi flavors worked with some of the meats. I also agree that the super spicy wasn't that spicy.\n\nOverall, a decent food truck, not a bad option.", "author": "Sean K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-08-06", "description": "i had their kalbi rice bowl for $8. The portion was tiny and the flavour is acceptable.\nThe kalbi itself was not quality meat, as it felt more like another part of beef than the actual short ribs. Nothing was very memorable from this dish and it was a little salty. It was a fun experience and the food wasn't too bad, but i'd much rather eat a normal kalbi+rice dish in a korean restaurant.", "author": "Lynn C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-08-06", "description": "My order of a single Korean fried chicken taco took a whopping 7 minutes to prepare. I waited all that time in the scorching heat while listening to a screaming, sweating baby. Not the best experience. Not the best Korean fried chicken.", "author": "Brittany B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-19", "description": "I love this place. The three taco deal is perfect for lunch! The spice and sweet flavor balances the meal out. I recommend the \"krispy fish\" and \"krispy fried chicken\" tacos ... PURE PERFECTION!", "author": "Malique S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-06-21", "description": "Tried all 6 options for $20 at the Louis Armstrong fest (3 for $10...times two...REALLY confused all staff members) - mostly enjoyed all but the tofu falafel, which was dry. No noticeable kimchi funk in the purchased product, just in the air around the truck. And extra spicy packed zero heat.", "author": "George C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-12-29", "description": "A solid option if you pass by the truck while you're on the street.  I wouldn't recommend hunting it down and traveling to it.  They're definitely not as good as Korilla and other taco trucks I've experienced.  But the guys are really nice, professional, helpful, patient, quick to serve...and two of the guys are cute to boot ;-)\n\nI tried a kimchi falafel and a bulgogi taco.  I liked the flavor of both tacos as a whole.  But the falafel flavor was lost.  There was also no crunch to the falafel.  This is a big no-no in general...but especially when you're parked around the corner from a Maoz (which offers, IMO, some of the best falafel in the city).  The kimchi also didn't have much crunch.  It also wasn't spicy.  It was good.  But...yea.  It fell short, especially since the taco itself was cold.  They have a grill in there.  Heat it up!\n\nThe bulgogi was a good flavor.  But the super hot sauce I ordered didn't have a  touch of heat to it in the least.  And they didn't pack the tacos.  It's more taco than innards.  My hunger was quelled for the subway ride home...but I was hungry shortly thereafter.\n\nAn ok choice for a quick nibble, but pricier than the rest without being as solid of a product and filling you up as much as you should be at that price.", "author": "Christopher M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-03-21", "description": "I first tried this when I went to a food truck festival down at South Street Seaport. Kimchi Taco was one of 30+ trucks present. It seemed to have a huge crowd, and they say if a place is busy with customers, it should be good, right? Wrong.\n\nMy best friend and I ordered three spicy seared pork tacos for $7. They describe it as Korean spiced pork tenderloin marinated with red pepper paste and topped with pico de gallo and kimchi. Having tried Korilla BBQ earlier (another truck present at the festival), I was able to compare the two since the two trucks have similar concepts. The pork tacos were not very good at all. The tortilla was soggy and stuck to the roof of your mouth, and the pork was tough and spicy but not very flavorful. The tacos were very small, and our $7 would've been better off spent somewhere else.", "author": "Erica L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-26", "description": "Had the Krispy fish and they were delicious, with a hot mango salsa and slaw. Thought there'd be more of a kimchi flavor but these were delish. My husband liked the Korean BBQ beef tacos but I thought they were a bit gamey.", "author": "Kerri M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-11-19", "description": "This was a review of the tacos over the summer that I had but wasn't able to write a review til now. \n\nThe service was nice and efficient. I got these tacos (see picture) while outside of Trader Joe's in Union Square. I thought that the tacos were alright. The portion was kind of small for about $9(?), (I shared the tacos with a friend). They were like mini tacos, even though the photo enlarged the visualizations. \n\nThe beef tacos were more juicier than chicken tacos. I liked the toppings (pickled  radishes and carrots, kimchi, scallions, etc) i wanted a more zEst and zinG in the sauces!", "author": "Starry S."}], "servesCuisine": "Korean", "priceRange": "Under $10", "name": "Kimchi Taco", "address": {"addressLocality": "New York", "addressRegion": "NY", "streetAddress": "", "postalCode": "10281", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/Q-ut8XpilC2YjYRbYZh4hw/ls.jpg", "@type": "Restaurant", "telephone": "+17183601839"}