{"aggregateRating": {"reviewCount": 222, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-14", "description": "Really good Korean-inspired tacos which blend the ubiquitous kimchi in Korean cuisine with the convenience of the Mexican taco. My favorites are the BBQ beef and the surprisingly good tofu edamame falafel.", "author": "Marc P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-07-19", "description": "Kimchi Taco blew my mind the first time I had them (mid-May-ish 2011). However, on a recent trip up to the city, I had to ask myself \"WTF happened?!?\"...the Korean bbq beef bowl was so bland and flavorless that  I had no desire to finish it, unlike it's predecessor which I devoured like a madwoman in mere minutes. Was the menu tweaked? New chefs? Or perhaps the stress of finals had made me a bit delusional???? 3 stars due to the fact that my first experience was damn-near orgasmic.", "author": "Brittany C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-11", "description": "I'm not sure why this doesn't have higher ratings? I thought the food was light and delicious. It was the perfect portion.", "author": "Brittany S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-03", "description": "I agree with most of the points made by other Yelpers. A little soggy, a bit of a wait, and the chicken is a pass. But the price, flavor, and novelty of the truck overcome all these factors. Working in Midtown, this is absolutely my favorite truck, and in my top ten places in general for weekday lunch. Definitely give it a try.", "author": "Marcin W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-10", "description": "Oh man I love this truck!  The korean beef bowl and all 3 kinds of tacos are amazing!!!  Can't wait to try the cheesesteak.  The 2 sauces are excellent I love spicy food so I'm happy that the red sauce is very, very hot!  The only downfall is the long wait but it's totally worth it!", "author": "Antoinette A."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-06-06", "description": "This truck didn't do it for me. If you're named Kimchi Taco, you ought to make your kimchi edible. I couldn't eat it. Not going back.", "author": "Stefanie D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-08-25", "description": "The food was good here but not amazing. I got the Korean BBQ Beef bowl, which was nice to have during a lunch break. However, the portion size was a little small for the price ($6 would have been more appropriate). There was only a tiny bit of kimchi/other vegetables and not a lot of beef or rice.\n\nThe wait time wasn't as bad as I expected. I did have to stand in front of the cart for a good minute or two before they took my order (there was no one in front of me and I was literally staring at the guy who took orders) but once I placed my order I got my food about another minute or two later.", "author": "Andrew W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-31", "description": "I've tried the Kimchi Tacos several times now... I think the tortilla and meat are a little dry and bland. They could definitely work on the flavors. But, I love the ddukbokki and the spiciness in each bite. I think it's definitely worth a try if you're in the neighborhood - but I think they definitely have some things to work on...", "author": "Annie C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-31", "description": "Tofu edamame Falafel taco was like a tour around the world.  Delish.", "author": "Fawn V."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-05-10", "description": "Kimchi tacos--sounds great on paper, but hard to pull off in practice.  This place probably deserves three stars, but I had to deduct one for the wait.\n\nBecause really, the wait is the worst thing about this place.  The tacos are solid, and there's something nice about eating three small tacos with very different flavors, so this place would deserve four stars if the execution was spot on.  But two things are off-the time it takes to make a taco and the flavors.\n\nThe timing is off because they are probably doing too much in the truck.  They make the corn tacos in the truck.  I think they cook some of the meat and tofu falafels in the truck, and so it will generally take way too long to make whatever it is that you order.  Surely there must be some way to speed up the cooking/assembly process.  This is a food truck, so speed and convenience are important.\n\nThe flavors themselves were solid, but could have used much more pizzaz.  The kimchi was fairly mild, the meat was flavorful but mildly seasoned, and the result was that I enjoyed the variation in the tacos more than any individual option.  I think this place could end up much better, but they need to make some adjustment to boost it up to 4 stars in my book.", "author": "Aaron L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-03-02", "description": "I've been dying to try Kimchi Taco Truck ever since I read about it.  It was sooo worth the wait.  I wanted to try everything but decided to go with chicken taco and pork kimchi bowl first.  The meat was juicy and tasty.  I'm a purist when it comes to Korean food and both dishes had all the flavors I love in Korean food.  Can't wait to try the beef  taco and spicy rice cake.", "author": "Sugar C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-20", "description": "Loved the kimchi quesidilla.  The large was HUGE and fed about 3 or 4 of us. I got it extra spicy:) I think it needed a little more cheese though.", "author": "Cassandra N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-14", "description": "Foodie galore! I've tried the kimchi bowl, so many flavors but yet such a happy marriage. Loved it!", "author": "R D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-04-28", "description": "I rather have Mexican. Good but it's like fusing together a Vietnamese hoagie (Banh Mi) with an Italian Meatball sub. You should never use an Italian roll for a Vietnamese hoagie. In this case you should never use a Mexican corn tortilla with Korean bbq. The texture of the corn tortilla  was just wrong. I liked the idea of a Kimchi taco but they ought to experiment with a different taco shell.", "author": "Wen V."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-08-16", "description": "Had the tofu edamame falafel kimchi tacos at 47th/park -- good but could use more flavor, even with the supplemental hot sauce.  Seems that it has the potential to be really great but it was somewhat disappointing.  Will probably give it another try just to see if it was an off day, since the possibility for a better experience is there.", "author": "J K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-13", "description": "The best food truck downtown little overpriced", "author": "chris k."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-07-15", "description": "The line was really long but the staff working the truck were very friendly.  The short rib meat was really good but the kimchi was more sweet then spicy.", "author": "David F."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-06-03", "description": "Tried the three different tacos (pork, chicken, beef) and the beef burrito bowl.  Quite disappointed - the kimchi lacked in flavor, the meats were fine.  I preferred one taco shell over two - taco shell was just blah.  For that price and that wait, I'd go to Chipotle for a nice steak burrito bowl. The optional side sauces tasted terrible.", "author": "Stan P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-11", "description": "I had been excited to try this. I got 2 beef and 1 pork.  The torillas are small but 3 was a decent lunch for me. I ordered them extra spicy and I would recommend this because it was only just regular spicy to me. I liked the pork the best, one star ding for the beef being a little chewy. The kimchi, pico di gallo and fresh green onions worked great with the meat. Also they were friendly and thank you for waiting which is nice.", "author": "Maggie M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-07-28", "description": "Why the long line?  It was about 50 people lined up.  When I finally got my order it turned out to be some tired looking and not particularly flavorful scraps of meat dumped into a store-bought taco.  I guess there was some kimchi in there and that wasn't very good either, and I normally love kimchi.", "author": "Andrew S."}], "servesCuisine": "Korean", "priceRange": "Under $10", "name": "Kimchi Taco", "address": {"addressLocality": "New York", "addressRegion": "NY", "streetAddress": "", "postalCode": "10281", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/Q-ut8XpilC2YjYRbYZh4hw/ls.jpg", "@type": "Restaurant", "telephone": "+17183601839"}