{"aggregateRating": {"reviewCount": 222, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-04-28", "description": "The concept of a Korean taco sounds amazing. Who wouldn't love bulgogi and kimchi stuffed in a taco shell?\n\nGot their 3 tacos for $7 deal; one chicken, one pork, and one beef. They has a vegetarian option as well, but I quite frankly wasn't interested.\n\nThe tacos themselves were just okay. The meat was flavored well, but the kimchi was really mild. I was hoping for a more...kimchi flavor?\n\nWait time was ridiculous. I think my friend and I had to wait about 20 minutes after placing our order to get our food. I would never go out of my way to grab lunch here since I only get a half hour lunch break.\n\nI may eat here again, but only if I happened to run into them and had the time to spare.", "author": "Susan B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-05-19", "description": "I was so excited to try this truck after my coworkers had it last week.  It was a let down for sure.  I ordered the spicy pork kimchi bowl with multigrain rice and thought the best part of the meal was the sauce they give you on the side.  The multigrain rice had beans in it which were way underdone.  It took a lot of chewing before I could swallow it.  I've had spicy pork many times at Korean restaurants and this one definitely was not the same.  The pork was ground pork instead of slices of pork.  The flavors were ok but it was too dry.  Kimchi is part of this truck's name and their kimchi was way too salty.  When you mix everything in the bowl together, the flavors were basically sweet, spicy, and overwhelming saltiness.\nI don't think I would eat here again.", "author": "Lucy M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-03-21", "description": "Pretty innovative concept for NYC, but sadly did not taste a strong Korean influence aside from 1-2 weak pieces of kimchi and some asiany flavored hot sauce. \n\nFor $7, the 3 tacos you get are a good size for lunch. I recommend the pulled pork over anything else, and be sure to ask for the spicy hot sauce and use generously. \n\nTip: follow these guys on twitter and run out of your office as soon as they park. Otherwise, the line can leave you in the cold for up to 30 mins!", "author": "Serene F."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-08-26", "description": "Eh at best it was ok.\n\nWe had the 3 bugogi tacos and some Dukboki with some sorta cheese and a kim chi uhhhh cheese steak?  All 3 were meh at best.  \n\nSince it's a food truck - i have to rate them totally on their food.  At the Parked! food truck rally - i'd expect them turning food so fast that it'd be i guess...fresher?  or more flavorful since it's kim chi and it's tacos!  Both very flavorful foods!  \n\nAnyway - so the Dukboki's core were a little harder than i'd like it to be - it was undercooked - but the flavor was there for that one.  The Kim Chi Cheese steak thing - was a let down.  It was like a cheese steak, but with the usual seasonings replaced with kim chi and provolone.  It was a confusing at best and bland at worst.  \n\nLastly the Tacos.  It's Kim Chi Tacos for cryin' out loud!  Yeah...bland ish...ok - not amazing.  Just ok.  \n\nFor the price - it probably wasn't worth it.  I don't think i'll see them out to try it again.", "author": "Richard L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-03-19", "description": "I ordered the 4 tacos for $9 and got 2 short ribs, 1 chicken, and 1 pork. Each one is filled with different veggies and stuff. \n\nThe short rib was pretty good.\nThe chicken was not anything special and required the spicy sauce to give it some flavor. \nThe pork seemed a bit overcooked and I wasn't too exciting about it. \n\nThe tortillas were not very good. It sort of tasted like wheat but this could just be my opinion. They were also small so the taco would explode from your hand if you picked it up by hand. This is not a bad thing as it means they packed it well. \n\nI think 4 tacos are a good portion. I may return to try the special meats without the tortillas.", "author": "Stanley W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-13", "description": "I think the tofu edamame bowl is the best. The cashier is beautiful.", "author": "Jason M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-05-16", "description": "Came here for lunch.  At first, I thought it was $7 for a taco, but I soon realized it was $7 for 3 tacos.  I thought it was a good deal at first until you get to see the portions.  Cashier was polite, service was fast.  Probably had to wait no more than 5 minutes before getting our food.\n\nWe had one pork, one beef, and one chicken.  My favorite was the chicken because it had a sweetness to it.  The pork was a little dry.  Needed a little more fat in the pork.  Had a lot of meat with the beef.  The kimchi was just okay.  The tacos needed more kimchi in it and a stronger flavor of kimchi.  Either it wasn't the good quality store bought kimchi or it wasn't \"soaked\" long enough.  The thing that really turned me off about the tacos was the tortilla.  They wrapped each taco with 2 tortillas.  This resulted in the taco tasting very dry and not much flavor because of the tortilla.  The tortilla was definitely store bought and didn't taste very good at all.  My recommendation would be to use the indian nan bread to wrap the ingredients in.  I think it would have made it tasted a lot better.  If they make their own tortilla with their own spin on the flavor, this business could easily get up into the 4-5 star range.  I strongly feel that the tortillas are the downfall to this company.  The only small saving grace was the chilli sauce they have on the counter which you can take to go.  If you put enough of that on the tortilla, it helps with the flavoring it and it doesn't over power the main ingredients.  \n\nI would definitely recommend people trying it once, but don't have any high expectations for this place.  I'm giving it 3 stars instead of 2 because people or tourists should try it once.  Trying it once is already good enough to keep the business in the green.", "author": "Leo O."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-05-11", "description": "The tacos are small, and way over-priced!!! An order (which consists of three tacos for $7 or four for $9) is definitely not enough for a meal. Definitely need to add sides in order not to feel underwhelmed and still hungry (so your meal will come out to more than 10 bucks, which is surprisingly expensive for a food truck meal, IMO). Also, there's nothing particularly unique in the way this truck fuses Korean and Mexican.", "author": "Amelia C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-21", "description": "Tested out this truck for lunch one day since it was parked outside right on Front Street. The gentleman that placed my order was nice and friendly. (I always enjoy and appreciate small talk, it makes one feel less like a robot).\n\nI ordered the 3 tacos special for $7. Tried all 3 meats-- BBQ Short Rib, Spicy Pork, and Chicken... All spicy. These tacos are on the small side, but 3 tacos was enough to fill me up. \n\nThe Short Rib was really tender and savory and the Spicy Pork was just right.. Spicy! (But not too spicy). Mmm.. both were flavorful and delicious.\n\nAs a chicken lover, I wouldn't get their chicken taco again-- It was bland and was my least favorite out of the three.\n\nI'd come back again for lunch. Def. for the BBQ Short Rib and Spicy Pork. Yum!", "author": "Che P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-08-16", "description": "Tried the truck at jazz on the Great Hill in Central Park. The line was very long but it moved along quickly and they were really cranking out the orders. I had the crispy fish and the tofu falafel and really enjoyed both, with a slight preference towards the fish. I ordered extra spicy but didn't find it to be too spicy but I may be pretty hardcore when it comes to spice.", "author": "Stacie C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-28", "description": "The short rib burrito is excellent! Got it extra spicy and it was manageable but still had a very good kick.  My friend got the three tacos combo and he said they tasted fine but not quite filling for the money paid (think it was 3 tacos for 10 bucks).", "author": "Arthur A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-11", "description": "Good Good Truck Food!\n\nI was impressed by how good this food was for being a food truck.\nIt was pretty tasty, and I wanted more when I was done. I've always been a fan of tacos, so if you're are a fan of tacos like me, it's a must try.\n\nBut don't go looking for it... no no, it's not THAT GOOD to where you should go looking in NYC for it. But it is pretty awesome if one day while you're coasting the streets of NYC, and you're surprised with it sitting on the corner.\n\nYup... the best way to enjoy this, is when you randomly run into it.\n\nThen you know it's on.", "author": "Russell B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-03-26", "description": "Personally, I don't consider Korean tacos to be fusion cuisine. My perfect Korean taco is a grilled bulgogi and kim chee wrapped in a corn tortilla and topped with Korean hot sauce and spicy mayo. The only thing Mexican about it is the corn tortilla and the presentation. In the end, you're eating Korean food with a tortilla.\n\nNow, the Kimchi Taco truck does stray from my preferred formula but the food is generally good despite one major flaw. \n\nShort Rib tacos: meat was good and tender, like a cross between Carne Asada and Kalbi. Meat could have been sliced thinner, but the taco was very good. \n\nSpicy Pork: My favorite, but it is the most Korean of all meats served at the truck. Thinly sliced pork cooked in a spicy marinade. Meat was still tender and moist despite thinness of cut. \n\nChicken: The only good thing I can say is that the Chicken is also cooked well. However, chicken is bland totally lacks flavor of any kimd. \n\nOverall, whether if the flavor comes from Korea or Mexico, the flavors need to be much more intense. Kim chee needs to be more spicy and pickled. Daikon used in a sort if Pico de Gallo needs to be more pickled, tastes raw. Tacos were ordered \"extra spicy\" but none of the heat was apparent in the end product. The chicken is just bland, period. \n\nThe tacos had a simple but fatal flaw. The tortillas were not warmed properly. Corn tortillas are meant to be warmed up before serving. The act of warming makes the tortilla more pliable, less prone to breaking and taste fresher. However the tortillas were warmed on a flat top grill that was covered with a pretty decent coat of oil. Instead of freshening the tortilla, it crisped it a little bit, the end result being a slightly crispy, but stale tasting tortilla. The flat top grill does not need to be oiled for the tortillas. Warm tortilla till it steams a little and that's all you need. Fix that, and this truck has the potential for a fourth star.", "author": "Kenny L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-14", "description": "We tried out the Kimchi Taco Truck at the Parked! Food Truck Festival in the summer of 2012. \n\nI know that asian tacos are so common that it's become cliché, but Kimchi Taco really was quite good. We ordered three tacos (they're small, but bursting with filling!) so that we could try the beef, pork and chicken. The tortillas were soft, warm, fresh and delicious (and foiled my plan to save room for other food by not eating the tortillas) and the meats were flavourful and spicy. The kimchi on top was not your standard kimchi - it was cute (crinkle-cut) and crunchy. It added a nice acidity to complement the tacos. \n\nSince we visited the truck at a festival while it had a restricted menu and we had many other trucks to visit we did not try anything more, but we have talked about checking out their restaurant in Brooklyn the next time we're in NYC. Definitely recommend stopping by if you see this truck!", "author": "Janet N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-10", "description": "I got the trinity of meats - beef, pork, chicken - and it was a good mix. It won't overwhelm you with quantity, but it's food from a truck.", "author": "Mike C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-28", "description": "Lemme lemme upgrade ya!\n\nLots of the other trucks in WFC have been kind of uninspiring, and I went back to Kimchi Taco yesterday, and it was awesome. I don't know why I didn't give it 4 stars in the first place. Well let it be known! Consistency and tastiness gets ya the bump up! \n\nBy the way, get the rice ball thingies. They made me so happy, I am already planning my next trip just to make sure I put more of them in my face.", "author": "Justin M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-18", "description": "I have always wanted to try this place, so today, after already having lunch, I stopped by the truck to see if they'd just sell me a single taco, b/c on the menu it says you can buy 3 or 4 tacos.  They sold me a single taco for $3 ($7 for 3), so it was kinda a rip, but I just wanted a taste.\n\nThe best Korean BBQ beef taco I've ever tasted.  I recommend getting it \"extra spicy\" which isn't that spicy, but mighty delicious.  For a small taco, they pile it up with a good amount of meat and fixins.\n\nThese guys usually park in front of TJs on 14th street.  I can't wait to go back to try the nachos and the pork tacos.", "author": "Heather P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-06-27", "description": "I got the three different meat on tacos. It was parked around 23,24th street. \n\nIt was just ok. Didnt really fill me up as much as i wanted to. I WAS STILL HUNGRY! but it did taste good but i wouldnt go back again unless it was for other items.", "author": "Steven W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-11-29", "description": "Good, not great.  \n\nGrilled Korean BBQ Beef Taco: Marinade is good, but the beef is tougher than it should be.\n\nSeared Pork Taco: Best of the tacos.  The meat is tender and flavorful.\n\nPulled Chicken: Chicken was tender, but not much flavor.\n\nTofu Edamame Falafel Taco: Not bad, but wasn't a fan of the licorice-tasting seeds in the falafel.\n\nThe corn tortillas were good, but the kimchi and spicy sauce (regular) is overpowering for the tacos.  Needs another sauce to balance out the heat.", "author": "Eric H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-12-27", "description": "I got the edamame taco and asked for extra spicy - it was not spicy at all. The flavor was okay and the portions are kind of small for what they're giving you: $7 for 3 tiny tacos or $9 for 4 I believe?? It definitely didn't impress me but they have other options too so I guess I will have to try those next time.", "author": "Stephanie C."}], "servesCuisine": "Korean", "priceRange": "Under $10", "name": "Kimchi Taco", "address": {"addressLocality": "New York", "addressRegion": "NY", "streetAddress": "", "postalCode": "10281", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/Q-ut8XpilC2YjYRbYZh4hw/ls.jpg", "@type": "Restaurant", "telephone": "+17183601839"}