{"aggregateRating": {"reviewCount": 222, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-11-27", "description": "I had the seared spicy pork bowl at their Broadway Bites location. It was rather good - a good-sized portion with a little kick to it. Relative to other NYC prices it was reasonable given the size.", "author": "David L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-06-07", "description": "Ordered the Korean BBQ Short Rib bowl at it's popup in Broadway Bites. Not sure if I had too high expectations for an amazing collaboration of cultural foods and/or if I ordered the wrong thing (maybe nachos would have been better?) but the BBQ short rib bowl was definitely a miss. While portion wise it was generous, there was really nothing amazing or tasty about anything in the bowl -- beef was alright and somewhat dry, and by the end everything just tasted of salty and spicy kimchi and you barely could taste any other flavor in the bowl. Several bites in and I would not know the difference between eating cheap korean food and this bowl because I barely tasted any fusion of flavors. \n\nFood: 2/10\nPlace: N/A\nPrice: 4/10", "author": "Vicky Z."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-07-21", "description": "I stopped by one day when the truck was in Midtown and tried their 3 for $10 taco special.  I opted for the bbq short rib, spicy seared pork, and spicy grilled chicken.\n\nThe short rib taco was probably my favorite - the cabbage and kimchi slaw was nice to cut through the meat. \n\nThe spicy grilled chicken was fine, chicken was a little overdone, but I did like the chipotle aioli. \n\nThe spicy pork was good, with a hefty topping of kimchi and red pepper paste.\n\nI would note that the corn tortillas were a bit dry and rubbery, which was kind of a bummer, but overall fine lunch eats.", "author": "Steve L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-15", "description": "First time having Korean tacos was at Broadway Bites in Greeley Square! I had 3 tacos for 10 dollars, which I thought was a good deal! I got the short ribs one which had a nice heap of guacamole on top. Since I was their first customer of the day and they were just setting up at 11 am, the guacomole was on the very cold like just got out of the fridge side. The coldness overpowered everything else. The pork taco was so good. The other comments touched upon how little actual meat there was on the tacos, but since I love kimchee and almost anything and everything pickled, I didn't mind! Lastly, I ordered the fish one. I thought the taste was on point! The tortillas, however, were not the best ones I've had. Very chewy.", "author": "Kim X."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-10-03", "description": "The menu sounds really good but it was definitely disappointing. I tried the tacos and they were lackluster and skimpy on the fillings. The fried chicken and fried fish were chewy and the tofu edamame was weird. All the food came out cold, seems like they had pre-made most of their stuff and just assembled. It certainly showed.", "author": "Stephanie S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-08-30", "description": "Got the rice bowl extra spicy with crispy fish and was disappointed :( I love spice and loved the kimchi (reg \u0026 cucumber) but there was way too much liquid all over the bowl, so the rice couldn't even soak it up. There were a total of three fish pieces too, so it was a weird ratio spread out across the rice.\n\nI asked for a recommendation as to which meat I should get and was suggested the fish so I went with it but it didn't really meet my expectations. Yess it was for sure crispy but some parts seemed like more crisp than substantial fish \u0026 it tasted kind of old like it had been sitting out.\n\nHonestly I feel like the whole Korean + taco thing is overplayed at this point and people need new fresh innovative food ideas!!!", "author": "Hana S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-05", "description": "Krispy fish taco kimchi bowl.  Pretty tasty but line moved pretty slowly.  Probably wouldn't stand in this line again but I might want to try the tacos. This review was for food truck.", "author": "TN F."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-03-19", "description": "Overall, not great and not worth the hassle and long lines. The short rib bowl is solid and nachos are OK. Avoid the burritos, as they're incredibly dry. If you are on any kind of schedule, there is no point in stopping at this truck on a weekday for three reasons: (1) if you show up on time, they may not be ready (I showed up early once and waited until it was their supposed opening time and I was the first in line - they said they weren't ready and it would be a while - I had to get back to work so it was a wasted trip), (2) if you show up on time or a bit after opening, the line will be super long and unless you have a long lunch hour or your office is right next door, good luck cramming this into your lunchtime, (3) if you show up within their open window but toward the later side, they are likely to close early and/or run out of food.", "author": "Z. R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-07-18", "description": "Spotted the truck on 52nd \u0026 6th.  The kimchi arancini are delicious!  Fried little balls of rice that are crispy and creamy and spicy, definitively worth a try.\n\nI opted for the 3 taco combo and got short rib, pork and fish.  They were good, but the taco shells were on the hard almost stale side.\n\nThe short ribs were tender and scrumptious topped with red cabbage and pear kimchi slaw.  Seasoned well with a hint of spice from the kimchi.  The spicy seared pork were quite tasty. The krispy fish had such potential but the fish was way over cooked so it was tough.  It was topped with chipolte aioli, mango, kimchi slaw and daikon.  Great flavors but the fish itself fell flat.\n\nA friend got the burrito and it was loaded with rice and beans and while it was really good, it could have used a bit more meat.\n\nOverall enjoyable with great flavors, but with a few flaws.", "author": "Krista M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-07-01", "description": "I ordered from the Kimchi Taco Food Truck located at Bryant Park today. Needless to say, the wait was pretty long, only because there was an enormous amount of people and it was during lunch hour. The crispy fish and bbq short rib taco was so delicious. The sour veggies and mango salsa was so flavorful. I loved it. However, the spicy chicken wasn't as good. It is made fresh, in front of you, and served hot. It was so yummy. The kimchi fries had more kimchi than fries. The toppings with the fries were slacking. There were a few black beans here and there. The cheese was okay. I felt like I was mainly eating only kimchi. The korean bowl with crispy freid fish was the best of all. It was packed with assorted veggies and sauce. It was great.", "author": "Alice L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-08-27", "description": "Meh. Spotted this food truck near my work. I love Korean food, and I love tacos. So I immediately gravitated towards the truck. The line was pretty long, but it moved quickly. \n\nI had the three for 10 taco. Fried chicken, fish, and short ribs. And also the kimchi fries. The tacos were  luke warm, but the fries were hot. The flavors for the tacos were just not there, the meat was overlooked and bland. For a fried chicken taco, you would picture crispy juicy, but it was soggy. Out of the three the one I like the most was probably the fish taco. The kimchee fries however was delicious. Great flavor, nice and hot.", "author": "Susanna L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-01-30", "description": "I met up with my gf for lunch here-well it was near the City Center. Since it was bitterly cold out, there wasn't a huge line and I decided on the 3 taco combo with an extra buck for the fried chicken special taco-the other two being the short rib and pork. The lady got the tofu edamame with 'Spicy Korean Rice Gnocchi' as a side. \n\nThe tacos each had a their own character but that was because of the garnishes. I couldn't taste the character of the proteins. The pork taco being the most flavorful, again because of the gochujang, pico and kimchi. The kalbi was okay, with the filling being the most flavorful of the bunch. I got a lot of crunch from the fried chicken taco but couldn't taste much else. Similarly, the tofu edamame was not that impressive for the lady friend.\n\nThe dukbokgi, which is what the Rice Gnocchi was supposed to be was absolutely terrible. We opened the container to find six pieces of really sad looking duk.The rice cakes seemed undercooked, the red pepper glaze wasn't smothered so much as just squeezed out and the cheese didn't make it taste better. The tacos were just okay, and the absolute abortion that was their dukbokgi made it a little disappointing.", "author": "Ted C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-12-07", "description": "I decided to try 3 tacos.\n1. The BBQ korean short rib\n2. Spicy Grilled Chicken\n3. Tofu Edamame Falfel\nThe size wasn't huge, its a good snack, not a meal. The tofu edamame falafel was interesting. It was healthy yet delicious. I gotta say my favorite was the BBQ korean short rig.", "author": "Stephanie Q."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-01", "description": "Great Taco Truck! Really good selection of Taco's and bowls. The loaded nachos are also exceptional and two orders of them makes a really good meal. \n\nOnly con is that it stinks up the office a little. But the taste is great so if you don't mind offending your coworkers with the smell, roll in with some tacos and eat them like a BOSS!", "author": "Alex B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-04-20", "description": "Ordered a Short-Rib Kimchi bowl.  \nNegatives:\nWaited a long time for the food.\nOrdered white rice, got brown.\nThere was very little rice.\nThere was even less short rib.\nThe smell of the kimchi wasn't very pleasant at all (I've had kimchi many times before)\nFor $9.50, it was not worth it.\n\nI would give it 1 star, but I'll just chalk this up to an \"off-day\" for them.", "author": "Nelson L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-03-09", "description": "Found this truck on 45th and 6th.\n\nNot a bad lunch. Got the spicy pork burrito for $9. It had nice flavor and seemed pretty big in size - similar to Chipotle. But like other reviewers have mentioned, they really skimp on the meat - so you'll need to decide if a $9 mostly-veggie burrito is a good deal.\n\nAlso got a small kimchi fries for $5. They definitely load it up with more toppings than fries, but the flavor was good.\n\nOverall , decent", "author": "John Z."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-21", "description": "BIG Surprise from a jaded food truck guy from California.\n\nMy food truck experiences in New York have been less than spectacular. It seems to me that NYC loves to jump on hype so fast that anything you sell within a 40 block radius of Times Square will magically be special. Food trucks in NYC have fallen to this mode of thinking. And Kimchi Taco is the first to really impress me.\n\nI want to point out that I had other options at that moment, and that I didn't know what to think when NO ONE IN THE DAMN TRUCK was Asian OR Korean for that matter. Worrisome? Maybe, but Fuck It. Let's give it a shot. The menu seems good.\n\nIt's 4 tacos for $9, and there are only 4 tacos on the menu, so here's my take. Edemame/Tofu vegetarian option. YOU CAN SKIP THIS. Although tasty and spicy, still a shitty vegetarian option. I mean that most places have to come up with a veggie option for those do-gooders of the world trying to save little Bambi from his eventual death. I appreciated the neatly julienned pickled diakon an carrots though. The short rib taco had the flavors, I just wish it were bigger. Pulled chicken, great.. OK let's just get to the BOMB Spicy Pork. This is all you need to order. It's probably just as bomb on everything else on the menu. Korean spicy pork is the food of angels. And in a taco, the food of Victoria Secret angels. You know which one I'm talkin' about!.. Alessandra. You thought I was gonna say Adirana Lima didn't you?\n\nI think they should double up on the tortillas. In Cali and I'm sure in Mexico, they use this method. It helps things stay in the taco! And it makes each taco a more substantial snack! Great value otherwise. I would definitely get a snack from here again, and again, and again.\n\nDon't forget to order your tacos spicy!", "author": "Alex K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-08-27", "description": "Would have been four if they got the order right - but it's till good enough to give it three (unless a vegetarian - then a wrong order could be very wrong. Three tacos for seven and gnocchi - not traditional  but good (made with rice.) when they say spicy they mean it - have a drink handy. Fish and chicken were good - the falafel itself was good but not digging the taco form, more of a classic gal when it comes to Mediterranean ( especially having eaten the food while on a trip.) none the less this was a full in a good way place. Easy to eat in an outdoor setting - great truck food (coming from a Rutgers chick.)", "author": "Leela K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-05-14", "description": "Really poor, insulting service. At botanical gardens for mothers day and they ran out of options and were incredibly rude when i asked for a discount - even though they had nothing I'd  waited for for over 40 mins. This place is run by rude, arrogant  amateurs and is 200%  phony. Avoid at all costs", "author": "Jonny S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-07-04", "description": "We were expecting the Korilla Truck but were sadly disappointed when only the Kimchi Taco Truck was there. My family had warned me that this truck wasn't as great so to set my expectations low. This place was merely a pit stop for a snack before we headed to get some curry for dinner.\n\nI ordered the fresh kimchi bowl with korean bbq beef. They describe this as a healthier approach to the kimchi taco. It contains everything but the tortilla. We got the bowl with the purple rice. It includes a ton of lettuce that is mixed in with the rice and then it is topped with your meat of choice. Unfortunately, this place was a big disappointment. \n\nAlthough the meat was flavored well, the texture was rather tough. I found myself chewing on it longer than usual. The purple rice was undercooked and with the combination of the lettuce, it made everything that much more difficult to eat. They didn't give that much kimchi and I wish they had because it tasted way better than everything else.", "author": "Jennifer L."}], "servesCuisine": "Korean", "priceRange": "Under $10", "name": "Kimchi Taco", "address": {"addressLocality": "New York", "addressRegion": "NY", "streetAddress": "", "postalCode": "10281", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/Q-ut8XpilC2YjYRbYZh4hw/ls.jpg", "@type": "Restaurant", "telephone": "+17183601839"}