{"aggregateRating": {"reviewCount": 222, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-13", "description": "Food - 4/5\nValue - 4/5\nService - 4/5\nAtmosphere - NA/5\n\nAfter the somewhat disappointing meal at Big D's Grub Truck, my coworkers and I decided to give Korean-fusion another try at Kimchi Taco Truck.  We ordered the Kim-Cheesesteaks (47), I had the spicy pork while my friend got the bulgolgi (marinated beef) again. The cheesesteak was very good!  It was a good combination of cheese whiz and kimchi sauce.  Cheesesteak joints have to add Korean style to their menu!   I also got the ddeokbokki (spicy rice cakes, $3), its nothing special but good if you are craving them.", "author": "Eric M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-05-04", "description": "I'm a regular with Korilla but I knew Kimchi Taco existed pre-Korilla so I headed over to give this a taste test. The ddukbokki (rice cakes) were too hard, as if they were frozen bought in the Korean supermarket and hastily heated for the truck. The sauce wasn't as authentic as I hoped it to be and the cheese that were peppered on top of the rice cakes was unnecessary because it wasn't tasty at all. I also got the rice bowl with beef and the beef was too grilled/burnt for my liking and was kind of rough in texture. The little veggies surrounding it was alright, better than the beef actually. The rice was a tad too soggy. Sauce in the rice bowl wasn't bad. Overall I think this was a poor attempt in bringing out the Korean flavors which is a shame because I know they're trying to but the execution was just poorly thought out. Think I'm gonna stick with Korilla.", "author": "KL Z."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-03-19", "description": "Avoid this, it just isn't good.the only thing they are doing right is the kimchi.\nTacos are too soft and the sauce was runny. They didn't put enough pico either to give a balance.\nThe meats were really dry. I had beef, chicken and falafel.\nI ate all the beef, most of the falafel and after one bite of the chicken, completely left that aside. Chicken was way to dry and under seasoned.\nKorilla would be the better choice. Good luck, please work on that food!", "author": "Sarah Z."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-23", "description": "Went to this food truck down in Battery Park/Tribeca in the Food Truck Court near WFT 4. \n\n$7 gets you three tacos, I went with the Short Rib, Spicy Pork, and Chicken. Also a Tofu Edamame Falafal option that I will try next time.\n\nThe tacos were small but full, lots of greens and onions on them as well. \n\nReally enjoyed the Spicy Pork and Short Rib, Chicken was just ok. Overall though a great and different lunch option and for only $7. Sign me up.\n\nCheers.", "author": "R H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-07-10", "description": "I really like the tacos.  Disagree with the reviews about overcooked, had this 4 times and that was not my experience.  Short rib and crispy fish both excellent.\nHowever, I waited last time almost 50 minutes for lunch, and the time before almost that long.  They only come to midtown once a week, but I don't know how to justify waiting that long.  The frustrating part is that they could clearly be more efficient - I would have less of a problem waiting if they were just serving that many people.  Computer was down (okay, happens, maybe they get one pass on that.)  But please - just hire a consultant with a degree in operations management for a week, and listen to what they have to say!  It would clearly be profitable for them to do so, as they have a quality product I would happily keep paying for.  I'd pay more if i didn't have to wait forever.", "author": "Kevin O."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-06-15", "description": "My friend told me about the Kimchi Taco truck, so I thought I should try it. The service was pretty fast even though there was a line. I ordered the Korean BBQ beef kimchi bowl and kimchi arancini. When I took the first bite from the kimchi bowl, I thought it was amazingly good. However, after a few bites, I thought the meat was a bit too dry and there was nothing special anymore. The kimchi arancini was alright, it was deeply fried and spicy. Overall, I would only eat this once in awhile, but it was worth a try.", "author": "Susan L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-03-14", "description": "What? A Korean taco truck in NYC? How much better could life get?\n\nHow about TWO Korean taco trucks in NYC?\n\nI was already flipping my shit over Korilla BBQ when I saw the Kimchi Taco Truck cruisin' up Washington Ave one morning. A little research indicated that not only did Korilla have a competitor, but that they're looking to open up a restaurant in my neighborhood! Who wins at life? Anna wins at life!\n\nGreat karma took an unexpected nosedive into my life just days later when a friend texted that he was waiting in line at the Kimchi Taco Truck a mere two blocks from my office. You've never seen anyone hustle out of an office so fast. I think I left like one foot and half my brain behind.\n\nIt being my inaugural visit, of course I got the kimchi tacos: one each of chicken, beef and pork. I was so excited. I'd been waiting in line for SO LONG. I was SO HUNGRY!\n\nUnfortunately, the kimchi tacos did not live up to my expectations. Unlike the Korilla BBQ tacos, which drip saucy goodness all over the place, these puppies were really dry. I tried them with both mild and spicy sauce and they still didn't have that juicy flavor burst I was hoping for. The toppings were scant... just a few small pieces of tomato and what looked like scallion. Certainly nothing that would drip all over me and require a multi-napkin clean-up. I barely even got my hands dirty!\n\nMy friends each got a version of the cheesesteak, one with beef and one with pork, and they were, in my opinion, both juicier and better (and, needless to say, cheesier). So maybe I just ordered wrong. I'll certainly be back and I'm hoping for an improvement, preferably in the form of moister, juicier meat and more robust toppings. Oh and maybe softer tortillas, too.", "author": "Anna S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-11-18", "description": "It's everything they said it would be. Everything about it was delicious! \nI had the beef and pork tacos. I'm not sure about anything else on the menu but I'm definitely going back to try them.", "author": "Nanci P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-05-23", "description": "Would give it a two, but Korean flavors are hard to find, and this place has them, but the ingredients aren't all that great (pork was kind of dog food like).  I had a bowl, would try a taco, but not with these reviews.", "author": "Craig Z."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-07-31", "description": "It was decent.  The kimchi itself is very vinegary, which I LOVE in kimchi.  I could have just eaten a bowl of that and been happy as a clam.  Everything else, however, wasn't so great - the rice wasn't the typical sticky rice I'm used to, and I think the meat (I got the pork, which tasted oddly like beef) kind of dragged down the overall quality.\n\nI feel bad.  I was really excited to try it, and I enjoyed it while eating it, but after I realized that I'd be better off just getting bibimbap from K-Town.  I'm definitely willing to give it another chance, though.  I really DO want to like this place.\n\nUse loads of hot sauce, it becomes way better.", "author": "Tanya T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-07-03", "description": "My friends and I came here to eat because we were at the High Line. This was the only truck with the longest line, so we decided to give it a shot. \n\nOne of my other friends and I got the 4 tacos for $9, and my other friend got the burrito bowl. We were so confused at the menu. Sad to say, but my friend and I think way too much. For $9, we get to choose any combo: pork, chicken, falafel, or beef. So we were like \"Choose 4 combos? But they already gave us the max of 4 combos to choose from? What the hell does that mean? Are there more combos to choose from?\" Man, I thought I was the only one thinking that, but apparently my friend thought the same as well. I guess great minds think alike, or stupid minds think alike, haha. \n\nAnyways, while waiting on line, we noticed that the portions were extremely tiny. I was hoping that by paying $9, we would get something that was extremely filling, but no.\n\nThe tacos themselves weren't that great. Too salty, with the kimchi overpowering everything. The meats were too sweet, and all the tacos tasted the same to me. I couldn't distinguish which taco was which because of the same flavor profile. \n\nThis place is only good to try once.", "author": "Jennifer H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-04-28", "description": "Two of my favorite food trucks, Chi'Lantro and coreanos (both in Austin), serve Korean-Mexican fusion cuisine, so I stood in line for Kimchi Taco without even reading Yelp reviews first. Big mistake! While I didn't expect anything as great from this truck, I didn't expect something so bland and miscooked, either.\n\nI ordered two Tofu Edamame Falafel tacos and a Krispy Fish taco. The falafel tacos were the better of the two, but nothing special. I'd much rather get better falafel from King of Falafel \u0026 Shawarma, taïm, or another establishment that specializes in it and understands how to make flavorful falafel. Why throw a feeble attempt at Middle Eastern cuisine into the already fusion mix?\n\nThe Krispy Fish was awful. At least it was crispy, if you can call something that tough crispy.\n\nThe accompanying ingredients were bland and the tortillas fell apart too easily. I can't see anything going in favor of Kimchi Taco over Korilla BBQ, already not one of my favorite trucks for lunch in FiDi.", "author": "Deepyaman D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-08-21", "description": "I give it 2 stars because at least the tacos were edible ... but 1 star for the flavor!\n\nCan't believe I stood in line in the heat in Prospect Park for this .. there was a super long line so I expected it to be good .. DO NOT WAIT IN LINE FOR THIS, NOT WORTH IT ..\n\nBF and I are korean bbq and kimchi fanatics so we were very excited .. turns out the korean bbq beef just tasted like chopped and boiled beef .. no marinade whatsoever .. the kimchi was the only thing that added any flavor to the tacos .. and they were small by the way, which I didn't mind because I only ate one (which broke by the 2nd bite) and tossed the other 2 ..\n\nthen I walked over to Wafel\u0026Dinges to get my fill ..", "author": "Anvy A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-07-09", "description": "Exactly, Yelp. Three stars = A-OK. I desperately want them to be amazing, but they kinda just show up to do the job. I tried the 3 taco sampler for $7: grilled chicken, tofu edamame falafel, and short rib each. The chicken taco was not memorable, although next time I'd be willing to try the fried chicken taco instead of grilled. A bite of the falafel taco packs a mouthful of refried beans, which I wasn't excited about. The meat in the short rib taco was dry but with good flavor. I would have been happier with 3 short rib tacos. Overall, I think the ingredients could be fresher, but the flavors are definitely there. A decent choice for food truck fare, and it makes a satisfying snack.", "author": "Mia M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-07-03", "description": "Already being a fan of Korilla BBQ, I was excited to hear about the launch of the Kimchi Taco truck. Yay! More korean food near my office.\n\nBoy was I disappointed... I had a pork rice bowl and for $9, the portion was tiny. I ate it and was still hungry, and I'm not that big a person either! The rice was dry and hard, the pork was ground pork and flavorless. The kimchi was the only redeeming factor and it was average.", "author": "Ana C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-10", "description": "I ate here once. I ordered the $9 dish that had pork + beef + tofu + chicken taco. My hubby got the nacho dish that had bulgogi on top of it. . \n\nI recommend pork, beef taco, not so much chicken and tofu ones.\nNacho was very delicious. \n\nVery good fusion btw Korean spices in Mexican style presentation.", "author": "Hyunyoung S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-07-19", "description": "Big line, normal looking people, tempting smells - you'd think that this would be all you need in order to gauge if this will be an amazing food experience.  \n\nAll these people can't be wrong? \n\nWell I definitely question the kitchens they came from because this was the most uneventful and unappetizing display of Korean-ish BBQ I have ever experienced.  My tastebuds say, \"No\".\n\nI tried Kimchi Taco off of the insistence of a friend and I was disappointed.  The food is eatable but the overall presentation was sloppy.  The look of the bowl option was not what I expected. It made me opposed to completing the full meal.\n\nI don't consider myself to be too food snobbish but of all of the trucks that stop by the area where I work (HOUSTON/VARICK) - I wouldn't count this as something I would check out again.", "author": "M P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-06", "description": "Wow I dont get the reviews. Maybe I'm off or just having a great day, but I thought this place was awesome. \n\nI've been to Big D's and Korilla and I am also a huge fan of the Kogi truck from LA. While I like BD's and Korilla, I thought they really werent capturing the whole Korean/Mexican thing completely right. To me it tasted more like Korean food in a tortilla (which isnt necessarily a bad thing).\n\nMoving to the Kimchi Taco Truck, I thought they did it right. The food really felt like a nice mix between mexican and korean and I thought their meat, their kimchi/pico de gallo and their sauces were top notch. \n\nAlot of people have commented that they werent a fan of the kimchi, but I thought the kimchi was perfect. \n\nMy only suggestion to get this to a 5, make a PURE burrito. All of the ingredients are there. If you put it on the menu I will follow your truck around every day of the week!", "author": "Michael S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-12", "description": "Updated... so I tried the tacos again and they have definitely solved their initial problems with the tortillas. The meat/tortilla ratio was spot on and the tortillas held up against the weight of the meat.  Flavors are still great and it's one of my favorite lunch trucks to go to... seriously it is the highlight of my day when I can grab food from the Kimchi Taco Truck!\n\nPreviously, I also tried the Kim-Cheesesteak with the beef and provolone cheese.  It was a bit messy but a clear winner in terms of a filling and tasty sandwich!  \n\nYes, the wait can be long, but on a nice sunny day I'm not complaining about getting to break away from my desk for awhile. Plus they always thank you for waiting.", "author": "Alaina W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-07-01", "description": "I need to try this again, for sure. I had the arancini.....and if I'm honest, I have to admit, I'm almost always underwhelmed by arancini (except for the ones my brother made one Thanksgiving, on a whim - those were DA BOMB as they say. Or as they said. I'm pretty sure I'm dating myself with that phrase already). I mean, come on - fried rice balls and dipping stuff? Allegedly awesome, right?But always it turns out to be better in theory than in practice.\n\nI will say, however, that these were at least spicy and somewhat flavorful (as opposed to the almost universally bland variety I've had that don't involve kimchi paste). But still -  I probably made the wrong choice. So I'll give these guys another choice. Frankly? The nachos (beans with kimchi over fried wontons? YES PLEASE.) sound right up my alley.\n\nSo - I'm on the fence here. I've already admitted to a streak of optimism despite pimping my supposed realistic outlook. So maybe that will work for me here.\n\n'Cause seriously? I so want a kimchi/taco fusion thing to rock my socks off.", "author": "Jen S."}], "servesCuisine": "Korean", "priceRange": "Under $10", "name": "Kimchi Taco", "address": {"addressLocality": "New York", "addressRegion": "NY", "streetAddress": "", "postalCode": "10281", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/Q-ut8XpilC2YjYRbYZh4hw/ls.jpg", "@type": "Restaurant", "telephone": "+17183601839"}