{"aggregateRating": {"reviewCount": 29, "@type": "AggregateRating", "ratingValue": 2.5}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2019-02-28", "description": "Just your standard hole in the wall Chinese restaurant you can find. The prices are very reasonable and the food is decent. Got the Roast Duck with Pork Fried Rice which is about $7. Probably one of the best deals you can get in the area for duck and rice combo and it definitely will fill you up!", "author": "Jacky C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-01-30", "description": "for quick cheap bite...nostalgic Chinese restaurant. I've been going to Lee's Villa since I was child...I continue to order the pepper steak combo...it feels good to go where they recognize me and already know what I'm going to order...I now take my daughter who will continue to her children as well.", "author": "Redsouljah A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-09-16", "description": "Lee's Villa has been downtown Brooklyn for at least 30 years. Now this is a name change, but I have been coming here so long I forgot the original name.  The service is quick, the food is good and fresh. I must admit from time.to time a few unsavory character's come through,  but......\nYou can get practically anything you want here, now keep in mind this is a Chinese food restaurant.  You can get pork chops, oxtail, rice and beans and fried plantains. The combos are endless, and great deals. You can also get traditional dishes as well.  Quick, cheap, good and hot. Not to mention, yeah it's a hole in the wall. But a good one.lol.\nI was going to take a picture,  but someone ran in to keep from getting beat up, so it disturbed my groove. Come in sit down and give them a try. Or do like I just did, get it to go !", "author": "Jacqueline E."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-03", "description": "This place is extremely dirty. \nI really felt like having fast Chinese food in a area and saw this restaurant and tried. \nThe food wasn't bad, it's quite good actually. \nWe had pork fried rice (it doesn't look very delicious but tastes good) and sweet \u0026 sour pork, beef with Peking sauce, all of them are not bad.\n\nBefore we were leaving, we both went to toilet - this was hideous experience, I have been worth ones but this is definitely one of the worst level. \n\nOverall, I won't be going back.", "author": "Ayami n."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-26", "description": "It's not fancy but the staff and food made this gal happy. \nI came across this restaurant one time while doing jury duty. \nN I am so glad this place was great . I'm usually scared to eat from places I don't know but this food was great. \nPrices are cheap ! \nAnd they offer you tea.", "author": "Yajaida M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-02-06", "description": "I was going to donate blood so I figured I'd eat something hearty and delicious. Who doesn't  love some chicken and broccoli with pork fried rice?\nI regret stepping foot in this place. The chicken had no taste, the little sauce they did give me was salty and the pork fried rice was very unpleasing to the eyes. This is by far THE WORST Chinese food I ever ate. The ONLY REASON I ATE IT was because I had no more cash on me and did not want to donate blood on an empty stomach.", "author": "J A M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-04-06", "description": "I use to go to this  a few years ago and recently when I returned it wasn't as good. The food isn't as good anymore.", "author": "Tendai D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-11", "description": "This place is my go to Chinese spot by work. Don't understand the negative reviews since everything I had surpassed my expectations. I usually order the roasted duck or roasted pork over rice. Taste like Chinatown roasted meat and they give extra natural juices along with it. \nIf you are looking for American style Chinese then don't go hear. Look at there chef special menu and be happy", "author": "Nick C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-12-10", "description": "Lee's Villa is your average Chinese eat-in/take-out restaurant, but without an actual 'lunch special' section on the menu. I've only ever ordered food to take back to the office, but the tables and booths seem to always be full during lunchtime, which is always a good sign. The food is on par with similar establishments that everyone has undoubtedly gone to over the years, which isn't a bad thing at all.\n\nIt isn't the cleanest or most grand restaurant in the area, but the staff is super friendly, the prices are standard and the food gives you that proper dose of \"oh man why did I do this for lunch, now I have a food coma, I regret this decision, but so delicious.\"\n\nSince it's a couple of blocks away from the office, and since the staff is so friendly, I'll continue to be a patron.", "author": "Hooney H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-12-16", "description": "Lapin and I was in the area and I decided to order some take out. There wasn't much patron in the store other than 2 or 3 people. I ordered chicken and broccoli with a quart of chicken fried rice and an egg roll. The egg roll was greasy and tasted bland. The chicken and broccoli was a gross and I threw most of it away. The fried rice was tolerable but I wouldn't visit here again.", "author": "Andie B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-09-17", "description": "So far I've only had take out and it's been roast pork over white rice (with some cabbage)  It's an old Chinatown staple from my childhood but it makes for a good test of a new place (for me)  The price is right and the food is good.  I will soon start trying other dishes.  As always, these types of places are not really good for \"Americanized Chinese\" food but for somewhat more authentic dishes (especially ones with minimal sauce) these are decent.", "author": "Stuart B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-16", "description": "Amazing Chinese food hidden away in Downtown Brooklyn. It ain't the prettiest place, but the delicious food and the wonderful staff are always solid.", "author": "Albin P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-08-01", "description": "The food is so nasty. I ordered sesame chicken and it was bland and dry like seriously wtf.", "author": "Kaylin D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-25", "description": "Authentic Cantonese food! Even if it was not perfect, for such prices, I would give 5 stars. For less than $10 per dish, we got a large plate of ducks, along with delicious noodles and vegetables; Plenty of shrimps and celery comes with fried rice, which is fried with pork, UNEXPECTED! Plus, they also served amazing free corn soups, and fried snacks. So luck I found this great place!", "author": "Flair L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-07-01", "description": "We were just in town for a couple days and I was craving \"diner type\" Chinese food- this fit the bill. They have booths and some larger tables. Combos were well priced and my sweet/sour pork tasted good. I like that they still serve complimentary tea.", "author": "Erin H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-27", "description": "I ordered some broccoli in garlic sauce and bonchi in garlic sauce amazing !, not the freshest Chinese food but not terrible at all", "author": "Mely T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-03-11", "description": "finally real chinese food in downtown brooklyn where it's not the fast food places! the food is pretty quick and pretty good. portions are pretty decent (can be as much as the ones in chinatown!!) i actually am considering ordering food from them if i wanna skip going to chinatown b/c it's pretty much the same minus a few items they don't have here.", "author": "Sue W."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-12-07", "description": "I wanted to like it a lot more than I did: the can of Coke and the hot tea were delicious.  The bbq rib tips tasted alright, but were kinda hard and they tore up the inside of my mouth, much much worse than hot pizza! I also ordered sesame chicken and something about it was a little \"off\" so much so that I wondered while I was trying to eat it if  I was going to suffer later with illness.  But no, the next day, no problems thankfully.\n\nI chose Lee's Villa (grade pending) because there were a few people sitting inside and there was nobody in New China Star (grade B).  The choices for Chinese food in downtown Brooklyn are very limited, but I can't imagine going back to Lee's Villa unless it was for a Coke.", "author": "James L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-03-06", "description": "Lee's Villa USED TO BE a place that I hoped didn't end up on the losing side of the slaughter of the coolest spots to eat in the Fulton Mall area. I no longer feel this way. Today, my ribs with pork fried rice and egg roll combo was so terrible that I felt like I was being \"punk'd.\"  Fried rice was cold and mushy and my rib sections were each at least 95% fat with a streak of tough, underdone meat hiding beneath all the goo. When I bit into my egg roll I thought to myself,\n\n\"Dang...this thing's dripping with juice!\"\n\nThen I remembered that egg rolls aren't supposed to be juicy. It was GREASE, loose and splashing from my egg roll (groan.) Lee's Villa is a really drab and sad looking place as well and the bathrooms look like the type you'd find in the visiting area of a lockup. If this place is destined for condo status I won't shed a single tear after it's gone.", "author": "Tanya R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-03-30", "description": "I'm sorry, but I can't say anything nice about this place. Don't eat here. \n\nI've ordered Sesame Chicken, BBQ Spare Ribs, and Beef and Broccoli lunch specials from this place when I've gone there over the past few years. I've worked in the area and there are no good Chinese food places around, so I give this place another shot every year or so. Well, I'm done. Overpriced and either bland or bad food every time. \n\nFried rice that comes with the specials is some of the worst I've ever had. Entrees just taste bad, are all fatty cuts of meat, are way overcooked or all of the above. Egg rolls come out with grease dripping out of them. I've never been able to finish a meal here and I'm never trying again. \n\n2 stars only because the staff is nice enough. The only nice thing I can say about the food is that is isn't quite inedible, but its close. Save your money and go somewhere else.", "author": "Andrew D."}], "servesCuisine": "Chinese", "priceRange": "Under $10", "name": "Lee’s Villa", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "152 Lawrence St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/YS244Cv-r6sqweifSpYUTA/ls.jpg", "@type": "Restaurant", "telephone": "+17188551818"}