{"aggregateRating": {"reviewCount": 29, "@type": "AggregateRating", "ratingValue": 2.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-22", "description": "My colleagues and I decided to try a new Chinese delivery place because we felt the food at the one we used to order from had gone downhill.\n\nI tried the roast pork lo mein and it was really good. The portion was so large, I had enough left for dinner the next night. \n\nI'm looking forward to trying some other items on the menu to decide if they are a hit all the way around.", "author": "Arielle S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-06", "description": "The restaurant is very well priced. The food is decent. The only thing is that the place looks kind of run down. They also serve free tea and they have fortune cookies if you ask for it.", "author": "Obe O."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2009-08-13", "description": "\"Oops, I did it again.\"\n\nWhenever someone says I have a problem with cheating on my normal Chinese take-out spot, I respond back \"it wasn't me\" (lets see how many obnoxious pop song references I can pack into this review...kudos to anyone who can name them all). But, I tried this place out anyway fully aware that whenever I do such things, it tends not to work out in my favor.\n\n*sigh*\n\nI just \"should have said no,\" but you were simply too alluring. With your 80s style microphone machine and the Chinese characters your front counter worker yelled through about two decibels too high, I couldn't help being \"unfaithful\". What a mistake that was.\n\nYour sweet and sour sauce? Too sweet. Your fried rice? Too bland. And your price? That's my \"dirty little secret\".", "author": "Shea D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-07-15", "description": "AVOID THIS GREASY SPOON!  This place takes cheap Chinese food to all-time lows.  I ordered General Tso's chicken with pork fried rice.  It tasted like they made it last week.  Both the chicken and rice had no flavor and tasted stale.  The rice had an odd light brown color that was very unappetizing.  To makes make matters worse, there was a bone in my chicken and I almost chipped a tooth!  This dive is not worth your time or money.  The owners, cooks and workers care NOTHING about the quality of food or their customers.  One can only hope that they will close just like it's neighbor, Asian City.", "author": "Diego S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-06-06", "description": "I've eaten here once with a colleague, and another time on my own. \n\nThe sesame chicken was \"just alright\" the first time I went, but after waiting over 2 years to try again, the second time the noodles were stale, egg drop soup had a weird taste, steamed dumplings were not good. I wouldn't go back.\n\nP.S. Duck sauce was terrible and mustard (i think it was supposed to be mustard) was just beyond my comprehension.", "author": "M R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-12-08", "description": "The quality of the food is not very good and on top of that, it's overpriced! I ordered roast pork noodle soup and that cost me $8.75. In Chinatown, that only cost me no more than $5. Next time, I'm just gonna hop on the F train since I have an unlimited metrocard to east broadway and eat there.", "author": "Ray Z."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-11-18", "description": "Food was decent. Place looks kinda dingy but food was okay.", "author": "Eugene K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-04-17", "description": "Best authentic American Chinese food take out or sit down in downtown Brooklyn.  I liked it when their booth had cushions that were all \"springy\" but they upgraded when a fresca tortilla knockoff opened next door.\nIf you are too lazy to leave Brooklyn and  take a trip into Chinatown, Lee's Villa is the place to go.", "author": "Brian C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2009-05-27", "description": "Not really feeling this place.  Extremely dirty on the inside.  And overpriced.  6 dollar entrees?!?!  How are you going to charge more than China Town and be a considerable step down in Quality.   It seems like they use worse ingredients or are worse cooks.....   At the least this is pretty much the best chinese takeout place in downtown if you don't count the Chinese Buffet to be a takeout place.  Also while it is dirty i've never got sick off their food, which the i cannot say about the buffet.", "author": "Ken Y."}], "servesCuisine": "Chinese", "priceRange": "Under $10", "name": "Lee’s Villa", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "152 Lawrence St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/YS244Cv-r6sqweifSpYUTA/ls.jpg", "@type": "Restaurant", "telephone": "+17188551818"}