{"aggregateRating": {"reviewCount": 74, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-08", "description": "This is my 5th time here the service is great and the food is amazing best hookah I've ever had there lemon drop is good .\nAlso try there Yemeni tea. Best lounge in Brooklyn. Staff is friendly and has 2 huge TVs in the back for personal relaxation. Sofas are comfortable and just a all our great experience also they have a great place to eat across the street called the Yemen cafe same over highly recommend it", "author": "Fahim F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-13", "description": "Services has improved. Music has gotten better. The food has always been great. There's always parking available outside. The owner Amar is very respectful We're here 24/7, almost all the time. Wouldn't trade this place for anything. My first choice when it comes for chilling.", "author": "Md N."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-03-02", "description": "Mocha Hookah is a whole in the wall little place. The hookah smoke was overwhelming as we walked in. We had to wait to be seated and the floors and couches looked pretty dirty. The bathrooms were definitely something to avoid. \n\nI would say the hookah was fairly priced. 10 dollars for one for two people to share. The food could have been a little cheaper based on the quality. The gelato chocolate milk shake was nearly 7 dollars and watery. \n\nHowever, mocha hookah is open 24 hours and my double cheeseburger was pretty decent. I don't have any plans to go back though.", "author": "Chelsea M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-07", "description": "Nice place , hookah ,   Good food \nbig screen TV to watch movies \nAnd it open 24 hours \nI love it ;)))", "author": "Vik D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-02-07", "description": "There are two types of people who go to Mocha Hookah. People from countries where hookah cafes line up the streets who miss that environment and people who have spent way too much on booze and now are kicking back sobering off with some hookah. \n\nTheir hookah is pretty sub-par. It tastes synthetic. The service is incredibly slow. The place simply isn't welcoming either. \n\nThe food, however, is pretty good. That's why I give this place two stars. Order their shawarma and you won't be disappointed. The portions are incredibly generous. Their hummus isn't bad either. \n\nAlso, this place is very strict about alcohol. It isn't allowed. So, if you're looking to have some wine with that mint hookah, you're better off going to St. Mark's place.", "author": "Sherief M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-03-05", "description": "This place has one of the most 'blah' atmospheres compared to most hookah places, but they do make up for it with the reasonably-priced hookah. Plus, the only way to make this place 'enjoyable' is if you go with a group of friends for example, and you're already in the swing of having a good time, maybe coming here after being out to eat/drink, you're able to sit around together and laugh, etc. But no, this place doesn't have any cozy cushions or nice/pretty lights, etc. Just looks like a very plain seating area with the bakery glass display in the back. Also by the way, beware of the inflated prices on the drinks (red bull, soda, etc) - (just like most hookah places), there's a few extra dollars added to the 'normal' prices of those drinks.", "author": "Nikki S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-11-11", "description": "Great Service, Nice Calm Cool and Collective Place. Very reserved, and peaceful place. Couches and tables aren't the best but workable. The best part is the unlimited hookahs", "author": "Sarina G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-10-17", "description": "The place is very sparse with decor, but the friendly service makes up for it. As far as the food...I've def had better middle eastern flair elsewhere. I don't know if it was the food or the lack of ventilation from the hookah, but I ended up throwing up as soon as I walked out and the fresh air hit me. The hookah wasn't flavorful at all...tasted mainly charcoaly...could explain the sickness. I'm from Queens, Steinway area, so I'm spoiled with good Arab food and great long lasting savory hookah. Thank gaw for the yelp deal otherwise i would've been fuming if i had to pay full price for this experience.", "author": "Romana Claretta H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-12-27", "description": "Oh Mocha Hookah.\n\nIts a Saturday night, I look to my friends \"Lets go to Mocha\"\n Its becoming a ritual now. \n\nThis place is great, it is in a trendy area, and the prices are very decent for Downtown Brooklyn. THis place is great if you want to relax with your friends and talk and whine about college finals or things like that.\nThe hookah is very good, many different types of flavors. What people don't always know, don't ever limit yourself to one flavor. You can always mix and match, personally I think everything is good with mint.\nSometimes it does take a longtime for the waiters to come to you to change your coal, but hey you have to understand because this place can get very packed.\n\nSometimes unfortunately, there are sometimes rowdy kids who go here, but don't let them ruin your experience, the service is great the waiters are very friendly,\n\nBottom Line;\nThis is a great place to go with friends and relax and enjoy very nice shisha \n\nAlso, there are pre-fix menus as well for an example for 20 dollars you can get a hookah two sandwiches and fries and two drinks,\nwhich is very great for a cheapdate!", "author": "Jennifer F."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-09-10", "description": "I went there this afternoon. Nobody greeted us. We sat and after a few minutes someone finally came and took our order. The food was mediocre. The feta was good, but that was about it. The pita was hard. The baba ghanoush had no flavor. There didn't seem to be any employees that were really working. I think they were smoking the hookah.\nI always carry metal straws to drink from. When we paid the bill, we left without taking them out of our glasses. I made it all the way to the Staten Island Ferry before realizing i had forgotten them. I called the restaurant to let them know but lost my signal on the boat. I tried to call a few times but got a busy signal or no answer at all. When i got back to where i was staying, I called again. Only to be told, that the dishwasher had thrown them away and the trash was already outside. I call bullshit. I knew it was a long shot, but what can i do. I will just have to buy more.\nDefinitely won't be going back there. Only getting one star because i can't post without selecting any. 2 thumbs down", "author": "Danny R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-12-20", "description": "If zero stars existed on yelp, that would be my choice.\n\nThis place is as crappy as it gets. Looks completely dirty. Holes in the couches. Dirty floors. They obviously don't care about this place. Don't even want to know what the kitchen looks like.\n\nNo one sat us. We sat ourselves. No one asked what we wanted to order. Had to get up and ask ourselves. And to top it off, they forgot to put the order in while they were just standing around.\n\nThen when we got our order a half hour later, the hookah hose didn't work. We walked out. They didn't even notice.\n\nDo yourself a favor and go anywhere else but this place!", "author": "Maya G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-11-13", "description": "We used to go there weekly when it was the Fountain restaurant. It was beautifully decorated with friendly courteous and prompt waiters. The place was clean and bright. We stopped going there since it became more grungy: poorly lit, dirty seats, dark, even sinister. Half the lights were not working and the backwards hats on the fellow behind the counter did not inspire me. The clientele is young, everyone pretending to be real cool fogging the air with non tobacco smoke which totally distracts you from enjoying any kind of food. Service is slow to non-existent. And the décor of booths with cushions is a poorly conceived idea. Many people put their feet on the cushions, which are dirty. The table tops have the veneer coming off and, in sum, nothing worked. It's become a den of non-dining, laptop toting, smoke-inhaling off-putting youth. Save your money and lungs, and try a real dining experience down the block.", "author": "Brian D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-04-29", "description": "Come here all the time. Things I love: the hookah, the comfy atmosphere, the cheesecake and the fries. Things I don't love: the constant door opening (when its cold out and I'm sitting near the door), the time it takes to order anything when it's super busy, the water policy. (you can only get a glass if you order food). \n\nWith that being said, I will continue to come here (while I still live in Brooklyn) because its a nice, no frills spot to relax and get some hookah which is usually all I'm looking for anyway.", "author": "Cindy H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-20", "description": "Pretty good spot for this area. You really get what you pay for, it's not upscale or fancy it's a quick hookah spot where you can spend $20 and feel like you didn't break the bank. Be warned, soda is $3 per can!", "author": "Shari D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-12-01", "description": "I rate Mocha Hookah 3 stars because before this place got popular and mainstream, I've been told that the house rules were a bit more lenient. \n\nFamily and I came here to relax after dinner and the place was kinds packed. All the smaller tables had been taken and so we sat with another smaller group. For $15 we got a hookah with both coconut and mint packed into a half carved out orange peel. That was an interesting touch.\n\nThey mandated that every person order something, they just started serving boba (bubble) tea, and being a boba (bubble) enthusiast, I decided to try their green bubble milk tea. Now I should have realized that a place that didn't have any background in selling milk tea should not have advertised as such. Anyway, my order was just par, nothing special. My sister ordered the hummus and pita bread spread, hummus was pretty tasty. not too grainy, and just the right texture. \n\noverall, a decent quality experience", "author": "Thai-Johnathon V."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-11-27", "description": "The food here is pretty good. I love the chicken shawarma gyro sandwich. And it's 24-hrs, which is awesome, as I spend a lot of late nights in the area. \n\nBut all that hookah smoke, it doesn't sit well with my lungs after a while.... Take-out, anyone?", "author": "Ana B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-22", "description": "4 stars becausd it pretty much the only place around and has decent hookah. Otherwise I'd say 3. Service is not so great but then there are certain staff memebers i really like. It's a usual hang spot for me and friends.", "author": "Princess S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-08-23", "description": "Not bad..but it smells like feet..and for a Saturday night I did expect a little more atmosphere..but the couches are comfy and if you really wanna just chilllllllllllllll it works..Tryna show your friends a crazy night, this is not the place.", "author": "Grace M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-25", "description": "About 2 miles from the Barclay center and right near the court house, Mocha Hookah is a great spot for an extended lunch. The staff is nice and they constantly replenish your coals quickly and without prompting. The ambiance is shoddy and run down but it's cozy, has wifi and great food/coffee. The price is what really makes this place though. A hookah with a gyro and soda is only $20.", "author": "Frank A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-09-07", "description": "Would give a zero star if I could.  Food was not great, not terrible but not good. The guy got the order wrong, no big deal - but when my wife called  to tell them (and hopefully correct it) they basically told her to GFY. I call back to talk to them, and he basically told me I was wrong, I ordered wrong, Its my fault and he does not have time to talk to me. Not happy cant recommend.", "author": "Dan R."}], "servesCuisine": "Middle Eastern", "priceRange": "$11-30", "name": "Mocha Hookah", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "183 Atlantic Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/RAg4rYW3wf7rE5_8fygdqA/ls.jpg", "@type": "Restaurant", "telephone": "+17186246764"}