{"aggregateRating": {"reviewCount": 74, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2019-01-17", "description": "This place is great... FOR WHAT IT IS. \n\nDont go in there expecting a hookah lounge experience. Its more like this place is a Hookah Cafe/Deli. People go there to chill out after the bar or the club... or to even just smoke hookah and use the WIFI. Prices are pretty good. Staff is attentive. \n\nThis is the spot to go during the late night wrap up of partying. Its really not that bad at all.", "author": "Richard S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-12-15", "description": "The couches have holes in them and are ripped. Need I say more? \n\nThis spot needs a serious renovation. It smells of mildew and is dirty. The furniture itself is so torn and old; made me feel like I'd get bedbugs just by sitting down. As one of the few hookah lounges in the Brooklyn heights area, I believe it would have tremendous potential if they updated the space. \n\nBesides that, the hookah was good,cheap, and the waiter was consistent refill on coal. They don't have a bar, and could benefit from allowing BYOB.", "author": "Ruby S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-22", "description": "The ambiance is pretty meager, think almost more like a rundown middle eastern diner more than a hookah lounge. In that sense, almost like a hole in the wall.\n\nBut the hookah is fire (see what i did there?). My buddy is a hookah maestro and claims it's the best in NYC. I found the service to be solid. They knew my friend by name. He had the usual.\n\nIf only they served alcohol, or was BYOB. It really limits a lot of opportunities for it to be a chill destination.\n\nOh, and the food is surprisingly amazing. The lamb with baba ganouj was phenomenal.", "author": "Fred A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-03-20", "description": "Cool spot. My Fiancé and i had our first \"meet up\" \"date\" here. They close late which is great and hookahs are priced well. And they serve regular diner food so you can't go wrong", "author": "Jacqueline C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-04-14", "description": "Terrible customer service, it's not how it was like before. Ambience is horrible, and hookah is horrible", "author": "Sabrina A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-12-26", "description": "When I went it was a weekday, afternoon. A man who seemed careless to even get it right with one headphone in his ear, took our orders. The hookah became harsh quickly. The guy who served us brought us our chicken wrap. Food was pretty good. Hookah not so much.", "author": "Shanjida H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-10", "description": "Mocha Hookah is listed as \"Hookah Bars, Middle Eastern\" which is fairly apt. Those looking for a hookah lounge experience - look elsewhere - as a lounge this is not. Looking to get drunk while you smoke? Find somewhere else. Need A+ customer service and trap beats? Then get ready to pay $25 for a mediocre hookah - somewhere else.\n\nMocha Hookah is a low key place. Other reviewers have mentioned it feels more like a deli almost - and they're right. It has a deli counter at the back of the place and a couple misc. booths between the counter and the door. It is not dimly lit and there are not afghan rugs on all the walls. Its a place where people come to grab some food (which I didn't order, but it looked and smelled great) and hookah casually. You'll see a young kid just toking while facetiming with their friends. A couple sharing a meal and a hookah for a quiet evening. They play music via music stations on the TVs. \n\nIf you're fine with this, and actually want to eat, have some decent tea, and of course hookah, then you'll probably really like Mocha. We had to ask for extra mouth tips after they didn't bring enough for the people at our table, but who cares when you end up getting a great bowl for $15 that ends up lasting 3 people for 3 hours? \n\nMocha Hookah exists not as a novelty, or a place for college kids to get lit on a Friday night, but as a place for the every man who wants to toke and enjoy a nice bowl of shisha. To me, that is great.", "author": "John M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-12-24", "description": "Was a very very bad customer service, the guy was very disrespectful what a shame , I order fresh head hookah was literally no flavor in taste disgusting", "author": "Jubran B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-28", "description": "This place is a diamond in the rough.\n\nDon't walk in expecting some fancy schmancy place.\nThe hookah is reasonable and the staff are very friendly. And whenever you get hungry you can easily order something to eat.", "author": "Keima J."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-03-20", "description": "They did a good job of trying to make it nice, but i think their regulars ruined it. The seat cushions have a bunch of holes burned in it. Wish they could have kept it looking new.", "author": "Jeremy Q."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-06-29", "description": "Good hookah but  they don't have any alcoholic beverages or music for you to listen to.. That can be a lil concerning when one is trying to unwind with that special person or friend.. Your good vibe may be a little hard to catch but byob if you want i guess.. I snuck mines in before lol they don't sell so I bring my own..", "author": "Tito K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-06", "description": "Good argieleh/shisha (hookah) here. This hole-in-the-wall spot in Brooklyn is a great place to kick it with friends. It's not far from local subway stops, making it easily accessible. The prices are very reasonable compared to other shops, so you won't be breaking the bank here. My personal recommendation is to get a pot of the Yemeni tea to go along with your hookah. You can't go wrong with that combo.\n\nI know my hookahs and the difference between good and bad hookah establishments. Mocha Hookah does it right. First and foremost, they use professional grade hookahs, the expensive stuff. This ensures that you'll get the most out of your smoke session. On a recent visit with a friend, ours lasted for a good hour and some change. I especially like that they use actual hardwood lump charcoal instead of the chemical circular discs (which tampers with the flavor) that you'll find in most establishments. The attendant comes by very frequently to replace the old coals and place a set of fresh ones on.\n\nOn busier nights, such as a Friday or Saturday, you might have to anticipate slower service, but it's definitely worth checking out.", "author": "Omar S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-09-20", "description": "Not a fancy clean spot but good hookah and decent food. Oh and it's the best bang for your buck in Brooklyn \n\nUpdate: went here a few times and the quality seems to get worse and worse on every visit. Not going here anymore. The water used in the hookah base was disgusting and makes me wonder when do they actually change the water. See for yours", "author": "Amaar C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-08-10", "description": "We visited with friends to this place. The hookah was done well, but there were dirty tables, a restroom and extremely stuffy. We waited very long time for our order. However, the staff was friendly.", "author": "Olya S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-11-18", "description": "Music sucks, little speakers, looks like a freakin deli or pizzeria. Hookah was okay, service is good. Won't be coming back unless it's the only lounge left in nyc.", "author": "Nancy K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-03", "description": "Terrible experience. It's been over 90 degrees all week and they barely had working air conditioning inside! When asked if they could possibly make it cooler they insisted it was the coldest it could go however both units were barely blowing out any air. The waitress was very incapable of getting any of part of our order correct. She apologized and explained she was new. Okay, that's fine. But in that case they should have had her shadow someone so she wouldn't screw up as much. Terrible management. My friend ordered bubble tea with black tea. When she asked for milk and sugar she was given a cup FULL OF MILK AND SUGAR WITH NO TEA. I don't plan on ever coming back here and don't recommend anyone every coming here.", "author": "Syed A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-29", "description": "Great place I always come here with my friends. I love the environment, service is great and people working there are always friendly, prices are very reasonable and their hookah is one of the best in New York City, highly recommended.", "author": "Mohammed H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-14", "description": "Delicious food and great hookah! The place is small but worth the trip to chill and enjoy good Mediterranean food. Best part is that it is open 24 hours", "author": "Reem A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-12-23", "description": "This place is getting 3 stars because I and my friends really made ourselves regulars, at some point this place changed. I did a walk in-walk out, I thought I'd be able to use the wifi relax and be productive at the same time. \n\nIt's disgusting, with all of the layers I'm wearing I still didn't want to touch anything. \n\nPlease close and remodel. Please.", "author": "Mekela M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-07", "description": "This place has the best hookah in Brooklyn. I really like the food. I just wish they would put the music up a little louder. Also if they can get a liquor license or at least allow me yo bring my beer in, I'll be perfect", "author": "DjLouboutin S."}], "servesCuisine": "Middle Eastern", "priceRange": "$11-30", "name": "Mocha Hookah", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "183 Atlantic Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/RAg4rYW3wf7rE5_8fygdqA/ls.jpg", "@type": "Restaurant", "telephone": "+17186246764"}