{"aggregateRating": {"reviewCount": 74, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-01-20", "description": "This is probably the worst place ever! Don't come here for Hookah because it's horrible no flavor. Also doesn't serve alcohol and bad customer service", "author": "Alaiyah B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-12-24", "description": "I went to this place last night I ordered a fresh hookah head and I got home there was literally nothin in it and I called there reply to me was very rud and disrespectful smh", "author": "Sam E."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-03-30", "description": "This place has good hookah and authentic food. If that's all you care about then this is a good place to go to if you're in the area. It's also open 24 hours. However, it's VERY dirty. The couches have holes in them, the floor is dirty, the menu is sticky, the table is not clean. It kinda ruins the vibe if you care about things like that.", "author": "Nikita P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-05-21", "description": "I came to this place on a NONbusy Saturday to do hookah and get a bite with my sis. I come into a highly lit deli-restaurantish area. I look further back and the area was a little dimmer, more of lounge-like, like what we were looking for. I proceeded to the back and was told we weren't allowed to go there because it was RESERVED. -_____- \nI asked again bc I was a little confused. Then I was told it was reserved for people that goes there EVERYDAY. Idk if I look like an idiot or something but I told him well I come \"everyday\" and he said then next time I'll have a reserved seat back there for you. Idk what kind of nonsense or secret pack they had going on there but I do not think I wanted to find out. Seemed a little fishy. They need to get their STORIES straight and the workers need to be a little more competent. It's about customer service. I left the place after I did my hookah and ate in an utter state of confusion. \n\n2 stars because the guy was nice.", "author": "Rae O."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-06-27", "description": "Worst. Service. Ever.\nI would definitely NOT recommend this place. I just wanted a cup of tea and they said they can only give me tea if I get a hookah. I explained to them I cannot smoke hookah for medical reasons and I'll get one of the desserts on their menu instead and they said they have nothing. Only food and hookah. And they basically expected that we leave even though it was pouring rain. Seriously, don't go there unless you want to get cheap hookah.", "author": "Shirine B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-08", "description": "This place has some good shisha. Can't go wrong with the fresh fruit. Price is cheap and hookah is good. This place offers a lot of food but never tried it, only go there for the shisha.\nPlace isn't overly crowded and the music isn't blasting as other places. This is a chill down smoke spot.", "author": "Karim A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-29", "description": "The best place for friends gathering in Brooklyn. Excellent service, very kind staff and good tea (:", "author": "Mohammed Rajab K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-27", "description": "I smoke hookah every day..... And I have to say this is the only hookah I smoke that hits me hard!!!!! I have smoked at every spot in the Astoria on Steinway and I have a home collection as well... I don't know what they do but it works! The service is always great. They replenish coals without your coals constantly without you having to even ask. Also have to add that they use the wood coal instead of the popular coconut varieties. The food is good and comes out fast! Free wi-fi for customers and did I mention .... Open 24hours!!!! I am there usually twice a week at least", "author": "Kevin R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-11-01", "description": "Coal was not properly cooked and didn't like how they had normal flavors in the starbuzz section on the menu. I just really wanted to smoke hookah so that's why I just stayed and took the L", "author": "Tesiya K."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-01-04", "description": "I have had hookah before and i must say this one ( simple apple) hit me right in the chest...wwwwaaaayyy after the fact. But let me start by saying..oh my goodness the place smelled like sweaty armpit. The decor is simple, but the smell was off putting. Im not exactly sure what was in the hookah but damn. It took over two hours to hit me. The taste was there but the heaviness of the hookah took a while to set in. At least someone comes around to change the charcoal. The drinks are SUPER sweet. Beware of the almond joy...you may need to follow it up with a gallon of water or insulin. Its a decent spot but the reason its getting 2 stars is because of the smell, the lack of decent table service (the person only came to the table once and was never seen again) , and the utter flith of the bathroom. The bathroom is right next to the counter and should not be in the condition that it was in.", "author": "Anin G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-10-24", "description": "The food is amazing and they have a wonderful selection of hookah flavors. AND they're open 24 hours...sounds like a winner right? Wrong!\n\nThe service here leaves much to be desired. you have to basically get up and walk to the counter every time you need someone's attention, because they return to your table a century after they've served you the food, and that's usually just to see if you want to spend more money, not because they care about your experience. All the staff spends their time smoking hookah when they're not being sticklers for the \"water\" limit. Yes you read correctly. One of the most frustrating things about this place is that you can only get water when you order food, and it's limited to one glass per order. So no matter what you order, you get one glass with zero refills...literally the dumbest policy ever! But from a business perspective, it's probably genius!", "author": "Garynn N."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-10-27", "description": "The staff are great. Until today the old man who works there piseed me off when he yelled at the staff in front of all the customers for giving me glass water with the food I have ordered for which I specifically asked because I don't drink bottled water... he snatched the glass waters and gave us two bottles while screaming and shouting at the employee like a crazy man. I'm not sure if there's a law that says if customer want glass water then they must provide it rather than bottled. If anyone knows please let me know because I'd definitely like to prove a point... we come here almost every day spending at least $60 to $70 per day... I think if we want glass water, we should be provided glass water.\n\nThe foods great but owners need to work on dealing with their staffs right. \n\nAs an Union organizer, it hurts me to see staffs being harassed. I will give a better review once I see the man apologize for his misbehavior towards the employees. Otherwise, I will be forced to get the labor union involved. Thank you", "author": "MD N."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-04-29", "description": "Tried to get ripped off. Came with a group of 9 and were forced to get 4 hookahs AND an order for each person. Having come here before and bought 2 hookahs for 7 PEOPLE WE were obviously getting ripped off. They were very disrespectful and did not want to negotiate with us. Not coming here again. Stay away. Would give zero stars if possible.", "author": "Christian M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-09-05", "description": "Good service, friendly environment, \u0026 i only gave it 3 stars because they gave me unlimited charcoals \u0026 kept refilling it unlike a lot of other hookah bars that don't do anything like that \u0026 it was cheaper then the average hookah bar. However, the place was disgusting, it looked like it hasn't been changed for 300 years, the seats we're torn, \u0026 they we're playing horrible middle eastern music the entire time. The smell \u0026 air was super uncomfortable \u0026 when i smoke hookah i feel it's very important to be in a nice, relaxing, looking place with a good music vibe to it as well.", "author": "Joseph A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-03-19", "description": "VERY Scary place, literally looks like a hole in the wall. The seats are FILTHY the place a mess, there is bed bugs everywhere, looks like some type of secret cult where they sacrifice human bodies and sex traffic children.", "author": "Mariely S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-27", "description": "Only my second time visiting. We puffed on the middle eastern smokes, and man they are strong not that it's a bad thing.. I think it's great! Plenty of flavors to choose from, and a menu full of foods to eat in case your stomach calls for it (SN: I have not eaten from here). The Yemeni Tea on the other hand is just perfect. Get the pot and have with milk, it may seem like a lot but you'll finish it. Last thing, put your feet up and make yourself at home like a local!! Ps- they could use some new decor, considering nearby additions to the neighborhood.", "author": "Todd C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-02-28", "description": "The fact that they are open 24/hr is amazing, so kudos to that.\nThe food is typical diner food, the waitress was a sweetheart.\nSadly though I'd had better stronger longer lasting hookah elsewhere, and the effort it takes to flag someone down is annoying. \n\nIf you're drinking fluids and need to go to the restroom, you're better off finding a dark alley somewhere, trust me. Those toilet seats fall off and are covered with unidentified things.", "author": "Lizzi A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-10-16", "description": "This place is awful, the service sucks, the guys hit on you and then they REQUIRE that EVERYONE buy something so you can't share your food if you want to. They don't refill your water only the coal in the hookah and the quality of the hookah is terrible, do not recommend coming here.", "author": "Pooja T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-07-27", "description": "Over the last year I've managed to visit this place a few times.  We always come for the hookah and their food is pretty good.  They have a back room with many sofa areas and plenty of TVs.  We were back there on our first visit and it's very comfortable.  We actually had a nice Apple Hookah, some Mint Tea and watch a movie we selected for our section.  In the evenings, I understand you must have a reservation for this area.\n\nThe front portion is more a classic restaurant with more of a diner feel.  You can get hookahs in the front as well.  They also have a few TVs in the front as we enjoyed watching one of the World Cup games while eating and smoking.  If you don't want to be around people hookah'ing then I would suggest not coming as this seems to be the primary reason come here.  They have an extensive selection for the hookah but we always go with the classic Apple.  They are very good at attending to the hookahs.\n\nI would classify their food as good but not great.  They do have a very large menu so there may be some hidden gems I've simply not discovered.  Their Shawarma's are good and should satisfy most people.  Their Mint Tea is also very good.  Unfortunately the service can be a bit slow and they don't always stay on top of things like keeping drinks filled.  It seems I am always pushing them to bring another pot of tea or reminding them about an order I've placed.", "author": "Jeff S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-04-02", "description": "You have the nerve to be rude to me, roll your eyes and turn your back to me, pretend you don't hear me when I am right in front of your face because I'm not wearing a hijab ??? Shame on you. Whatever the reason, the behavior of these \"men\" is positively disgraceful. If you don't want to serve the public hang a sign on the door for your preference of patrons or get the fuck out.\n\nYou don't want my money? Done. I have refered people to this place in the past. No longer. I have special wishes for the fate of this grade B establishment because they are on some Bullshit.", "author": "JStar H."}], "servesCuisine": "Middle Eastern", "priceRange": "$11-30", "name": "Mocha Hookah", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "183 Atlantic Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/RAg4rYW3wf7rE5_8fygdqA/ls.jpg", "@type": "Restaurant", "telephone": "+17186246764"}