{"aggregateRating": {"reviewCount": 74, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-03", "description": "Very fun to do hookah, it is definitely a chill spot. A lot of people do come in. It is more of a sit back and relax kind of place. I did not try their food but I am sure it was good because everyone else that came ordered food. All I had was their french fries because I started to feel a bit light headed and decided to munch on something. I tried the Watermelon Head and it was AWESOME. Definitely a must try place for hookah and not too far away for fellow Brooklynites.", "author": "Daniella F."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-04-18", "description": "Terrible service, seating area was filthy, and they tipped themselves $5 off my debit card.", "author": "Loftin B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-10", "description": "This place is fantastic!  I was here at least once a week every summer.  I personally now know the guys that run the place every day and they're all great!  Great service and really really good quality hookah!  If your hookah needs some fixing they have no problem customizing it to what you want; just ask!!  I always get the fresh fruit head, once I tried it I could never go back.  Nice smooth smoke!  Blue Mist on grape fruit is great!  I love Rose Mint on the grape fruit head as well.  \n\nLove their gellatos too", "author": "L. W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-24", "description": "I absolutely love Mocha Hookah. It has such a calm and relaxed atmosphere. Not only can you come and smoke hookah but you can get a bite to eat anytime of the day. I've become a regular whenever I'm in New York. The best part of this place is Leila and her great milkshakes.", "author": "Kay-chelle W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-10-21", "description": "I'm sure they have great hookah and their food may taste good, but this place is an absolute eyesore. The floors look dirty, their couches look dirty, I didn't even want to sit down let alone eat. Its unfortunate because  they have a great concept going on with the food, gelato, and hookah they just need to bring the place aesthetically up to par.", "author": "Devin R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-05-09", "description": "I been here a couple of times already. Really great hookah, drinks, and food. Service is good too. My fav is their shawarma, watermelon hookah and almond gelato!", "author": "Enrica C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-09-28", "description": "This place is no frills - some grown men will probably be in the back room while you're there, smoking away in a dimly lit space.  Compared to hookah establishments like Sahara East or Horus Cafe, this bar may seem like a dead zone (no drinks served, no house music blaring, no twenty-something uppity crowd) - but if you are in the mood for hookah, this is a great place to get your fix in Brooklyn.  \n\nThe prices are cheap - about half of what you would pay at the above mentioned places -, the service is good, and the food is decent.  Can't complain, and would go back for a quiet evening.", "author": "Christina Y."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-10", "description": "Relaxed casual atmosphere, lots of staff attention to your hookah. Great place to bring friends or sit alone with a computer.", "author": "Zachary G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-10-23", "description": "i have been coming here with my friends every week since 2011 and absolutely loved it until recently. there is a new guy working here. (skinny, light skinned, with a beard.) he refused to serve me tap water even after i bought food and hookah. first time he refused to give me water and said \"the owner is here, i cant give you free water\" and brings me a bottle of water which he later charges $3 for. i mean it is JUST TAP WATER. why cant you give me tap water if your boss is there? i ordered food and i should be served tap water . i mean theres places that give you free water even if you dont buy anything, and here i am a regular customer who suddenly is refused water. i let it go the first time and went back to mocha the following week. i ordered a very spicy dish and was nearly crying and asked the same guy for water. he ignored me 2 times and then i got up and said \"could you please give me some tap water, the food is very spicy and my mouth is burning\". he just ignored and still didnt give me water. THIS HAS TO BE THE MOST DISGUSTING AND DISRESPECTFUL BEHAVIOR. such a f* up person he is and should not be working here. did not want to pay $3 for a bottled water after being treated like this. never coming back here because of this person and his nasty attitude. nobody else has treated me like this in mocha before. very disappointed.", "author": "Taz A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-22", "description": "I went here for lunch with my co-workers.  I'd like to go back at some other time of day, with friends or on my own.  This place is cool.  The food was good.  I didn't try the hookah, but could smell it in the room, and it smelled delicious.", "author": "Robin G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-11-06", "description": "We went here and had hookah the first time. The hookah was great and they have comfy chairs. My espresso was espresso. A few of my compatriots got drinks with what looked like poop in them. I Iaughed at the shituation because i got off scott free with my coffee sans doody. Second round I went with my babe and got uncomfortably stared at by everyone in there and the staff with no offer of services. We walked out. Third strike and they were out. We went and asked for a hookah and glasses of water (will never forget the downright poopiness of the first experience) the guy said we had to have two hookahs and bottles of water. The bottles we agreed with and then he said we had to get food. This was one on a Sunday and we were the only people in the place. It's a joke now when we walk by to ask \"wanna go?\" Because this place hated my money, and the rage inside can only be quelled with bad jokes. I generally hate everything but if this place collapsed into a sink hole I'd be upset because I couldn't make that joke every time I walk by. I want to apply for a job there to see who gets to poop in the drinks. I'd offer to buy this place with Monopoly money and Pokemon cards just so I could pull the deal at the last second, hopefully sending them directly to fail. Do not pass go, do not collect any more pooptails.", "author": "Ryan D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-06", "description": "great waitress, great hooak. just a nice cozy place to chill out and smoke your hookah! my go - to - spot.", "author": "Melissa S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-10-25", "description": "Don't get bubble tea (boba tea.) The worst, hardest boba I've ever had I guess they don't know how to cook them right.", "author": "Maria A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-03-29", "description": "this is one of the most DISGUSTING places I have ever eaten at. we live in NYC. it is SHAMEFUL for food to be so bad. delivery was not only flavorless and greasy, it was  cold. how can you even call this food middle eastern? it was gross, and I will never order from here again. maybe if your taste buds are dulled from over priced hookah you'll like this food, but otherwise it's a HUGE disappointment. hope they close before the summer is out. would give zero stars if I could.", "author": "Shena P."}], "servesCuisine": "Middle Eastern", "priceRange": "$11-30", "name": "Mocha Hookah", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "183 Atlantic Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/RAg4rYW3wf7rE5_8fygdqA/ls.jpg", "@type": "Restaurant", "telephone": "+17186246764"}