{"aggregateRating": {"reviewCount": 99, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-15", "description": "The Baja Verde with Quinoa is EVERYTHING! never mind the long line, because the customer service, taste, and quality of food is so worth it. Kind of pricey, but at least you know it's healthy and tasty.", "author": "Angie T."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-06-26", "description": "Shockingly bad customer service. I'm a born and bred NYer and of my 50-plus years in this city, have never experienced counter people as rude and unprofessional as the 2 women behind the counter were today. I visited this evening with my 9 year old, daughter, happy to find a healthy smoothie and food spot for our weekly Monday evening dinners, as my daughter just started a class nearby. I was flabbergasted when the woman cashier (green/grey eyes), spoke back to me with extreme nastiness when I inquired about my order (a side of yogurt) after waiting several minutes and seeing her taking and making other orders. When she continued to refuse to give me the yogurt (I had already paid several minutes prior and my daughter had wanted it with her rice which was now growing cold), I reached out to the male worker (young man w glasses) who had been feeding her information on prices. Just then the other female worker (braids), jumped in and shouted \"She's going to ask you about her yogurt!\" in a devaluing way, as if I had been bothering them and she thought it ok to make fun of me. Then the 2 young women started trying to pick a fight with me! The young man jumped in, apologized profusely, told them to not say another word, and of course gave me the scoop of yogurt right away. He was very professional, though clearly embarrassed by their behavior. \n\nNeedless to say, we will not be going back until the 2 unprofessional workers are no longer there.", "author": "Ricki G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-04", "description": "Tried a sample of the kale bowl and one if their smoothies.they were really good and i definitely will be coming back to order full meals of both items. I believe they were the baja verde and the smoothie was something with lemon.", "author": "Deanna D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-06-15", "description": "I had to wait 15 minutes for a PB\u0026C acai bowl. Myself and another girl must have been skipped over as we watched 5 others get their bowls after ours. We had to ask multiple times to find out if the acai bowl was actually being made. Once we finally received the bowl it had more granola than actual acai. They had 5 ladies working at the acai station and it looked like mass confusion! (While I was waiting they also gave a girl with a nut allergy her acai bowl and then had to call her back in the store as they believed there were still nuts in her bowl). Save yourself time and get your acai bowl somewhere else!", "author": "Amanda A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-05-19", "description": "A little overpriced, but my kale bowl was very tasty and fresh with lots of creative ingredients. It also made a substantial meal, so it was worth the #11. I want to try all their different bowl options! \n\nI'm deducting stars for their current logistical issues. Like a lot of Downtown Brooklyn takeout spots, this place is SLAMMED during lunch hours but has no clue how to handle it. There are no stanchions or clear ordering lines, so you end up with a crowd of 20 hangry women blocking the fridge cases while they wait to hear their order come up. If you rely on calling out customer names, please turn down the blaring music. \n\nSecond, the shop offers very little allergen info about their bowls. Mysterious sauces are a huge red flag to anyone who can't eat certain foods. The staff referred me to a sauce ingredient list taped to the wall behind the register. Putting vegan or GF badges on menu items would be way more efficient.", "author": "Sarah L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-03-22", "description": "Came here last week. Huge mistake. The person that took my order and payment also served my food. I was skeptical and almost asked for a refund but didn't make a big deal because he was using utensils and not grabbing my vegetables with his hands. However, as I sat down to eat I saw this person pulling up his pants, touching his entire sweater, his cap and the front and back counter on a swiping motion with the same gloves. Then he went to replenish the kale and grabbed it all with the same gloves. Then this person disappeared to the back for about 10 minutes and returned with the same gloves on to serve food. It was obvious they were the same because they looked dirty.  I didn't even finish the food and felt sick when I got home. Dressings are not kept cool and they contain milk, Greek yogurt... Very risky!", "author": "H. F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-24", "description": "This is a great place. I was able to create my own smoothie. Customer service is on point. Last but not least, 90's music is the topper.", "author": "Kizzy S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-09", "description": "Definitely not coming back here again. Smoothie comes only in one size. The cup is the same height as my iPhone 6s (you can imagine how much liquid that cup contains) and it costs me a whooping total of $9.75. The smoothie was delicious but it's just not worth almost $10 (thus deducting one star).", "author": "Betty C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-05-31", "description": "Loved it when it opened. Today waited fifteen minutes in line only to be told they were out of everything including kale (main ingredient in most dishes.) I get that it's lunch rush but at least offer me options - or don't let ppl wait in line for so long W out saying anything !!!", "author": "Molly R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-05-23", "description": "Staff is friendly, service is relatively quick-ish, but they always have under ripe bananas.  As in deep green and bitter under ripe which kills the flavor of any smoothie.  If they only had ripe bananas, I would love this place but on 3 different visits over the past month it's been the same :(", "author": "Meg F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-13", "description": "This place is amazing!!! Great Juices and Uberhealthy Meals! Fresh and inviting look, great salads, great combination of ready-to-go juices and good for you add-ins like ginger shots. Short walk from the Marriott Brooklyn. Great interior design, be sure to check out the reclaimed wood interior walls.", "author": "Manny R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-26", "description": "This was my first time at THe Juice Shop. I thought it was pricey until I tasted my first Spicy Lady today! The creamiest I've ever had!!", "author": "Demi B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-19", "description": "Tried their purple rain instead of an expresso-aiming to detox from the caffeine ive been intaking. This juice spot is right by my school and a perfect pick up place. Anything good is worth investing in. I definitely will be back to pick up a bowl of granola and fruits, or a kale bowl- a vegetable i rarely get to enjoy.", "author": "Sky M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-08", "description": "The salads here are the absolute best. They use novel combinations of fresh ingredients that will satisfy and help to keep you healthy. They look as good as they taste.", "author": "Chuck B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-12-16", "description": "The smoothies are good. Fresh products, no sugar or powders. The best is probably the purple rain. BUT this place should seriously invest in a Vitamix or something because the smoothies are kinda chunky. But if you're looking for a healthy, refreshing meal nearby I would recommend.", "author": "Rudi M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-05-12", "description": "Got an acai bowl once, and it was....fine. The granola was lame and the berries were overripe. This time, I got a smoothie--asking for it without the sweetener they inexplicably add--and a) it took them 10min to make, and b) it was undrinkably sweet. Like, what? It tasted as though it had half a cup of sugar blended in. I threw $10 into the garbage, literally.", "author": "alejandra b."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-31", "description": "Great place, amazing smoothies. The Kale bowl is awesome. It's about $25 pp but we will definitely be back.", "author": "J R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-25", "description": "This is the perfect place if you want to eat healthy and eat really good tasty food. One person will spend probably around $20. That's a well served meal + delicious juice", "author": "Eliseu J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-12", "description": "I love their kale bowls!!! So healthy and delicious!! It's like getting a combo of a hot bowl and salad together!!! The smoothies are also yummy and refreshing! I've tried a cleanse here and it was really great!! Def recommend trying this place you will be glad you did!!", "author": "Raizy S."}], "servesCuisine": "Salad", "priceRange": "$11-30", "name": "The Juice Shop", "address": {"addressLocality": "Downtown Brooklyn", "addressRegion": "NY", "streetAddress": "345 Adams St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/g7sDr-ec9O0R6CjSaXfwEQ/ls.jpg", "@type": "Restaurant", "telephone": "+17185224109"}