{"aggregateRating": {"reviewCount": 99, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-23", "description": "Solid smoothies, salads and health food options. The people here are also very friendly and added more, or less, of the ingredients I wanted into my smoothie. It's well located for people working in, or visiting, the area who want a quick, cold, healthy meal option, especially on the run. Also, at $8 for a smoothie with 4 added ingredients, I think they are decently priced. \n\nI'd recommend them for smoothies, acai bowls, salads \u0026 juices.", "author": "Maya T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-13", "description": "Great service and yummy fast healthy food. Service was great both times I went. Reasonably price for the portion sizes. \n\nI experience the oatmeal and a green juice one morning. Both get two thumbs up. For lunch I had the salsa kale bowl . It was so good I went back another day to order again. It was fresh and light with lots of zucchini black beans corn and kale. You can add chicken and or tofu. The second go round I ordered the tomato soup which was ok it wasn't my fav though. It had a great spice to it which I loved. They also have pre made options like tuna salad chicken salad a few other salad options with lots of juice options. \n\nThe only think I didn't like was that they have salmon listed on the menu and done actually have it anymore. \nI was so thankful this was right next to my hotel. If I'm the area when I visit I will def go back!", "author": "Keisha H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-01-28", "description": "I immediately fell in love with the juice shop when I first found out about it. I would always go to this location because it's the closest to my house. However, lately, I've been thinking of going to the one closer to my job. At this location, the staff are not friendly, the food that is out looks old and the place is not always clean (no matter what time or how many people are in the shop).\n\nAlso the way the staff present themselves is not welcoming either. Often the music which appears to be chosen by the staff is too loud or inappropriate. \n\nI love the juice shop and will continue to support it but at a different location.", "author": "Denise C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-05", "description": "Juice Shop is a gentrified juice and smoothie bar with healthy options including salads. Their products are overpriced in my opinion, but coming from someone that makes their own smoothies literally on a daily basis 1-2 times my judgment may be a little skewed. Still, forking over more than 9$ for an almond smoothie - as delicious as it was - was a little hard to swallow.\n\nAll that aside, their options are inventive and seems that top quality ingredients are used. The space is clean and there is plenty of seating available. I'd return, but maybe a customer discount-loyalty program is in order unless people have 10$ to shell out on some almonds, plant milk and peanut butter blend.", "author": "Michael W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-04", "description": "YOU HAVE TO TELL PEOPLE IF YOUR CLEANSES ARE LEGIT! ! ! I've been SHITTING ALL FUCKING DAY! I've never shit this much from juice so you're definitely adding laxatives to it, no doubt. This is fucked up! I understand what cleanse means, I do, but people name juices all sorts of shit, doesn't mean it is what it says. Cleanse could imply that it's just cleansing my body by taking in greens! Wow  nice... no you spiked that with laxatives and name I'm at work shitting all day. Please want people. \n\nOn the other hand the juice was great and it looks like they have a lot of nice stuff there. I will be back, but don't be a dirtbag, don't put laxatives in peoples drinks. I've drank juice before, that's not my first time, there was no reason I should be shitting the way I am. \n\n \nEdit:\nStopped in today for another Kale Cleanse! No crazy shitting, which is good, but an awesome drink nonetheless. \nHowever, I accidentally left my Tuna thing on the table and I've been trying to call all day to hopefully get a credit but no one has answered. The phone just rings for a minute or so then disconnects. Very unprofessional to ever have a phone unanswered. I'm hoping they can see this and help me out the next time I go there because that tuna bowl looked really good and I'd hate to look out on $8 or so. \nUpping the star count from 3 to 4 on account of the food and the people behind the counter. Can't give a full 5 stars if no one answers the phone.", "author": "Justin W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-29", "description": "I had the berry acai bowl with hemp seeds along with the Tired \u0026True juice. The food was very fresh and tasty. My coworker had the chicken veggie pad Thai with quinoa and said it was really delicious. The prices are a little steep but the workers are nice and the food is healthy. They had upbeat music playing and since we had to wait for our food for a while the girls offered us some free juice.", "author": "Lucy D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-13", "description": "Came here because I was looking for poke bowls in the area. This was the only spot I could find near me. I expected more in my bowl for what I had paid and the food was just okay. I'm surprised there isn't a more dedicated poke bowl spot near me.", "author": "Will Y."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-05", "description": "I've been here a few times and they generally have good fresh food.  It's a little on the expensive side for what you get.  Why I'm giving it 3 stars is because the service is hit or miss.  I waited about 15 minutes today after ordering for a PB\u0026C Acai bowl.  The store was a little busy but the line was never more than 1-2 people, so I don't understand why it took that long. It looked a little chaotic behind the counter with the staff trying to juggle orders.  The bowl was also just ok - I prefer when acai bowls have flavors like peanut butter added that they add the ingredients in layers, so you can still taste the acai.  In this case it was all blended together so the bowl was like a think peanut butter shake with some granola, berries, and half a banana on top.  I may stick to the salads or bowls in the future if I return.", "author": "Paul G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-09-28", "description": "Disappointing. I wanted to like this shop, with it's healthy offerings and airy space. But I found the juices and smoothies SO expensive for what you get. Today I tried a kale bowl and wow, I finally get why people hate on kale. If you eat it this way, you will not like it. The bowls are expensive and don't include the protein, which you have to add separately. The dressing didn't work with the pad Thai bowl I got and neither did the toppings.\n\nThe only saving grace were the fresh ingredients. But with dozens of places to eat around dt Brooklyn, why set yourself up for a tasteless expensive lunch?\n\nHard pass.", "author": "Aly S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-29", "description": "For the Juice shop location,​ I only have pros to state. Sequenere the supervisor has the real New York vibe and service. The juice, as well as the bowls, ​ are​ delicious. I highly recommend this location.", "author": "Risilda L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-03-18", "description": "Stopped in after my workout for something healthy to eat/drink. I saw that they had oatmeal and placed an order for the Super Berry Bowl. \nThe cashier called me to counter when my order was ready. It looked delish but the oatmeal was warm...Not hot as oatmeal should be. I brought it to the counter and asked if they had a microwave to warm it up a bit. They didn't :-( I ate is anyway because I was starving and understood why they wouldn't have a microwave - it's a juice shop.\n\nThe staff were super pleasant and I'd only return to purchase a juice or smoothie.", "author": "Nikki H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-26", "description": "I occasionally order from here and it always went smoothly until this morning when the delivery boy was beyond rude and impatient. I had placed an order for delivery to my workplace in which I was working at the time but instead of him coming into the establishment and asking if anyone ordered; the delivery boy consistently called my phone and was yelling at me. When I told him to come inside because I was still on shift, he came and tossed my order on the table. He even dared to try to instigate this situation further by placing the blame on me for not answering my phone. I know I put the correct address on the order so it really isn't much of a struggle to just come inside and ask if anyone ordered instead of yelling at me.\n\nThe part that really saddens me is that when I tried contacting this place to complain about the delivery, they so happen to never be around to answer my calls. Looks like this place just takes your money and doesn't really care how people are treated, we are the customers and we can definitely take our business elsewhere if this is your definition of customer service.", "author": "Elva W."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-10-10", "description": "The food was great not gonna lie but the service was horrible. Slow and the workers socialized more than they actually worked and it took them 10 minutes to make my Citrus Salmon and 20 minutes to make a Purple Rain drink....... The place appeared to be overstaffed and not one worker took the time to make my drink. The price is decent and fair for the quality of the food but how they represent themselves as workers I wouldn't trust them. PLUS there was a fly, going around all over the food/prep area and it was neglected and it touched food that was being served to a guest. \n\nSummary: food was great however I don't trust the cleanliness.. service was horrible, slow and did not pay attention", "author": "Darren L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-05", "description": "I'm so happy that juices and smoothies are a trend because I love them and now there are whole chains devoted to just juicing-like this one!  While I do make my own smoothies at home I can't always get all the awesome fresh ingredients these guys (and other shops like them) get their hands on and-being that I live in an apartment-my juicer is currently in \nstorage : (...moral of the story, it's easier, albeit much more expensive, to have them make it for you. And let's face it, us New Yorkers don't have time to make our own stuff- we have to pay other people to do it...hence why you're reading this review.\n\nI used to only come here when I was sick or feeling run down(because, as I just mentioned, it's expensive) to get the ginger bomb (or something like that) because it really zaps me back to normal and I love it! Yesterday, after getting my yoga on, I needed a snack and decided to try the \"Cool it now\"-it was hot and I could immediately hear the song in my head as I ordered so it seemed like the right decision.  Ten bucks later-jeez, that's what it usually costs to get all the ingredients I need for like 3 or 4 smoothies at home- I walked away with a delicious really well balanced drink that really hit the spot and left me with a feeling of well-being : ) very refreshing as the name implied. \n\nService was friendly and quick, juice was delicious and expensive.  I'll be back, just not all the time.", "author": "Allana D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-07-13", "description": "I used to love this place but they have really gone down in quality over the past year. After the menu change I was already disenchanted with the place (considering they got rid of some of their better kale bowls and started selling poke bowls as if there aren't already entire other establishments dedicated to that). But this particular location always seems to be a bit unprofessional staff wise and doesn't seem like a good environment for having a meal. When I stopped in today, they were playing music so loud it was literally painful to stand inside the entire time to wait for the food to be made. Makes me wonder if they actually don't want people sitting down inside. And as for the food, it's been a little more disappointing each time I've returned. Either to try new menu items or revisit old ones. I ordered a kale bowl today and swapped the sauce. The sauce was LOADED with salt  (and traditionally it should be refreshing) and the bowl I had was drenched in the stuff leading me to pick out the less drenched portions and toss the rest. I didn't have time to go home and rinse off the leftovers and salvage the remainder of the bowl. I hate writing a review for like this since I used to love this spot. Two stars because they used to be really good.", "author": "Raa C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-09", "description": "If your into fresh and delicious healthy juices and nutrition his is your place. Offering a variety of different options from the traditional blends of strawberry and banana to hybrid and custom mixes to the specialty drinks they prepare you can't go wrong. There's is absolutely something for everyone in this place for anytime of day or appetite your having. It gives a healthier fresher option for those in a healthier lifestyle. Great service to go along with great nutrition you just can't go wrong check them out!!", "author": "Johnny R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-02-14", "description": "I first had a poke bowl at a place in NJ and loved it so naturally i was excited to see this place near my house offer them. I was disappointed. The brown rice was undercooked so bad that I couldn't eat it for fear it would brake a tooth which really stinks cause I had to throw most of the bowl out and doubt i will be full for the evening. I also thought it seemed super salty.  If they got their act together I would love to try it again because we need a place around here that offers that.", "author": "Lauren A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-13", "description": "Had Blue Monday \u0026 Cha Cha Chai.. \n\nSooo Delicious \u0026 Refreshing. Everything thing is fresh so you can definitely taste each ingredient in the smoothies down to the sea salt. The nutmeg sprinkled on the cha cha also is exquisite. Both are extremely good.", "author": "Leaux X."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-11-03", "description": "Beyond Disappointing. Went in with a friend who treated me to my favorite Mediterranean Kale Bowl with Chicken. When I got back to my apt the salad tasted of tuna. I walked back to the store and was promptly asked by the cashier (who at this time happened to be the manager and not shift supervisor as she stated)  what was wrong. I informed her that I order a chicken kale bowl and this had tuna. Maybe I got someone else order. She never tried the salad in front of me. All she told me was that our \"tuna\" doesn't look like this. I said ok, well somehow tuna was in my salad. Maybe it was from the tongs, the bucket, or just the wrong salad. Can you just make me the correct salad. She then went on with well it's going to be just like that so do you want a refund. I remind her again that my friend paid for lunch and wasn't sure if he paid cash or card. This is when Rasheda (the \"Manager\") dismiss me and said well we can only give a refund to your friend, there nothing I can do for you, leave before I call the cops to have you removed. All of this happened in front of all of her staff, who instead of directing them to work as there was now a line of 6 people waiting. I asked her for her name, emp ID or a number to corp. She never gave it too me, I had to get her name from another employee.\n\nThe service at this store by the manager (Rasheda Andrews) is horrendous! She also yells at her staff in public (witness the day before as she was scolding her male employee over a previous customer complaint) by the door while she was sitting directly across from a customer who was trying to enjoy their lunch.\n\nWhat has happened to this location? I never got my refund or my salad.", "author": "Jimmy P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-01", "description": "As a frequent visitor to the area, this new juice bar is a welcome surprise in a row of BBQ, cantinas and burgers.  Juice is incredibly fresh here and the staff is really friendly.  The Purple Rain was great and was very refreshing.  The only knock is that things are expensive here (about 8 bucks a smoothie) but given how posh downtown Brooklyn is these days, its par for the course.  Thumbs up.", "author": "Howard H."}], "servesCuisine": "Salad", "priceRange": "$11-30", "name": "The Juice Shop", "address": {"addressLocality": "Downtown Brooklyn", "addressRegion": "NY", "streetAddress": "345 Adams St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/g7sDr-ec9O0R6CjSaXfwEQ/ls.jpg", "@type": "Restaurant", "telephone": "+17185224109"}