{"aggregateRating": {"reviewCount": 99, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-10", "description": "Really good salads from the bar...i had the kale salad with chicken...Dont get the premade salads in the refrigerator.  The lemon water is super strong, and palate cleansing.  We sat outside on Adams street, it was awesome!", "author": "Michelle M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-12-11", "description": "Food is decent. Prices are not outrageous. It's nice to have healthy options. Reasons for three star rating: Service is sluggish (sometimes actually slow, so keep walking if you are in a hurry!). Biggest reason: THE MUSIC IS TOO LOUD!!! One time I told them and had to shout it three times before they could her my request. Today it is cranked up again. Can't even have a convo with people because of it. Definitely NOT a relaxing, restorative environment.", "author": "Paula C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-17", "description": "I made my own Kale Bowl yesterday and it tasted pretty good. I used quinoa, black beans, tomatoes, chicken, salsa verde, corn and something else that I can't recall. It was delicious and very fresh. \n\nThe left side of the counter are hot toppings and the right side are cold. The dressing are kept in the refrigerator, not outside like other people said. \n\nI haven't tried any juice or smoothies so I won't go into that, but for your info the salads are \npre-made thumbs down on that, however they looked fresh. They only make the kale bowl at order. \n\nI will return, because all the ingredients were fresh and taste just right.\n\nGood costumer service from a girl that I can't remember her name :(\n\nI will see if I can get to try that tuna salad without Mayo next time ;)", "author": "Jose J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-15", "description": "I like the Lime Light.  It's a combo of beets, pineapple, pear, orange, ginger, lemon and carrot. Has a nice zing.  Price could be a little lower.", "author": "Barbara F."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-04-29", "description": "Terrible. Unorganized, slow, rude service, ingredients that look and taste less than fresh. Waiting 15 minutes for a smoothie after ordering in a no-line situation, I politely checked in on the status of the order. The employee responded, \"I only have 2 arms.\" Never again.", "author": "Brad D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-02", "description": "First time being here , I ordered the PB\u0026CJ , without the strawberries though, it taste great ! Good customer service and didn't have to wait long. Definitely will go back . Thanks !", "author": "Eileen H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-01-30", "description": "I've only had the green curry kale bowl a couple of times here. Although the average lunch price around the neighborhood is about$10, I still find this place quite expensive for the amount and quality of the good that they give you. \n\nInitially I like that is healthy and the green curry is at least edible (I'm very sensitive to taste and absolutely dislike veggies). I haven't gone there for almost half a year and I went back today and just got so disappointed. I ordered the green curry kale bowl with rice as usual. There were a few people waiting for their orders to be made as it was lunch time but I wouldn't say it was overly busy. They called people's names before they started making the bowl, not sure why since it's not like we are customizing the bowl! \n\nAnyway, my bowl was about 2/3 full, although enough for me, not worth the price for sure. It's not just that, they gave me quinoa instead of brown rice which was specified in my receipt that the copy that they were\"checking\" against. I didn't realize until I already started eating it so I ended up eating a little bit of quinoa a had to give up the rest, waste of food and money! There was also something feel like sand in the bowl, ugh.  Also, for the supposedly healthy bowl, they poured, literally poured the sauce in, the quinoa is soaked in the sauce, another reason why I couldn't just swallow them. I also saw that the lady before me told them they didn't give her two of the ingredients that were supposed to be included. The lady was apparently checking her order, not doing the order correctly seems like a norm? The place wasn't even THAT busy, probably 5 people waiting for orders, no one was even rushing the staff. \n\nAlso noticed this in the past: the staff wear gloves but they basically touch everything with the same pair of gloves. Not sure how clean that would be when you actually grab the kale in the tray by hand using the same pair of gloves touching not only just things on the counter.\n\nI doubt I'll go back to this place. I don't even feel healthy after I downed so much sauce but then I'm someone that doesn't like sauces. I'm also glad I'm never a fan of juice, $8 for watermelon juice?", "author": "Yan M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-03-02", "description": "Worst customer service.\nThe lady was making 1 smoothie for 10 minutes taking sweet time", "author": "Lorely B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-04-18", "description": "No line at the cash register two people just stood there not greeting me or offering to take my order. One was on her phone and the other was sitting and stared at me waiting for a solid minute before deciding to get up and take my order. I've been here at lunch rush hour and the service is friendly and efficient but I just found it strange that when the shop is basically empty they don't acknowledge customers waiting and act like it's an imposition to take an order.", "author": "Cary F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-05", "description": "3.5/5 The Dr. Feelgood smoothie Aretha'd up my day in the best way. So good. About 10$ smoothies are what you'd expect for the quality and ingredients.\n\nThe mushroom lentil kale bowl was also around 10$. I got half brown rice half quinoa. These were a little overcooked and dry, and the whole dish itself was nothing spectacular. Good ingredients but the balsamic vinaigrette didn't really tie it all together.", "author": "Savannah H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-23", "description": "I can understand why people don't like to come here, as it's expensive, but it's one of those spots that you know is going to be expensive so, you know, chill out. Ha ha. Seriously though, I can't complain about the food here really it's for the most part very tasty. I had only one of the kale bowls that I didn't care for too much, but other than that it's actually a pretty top-notch. Surprisingly, the Baja Bowl - Mexican-style one - is among my favorites. And I LOVE that quinoa is served here. Still, my favorite part is that they're open until 9pm. This is the only place nearby to get a smoothie or fresh juice that late, which is much appreciated. During the day you have many other options in the neighborhood but not as convenient as this one. Sometimes the staff can be kind of janky, but for the most part they're all very well trained and knowledgeable so thumbs up to them as well. Last thing... they constantly have free samples outside!", "author": "Curtis J."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-05-16", "description": "Really slow service. 4 employees behind the counter and only 1 customer ahead of me, yet it took them nearly 15 minutes to make a smoothie...", "author": "Michelle J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-21", "description": "Got the Monday Blues and really liked it. Took a bit long to get my order though and was pretty pricey.", "author": "Sophia N."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-05-11", "description": "Not happy they got rid of the kale bowls! The new food is not as good. Why didn't they read my review before they stopped making the kale bowls?! (Just kidding about my review, but not kidding about the kale bowls. BOOOH!)", "author": "Guenevere K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-01-13", "description": "Do not go here if you have a food allergy! This morning I ordered an acai bowl and confirmed twice that I did not want granola. I then waited for 20 minutes and watched as two people tried two make two orders at once (someone else had ordered the same bowl as me) and had to keep adding ingredients to try to get two servings. Finally they had two bowls, but had to start mine over because they put granola on it. For the thirty minute wait I got a free juice. However, when I got to my office I discovered there was still granola in the bowl - I'm guessing because they reused the bowl - and a mysterious lump of frozen chocolate that was not on the ingredient list. I couldn't eat it. Definitely not worth it!", "author": "Megan K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-06", "description": "This is my very favorite lunch place! I can't say enough good about it! I'm a vegetarian and there are endless veggie options that are always high quality and fresh! My favorite is the spice market bowl and the think tank juice. The customer service here is better than most sit down restaurants - everyone is so nice and helpful! I'd recommend it to anyone looking for a quick healthy meal in downtown Brooklyn.", "author": "Jocelyn C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-09", "description": "I am surprised this place isn't rated 5 stars all around. I am obsessed with green juices that don't have fruit in them because I just don't like the sweet taste that apples and bananas give the veggies. This place has stellar green juices made with kale, lemon, ginger and other yummy and healthy ingredients. I saw people enjoying lovely acai bowls that were made with a lot of care and attention to detail. Overall, I think we should all prioritize healthy eating/drinking for at least two meals a day or five days a week (whatever is easier). Whenever I'm in court in downtown Brooklyn I take the opportunity to use the Juice Shop to meet that pipedream!", "author": "Lama B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-01-19", "description": "I usually really like this place. But today I ordered a quinoa kale bowl and it has very small, hard black plastic pieces in it. No idea how that got in salad. I'm afraid to finish eating it now and I took it to go.", "author": "L P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-31", "description": "Not organic but ok ingredients - the green smoothie I get is the Higher Love with pineapple instead of apple. Doesn't taste as gross.", "author": "Annie Y."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-08-19", "description": "Standing here watching 3 people behind the desk, and only one of them making smoothies. Slow, not efficient, not friendly.", "author": "Jessica L."}], "servesCuisine": "Salad", "priceRange": "$11-30", "name": "The Juice Shop", "address": {"addressLocality": "Downtown Brooklyn", "addressRegion": "NY", "streetAddress": "345 Adams St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/g7sDr-ec9O0R6CjSaXfwEQ/ls.jpg", "@type": "Restaurant", "telephone": "+17185224109"}