{"aggregateRating": {"reviewCount": 99, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-03", "description": "Had to come on and show some love. This morning went there for a breakfast protein bowl. The register wasn't working for credit cards, so the employees had to take cash only. They were very apologetic and patient, while this situation was occurring and managed the situation at a high level.  Those of us who had cash paid for it, and those with credit cards were taken care of when I was leaving as the register was back up.\n\nThey kept saying that \"it shouldn't have happened.\" I had to remind them that technology sometimes doesn't cooperate and they handled this situation as efficiently as possible.\n\nI know YELP is often used to complain, but just wanted to show some love on a random Wednesday!", "author": "Jay R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-08", "description": "I wish I lived near this place. I'd be in here all the time. \n\nI just wandered in here while waiting for someone at the courthouse nearby. Smelled sooo good. The staff always incredibly friendly. The playlist over the speakers was hitting all the right spots. \n\nI ordered the First Date Oat bowl and a cashew milk and cold brew mix. Both were SUPER good. I also get well fed when I left...like full of energy. \n\nGreat place. Would definitely come back when I'm in the area.", "author": "Juli R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-02-24", "description": "I stopped by The Juice Shop because it was literally steps away from my hotel. They are a small little shop with a lot to offer. There are fridges to the left with tons of fresh juice options and shots. At the counter is a create a bowl section. Although, it looked delicious I only got a juice to go. I tried the  Big Bang - $9.00 which included Kale, Spinach, Parsley, Romaine, Celery, Cucumber, Apple, Lemon, Carrot, Beet, Cayenne, and Ginger.", "author": "Chelsea F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-28", "description": "Super yummy and fresh items on the menu. My girlfriend and I split the Smashed Avocado Toast and the Harvest Kale Salad. Both were filling and tasted great. I also got the Funkytown smoothie which was my favorite part. It might be a little pricey, but that's expected for any nice juice bar, especially in NYC/BK", "author": "Colin B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-05", "description": "Friendly staff. Clean location. I ordered the mr. Almond smoothie and it was really good. 10% off for checking in.. good deal", "author": "Ana L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-03-11", "description": "Gahh. This place. I've only had the smoothies and they are quite good and healthy but the prices. Geezus. They are so expensive. Almost $9 for a smoothie is pretty crazy even though it is delicious. This is definitely a once in a while splurge. We've also had the cold-pressed juice, which is in a bottle but costs $8. I think that's a bit much for a bottled juice. $4-5 feels more reasonable and that's still too much. I know healthy food isn't cheap but it shouldn't be so outrageous. In terms of service,  I've ordered in person and through Yelp and both times have been fine. The service was fine, a bit slower through the online ordering.  Overall it's a splurge that I'll make once in a while.", "author": "Suriyati B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-19", "description": "Newly discovered this holy grail! Suhey was fabulous to answer any questions I had, and let me sample to make sure I liked what I was purchasing! Not only was there service above expectation but the juice and products are delicious and healthy. 100% recommend!", "author": "Alexis E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-11-10", "description": "While staying in downtown Brooklyn, I was on the hunt for a juice bar. I came cross The Juice Shop on Yelp. I hesitated because they only had 3 stars. I ordered the PB \u0026 CJ smoothie. Oddly, none of the staff knew what the \"CJ\" stood for - but they were friendly and professional. I'm still curious so if anyone knows, please message me! It's a bit pricey but I took advantage of the 10% off Yelp check-in which definitely helped. My smoothie was prepared quickly and tasted good.", "author": "Marie AK C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-13", "description": "OBSESSED. My nutritionist at Physiologic (practically next door) recommended this place as a healthy lunch spot. Tried the Poke bowl and loved it. It's pricey because of the fish. Then tried the green curry over kale and vegetables because it was almost half the price. Now I'm obsessed. It's so flavorful, full of vegetables and brown rice. I had chicken and it's still less expensive than the poke. It's a lot of food! Love the worker bees too. Go here. Get healthy. Be happy.", "author": "Modemme X."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-01-19", "description": "Not a fan. They should call this the spicy mayo bowl. The service at this place was ok. My two friends were happy with their choices (aćai bowl and avacado toast).\n\nI LOVE poke bowls I will order one almost anywhere that has one. The tuna was in massive chunks and buried underneath a bunch of wet and soggy seaweed. The entire dish was drenched in spicy mayo to the point that I couldn't taste anything else.   The last crime committed against this dish was the brown rice being hard. \n\nPossibly my fault for ordering a poke bowl at a place called The Juice Shop, but I feel like if you offer something on a menu it should atleast be on par. Won't be coming here again.", "author": "Preston R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-05", "description": "Delicious Poke bowl with spicy Salmon \u0026 Kale\n\nBought a side of smoked \u0026 baked Chick peas, \n\nquite pedestrian. Good service, clean looking\n\n establishment.  I'll be back!", "author": "James D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-02-11", "description": "Very disappointed lately at the service! Ingredients are missing from order or added even though you ask to leave it out, OR they call at the last minute to say they haven't got something when food should be on the way!! Some delivery men come to the door while others make you go all the way outside to retrieve food, after giving a hefty tip for delivery to your door. They must do better!!", "author": "Alesha V."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-20", "description": "Came in here last week to grab a smoothie, took a good ten mins to prepare. While I was waiting I noticed the gluten free muffins, went back online and the cashier did not tell me the price nor did he ask for a signature or if I wanted a copy of my receipt. Didn't think anything if it. Checked my credit card statement and this man charged me $13 for a muffin ! How ridiculous is that!?", "author": "Shaima C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-13", "description": "I came here after having a meeting around the area, wanted something a bit healthier than my usual habit of getting shack shake. The interior of the place is cute and modern, love the concept of the place, healthy is happy, is what i get from it. The worker that served me was nice, but I felt as if the service was slow and not present due to how customers didn't know when to buy because the workers would not be attentive to the register. I got the berry acai bowl, it was very fresh and delicious. Overall, I would visit again.", "author": "Emily L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-05-31", "description": "My fiance \u0026 I were craving something cold \u0026 fruity after our walk on the Brooklyn Bridge so I hopped on Yelp and searched \"acai bowl\" \u0026 The Juice Shop pops up. We ordered the berry acai bowl. It came with granola, strawberries, bananas \u0026 goji berries - typical toppings. The bowl itself was good and met my expectations. The price is a little steep for an acai bowl (~$10) but that's coming from someone who used to live in Orange County \u0026 the bowls were in the $6-8 range and an acai bowl shop can be found in every corner. \n\nOverall, the bowl was fine \u0026 did the job. A-OK in my book!", "author": "Andrea F."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-01-26", "description": "Thoroughly disgusted with the service at this location. \n\nI approached the counter to order the employees attitude was a bit discouraging to begin with but she's human, it's Saturday so I gave her the benefit of the doubt, ordered my  smoothie and mushroom avocado toast as well as purchased three juices. My husband and I sat aside while we waited for our order. We could see that there were a few people before us so we definitely knew patience would be key in this situation.\n\nSitting and waiting for about 15 mins, I notice similar orders being made that looked like what we ordered. But each one was handed off to someone else. We noticed the faces around us changing and then realized that people who had come in after us were being served. Again I see an order just like mine being made so I walk over it's handed to someone else. As I'm going to say something to the  cashier/food preparer she begins to ask me what did I order again. \"You can't be serious!\" \n\nNot only did you see me sitting there, you actually don't even have record of my order. An entire 40 minutes had passed. All with my husband and I being patient and this woman has the nerve to ask what I ordered again. Everyone else that walked in and waited had their order ticket taken care of.  \n\nI tell her my order she begins to attempt to make it but still with this nasty attitude. I ask for a refund, her response \"OK Cool.\" DEFINITELY NOT COOL MORON. She was unapologetic and very dismissive. I stood at the register waiting for my order. If it weren't  enough blatant disrespect already displayed, she then attempts to take someone else's order over me, before she issues my refund. I politely tell her \"that's rude, don't take an order over me before you're finished dealing with the situation at hand.\" \n\nShe had to then call her manager via her cell phone to ask how to issue a refund. The customer asked me how long I was waiting and for what, I told him and he left. Rightfully so. This place use to be a favorite and super convenient but has gone to the dogs. NOTE TO CORPORATE: DO NOT LEAVE UNRELIABLE UNPROFESSIONAL AND INCAPABLE STAFF TO HANDLE A SMALL SHOP LIKE THIS ON ANY DAY ESPECIALLY NOT A SATURDAY!\n\nI hate that I've had to result to a bad review as my first review ever. But this was a moment of outright disrespect and lack of accountability. Won't be going to any other Juice Shop again.\n\nEven if my ticket were lost, it was not addressed. The point is I was was looked over until I approached the cashier. And still faced with a nasty unapologetic attitude. That's my point. As I said I was patient already so what was so hard about having some courtesy and honesty in a place of business?!?!", "author": "Jessica B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-11", "description": "Juice shop is a great choice when craving a healthy kale bowl.  Tried a few of their options, my favorite is the Green curry which consists of coconut curry and butternut squash among other delicious items, yummy!   Have also tried a few of their soups (not my favorite), and chia pudding (favorite item in the store).  It sort of reminds me of chocolate pudding growing up as a child (way back in the 70s) lol. \n\nThe space is small, yet roomy enough to eat at one of their high table and stools.  The staff is friendly and helpful, will accommodate if you need to substitute an item in the pre-fixed menu.\n\nOverall great little spot to grab a fast healthy lunch.  One of my go to spots when in a hurry.", "author": "Esmeralda C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-18", "description": "Literally just finished eating every last morsel of the Harvest Kale Salad. It was delicious!!! The portion was generous, the ingredients tasted super fresh, and it had just the right amount of each toppings. Glad I decided to stop in here for lunch, and even more glad that this is so close to my office! The price was also very reasonable--this gigantic salad cost me less than $10. The perfect quick, light, and healthy lunch. Mm Mm.\nAlso, the service was quick and great. The woman that took my order entertained my questions ('which one do you like better?') and was actually super nice and helpful. \nTheir breakfast menu also looks fabulous (and reasonably priced) so I'll be stopping back in for that soon! (I have my eye on the peaches n cream oatmeal). \nI'm satisfied for sure!", "author": "Hayley T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-14", "description": "Great spot for healthy eats in the morning or afternoon. I stayed at the Marriott and went here twice for breakfast because of the convenience. Plus I got 10% off for showing my room key! \nCustomer service was awesome the first day, but today they could have been better. Still friendly when the finally acknowledged me though and food was great. Only complaint food wise was the banana in my Açaí bowl was VERY ripe- I feel like if you're using that much produce a day, put the overly ripe ones in the smoothies and the better looking ones in the bowls. \nOtherwise- I really enjoyed this place!", "author": "Tiffany H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-18", "description": "Love it. Fresh and healthy:) Good idea for Friday lunch! Beautiful mindset comes from colorful food,right?! Lollllllllllllllllllllllllll", "author": "Chrystal Z."}], "servesCuisine": "Salad", "priceRange": "$11-30", "name": "The Juice Shop", "address": {"addressLocality": "Downtown Brooklyn", "addressRegion": "NY", "streetAddress": "345 Adams St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/g7sDr-ec9O0R6CjSaXfwEQ/ls.jpg", "@type": "Restaurant", "telephone": "+17185224109"}