{"aggregateRating": {"reviewCount": 99, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-08", "description": "Very disappointed, the guy scrapped the bottom of the rice container so I got hard bits. Poured on the dressing so much it was hard to eat. He didn't even ask. No portion control. There was way too much and not like the poké bowls I'm used to. I feel nauseous.", "author": "L S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-09", "description": "I stop by here after my run some mornings since it is on my way back to my place, and truthfully this place is hit or miss for me.  The Acai bowl is perfect just what the doctor ordered after a workout, other times the granola at least to me tastes stale.  I have also had the Super Berry Bowl where the oatmeal I kid you not is bordering on cold instead of hot, and then I can get it perfect. It really is that hit or miss.\nThe salads and the shakes are mostly always a good choice they are solid.  Staff goes a little bit too slow, they can pick up the pace a little bit, but they really are very polite smiling and courteous.\nOne more small downside the price - this place is steep man like for the prices they are charging everything should be a home run each and every time not only sometimes. I'm hoping they can get better with quicker service and fresh hot if it is supposed to be hot food choices.  I do really like the proximity of this place, and hope I can continue going there.  I just don't think I can if they don't step it up somewhat.", "author": "Dennis T."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-08", "description": "Just walked out of this place. It is 8:35, and they supposedly close at 9:00.  When I walked in, they told me that they were done making smoothies and juices for the day, and they only had a bottled juices in the fridge.  If you are going to stop serving at 8:30, then you should change your hours to close at 8:30.", "author": "Nolan S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-03-16", "description": "I went here for the first time as I didn't have time to make lunch. I normally eat local, organic, plant-based, vegetarian/vegan meals and The Juice Shop seemed like a decent option.  The food looks good, the staff is friendly. I ordered a Harvest Kale salad.  With tax, it was $10.29. I didn't realize that meant it was a side order. Maybe I am naive, but I shouldn't still be hungry.  Maybe they should charge a dollar or two extra and double the order. No one in Downtown Brooklyn serves such small salads for the price.  It was tasty, but I won't be back.", "author": "Bo H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-04", "description": "So I decided to come here to grab a bite to eat before having to go back to jury duty. I didnt really want any of the other choices that there is around here (shake shack, blue hill country, burger king, panera bread) I wanted something light, healthy, fulfilling and delicious. \nThey have prepacked juices and salads or you can have them make it for you. I think thats cool for the ones that are in a rush. \nThe service was quick and friendly, the girls who work there are very nice. They have a starbucks kind of system where they call your name out once your stuff is ready.\nOn to what I got: I got the green kale pre-packed salad which was very good and fresh! It was composed of chopped kale, chick peas, black olives, diced cucumbers, tomatoes, and diced beets. There was also a side of feta cheese and dressing that I dont remember the name of but it was a type of vinagrette. I wish i had take a pic of the ingredients . For my drink, I got the dr.feel good and it was soo deliciousssss. The only comment I have on it was that it just needed to be blended just a bit longer since I still had peices of fruit in it. If you like your juice a bit more on the tangy side, try Dr. feel good. \nFor the salad and the juice, it was just under $20, I know it caught me a bit off gaurd too..they are deff on the more expensive side but for every now and then or if you happen to find yourself around there, give them a try. I was fulll and content but still felt light at the same time.", "author": "Stephanie C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-09-12", "description": "This is the most convenient vegan-friendly option if you're attending a convention at the hotel next door. The portions on the oatmeal and granola bowls are huge and the dishes are reasonably priced. The space is small but it's nice to sit at a table by the window and watch busy Brooklynites walk by as you eat.", "author": "Erin L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-10-26", "description": "Had jury duty and wanted lunch, either Shake Shack or this place. The Juice Shop seemed to be the healthier option. The Mediterranean kale bowl with avocado was good, though I should have asked for less dressing. The Cool it Now smoothie was very tasty. Price was really expensive, I think my total was around $20+.", "author": "Lillian C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-20", "description": "I've missed this place since changing employers! Came back for a training in the area. The food seems better, or maybe I just really missed it. They're also including a 14.5 oz filtered juice/water with the kale bowls which helps justify the price. Really good.", "author": "Liz L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-29", "description": "I was so excited that this place was right next to our hotel.  I love the Juice Shop in SF and this one had so many more options and granola and acai bowls.  They also have salads but I didn't get a chance to try those.  We stocked up on many juices and I had the berry acai bowl for breakfast.  I loved the straight ginger shots.  They definitely helped me get through the conference.  I only wish we had this place in SF!", "author": "Amanda K."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-05-05", "description": "Going to this location makes me wish there was a liquiteria in Downtown Brooklyn. The smoothies are okay, can't blame the location for recipes. However, when its busy you can tell that there is no workflow to determine when to work smoothies, salads, and other items. This location had great potential but the staff seem disinterested and the food served doesn't seem fresh. Another disappointment for Downtown Brooklyn.", "author": "Christi C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-09-12", "description": "Juice and bowls are great! Very fresh and colorful and they have just about anything you could be looking for. Service is efficient but lackluster in attitude. It's almost like we feel like we should expect crappy service from a place like this but I don't think we should. It gives the competition a differentiator to win in the market! Maybe the juice shop will get juiced? I'd drink to that!", "author": "Michael B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-08", "description": "I've been to a couple of juice and smoothie places and so far I feel like this is the best one I've been to!  When I went there the first time, Celyna was very helpful in making recommendations and making me feel welcome. All the workers are very friendly. \n\nI come here for the acai bowls and they never disappoint. I recommend the PB\u0026C!  The portions are quite large also.", "author": "Tyrone R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-25", "description": "I ordered a cleanse from the Brooklyn store this morning and still haven't received it. I've called the store many times and no one has answered. I've called two other stores, one of which offered to help but then stopped answering my calls. I can't request a refund through your app because it won't allow me to. Walked to the store and the employees were so dismissive and unhelpful. Horrible experience.", "author": "Jn C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-02", "description": "My boyfriend and I came here after going to the movies to kill some hunger. Instead of eating though, I decided to get a smoothie since I wasn't that hungry. Although the salads that I saw them make looked really appetizing. The smoothie I had was Mr.Almond. I thought that it would make my less thirstily, but instead of doing that, it filled me up a lot. I recommend this place. It was delicious and I plan on going back again to try there salads.", "author": "Yasmine H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-05-01", "description": "Hmm, nothing to really ride home about(is that the right phrase?).  It's a juice shop with various options of juices.   I decided to get custom made smoothie and that was the biggest mistake I made.  I think my juice was supposed to be a smoothie that was chocolate based but it was just a bland mix of coconut milk, cacao powder and I think coffee.   I wish the person making the drink would have provided recommendations.  On another note, I saw that they also make kale bowls and the toppings offered looked fresh and smelled wonderful.  If I'm ever in Downtown Bk, I may give them a second try by simply selecting a juice off the menu and/or a kale bowl that's off the menu as well.", "author": "Laur D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-31", "description": "Terrible. First of all, when you walk in, the music is way too loud and inappropriate. You can barely communicate with the staff to get your order right! Next, the açaí bowls are horrendous. Açaí base has no açaí flavor. It tasted like mashed fruits and water. Finally, in my opinion, the juice was absolutely terrible and overpriced. I paid more than $50 at this place, and I regret it! Go to playa bowls in Newark, DE. Never go here. Too overpriced, not worth it!", "author": "Julia I."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-06-07", "description": "Great options for smoothies.  Just be careful with the orange juice, it is not freshly squeezed. \nIt turned my stomach into an fire ball.\n\nFresh squeezed orange juice is expected when one is paying close to $10.00 for a 16 oz. smoothie.\n\nAnother down side:  One size only available for smoothies:  16 oz.  Very pricey\n\nThe manager was very kind and professional and had it switched for another one of my choice.", "author": "BubbleGum B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-11", "description": "was excited to come here, but am a bit dissapointed, the service was ok, people behind the counter were attentive, but not very motivated. tried getting one of the breakfast bowls, but there was no oatmeal made that day. I ordered one of the avocado toasts from the menu, it wasn't even toasted, the avocado smear was pathetic, it was actually a light buttering of avocado, which was total flavorless. Dissapointed. The Juice was good. The place looked like it might be going out of business", "author": "Boy B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-18", "description": "I grabbed the Kale Cleanser after a long walk across the Brooklyn Bridge and it was super refreshing! Fast service and clean shop. Highly recommended if you wanna grab some juice on the go.", "author": "Kosta S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-19", "description": "I went here for lunch today and had the pb \u0026b acai bowl. It was really delicious and really filling. The price is pretty high for eating here daily but it was a nice break from what I usually eat. I would definitely go back and try some of the other meals and the juice. Definitely worth trying if you are in the area.", "author": "Brenna B."}], "servesCuisine": "Salad", "priceRange": "$11-30", "name": "The Juice Shop", "address": {"addressLocality": "Downtown Brooklyn", "addressRegion": "NY", "streetAddress": "345 Adams St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/g7sDr-ec9O0R6CjSaXfwEQ/ls.jpg", "@type": "Restaurant", "telephone": "+17185224109"}