{"aggregateRating": {"reviewCount": 5, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-21", "description": "Pool table, small appetizer  menu, DRAFT BEER SUPREME COCKTAILS!!!!!! Happy hour 5 dollar drinks!!!  Lounge area easy to bring fellow colleagues ...relaxing setting who can beat that! Favorite nights Tuesday and Saturday great for after work or just taking a break.\n\n great service!", "author": "Jennifer J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-05", "description": "This is a low-key hotel lobby bar. Very small. But: the lighting (especially on the bar itself) is very nice. Good vibe. It is inside the lobby of Aloft Brooklyn. The bartender is friendly and accommodating (customized low alcohol cocktail for me for example). There are about 4-5 seats at the bar only. I guess it's not designed to encourage people to linger.\n\nThey don't have any menu, strangely.", "author": "Alice J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-07", "description": "Super awesome bar. I've been here a few times and I feel like I know the new bartender Adrian personally. Super great vibes and drinks Kimoto is nice but its always super popping and packed and not personal. go see Adrian he's the bomb!  And he makes super strong and delish drinks.", "author": "Oneka B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-20", "description": "So its only a handful of barstools in a hotel lobby as noted...I still enjoyed my time here.  They have sports on the TV's, play good reggae music as the night went on, and had a great bartender one Saturday night, she was hilarious and made a great drink! Apparently there's DJs occasionally.  If you're going up to your room, ask for a plastic cup to go.\n\nNote they sometimes close early (11ish) in winter and when its slow.", "author": "Lisa A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-29", "description": "This bar is basically 5 stools in the lobby of the hotel. There is no real separation between the bar and the rest of the lobby.\n\nThat said, our cocktails were well made (dirty martini, old fashioned) and there was a decent selection of top shelf liquor given the very small size. If the idea of a having a personal bartender appeals to you, this is the closest you are likely to get.", "author": "Craig O."}], "servesCuisine": "Tapas/Small Plates", "priceRange": "$11-30", "name": "W XYZ Bar", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "216 Duffield St\nAloft New York Brooklyn", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/vtzAo7HKVnchjWF8S5E4KQ/ls.jpg", "@type": "Restaurant", "telephone": "+17182563833"}