{"aggregateRating": {"reviewCount": 121, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-25", "description": "I came here last Saturday for lunch and absolutely love their garden. I tried one of their special rolls, I think it was called the \"tropical roll\" with strawberries and tuna. It was good and I especially appreciated the great service, once I said that I couldnt have soy sauce because I was on a gluten free diet. The waitress made sure I got the gluten free tamari sauce! This is how you keep your customers ;)\n \nPS: If you want to improve your health by switching diets, check out sabinamattern.wordpress.com", "author": "Sabina M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-17", "description": "I've been to Osaka many times.  I think the sushi is pretty fantastic.  The fish is always very fresh and the rolls have only a little rice with tons of fish.  I love the hot and sour miso soup too.\n\nUnfortunately, the ambiance of the restaurant makes the dining experience go downhill.  It is bright, usually pretty empty and there is always weird, techno-opera music playing.  I also find most of the staff quite rude and unaccommodating.\n\nAs a local, I order delivery regularly from Osaka and sometimes stop by for lunch.  Would not recommend it for dinner because of the ambience issues.", "author": "Jennifer N."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2009-05-28", "description": "Basic neighborhood sushi. Nothing great, nothing particular horrible. Average fish and selection. That said, there is so much better in the hood. Ki Sushi... Cube 63 even.\nTo echo some other reviews, their service is spotty: from mediocre to clueless (I have a story). Also, I am glad to see that other users have noticed how the 'owners' seem to like to yell and berate the waitstaff. Hilarious times.", "author": "Rich B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-24", "description": "Probably my favorite sushi spot in NYC. Granted I haven't been to even half of them, but Osaka is top notch quality with a perfect ambiance. I strongly recommend giving it a try. If it's your first time, make sure to add a classic to your order (such as the spicy tuna roll) just to compare the quality to other shops.", "author": "D S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-05-13", "description": "My friends and co-workers and I have been getting Osaka pretty regularly on a Saturday lately, and it's been great, but yesterday I had a terrible experience. I ordered it for lunch on a monday afternoon at around 1pm, and by 7:30 I was vomiting etc, and had nothing else to eat that day. I kept on purging from both ends until 2am. My sister told me it was txt book food poisoning, and to never eat sushi on a monday because they get their fish delivery on a tuesday. I wish I'd known that because now I'm off one of my old fav's for life. Will never be able to eat sushi again. No wonder she recommended the black pepper salmon roll.", "author": "B B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-01-15", "description": "Awful food!  Made my husband sick!  I couldn't eat the salad because it was clearly rotten.  Everything was crap. Never going back!", "author": "Tia M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-01-09", "description": "I've always been here since I was young, and our family ordered from here for birthday's and holidays. When we ordered large quantities, the sushi they gave us had large portions and it was great.\nBut today I came with my friends to eat sushi, and the sushi that came to our table was almost 2/3 the size of the sushi I ate just a month ago! Whats going on?! We felt like they cheated us just because we were younger and looked inexperienced when it came to food. \nTheir rolls were the only good thing about the visit, but I don't think I'll go there again. Grr!", "author": "Luca M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-02-25", "description": "Osaka used to be a decent, if inauthentic, Japanese-style restaurant. I've been coming here for almost 10 years, and it used to be quite serviceable, especially since there's only one real Japanese restaurant in the neighborhood (the excellent Hibino). But Osaka has fallen on hard times, and can;t put out a decent meal anymore. While the soup and salad were OK, the sushi on my last two visits was completely without flavor, and ice-cold. The preparation, very sloppy. \nThey used to know how to make chirashi, my favorite dish, but now they just throw some sashimi on a platter next to a pile of rice. On my last visit, I explained to the waitress in great detail what was wrong with the meal and why I didn't eat it, but they offered no replacement and still charged me for it. I don't think the fish is dangerous, but even at their relatively low prices, its not worth eating.", "author": "Zando E."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-04-14", "description": "This is one of the worst Sushi spots I've ever been too.... First off the seating is Horrendous,  second, the staff is not friendly and third and most importantly the food was not good at all!!! This was the worst Kani salad I've ever had in my life drenched it mayo and not Japanese mayo, regular mayo... YUK The spicy salmon roll and spicy tuna roll did not taste fresh and the tuna avocado roll was horrible, the tuna did not smell good and the avocado tasted like cream cheese and was a giant chunk in the roll! I will never go back here!!!", "author": "Jimmy S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-11-10", "description": "This place is beautiful for date nights, but the food is okay. The sushi is nothing special, so although it's hard to disappoint, it's also hard to impress.\n\nI have to admit with a below yelper that the staff is not always very friendly. I usually don't have a problem with them since I go there regularly and am on good terms with most of the waitstaff. One night however, I got a newbie and she gave me the toughest time after taking down my order wrong and giving me something way different than what I asked for. (\"You asked for this! You told me this!\") Luckily one of the waitresses I know came out quickly and fixed that sticky situation.", "author": "Cass L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-23", "description": "The service here was great. So friendly and accommodating. I've been to Osaka many times for their great bento box lunch special and loved all the food and the fair price. For under $10 I am stuffed on soup, salad, tofu teriyaki with veggies and rice, 2 dumplings and a california roll. WOW!", "author": "Ryan G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-02-16", "description": "I went to Osaka for their $9 lunch the other day. The miso soup + salad were OK - the miso had good flavor and they added mushrooms to it which was a nice touch, the salad was a bit dry (dressing wise) and I ended up adding soy sauce to the dressing to make it more moist. I opted for their 1/2 of two of their specialty rolls - the Valentine Roll and the White River Roll.  The rolls were tasty, but disappointing because I expected the rolls to be more filling/ larger around and they were not much larger around than regular rolls, so I ended up having to order a size of Harumaki after lunch to feel full. Also, I kept having to signal the waitress for more tea and there were only 2 other tables seated at the time that I was eating.\n\nI did not like the service very much and also was not impressed very much with the salad or the special. I would go there for dinner to see if the service is better, but I won't go there for lunch again probably.", "author": "Kirsten P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-08-24", "description": "I just got takeout from them and it seems ok ,\n\n the miso soup was fantastic, but the rolls tasted a little warm; but maybe that's just takeout.  \n\nAnyway, despite the awesome miso, I definitely don't plan on ordering anything from them again... they got a B Health Grade and I looked online they had 24 violations, gross.  \n\nCheck it out for your yourself: http://www.nyc.gov/html/doh/html/rii/index.shtml", "author": "Christina B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-01-08", "description": "Bad service. I arrived as a table for four opened up, but they refused to seat us (table of 2) because they \"wanted to save it\". Had to threaten to leave before they had the common sense to give us the table. Plus food took forever to come out. They're lucky I was craving Japanese food.", "author": "Rachel W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-19", "description": "I went to Osaka for lunch and ordered the lunch special which $9.00. It had warm miso soup, special and delicious asian salad, and a roll of 8 pieces. The chef makes a good roll, and every bite is savory. \n\nI highly recommend it. \n\nAlso, the place is small that it feels like you are in a japanese home. This cute but good restaurant has a waiter who takes a good care of you and your guest. Lastly, the atmosphere is perfect for a date or catch-up with your friends.", "author": "Janice K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-06", "description": "5 stars for their sushi, but had to take 1 star off for their super slow service (and by slow, I mean I finished my entire bottle of beer before any food came out). Let me start off by saying Osaka has AMAZING special rolls. My new thing is to stay away from my normal rolls and venture outside the box (sorry salmon avocado and spicy yellowtail rolls - we're just on a temporary break...but I still miss you!). This spot has two of my favorite special rolls! The millennium roll (blue fin toro \u0026 avocado roll with spicy crunchy scallop on top, $14) - TO DIE FOR. If one were to describe a sushi mouth-gasm, this roll would be it for me. I would try anything with blue fin toro, but the spicy scallop on top was like the icing on the cake. PERFECTION! My other favorite is the white river roll (spicy crunchy sea scallop topped with white tuna and avocado, $13) - everyone raves about this roll and it is def worthy! If you're not starving (like I was) and can handle the wait, def try their special roll menu out. I can't wait to come back!", "author": "Bonnie L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-24", "description": "While my love of this restaurant still stands, it has lost its edge. The last time I came, I felt uninspired by the sushi (good, but not J.I.M.P. good as I experienced last year). My favorite place is to sit at the bar when it's cold outside and outdoors when it's warmer. However, the Omakase needs a facelift... or a dynamic offering (the same items get old, you know?).", "author": "Peter K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2007-12-17", "description": "I wouldnt recommend going on a date here - too bright. I would recommend going with friends though. The sake flows easily and the staff is gratefully pleasant.  Not too big a crowd, the only negative thing about Osaka is the amount of space and the slightly too light mood of the walls. \n\nA friend and I shared the namesake sushi and sashimi for two - because neither one of us is choosy with sushi... yet. It was tremendous. The colors were so bright and heavy. I wish I took a picture of it so I could diagram it on flickr.  The sashimi (salmon, mackerel, tuna, giant clam) came in very large pieces and was a textural delight. The sushi was great too; the size was just right, I felt like it belonged in my mouth. \n\nWe had so much food! I swear the next morning I had baby fish swimming in my belly. \n\nThe menu has a huge selection. Just about everything I read turned me on. I will need many more \"next time\"s to get a full appreciation of Osaka. How many next times do I need? How many dinner partners have to join me? There are not enough meals in a day...", "author": "Jeff O."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-02-11", "description": "Peter K.'s photos made us come here. We weren't disappointed!\n\nThe waiter gawked at the size of our order, which sort of upset me because I hate it when the server makes me feel piggy. He was right, though. Maki is huge but well made and miso soup is generous with tofu and the pleasing addition of mushrooms. The $17 sashimi regular is an amazing bargain with 15 slabs of fish too thick to fit in the mouth: tuna, salmon and two kinds of white fish surrounding decoratively sliced surf clam.\n\nThis is a good place for creative maki. The specialty maki at most places is either unoriginal or a frightening concoction of dissonant fishes, batter and sweet/spicy sauce. The millennium roll is really nice: toro topped with spicy scallop. Lobster tempura roll is neatly banded with crisp cucumber, and mexican roll is a great spicy crispy tuna dusted with bonito powder. Nice to know special rolls don't have to incorporate everything in the kitchen.\n\nAlso, the edamame is out of control. Think 100+ peapods.", "author": "Cecilia L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-06", "description": "Reading all the bad reviews, I feel compelled to write a nice one. Deciding to leave Fort Greene, for once, bf and I hopped over to Cobble Hill for a movie and some dinner. Just looking for a place that was close the theater, we decided on Osaka. \n\nWe were pleasantly surprised. Ok, I haven't eaten at EVERY sushi place in Brooklyn to make any general statements, but this sushi was very very good. Fish was fresh, it melted in our mouths, and the rice was perfect.  Service was good, people seemed happy, and it wasn't super expensive (I pay more at Sushi D around the corner in Fort Greene and the sushi is way worse.) We were reminded of the last time we had good sushi, which was in Miami, and that's saying a lot.\n\nSo, fine, some people don't love this place, I guess, but our meal was flawless and for the price it was exactly what we were in the mood for.", "author": "Amy D."}], "servesCuisine": "Japanese", "priceRange": "$11-30", "name": "Osaka", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "272 Court St", "postalCode": "11231", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/zgHOqdKs6q9WoZhf7sOovQ/ls.jpg", "@type": "Restaurant", "telephone": "+17186430044"}