{"aggregateRating": {"reviewCount": 121, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2019-04-20", "description": "The lunch special is great, good portions and very tasty. The regular menu can be disappointing. Rolls are OK, so does the sushi. People are very nice and the service is pretty fast. I would recommend this place even though it's not the best Japanese restaurant in the neighborhood", "author": "Julie F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-01-26", "description": "When Osaka first opened years ago at the very same location where it is presently, I was a frequent dine in patron. I always enjoyed it very much-- and was aware it was pricier than other local Japanese restaurants.\n\nI decided to give it a go for takeaway recently after nearly a decade, and some things have not changed. For example, what would be considered and priced a basic roll, the Alaskan, is a few dollars more at Osaka.\nThey're just more expensive than other places and I don't know why.\n\nBut on to the order. Since we were buying for 3 people, we decided to select: the warm soba noodle dish with chicken (comes with a side salad) and 6 rolls (or 2 per person).\nI wasn't at the restaurant but emphasized to my sister, who was giving the order, for extra ginger. I love lots of ginger with my sushi.\n\nAfter literally a wait that felt like an eternity, the order and dinner was ready to go. I was hungry and anxious to try again after so long.\nThese were the rolls ordered:  two spider rolls (shrimp tempura), veggie tempura roll, Philly, Alaskan and spicy tuna (again, all priced above the norm).\n\nMy rolls were the veggie tempura and spicy tuna crunch. I thought the veggie was outstanding with a variety of vegetables such as brocolli and asparagus. It was cut into 5 pieces. The tuna, 8 skinny pieces was equally good.\nOverall, we enjoyed our rolls and agreed the fish was fresh and the rice was  cooked just right. Some of the rolls fell apart at the seams though. BTW, the soba noodle dish was delicious but the chicken was overcooked.\n\nThe annoying part of this order was that  despite the request for extra ginger, there was hardly any included considering we had six rolls. Although we were assured it would be included, they also briefly mentioned more ginger was at an additional cost. This was super frustrating since they combined all rolls in 2 trays and the amount of ginger was minuscule. Very stingy. \n\nSame with the salad. The  dressing didn't run evenly with the lettuce. Therefore, only leaves remained without dressing. Unacceptable.\n\nI am wondering why their individual ratings jump from either 1 star to 5 on Yelp. At any rate, although I enjoyed the rolls, I prefer to patronize a restaurant that is on top of their game and more accommodating.", "author": "Johanna B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-20", "description": "This is a review for take out only.. called in and ordered on a Saturday night. We were unsure what to order but the person who answered was very helpful and gave us a range of items! My favorite ended up being the mango salmon roll and I now order it all the time. Sweet and savory, it's just right. 8 pieces for $11 is a good deal to me! Will definitely be back.", "author": "Milka A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-29", "description": "Going against the review grain here... as I've never had a good experience at this place. A few takeout orders and one in-person visit, and Osaka is off my list of places I'll ever eat again.\n\nFor starters, the roll prices are just unreasonable for common items, which you would assume means top quality fish. This is not the case, at least anything that I've eaten.\n\nNot once, but twice, have I received huge fatty, stringy chunks of meat both skin and in once case pieces of bone in the rolls. I almost cut my mouth on one, thankfully I didn't swallow it. To be honest, I guess that's my own fault for eating quickly. However, the sushi chefs here are inexperienced, overworked, underpaid, or just don't give a crap what their customers are eating; And to be fair, I guess I wouldn't either, after witnessing staff shouting and fighting during my only visit.\n\nAs this place has received quite a few positive reviews, I feel like an outsider without something positive to say, but nobody I've shared this food with has enjoyed it either. Something is always off, texture or flavor, or actual fish smelling funny. That, or the service being rude or slow on top of it all. Oh yeah, and the prices being much too high for the simple sushi ordered. $7 for a spicy tuna roll? Come on. Most places in the area aren't over ~$5/5.50 for better quality food.\n\nMaybe they're compensating for lack of business and serving substandard pieces of fish? Whatever it is, it should be fixed... though I guess it's not important because my stance on never returning is firm.", "author": "Ian J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-12", "description": "Good quality seafood, nice presentation. Special rolls were just OK, but sushi and sashimi were very good. Nice selection of wines, there were three of us and we got a bottle. Service is good, we were the last party and stayed past closing time without feeling rushed. \nWarning - wasabi is significantly spicier that at other sushi places. Less is more ;)", "author": "Katherine G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-25", "description": "The food was incredible as well as the service. My family and I had a wonderful time.", "author": "D R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-21", "description": "Sushi is to die for, when done right. I believe that Osaka does a great job of providing a delicious meal as well as incredible customer satisfaction. They only have Sake don which is my absolute favorite but my boyfriend prefers the tekka don. We only had to ask and the waitress said she got it and no problem. They were just so accommodating. The crispy spicy tuna roll? The crunch and spice makes my mouth water just from recalling how savory they were. They aren't stingy with the amount of fish and avocado used on their rainbow roll either. Sushi rice was sweet and had the right amount of vinegar too. Can't wait to go back to eat some more sushi on freebie nights!", "author": "Mimi F."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-01-31", "description": "We ordered take out from this place tonight and the sushi was inedible. It was rubbery and old looking. We had to throw it out. We called the restaurant for a refund and they refused. I would never eat at or order from this restaurant. Do not order from here.", "author": "Michael M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-21", "description": "Today was the 1st time I tried Osaka. Undecided on what to eat and feeling more like the weather \"blase'\", I decided to give Sushi a go, especially since it's walking distance from my project. \nThe waitress was extremely nice. I had requested the location of the rest room , to wash my hands and the waitress immediately offered me a hot towelette. I appreciated that. \nI had the Sushi Special for One along with some Hot Sake and Harumaki \"Japanese Spring Rolls with a Tangy dipping sauce.\nI was pleasantly suprised by the Harumaki. They were piping hot delictable finger foods. The Sake was dry and hot. For the first time I was impressed by the Sushi Entree. It wasn't the run of the mill, Spicy Tuna Roll accompanied by Tuni, Salmon, Mackeral  and Yellow Tail Sushi. \nI recieved a Maguro Roll, \"Tuna Belly\". For those of you that don't know about Tuna Belly, it is the most tender, flavorfull part of the Blue Fin Tuna. It also has the highest fat content which gives it a buttery consistancy. My Sushi came with two pieces of Tuna Belly, two pieces of Striped Jack, Two pieces of Sea Bream and Two pieces of King Salmon. \nI will definitely be coming back again.", "author": "Charles B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-02", "description": "Sushi here has always been very fresh and delicious. \n\nI frequent this restaurant during lunch time. I never really take a walk on the wild side here. I order salmon avocado rolls, salad, and a miso soup. Somehow I am always very happy. The salad is not the ice burg salad that most Japanese restaurants serve. Miso soup is not overly salty. \n\nMy server, Sophia, was very knowledgeable, professional, and provided excellent customer service skills. I enjoyed chatting with her, and she made sure that my boyfriend and I felt comfortable dining outside on their patio that smelled like an extraordinary incense. \n\nThank you!", "author": "Alexia G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-23", "description": "I love OSAKA . Been coming here for some time and will continue to do so.  Friendly staff and most important fresh clean quality fish. Price is right for what you get... give it a try and don't be shy to try the omakase option.  If weather permits sit outside in the backyard. :)", "author": "Karl N."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-03", "description": "Reasonably priced, decent enough sushi if you live nearby and don't want to travel too far. The eggplant appetizer was delicious but the sushi rolls were all a little bland and the eel roll contained very little eel. There was nothing particularly bad but I would rather pay slightly more to have better quality rolls.", "author": "Veronica N."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-08-15", "description": "Had dinner here last night with a friend.  The food was good, but not great.  As this was my first time here, I kept my order pretty basic (California roll, Back Pepper Tuna roll, and a Mexican roll).  The Mexican roll was new to me and was flavorful.  The other two rolls were good but no different from any other sushi restaurant that I've been to.\n\nI will say that the tuna in my Black Pepper Tuna roll wasn't that fresh.  It was gray around the edges, so I returned it.  They replaced it without issue.\n\nOverall, this is no better to me than the Sushi Tatsu chain.", "author": "Pablo G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-08", "description": "I had a nice experience..everything waa tasty..the dragon rolls and the white..it was all delicious..ate myself into a sushi coma lol..", "author": "Leticia F."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-08-25", "description": "First time here. We sat at a table for 15 minutes unattended ...not even water... No acknowledgement. On a Thursday night. People came after us and were greeted and everything right away because it appeared they were regulars there. We got up and left, it was like we were never even there. Very disappointed.", "author": "Chrissy M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-03", "description": "Very good Sushi at very reasonable prices. Wine at $18 bottle is ridiculously reasonable. Chicken yakisoba was very good; all cooked entree portions are really large. We also had Omasaka sushi dish which was really good also. They Have a nice outside patio for outdoor seating when weather cooperates. This is our go to place for local sushi restaurant while in Brooklyn.", "author": "Bob S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-13", "description": "Absolutely the best around here. I am picky because I am Japanese.\nFishes here are very fresh and high quality. It is not cheap but worth it. Their bento box was very good as well. I'd go every day if I have more money!", "author": "Asaka R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-10", "description": "Whenever I eat here, the people are quick and friendly. Their sushi is the best I've had! I also highly recommend the green tea tempura ice cream.", "author": "Hunter G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-25", "description": "The food is great, and there are many options to choose from.  My family and I go there all the time to eat. They have great tofu and other things for vegetarians and also chicken and fish for meat eaters. The workers are incredibly nice and helpful and they always make the food quickly. One time, they chased me down the block to bring me my gloves that I had left at the restaurant. They have an outdoor area where you can eat when it's nice out. The place is great!", "author": "Susan R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-30", "description": "Had their lunch special delivered twice and I truly love it especially their salmon teriyaki, its always fresh with no fishy smell to it. I would definitely try more of their dishes in the restaurant as some dishes i believe would taste better when its serves hot! Staffs were friendly too! Highly recommend", "author": "Tze S."}], "servesCuisine": "Japanese", "priceRange": "$11-30", "name": "Osaka", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "272 Court St", "postalCode": "11231", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/zgHOqdKs6q9WoZhf7sOovQ/ls.jpg", "@type": "Restaurant", "telephone": "+17186430044"}