{"aggregateRating": {"reviewCount": 121, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-03-23", "description": "It used to be: 1) Hasaki 2) Nobu for sushi.  After 10 years of this opinion I now amend my list: 1) Osaka 2) Hasaki.  Allow me to explain..Nobu is of course amazing but unless you have De Niro's cash on hand one looks for divine fresh fish elsewhere which all of the above have.  Osaka has taken the 10 year title from Hasaki because it is a little less pricey, portions are bigger, and they are a little less traditional so they make the funky rolls and such that have turned me into an an american sushi diner but what can I say...God Bless America, and God bless Osaka for that respelendent Mexican roll...it's like the UN up in that piece.", "author": "Katie Q."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2010-12-14", "description": "I am native Japanese, and I can tell the chef of this restaurant had never learned Japanese food properly at real Japanese restaurant.\nI don't know if the workers are Chinese, or Thai, or Nepal.. but the food was not authentic Japanese food at all!! I guess it's ok place if you don't expect real Japanese food.\nThe location \u0026 the atmosphere is good but the food and service really lower the all over experience. I don't think I will ever go back.", "author": "saryu w."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-01-28", "description": "The sushi here is above average, with fresh delicious offereings of sushi favorites \n\nHighs\nSpicy Tuna - a really good interepretation \nSeared Tuna Salad - a really good knock off of NOBU's famed salad \n\nLows\nEdamame Soup\nMaitre'd - has people waiting for no f--king reason, \n\nGreat combo with going to the Cobble Hill Movies", "author": "Nick Y."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2008-05-05", "description": "Over-rated, over-priced,  annoying service, certainly not as good as Ki, or for that matter Taro, or even Cube. And that self-satisfied, smirky, Carroll Gardens, closeted stepford wife, rubber clog vibe wasn't helping matters. My teeth wrestled with some gristle here and there. I mean, it wasn't one of those disastrous sushi situations that turns you off raw fish for a month or two, but if this is the highest praise I can give...", "author": "Delilah B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2007-08-24", "description": "I'm torn.  Up until last summer, Osaka was my go-to sushi place.  Nothing pleased me more than to enjoy their delicate gyoza, delicious sushi, and a glass of white wine while sitting in the garden on a warm summer evening.  Then one night it all changed.  The roll I ordered tasted off, the service was slow to the extreme, and the chicken in the yakitori was as dry as plywood.  After that, the bloom was off the rose.  I'll try again someday, but for now I can't erase the memory.  However, I will concede that the gyoza NEVER disappointed.  Best I've ever had.", "author": "Jocelyn B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-02-20", "description": "I like this place!!  They have HUGE portions for great prices.  Went here yesterday for dinner and the waiters were so nice and attentive.  My friends loved their rolls and my sashimi was pretty fresh.  I got full off of sashimi?? Really?  Hell's yeah.  Why only 4 stars?  Just because Ki is around the corner.  For everyday eats, this place is more economical.  But for decor/ambiance/romance, Ki is better.", "author": "Scuba K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2006-04-04", "description": "I love Osaka.  I live blocks away from the restaurant and I never tire of the place. The fish is always fresh and of top quality and,  unlike many of the newer sushi places opening up, a couple can have a nice meal with sake for well under $70. Service is always great but it's small so you often have to wait--take a chill pill, it's worth it. Try the Millenium Roll! They also do first-rate tempura and have a good selection of sake.", "author": "Don O."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-12-03", "description": "I like Osaka's white river roll and their lunch specials are hard to pass up. I usually just stick to that roll or sometimes my fiance will order their peach roll. All in all, their rolls are decent except for their signature Osaka roll, which I have to say is just not good. Plain and simple. The salmon skin was really fishy and compounded with the mix of seaweed salad and caviar, the roll tasted of old, discarded fish with a mishmash of other flavors that was simply not pleasant. Def.  not deviating from the white river roll again.", "author": "Kim S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-09-02", "description": "not my fave anymore. last time i went, sushi wasn't as good as it had been in the past.\nki is my new fave.", "author": "vicki M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-26", "description": "I went here twice within a week or so and had a good experience both times.\nThe first time I went with a friend for lunch and was very happy with the lunch special prices. I got a bento box with chicken teriyaki. The portion was HUGE! It came with gyoza, six pieces of California roll, miso soup, and salad in addition to the teriyaki and rice. It was all delicious, especially the miso soup which I have to say was the best I have ever had. It was fresh, light, and flavorful. My friend also got a bento box and neither of us could finish our sushi! So I took six pieces home with me. Not bad for a $9/person meal. I have to say though that the service was quite inattentive. My friend wanted a fork and eventually had to stand up and get it herself. So minus a star for that.\nSoon after I recommended that my fam go for dinner one night after seeing a movie across the street at the Cobble Hill Cinema. We got to sit in the awesome front window table where you have to take off your shoes. We ordered some miso soup (my dad got the spicy version which was even better than the regular, but came in a ginormous portion that we couldn't finish) and a bunch of sushi. My brother also got a duck special entree. It was all delicious and again, large portions. The special rolls were inventive and tasty. The service this time was very attentive and friendly. My only complaint is that the dinner prices are a little steep.\nOverall I would definitely recommend this place. Go for the lunch special and be sure to try the miso soup!", "author": "Diana B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2009-06-08", "description": "Since their email address conveniently no longer works...i've posted my message below.\n\nSaturday night some friends and I dined at your restaurant. The food was delicious, but we made the terrible mistake of sitting on the back patio...with the crazy huge rats. It was mortifying to see these things running around in circles inches from our feet. Obviously we should have left immediately and in retrospect regret not doing so. It was incredibly disappointing to bring an out of town guest to dine in what felt like a new york city subway tunnel. It was even more disappointing that no staff member said anything to us about this even though we sat with our feet up in the air and with the obvious look of discomfort. At the very least it would have been nice if someone recognized this problem and gave us a discount on the food. I hope you all are taking care of this problem and I would advise you to close your patio until the rats are gone. I saw 6 of the foulest and most fearless vermin ever in your establishment. Gross. I can only imagine what the kitchen might look like or what the Department of Health might think of this.", "author": "Noella S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-11-15", "description": "Best sushi in BaCoCa hands down. Don't waste your money at Ki, Osaka's fish is much fresher. The sashimi lunch box is a steal, as is the sushi deluxe dinner. Be prepared to wait for a table on Friday or Saturday evenings, but it moves quickly. The wait staff is friendly and attentive. They have alcohol specials during the week as well.", "author": "Sarah F."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-06-12", "description": "FOOD POISONING!!!  I almost never write reviews, but just occasionally something happens that is either so great or so bad that you have to share...in this case, sorry to say, our time at Osaka was BAD.  My boyfriend and I got terrible food poisoning after eating here last night.  We figured out that it was likely the Botan Maki - either the crab or the mayo that they used had turned.  Such a shame - we've eaten here before and liked it, and it's always sad when a local business drops the ball, but you just can't go around giving your customers food poisoning.  Definitely won't be going back.", "author": "Sian R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2010-12-17", "description": "So long as bluefin tuna is on the menu, I won't be going here, and I urge not to go, either. The bluefin is a marvelous creature, and on the verge of extinction. It's immoral to serve it.", "author": "Brandon K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2007-05-10", "description": "Good sushi.  The food was good, the service was good too.  I ended up going to Osaka because I heard it was the same owners as Yamato.  I'd prefer Yamato any day of the week.  Actually met the owners at Osaka (a Russian dude) --- nice guy.  I would definitely return here again if I were in the area.", "author": "Guillermo T."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2009-04-21", "description": "We hadn't been to Osaka for awhile and decided to go back. Too bad for us! There was a new owner, again too bad. The food sucked. Avoid this place like the plague.", "author": "Alex D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2010-10-16", "description": "terrible. did take out and the guy in charge was incredibly rude. not sure if it's under new management. it used to be great. Kai is the way to go.", "author": "David M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-19", "description": "First off, I loved the atmosphere. It was modern yet warm and comfortable. It wasn't crowded at all when I went so I was a bit hesitant. We were seated at a table towards the back but my friend saw these tables with cushioned seating up front and asked to be sat there. The waiter was great and let us move. I believe there are 2 tables that are like that by the window. They were higher up on a platform and you have to take your shoes off but whatever, it made dinner more fun. OK now for the food... I can't say it was anything special but it was good. We ordered fried banana and a chocolate volcano. The fried banana was good but quite sugary. The chocolate volcano was great. NOTE: This takes about 30minutes, I believe, to be made so when you order your main course, let your waiter know that you want this for dessert. Luckily my friend had been there before and knew it so it was prepared for us right after our main meal. I liked this because it wasn't overwhelming sugary and the cake was very moist. I will definitely be coming back here again.", "author": "Kimberly L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2006-06-26", "description": "Are there new owners here???? I used to love this place and bragged to all my friends that i had found the best sushi place but it has consistently been bad the last three times I have eaten there. The pieces have gone down in flavor, size and overall quality, but not surprisingly like everything else in brooklyn the prices have gone up.", "author": "Mike M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2007-08-09", "description": "awesome huge GIGANTIC portions all the taste at half the price of tomoe. I went in alone, and ordered the sashimi deluxe ($20), thinking i was so ravenous i could easily finish that and then some. boy was i surprised when it came ( how about you just give me the WHOLE fish the next time).   18 pieces of heavenly delight, it was a pity i didn't have someone to share it with. come with another friend and get the $30 omakase, 9 pieces of sashimi, 4 sushi, 2 maki rolls and a soup and you're all set $15 per person fills you up guaranteed, that would be unheard of in manhattan for sushi this quality!", "author": "Trystero T."}], "servesCuisine": "Japanese", "priceRange": "$11-30", "name": "Osaka", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "272 Court St", "postalCode": "11231", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/zgHOqdKs6q9WoZhf7sOovQ/ls.jpg", "@type": "Restaurant", "telephone": "+17186430044"}