{"aggregateRating": {"reviewCount": 121, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-10-27", "description": "I was so happy to have found this place while living in Brooklyn - the Carroll Gardens/Cobble Hill area. It was only minutes away from the apartment that I was subleasing, and that was by foot. S and I deemed it one of our favorite restaurants in the area.  The fish was fresh [We witnessed the sushi chef carving out slabs from the giant tuna!], and the dishes YUMMY!  I think the waitress was Chinese, but I'm not going to hate on the place. In fact, I loved it. S is a big guy, so we usually ordered quite a bit. Portions were still generous, and the bill was never too expensive.\n\nConsistent = good.", "author": "Tinna H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-08-22", "description": "Nice atmosphere, but I don't recommend this place.  \n\nThe sushi does not taste as fresh as Hibino or Ki Sushi (in the area), and I can't be 100% sure of what to blame, but both my boyfriend and I experienced a mild case of food poisoning the morning after our dinner here.", "author": "Brooke S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-09-15", "description": "It's not the best Japanese restaurant in the area nor is it authentic Japanese as employees are obviously a mix of Chinese and Latino and you'll hear Chinese music playing through the speakers. But, it will do for a regular fare.\n\nAs a mom, I have to say that their staff was thoughtful.  We were parking our stroller right outside because the place was small and it didn't look as if we could wheel in our kid vehicle.  But, the nice young lady server insisted we bring it in and she found a spot for it that didn't get in the way of other patrons.  She said she didn't think it was a good idea to leave it outside and she assured me that they bring in strollers all the time.  So I thought that was pretty nice of her to make our visit pleasant.\n\nRight up to where the window was, they had a traditional Japanese seating area.  Before going up the steps, you have to remove your footwear--just like going to a Japanese tea party!  But, one will soon discover that it's actually an illusion!  They use regular tables and they are just surrounded by an elevated \"stage\" (for lack of the right term).  It's brilliantly dressed up to look like you were sitting by low tables.  \n\nIt was a brilliant idea because as I didn't mind sitting seiza, my husband would prefer not to.  So, this was great for him because he could sit and stretch his legs underneath the table.\n\nThe food was okay.  I thought their entrees were a little pricey for the quality but hell, we live in a place where Asian food is MIA so I shouldn't complain.  We just wanted to binge!  \n\nI ordered their Grilled Duck Breast with maple ponzu sauce and fingerling potato.  I thought it was okay but my husband pointed out that I finished the whole thing anyway! The fingerling potato was like grated potato fries.  My husband ordered their sesame crusted salmon but we both agreed that it was pretty dry.  We got a lunch bento box for our daughter.  It had a lot in it but of course, she focused only on the rice. There was nothing special about it.\n\nAll in all, we had a pretty pleasant time here.  Also to note that it is situated in a good part of Court Street.  You can go to Sweet Melissa's right next door or to the Chocolate Room across the street.", "author": "Mimi S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-01-17", "description": "BOMB.\n\nMORE... IN MY MOUTH. NOW.\n\nOsaka may one day lead me to death by mercury. The fish is so fresh, and the sushi chefs really know what they're doing. The staff treat regulars well, the occasional \"on the house\"s.  The dinner combo is huge. Good mood, great food.", "author": "Sandra S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2007-05-03", "description": "On a good day Osaka is worth 4 stars, but I had to balance out the average. The fish is good, but inconsistent. I've had the King Salmon sashimi about 5 times and it has ranged from exemplary to my doubting that it even _was_ King Salmon. Same with the Otoro.\n\nI can deal with a bit of fluctuation in fish quality, but the staff is a bunch of knuckleheads. The first time I went I got lucky and scored a nice waitress. Since then the service has ranged from despondent to rude. I could accept this at a top rate sushi place, but at a neighborhood joint? There is simply no excuse. I usually don't care if a place has a shitty staff, but this is silliness.\n\nI would still recommend giving it a try, because the fish can be outstanding on a good day. Just be aware that you should only go if you know what you want, because the staff is not going to help welcome you into the world of raw fish.", "author": "aitsu i."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-01-28", "description": "Pretty good sushi at decent prices.  The maki rolls are way big and the miso soup portion is average but has generous helpings of tofu and seaweed.  The fish tastes very fresh and they give you low-sodium soy sauce, which is almost an extra star in itself.\n\nOsaka is a good, reasonably inexpensive place to satisfy your raw fish cravings.  I can't speak about the ambience of the restaurant because we always get take-out, but I don't really care about ambience as long as it's not horribly obnoxious, so who cares.", "author": "Abigail S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-02-29", "description": "My landlord owns this restaurant, so I feel obligated to give this place a good review, you know, to make sure I don't end up homeless or anything.  \n\nSeriously, though, Osaka has really good sushi.  The place is teeny weeny and even though the tables aren't packed together, still makes me feel somewhat claustrophobic.  But even though the ambiance isn't the best, the sushi is solid.  They have a special roll that involves gold flakes that I am curious to try some day, even though I'm guessing the gold is just for show and doesn't add much to the taste experience.  Still.  Something about eating gold flakes (when not in Goldschlager) seems cool and superhuman.\n\nI can't go all the way to five stars, though, because of the cramped space and the nerve-wracking memories of signing two leases here.", "author": "Margarita M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-03-30", "description": "Went here for date night* and promptly drank so much saki we only ate about 1/2 of the three special rolls we ordered to share.  \n\nInexpensive saki=happy Becca.\n\nThat said, the rolls were delicious, fresh and it pained me to waste all that food.\n\nMiso soup was solid but the house salad was so over-dressed it was hard to see the lettuce.  \n\nI'd come back but I wouldn't plan an evening around it.\n\n*Meaning it was Saturday night and I wore something other than a ratty tee-shirt.", "author": "Becca F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2008-11-17", "description": "G really loves this place and this is one of G's spots.\n\nThey had cute little tatami section in the front of the restaurant...charming.\n\nI love salmon skin salad and I was hoping this place would make it as good as Mikado back in Texas.\n\nWhen I received the salmon skin salad, I was really disappointed - the salmon skin wasn't crisp and the salad was more of a seaweed salad than a salmon skin one.  \nI didn't even know the salad would come with seaweed.  But then again, their menu wasn't very descriptive either.  I hate places where they have all these names and they automatically think you know what a \"Rock N' Roll\", \"A A C\", or \"Neghiamaki\" maki has in them.  \n\nBecause I obviously didn't think my salmon skin salad would only as a decoration for a seaweed salad.\n\nI ordered spicy yellow tail roll along with the salad but it took forever to come out and when it finally did come out I wasn't sure why it had a crunch.\n\nG felt bad that I didn't like the restaurant but I think this restaurant would be a lot better if they revised their menu and added more description to their selection.  Because perhaps then I would make a better choice on my rolls or appetizer.\n\nHowever, the service here is incredible, our hot tea was always filled to the top.\n\nSince their service was impressive, I would give them another chance but next time I would asked them to break down the menu bit by bit.", "author": "Ro R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-05-31", "description": "If you get delivery, then soup/salad comes with your entree. However, if you dine in, it's $3 extra. Never been to a sushi place where a sushi dinner doesn't come with soup or salad.  It's just lame. The food is otherwise decent, not amazing.  And I agree with the other posts that the ambience leaves much to be desired. Overall, I'd give this place a solid MEH!", "author": "Jeff F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-07-29", "description": "I live a couple blocks away and it's across from the movie theater so...yeah...awesome.  But the secret is that this place serves reliably yummy sushi at a reasonable price.  The waitresses are super nice and attentive -- you don;t wait for anything, always a smile and the food is super fresh thanks to the joint's local [popularity. Tonight I had three rolls...all tuna-based, all excellent.  If you are catching a flick across the street or ordering in in the neighb you can't really go wrong with Osaka.", "author": "Ethan M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-02-14", "description": "I had to give a star, because I couldn't post. But I ordered online from Osaka on Valentine's Day and waited 45 mins until I called to check on the order, they said it already left and it should be here soon. Ok. 20 mins pass, called back and they told us they cancelled all Seamless orders because they got too busy. Asked why they said our order already left, no answer, basically they just screwed all other customers because they could. Terrible service, terrible customer service. Food generally ok but I won't be coming back.", "author": "Caroline B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-03", "description": "other than Ki, the best in Cobble Hill/Carroll Gardens.  Friendly staff, delicious, fresh sushi.  Child friendly.", "author": "Bobbi M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-01-27", "description": "Great sushi, the best in the neighborhood for a long time.\n\nThe fish is absolutely gorgeous. And the special rolls are incredible and inventive. The eponymous Osaka roll is my favorite, and comes with sushi for two. Great place, friendly staff, nice back garden.", "author": "Glen T."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-08-14", "description": "I don't know why I still go here.  I got screwed on the Omakase two years ago.  When I asked why there was nothing special about a $45 dinner for one person I was told \"Americans don't want anything different\"... so why would they order the Omakase?", "author": "Dave N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-11-11", "description": "The service here is great and the waiters are always super nice and fill the sake bottle ALL the way to the top.  Speaking of Sake, I believe it's 50% off on Tuesday - but not sure about that one.  \nMy favorite part is the outdoor garden which is really adorable.  \nFavorite Roll:  white river roll", "author": "Anna K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-02-15", "description": "We ordered at 8:30P.  We received an email that said the order would arrive in 30-45 minutes.  After an hour, we called and were told that the order was on it's way.  30 minutes later, we called again and were told that all seamless orders had been cancelled because they were too busy.  Not only were we lied to, we received no communication telling us that the order was not coming.  Kyoto right near by is cheaper, faster, and better.", "author": "Shana R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-02", "description": "This place is fantastic.  Amazing miso soup filled with tofu and lots of nori.  Super yummy sushi made fast but not too fast that you worry about.  \n\nThe tuna with the rubbed black pepper seared to perfection with avocado is TO DIE. TO DIE.  Best black pepper roll I have ever had and I love me my pepper.  \n\nWant to go in the summer and eat pounds of peppered tuna in their back garden.", "author": "Athena W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-12-24", "description": "Maybe I've not been dining at the same Osaka as other Yelpers have in Cobble Hill...\n\nI LOVE this place.  I will admit that I have been disappointed by their non \"special\" rolls.  But they are a lot cheaper so...\n\nThe Green River Roll is heaven.  Spicy salmon inside, LOTS of fresh avocado outside.  I'm always pleased with the presentation, amount of sushi (BIG rolls), and atmosphere (be it inside or out in the garden).\nI also really enjoy their appetizers which I can admit are a bit on the pricey side.  However, this is definitely my favorite sushi place in Brooklyn.", "author": "Joey J."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2009-04-20", "description": "Two words encapsulate the post-Osaka experience: dry heave.  Literally. \n\nNormally I don't write Yelp reviews, but the profound foulness of this meal inspired me to action. I think that the restaurant changed hands recently, because it used to be pretty decent. Now it is filthy. \n\nTo begin with, there was a portly European man shuffling around the restaurant yelling at all the servers. While we were waiting for our food, several tables complained about their bills or meals. Then, each person in our party of 4 was served at different times, with a 5 to 10 minute lapse between each. \n\nThe fish was low quality. Very low. The salmon and the tuna tasted identical, but you could distinguish the two fish based on the tuna's slimier texture. The cuts were either grotesquely huge (like biting into a fillet) or shaped like a slug (including its trail of slime). \n\nThis is the worst sushi I have ever had.", "author": "Brian C."}], "servesCuisine": "Japanese", "priceRange": "$11-30", "name": "Osaka", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "272 Court St", "postalCode": "11231", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/zgHOqdKs6q9WoZhf7sOovQ/ls.jpg", "@type": "Restaurant", "telephone": "+17186430044"}