{"aggregateRating": {"reviewCount": 121, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-03-06", "description": "I liked Osaka, and I would go back.\n\nThe menu is quite expansive.  Much more than sushi or sashimi.  They have warm and cold sake.\n\nAtmosphere is cozy-ish and brightly lit, so maybe not a date place at night, but great to go with friends to talk about how your date went the previous night.\n\nI paid a little over $30 when I had dinner and 2 Sapporos with a friend.", "author": "Tony M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-25", "description": "Osaka is a reasonably priced sushi restaurant in Cobble Hill.  Though I don't have experience with sushi restaurants in the area, I consider myself a fairly advanced sushi consumer!\n\nThis review is based on one visit only -- a slow Sunday afternoon.  We only ordered rolls, a variety of four rolls for three people.  The rolls were larger than normal (8 pieces for the most part) and very tasty.  \n\nWe had a soft shell crab roll, unagi roll of some sort, another unagi roll with mango, and a toro something or other roll.  The problem I normally have with eating maki rolls is that after about 10 pieces, they all begin to taste the same.  Well, each roll had distinct flavors and I did not suffer from the maki roll blahs (even the unagi rolls were different!).  The four rolls were enough to fill the three of us.  The spider roll was only so-so.\n\nAt $45-50 or so, not a bad deal at all.\n\nI would definitely return to this restaurant because of the good combination of value, quality, and quantity.  There were no service issues at all as others have had.  I even asked if four rolls were enough or if we should get another -- they recommended we only get four rather than to upsell us -- classy act!", "author": "Neil T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-12", "description": "I went this place with my hubby last Thursday evening. I was craving for lobster tempura roll. It was a good surprised how good the roll was! It was unique that was wrapped by cucumber, instead of seaweed. Spicy miso with mussel was excellent. Seafood tartar, futomaki was very good as well. We did few take out already since we visited this place. We will go back to the restaurant again!", "author": "Grace C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2006-04-18", "description": "Besides Tomoe Sushi, this is my fave sushi place. I was recommended to come here from a friend who lives in NYC but makes special trips to Brooklyn just to have sushi here. \n\nThe sushi is so so fresh. The service is great and the place is cute but very small. And, the prices are so cheap for such great and fresh sushi! \n\nI especially love their different types of rolls (millenium roll comes to mind). Very inventive, unique and delicious. You have to try this place out.", "author": "Jen L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-09-16", "description": "Came in for dinner on a Sunday night. My man friend and I shared the Omakase, a regular sized sake, a garden salad, a bonsai tree appetizer, and fried bananas with chocolate and a side of green tea ice cream for dessert. The omakase was a blend of traditional and nontraditional sashimi and rolls--everything was fresh and even intriguing. The bonsai tree was refreshing and tasty--crab meat and such encircled in thin, curled slices of cucumber. And I'm happy to say that their green tea was the real deal--not that fake, sugary stuff.\n\nThe service was a little up and down. There was this one dude wandering around who gladly answered our questions. Our initial server, though was a space cadet.\n\nI think for the prices we paid it was a great deal. One caveat though: they didn't accept reservations for less than 4 people. Don't know if that applies to all nights.", "author": "Jo K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-05", "description": "Woohoo, fresh delicious savory sushi rolls.  The portions are pretty big, too.  The wait staff probably know me by now so they're always sweet to me when I swing by for takeout or dinners.  This is my favorite go-to sushi spot in Cobble Hill (Ki Sushi restaurant is a bit pricier).  Osaka even does delivery.", "author": "R O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-03-08", "description": "I had one of the best spicy maki combos ever.  And it was huge!  I couldn't eat it all. My husband tried the bento box with beef negimaki and tonkatsu. He also really enjoyed the food. There aren't that many choices for Japanese in this neighborhood. This restaurant is the best that we've found so far.", "author": "Mimi R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-11-26", "description": "My boyfriend and I stumbled in here after the hurricane when most places were closed and we couldn't have been happier! The food was amazing, this is the best sushi I have ever had! The specials were awesome, the sushi with mango was perfect. Such a cute little restaurant, the edamame was steamed to perfection as well. I don't know why this place doesn't have straight 5 star reviews. I don't eat a ton of sushi but Ive had enough to know whats good and this was awesome! Worth every penny.", "author": "Yara C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-02-17", "description": "Horrible evening. Waited over 50 minutes for one sushi roll. Other people left after waiting without eating at all. Food mediocre and boring. Staff arrogant and unresponsive. Many better places in neighborhood, and no comparison to food or service of Heights Iron Chef. Would never return.", "author": "G R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-18", "description": "It'sa  cozy nice place! I've been there a couple of times, and today I got a delivery. It was good. Divine eel \u0026 avocado roll, spicy tuna roll needs some work, it was very dry and tuna was too finely chopped for me. The grilled salmon was very decent... the food is consistently good...it's not on the top of the list, but for a neighborhood place it's great! I don't know why people trash this place!  Thanks for being there Osaka!", "author": "Maria F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-11-13", "description": "Okay and fresh Japanese both dining in and takeouts. It's not the best Japanese in the neighborhood and I've had two instances where I've had a small bone in my sushi and another where I was subsequently sick from the food but, in their defense I've been here quite a bit and for the most part their food is pretty good. There are a few questionable items on their menu but for the most part, it's just okay.", "author": "Lisa C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-05-19", "description": "Good but the tables are too close. Free $4 gift card with dinner.", "author": "Dan B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-21", "description": "I really love Osaka. It was the second New York restaurant I ever went to (first was a nondescript Chinese place near Penn Station), back in the late 90's. Yes, the late 90's. The Cobble Hill-Carroll Gardens border was kinda edgy then! They have a great lunch special and really good quality sushi. Delicious seaweed salad.", "author": "A M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-03-11", "description": "I. Love. This. Place.\n\nSeriously.  It is so, so good.  I live pretty much directly upstairs from it, and can't even count the number of nights I've come home from work so late that I'd just as soon skip dinner as cook (and I love to cook).  My appetite usually prevails though, and Osaka makes the perfect late-weeknight dinner.  The fish is always super fresh and the presentation is lovely; while the rolls I have tried are delicious, you simply can't go wrong ordering the Sushi or Sushi Deluxe Dinner.  It comes with a yummy side salad and miso soup.  Even if you walk in and order takeaway, I've never waited more than 10 minutes and the staff always offers me a seat and a cup of tea-- which is far more than you can say of most takeaway places.\n\nIf you're planning to stay and eat, the decor and atmosphere inside are lovely.  Traditional floor-style seating is available on a raised platform at the front of the restaurant, though you will be asked to remove your shoes if you choose this option.  If you prefer to sit at a regular table, there are quite a few available.  The wait staff is always very friendly and gracious.\n\nFor non-dinner options, the bento box is a stellar deal and is offered on weekends too; hello, brunch!!  There are several different bento combinations, so even non-sushi lovers can find something they will like (beef negimaki is a delicious option).  It's a more-than-generous portion, so bring your appetite; but at around $9-$13 (depending on combination of items) it won't kill your wallet either.", "author": "Linnea N."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-08-09", "description": "I ordered 10 rolls for a party and I watched them make them in 15 minutes flat. They were a great hit at the event. I'll make sure to bring them to the next one.", "author": "Lorelei D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-14", "description": "Been here twice, loved it both times.  Friends always get a huge variety of rolls and rave over every bite (from what I can tell, the Green River and White River rolls in particular).  I'm vegan, and they make me a nice little vegetable roll wrapped in cucumber that is tasty and doesn't make me feel left out.  Garlic broccoli was also great.  Pretty amazing prices for good sushi.", "author": "Valerie H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-25", "description": "The American Dream Roll is an absolute dream! Three kinds of fish (tuna, salmon and eel) with avocado in one roll is just heaven for me. I don't know why; I can't explain it, but I love it and you should be jealous that I only live one block from this $8 roll. Yum. I will be returning often.", "author": "Anjuli L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2010-02-15", "description": "Well, let's put it this way... From 2005-2008 I ate at Osaka at least 1-3 times a week. It was a magical restaurant... Had everything on their menu (more than once).  It was the reason I loved my neighborhood (Carroll Gardens).  \n\nThen late 2008-2009 something went really wrong. All of my favorite servers started leaving (one by one) and I didn't know why. I believe that someone bought the place, but never really got the info. Every experience got worse and worse, until about 8 months ago, when I decided I'd never go there again. \n\nWell, tonight I went there with my wife for the first time in 8 months (because we were bored and didn't feel like cooking). We ordered all vegetarian because we were very hesitant to give them the ol sashimi college try. \n\nSeriously? How can you mess up Edamame, Japanese Vegetable soup, and avocado and cucumber rolls? How is that possible?? Nothing was fresh. \n\nWhat a mess. I give them a year from today before they go under, unless management fixes whatever they messed up.", "author": "Dave G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-28", "description": "Calming, attractive environment. Pleasant service. Exceedingly fresh, attractively prepared sushi and divine oshinko--the best I've had, by  far. Also try the  eggplant in white miso--a lovely dish.", "author": "Gerry P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2006-10-20", "description": "I am so glad I found this restaurant. I came here on New Year's Eve, and it was very busy, but we were seated right away. The service is wonderful and attentive, and the fish is so fresh and beautifully prepared and displayed on the plate! I ordered the sushi and sashimi platter for two and shared it among three hungry girls, and we could still not finish it all! Also, the portion of Edamame was very generous! This is a tiny place, but it seems to be quite popular. Osaka is located right across from the movie theatre, which makes it a great spot for friends to have a night out! Delicious! Recommended!", "author": "Allison G."}], "servesCuisine": "Japanese", "priceRange": "$11-30", "name": "Osaka", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "272 Court St", "postalCode": "11231", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/zgHOqdKs6q9WoZhf7sOovQ/ls.jpg", "@type": "Restaurant", "telephone": "+17186430044"}