{"aggregateRating": {"reviewCount": 121, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-11-11", "description": "My last and--barring any magical loss of principles--final trip to Osaka  left me with such a bad smell in my nose that I didn't even finish my dinner.  Let me back up.  I've waited enough tables in my day to respect good service while also empathizing with servers who are overwhelmed, overworked, or just do damn tired and pissed that they just want the customers to leave.  I've been accused by friends who haven't worked in restaurants that I can be an annoyance to eat with because I see things more from the waiter's perspective than the customers.  That said, I very disturbed by the service at Osaka.  To the point of being genuinely offended.  Twenty-five minutes before the advertised closing time, I was presented my check and not allowed to order anything else to drink (my dinner hadn't even arrived).  While I was still eating, the rank--and I mean rank--I'm really not a whiner and I saw all the employees covering their noses here--garbage was dragged, dripping a lovely mix of fluid behind it, across the dining room and to the innocent outside corner.  Over and over again, the bags kept coming.  At that point I really would have left no tip at all but...guess what?  After sustained pressure (apparently the cashier was going to explode without it), my credit card slip had been apprehended.  The food?  Not bad.  But why ever go here when Ki is a five minute walk away?  All the folks at Osaka had to do was tell me that walking in forty minutes before closing time was going to be met with olfactory torture.  I would have gladly left.", "author": "Patrick W."}], "servesCuisine": "Japanese", "priceRange": "$11-30", "name": "Osaka", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "272 Court St", "postalCode": "11231", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/zgHOqdKs6q9WoZhf7sOovQ/ls.jpg", "@type": "Restaurant", "telephone": "+17186430044"}