{"aggregateRating": {"reviewCount": 121, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-02-03", "description": "Been a customer for many years. Never had a problem even considering quality and portions went down drastically after change of ownership. All this changed tonight when the cook decided to have his dinner in the table next to me while I was eating. The guy literally slurped and munched and gulped his food so loud I couldn't hear my wife talking. It was disgusting and the staff was oblivious. No apology when I mentioned it to the server. Had to cut my meal short and leave. \nNever in my life have I experienced such behavior in an establishment. Even the divest of dives in the mainland knows this is unacceptable. \nI will never set foot in that place again. Was grossed out! With a cook behaving like this.. Who knows what he does while preparing YOUR food. \nYuck!", "author": "T. k."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-30", "description": "Good experience for a neighborhood sushi place. Hibino is the only competing Japanese we'd consider going to. The green river roll was tasty. I'll go back.", "author": "Danny R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-06", "description": "Came upon this little gem on court St. The sushi is so fresh and the prices are so reasonable. the salmon tempura is to die for.", "author": "Maryann D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-03-21", "description": "One day the screw up the order, next day they take an hour to deliver.  I am not giving them an opportunity to screw up again.", "author": "Frank M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-11-17", "description": "Have enjoyed delivery from Osaka multiple times but thought we should try it in the restaurant as sushi is always better that way. Not so much - service was not great (although sake and beer came relatively quickly) although the waitress had the entire restaurant to serve so maybe they were understaffed. Sashimi was ok but seemed not too fresh and the white tuna seemed frozen and tasted a little weird (couldn't put my finger on it). The crunch in the spicy salmon tasted old like it was fried in unfresh oil (I only ate half my roll even though I was hungry). The miso cold was very good although the yam noodles cloyingly sweet. Honestly the worst part about it was the bathroom! Downstairs through a dirty hallway and the bathroom was not clean. Overall the restaurant needs a redo and clean up, when eating sushi you expect a very clean environment. I don't think we will be going back or ordering delivery until they clean this place up!", "author": "Vanessa P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-07-05", "description": "After having gone here for many years and noticed some change in quality and then service I didn't want to believe it and continued to go back. Sadly with better Ki Sushi, Mitsoushi and others you should pass. \nAfter being sat it was 10 minutes before asking for a waiter to order while they get take out orders ready. That added to a +$3 surcharge to add avocado to a roll, I'm done.", "author": "Matthew R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-06", "description": "Terrific sushi and very friendly service.  I recommend!\n\nGF and I had plans to see a movie in Cobble Hill and wanted to stay close to the cineplex.....lucky for us Osaka was directly across the street.  I have been there a few times with friends, and have had good experiences in the past.  \n\nThe restaurant is clean and quiet. The staff is helpful and very patient with you if you have questions about the menu.  I usually get Rainbow rolls but decided to try something new.  I had a mango and salmon roll (special), edamame, and hot saki.  Absolutely terrific. Look forward to going back.", "author": "Mike J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-03", "description": "We go here all the time! The staff is so nice and polite and helpful.  Very kid friendly.   The food is excellent!    Anything we order is amazing.   Very easy to eat healthy here And also incredible flavor and some spice if you want!!  \nVery good prices.   \nVaried menu and clean place - perfect! \nHighly recommend this wonderful spot!", "author": "Hugh G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-11-10", "description": "Osaka looked so promising based on the yelp reviews. I should have run away once I entered the restaurant and it smelled super fishy, but then I had already told my friend to meet me here since we were going to the theater across the street.  Against my better judgement, we stayed for a meal here and ordered the sushi and sashimi for 2.  The fish was not fresh at all!  The hamachi which should have a firm texture was kind of soft and the texture was weird like fish that was past it's prime.  Some of the other pieces of sashimi tasted really cold like it was just defrosted.  After a couple of bites, I was so scared I would get food poisoning and did not finish my meal.  This has never happened to me before at any sushi restaurant since that is my favorite food.  \nPlease do yourself a favor and go to Ki Sushi on Smith St instead if you are in the mood for good Japanese food.  Stay away from Osaka.", "author": "Lucy M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-02", "description": "Loved Osaka. Each dish was very well presented, fresh and full of flavour. Chicken teriyaki was plentiful, gyoza were tasty and the shrimp roll delish. Will definitely be back, such a quaint restaurant with excellent service.", "author": "Karl M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-02", "description": "Since moving to Brooklyn, this is my girlfriend's and my favorite sushi place. Nice looking place with very friendly service.  I don't think the staff are actually Japanese (maybe Chinese) but it doesn't matter.  They got it right. The food is delicious.\nTry the Futomaki, and the dragon rolls.  Awesome..", "author": "John O."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-03-15", "description": "We went one summer during a heat wave. Some white transplant chick was the hostess who didn't even know what netta was.\nThe door kept opening and flies were coming in. It was really unsanitary. Sushi was totally forgettable and fugazzi.\nThe flies were actually on the sushi in the case. I think I will skip it and not have flies with my meal next time and save that for the TV show Bizarre foods. \nHere is my NY sushi list.\nhttp://www.yelp.com/list/nyc-sushi-new-york-2\nMy NY Japanese list-http://www.yelp.com/list/japanese-restaurants-in-nyc-new-york\nmy nation wide Japanese list-http://www.yelp.com/list/my-nation-wide-japanese-list-new-york", "author": "Pinky And The B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-12-08", "description": "A solid sushi spot.  We tried the sushi dinner and the sushi deluxe dinner (FYI: deluxe has two more pieces).\n\nSome of the seats are embedded tables.  Take off your shoes and slip in to get the full experience.\n\nNothing remarkable, but nothing to complain about.", "author": "Sydney B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-24", "description": "Great salmon sushi dinner, huge portions and amazing quality of the fish. Attentive but not pushy service, good rolls, clean, quick, for the area, and having tried a couple, we go back once every 10 days or so. Never disappointed.", "author": "Paloma D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-26", "description": "Amazing sushi!!!! I LOVE this place! Not only is the food good at a sit down dinner, but the take out is awesome too (which is not always the case). The fish is always fresh and they don't skimp on the soy sauce packets (like Hana Cafe does). Soy sauce is important to me. It may be a buck or two pricier than cheap places like Hana, but the quality is 10x's better and the delivery is always SUPER fast. TOTALLY worth it! I'm obsessed! Can't say enough good gongs about this place. I especially love their tempura and fried cheese cake. The best!", "author": "Analicia A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-07-26", "description": "On one hand, it pains me to give Osaka a three-star rating. On the other hand, it doesn't. Hence, the 3 stars.\n\nThe first hand (let's say the right hand since that is my dominant hand and this is my slightly more dominant feeling about Osaka): the food is great. The white river roll and classic roll are addictive and unlike any sushi rolls at any other restaurant. Their mexican roll (still misspelled on the menu for years) is also deliciously smoky and surprisingly difficult to find other places. Although it is usually superb, the last time I ate there, it tasted more like a regular spicy tuna roll. The edamame and miso soup, while common and simple japanese dishes, are that much more flavorful at Osaka. It's like they put crack in everything they make. \n\nThat brings us to the other hand: the prices, which you have to be on crack in order to agree to pay. I understand charging more for the extra special rolls (the white river and classic rolls are both $13), but everything on the menu seems to cost more than it needs to. Their regular rolls range between $5 and $13, and basics like miso soup and seaweed salad are all at least a dollar or so more than at other restaurants. It adds up.\n\nEverything else about Osaka falls somewhere in between the two hands. I like the ambience, but I could see how some would argue that it is not as aesthetically pleasing as some other sushi restaurants in the area. I find it quaint and comfortable. Although the place is small, it always seems to be fairly empty when I go, and I never have to wait for a table, which is strange since I know they do good business, and whenever I am walking by and not in the mood for sushi (I can't believe I would ever not be in the mood for sushi!), it is packed. It's as though the place empties out just for me (if I really believed that, I would give them more than 3 stars). The service is usually quick and attentive when you dine in, although the last time I was there, our waitress was almost too attentive in an uncomfortable, socially-awkward kind of way. When you order delivery, however, it is extremely slow and a $20 minimum. I try not to order from here, but sometimes I really want a white river roll and, like I mentioned earlier, no other roll at any other restaurant is going to cut it. But, if you are sitting at home with no plans of moving and want standard sushi bar fare, you are better off ordering from Jpan, Hana, or one of the many other options on seamless.com.\n\nI love you Osaka, but I hate you.", "author": "Sandra G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-07-07", "description": "Terrible, inattentive service. Mediocre sushi. I went for lunch, the waiter seemed annoyed to have to serve our table. The restaurant wasn't very crowded but he always had other things to attend to when I was literally staring hoping for his attention. Food was meh. There are some great sushi spots in this area, treat yourself and stay away from Osaka.", "author": "Finnegan S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-28", "description": "Never had a bad roll yet.  We've made this a must stop at least once a week.  Excellent service and delicious rolls.  You won't be disappointed!", "author": "Elizabeth R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-18", "description": "Authentic sit down experience-tatami mats and all. Sushi is fresh and flavorful, many different options/varieties. Fair pricing. Pleasant staff. We've been three times in a week. The sushi is fabulous. Soups are a dream to your taste buds, especially the spicy seafood. Overall, you shouldn't be disappointed.", "author": "K S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-01-21", "description": "Eh.\n\nWent here for the first time in months for dinner last night and forgot what I liked about this place. The sushi just wasn't as fresh as I had remembered while the prices were as high as I remembered. \n\nI ordered chirashi (scattered sushi) and asked for no shellfish which they confirmed and promptly (or rather, after awhile) brought the dish out with shrimp and crab. So I had to send it back and wait some more for it after already a pretty long wait. \n\nThey do have some pretty cool appetizers though, like Hamachi Kama. Who knew that yellowtail jaw would be so delicious?\n\nAnyway, I'm not done with Osaka, just took my enthusiasm over it down a notch. Plus they don't even make you take your shoes off anymore for sitting at the special table. Where's the authenticity!?", "author": "Lana V."}], "servesCuisine": "Japanese", "priceRange": "$11-30", "name": "Osaka", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "272 Court St", "postalCode": "11231", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/zgHOqdKs6q9WoZhf7sOovQ/ls.jpg", "@type": "Restaurant", "telephone": "+17186430044"}