{"aggregateRating": {"reviewCount": 127, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-19", "description": "I work in the building right above this hidden gem so I come here for a sandwich once every two weeks or so. You won't be disappointed here.\n\nMy go-to (and their best sandwich without a doubt) is the Porchetta sandwich. It has a good amount of pork (some juicy fat included) in crunchy, toasted ciabatta bun. I can't really recall what else is in it, but it is delicious. You'll easily recognize that it's a high-quality sandwich. I get this sandwich 90% of the time because it's just that good. \n\nMy back-up is the chicken sandwich here. It's very tasty as well, but it doesn't even come close to the pork sandwich.\n\nNote: The Porchetta is the best seller here and it sells out between 1pm-2pm, so come here early if you want to try it.\n\nTip: Call before you go. It does get a little busy around lunch time so don't be surprised if there's a wait for the food prep.\n\nRemember to get your loyalty card punched -- 1 free sandwich after 10.", "author": "Simon Z."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-09", "description": "Tasty well made sandwich. It wasn't cheap but delicious. I couldn't have the spread because of allergies, but the meat was so flavorful I was happy without it.", "author": "Sara P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-09", "description": "Best spot in town. Breakfast sandwiches were on point. You won't regret it! Will def come back next time I'm in Brooklyn", "author": "Omar A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-02", "description": "I got the veggie sandwich and you could really tell how much effort they put into it. All the vegetables were perfectly sliced and stacked, cheese perfectly melted, and bread nice and crispy. Best lunch ever.", "author": "Kseniya S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-12-09", "description": "This is definitely not the place to go if you are in a hurry. I'm ok to wait 5-10 minutes but over 15 minutes is a little excessive. The porchetta sandwich was a bit dry and not worth the wait. I also stunk like grease for the rest of the day because there doesn't appear to be proper venting in this place.", "author": "Emily R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-09", "description": "Came in for \"The Sandwich\", which they don't start serving until 11:00 or 11:30 unfortunately, so I settled for the breakfast sandwich.  It comes with a choice of meats (bacon, ham, or turket bacon), spread (pepper aioli, mayo, or garlic spread), and bread (seeded or ciabatta).  Additionally you have optional egg, avocado, and veggies.\n\nI went with the turkey bacon and pepper aioli on a ciabatta with everything.  Not bad at all.  It did take a bit longer than I thought it would to make, possibly because my friend and I arrived at 9am on a weekday and the breakfast rush may have been in progress.  And the space by the register is a bit tight, so we had to shuffle around to make room for customers while we waited.\n\nWe ate outside in the area next to the Manhattan Bridge, which was a bit noisy with the constant stream of trains going by.  Next time I'd check out the inside seating area.  Unfortunately they are closed on weekends and I don't work in the area, so my odds of coming back and trying my preferred sandwich in the near future are slim.", "author": "Richie T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-25", "description": "Vegetarian sandwiches can oftentimes be a hit or miss for me. Sometimes the veggie slide out of a sammich, veggies with high water content (ie cucumbers, zucchini) soak through the bread because you decided it was good to travel with a veggie sandwich, and the like.\n\nBread \u0026 Spread offers the perfect vegetable sandwich: the Giardino. Please get this. The veggies were so thinly sliced that nothing fell out of the sandwich upon tight embrace or, you know, biting into the thing.\n\nIt's a very tight space, so it takes a little while to make said perfect sandwich. It's almost like they're these recent college grads making these lovely things with a tiny toaster oven in their garage. That silly romantic twist makes the sandwich taste better.", "author": "Kendra C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-20", "description": "The best breakfast sandwich in Brooklyn, hands down. No bagels needed - the bread alone is amazing and their green verde sauce is INSANELY good so make sure to get that on your sandwich! \n\nStaff is great, friendly and fast! Make sure to grab a dreamy sandwich from them before starting your work day.", "author": "Lucy R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-12", "description": "Based on the other reviews we figured we would try it. We were not disappointed!  Girl at the counter was super friendly, that's always refreshing. \n$15 for 2 breakfast egg sandwiches and 2 small coffees. Fresh bread and ingredients, really good, delicious. \nClean, small store front and just 4 stools for seating. \nWe will return!\nI could see this place expanding to a bigger restaurant if they play their cards right.", "author": "A H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-26", "description": "Best place for quality filling food. Got a chicken caprese. I didn't mind the wait bc once I tried it i could see why it took longer. Perfect amounts of every item melt together making a seamless flavor. I was full after and it wasn't even too big. 10/10 would recommend!!", "author": "Ali S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-24", "description": "Loved the sandwiches made here! The employees were super friendly and made sure we were taken care of. Although seating is limited, I highly recommend taking your order to go and eating at Brooklyn Bridge Park which is right around the corner (beautiful view of the bridge and the Manhattan skyline). If your look for a fresh, home style sandwich, then go to Bread and Spread!", "author": "Laura B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-15", "description": "So delicious! Made fresh right in front of you, this place is a hidden gem in DUMBO. I had the chicken sandwich and my friend had the vegetarian and they were both unbelievably good. Stop by if you're in the area you will not regret it!", "author": "Kate C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-03-01", "description": "Yep, I got the famous porchetta sandwich.  I loved the little shop with only two people operating it, and it felt like the guy was handing me a sandwich made with a lot of love and care when he called out my name.  Unfortunately the meat was a bit dry (I went during off lunch hours?)....is it me?", "author": "Juan J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-13", "description": "This place operates in an area about the size of a large walk in closet but that does not stop staff from making you feel like you are right at home and have been eating there for 40 years. I always feel right at home and am always satisfied with anything i get on the menu.\n\nThis is the place i go when i want to \"reward\" myself with an explosion of incredible flavor and break up the mundane breakfast sandwich routine.", "author": "Anthony P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-05", "description": "Stopped by here before an interview I had nearby. Rosie behind the counter made some recommendations and the sandwich hit the spot! End of the story: I got hired, and I have an amazing sandwich spot right by my wrk place. With her recommendations, best believe she deserves one hell of a tip. Will be back, time and time again ;D", "author": "Sharmin F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-14", "description": "Call ahead. If there's one piece of advice I can give you, let that be it. You will spare yourself a lengthy wait. Trust me.\n\nI split the prochetta and the vegetarian with a co-worker. And, I rarely say this, but I thought the veggie was even BETTER than the porchetta. But in all seriousness, both were insanely delicious.\n\nI also spotted shrimp crackers, which I naturally had to get a bag of and enjoyed some equally excellent ginger ale. \n\nSo good.", "author": "Shu Jin S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-14", "description": "A hidden gem. I would highly recommend this place if you need a breakfast sandwich and a good cup of coffee.", "author": "Paul D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-02", "description": "Unassuming café that you might miss if you weren't looking for it! The staff was willing to make me a breakfast sandwich, despite the time (11:30am) and they were very friendly and attentive. I wish there were a few more chairs, I would've stayed to chat longer!", "author": "Corey M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-18", "description": "Been meaning to try Bread \u0026 Spread for months. Finally committed today and am so glad I did! Got the Porchetta and was really impressed with the delicious combo of well cooked pork belly and veggies. Ciabatta is on point too. Will definitely be back!", "author": "Hilda Y."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-02", "description": "Is this pricey for a lunchtime sandwich in Dumbo? It felt a little excessive. However, it didn't disappoint. The Porchetta sandwich was amazing. Great bread, so tasty. Would have again for sure.", "author": "Chris J."}], "servesCuisine": "Breakfast \u0026 Brunch", "priceRange": "$11-30", "name": "Bread \u0026 Spread", "address": {"addressLocality": "Dumbo", "addressRegion": "NY", "streetAddress": "151 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/lB0yi8BzjgI3QbTxEexuuA/ls.jpg", "@type": "Restaurant", "telephone": "+17186252220"}