{"aggregateRating": {"reviewCount": 127, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-25", "description": "Stumbled upon this sandwich joint after going to the bazaar around the block. \nCute little hole in the wall. \nSandwiches were stacked with great quality food and the BREAD! amazing. Definitely pay what you get for here :) \nSuch a great filling treat.", "author": "Ellewynn T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-05-27", "description": "Great service. Great food. VERY GOOD TASTE!!!! Beef rib* is my number one (i cant remember the name). Also, Porchetta is good for non-beef lover. \n\nTo be honest EVERYTHING IS GREAT!! The reason i gave 4 stars because the place too tight for me thats all.", "author": "Kasidit C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-04", "description": "Love this little place. I'm so used to food experiences like this to require some level of crowd-tolerance and line-waiting except for very early morning or right before closing, but for Bread \u0026 Spread I've yet to have to wait in any sort of line even at a sane hour of the day. Their sandwiches are big, heavy, warm, and emotionally healing after a rough night out.  \n\nThe little ways that they've made their shop an efficient machine are all very fun. e.g. Your order is written in sharpie on a sandwhich bag which is then the very same bag that you get your order in. \n\nSome highlights as I try out different combos of their customized BEC:\n- Ciabatta - truly something special. It's surprisingly thinner than the usual puffy behemoths I've come to expect with ciabatta. It's beautifully fluffy on the inside but crispy on the outside, and all-around chewy, much like how I've once heard a French Youtuber describe perfect bread. \n- Multi-grain bread -  awesome, and hits the spot when I want something chewy and full of texture from the seeds and rough.\n- Eggs - They always leave their yolks a little runny which is e x a c t l y the way I always love to have my eggs!\n- Swiss - Creates a very satisfying stringiness when you first open your sandwich, but from there on I don't know if I taste it much as I get to eating the sandwich. Perhaps I need to order extra cheese if I actually want a gooey experience, or perhaps I need to try one of the other cheeses.\n- Bacon - WOW. Magical and transformative. It's like another class of sandwich once bacon is added. \n\nI always like to make a comment on good service as well. I've seen the same guy behind the counter every time I go, and he's always super nice, obviously believes in the sandwiches here (e.g. was a little surprised the first time I ordered when I didn't say I wanted sauce), and seems to recognize us even though we've only been a few times. A great sandwich place can easily be dampered by an unfriendly face in the morning, but this place is full of only good vibes for me.", "author": "Nancy H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-19", "description": "The best egg sandwich I have ever had!! You could tell and see that the ingredients used to make the egg sandwiches are fresh and made to order. The sandwich was quite large for the price, and I was left feeling full and satiated for hours. The staff were also very nice, and accommodating to any dietary restrictions, and minor substitutions. I also enjoyed a cup of coffee from here which was also very good. If you are looking for the best egg sandwich in Brooklyn, and quite likely all of New York, I highly recommend coming here.", "author": "Elizabeth D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-04-29", "description": "Would have loved to try their meat sandwiches, but keep in mind those are only available after 11:30am! They grill their own meat and that requires time to rest the meat etc. Because I came here too early, I opted for their breakfast sandwiches which were also great and delicious. They have several bar seating and two dining tables, but most customers get their food to go. I think this place is worth a visit if one is visiting the DUMBO area.\n\nOnly problem I had here was that the cashier taking my order was a bit rude and unapproachable. She was frustrated with a previous big order and just didn't seem to care how she was coming off.", "author": "Kenneth L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-07", "description": "The Bear (sub turkey bacon) is my absolute favorite sandwich in Brooklyn, but this charming sandwich shop in DUMBO has an amazing, well planned and well executed selection of sandwiches on offer.\n\nAn excellent place to grab a bite to-go, walk two blocks, and enjoy it on the water overlooking manhattan.", "author": "Charles Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-07", "description": "Bread and Spread is my new favorite lunch spot in the neighborhood. I know this restaurant has existed here for a few years tucked away and hidden inside of the building next door, but it was only after their move to a standalone storefront that I visited. Still, the place is relatively hidden from street view, so you may walk right past it without discovering this gem.\n\nI've been twice now, each time getting one of their specialty sandwiches from the menu above the counter. The first time, I grabbed the Tuscan Roast Turkey sandwich which includes moist sliced turkey, crispy onions, and a delicious cranberry mustard on a toasted hero. This was right around Thanksgiving so it hit all the right nostalgic spots, also well balanced with the fats of the meat, sweetness and a little sour from the mustard, and crispy saltiness from the onions.\n\nThe next time I went I tried their Beef Short Rib sandwich and my life was changed! Short rib, gingered shallot, blackberry jam, swiss cheese, all on a sourdough roll, this master creation was perfect in every way. My new favorite sandwich in the city.\n\nReasonably priced for the neighborhood, and exceedingly delicious, do yourself a favor and go find Bread \u0026 Spread.", "author": "Matt C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-09", "description": "I've lived in Bushwick, East Williamsburg, Park Slope, FiDi, and Hudson Yards. In every neighborhood, my first port of call was to find my local breakfast sandwich. But let me tell you, of all the ones I tried there is no breakfast sandwich that compares to this one. Look -- I know it's not a bagel -- but this bread is so tasty, fresh, airy, and crisp. You need to open your horizons here about the bagels, okay? This place is the best. It is soooo worthy that I want no one to know about it. But I'm willing to hold the selfishness at bay just this once. The people deserve to know.\nGo.", "author": "Emelie B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-08", "description": "Solid sandwich joint with large, fresh options. For a bit over $10 you get a filling, flavorful lunch. Mine actually lasted two lunches, for me. \n\nI had the porchetta, with a generous amount of fatty pork belly inside. The ciabatta bread was nice, as well as the slightly bitter greens. It was a bit heavy for me, but they do have some lighter veggie or chicken sandwiches that seem delicious. The breakfast egg sandwich seems like a great deal.", "author": "Jennifer D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-17", "description": "Great chicken bacon wrap with jalapeños. Small place busting out excellent sandwiches in Brooklyn. Will definitely go back next time I'm in DUMBO.", "author": "Doug L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-01-29", "description": "There are 2 bread \u0026 spread door next to door...this one has delicious bahn mi. Solid lunch spot.\n\nPork is on the oily side.", "author": "Ming Z."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-23", "description": "Quite possibly the most perfect Beef short rib sandwich on the planet (or at least in Brooklyn) This quaint sandwich shop tucked politely in the shoulder of Dumbo, right off Jay street, crushes the sandwich game with killer combos of meat and cheese topped with the ever so delicate fancy bread of your choice. I know what your going to say \n\n\"More than ten bucks for a sandwich, you got to be kidding me!\" but with the rent in dumbo more than the budget of some cities, these tasty treats are worth every penny. After drink and a bag of chips at another place you're spending the about the same amount anyways. \n\nSo if you are in the area and interested in eating a sandwich truly a cut above the rest the go get some spread on your bread.", "author": "David C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-20", "description": "Bread and spread is tucked away in the cutest part of Brooklyn, Dumbo. It's very close to the Brooklyn Bridge Park and the pedestrian walkway. The area is fun for shopping, sights and Instagram photos! \n\nThis sandwich shop is small and cozy. It offers bar stools and small tables around a open style kitchen. The menu has 5 signature sandwiches. I tried the porchetta, it was great! I really enjoyed the toasted bun and pork belly, mixed with the sweetness of the pickled onions. They ran out of ciabatta bread (my fav) but the cook assured me the sandwich would be just as good on a multigrain roll. Not only did he trick me into eating healthier but he also didn't lie, the sandwich was melt in your mouth gooooddd. \n\nMy sandwich costed $13 which was a bit pricey for me but worth every penny. They had a corner of the shop dedicated to coffee, which I really loved the look of. Made me feel like they made a mean coffee. \n\nI would definitely recommend this sandwich place if you're looking for a savory, healthy and quick lunch spot ! Thanks Bread and Spread for a great date spot ! I'll be back!", "author": "Zuzia S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-19", "description": "I was a lil skeptical because I thought it was overrated.... It's not it's delicious and fresh and you can taste everything... I'm in love", "author": "Auty B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-17", "description": "On top of it's all day freshly grilled meats that go into the porchetta and beef short rib sandwiches (complete with pickled onions), this place has, hands down, the best breakfast egg sandwiches in the whole city.\n\nMaking good egg sandwiches has become a lost American Art of late, and Bread and Spread has resurrected it with a vengeance. Have an eggs over easy sandwich with American (or your choice) of cheese and bacon on their delicious -crunchy on the outside and soft on the inside- ciabatta roll and you will know breakfast heaven. In a time where every fancy brunch place is doing ever more outlandish takes on breakfast, it seems like a great bacon egg and cheese sandwich has become a rarity. Love this place. I would give it ten stars if I could. You will not regret coming here for any meal at any time of day from 7-7pm 7 days a week.", "author": "Pierre F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-02", "description": "Stumbled across this sandwich shop right off York St. station and I'm so happy I did. I had the best breakfast sandwich I have ever had! Already looking forward to coming back soon.", "author": "Gustavo L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-18", "description": "Their sandwhiches are amazing. The Porchetta was heaven, with the Short Rib a close second. The ingredients were unique but worked in perfect harmony.", "author": "Emily B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-20", "description": "Was in DUMBO the other week, it was lunchtime, and we were in the mood for sandwiches. Bread \u0026 Spread's sandwiches are exceptional, the menu simple, the service quick. I appreciate that they only have a handful of sandwiches to choose from; it allows for ease of choice for the customer. The ones we tried were: \n\nPORCHETTA~ Pork belly sandwich; pork belly was tasty, the pickled onions and arugula counterbalanced the pork, while the provolone and red pepper spread tied everything together nicely.\n\nBEEF SHORT RIB~ Gingered shallot was nice, but the blackberry jam spread was an interesting touch that I liked. It added an extra dimension to the sandwich, I still remember the sandwich for the moistness of the beef and the blackberry jam. Yup.\n\nI believe the other sandwiches were chicken, turkey, and something vegetarian; and I'm sure they're really good, too. Even for a more \"modern\" sandwich counter (especially in a place like DUMBO), they're priced really fairly (around $12-13 for a sandwich) and you'll leave satisfied. Good place!", "author": "Brett I."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-02", "description": "Some of the very best sandwiches in New York - I've had them all, many times! \n\nThis place is also tucked in the cutest little hideaway across from Chase Bank at Jay and Front in DUMBO. It's easy to miss but don't give up, it's well worth the hunt!", "author": "Amy J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-09", "description": "The porchetta sandwich! Drooooool.\n\nPerfectly cooked semi-fatty pork belly on ciabatta bread with pickled red onion, arugula, and melty melty provolone.\n\nPrices for sandwich are on par with Manhattan (around $11 for a sandwich that's not exactly huge).\n\nThey have a pretty crazy drinks selection. All the hipster stuff people love, like Harmless Harvest (at $6 a bottle), cold brew, health juices, etc.", "author": "Kenny C."}], "servesCuisine": "Breakfast \u0026 Brunch", "priceRange": "$11-30", "name": "Bread \u0026 Spread", "address": {"addressLocality": "Dumbo", "addressRegion": "NY", "streetAddress": "151 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/lB0yi8BzjgI3QbTxEexuuA/ls.jpg", "@type": "Restaurant", "telephone": "+17186252220"}