{"aggregateRating": {"reviewCount": 127, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-27", "description": "What can I say about the porchetta sandwich that hasn't already been said?  Nothing.  The other reviews nailed it...this sandwich is amazing.  I'd like to try some of their other sandwiches but not sure it's possible for me to go there and not order the porchetta.", "author": "J M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-01", "description": "Standing ovation for the porchetta sandwich I just ate like a savage while walking back to my office. Can't wait to get another.", "author": "Liz R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-28", "description": "Great little lunch spot for takeout (just 3 stools available if you want to eat there). My wife and I shared 2 sandwiches and they were both delicious and made to order. Would definitely recommend.", "author": "Sam C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-09-28", "description": "Sandwiches are ok - when they have the ingredients to make them. Recently they seem to offer only a sandwich or two at a time, and even then ask to substitute ingredients because they're unprepared.", "author": "Sean S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-17", "description": "Perfectly crispy and flavorful sandwiches. It's pretty evident that the ingredients are fresh and cooked with love - but my problem lies with the efficiency. I respect that there is one person making the sandwiches, but a more optimized system needs to be in place as the wait is way too long for one sandwich.", "author": "Katie G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-07", "description": "Um, YUM!  Finally something delicious and worth the $. Gourmet, tasty, pleasant and engaging staff.  Still licking my fingers....", "author": "Sue S."}], "servesCuisine": "Breakfast \u0026 Brunch", "priceRange": "$11-30", "name": "Bread \u0026 Spread", "address": {"addressLocality": "Dumbo", "addressRegion": "NY", "streetAddress": "151 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/lB0yi8BzjgI3QbTxEexuuA/ls.jpg", "@type": "Restaurant", "telephone": "+17186252220"}