{"aggregateRating": {"reviewCount": 127, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-10-08", "description": "I normally do not write reviews like these - but I had to as I was so very disappointed and left HUNGRY!\n\nI was so looking forward to this sandwich so I waited on a \"cheat day\" to indulge myself in this sandwich.  I always walk past the store and it smells so delicious.  Flavors were great, preparation was quick, however, the sandwich was 90% FATTY so gross I could not enjoy the sandwich. I ordered the Porchetta.", "author": "N L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-30", "description": "Out-of-towner who stumbled upon this through web search and so happy I did. Such good sandwiches. We got the porchetta and chicken caprese and they were delicious. Went on a weekend and was barely anyone there so we got our food fast. It was hot inside so took the sandwiches to go. Also, not well marked from the street. Walked past it once and had to double back. Would go there again whenever I come back to visit.", "author": "Isaac L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-04", "description": "Phenomenal breakfast! We were in town for the holiday and wanted to try local spots. Found this gem of a hole in the wall. Got the turkey Bacon sandwich with the pepper jam and avocado. The ingredients were so fresh and you can taste the quality of the ingredients.", "author": "Xenia S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-18", "description": "I order a Turkey with bacon sandwich and it was absolutely perfect. You Can taste in every bite the fresh and tasty ingridients", "author": "Isabel L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-09-16", "description": "Food was great! But service was aweful they were very unprepared for a busy Sunday morning.", "author": "Traynor C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-08", "description": "I ordered the Porchetta sandwich and was told it would be a five minute wait. Absolutely fine, I checked out the wonderful stores next door and when I came back my sandwich was hot and waiting for me.\n\nOnto the sandwich itself. It was good, quite good. However, I think it was too heavy on the Porchetta (or too light on the veggie ingredients). The meat slightly overwhelmed the other ingredients and because Porchetta is so fat-heavy this made for a greasier sandwich than I was expecting. \n\nStill, it was a very good sandwich and I will be coming back to try their others!", "author": "Noah G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-27", "description": "Was at the 1EarthDay event held by the new 1Hotel in Brooklyn Bridge Park and chose the Bread \u0026 Spread booth out of all the vendors in the food area. They did not disappoint. \n\nI ordered the Porchetta sandwich because 1. I love pork belly 2. The combination of ingredients sounded AMAZING.  The sandwich comprised of thinly sliced kurobuta pork belly, pickled red onions, arugula, red pepper spread, and aged provolone on ciabatta bread. ENJOYED EVERY SINGLE BITE--I even came back around to tell them how much I loved it. Would love to visit their stand alone shop whenever I'm in DUMBO.", "author": "Jasmine Z."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-20", "description": "My boyfriend came here earlier this month and couldn't stop raving about how good the sandwiches he got here during his lunch break. As someone who loves food I had to try it out, sadly I work no where near DUMBO, Brooklyn and wouldn't be able to come since they are open during weekdays until 5pm. Since I was off today I came with him to have a bite, we decided to share both the Porchetta and Cast-Iron Chicken Caprese sandwiches.\n\nThe porchetta sandwich consists of pork belly, pickled red onions, arugula, red pepper spread which went very well with the meat might I add and provolone cheese on toasted ciabatta bread. I had never had anything like this in my life, I can see why my boyfriend wouldn't stop talking about it. By the time I finished my half of the sandwich I over heard the cashier telling people they were out of it. So people come early if you want to taste heaven on earth.\n\nThe chicken sandwich consisted of chicken breasts that is marinated with sriracha and red wine (for those who can't tolerated spicy food, don't worry I can't either but it adds a kick to it),    tomato, basil, balsamic and fresh mozzarella on toasted ciabatta. I called this one a little bit of Italy, I loved how well all of the ingredients went together on this one.\n\nThey are located within a center and it is not hard to miss it once you enter it, they have a small eating area if you are not in a rush. I wish we had something like this in Manhattan near my job, we can use something like this. They also offer breakfast sandwiches, soups, chips and various of cold drinks. \n\nIt was a beautiful sunny President's Day Monday and decided to get an iced coffee to go and sorry Starbucks, their ice coffee blows yours out the ball park.", "author": "Lisa R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-08", "description": "You know how sometimes you go wandering around and you just happen to stumble apon greatness, well i did and I was nothing short of amazed! This is an absolute hidden gem in the DUMBO section of brooklyn, if you're a sandwich person like me then you'll love this little shop.  \n\nThe actual location isn't easy to find which is part of the charm you would never expect to find such amazing quality in such a random place but thank god for YELP because 10 years ago no one would've found this place.  This is the kind of place that when you go the first time you will find a way to come back again from how good your sandwich was!   \n\nThe Porchetta sandwich really stands alone as a sandwich you wont find ANYWHERE so its the #1 must have, its shredded pork belly with tenderloin just perfectly seasoned with their homemade red pepper spread that went so well with the pork and the crispy toasted ciabatta bread was a great touch, but I cant possibly illustrate how good it is, when I had it I immediately thought to myself this is a work of art! \n\nTuscan Roast Turkey is the leaner version of the porchetta because all the flavors seem to explode in your mouth apon the first bite with a healthier feel to it, the sweetness of the cranberry sauce lingers in your taste buds which is just swell. what makes all these sandwiches stand alone is the fact they are as advertised Roasted and Toasted really makes the difference between a regular sandwich and an exceptional one, I really don't get how everyone doesn't do this simple task to all their sandwiches \n\nSince Bread \u0026 Spread particularly serves the lunch crowd in a financial district their hours are limited but this place is special and I fully expect to see more Bread and Spreads in the near future because its only right that the rest of New York city gets to taste these sandwiches not just this a bit secluded section of Brooklyn.\n\nI need to come back soon to try out their Chicken sandwich which is a top seller for them so adjusted review to follow!", "author": "Manny R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-30", "description": "A good sandwich. Filling. Paid for avocado, but they forgot it. I really needed aioli or something creamy in there.", "author": "Andrew K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-06", "description": "My boyfriend and I stumbled upon this place because of the freaking amazing smell that was coming from it. We got the porchetta sandwich and it was really good. The service was also really great. The employees were so nice and friendly!! The place is a little bit pricey but honestly it's so worth it. Highly recommend!!:)", "author": "Melody C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-29", "description": "bread \u0026 spread was a nice little sandwich stop before my stroll on brooklyn bridge. they had a     variety of meats but not many choices for veggies. the restaurant also offered bags of chips and bottled beverages. overall, the sandwich i ate (breakfast sandwich) was warm and tasted delicious, they also played good music.", "author": "Alexandra L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-12-06", "description": "Bread \u0026 Spread is tucked away inside of an office building to the side. It was pretty difficult to find. Owners seemed nice enough and I think we were one of the first people there. We didn't have to wait at all so that was nice. Our sandwiches were freshly made and it was easy to tell that they use quality ingredients. We had the chicken sandwich and the turkey sandwich and they were packed up nicely.\n\nJust a heads up-- the place is tiny and they have a few stools on which you can sit and eat but there isn't much space.\n\nFood was decent and clean but there wasn't anything amazing about the sandwiches in my opinion. I'd go back if I happened to be walking by but I wouldn't go out of my way..\n\nNote that I did not have the porchetta sandwich, which everyone seems to be raving about. So maybe that's why I didn't enjoy my food as much.", "author": "Sandra Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-10", "description": "Wow wow wow. Is all I can say. I was in the area and in the mood for breakfast so I pulled out my phone to Yelp of course and this place came up. I walked in and was a little confused as its a little stand tucked in a corner next to stairs that lead up to what seems like a working space. (Not a place for additional seating like I initially thought) The staff was really friendly and helpful with helping me decide what I wanted.  I got the most perfect sandwich that consisted of bacon, eggs, tomato chipotle mayo, cheese and avocado on wheat. I had to wait a little longer than I think it takes to make a sandwich but I was satisfied I think its worth it. I came here around 10 which really isn't a peak time, but if I decided to come back earlier or around lunch time I would probably call ahead to avoid the wait time. All in all 5 yelp stars.", "author": "Melissa S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-22", "description": "Probably the best breakfast sandwich I have ever had! Extremely nice guy who served me. They have basically have one sandwich with several different options (multigrain or ciabatta bread, different cheese, different bacon, avocado, different spreads). You are being asked what you want and your sandwich is being made freshly. So delicious!!!", "author": "Stephanie K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-02", "description": "I've gotten the Porchetta sandwich here twice so far and it's been perfect every time.  So dangerous to have this place close to my office bc now I crave it every time!\n\nCan't wait to try one of the breakfast sandwiches in the future. Tip-- def call ahead to order and it'll be ready when you arrive to pick it up! A bit hard to find since it's inside a little shopping mall in Dumbo but so worth the search.", "author": "Amanda H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-19", "description": "I've found this place last year. This place is hidden gem in dumbo area and best sandwiches shop. I always order porchetta sandwich  which is my favorite. Today I ordered carrot ginger soup too.it was also delicious", "author": "I K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-31", "description": "So. Damn. Good. We stumbled upon this place while looking for a quick lunch. We wanted more of a sit down place but there were 3 bar stools, so it worked out fine. No tables here is the only downside. Everything is made fresh and made to order. I had a veggie sandwich (can't remember the name) and it was incredible. Roasted veggies, cheese and whole grain bread. My boyfriend had a pork belly sandwich, which looked so good (it was) I had to try, even though I don't eat pork. Definitely worth a stop.", "author": "Emily M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-02", "description": "Best sandwich I've had in a long time. I had the Gardinera which had shredded zucchini and carrots in an aoili sauce on a multigrain baguette. I savored every bite. They prepare everyone fresh so you may have to wait but it's completely worth it. I believe you can call your order in over the phone.", "author": "Julianne B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-10-27", "description": "Booooo. Move faster. I could sit down and eat a three course meal at atrium in the time it takes to get a sandwich here. Also, foragers has better food.\n\nSorry they gave me the sandwich on the wrong bread too. Dropping from 2 stars to 1 star. Overrated.", "author": "Jonathan G."}], "servesCuisine": "Breakfast \u0026 Brunch", "priceRange": "$11-30", "name": "Bread \u0026 Spread", "address": {"addressLocality": "Dumbo", "addressRegion": "NY", "streetAddress": "151 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/lB0yi8BzjgI3QbTxEexuuA/ls.jpg", "@type": "Restaurant", "telephone": "+17186252220"}