{"aggregateRating": {"reviewCount": 127, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-21", "description": "When you walk into the building you could easily miss this place just by blinking. If you manage to keep your eyes open, you will not be disappointed. \nThe entire kitchen is the size of a large dinning table and there are only two young dudes who run the show. Very unique kind of establishment. \nAs far as food goes, there are only four sandwiches, soup, cold drinks, bags of chips, condiments and some granola bars. I am vegetarian so I had the Giardino. Comes with cheese buy you can get vegan cheese if you want. It was delicious! Stop by if you are looking for a quick bite to take out.", "author": "Isabela C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-17", "description": "Can confirm, best breakfast sandwich around.  Bread is the bomb.  Great verde == bomb.  Everything contains bomb", "author": "Brian S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-24", "description": "This was one of the best breakfast sandwiches I've ever had- eggs, turkey bacon, arugula, green verde sauce, tomato and cheddar cheese. It came out perfectly warm and the bread melted in your mouth. The coffee was also excellent- highly recommend.", "author": "Olivia B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-26", "description": "Came here on a cooooold winter day - the sandwiches are worth the wait. Excellent, warm, delicious. Come stop by dumbo and have one!", "author": "Vibhuti A."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-06-06", "description": "Limited selection of sandwiches, which wouldn't be a problem if the sandwiches were worth their value. I bought the cast iron chicken and the roasted turkey sandwiches, they were incredibly tasty but so tiny if you added them together they wouldn't be sufficient to feed 1 hungry adult. I feel like I just ordered 2 sandwiches off an expensive kids menu. I don't recommend you waste your money.", "author": "Caspian S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-21", "description": "This place is a gem in an otherwise unimpressive lunch environment in DUMBO. The porchetta will bring you in - really balanced flavors, great bread - and then the turkey is the surprise of the options. The chicken mozzarella is also very good, but probably the least interesting of the 3 sandwiches with meat.\n\nJohn and his team are very friendly and make it work with their small location. Very friendly and meticulous, the sandwiches can take a few minutes but they are well worth it.", "author": "Tom D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-18", "description": "OMG! Just tried it for the first time today! Yummy! I tried breakfast sandwich (eggs on a croissant with turkey bacon and some super-delicious spread) and I am going back for lunch!!!", "author": "Iryna S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-21", "description": "KILLER BREAKFAST SANDWICH. Artisan sandwiches, awesome banter and a brekkie sandwich that's totally addictive. An absolute must- make a trip to Dumbo just for this. You will not be disappointed! Ask for the green sauce- killer!", "author": "Melissa D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-26", "description": "I'm so glad that Bread \u0026 Spread set up shop in DUMBO. They're located in the entrance of what used to be rebar. \n\nThe sandwiches here are delicious. The porchetta is my favorite, but (this coming from an admitted carnivore) the vegetarian sandwich is outstanding. I haven't had their breakfast menu yet, but it smells so good when I pass by on my way to work. \n\nKeep in mind that during lunch the space is very small and the wait can vary in length (but it is worth it).\n\nOne thing that many people don't realize is that Bread \u0026 Spread caters. I had them provide catering for my clinic's anniversary Open House and all of my guests loved the food. I will definitely be going to them again for future events that I need catered.\n\nThanks for bringing quality food into DUMBO guys!", "author": "Noel L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-12", "description": "Today was my first time visiting this place. It's not really obvious from the street, and places like Dumbo Kitchen around the corner are more noticeable... but don't waste your money at a garbage dump like Dumbo Kitchen. Bread \u0026 Spread has a carefully curated selection of sandwiches and other dishes that will delight your palate without breaking your budget. The staff is incredibly friendly, they have a loyalty program (where you don't have to remember to bring your stamp card) and the food is great! The only main drawback is it seems like a to-go only sort of place. Well worth it in my opinion. Don't ruin your mood going to somewhere like Dumbo Kitchen and experiencing the horrible staff and food. Come to Bread \u0026 Spread instead!", "author": "James W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-24", "description": "The Porchetta is one of the best sandwiches I have ever had!!! I think it was rated the second best sandwich in New York but I would vote it first.", "author": "Josh K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-04", "description": "When I have the time on my way to work in the morning this spot is a must. Tucked away under the stairs it's very easy to miss. They make everything there in front of you so don't expect to be in and out fast. I've heard the lunch is bomb but haven't gotten to try it yet due to the fact they run out around 2 usually and I'm not home until way later. The fact they sell out is a dead give away this place is seriously a flavor explosion in your mouth.", "author": "Blake R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-05", "description": "This is a nice little sandwich spot on the first floor of the former Rebar. The sandwiches are amazing especially the pork belly. The prices are ehh but so is everything else in Dumbo. I will say, it is definitely worth it. Be prepared to wait a while for your order as each sandwich is made by hand very very carefully and there is only one sandwich maker. Also, if you take a late lunch, chances are they may run out of the pork belly...i'm just sayin' why would you order anything else.", "author": "Nicole J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-15", "description": "I just had a master piece of sandwich. I ordered pork belly sandwich that was life-changingly delicious. So much love and care dedicated to this work of art.  All other sandwiches looked divine. I will definitely come back here over and over.", "author": "Kaya O."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-19", "description": "I work in Dumbo and have done so, off and on, for about five years.  It's no secret that Dumbo is bad and expensive for lunch -- same for dinner, go figure!  But, Bread \u0026 Spread *may* be part of the solution!  Their only problem is speed.  \n\nI went there for lunch with my partner on a Thursday.\n\nFOOD: Fantastic! We had the porchetta and the vegetarian ('garden', I think they call it) sandwiches.  Both are excellent -- the vegetarian is even better than the porchetta, I would say: it involves a really well-balanced mixture of cooked/roasted vegetables (I think zuchini, carrots, and maybe artichoke hearts) and fresh vegetables (some kind of greens, avocado, and maybe tomatoes?).  The porchetta sandwich is a very good piece of pork combined with a fairly sweet jam/chutney -- truly excellent as well.\n\nThey roast up the meat in the morning, fresh, which makes it all excellent -- even the turkey looked good, moist (I will try it next).  They seem to have coffee and drinks and a huge selection of chips, which would be good for some people I suppose.\n\nPRICE: Reasonable for Dumbo: 8.75 for the Garden, 10.75 for the porchetta.\n\nTIME: Herein lies the problem.  I think more than fifteen minutes passed from the time we walked in to when we got our sandwiches.  There were two people already waiting (the sandwich man was already making their sandwiches).  That was it.  So the production time for just our two sandwiches was probably 12 minutes, possibly more.  This kind of wait will make it much less likely for me to make this part of my routine.\n\nOne possible solution is to call and order ahead, which they invited us to do: 718 625-2220.  I will try that next time.\n\nAMBIANCE: Nice people, fine takeout counter.  There is a little corner counter with stools where you can eat, but it is dark (the window is covered by security grilles).  Do this take-out.", "author": "George S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-28", "description": "Hidden in reBar, I didn't even know this food stand was there. I got the porchetta sandwich. It cost me over $11 and was just average sized. It was a pretty fresh sandwich though, and the meat wasn't dry, so 4 stars for now.", "author": "Mike C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-31", "description": "The small menu allows for quality sandwiches made with fresh ingredients. I literally watched the chef guy shave the carrots right in front of me. Definitely a go to when I'm in the area!", "author": "DL S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-08-19", "description": "Sandwiches are nice, service is okay depending on who you get. They tend to interchange their ingredients on the sandwiches depending on what they run out of, unfortunately they don't really tell you that they are going to do that which is pretty weird.", "author": "Simon D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-03", "description": "Just arrived from Toronto and couldn't have asked for a better welcome. I stumbled on Bread \u0026 Spread through Yelp and had the best veggie sandwich I've ever had. John was super friendly and you can easily see how much care he takes as a chef to prepare each sandwich just perfectly. As a Canadian, didn't hurt that he played hockey too ! Would definitely recommend this Brooklyn sandwich shop with style.", "author": "Megan M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-02-29", "description": "Be prepared to wait. Good sandwiches, but impossible to recommend thanks to extraordinarily inefficient sandwich prep.", "author": "Victor V."}], "servesCuisine": "Breakfast \u0026 Brunch", "priceRange": "$11-30", "name": "Bread \u0026 Spread", "address": {"addressLocality": "Dumbo", "addressRegion": "NY", "streetAddress": "151 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/lB0yi8BzjgI3QbTxEexuuA/ls.jpg", "@type": "Restaurant", "telephone": "+17186252220"}