{"aggregateRating": {"reviewCount": 127, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-11", "description": "Did not plan on eating here, but I had a meeting at the Greendesk offices in which this small restaurant is located. The scent...ohhh the scent...they make their sandwiches so fresh right there on the spot. I couldn't resist.  I have had the grilled chicken which is *%(#$*$\u0026$ .  Sorry bout that, lost control. The bread is fresh the ingredients are fresh, the sauces on point. I also had the porchetta sandwich also awesome goodness. \n\nIt's a bit steep for a sandwich at $10 and above, but I feel the quality you get and considering everything in Dumbo is pretty expensive this is a decent deal. It's not a sit down restaurant, but they have a few seats available. Bread \u0026 Spread is Definitely worth trying!!!", "author": "Stewie V."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-11-25", "description": "Interesting place ... stopped in for breakfast on a recent Sunday morning .... not a lot of options for breakfast in this area of Dumbo ... was greeting by friendly staff and made to feel right at home ... had the ciabatta with ham eggs cheese and tomato very good ... also good coffee... check it out you won't be disappointed", "author": "Gary M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-01", "description": "I ate the porchetta sandwich, which is pork belly, pickled onions, arugula, and aged provolone on ciabatta bread with a red pepper spread. It was absolutely delicious. Walking by, you wouldn't think much of this humble little eatery, but one bite of their food and that will change. Everything is made fresh, and you can tell! I will definitely be eating here the next time I'm in DUMBO.", "author": "M.M. K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-21", "description": "Great Vibe and even better sandwiches. The Chicken Caprese was tops. Get in here while the getting is good! I made my sandwich disappear. You will too.", "author": "Lou J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-18", "description": "Best cure for a hangover. Period.  These guys do such a fabulous job and what's more- always with a smile.  This is one of the best additions to the neighborhood in a long time.  Sandwiches are made to order and well worth the brief wait.  I usually come for the egg sandwiches but also enjoy the porchetta and the ban mi next door.  Love the pickled onions and the red pepper spread.  I wish these guys unbounded success.  They deserve it.", "author": "Kate B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-17", "description": "Came here for the first time and ordered the breakfast special \"big bear sandwich\" (eggs, 3 sausage patties, avocado, cheese, maple syrup, arugula) and the porchetta sandwich. Big bear was absolutely delicious. Porchetta was a little too much on the fatty side for me but still tasty. Would definitely recommend grabbing breakfast or lunch here if you're in the area.", "author": "Mary K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-08", "description": "This is my all-time favorite spot in the neighborhood. The owner cares so much about his food, I feel like I'm eating love and magic every time I have one of his egg or lunch sandwiches. \nI run a nonprofit a few blocks away and my staff knows me so well that they bought me a gift receipt to eat here for a week during the holidays.", "author": "Jessica M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-16", "description": "No complaints. They had a fantastic sausage egg and cheese sandwich. There coffee has fresh and very smooth taste.", "author": "Darren J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-10", "description": "The giardino is\nan exceptional veggie\nsamm I often crave\n\nDon't sleep on the soups.\nThe roasted veggie soup \nis one of my faves", "author": "Linda W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-16", "description": "Last day in NYC and I really wanted a good breakfast sandwich before I left. Found this place on google and decided to give it a try. This place hit the spot! I came in with my sister around 11am on a Monday and there was no wait. I ordered a sandwich on ciabatta with egg, arugula, turkey, Swiss, and chipotle mayo and it was DELICIOUS!! My sister had basically the same thing except she had multigrain bread, tomato and avocado (extra $). There's limited seating but since there was no one here we decided to stay and eat. They do have lunch sandwiches too so I would try those next time, if I can convince myself to not order a breakfast sandwich again :)", "author": "Tatiana L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-01-14", "description": "I am not a coffee snob, but when the coffee tastes like a dirty sponge was rung out in it, something isn't right. Stick to your breads and spreads, take coffee off the menu.", "author": "Aleeza K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-26", "description": "I really enjoyed the beef short rib sandwich, which had a good amount of meat. I'd come here again for sure!\n\nOnly negative would be that service was a bit slow, but that wasn't an issue for me at all since I wasn't in a hurry.", "author": "Johnny L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-27", "description": "Good food... but no love for the veggie folks.\n\nDespite having high-quality ingredients and very clever sandwich recipes, Bread \u0026 Spread shows little concern for vegetarian customers. I ordered an egg \u0026 cheese sandwich and watched the cook, fry-up pork and meat patties next to my eggs. He used the same flipper and gloves to make the sandwich. I understand it might be difficult to separate meat products and the grease fat from these items on a small griddle, but it would have been nice to see them make an effort. \n\nIn addition, I was charged $2.00 extra for a (1/4) sliver of an avocado.", "author": "John C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-09", "description": "Bread and Spread. \nNY BK DUMBO\n11:35pm Wednesday 9th November 2016\nFour Stars\n\nA small sandwich shop in a hidden shopping plaza, Bread and Spread is a great place for lunch. Their unique sandwiches are made to order so be patient and it will be worth the wait. The Sandwich was on the smaller side but it was packed with flavor. I had Cast Iron Chicken Caprese on Ciabatta. \n\nNext Time: Breakfast Sandwich: Two Eggs + Meat + Bread.", "author": "Leonard L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-16", "description": "It took 45 minutes to get 2 sandwiches. We almost missed our flight home. There were flies and it was at least 80 degrees inside. Only one guy working when we showed up. Not worth the wait and hassle.", "author": "Lauren C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-24", "description": "Was looking for a nice breakfast place before exploring Dumbo -- this was it!\n\nBreakfast food was well-made, quick and affordable. There are several sandwich customizations available too, so it does cater to different tastes.\n\nService personnel were friendly and pleasant. Overall a great place to be!", "author": "Dylan L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-25", "description": "Class little place in dunno, chilled out. I had a lovely breakfast bap. Good coffee. Highly recommend", "author": "Kevin M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-05", "description": "Life-changing breakfast sandwich from this great hole-in-the-wall, grab n go stand. Good coffee and service. We only tried the multigrain bread but confident that the ciabatta is also good. Let the guys help you build your sandwich to order. Very limited seating.", "author": "Jeff D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-13", "description": "Amazingly happy staff.  It's always a good sign when you see the staff happy. First time ordering here as I smell it practically every day walking by.  It smells amazing.  Made to order. I ordered the Part sandwich and it was superb!!!  Will be back to try the other sandwiches! This is as fresh as you can get!", "author": "Jennie L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-20", "description": "Great sandwich shop hidden away in Dumbo. The place had a great atmosphere with an enthusiastic staff. I got the chicken caprese and it was wonderful! Even with the lunchtime rush on a Tuesday service was quick and pleasant. Would definitely come back!", "author": "Reagan R."}], "servesCuisine": "Breakfast \u0026 Brunch", "priceRange": "$11-30", "name": "Bread \u0026 Spread", "address": {"addressLocality": "Dumbo", "addressRegion": "NY", "streetAddress": "151 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/lB0yi8BzjgI3QbTxEexuuA/ls.jpg", "@type": "Restaurant", "telephone": "+17186252220"}