{"aggregateRating": {"reviewCount": 127, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-01", "description": "Got the breakfast sandwich - was amazing. Fresh ingredients, nice and simple, crunchy bread, delicious red pepper jam. It's a super small place, everything is made to order, got a few stools. All this for like $7.5. Can't beat it!", "author": "Vic M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-01", "description": "Amazing! The food was incredible. I had the breakfast sandwich with turkey bacon, avocado, eggs, and Swiss cheese. Make sure you grab some hot sauce on the side! It's worth it to dip", "author": "Kareem A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-27", "description": "Was looking for a late lunch after blasting through some emails at Brooklyn Coffee Roasters. This little stand is inside another building right at the entrance. More accessible than a AAA battery from the television remote. The place stank of delicious breads and meats. I knew I had found heaven. 2 amigos were manning the counter and the were having a grand ol' time. Super nice and hospitable. You wait about 5 minutes for your mouthgasm to be served and then you inhale the entire thing in about 2 minutes. Hello sandwich, goodbye sandwich.", "author": "Michael B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-02-10", "description": "Visiting from out of town and walked 20 minutes here for a vegan breakfast and it is CLOSED!! The hours are posted on the door 7am - 4 pm Saturday.  It is 10:30am on Saturday!  Pas bon", "author": "Teshome N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-16", "description": "If you are ever in the Dumbo, Brooklyn area and want a delicious vegetarian sandwich, come to Bread \u0026 Spread and order the Giardino with the added green sauce! It's sooo tasty! I love the combination of veggies, very thinly sliced, lots of flavor, and the toasted bread is perfect! Lots of love to this place for their consistently great sandwiches :)", "author": "valerie v."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-04", "description": "Interesting place. Only in Brooklyn... I'm seeing these reviews about the Porchetta Sandwich and how great it is. I call at 8:15am and ask if they're making it at this time (yes, I eat like a maniac). The gal replies \"F*ck yes!\" Now, I love F-bombs, and this was the first time I've ever heard one in this context, so I hurried over.\n\nUpon arriving, I found the lady alone in her kitchen, and a customer waiting on a sandwich. I asked for the Porchetta, and she realized that I was the caller, and said that the only problem with it is that it won't be ready till 11am. It's possible she didn't hear me say the words \"at this time\" when I asked about Porchetta on the phone. It's also possible that I'm a victim of bait \u0026 switch. Either way, her F*ck yes turned into a big F*ck no!  \nAs I was walking away, she told me she'd make the best egg sandwich in NYC. I decided to go with it, support small business (especially a WBE), and cute my curiosity. In a small oven, she was heating up some ham, bacon, \u0026 turkey bacon. I went with the ham on Ciabatta bread with eggs fried loosely (she was good enough to ask how I liked the eggs cooked), and I had her add Chipotle mayo and cheddar. \nI think it's hard to turn such a commodity as an egg sandwich into \"the best in NYC\", but then again, you can't get any better than a perfect 10, so that puts her right up there with the best. \nThe only word to the wise I'd have for you if you want to try this place is to call in advance, be EXTRA CLEAR about what you want and when you want it, as the owner is very smart, a good salesperson, and the place seems to be run on a \"wild west\" fashion. \nI would also advise they give customers a napkin with their adorable little take-out baggie. \n\nIn all, if I'm in the area again, if probably return. Hopefully she won't spit in my food for this review, cuz I'm actually saying that the place is pretty darn good. I hope she grows with experience and succeeds!", "author": "Scott G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-02", "description": "Amazing! So delicious, definitely a must go before you go see the Brooklyn Bridge. The two working were really nice and patient when we ordered. And the food was great.", "author": "Johanna M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-18", "description": "Fantastic, satisfying sandwiches.  Call early if you want the porchetta (but the others are good too, especially the breakfast sandwich); also, call ahead to avoid a wait.  A little pricey but you get plenty of food, and the people are friendly.", "author": "Anna P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-13", "description": "the sandwiches are good but small\nfair in price but the take forever\ni don't mind waiting 25 minutes but some people might\nbest to call ahead and walk over 5 minutes after they say it'll be ready", "author": "Ray Ray P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-30", "description": "Sandwich quality is 5 star but the environment ----- leaves a lot to be desired. We went there this morning based on high Yelp scores. Were a bit thrown when we walked in by the setup but perceived that after our sandwich was prepared, we could go upstairs to sit and eat. Wrongo!!!  The ONLY place to sit was by the door on one of three bar stools with a  ten inch deep counter facing a wall - and half of the undercounter was chuck full of stuff that the kitchen would need. \n\nThey should tell new customers what is going on. We would have walked down the street to one of the many other places serving breakfast. \n\nAgain, breakfast sandwich was great\nEnvironment for enjoying that sandwich - terrible \nOwners/staff - very nice but need to tune into what non- regulars might be expecting.", "author": "Jeff P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-09", "description": "First time here and the girl at the counter was super excited to explain the menu and offered great descriptions of the food. Small menu but huge on flavor! Super delicious! It's a great place to take a break from exploring DUMBO and grab some yummy food! Next time I'm in NYC I'm stopping in again.", "author": "gabriela b."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-23", "description": "¡Ofrecome! \n\nPorchetta sandwich. ¡Omaigaaaa!\n\nI just had my first one yeaterday  and it was absolutely delicious!! I added avocado to mine and it was perfect.  Go get one.  You wont be mad... unless its the next day and you want another onebut live too far to get it.", "author": "Sarah C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-29", "description": "Great sandwich made fresh in front of you!\nIt's worth the wait.  Porchetta is my favorite.", "author": "Wataru I."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-17", "description": "Yes, best place in Dumbo. This small place is very consistent and their sandwiches taste great. Wish they were open late.", "author": "Daniel F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-15", "description": "When standing outside the doors of 147 Front we thought the place was shut down. So we asked a guy passing by about an other place to go. It turned out the guy was the owner of Bread and Spread and the place was up and running behind them doors.\n\nWe ordered the signum Proscetta and the turkey sandwich and wow did we like it. Fresh black coffee with it and we left really satisfied.", "author": "N A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-24", "description": "Any place can slap together a sandwich, but Bread \u0026 Spread makes it with love!! The resulting sandwich is greater than the sum of its parts!\n\nMy favorites are the breakfast sandwich and the chicken sandwich. Ingredients always fresh and yummy. 100% worth the wait.\n\nAnd they are kind and friendly and remember your name if you go a bunch.\n\nI work in DUMBO and believe me there are very few lunch options! This is easily my favorite. \n\nEasy to miss so keep your eyes open and go inside and try it!", "author": "Kasia N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-19", "description": "A new addition to Dumbo featuring gourmet sandwiches, grilled cheese and local coffee. Everyone seems to be raving about their porchetta sandwich and customers have given this delicacy its own name - \"The Sandwich.\" Seriously, when I took a bite of the crunchy ciabatta bread with the sweet jam sauce, I felt foodgasm for the first time, if not in. a long time. Although the place is small, it is cozy, warm and the staff is friendly (the owner is a cutie too). I am glad I was able to put my mouth on one of the best tasting sandwiches ever! Oh, I also think the sandwich deserves its own hashtag. #porchetta", "author": "Carol W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-27", "description": "Made to order sandwiches, the roasted meats are amazing. The spreads are really flavorful and definitely differentiate the sandwiches from others. If I lived closer to the area, I'd go everyday.", "author": "Michelle C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-07", "description": "Sandwiches are very delicious and worth their price. They have a nice selection of beverages and chips to compliment your sandwich. The only main problem here is that their kitchen is too small. It can take up to 20 minutes to get your sandwich, but I think that maybe part of the beauty of this place. Its so small and unassuming that the food is worth a wait, especially when it is that good.", "author": "Isabela C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-11", "description": "Had the Porchetta sandwich and it lived up to the hype.  Well-made and super delicious.  Only criticism is the wait time.  I almost missed a conference call due to the wait at 1:30pm.  So a head's up upon wait time after ordering would have been super helpful.  Otherwise looking forward to trying some of the other options.  And will definitely be back for the Porchetta.", "author": "Jiffy I."}], "servesCuisine": "Breakfast \u0026 Brunch", "priceRange": "$11-30", "name": "Bread \u0026 Spread", "address": {"addressLocality": "Dumbo", "addressRegion": "NY", "streetAddress": "151 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/lB0yi8BzjgI3QbTxEexuuA/ls.jpg", "@type": "Restaurant", "telephone": "+17186252220"}