{"aggregateRating": {"reviewCount": 364, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-04-13", "description": "As the previous review mentions, my friend and I ordered the steak and were sorely disappointed. I'm no snob when it comes to meat; I'll eat Filet mignon or a McDonalds cheeseburger and enjoy them both, but for a $25 steak it was barely edible. I left the last half of it on my plate because it was very rubbery and very little flavor. I know it wasn't because it was medium rare; that's my preferred way to have a steak and I also enjoy beef tartar and other raw dishes from time to time. This particular batch of steaks might just have been bad, I don't know.\n\nOn the more positive side, the fried broccoli was pretty amazing, as were the fried pears that came with the steak.", "author": "Nick A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-25", "description": "I went here on a whim with a friend that lived down the street, and we had the option of expensing the night out. So I'm thinking, \"Heck Yea, good food for no money!\" Though as soon as we sat down he mentioned that he was \"Chasing the Dragon\" with this place. The first time he came here, the meal was everything you could have asked for and more, but ever since then it has never been that great. I can see that... the Menu is fresh and innovative, and probably changes often, but you really only get a few options.\n\nLike another reviewer said, I am torn between 3 and 4 stars. If not for the really attentive service, I would have chosen 3 because of the extremely limited menu.  You really only get five or so dishes to choose from, so if you're a picky eater, this place is definitely not for you. For the price of the entree, I would have liked at least seeing some type of beef. \n\nFirst thing's first, the bread and dipping sauce was extremely delicious, the cucumber salad... also very excellent.. so good that we asked for another round of the bread/sauce/cucumber combination.  \n\nHe ordered the Arctic Char, and I was extremely jealous. I ordered Fried Eggplant and Tofu (and by no means am I a vegetarian, but I don't go to a nice restaurant to eat chicken as I cook it for myself often enough in  week... sad huh?) The Char was AWESOME. The Eggplant was good, only the vinaigrette that was poured on it was rave-worthy.\n\nI wish that we had tried the cocktails, but we opted for a bottle of wine instead. If you go there, try the Whore Water, and tell me how it is. I laughed out loud when I saw that cocktail's name.\n\nWe ended the meal, with a spin on a Pineapple Upside Cake, which was good, but again.. nothing to rave about. (Maybe cause I can make a mean pineapple upside down cake.)\n\nOverall, I thought it was a nice dinner, but I would really think of checking out the menu before sitting down  again to see if anything tickles my fancy.", "author": "Jess G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-01-04", "description": "Lessons learnt eating at this place:\nNo.7: A bad tip is a statement on your poor service performance.\nCustomers: Always be specific with the tip amount and total amount so that they can't diddle with it afterwards!\n\nHad dinner here with a friend a week before Christmas. The food was ok, we shared the fried cauliflower starter (variation on the broccoli?) which I thought would be intriguingly crispy and excitingly spiced but unfortunately it turned out to be just heavily battered fried cauliflower - pretty oily and which softened pretty quickly and became unappetizing. There was something that my friend had heard about that she wanted to get but the waitress said they didn't do that anymore, but didn't proffer any recommendations which already made us feel she wasn't going to pay us much attention.\n\nUnfortunately our instincts were correct. The rest of the meal was forgettable and overshadowed by incredibly SLOOOOW service. We were actually hoping to eat fairly quickly and head over to a Christmas party but the service here was responsible for us never making it that party! We were sitting in the back and it felt like people sitting at the front or the bar were looked after better. I think our waitress was too busy floating around on a cloud and looking cute. After a while we accepted that fact and decided that we should just relax and enjoy the ambiance, which this place is quite good at, and ordered cocktails halfway through our meal. I think it took over 10 minutes to get our drinks by which time there was nothing to eat it with since we had pretty much finished our entrees, and our grace had pretty much evaporated. \n\nAll of this would be forgivable except for the fact that I checked my credit bill today. Obviously we left a low tip (15%). I totaled a nice round number only to find that in my bill the restaurant had decided to embellish that a little - not much but enough to make me blackball this dodgy place in the future and to my friends.", "author": "Sharon W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-04-15", "description": "I came here last night with my boyfriend to celebrate our anniversary. For our first date we came to No. 7 and decided it was only fitting to come back again. I love coming here for dinner or a couple of drinks. My friend and I have a tradition of coming here New Year's Day...it's a great place to nurse a hangover, sitting at the bar, looking out the big windows (I realize this is a theme for me, but I like looking out big windows). And I love the cozy neighborhood vibe. Please note that I don't live in the neighborhood but it makes me wish I did.\n\nThe food always has an interesting Asian twist...last night was no exception. I got the bibb lettuce salad with a perfectly cooked egg and the fluke sashimi appetizer. For entrees we had the char with fermented black bean and springy vegetables. Crispy and delicious! The hangar steak was hands down the best pick though. The leek mayo that came with this was solid. We had the fluffer-nutter dessert which was peanut buttery and yummy.\n\nLater I ran into some friends who got the Broccoli tacos and fish sandwich from the bar menu...I couldn't help but take a bite for future reference. The fries are always great and so were the two dishes. I was telling them how I had just coincidentally gone to No 7 Sub for lunch two days earlier. That place is really awesome too. Short Rib Sub. Yes. Please. Thank You.", "author": "Anita C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-07-10", "description": "My family was in town and one of my dad's friends suggested no.7 for great meat.  Having eaten there once before I didn't remember it being a big steakhouse and my parents love big steakhouses.  I suggested Peter Luger to them instead because being midwest people my parents like a big juicy steak.  My mom wanted to try No. 7, so we went and were so glad we did.\n\nMy parents ordered the steak entree and I had the chicken.  They were all well seasoned and cooked to perfection.  Every dish had so many different and interesting flavors that blended together, it was like a party in your mouth.  The fried broccoli appetizer was amazing!!!  The restaurant is also fun because the chefs come up with new and exciting things every few months.  \n\nThe night we came we were fortunate enough to sit next to the executive chef and owner's parents.  He came out to say hi to them and chatted with us for a while as well.  At the end of our meal he graciously sent us over some free desserts, which are all hand-crafted pastries that were amazing.  Try the ginger snaps, they are a bit spicy and if you eat too many you'll start to notice a tingling in your mouth.\n\nDefinitely some of the most flavorful and well thought out and executed food I have had in a long time.  My mom said it was the best steak she has ever had.", "author": "Monique B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-14", "description": "Ok I went back \u0026 it's totally a different place. Bartenders are nice \u0026 attentive. Great happy hour \u0026 delicious broccoli tacos. A little crowded on the weekends but I tend to go during the week \u0026 it's pretty chill", "author": "k m."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-23", "description": "A little on the pricey side, but this is one of my favorite places in Brooklyn. Delicious and creative cuisine.  Wonderful atmosphere.", "author": "Martin L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-10", "description": "Broccoli Tacos are so good. I have been craving them non stop!", "author": "Stacey W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-03-12", "description": "I had been looking forward to going to No. 7 ever since moving to Clinton Hill.  Then, I had the pleasure of going to No. 7 Sub in Manhattan and my expectations doubled.  (The Short Rib, Sweet Potato, and Marshmallow sub is unspeakably good.)  So, I was excited to go to brunch there and try it out.\n\nThen I read the Yelp reviews and saw all the negative comments.  Yikes! Maybe I shouldn't be going there after all, I thought.  Have I made a huge mistake?\n\nTurns out, I have no idea what restaurant all the one-star people are going to, because my friend and I had a wonderful time.  The brunch was delicious--I highly recommend the fried fish with egg and guacamole.  Oh man, it was good!  Plus I had a couple of the cocktails made with cucumber vodka, they were so refreshing.\n\nThe decor was great, the service was friendly, the prices are very reasonable.  I don't understand the negative reaction this place seems to get?  Is it because its \"hip\" and people recoil at that?  I say, if you're on the fence, go for it!  Try it out with an open mind.", "author": "Tyler M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-07", "description": "Maneuvering around a flight of steps down to the C train we entered the crowed lounge of No. 7. A loitering line five couples deep blocked our view of the dining room so I sent my BF to find out what kind of wait we had in store... he returned with a 30 minute estimate and a cocktail menu. Scanning the list I fumbled over the effervescent Lambrusco and into the Mango, Cilantro, Chipotle Vodka, Sparkling Lime cocktail ($11). The chipotle lingers like undercooked taro (but in the good way) and the cilantro fills the nose with every sip, but the sweetness (or lack thereof) from the mango was inadequate to tie the libation together. I was only 15 minutes into my drink when the hostess came over to tell us our table was ready.\n \nAlthough we sat at what is probably the worst table in the house - next to the bread station and bathroom hall - we were happy to be seating at all and we had a direct view into the spiffy bright white kitchen where the red bandana headed chef bobbed back and forth. We were immediately presented with crusty bread and, be still my heart, a warm gooey white bean fondue and delicately thin and crunchy quick-pickles http://www.yelp.com/biz_photos/eybrq-0U5suwVtjWJPCaqw?select=GnvcWJNzPntKAFpFj_nMfQ When the waitress came over I said (with a friendly wave of my hand) \"bring us every vegetarian dish\" and then chugging my drink \"and a Lambrusco!\" Our table was promptly filled with 3 appetizers and a cool glass of wine -our waitress warned me it was a sweet bottle, which I loved despite the resemblance to Welch's and day old club soda.\n\nI was eager to get the \"famous\" Fried Broccoli ($7) in my mouth http://www.yelp.com/biz_photos/eybrq-0U5suwVtjWJPCaqw?select=Ly_gn_LvjiX7eowusGUSIw but I was sorely disappointed. From what I gather this is a middle of the country state fair kind of delicacy, and so if you grew up with this I'm sure No.7's is fabulous; but this girl grew up refilling the ice bath for lacy tempura and so, to me, this dish tasted like a heavy over battered tempura. The Apricots \u0026 Frisee Salad ($9) http://www.yelp.com/biz_photos/eybrq-0U5suwVtjWJPCaqw?select=PKdaR5MAhKL7KBo7o6ZRsg  was also unsatisfactory; the Frisee was crisp but covered with a dull pasty dressing and the apricot was borderline mealy.  But but but... the Pimenton Smoked Mozzarella ($10) is what (my) dreams are made of http://www.yelp.com/biz_photos/eybrq-0U5suwVtjWJPCaqw?select=WzH3K3QRhQqcv0B4FHCa4w The bowl pools with thick smoky cheese under crispy fried artichoke hearts with an unidentifiable \"lemon\" crumbled thing on top. The icy white \"lemon\" is sweet and bitter with the consistency of... I don't know... bizarrely cooked potatoes... and pairs perfectly with the cheese.\n\nAfter a short break, we shared a plate of the Pecan Crusted Tofu ($17) http://www.yelp.com/biz_photos/eybrq-0U5suwVtjWJPCaqw?select=XtgLJPZyAKgPANwZVuXuKQ which bares a notable likeness to filet-o-fish. I stared into the large ramekin of tomato wedges in slight horror, sad that such a significant proportion of this plate was a vegetable I don't particularly care for. But as I ate the otherwise dry tofu I figured out the tomatoes act as a fabulously deconstructed sauce. The broccolini was marvelous, the inherent bitterness tempered by the rich sweet sauce, and light-years more scrumptious then the fried broccoli. The potatoes were vaguely gummy; I'd like to believe because of cheese and not over beating, but it was still otherwise pleasing. \n\nAlthough full, we were not leaving without tasting one of Amanda Clark's desserts. None particularly jumped at me, and so the waitress recommended the Buttermilk Pudding ($7) http://www.yelp.com/biz_photos/eybrq-0U5suwVtjWJPCaqw?select=xNyxuh2UNkzkC0R3G-l58w It was a perfectly light on in the stomach and not too sweet finish to a filling dinner. Though I felt the pudding could have used a touch more cumin, I could have eaten an entire bowl of the \"pie crust cookies\" served on the side.\n\nBut I must say the most memorable element of the evening was our waitress. Her warmth shone though the entire dinner with frequent check-ins, hardy recommendations, light conversation, and laughing at my stupid jokes. At the end of the meal I felt like I was leaving the house of a good friend and that I should have given her a hug for being such as wonderful host... instead she asked if I had a blog (gesturing at the large camera) and I shied away 'cause I ain't got no renown... it was only afterward I realized she was most likely the fabulous Meg of HeiferstoTrough just excited to meet fellow food enthusiast...", "author": "Kelly B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-04", "description": "fried broccoli! a sin and a good deed at the same time. \n\nI stopped in this place while i waited for a haircut next door. the first impression was pretty positive. I looked towards the back and instantly wanted to invite some friends and sit under the skylight to shoot the shit. it's very chill.\n\nmy appetite kicked up after a brew or two, so i ordered the fried broccoli. amazing. It was similar to a tempura battered veg from any Japanese place, but it was seasoned well. it even had a creamy cheese layer between the batter and broccoli. its served on a black bean compote that is absolutely killer. i wasnt too thrilled about the greens it came with, too oniony (as my gf would say).\n\nlike i said its a chill place. the bartender was pretty cool, i struck a convo with a regular who was cool, and they keep their drafts on rotation.. which is cool", "author": "Devon L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-04-02", "description": "When more than one person describe the cuisine as unfocused,  you know you have a problem.\nDishes are a hit or miss, service is so so. With so many great places around in Fort Greene, why to risk a disappointment?", "author": "Antonella P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-29", "description": "Very elegant. Drinks are on the pricey side, but they're pretty delicious. Tom Collins here was maybe one of the best I've ever had.", "author": "Alexis G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-21", "description": "I dined with Katie B. for her boyfriend's birthday dinner (her review is below, which is why I mentioned her by name - clearly you don't know me or my friend or her boyfriend).  I quite enjoyed my dining experience at No. 7.  When dining with a group, it can be difficult to find a place that meets everyone's needs (diet, budget, location, size, etc.) and No. 7 is a crowd pleaser.\n\nI'm giving the place 4 stars instead of 5 due to the combination of some small factors.  First, the entrees, while good, were completely out-shined by the appetizers.  I shared a delicious fried egg with pork and sampled the popular fried broccoli, and even enjoyed the complimentary bread with melted cheese and cucumbers.  The arctic char I had for the main course was not bad, but it was undercooked (though not inedible).  And the fish was served with the skin on, which had nothing to do with the taste.  I just prefer not to look at fish skin on my plate for the rest of the meal.  \n\nFinally, three of us ordered espresso @ $3 for dessert and were served a teaspoon each.  I know espresso is served in small doses, but we all thought our portions were silly.\n\nHowever, those were merely slight annoyances in an otherwise lovely dinner.", "author": "KL S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-03-02", "description": "What number are you while you wait...\n\nThe place is not the easiest to find took some time I even got lost for five minutes. Once you get in there it had a feeling for me like I was eating in a mom and pop barn that got converted to a restaurant. You get seated at this table which is so close to the table next to it that you try to squeeze by and not knock anything done. When you sit you get to hear other people's conversations, which is sad. \n\nAfter looking over the menu you place an order for an appetizer and wait about 10 minutes for it to arrive.  After you eat it in about 15 minutes your main course comes out and you look at the plate and you are like that is it that is what I paid for.  The food is not bad the food is ok but when you try to sit there and enjoy the conversation while you eat it is impossible. The noise and everyone sitting next to you and listing to you just makes you not want to talk.\n\nThough the host person is nice there is like one for the whole restaurant, which makes it impossible for you to get waited on. There is no way you can sit there and wait for like 10 minutes to get water a check and everything else. Though the food was not that bad, and the decor is ok, I would have to think it over if I would want to go back.", "author": "Michael J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-22", "description": "I was really pleasantly surprised with the space, the service, the drinks and the food.  They were very accommodating because we were supposed to be 7 people, 4 of us showed up on time and 1 person joined us later, while 2 ditched and they weren't at all upset with us, which is really nice late on a Saturday afternoon!\nThe Bloody Mary, Mimosa and watermelon sangria were all yummy.  The coffee comes strong and frangrant with refills.  Yay.\nAs for the food, mm, scrumptious! The nan bread and eggs concoction was innovative yet simple and approachable.  The english muffins with fried broccoli, cheese and eggs were the winners tho, as honestly, they were just perfect.  The hot sauce and ketchup are great with them as well.  We finished with a waffle and donuts to share and both were perfect.\n\nWe will so be back for dinner, as everyone seems to love that menu as well.  Overall, yummy!", "author": "Lama B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-15", "description": "I went there yesterday expecting a decent meal. We got so much more. The flavors in every dish we had were just really fantastic and worked so well. Overall very good food, very nice staff, great atmosphere and they even had all wine bottles half off (each Wednesday they say). I don't live in this hood, but will come back very soon to eat here.", "author": "Jojo T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-04-10", "description": "Really enjoyed my meal here.  Comfort food with a twist.  \n\nI had the chicken with mashed potatoes and kimchee chips - awesome.  Perfectly cooked.\n\nAlso had a jalapeno whisky drink which was great.\n\nThe only thing that was really off was the cheddar apple tarte.  Tiny and dry.\n\nGreat service and great atmosphere though.  Will definitely be back.", "author": "David H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-09-10", "description": "I have issues with bar menus and restaurants that only serve \"small plates.\" Most of the time, I'm so disgusted that I'm paying $7 for a tablespoon of quinoa with lime (ahem, General Greene) that I can't enjoy it. BUT the bar food at No. 7 totally surpasses any other bar food menus at finer restaurants that I'm willing to give the whole genre another chance.\n\nA few friends and I sat at the banquette in the bar area and when the $7 fries came out, we were shocked at the massive amount that came heaped on a giant platter with generous ramekins of balsamic mayo and ketchup. Really tasty and crispy shoe strings too. \n\nThe fried broccoli is a breaded entire head with a pleasant hint of sourness from a grapefruit spritz. Like tempura, it got a little soggy after a while, but it was still delicious and fun to eat. You won't find measly florets at No. 7.\n\nBeware, the cucumber cocktail is strong and somehow smelled like an organic furniture polish to me, but it still tasted great and unlike any cocktail I've had before (and I've had a few...). \n\nI would knock off one star due to a grumpy bartender who scoffed when I asked him about an $8 cocktail menu listed on Menu Pages (apparently not available) and the fact that they included \"Heinz ketchup\" as one of the accompaniments for the fries. Doesn't it go without saying that any self-respecting restaurant wouldn't serve anything but Heinz? But I forgive No. 7 for those isolated lapses into pretentiousness and give it a full five stars to encourage others to enjoy its inventive food and comfortable atmosphere.", "author": "Sara H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-10-15", "description": "I used to love this place, but it has become pretty mediocre based on my meal on Saturday night.  There were no specials, the menu is getting tired and the food was just ok.  There a lot of good restaurants in this neighborhood - this used to be one of them.", "author": "David C."}], "servesCuisine": "American (New)", "priceRange": "$11-30", "name": "No 7", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "7 Greene Ave", "postalCode": "11238", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/lt-w9NOIuTSmE73S6_jLew/ls.jpg", "@type": "Restaurant", "telephone": "+17185226370"}