{"aggregateRating": {"reviewCount": 364, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-01-14", "description": "Never have I had such high expectations for a local restaurant and been more disappointed. With that being said, I give this place two stars for location, ambiance, and consistently filling my water glass. \n\nIt was a Friday night and this place was packing em in. The bar was packed as were the tables in the dining room. The waiter came over and told us that there were no specials tonight (disappointment #1).\n\nOur order:\nApps\n-fried broccoli\n-grilled endive salad w/ cashews, frisee, and Cheddar?\nEntrees\n-stuffed cabbage with fish\n-short ribs with peekytoe crab\n-chicken\n\n\nThe salad was tasty but over dressed and the cheddar cheese was just put on the plate as an afterthought. The flavors did not make sense to any of us at the table.\n\nThe broccoli was bland at best and the broccoli was mushy inside the thick layer of batter. I am not sure what so many reviews are raving about. It is broccoli deep fried. Maybe we had a bad batch?\n\nOnto the entrees...\n\nMy chicken was a mess to be kind. The chicken is done well, but when they reconstructed it, they left in bits of bone and cartilage that I did not enjoy. Otherwise, the chicken tasted fine.The mashed potatoes were the best thing on the plate by far, but why they added the rest I am not sure. I did not enjoy the VERY spicy and unappetizing Lychee Kimchi that was ALL over the other items on the plate. Those flavors got everywhere and made it impossible to eat. To add insult to injury, there was a 1/4 of a head of cabbage on the plate that tasted as though it had been braised for hours in potpourri. NOT VERY GOOD. So, the chicken was a no go and two of us ordered that.\n\nThe short ribs were over salted, so my partner was really disappointed with that. He always cleans his plate, but not at No. 7.\n\nFinally, my friend had the cabbage. She tasted all our food and reported that hers was the worst. It was way too fishy and the rice was mushy inside. The cabbage was also impossible to cut through. The best part of her dish was the little side of roasted potatoes they offered. \n\nSo, the potatoes were the biggest hit of the meal.\n\nIt is a sad experience we had at No. 7. We live on a budget and go out one night a week. It sucked that for our one meal with NO drinks we still paid $80 a couple for food that we could have done without.\n\nMaybe brunch is better, but I do not think i would ever go back to No. 7. I was left with a taste in my mouth that this was another tale of a Brooklyn restaurant trying WAY TO HARD. Oh ya, and the taste of potpourri.", "author": "Pamela S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-03", "description": "This place is awesome everytime we go.  We have done several dinners and brunch here.  We love it so much we had them cater our engagment dinner!  They normally don't do catering but made special accomidations for us.  The process was so nice and Katherine was SUPER helpful witht he entire event.  \nThe food there is always changing with the seasons which always makes return trips fun.  I highly recommend this joint for any small occasion.", "author": "Philip E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-21", "description": "I love this place.  They combine ingredients together that I'd never think would go together in a million years.  What an experience!  The inside just looks so cool, too.  High ceilings, low lighting, big booths, retro flooring, ivy.   Just GO!", "author": "Jackie S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-10-18", "description": "Came in here with friends late on a Friday night, absolutely starving. Just, starving. And this place delivered. (Not literally. We went to the restaurant. I just mean it brought its A-game.) Anyyway, highlights of the meal were the drinks (so fast!), the food, (so fast! so delicious!), and the atmosphere. I had the grilled bologna sandwich off the bar menu, which actually took me by surprise. Surprise! I mean, when I ordered, I did not expect to get a giant 3/4'' thick slab of bologna on a bun with a fried egg, feta cheese, and picked red onion. Seriously. Legit. Also, my friends and I got the french fries to share, and holy crap. Not only were they amazing, but there were so many! We barely made a dent. I am rarely in the area, but I may be back soon, to come here. Because seriously. 3/4'' slab of grilled bologna.\n\nAlso, apparently after we left, Kyra Sedgwick walked in. So there's that as well.", "author": "Stephanie J."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-08-21", "description": "I'm gonna have to agree with Tina M. on this one. The only reason I'm giving it 2 stars is because the atmosphere is nice and my cocktail was interesting and tasty, other than that, I felt like the menu was a huge joke. Reading the descriptions of the dishes, I thought to myself \"none of this makes sense, it sounds awful, but hey it has to be good, why else would they pair chorizo, watermelon and green olives?\" I felt like someone was watching me from a distance and laughing at me while i ate crappy food and payed for it. And now reading the reviews, I feel like everyone is drinking the kool aid except for me and Tina M.  \n\nWe also had the fried broccoli. I don't know why I thought anyone could make sense of grapefruit, dill and black bean sauce. I was expecting small fried florets of broccoli but instead we got a huge hunk of broccoli that was battered and deep fried with some salty creamy goo inside. Gross. The grapefruit and fennel just sat over some greens with dill on the side. Booooring. \n\nThe vegetable terrine was the biggest disappointment of all. How do you mess up a stack of beautiful summer vegetables?? Again, salty creamy fontina was absolutely overwhelming and just killed the freshness of the vegetables. The creme fraiche was so unappetizing after having that salty goo coat my tongue for the rest of my meal.\n\nThen the scallops, what the hell was I thinking?? They weren't even whole scallops, first of all, and they sat in a cold cucumber broth with watermelon junks, pieces of green olives and a blanket of grey chorizo on top. Need I say more? \n\nThe dessert wasn't gross but it definitely didn't live up to the name. Malted chocolate pudding cake with root beer chantilly really meant 2 tiny fudge brownies with a tear drop of rootbeer cream. Womp, womp. \n\nI'd probably return for a cocktail at the bar, but definitely not the food. There were people waiting to be seated on my way out and I wanted to tell them how horrible it was, but now i can see, most people are into this stuff. What did I miss??", "author": "Cregsty B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-05-03", "description": "This place is amazing. I've been coming here for years, and the food is always fantastic. I usually get steak or one of their sandwiches, but tonight I got confused and ordered chicken. Chicken?! Chicken is usually so boring, but this chicken was a revelation. It was all baked, but it tasted all fried!  Thank you, No. 7, for reinstating my faith in poultry. \n\nAlso, the service is great. Don't believe the grouchy hipsters who claim otherwise. I'm decidedly uncool, and the staff here is always lovely.", "author": "Molly B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-17", "description": "Tastebud tingling bespoke cocktails, healthy adult-sized pours of wine for a decent price, and well-portioned entrees in a cozy dining area make me understand why this is one of my Brooklyn-based BFF's favorite dinner spots. \n\nWe started with drinks at the bar (I had the Raspberry Pepper Tequila and it was an intriguing taste sensation, but I only ordered one), waiting for our third party to arrive, and mulled the notion of the shared seating up front; some would shy from dining with strangers, but get a little booze in us and everyone's a new friend (whether they like it or not). However, our third arrived and we were escorted to a tiny, cozy little table against the massive shared booth in the back. It was comfortable and intimate without being cramped, and even on a rainy day the skylights and candles provided plenty of mood lighting. It got fairly loud as the place picked up, but not unbearably so.\n\nThe drinks and food are a good price for the portions you get: no tiny, empty white space plates here. I got the hangar steak entree and it was juicy and fall-apart delicious, without a saucy overkill like so many places like to do. Tasty deep-fried sweet potatoes and arugula rounded the whole dish out nicely. It was clean, simple, and extremely flavorful.\n\nService was dodgy at best, however, as I came to learn is mostly SOP in NYC. We got some serious attitude from our server about splitting our check (seriously, what is the deal?) but in the end she came through with three separate tickets. Clearly, it was not that difficult after all, and a hearty tip ensued. Fancy that.", "author": "Leigh H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-18", "description": "I've eaten here maybe a dozen times. The food is inventive and well-executed. Sometimes, too inventive. That said, I was often surprised by their combinations and how they made it work. The place really tries new things and doesn't have any real safety dishes. Don't take a picky eater here. Take someone who loves to try new approaches to old dishes and brand new interpretations. Their bread and bean dip are so much better than the standard butter or oil and bread at most restos. This place really revolutionized the kind of restos that open in Fort Greene and Clinton Hill.", "author": "Ashley J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-30", "description": "Went to brunch here yesterday.  The place is \"charming.\"  There were a lot of cool people, but cool in a charming and sweet way.   The people were attractive, but in a wholesome and charming way.  \n\nI had the fried chicken.  Said fried chicken certainly deserves a place in the NYC Fried Chicken Pantheon.  A great crispy crust and well-seasoned.  I will return, but for now, based on this very good fried chicken and the overall charm of the place, I'm giving it 4 stars.", "author": "Josh G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-14", "description": "Upon visiting again, I didn't find the food to be as absolutely amazing as the first time. It's still good, and it's great for a drink after BAM, but I'm thinking of it as \"really good neighborhood spot\" now.", "author": "Adam R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-06", "description": "one of the best restaurants in the area. Broccoli is fantastic, fried chicken is very good. Drinks are smooth and strong.", "author": "Sabina H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2010-06-07", "description": "Yucky! \n\nI went with a group of friends Sunday for brunch. This place is overrated. I am still in shock with the high ratings. I love the location - next to the Lafayette subway station. The hostess smiled \u0026 was very personable.. We were seated immediately and noticed an empty restaurant. Figures. We were served water in dirty glasses..  My friend visibly saw lipstick on two of the five glasses on our table. Ew. \nThe food is trash..for lack of better words. We ended up ordering the fried chicken \u0026 pineapple salad since we didn't see anything appetizing on any other tables . I will never return.. The blonde haired waitress was  horrible \u0026 uninattentive . As we finished eating, she brought the check immediately.,  Very bad dining experience ..Let's see how long they last . Never again", "author": "Jul B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-06-08", "description": "Chicken was too salty even for me. And I usually cover my fries in salt instead of ketchup. \n\nFried broccoli was oily but good. \n\nMedium rare steak was definitely tough and chewy. \n\nThe service was quick but they kept coming and taking our dishes away before we were done with them and tried to rush us out the door. \n\nThe only word that comes to mind is OVERRATED. It seems like a certain food critic got a free meal...", "author": "Bobby C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-23", "description": "Love the broccoli tacos and the $3 each happy hour deal for them. Really awesome drinks. My favorite may be the Solid Gold, which is sadly no longer on the menu. Luckily they have a nice beer selection as well.", "author": "Sue Z."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-10-13", "description": "Any place that has broccoli tacos is a-okay in my book. The feta and pine nuts, along with the broccoli, are just a fabulous combination. Plus, they are an inexpensive way to eat something wonderful for dinner. \n\nI also kinda love the fried broccoli, the fried chicken sandwich, the kohlrabi-egg sandwich, and the scrambled eggs. The fries are shoe-string thin and great for sharing. \n\nWhat I love most about No. 7 is that the dishes often include ingredients I would never think to put together. Most of the time, the results are inventive and delicious. Sometimes they don't work out so well, but even then, I generally enjoy exploring a new flavor combination. \n\nNice cocktail list. I wish I liked their wine selection more.", "author": "Sarah P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-04-16", "description": "With lackluster food, No. 7's feet are firmly planted in the terrain of the overhyped.\n\nWhy this place was mentioned in Bon Appetit is beyond me.  I was excited to try a place in the hood that might just might live up to its reputation and arranged to meet some friends here for drinks and dinner.  The best part of my dining experience was the complimentary bread and warm beany spread at the beginning.  Everything else was an absolute waste of time, money, and appetite.  What a disappointment for Fort Greene!\n\nThe evening began at the front with some drinks--I got a glass of wine.  The wine was served in a sticky wine glass with water droplets all up in the interior.  I'm no wine connoisseur, but surely pouring wine into a wet glass doesn't do the bouquet any favors.  \n\nMy party ordered the (apparently requisite) fried broccoli appetizer, which was edible but not worth rave reviews.  The batter was essentially tempura batter, so when you order this, know that you are getting a giant piece of broccoli tempura.  Since it's hard to get fried [x] wrong, when you take a giant stalk of broccoli and fry it, it's going to taste fine.  For tempura lovers, this would be a dream come true.  For the rest of us, blah.  \n\nI had some kind of fish entree which I can no longer remember.  All I recall was that it was bland and unadventurous--nothing special whatsoever.  My companions had the soft-boiled fried egg (edible but forgettable) and some vegetarian entree consisting of Asian noodles with pico de gallo (a combination that didn't quite work and seemed to be trying to hard to be novel). \n\nWhen dessert time rolled around, none of us could be bothered to even consider their attempts at sweets.  Check, please.  \n\nTo its credit, the space can be a good meeting place for a handful of friends, there wasn't a wait at 8:30-ish on a Thursday night, service was courteous, and the bathroom was clean and smelled nice.  If the most expensive thing on the menu were $10, this place would be worth trying, but as is, onto the next one (like Jay-Z says!).", "author": "Mia C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-04-21", "description": "I appreciate the laid-back atmosphere. It's much less pretentious than I expected. No suspender sporting or old timey music playing. In fact, they were playing the Exploding Hearts, which was awesome.\n\nThe fries are perfect. Little crispy, golden bits everywhere, and the side of some crazy brown mayonnaise concoction was so delicious. A large ($7) is Very large. My friend got the unusual broccoli tacos (broccoli, feta, pinenuts in a crispy corn tortilla, cradled by a soft flour tortilla) and she said they were really good. \n\nThe drinks ($11-$12) unfortunately, leave much to be desired. They were all watery, and there was absolutely no depth of flavor. The descriptions made my mouth water but the product did not deliver. The pepper tequila drink got most of it's flavor from the salt and pepper rim, as the liquid contained a watery, slight sweetness. The jalapeno bourbon felt really dull to me also, but my boyfriend liked it and rarely is anything spicy enough to satisfy my ravenous maw, so my opinion on that drink should likely be void. Finally, I had the grapefruit vodka cocktail. Once again, the sugary tart rim carried the whole boring drink. \n\nSince No. 7 is an attractive and comfortable place to hang out and the food appears to be good- I'd recommend going there as long as you're not a cocktail drinker.", "author": "Sara M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-01-08", "description": "SALTY SALTY SALTY.  It is such a nice space and convenient spot I wanted to like this very much.  I think they should stick with simple pub food and beer and lower their prices.", "author": "E K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-07", "description": "Terrific.  \nGet the fried broccoli.  It sounds weird, and you might even say, \"if i'm going to break my diet, do I really want to do it for broccoli?\"  And I hear your concern. But yes.  Yes you do.\nWhat will arrive at your table is a whole head of broccoli, battered and fried and it will be mind alteringly amazing.  Ok, well maybe minus the mind alteration.  But it's so good you might just think it's laced with something \"special\".\nThe mussels appetizer and egg were also great hits.  The beef was spectacular - a great cut, perfectly cooked, and the tofu entree was also quite good.\nThe desserts were a bit of a miss.  I wouldn't bother with them next time and would instead splurge on an extra order of broccoli.  \nSeriously, folks... I am replacing dessert with broccoli.  Maybe it really is mind altering.", "author": "Katie Z."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-04-24", "description": "Well, after heading into Brooklyn from a night out of celebrating in the city, a small group of us wanted to have a few more drinks before calling it a night, and we ended up here.  There's a small seating area in the front and in the back there's a larger space where diners are seated. We already ate so it was just drinks for us.  \n\nWe sat in the lounge area upfront because the bar was packed.  The atmosphere here seems mellow and it was a nice crowd.  And while the cocktail menu looked interesting we weren't particularly blown away when we had our drinks.  \n\nMy friend, who we were celebrating that night (wedding/birthday), did some bartending in the past and has been known to mix her friend's a cocktail or three (SMILE) at her place.  After taking one sip of our cocktails at No. 7, we all looked at each other like we should have gone to our girl Lady Mix-A-Lots' place for some drinks with wow-factor--oh, well.  Sometimes, we expect too much, either that or my friend has spoiled us.  \n\nWell, maybe the food is better at this spot.  Unfortunately, I wasn't moved enough to come back and try to find out.", "author": "J M."}], "servesCuisine": "American (New)", "priceRange": "$11-30", "name": "No 7", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "7 Greene Ave", "postalCode": "11238", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/lt-w9NOIuTSmE73S6_jLew/ls.jpg", "@type": "Restaurant", "telephone": "+17185226370"}