{"aggregateRating": {"reviewCount": 364, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-24", "description": "A solid standard Fort Greene spot. Consistent and hip; great bar scene. Creative flavor pairings with the menu....", "author": "Anders C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-08", "description": "I crave the broccoli tacos and the fish tacos. Also, that hot sauce is totally drinkable. Delicious food, unfussy, laid-back vibe.", "author": "Renee I."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-08", "description": "Oh shitties this place is the BOMB. Delicious sandwiches/entrees (i only wish the menu wasn't always changing bc i want to reorder the same thing), great ambience for brunch or din, good looking brooklynites, yummy cocktails, nice staff, natural sunlight bc of skylight, good vibe all around. Did i mention the food is delicious?  Thank u no 7. Ps if u r in the city and need a fix, there is also an outpost in the lower level of The Plaza hotel at 59th Street and Fifth Avenue.", "author": "Ro S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-03", "description": "Was looking for a brunch spot last Saturday and was turned on to Number 7. Good thing, because the place is so unassuming I walked by it twice. (It's located right behind the subway entrance.)\n\nThey opened at noon and we were the second table seated. The staff were very friendly and took our order efficiently. The breakfast menu breaks down into eggs (7 choices) and pancakes (3 choices). I'm an egg lover and was very happy with Lazaro's Revenge (odd that the waiter said it wasn't spicy --- most restaurants mean exactly that when they use the word \"Revenge\", at it was!).\n\nI loved that you could order individual pancakes as sides, which was great b/c I had my 6yo with me and they don't have a kids' menu. \n\nThe place got full pretty quickly. A very relaxed, happy clientele --  a couple of big groups having lazy birthday celebrations.\n\nMenu-wise, I thought it odd that fresh fruit wasn't on offer. Besides that, I was very happy to be turned on to 7.", "author": "Ally G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-11-06", "description": "No. 7 is a great after work happy hour spot. The ambiance is nice and the service is good. The waitresses are attentive and the bartenders are nice. After being here several times I've only encountered one \"too cool\" hipster waiter and he really wasn't so bad. The drinks are good and the bar is always nice and lively with a great mix of people. \n\nThe honest reason why I am giving no.7 2 stars is because their kitchen ventilation system is absolutely awful. After I leave, my coat and bag smell like grease for days. Their kitchen is in the center of the restaurant as opposed to the back like most conventional places, so the stove is right there, stinking up a storm! The second you walk in, you get hit by a strong smell of grease. It's a real bummer and quite frankly, I'm tired of my belongings wreaking. I may lay off no. 7 for a while until they get better ventilation. I'm almost tempted to call their manager to share my concerns...", "author": "Dusty A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-30", "description": "I walked in there a few days ago with a date, looking for a hot cup of apple cider.  We asked the waitress and she informed us it was only available as part of the brunch menu.\n\nDisappointed, we started walking out when the waitress called for us.  Apparently, the manager saw us leaving and asked why.  After she found out we were looking for apple cider, she offered to go out of her way and serve it to us herself.\n\nIt's little things like this that makes customers come back to get a full dining experience.  My date and I were so impressed and touched that I guarantee you I will be back there soon.", "author": "Jason C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-02-28", "description": "When they first came to the neighborhood, I'd walk by and not stop in because it seemed to be a bit pretentious. After a while, friends started going here and I decided to give it a shot. Came for drinks a few times but had my first meal recently. \nCame for brunch with some friends a little while ago which was good, not amazing...it was quite empty for Sunday brunch so we were seated right away. I had the broccoli tacos and my friends had the fried fish and eggs, everything was good (not great). \nThe staff wasn't very friendly or welcoming but that's kind of what I expected...i'd come back for drinks at the bar but not sure i'll come back for a meal.", "author": "Emelyn O."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-03-15", "description": "Pros: Two words: BROCCOLI TACOS. They are amazon (albeit super salty because of the feta). Also the seating area near the front is cute.\n\nCons: Mixed drinks here are awful, so don't waste your money. Go with something bottled. Brunch was decent but not amazing. \n\nVerdict: good place to meet, have a beer, a broccoli taco and then move on.", "author": "Alexandra F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-23", "description": "the bohemian feel of this place is reminiscent of european hangouts;  more specifically the kind you find in st germain in paris.  superb food and service add value and credibility, perhaps to the \"should i say:\" lucky number seven.\n\nmy friend and i enjoyed the food and wine immensely.  delicious!", "author": "Fernando G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-12", "description": "I came to the one at Urban Space on Vanderbilt Ave.  Will start by saying that I am not a vegan or a vegetarian.  I had the basic standard veggie burger which comes with pickles, griddled onions and ketchup.  I ordered mine with no ketchup and added cheese.  Really, really tasty.  The bun was soft and fresh and the whole burger was just aesthetically pleasing!  I also ordered the Brussels sprouts at the suggestion of the cashier and they were outstanding.  Beyond delicious.  I literally spooned the leftover sauce into my mouth.  Definitely felt 100% satiated after this lunch.  I'm a fan.", "author": "Amy R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-29", "description": "This place is known for its broccoli tacos and fried broccoli. Definitely get at least one of those.\n\nthe pork schnitzel was massive and the cheese burger was above average.\n\nwould definitely go back\n\n1 drink + 2 apps + 2 entress + tip  = $86\n\nnot bad", "author": "Jason F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-13", "description": "This place is wonderful. Great cocktails, and the food is good too. I came in tonight after a very long day and the bartender stayed open 45 minutes late for us! And offered wonderful banter the whole time, what more could you ask for? Sorry for being so obnoxious pauly shore, thank you for the hospitality.", "author": "Mollie D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-10-01", "description": "The place has a pretty nice salon style ambience towards the front with a more traditional restaurant look in the back. Service was alright, but basically the menu seemed like it was just greasy fried food, but prepared in a classier style. I had the vegetable tagine-- it was basically couscous with several massive balls of tofu. There doesn't seem to be much below the surface of No. 7.", "author": "Mike M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-19", "description": "One of our favorite Brooklyn spots for dinner and brunch for many years. Great and interesting food - delicious and a bit surprising. The combinations of ingredients and cuisine are often a bit peculiar but 9 times out of 10 the result is awesome. The menu changes seasonally but there are a few classics you can always get, like the incredible Broccoli Tacos. (Definitely get these!) Also, if you're vegetarian, there is always one entree option and multiple starters/sides. The bar up front is usually crowded at happy hour because the cocktails are great, the bar menu covers some of the best items, and the specials are decent. It's also a good spot for brunch - it opens on the late side (noon) but the options are more interesting than standard brunch fair - our favorite is the Fried Eggs and Nachos.", "author": "Miriam G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-11-17", "description": "Listen, I am a huge advocate for this place and frequent both the Fort Greene and Greenpoint locations. The food is bomb and the drinks are amazing.\n\nThat being said, there is a bartender here that has WAY too much attitude. I have had very pleasant experiences here EXCEPT when this individual is behind the bar. He is rude, disinterested and smug. It's very disappointing as it makes me want to find a new go to spot.", "author": "Caroline S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-04-09", "description": "Meh. I've experienced better. \n\nMy beau and his close friend went out to eat here tonight. I had the swordfish and they both had the steak. My swordfish was OK to chew on, however, I felt like it was flavorless without the dipping sauce they provided on my plate. \n\nMy beau and his friend both ordered the steak ... and hated it. They could barely chew on it and described it as \"rubbery, gummy and too chewey\", aside from the tasteless factor. \n\nThe fried broccoli was amazing ( then again, what fried food isn't amazing? ) and the potatoes au gratin were pretty good too. Drinks were decent, I had red wine and the boys had bourbon and beer. \n\nIt was a nice time because of the ambiance and the company however, after we saw our check (which was more like my zip code) we decided its probably not goof enough to come back to.", "author": "Maya T."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-10-27", "description": "No 7 was temporarily closed by the Health Department almost a year ago and they have never managed to recover.  It's the saddest thing to happen to my girlfriends and me who used to live for their food and tasty cocktails.\n\nDon't go here.  [cries]", "author": "Amber P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-05-12", "description": "The bar staff was unnecessarily haughty and rude (5/9/14), ignoring me for 10 minutes as they helped people who walked up after me.  I eventually gave up since I couldn't even get them to glance at me or hand me a drink menu.  When my friend finally managed to get an order in, the drink and food were merely average.  Also: No AC on a very humid night.  Would it kill them to turn up the ceiling fans or open the windows?  We were drenched in sweat when we left.  Never again.  There are so many other options, No. 7 is more like No. 97.", "author": "C. J."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-06-08", "description": "As others have written, No. 7 has a nice ambience and a really convenient location.\n\nBut there are some key downsides that, as a Ft. Greene resident, make me inclined to stop into other bars rather than come here. \n\n1) The wine selection...They've got a bunch of wines, and I've tried several, but none (IMHO) are particularly good. Especially given that wine tends to run $7-$10 a glass; I'm not shelling out unless the wine is worth it. \n\n2) The kitchen doesn't open until 5:30. So if you come here on a Saturday afternoon, hoping for a drink and a snack while you do the New York Times crossword puzzle...you'd best go somewhere else. The food I've had has been very good, but I wish I could get some damned fried broccoli at 3:30.\n\nChange that, and it'd be a 4-star spot.", "author": "Katie E."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-01-15", "description": "\"Nice space\". That's the first thought that came to my mind after I stepped in the venue that has the G train exit/entrance right outside their door. Nice, clean decor and relaxing  dim lights. The bar was kind of crowded when we got there (around 9ish) and people were apparently tipsy because half of them were all blocking the hall way which leads down to the dining room. I don't have any problem with people's standing space in a narrow hall space ( we are in nyc after all) but please be aware of the traffic and let people pass. (Yes, you!!... I repeated \"Excuse me\" thrice, each time louder and you still didn't move an inch)\n\nThe staff/service here is attentive and polite. Their wine selection are mostly for bottles, very few for glasses. I have heard that their drinks are good but wasn't in mood for alcohol that night.\n\nI ordered the Wild Sea Bass which was pouched and M. had the chicken with cabbage. Food was good but sadly we we were not blow away. Both of us had better dishes at the same price tag.\n\nI loved my entree's serving size. It was just right, 3 small fillets with clam broth and a =real= one serving size bowl of rice. (When you finish it you don't feel stuffed although it might leave room for dessert.) The dish was clean, lean and simple. I liked it a lot. Good presentation too. M's dish was on the bland side and portion wise was big.\n\nI wanted to order the Tofu entree but I couldn't bear the thought of paying more than 16 for a soy protein dish. I (Asian) grew up having tofu as something that is such a plebeian food that is easy accessible, nutritious and plain cheap... I have a hard time paying up that much unless it is infused in truffle oil or have shaved jamon serrano on it. \n\nOverall No. 7 is good. Will come back for drinks but for food... I will probably take my wallet and tummy elsewhere.", "author": "Isabella W."}], "servesCuisine": "American (New)", "priceRange": "$11-30", "name": "No 7", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "7 Greene Ave", "postalCode": "11238", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/lt-w9NOIuTSmE73S6_jLew/ls.jpg", "@type": "Restaurant", "telephone": "+17185226370"}