{"aggregateRating": {"reviewCount": 364, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2019-02-05", "description": "Tip: There is a large bar and some seating near the front door. There are also pub tables which are part of the dining area (generally no drinks alone at those tables). If you want to be part of the dining area, you generally should have a reservation and should likely be having food.\n\nNote: We had a small billing issue and Tyler took care of it 100%. \n\nI am a Manhattanite and I keep thinking brooklyn will be less pricey than NYC, but that is often not exactly the case. \n\nGood vibe.", "author": "T T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-03-11", "description": "Did some research on this one before inviting friends out to brunch...\n\nTip #1: make a reservation...this place gets crowded for Sunday brunch and I am happy I booked on OpenTable in advance! It was amusing to bypass the smug faces and eye rolls I encountered when we were seated as soon as we walked in! \n\nTip #2: ask for alcohol...sure the drinks already come with it but watered down doesn't even begin to describe it. My Bloody Mary was spicy tomato juice and my friend's (first) mimosa was basically OJ. We spoke up on round two and that was quickly remediated.\n\nTip #3: strawberries, cheese and fish just don't go together--skip the fish tacos or try being proactive with your requirements. I was also still very hungry after finishing mine so ended up buying a side of fries to fill me up. One friend of mine got the shrimp and grits...it was ok but I give No. 7 a 5 star rating for creativity with the dish--it looked like a bowl of ramen! The real 5 star (apparently) was the steak and fries; according to my friend \"it was the best steak and fries meal I've ever had in my 42 years!\"--that's a heck of compliment!\n\nI won't be back, there are just too many great options in Brooklyn! \n\nP.S. the booth tables in the back need to get fixed...our table was bent, we were fearful our plates would slide.", "author": "Nina S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-01-11", "description": "I got the Broccoli tacos and they were amazing! It came with only two which I thought was not going to fill me up but it was actually so filling I had to force myself to finish the second one. My friend got the vegetarian burger and said it was also very delicious.\n\nSuper cute spot. Quiet atmosphere and very dim lighting, so great for a date night or dinner with a close friend. Definitely recommend.", "author": "Anndi L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-05-07", "description": "Came here for a Sunday lunch. I heard the fried chicken here was great so that's what I ordered. When the chicken came it looked perfect and the skin looked very crispy. But when you take the first bite you are underwhelmed and disappointed. The pieces of chicken were not the juiciest and the meat lacked flavor. All the flavor was in in the skin which was a disappointment. The cocktail I had was great. Would come again but maybe for drinks and another dish on the menu", "author": "Andre O."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-05-05", "description": "Wow, what a cute little brunch spot. Dropped in here with two friends for a casual brunch in Ft. Greene and was pleasantly surprised. The interior is very well decorated and the back portion of the restaurant has two skylights which creates a bright and welcoming atmosphere. I imagine on a cold snowy day this would be a cozy place for brunch or a drink. Ok on to food/drinks. Our cocktails and beers were all delicious and wonderfully done, we were even given a free drink on the kitchen (pssst thanks!). Food was very tasty, I had the corned beef Reuben with broccoli which I was a little nervous about but turned out to be very good. Their shoestring fries are AMAZING. The two critiques of the food we had were that the Rueben needed a bit of acid, without sauerkraut I was left wanting just the slightest bit more, and my friends commented that they wished their fried chicken was a tad bit crispier. When it came to pay we had some card issues but the staff was so kind and attentive they worked it out easily. Would definitely stop back in when I come to Brooklyn next.", "author": "Patrick T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-28", "description": "No 7 is a bit hidden, literally directly behind the C train entrance which makes it feel so very NYC to eat there:) The space has a bar in the front and a dining area in the back. It is spacious enough to feel like you can have an intimate conversation without being overheard. \n\nWe were here on a Sunday night, so it was rather empty. The service was attentive, friendly and prompt. Everything you could ask for. The atmosphere here is dim and rustic. \n\nI totally went for it with my entree choice and got the friend chicken sandwich which had spicy maple syrup, mayo, fries and a pickle. Though totally horrible for my ass, it was a pretty heavenly combination. The infusion of syrup gave it just the right amount of sweet and savory balance. My date had the pan roasted arctic char, which from my taste of was also wonderful. It came with roasted fennel, golden squash puree, cherry tomato salad. Overall we really enjoyed our dinner here and will be back for sure.", "author": "Renée G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-11-15", "description": "This place never disappoints. I like the ambient lighting, which makes it great for a date or a cozy dinner with friends. The food is always consistent and reliable, especially their specialty - the broccoli tacos. I can't come to No 7 without getting them - they're THAT good (we've tried making them at home, and it just wasn't the same). I am also a lover of thin, crunchy French Fries, and No 7 is probably my favorite place in the NYC area to get them. YUM!", "author": "Nicole C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-15", "description": "We came hungry and cold , left full and happy:)\nLick the plates. Fried broccoli  appetizer, Cheese burger, French fries and pickles top that with some Moscow Mule made with fresh Ginger ale and You will be one happy camper;)", "author": "Tanya P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-01", "description": "Great spot to have a few drinks by the bar, restaurant looks Amazing, unfortunately we were there pre-concert and did not have the time. I wish I had more to say but just a drink and the bathroom was my experience. Hopefully I can update next time I am in the neighborhood!", "author": "AnnMarie N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-20", "description": "I had a great brunch here today. I was unsure how it would be because the reviews are mediocre and I found the sandwich shop to be just okay. The menu looked good, so I went for it anyway. They take reservations, which I love. They sat my large party immediately. The server was very nice while still seeming sincere and not stopping by too often. I started with the Rosemary Limeaid. It didn't really taste like rosemary, but it was delicious! I ordered the fish tacos and they were delicious and HUGE. I would definitely order again. My boyfriend and I split a pancake and that was pretty good, but nothing special. I will absolutely be coming back for brunch again.", "author": "Jordan M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-15", "description": "My partner and I came for Valentine's dinner, as we'd been once before and enjoyed it, but upon arriving it was found that someone had incorrectly taken our reservation. It was a bummer, but I've honestly never been treated so kindly by a business in this type of situation. We were instead seated at the bar and the manager \u0026 entire staff made sure numerous times that we were being accommodated for the inconvenience.  Living in NYC I'm used to things going wrong unexpectedly, but I'm not used to people actually caring about the customer as attentively as No 7 did. The bartenders were extremely friendly, and the waitstaff made sure to help me find options that were in line with my vegan diet in a non-judgemental way. \nThe food was almost as amazing as the service (not quite sure which was better!). My partner and I opted for a pre-fixe menu, which usually means the place cuts corners to get you out quickly, but we've rarely been so satisfied. The broccoli tacos are so tasty, and it's always a relief to find options that work with my dietary restrictions that aren't just fake-meat. My partner raved about the quality of the shrimp, and said the steak was one of the best he's ever tasted. If you like hot sauce, definitely try their house made version. No 7 is a definite hidden gem of Fort Greene, and we were already making plans to come back!", "author": "Mary C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-21", "description": "This post is belated but I booked No. 7 for my company's holiday party back in December and the team there was easy to work with and communicative the entire time. Planning with them was a breeze and when it came time for the party, it went off without a hitch. Katherine's menu suggestions were all on point and everyone loved the food. They created a customized drink menu for us and printed it out day of, it looked great and everyone LOVED ordering them! Those touches, along with wonderful service and flexibility of Katherine and her team made the whole planning experience a dream and the event itself a blast. I heartily recommend No. 7!", "author": "Beth W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-27", "description": "Came here for brunch with a few  friends. The staff here were great, attentive and accommodating. \n\nFood here was okay. Nothing fancy nor filling.", "author": "Mai J."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-12-15", "description": "Service sucks. Number 7? More like number 2. I like the food but the staff are really lazy. I'm sorry but if you can't bring our bill over to our table (she called us and left it on the bar) then how do you want us to give you 5 stars? And we also shouldn't need to call you over every time we want a drink", "author": "Rachel K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-12", "description": "what's a bad option here?\n\nive dappled from burgers to steak to broccoli tacos and ive never been disappointed.", "author": "Meagan W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-08", "description": "I love no. 7. It's a wonderful neighborhood restaurant and I often go for brunch. They take reservations, which is great as most places near me do not and it's hard to get a table. I love the pancakes and those I have gone with love the other menu items. The coffee is great as is the service. I highly recommend it.", "author": "Miriam B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-15", "description": "Nice American bar and restaurant, and really good service too. I had the veggie burger and it was really good. I also got free tacos for yelp reward.", "author": "Julia S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-02", "description": "Great happy hour - unexpected menu - really delicious, fried broccoli tacos, egg drop soup - really awesome!", "author": "Dre F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-17", "description": "Everything awesome. That braised pork shoulder...heaven. Calamari..bliss. You won't be disappointed. And the people Working there are angels. Love it!!", "author": "Toyia P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-24", "description": "This place seems to be a bit confused about what vibe it's going for. Conveniently located literally RIGHT next to the Lafayette Ave C stop, this restaurant features a substantial bar area where people basically don't talk to each other while they nurse their drinks either on the bar stools or the lounge near the entrance. \n\nThe inside seating area opens up underneath a massive sun roof and windows strategically placed at the highest point on the wall before it's basically just ceiling. The decor is typical New American (aka wooden paneling, shades of brown and more brown, and white walls). It's sort of romantic at least when the restaurant isn't packed, but then, once it does become packed, it becomes rather difficult to have a really substantial conversation.\n\nOn the plus side, though, the food is really REALLY good. Yelp reviewers suggested the double decker broccoli tacos, and boy, were they a good choice. The black bean hummus was savory, the broccoli was tender, and HELLO can you ever go wrong with tacos? We also had the General Tso's grilled chicken sandwich (that sauce was SPICY and definitely...not General Tso's but it was delicious so, however questionable that name is, redemption exists) and the cheeseburger. Solid solid solid.\n\nWe also split a bottle of Verdejo because on Wednesdays, bottles of wine ARE HALF PRICE. Bring a date, order a bottle, and you won't even care that they give you candles for your table before the sun has set while you're sitting directly underneath the sun roof.", "author": "Kristen L."}], "servesCuisine": "American (New)", "priceRange": "$11-30", "name": "No 7", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "7 Greene Ave", "postalCode": "11238", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/lt-w9NOIuTSmE73S6_jLew/ls.jpg", "@type": "Restaurant", "telephone": "+17185226370"}