{"aggregateRating": {"reviewCount": 364, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-25", "description": "My love affair with No. 7 started at The Plaza where they have a tiny outpost that churns out delicious items like the Broccoli Tacos (which really do taste much better than they sounds) and the amazing General Tso Chicken bowls. I was so impressed that on my next trip to Brooklyn, I made a visit to the full restaurant. The space is beautiful and welcoming and very close to BAM (perfect place to grab dinner or drink before a show)....it was busy but the host was attentive and got us a table asap. Food was excellent, you can't go wrong on this menu. The Brussels sprouts are notable, the broccoli tacos delicious as ever and my friends thoroughly enjoyed the burger. Service is really great, even though it was busy, they hustled to provide great service. We loved the meal and glad we came!", "author": "Estina R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-10-13", "description": "Though our server was quick, friendly, and even jovial/amusing at times, we were underwhelmed by the food here at No. 7 on a recent Friday night. We were seated promptly without a reservation despite arriving at around 7:30 PM, and our beers and food came out within 15 minutes: fish tacos with pickled strawberries, fried broccoli, and sesame Brussels sprouts. None of the food blew us away. \n\nThe fish tacos did get a nice punch from the strawberry pickles, but they still needed a few generous dashes of No. 7's self-labeled hot sauce to make the flavors come together (and make the flavor of the fish less prominent). \n\nThe fried broccoli surprised us. We were thinking it would be more like a broccoli tempura, but instead it was one big ole hunk of broccoli, coated in what seemed like cheese and then heavily battered and fried. We definitely didn't remember seeing the cheese on the menu, so lactose-intolerant folks might want to check in with them before ordering. \n\nThe Brussels sprouts were rated \"meh\" by my boo, even though he loves Brussels sprouts and generally enjoys them wherever he can get them. I agreed. The sesame dressing was a bit too vinegar-heavy, leaving it too tart for my tastes. \n\nOverall, the beer list was decent, the service was great, and the place overall had a good romantic/date-night feel despite the presence of a big group of friends + child seated at the round table nearby. But the food could use some improvement.", "author": "Lauren B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-23", "description": "Stopped in here with my family at Christmas and was pleasantly surprised! I got the veggie burger with fries; the food was heavier than I usually order but very satisfying, especially after being out in the cold all day. Our servers were great, and we were seated pretty quickly considering the size of the group. It was dark with a sort of polished brass, foggy mirror, 1920s cocktail vibe. Would be a great place to go for a drink or date.\n\nOh, and it is *literally* on the subway, right above the C train exit.", "author": "Ellen E."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-03-12", "description": "I don't normally accuse people of being racist and hoping that they are not. I'm Asian. \nI came here alone, was waiting for the host to talk to me. And she saw me but just ignored. Later, three Caucasians came, and the host took them immediately...  \n\nWhen I confronted the host about me being there first, she mumbled a little bit but how I looked disengaged. Why do you think I was standing there alone? Did I go inside and stand by the bar so NOBODY acknowledges me? \n\nFeeling so awful and actually pretty sad.. disappointed about how I was treated.", "author": "Hyein K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-10", "description": "Initially signed up for this howaboutwe date just for my fiance and me, but with my dad's visit and multiple failed tries on rescheduling, we decided to have a couple + 1 dinner date. \n\nThey were very accommodating when we called an hr before our reservation to change from 2 ppl to 3.  When we arrived for our reservation, the place was already packed especially near the bar area. We were seated towards the back corner in the dimly lit dining room with the very comfy seats. It took a while for us to grab our waitress' attention to explain our menu. We were given the option to choose 1 appetizer, 2 entrees, 1 dessert, and 2 drinks from the entire menu. Since we just visited a Indian buffet for lunch and I just got back from a yelp elite event in the UES, I thought the deal was enough for the 3 of us to at least start off for dinner. \n\nThe food menu was not too extensive so it didn't take long for us to decide. We ordered the fried broccoli to share, steak for my fiance, and pollock and squid for my dad. Although my dad and my fiance aren't much of a drinker, the cocktail menu was very interesting so they knew they had to try a few - Pink Sybil and Gold Standard. \n\nMy fiance and my dad both found their drinks to be really strong yet tasty. The appetizers came out soon after with an order of complimentary sourdough bread with white bean butter and picked cucumber. The fried broccoli was literally a whole head of broccoli straight from the grocery store. With a light crunchy breading exterior - when you cut into it - it oozed this cream peanut butter/cheesy sauce. It also sat on top of this delicious black bean paste where I couldn't help but kept dipping/spooning it onto my broccoli pieces.  It came with this refreshing grapefruit arugula salad which added a nice balance to the dish. The sourdough bread was a soft and chewy. The white bean butter was beyond amazing. The buttery taste was very light, the white bean gave it a bit of texture, and I couldn't help but dip everything I could get my hands on back into the sauce.    \n\nOur main courses came out soon after with a refill of the bread yay. Although my fiance asked for his steak to be medium rare, it came out well done. It took him a bit to tell since the place was so dark to a point he had to bust out his phone + aimed the screen right towards the steak to confirm the steak was cooked wayyyy beyond his liking. But with the yummy seasoning and flavor (the mayo sauce under was so addictive), he decided to just not say anything. The pollock and squid was a very light dish. Sipping the broth was a perfect end to my dad's meal on this cold early winter night. I had a taste of the squid - they must have done some marinating to it because the texture was so different than all the squids I've had. It wasn't tough or chewy - just so light like a piece of sashimi. \n\nFor dessert - we decided to share the coconut chocolate mousse. It was topped with coconut flakes and dark chocolate bits. We each had about 3-4 spoonful taste and found it extremely satisfying - the mousse was soooo light - i felt like i was floating on cloud in heaven! \n\nOur waitress was really sweet but there were times we had to put in some time/effort in getting her attention. Overall - probably not worth the 45 mins to come back out again in the future. Nevertheless an amazing meal here in No.7 and really happy my dad was able to experience it.", "author": "Wing C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-08-06", "description": "If you're going there for the chicken dish you saw featured on the cooking network's \"The Best Thing I Ever Ate\", don't bother. They no longer make that dish; wish I had known that before making the trip. And on Sundays, the don't have the complete regular menu(the website doesn't tell you that). I decided to stay since I made my way there and also managed to find a parking space around the corner and up the block. There was a concert going on in the park across from the restaurant and I'm sure that many of the attendees took up the parking. The service was great however and the appetizers were fantastic! The dinner was not to my liking at all. The steak was overcooked(I ordered it medium/ It came well done), and not many sides choice on a Sunday.", "author": "Jonn B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-27", "description": "Love this place so much!!! Their brunch is the best kept secret in Fort Greene--opens at noon, everything is delicious, broccoli tacos are amazing, all egg and pancake dishes rock. We had a post-wedding brunch here and everyone on the staff still remembers us, it's like a family:)", "author": "Liz B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-27", "description": "Lovely spot that is now on my go-to list. Went for brunch with a girlfriend and was so impressed with the simple and well crafted dishes. I got the Chuck Norris scramble - fantastic mix of fluffy eggs and crunchy veggies. Salad that came with it had a great mustard dressing, but it was almost swimming in it. Friend got the broccoli tacos, also an excellent balance of flavors and crunch with hard taco shell with black bean hummus and soft taco shell around. \n\n4 stars because our server was very inattentive and not helpful with our questions on the menu. However, we ended up chatting with another woman (the manager? or owner?). She was great, answered all our questions and made us feel so welcome.\n\nFantastic place for a date, drinks, or catching up with a friend.", "author": "Amber D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-04-23", "description": "Bottom line: very inviting look from the outside but everything else is just ok. From a slightly poor lay out to mediocre food. Nothing is horrible . It's ok. But with so many great food options in the area, I'm not sure why people go here.", "author": "Marco B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-28", "description": "Delightful place with delightful bartenders and delicious food.\n\nWe each had a few cocktails (I had the Algonquin and the Walk the Line--the latter at the suggestion of the bartender and it was awesome) and split some food:\n\nBroccoli tacos: they really are that good\nFried broccoli: delicious, but got soggy pretty quickly\nArtichoke hearts: can't help but be awesome\nFries: always fries\n\nDefinitely will return here.", "author": "Joetta G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-20", "description": "Yum food. Tasty drinks. There wAs fabulous music on. Ambient environment. Everyone at the bar seemed to be in a good mood. Our bartender, Chris, made us feel very welcome and on top of getting us drinks. Great place!", "author": "Betsy S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-12-09", "description": "More of a 3.5, but I'm definitely rounding down for the odd way they sneak up behind you and clear the plates...\n\nThey're a little difficult to get a hold of on the phone and they do not return messages. If you're looking for a big group, they can accommodate, but just keep trying. Came in with a group of 12 and they were able to save us a section. It was a little difficult arranging this as they said the place was small and had a divider and our group would have to be separated, but they were able to arrange one long table for our group.\n\nRegardless, we sat down ordered our drinks and our food. The menu is small, but perfect - has something for everyone and everything sounded great. I had the brussel sprouts and the fish tacos. Depending on what you order, the entrees are small. The fish tacos were good, but they weren't amazing. There's definitely a lot more add-in's than there was actual fish. The brussel sprouts were delicious and I could definitely eat two orders of that alone. Between the two dishes, I was full, but had I not ordered the side, I'd definitely be hungry. \n\nThe service is a little odd...they do sneak up behind you and pretty much wiggle their way through, without saying excuse me or anything. You're kind of just surprised when you all of a sudden see a hand on your table that doesn't belong to you...no plates were dropped on our head and no food was spilled surprisingly, but a little \"excuse me\" would have been nice. Cute place, but I didn't really fall in love. Of all the other options in the area, I'd probably keep exploring. Good place for a few drinks, but not so much for a full dinner.", "author": "Michelle W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-18", "description": "We were here last night and I was blown away. I had the cornell half chicken and it was absolutely the best piece of chicken I've had all year. Definitely go. And it's literally right there as soon as you step off the C at Lafayette. Like one foot away from the door. Perfect.", "author": "Abby T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-29", "description": "Loved this place! \n\nWandering around Fort Greene while visiting, our daughter popped in to see if they could seat the six of us (at 5 on a Friday) and if the place was not so loud that we wouldn't be able to enjoy our conversation. \n\nNot only were the first two qualifications met, but they nailed it in every other respect as well. Good beer on tap, not a huge number of choices, something to please all the beer drinkers in our group. A nice back bar, not that we happened to order any cocktails but, just sayin'. Great food - tried the double-decker tacos, octopus, chili nuts, and the fabulous (believe it or not) Brussels sprouts. \n\nPrices were reasonable and the service was just right. Highly recommended!", "author": "Michael B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-07-28", "description": "I'm a food blogger, or at least I was. At one time I proclaimed No. 7 the best restaurant in the universe, or at least the neighborhood. When it first opened, No. 7 had an innovative menu that was executed to perfection on a regular basis. Now, it's an interesting spot with disappointing food and a good bar that's usually too crowded. The food isn't anywhere near what it used to be. Take the broccoli tempura, for instance. It used to be the size of a baby with a flaky batter that made you gasp. Now it's the size of a doll's head and tastes almost burnt. It's a bummer. \n\nIt's a decent spot and I don't think it's bad, but every time I've gone recently I've felt disappointed because it's nowhere near the height it used to achieve. By itself it's probably 4 stars, I guess. I just can't help but remember how awesome it used to be.", "author": "Brian V."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-05-21", "description": "I ordered the grilled cheese sandwich and lobster bisque for $16 (not including tax and tip). \nWhat I received was 3 processed slices of cheap cheese not even fully melted between 2 slices of lukewarm bread, and a small bowl of lobster bisque soup with an overcooked poached egg in it. Overpriced trendy crap.", "author": "James D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-03-08", "description": "In a nutshell: great food, unfriendly service. Came early on a Saturday evening and waited at the bar for some friends to join me. When I asked about a table the curmudgeon of a host acted like I was crazy for not realizing reservations were in order even though the dining room was still empty at this point. When my friends arrived, we were seated, begrudgingly, by the host but first had to assure him we were going to order food as he reminded us, \"It's dinner time and you know...we do get busy.\" Basically there's a nice/classy way of saying things like this to guests and there's the crappy/rude way and this guy was all about the attitude. Even our server seemed cold and to have a chip on his shoulder. \n\nThe broccoli tacos are as amazing as everyone says. One friend got the fish tacos which were delicious as well and the other got a burger and fries. We shared the olives which were good but come marinated in lots of olive oil. Drinks were tasty and the ambiance was nice. This place gets 5 stars for the food but 1 for service.", "author": "Lo C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-09", "description": "Nice little brunch spot.  The space is the real star -- the bar up front is well-sized (might come back for a drink sometime), and the tables in the back are in a sunny room with skylights.  It feels like they bought an old house, knocked out the walls inside, and turned it into a long restaurant.  \n\nThe food is on the pricy side, but the steak \u0026 eggs scramble ($16?) was very tasty.  Looking over at other tables, the fish tacos and some variation of the pancakes both appeared intriguing as well.  Service was friendly and quick.\n\nGood choice for a brunch on the way to Brooklyn Flea on a Saturday.", "author": "David M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-09-07", "description": "Surly service, bordering on rude!  Fantastic charred Caesar salad, recommend the fish tacos.", "author": "Sarah J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-07", "description": "Service was impeccable. The veggie burger was a revelation and I'm  it even a vegetarian I just love to switch things up. This review is based on their Friday night dinner menu.", "author": "Norbe D."}], "servesCuisine": "American (New)", "priceRange": "$11-30", "name": "No 7", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "7 Greene Ave", "postalCode": "11238", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/lt-w9NOIuTSmE73S6_jLew/ls.jpg", "@type": "Restaurant", "telephone": "+17185226370"}