{"aggregateRating": {"reviewCount": 364, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-04-04", "description": "The tuna with Korean pear \u0026 fried broccoli appetizers were delicious. Casual for a Friday night event though it was crowded.  I'm glad that No. 7 is in Fort Greene as an option.  Also love their martinis!", "author": "Martini C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2008-09-27", "description": "Don't sit at the bar! I also had a bad experience while seated at the bar. \n\nFirst, the food is good, and the place has great potential.  I will go back and hope that staffing issues at the bar are resolved by then.\n\nIt's a shame that a member of our party asked about a menu item and was told \"It's self explanatory\" by the bartender.  We also watched a guy sitting across from the beer taps get a beer bath last night.  No apology, just \"Oops!\" and then the bartender took a break outside.  On Friday night. With a full bar of patrons.\n\nThe front of the house needs to be responsive and personable. Hopefully they will find better bartenders. Until then, sit at the tables and enjoy the good food.\n\nNo credit cards accepted.", "author": "Zee P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-19", "description": "I went to No. 7 this past weekend with a friend I hadn't seen in a long time. We ate dinner at the bar. The oysters were great. Loved the sauce that came with them! \n\nThe bartender showed us a special drink menu that they had created for Valentine's day, the night before, and we ordered an insanely delicious prosecco cocktail! It went really well with oysters. I had the hangar steak, which was well seasoned and cooked to perfection. \n\nMy friend had the tofu, which was good enough to make this meat-lover try it. Not the usual mush I was used to in tofu dishes. Firm, great flavor, left me wanting more! \n\nThe bar had cool, relaxed vibe. Seemed like a good cross section of neighborhood people and some who'd made a special trip to eat there. And Genny Cream Ale is served! Bonus! \n\nI'd definitely recommend this place to anyone looking for awesome food that isn't overpriced.", "author": "jackie s."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-09-11", "description": "my friends and I stumbled in there last night to grab a drink. I loved the atmosphere, I thought the interior was really well done despite not having a long bar. I ordered french fries which were very good and came with a balsamic mayo which was great and something new to me. one of my friends ordered a peach desert which was expensive for the portion but she said it was amazing. when the bill came it was less than expected and it is convenient to my train line so I will definitely be going back. my only 2 criticisms were, 1: i ordered this drink that was supposed to have cucumber and thyme in it (the last drink on the cocktail menu) not only was there no flavor of cucumber but it was tiny, warm and tasted awful. I only had 1 drink and all night i felt sick afterwards. 2: our first server was great but when she left and someone else took over she was very awkward and a little shy.", "author": "Rebecca H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-27", "description": "TERRIFIC. Went here for dinner last week with my best friend. Fried broccoli was good but to be honest I was a bit disappointed, especially after reading all the hype on Yelp about that particular item. I had the steak and she had the bass. We both liked the steak more (wagyu beef, medium rare on top of those kimchi pierogies I thought were gnocchi) but I really liked the fish. The portions are quite large. And the dip for that bread was weirdly addictive. The service was excellent as well--not too attentive but not too neglectful either. Can't wait to come back and have the exact same meal, except maybe have the octopus for the appetizer instead of the broccoli.", "author": "Maude G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-09-20", "description": "no. 7 is a classy joint.  clean tile, nice lighting, great atmosphere.  the service was good as well.\n\nthe fried broccoli was amazing,,,do not miss the broccoli.  bush sr. would like this broccoli.  stuffed with cheese, deep fried...it was the most unhealthy broccoli ever.  but damn was it worth it.\n\nthe entrees were alright, but i was not a big fan of the tofu...i need more texture in a tofu dish, and it wasn't present.  the vegetables with the tofu were smartly seasoned and delicious, but it couldn't save the boring tofu.\n\nbut maybe it's on my head for ordering tofu.", "author": "Bick M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-14", "description": "We had a great experience here after a show at BAM.  The food was solid, classy, great atmosphere, good service.  It's certainly a step up from some of the more quotidian restaurants along Fulton Street in Ft. Greene.  A fine place for a date or a nice meal with friends.", "author": "John R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-11-14", "description": "Amazingly good.\n\nI have high expectations for this place after reading all the reviews.  This place did not disappoint.  Well, maybe just the appetizer did not meet expectations.\n\nAnyway, I went there on a rainy week day and was seated immediately.  The place wasn't that full when I got there around 7 but filled up quickly.  We sat on the cushioned bench and it was pretty comfy.\n\nOur waitress was nice but sometimes a bit distracted (place was busy).  They brought us some bread with butter and butter bean puree and cucumbers for starters.  The butter was amazing.  I was really impressed because this is something that is always neglected by restaurants.  I would buy jars if they one day decided to packaged them.\n\nWe ordered the soup and Grilled Salmon (special) as appetizers.  My fiance loved both while I am not a fan.  The Grilled Salmon was really raw and tasted a bit weird.  I think the concept of grilled salmon served raw is a bit weird on its own.  I thought the soup was creative even though I didn't like it.\n\nWe ordered the Cod and Hangar Steak for entrees.  I would recommend trying the Hanger Steak at least once.  It's a perfect medium rare and it's so tender.   Getting such a tender steak for $20 is so worth the trip.  The last time I had steak that tender was a Waguu beef at some restaurant.   The sauce that came with it was amazing as well.  I didn't like the kimchi pierogies though.  My fiance's Cod was tasty.  It's light and flavorful.\n\nYou must leave room for dessert.  The banana pudding is incredibly good.  NYTimes said the bananas are stewed in Miso.  I can't really tell it's Miso and the flavors are really complicated.  I would love to experiment other desserts next time I am there, but it will be so hard not to eat this again.", "author": "Loretta H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-02-20", "description": "I went to dinner at No.7 on a recommendation for a friend. a beautiful space and surprising large as well. there's bar seating in the front half and some rather comfy banquette seating in the back. We sat in the back and found windows (real windows!) going all around up with beautiful skylights. My friend and I went on a Thursday night, late (after 9) and was seated without any problems. The place didn't stay empty for long and wasn't overly crowded at any point in the night (such a change from dining experiences in Manhattan!)\n\nIt's a nice restaurant with correspondingly nice prices (read: not the first choice of dining for the i'm-paying-back-student-loans bracket). There's two menus: bar menu and the regular menu. I only tried the bar menu. \n\nI had the braised pork shoulder with kimchi (delish for the meat eaters albeit portions are more like appetizers) and the fish sandwich got a nod from the lacto-ovo-vegetarian. It's less greasy than food from your local dive bar. For desert, we tried the warm mint choco pudding and the pineapple cheesecake. Perhaps we're not sophisticated eaters, but I was expecting Bill Cosby to come out with a gooey warm mess of pudding but I got chocolate cake instead. The mint on top made the choco cake tasted like garden, but didn't seem appropriate given that it was freezing outside and I had a summer garden in my mouth. The cheesecake was very rich, thick like butter. L-O-V was intrigued with the combination of pineapples and raspberry sauce but disappointed with the density. It was too sweet for my taste. \n\nSupposedly brunch is delish here, so i may have to change my review after that. I could imagine it being a gorgeous setting for an afternoon lunch with all the light pouring into the back space. Will go back for lunch or on an inconspicuous date.", "author": "Lisa W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-04-08", "description": "I've only been for brunch but it was definitely the best brunch that I have had in a minute. The menu is super tiny but each item that I tried was superlative. Fried chicken was perfectly spiced and non-oily (????). The lack of oil is an achievement in itself. It perfectly complemented the waffle, which was a well executed bananas foster. The grits with chinese sausage and shrimp probably had a stick of butter in it, but whose checking the calorie count. It was the first time I've eaten grits and actually liked it. If you're looking for a southern brunch, this is the spot to go to. And did I mention there was no line?", "author": "tanya m."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-08-29", "description": "I went here for brunch recently and was very disapointed. I really liked the atmosphere and menu looked fine so I was expecting good things. The portions were really small, and the food was overly greasy. Most of the things on the menu were made from cheapish ingredients (cheese, broccoli, etc) and yet the prices were high and the portions were small. It seemed like the cooked relied on cheese, grease and salt to flavor the food. I sort of felt like like the exact kind of Brooklyn bougie person who pays way too much for not very good food because of hype. Too bad because I really do want to find a good neighborhood brunch place.", "author": "Sara S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-11-22", "description": "Outstanding! We went early to avoid the scene and eat food prepared out of the weeds. It was a good move: the food was perfect and the servers were on top of everything. \n\nThe white bean dip that comes with the bread is delicious and I know why. The ingredients are: white beans, melted butter, and olive oil.  It could get weird if allowed to get cold. Unlike the heavy rosemary infused white bean dip others make, this was soft and velvety. \n\nI started with the tuna app and loved the infused oil. It had a spicy bite that only hit you after you fully enjoyed the perfectly seared tuna fat in your mouth. \n\nHanger steak was grilled perfectly and flavorful. I cook hanger steak a lot- I find it to be a bombproof cut. The perogis, again, had that delayed spicy bite that similar to the tuna- it may be that signature Korean influence. \n\nWe ordered an affordable Bordeaux that was open, light and full of fruit. I was there with non-winos, so it was a good choice for those that are still learning to appreciate wine. That high iron taste of the hanger steak would have been cut better by a big bold red. \n\nThey have Hennepin on tap, always a plus.   \n\nI recommend highly, but only go with foodies. I made the mistake of taking some burger \u0026 pizza types and I don't think they got it.", "author": "Nat S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-05-22", "description": "Super cute place, pricey for Brooklyn. the mango chipolte drink is sharp. Food combinations are creative. I'd go again. 3.5 Stars.", "author": "fanbelt p."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-02-18", "description": "Having tried to get into the Smoke Joint but being too late we managed to get into here (they serve until 11pm).\n\nThe bar and then restaurant behind it is well laid out and lends itself to a cosy meal. \n\nI was interested to see the other reviews of the food on here as it is well... confused. \n\nI had the tuna and asian pear. The tuna was well cooked but the dish itself was a bit of a muddle. It needed more salt and acid. \n\nWe also had a side of broccoli tempura. Well it would have been tempura if I had ever been to a tempura restaurant which gets a whole head of broccoli and dunks it in the fryer. This came with a black bean sauce and as a whole the dish didn't fit together. \n\nMy boyfriend had the steak which was good but had the same problem with the sides. They tried to mix korean (kimchi), polish (pierogi) and then a japanese-ish marinade. \n\nOverall the meal was well cooked but too ambitious. Good venue though.", "author": "Jennifer M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-04-08", "description": "If you're going on a date come here.\nThis place is perfection. I am so used to paying 60, 70, 80 dollars for a meal that disappoints that I was truly surprised when after two seperate visits, I was completely satisfied with both meals.\nThe space is beautiful with large skylight in the back. If you're waiting for someone the bartender is super friendly and will mix you something fun without making you feel like an a--hole, which is nice.\nAs for the meal itself, every appetizer, entree, and dessert has hit every note. The beef and chicken were both tender, and the scallion lacked even a hint of rubberiness.\nAll in all a great restaurant.  Also dark enough to hide whatever facial/body issue you're ashamed of.", "author": "Ali H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-09-22", "description": "I don't live in brooklyn, but I went with some friends who live in the area.  I liked it so much that I took my boyfriend there the following week.  I had the pork appetizer with the fried egg ---insane!  And the steak with kimchi pierogies for my entree--I could eat the pierogies all day long.  If the chef could put it on the menu as a side or an appetizer by itself, i would be eternally greatful  My steak was cooked to perfection--very tender.  Finished up with the banana pudding--YUM.  \n\nCan't wait to go back and try the fish.", "author": "slm x."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2008-10-21", "description": "We had some good food and drink but one of the rudest waiters I've ever experienced. Too bad because there are some unique flavors here and I'd like to come back. But, we had a number of service issues, all of which wouldn't have been a huge deal if our waiter had issued a vague apology. First, we had to ask another waiter for bread and water, after our waiter ignored our request. The bread comes with an interesting spread and pickled cucumbers, and we were having soup as an appetizer, so we really wanted it.\n\nThe our $42 bottle of wine was cleared while 2/3 full from our table, and returned to us without so much as an apology, just a rude \"no one drank anything\" and a disinterested shrug. Then, my poached salmon arrived lukewarm. When I politely told our server and asked if how that was the dish was meant to be served, he stared at me blankly and said \"what do you want me to do?\", again without offering any sort of apology or simply explaining if that was how the dish was actually meant to be served. (I suspect it wasn't. It was room temp, not cold, and everything else on the plate was hot)\n\nI'm a pretty easy going diner, especially at new restaurants, but I have never encountered as rude a server as I did that evening. All it would have taken was an apology and maybe a free dessert to smooth things over. Instead, rather than ordering a dessert (all of which looked intriguing), we wanted to get out of there as soon as possible.\n\nI hope this isn't the norm, as this place has a great bar and some tasty food. I live nearby and would go again, I just wouldn't want to sit in this guy's section.\n\nAlso, a restaurant in this price range (fairly upscale for the neighborhood) really needs to take credit cards, and they should clear your silverware between courses if you've had heavy appetizers.", "author": "Liz E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-03-13", "description": "Wow.  I just have to write something after reading the previous \"review.\"  You can tell a person arrives with an opinion when they're the type to have so much spare time to write lengthy mean-spirited comments about a great neighborhood joint.\n\nI have been to this place about five times now and continue to be impressed.  I love the food (most recent was the pork shoulder tacos from the bar menu.  awesome).  I love the energy (there's a positive, relaxed vibe there -- maybe why the other reviewer felt so out of place).  The aesthetic is comfortable and I imagine would appeal to a wide range of folks.  Portion sizes are perfect.\n\nIt's all around awesome!  Nothing not to love.  So glad it opened.  Long live No. 7.", "author": "Jennie D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-04-17", "description": "Hands down best brunch in NY.  The House Made Naan with fried tofu, scrambled eggs and chickpeas will not disappoint.  My personal fav is the scrambled eggs with three soft tortillas w/ yummy fixings.   The bloody mary and bourbon cider offerings also keep our friends endlessly happy!   It's a fav weeknight dinner spot as well, in love with the tofu entree as well as the fried broccoli. This is a wonderful restaurant w/ a kind, talented staff.", "author": "lila e."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-15", "description": "We accidentally missed our stop on a night out (we were going to find a place in the LES for dinner) and wound up at Atlantic Ave in Bklyn. So we decided to head back to my old stomping ground and give no.7 a try. Best find in a looooong while! \nThe flavours in our meals were amazing. The service was attentive but not intrusive (I hate it when the waiters are literally pulling the plate from under you as you are taking the last couple of bites of your meal!), the drinks were well mixed (not too strong on the alcohol nor too diluted) and the atmosphere was laid back, intimate but great for groups as well. \nThe hostess was really accommodating, we were there on a Saturday night with no reservations. She seated us next to a big group (about 5 adults and a kid) but we wanted to be away from the group and she happily moved us to the back area and seated us along the banquette. It's refreshing to go to a restaurant, dine on fine food with great atmosphere and no attitude. Good work no7!", "author": "Hinh L."}], "servesCuisine": "American (New)", "priceRange": "$11-30", "name": "No 7", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "7 Greene Ave", "postalCode": "11238", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/lt-w9NOIuTSmE73S6_jLew/ls.jpg", "@type": "Restaurant", "telephone": "+17185226370"}