{"aggregateRating": {"reviewCount": 364, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-07", "description": "Good place for Total Vegetarian Chaos \u0026 Destruction (a.k.a. veggie burger) and drinks before the Barclays...", "author": "Alex S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-01-29", "description": "Pretty bummed. We came with a large group for brunch. Service was under par considering that the place wasn't packed. Drinks took a while to get and were wrong, twice.\n\nOrdered the breakfast burrito. This was literally 1 \"fried\" soft boiled egg and rice wrapped in a tortilla. Flavorless without the salsa verde. It was rice. And an egg. \n\nA friend ordered the same but with steak added. This resulted in 6 pieces of fatty steak ends thrown into the mix of rice. And an egg. A. Egg.\n\nProps on the delicious fried chicken sandwich. But can't support the $9 bowl of scrambled eggs and side of burnt toast. Had better breakfast burritos and scrambled eggs from my local bodega honestly. \n\nIf the spread can shine like the fried chicken sandwich, then the kitchen should have zero issues churning out a breakfast burrito that fits the level of quality.", "author": "James I."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-17", "description": "Fantastic Place To Eat. Price Is Right You Won't Go Home Hunger Guaranteed. You Got To Try The Pill Pork Grill Cheese", "author": "Reinaldo M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-19", "description": "Been a longtime fan of this and other No 7 locations because of the great vegetarian options, but I have to say the Ft Greene location has really stepped up its game in recent months. The restaurant and bar space feels much more welcoming and during daytime you can see what a really beautiful space this. Menu is excellent, service is solid, and it's a nice place to spend time with people you like without being rushed or overcrowded.", "author": "K R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-05-23", "description": "Um, hmmmmm. Where to start. Well, I have to say that going in, this place had a lot of potential. It was much touted to me by a friend who patronized it like crazy a few years ago. From the reviews I had read, it seemed to exude character, ambience and good eats (fried broccoli people??!!!) In reality, it was an odd experience. \n\nI arrived there around a quarter to 6 and the place was virtually empty. A few people were seated at the bar, including my friend. The bartender smiled and greeted me, as I hugged her. We wanted to nibble on something along with drinks, so we proceeded back toward the high tops and dining area. A man walked toward us and asked if we were drinking or having dinner. My friend's exact words were, \"drinks and snacks.\" He asked us again, with the most sour expression on his face. Drinks or dinner.  I smiled and said that we were eating AND drinking. My friend complimented the high top seating and noted how cool it would be to sit there. He flatly told us those seats were for people eating dinner. Um, right, because we already told you we wanted to EAT and drink. Let me mention again that the entire dining area was EMPTY. We stand there totally confused as to reason for his attitude and the whole repetitive eating/drinking questioning. He grabs menus and walks us back to a low table in the main dining area. Our waitress comes and is pleasant enough, but the vibe was just sooo odd. I liked the broccoli tacos I ordered, but I didn't love them. My Hendricks and tonic was very good, but my friend was turned off to drinking. We waved to the smiley bartender on our way out as I looked for Mr. Crabby pants. He had disappeared somewhere in the the still EMPTY front of house an hour and change later.", "author": "Julia F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-28", "description": "Love it. My gally pal and I started with a fried artichoke side. It comes with a honey mustard type dip. She suggested it. I'm not usually a fan of artichokes but this was definitely a hit. Delish, crisp, the dipping sauce a perfect complement. \n\nI had the veg burger, \"Total Chaos and Destruction\" was its name. First off their bun is the best burger bun. I don't know what kind it is but it's not just a cushion that turns to mush in seconds, it's got a bit of bite, a pretty color a nice flavor of its own. Quality bun. The burger itself had a lot going on. The veg patty was hearty, then served with grilled onions, what looked like canned beets (not the best part), cheese and house made steak sauce. It made my mouth and tummy very happy. \n\nIt's the little things too. Meaning their French fries were crisp, not greasy or soggy, and though thin they held their shape with repeated dips in ketchup and mustard. \n\nI will definitely be back for every other item on the menu.", "author": "Nancy C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-26", "description": "Limited menu -- stick to the 2 taco choices--dumplings are mediocre at best. Avoid the veggie burger--only average.", "author": "Harry S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-23", "description": "I got married last week and held a brunch reception at No 7 following our ceremony elsewhere.\n\nEverything about No 7 was great - I worked with Katherine for several weeks leading up to the wedding, and she could not be been easier to work with. She and Tyler created a custom menu for us, collaborated with us to create custom cocktails for each of us (the \"Bride\" and \"Groom\" but our names), were very accommodating of special dietary needs, helped figure out seating and set up.... just great.\n\nDuring they reception they we're just as great - the staff were all super attentive, they made sure the right people got the right special dishes, made extra special dishes for the kids who wouldn't eat anything except fries and maraschino cherries, awesome bartender who ended up comping us a bunch of drinks, food was AMAZING....\n\nSpeaking of the food... our guests could not stop raving about everything - and for good reason!\nWe started with deviled eggs, salad stacks and broccoli tacos, which are just the best thing ever. Brunch was fluffy ricotta pancakes, thick crispy bacon, and savory eggs.\n\nOverall, holding an event a No7 is fantastic, and I'd highly recommend it!", "author": "Amelia G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-14", "description": "The ambience here is amazing! If you get here before dark there's nice natural lighting in the back section. They make good, strong cocktails (try the Boulavardier if you're a bourbon drinker). We ordered the broccoli tacos (!!!!), the fried broccoli, shrimp and chorizo dumplings, and the calamari. All the appetizers were good. Stand outs for me we're the broccoli tacos and the dumplings. I ordered the burger. It was juicy and made to my liking. There's a secret sauce that has a hint of mustard. Their fries are amazing!!!! Golden, crisp and just the right amount of salt.", "author": "Jerome J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-07", "description": "Staff and food was great. I ordered the fish tacos and broccoli tacos which was good.", "author": "Alacia S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-03-04", "description": "Should've written a review last spring bc it would've been better. Boy, have things changed. \n\nMultiple opentable reservations available for a cold Friday evening so I picked 545 which is usual time my co-workers and I free up. Mind you I made the res a week before and for a party of 14 so I out down my credit card. I didn't get a confirmation call (on my cell) until 1230 pm day of but since my cell signal sucks within the hospital, so they had to leave a message.  I got the message as we were leaving so I called to say we were on our way.  It was 555 pm and the host who picked up the phone insisted it was 6 pm and \"reminded\" me of our res time. I assured him we'd be there in 5 AND that there were members of the party already there. \n\nWhen we walked in he was waiting but not anxiously, more like begrudgingly. He simply walked us back and plopped down our menus without a word. This set the mood for the rest of the meal.\n\nA waiter came asking for drink orders and when I said non-alcoholic ginger beer, I was shut down with \"it's not.\"  I stuck with water. \n\nIt used to be that the amazing broccoli tacos were on the happy hour menu that you could order anywhere in the restaurant. When I asked for the HH menu, he said \"the rules have changed.\"  Rules, are we in a classroom?  \n\nWe got 5 orders of the broccoli tacos and they're just like I remember them but the mood made them a little less enjoyable. \n\nThe brussel sprouts were good also. Grilled octopus didn't taste that fresh but the fixings on the plate are tasty. General tso's chicken sandwich is moist and juicy but spicy!  I didn't like the fish tacos; the cheese, strawberries, and fish didn't get along.  Coconut chocolate bread pudding is grainy and the cookie pieces can be too salty. \n\n4 stars for the broccoli tacos but 2 for the service. The food came out fast and correct, just not happily served. Each time I've been here it's for a work dept get-together, we'll prob pick a diff place from now on.", "author": "Thy L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-22", "description": "The only reason I am not giving it 5 stars is because I didn't really have time to scope out the place, so I have no idea what it looks like beyond the front bar area.\nCame here for cocktails on a Friday night around 9pm. While it was sufficiently crowded, my friends who got there before me had secured a decent amount of space by the front window. Its pretty odd that the storefront is right in front of the stairs to a train station, but makes for good people watching.\nCocktails seemed priced as you would expect, maybe as low as $11. While my drink seemed well prepared it didn't take long to get which was great.", "author": "Marisa L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-11", "description": "We had the the avocado- endive salad and the double broccoli tacos to start. As for the meal we had the fish tacos and thd lobster and mussels. ALL WAS DELICIOUS. I have to say the double broccoli taco is worth many more trips here. A MUST try.", "author": "Michael M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-21", "description": "Please, please don't let this become too popular because I love it.  My friends and I were craving a proper cocktail and some food after a late night at work.  We were seated at the hi-top which was perfect for us to catch up over some delicious rye old fashions.   Everyone was very happy with their food.  The winners at our table were the broccoli tacos and chicken sandwich - but there is so much more on the menu that I want to try!  I would say the vibe of the place is a little more upscale without the attitude.  I'd come back on date night for sure.", "author": "Patrick H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-04-27", "description": "Darkly lit, generally charming, despite an awkward layout and poor use of the space overall. \n\nThe broccoli tacos here are worth your time, and the cocktails are generally very well made. \n\nThere's a bartender (sorry, a mixologist.) here who ranges from unfriendly to strangely combative when responding to pretty basic questions about the menu. So, maybe avoid asking questions for the best service.", "author": "Maura M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-29", "description": "What a cute place! I love the layout of this restaurant. Huge bar/open kitchen, high-top bar seats, and an awesome room in the back with skylights and cushy seating. We went here for brunch on a Saturday afternoon. \n\nWe somehow ended up ordering two vegetarian dishes, the fried broccoli tacos and the poached eggs and hash with Brussels sprouts.  The poached eggs and \"hash\" was more like, potatoes, marinated cucumbers, and sprouts with poached eggs on top. It was quite yummy, though they went a bit overboard on the dill. The broccoli tacos were surprisingly good, and I really liked the textures of the black bean hummus sandwiched between the soft tortilla and the crunchy shell. Not the kind of food I usually order, but if more vegetarian food was like this, I could totally get on board!\n\nThe location of our seats gave us a view into the kitchen, and I enjoyed seeing all the dishes coming out, as they all looked pretty good. Side note, the chicken salad looks like an entire head of lettuce was used in there. A salad does not equal a light meal here.", "author": "Steph C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-24", "description": "I love this spot. They have a cool ambiance - two skylights in the back, and a huge wrap-around booth. Bar seating near the front as well as a couple of high-tops. We sat at the high-tops because we didn't have a reservation, which was fine. A bit more private.\n\nWe didn't plan on doing a vegetarian brunch, but that's just the way things happened. I had the broccoli tacos, which sound terrible but are amazing. They're double wrapped (like authentic tacos are), with a crunchy inside a soft (which I guess is how Taco Bell does it). The black bean hummus on the bottom alone makes it worth getting. Perfect amount of food and reasonably priced at $10.\n\nAlso tried the poached eggs and hash. They offer the pulled pork or vegetarian Brussels sprouts option (both at $12 for some reason). It's over a cucumber salad with fingerling potatoes. It was nice and refreshing, and the potatoes made it a bit heavy, so probably a good idea to offer a vegetarian option. However, I didn't think the Brussels sprouts added much to the dish. They were just kind of there. If they marinated and then roasted them first, would've made a world of difference.\n\nAlso, it wouldn't be brunch without a Bloody Mary. And theirs is s-p-i-c-y. Lots of horseradish and enough peppercorns that you'll actually have to chew.\n\nWill definitely come back!", "author": "Kenny C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-03-12", "description": "A friend and I needed a quick bite before heading to a show at BAM (RadioLoveFest!).  Another friend of mine who lives in the area recommended No. 7 as a solid pre-BAM dinner-spot.  I had thought that No. 7 was a quick bite; however, I was wrong!  We arrived at 6:50 and had a show to get to by 7:30.  When we told the host, he sat us immediately and our server ensured we ordered right away and basically gave us the check when she gave us our food.  We were out of there by 7:20 with plenty of time to walk over to BAM.  I really appreciated the service's accommodations to get us in/out.  So lesson learned:  No. 7 is a nice sit-down place where you should make reservations in advance - especially on a Friday night!  (We got lucky because the table was technically reserved, but because we had to leave so quickly, they were able to squeeze us in)\n\nNow, the food!  Since we were in a rush, we couldn't order any of the entrees.  But, not to fear because the broccoli taco starters were amazing!  Seriously, who knew broccoli tacos could have so much flavor.  Each of us ordered our own serving (each serving includes two nice-sized tacos) and fries for the table.  Yum, yum, yum!  So happy we were able to squeeze in this treat before an incredible show at BAM.", "author": "Jennifer S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-05", "description": "Reliably good food and great service.  The bartenders are super nice and attentive.  Broccoli tacos are awesome!", "author": "Melissa I."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-29", "description": "Came here for a cocktail and haven't tried the food yet. Beautiful and chic decor! We sat by the bar before dinner service began and the interior is so gorgeous. \n\nCocktails are a bit pricey but I think you're really paying for the ambience.", "author": "Judy N."}], "servesCuisine": "American (New)", "priceRange": "$11-30", "name": "No 7", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "7 Greene Ave", "postalCode": "11238", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/lt-w9NOIuTSmE73S6_jLew/ls.jpg", "@type": "Restaurant", "telephone": "+17185226370"}