{"aggregateRating": {"reviewCount": 364, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-09", "description": "Knew this place was there but actually stumbled upon it when some friends and I were hungry/in need of cocktail on Saturday post Brooklyn Flea. It was far enough away from the chaotic flea to provide quiet and crowd-less atmosphere and air-conditioned enough for us to stop perspiring just long enough to enjoy the meal and cocktails. The back dining area is amazing. We couldn't emphasize enough how fantastic the sun streaming through the skylights was...and the decor was a great escape from the cluttered, crowded norm of plenty of other restos. It felt homey and spacious. Like we could live in a similar space. \n\nFried chicken and watermelon salad was delectable. The chicken looked how fried chicken should look i.e. VERY crispy and not at all oily. And the watermelon salad had jicama . Just YUM. \n\nThe fried zucchini with friend eggplant and mozzarella cheese and special sauce was scrumptious as well. I mean, everything fried is delish. \n\nAs for cocktails, we ordered the refreshing lemon plum spritzer. It was good and just what we needed to continue our Brooklyn day. I would suggest to No. 7 that they put a little more lemon and plum in this cocktail as it really tasted like lightly lemon-ed wine bbuuttt it did taste good so I won't let it affect their rating. I should plan to stop by here again and sample some more of the menu options!", "author": "Marin G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-15", "description": "This place is adorable and the food is awesome. I could live on those broccoli tacos... where have they been all my life?!", "author": "daniela d."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-11-18", "description": "3.5 - Literally right out of the subway stop, No 7 is really almost country comforting.  Maintaining the multi-paned windows, the seating at the entrance of the restaurant is really under utilized.  If I owned the place, I would make it more like the dining room that spills into a living room/family space of a bed and breakfast.  Rustic, homey, and with an amazing and very regularly refreshed pot of coffee always on.  \n\nBut I don't.  =(  Poo.  So...  onto the review!  We came here for brunch, as was recommended, but wanted something hearty to split since we were headed to the nearby Brooklyn Flea and had plans to continue gorging our way through the afternoon.  \n\nAlso upon recommendation, we shared the Grilled Bologna Sandwich with a fried egg, pickled red onion, and feta cheese.  Brilliant.  Every ingredient in this dish elevates the flavors of the others.  I almost regretted our decision not to order more, but here's why I don't.  \n\nIf you look at the menu nothing, at least immediately, jumps out at you as \"this would go well with that.\"  The menu is definitely eclectic and interesting, but perhaps at the loss of setting up a more cohesive meal to encourage sharing plates.  \n\nRelaxed.  Quality food, but (or \"and\" if you like different for different sake... you, hipsters, you) an all over the place menu.", "author": "Melinda C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-19", "description": "I've been here twice now, once in July 2010 and the second time last week. I had wonderful means on both occasions and not sure why No. 7 gets such mixed reviews. Oh well. \n\nI had a few yummy greyhounds to start and devoured the bread + chick pea spread + cucumbers. Loved it. My group shared 3 starters: grilled octopus,  raw mackerel, and the fried broccoli. All were totally fabulous and we were licking the plates without shame. \n\nFor dinner, I had the chick with broccolini and peaches and verjus. I ate it so quickly! I really enjoyed the dish. Two of my friends had the veggie dish (can't remember what it was exactly) and my one bite of that was heavenly. \n\nThe place is laid back and we had a pretty cool and humorous waiter (black guy with a fro.) \n\nOnly complaint from my group: drinks were strong enough. Drinks could have had more booze in them. But maybe that's more a comment on my friends? Not sure... \n\nI really can't complain about this place. Wish other people had as delicious food as we did!", "author": "Alexandra F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-05-11", "description": "This is my favorite restaurant: for the quality, consistency, and the chef's inventive flavors. The appetizers are the most interesting part of the menu, but the fish-in-a-pot entree is a winner in all its manifestations. I like their wine list - we get interesting whites by the bottle and the glass. \n\nI've had some excellent, very personal service, but occasionally the staff gets overwhelmed-you can go a long time between visits for water or wine refills. That's offset by the staff's generosity, whether explaining the menu, or pouring different tastes of wine to let us figure out what we like. \n\nInside, it's dark and pretty, with flattering light for date nights. The noise levels can be high (my table is usually the reason); nothing soft to soak up the sound. In the winter it can be chilly. They'll seat tables up to 8, but groups of four or five around the raised bar tables are fun. \n\nOne last tip: Don't overlook the bar menu - hidden gems there have included pork tacos, pork buns, and a killer fried fish sandwich.", "author": "Jesse W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-10-28", "description": "This place used to be my absolute favorite brunch place. The ingredients were fresh, of good quality, and prepared right. I went in this morning with my fiancée after raving about it for months, and boy was I disappointed! We ordered the cheeseburger ($12) and made it a double (add $2). A $14 burger, even by New York standards, better be amazing. Instead, we got processed beef patties that were cooked well done. (Though the apathetic waitress told another table the burgers were all cooked medium) In a blind taste test, this would be Burger King. Not even a clean Burger King, but the one where the kids in the back are spitting on your food. C'mon No. 7, if you can't take the 5 seconds it takes to ball up some fresh ground beef, then please charge $2.95! Oh and in the 30 min we were there, the waitress got 3 tables' orders wrong. We weren't the only ones leaving unhappy. Never going back!!", "author": "Crys Y."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-02-28", "description": "Companion and I showed up for brunch on a Saturday morning. The theme of this place seems to be that their dishes combine outrageously disparate flavors and textures. Sounds wonderful, on paper. What actually happened was another story.\n\nI was hungry, so I chickened out and ordered the fried chicken with pineapple salad. Fried chicken was only passable. Four pieces were, respectively, too greasy, too salty, not salty enough, and excellent. I recognize pineapple-seaweed salad as Hawaiian comfort food, and would have been much happier with it if they hadn't mixed in sliced water chestnuts, and some kind of diluted Chinese brown sauce (not described on the menu, and tough to pin down).\n\nCompanion had French Toast with hummus and passionfruit sauce. The \"French Toast\" was actually four tiny slices of what appeared to be cornbread fried in egg, then misted with syrup of some kind. This again, was not bad, but also not great, and certainly not what the menu made it sound like.\n\nThe turning point was the alcohol. A drink described as \"gin, pickle juice, and peach schnapps\" (which, depending on how you handle the proportions, could have been a real adventure) was actually a dry cucumber gin martini with schnapps in place of vermouth, and a Library-of-Congress-Whisper of pickle juice. Boring.\n\nThe bottom line is, this place starts you out by asking for your trust so it can take you on a wild ride. That trust is regularly betrayed, and the ride alternates between the unpredictably bad, and the soporific. For $25 per person, that's not good enough. Judging by the other reviews, dinner may be a different story, but I'd advise against brunch.", "author": "Bret H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-07-12", "description": "The fried broccoli was not cooked properly, contained a LOT of raw tempura batter. It literally poured out of it like some sort of gravy. Since I was eating at the bar I showed it to the bartender who shrugged it off. Someone does not know how to cook. I dont understand the raves, will never go back again.", "author": "Voxo P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-29", "description": "Late night Double Decker Broccoli Tacos.. First layer is a Soft flour tortilla lined with beans, inside of that is a crunchy corn tortilla filled with broccoli, feta and peanuts.. Amazing", "author": "Steve A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-17", "description": "Nice decor and good bar service. Overall a good place for some nice food and a drink. Access to the Subway is literally at the door, so that seems like a perk of sorts.", "author": "Niles R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-01-28", "description": "I work in the same area as this place and have always said nothing but nice things about them but that stops now . Brought a friend in tonight for an after work BIRTHDAY drink he's NEVER been in before and is a chef in the area . Bartender (guy) is over it from the get go complaining about how he wants to go home blah blah blah its 1030 pm your bars full we only plain on a shot and a beer . We get served and everything s fine till after we pay . As we are leaving  the same \"over it bartender \" tells my friend next time your here you better call the bartender by her proper name and not tip six dollars . My friends never been here before but says OK . I on the other hand am blown away by this blatant  disregard of class And disrespect from the bartender . Outraged I tell this classless prick that the guy he's bitching out had never been in this dump before and will never be back . He of course now looking like the shit head kicks us out saying he's going to call the cops .I will never go back to this place. I just want to point out that even if my friend had said these things its not your job as a bartender to bring it up . Have a manager do it . Also the idea that you think your crappy services deserves MORE money that kills me , your luck you have a job . I Bartend for a living making drinks is a very small portion of the job . This place sucks because it allows people like this to work there . I'm sure they have some awesome people working there but its not on a Tue Jan 28 2014 .", "author": "Moke 1."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-03", "description": "Went to brunch here when I was in Ny, this place has a charming backspace.The atmosphere was so relaxed, nice lighting, clean tile.  I was really pleasantly surprised with the space, service, and the food.The grits with seafood was delicious .\nA little pricy for sandwich but worth it.", "author": "christy l."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-08-20", "description": "Had another mind-blowing food moment at No. 7 last Sunday, and it came in the form of an appetizer: thick and pillowy homemade naan bread with juicy slices of the tastiest heirloom tomato I have ever eaten, with a quinoa gremolata and some kind of creamy sauce (I think it had balsamic in it?). I swear to god, it was one of the most delicious things I have ever eaten, and it was amazingly simple. That is the genius of this restaurant.\n\nAlso fell in love with the radish tequila cocktail, which also contains lillet, creme de peche, and a bit of lime. It tasted kinda like a margarita only a little subtler, with some great, surprising flavors coming through. Easily one of my new favorite summer drinks.\n\nLet's not forget dessert, which was an adventure in itself.  Dark chocolate \"pudding\" cake (rich and moist) with rootbeer chantilly and tiny meringues on top, pickled blackberries, and a spiced currant sauce. Before this, if I could have designed my perfect dessert it probably would not have turned out like this, but that's only because I'm not this creative with food. I'll never think of chocolate cake the same way again. It was fantastic!\n\nWe also had a glass of the LiV strawberry sorbetto liqueur for dessert, and now I'm desperately scouring wine shops all over the city for a bottle of it. Turns out it's produced in Long Island (wha?!?) yet is somehow impossible to find in NYC retail shops. Argh. I guess I'll have to keep coming to No. 7 for my fix.\n\nNot everything I had that night was a 10 (my salmon was only maybe a 7), but man, the dishes that were 10s... They're setting the bar pretty damn high.\n\nOh, also, I was happy to find that the restaurant wasn't crowded at all this time. Granted, it was 6:30pm on a rainy Sunday, but I was still sort of surprised.", "author": "C.J. T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-28", "description": "As a vegetarian there isn't much I can eat here. But the atmosphere is romantic and classy. My favorite thing on the menu--by far--is the brocoli tacos. If you've ever had a double decker from Taco Bell, you'll understand where the inspiration for this came from. It's innovative, healthy and inexpensive. My girlfriend and I share two of them for dinner with another app. It's just enough for a small dinner.", "author": "Steven M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-29", "description": "Great Moscow Mule, helpful staff with extensive classic cocktail knowledge and specialty cocktail menu.\n\nChill vibe, chill jams.\n\nConveniently located near several trains and the Barclays Center, too!\n\nWill return.", "author": "Rubia M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-06-24", "description": "This is the best spot I have been to in awhile!\nMy friend and I intended to meet for an early glass of wine and before we knew it a glass turned into a bottle that turned into food and cocktails.\nNo. 7 is the perfect combination of class and comfort.\nI loved the vibe, the open kitchen and the friendly, laid back crowd.\nThe bartender won us over with his manners, charm, and good taste in music.\nThe drink of the night included lavender infused gin, it was certainly a unique drink and I enjoyed this interesting new drink immensely! My friend and I also shared the fried broccoli, and it was the perfect food to accompany our drinking. \nI certainly hope to make my way back to No. 7 soon!", "author": "Becca C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-02-28", "description": "A friend and I dropped in for a drink on a Tuesday night.  It was kind of dead, so we asked to sit at a table rather than the bar.  After telling us this was okay, the host continued to badger us about ordering food for the next hour and a half (e.g., bringing us an unsolicited dessert menu even though we did not eat dinner!) until finally he unceremoniously said \"we need this table,\" thereby kicking us out.  This would have been fine if there hadn't been empty tables all around.  But as it stood, it was aggressive and strange.  We, being polite people, said thank you on our way out, to which we received no reply.  Ridiculous and uncalled for. I won't be returning.", "author": "Christina K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-10", "description": "I really enjoyed my meal here.  That said, I can see how the menu would not appeal to everyone.  I could not, for example, take my mom here.  She would look at the menu and want to leave because nothing feels familiar.  Some of the items sound downright unappealing.  In fact, they sent us free dessert and when the server told us what it was, we all kind of looked at each other like \"Ummm, who wants to go first...\" (It was made from celery root!)  I am the type of person who likes to try something that sounds gross, so I dove right in and it was one of the best desserts I have ever tried.  \n\nThe place is pricey (it might not look too bad from the menu prices, but the appetizers and entrees are on the small side.) but the food is divine.  Try something unconventional and you may be pleasantly surprised!", "author": "Lilah M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-29", "description": "I do enjoy their food and service.  There is one element keeping No. 7 to get another star from me, ventilation.  The an open kitchen is fun and all, but they really, really, really need to turn on the exhaust fan.", "author": "H S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-05-23", "description": "in an attempt to show me around brooklyn and to show off his neighborhood, a friend of mine took me here to no.7. i was excited since there were stellar reviews for it and i was eager to find a good place in brooklyn for eats. \n\nthe restaurant was in a really nice spot, right by the train, super convenient, especially for someone who is directionally challeged like me! very cute, simple but clean and modern inside. had a bar area and tables around the bar, wc i assume are for those who are drinking thier dinners mostly.we sat inside the restaurant towards the back.\n\ni was dying to try the fried brocolli... it was delicious. it was basically tempura brocolli. it was really good but i dont know if its worth all the hype. we also had the brocolli tacos. it was interesting. the salad that came with it was awesome though. super fresh and tasty, loved the grapefruit in it. i love the bread that they give you witht he special dip instead of your good ole olive oil/balsamic combo. nice.\n\noverall i thought it was alright. very chill place, great service, a bit pricey for what they have. worth trying at least once.", "author": "Abby S."}], "servesCuisine": "American (New)", "priceRange": "$11-30", "name": "No 7", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "7 Greene Ave", "postalCode": "11238", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/lt-w9NOIuTSmE73S6_jLew/ls.jpg", "@type": "Restaurant", "telephone": "+17185226370"}