{"aggregateRating": {"reviewCount": 364, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-08-31", "description": "I love this restaurant. Everything was spot on. Good service, cozy ambiance and most importantly wonderful food.\n\n I had the steak, cooked perfectly with a delicious crust, salty exterior, and velvety rare meat within. The accompaniments are also delectable including beets and Swiss chard and kimchee gnocchi ( wow so good). The best part of my dinner it paid attention to and balanced salty, sweet, bitter, spicy, and sour.\n\nI also tried the octopus appetizer, again, cook expertly with a lot of flavor that does not compete with the delicate octopus. I also had the buttermilk pudding for desert, not to be overlooked but certainly not the highlight of the meal.\n\nI'm still dreaming of that steak.", "author": "James V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-09-11", "description": "Cashew encrusted Tofu.\n\nI absolutely LOVE TOFU.  And this tofu (albeit a little pricey) was perfectly fried and served over wonderfully, slightly spicy noodles. oh my god that tofu! Fantastic. \n\nAlso tried the fried broccoli which was good, although a little hard to share with my friend considering it was a huge, fried, floret.\n\nDecor was charming and the waitress and waitstaff were attentive. Great selection of beers, although I wish I would have tried a cocktail since everyone has been raving about them, but we were between menus.", "author": "Alison I."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-06-28", "description": "The decor here is lovely and I really wanted to enjoy my food, but I didn't overall. The sashimi appetizer was okay, but not outstanding. I had mahi mahi for an entree and I found the whole things really disconnected. The flavours on my plat weren't harmonious. The artichoke dip was definatley delicious, but I was confused by it's presence on my plate. It was a dip. What was I supposed to dip into it? Forks full of lentils? or pieces of mahi mahi? All the components were well cooked and falvourful, I just found them confusing when put together on a plate.", "author": "D M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-14", "description": "Oh my god!  So good!  I have been to dinner and sunday brunch at this restaurant.  Both were fantastic, but the reason I will go back is the brunch small plates.  I had the biscuits and mushroom gravy and scrambled eggs.  My friend also had the salad and the salted potatoes which sounded a little odd but was really good.\n\nVery relaxed atmosphere and everyone who works there is super friendly.  I can't wait for their outdoor space to open!", "author": "Katy C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-06-04", "description": "Besides the utterly charming interior of this space that feels like a spacious alleyway that opens up between french farmhouses (or something), the food is spectacular. I arrived without calling ahead to ask about vegan menu items, because I assumed the pecan-crusted tofu dish would be fine for me to eat, but then it turned out there's egg and butter in the dish. My server was perfectly happy to pass my request on to the chef that s/he just throw together a vegan salad of some sort, whatever they could do. What I got was a plate that included the most deliciously sauteed mushroom (a really large, fancy and frilly looking one, no idea what kind), a dish of sliced zucchini with melty blueberries, and glass noodles with cracked pepper and rhubarb--all such exciting flavors! My meal was so well balanced and presented that it could have easily been straight off the menu, instead of whipped up on a moment's notice.\n\nAlso, there's something I love about the fact that the restaurant is tucked in a slightly hidden fashion right by the iron banister of a subway entrance.", "author": "Julia L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-11-13", "description": "I've been going here roughly four times a month since its opening and not once has the experience been sub-excellent. Sophisticated dining without a trace of pretension and man do they feed you! \n\nChef Tyler Kord really understands food and his exuberant seasonal menu makes it clear he's having a hell of a time inventing sometimes profound, categorically delicious dishes. He manages to create transcendental bites, exploding with unlikley flavors and textures, never discordant or cloying (succulent pork, fried haricots verts, creme fraiche, and kumquats) just goofy good harmony. \n\nIf there's steak on the menu GET IT. Be it grilled Wagyu bavette, a hangar or skirt, you'll find yourself muttering sweet nothings to the buttery tender cooked to perfection meat. \n\nAnd as you tuck into the ridiculously good sides: baked potato in cheddar cheese sauce topped with chinese sausage, broccoli, chimichurri, or how about kimchi pierogis and juicy hot blueberries accented with wasabi cream -- you'll get plain pornographic. But not to worry, put out the fire with a little Whore Water (tequila, cointreau, watermelon, jalapeno, lime, thai basil). \n\nMy menu of late, split with a mate, has been high on the fry: fried broccoli starter, its batter nicely tempered with grapefruit wedges and black bean mash. Followed by the impossibly light fries with cheeseburger (American cheese, fried pear, smoked french dressing) and Filet-o-Fish (classed up) and no I'm not a 1000s lbs. In fact I'm a gaunt ole chap and after all that there's still room for a Dark and Stormy shake, a deceptively strong version of the rum and ginger highball. \n\nDon't shy away from the vegetarian dishes -- veggies have never been so sexy, so complex! \n\nThe sleekly romantic space is also great for drinking or taking advantage of their happy hour, get comfortable at the bar for one of their tasty cocktails or thoughtful beer and wine selection and take down some $3 broccoli tacos - surprisingly satisfying. \n\nThe restaurant is impeccably managed, slyly formal with a genuinely friendly waitstaff, knowledgeable and enthusiastic. You get the feeling they are all pals of Kord who is often there to greet and bid adieu.", "author": "Saul T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-06", "description": "Can't beat $3 pints / $3 broccoli tacos for happy hour! Friendly staff to boot. No. 7 has quickly become my group of friends' favorite bar", "author": "Katie F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-02-26", "description": "I went here with a friend last week and sat at the high tables between the bar area and the dining area - and had a great time.  I was a fan of those tables because you get to watch the chefs.   Not only was the food (we had the fried broccoli, hangar steak and the scallops) good, the martinis come with their own little refill supply and you can drink them without spilling.\nMy friend was talking to the owner about the wines, and decided we'd have to go back there for dinner before we were even done with the meal.\n\nI decided we'd have to go back when the chef went behind the bar and started playing air guitar with a couple guys who work there...good times.", "author": "Jess R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-08-26", "description": "Another booze-only review. I have absolutely no freaking idea how the food is... well, except for the French fries. The French fries were good.  But I was drunk by that point.  But I'm pretty sure they were legitimately good.  Mmm. French fries.\n\nAnyway. It's really a rather lovely space in that Brooklyn upper-middle-class bohemian way.  I can't remember if they had exposed filaments or not, but it's that kind of place.  So, it's pretty, and makes for a nice date spot. \n\nI had a good martini. They have a good gin selection.  Well, they had my first choice gin (Plymouth) so I didn't need to investigate further.  You get the shaker remnants (leftovers? they're not really leftovers... anyway, I mean an additional portion of booze-y goodness) on the side.  They aren't quite as good on the presentation front as Bemelmann's, but, well, we're not at the Carlyle.\n\nNow, to the nit-picking.  I am skeptical of a place that refers to all beverages as \"martinis.\"  As in, \"I can make you a martini with Cynar and gin.\"  Um, no, you can't.  It's not a martini.  A cocktail, I suppose, but a martini is gin \u0026 vermouth.  Yes, I'm one of those obnoxious people. I could have worse quirks.  But it's both irritating and inaccurate.  And, dude, you're a bartender at a reasonably precious kind of place that styles itself a purveyor of decent cocktails, so stop misusing the terms (says the girl who doesn't know what the extra martini stuff one gets in the little carafe-not-a-carafe is).  \n\nFurther to that, I noticed they have Cynar. I like Cynar. So, I asked the bartender if he could make me something interesting with Cynar. This is a tactic that, until now, has always yielded something more or less decent to drink.  Usually better than decent. That's how I got the most amazing drink ever, the Cynartown, at Death \u0026 Co., and the good but slightly less amazing Cynar drink at Clover Club. But, alas, not here.  He pointed me to a drink on their menu with Cynar; it did not sound appealing. I asked if he could do something else: I really wasn't in the mood for a negroni á la Cynar.  He suggested a Cynar and soda.  Really? That's all you got?  Apparently, yes, because with further prompting, he admitted, \"I don't really make things wih Cynar.\"  Well, OK, then.\n\nNow, of course, I can't completely fault the poor dude. I mean, Cynar's kind of random. (Well, Project Parlor in Bed Stuy has it-- and made me a great drink, but I guess they are more cocktail-oriented).  I didn't really know what I want.  But, this place-- despite charging in the $12 range for cocktails-- isn't really in the same league as Clover Club, Pegu, or Death \u0026 Co.\n\nEven though I'd go back, and probably have a perfectly lovely time (I did have a perfectly lovely time, in fact), they get 3* (booze only, remember).  I'm perhaps unreasonable on some fronts.  Maybe I'm just cranky.  I'd totally give them 3.5*, but for some reason, I'm not feeling inclined to round up.", "author": "H H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-12-09", "description": "I was hosting a group for my wife bday tonight there. We were all New Yorkers and also all foodies, so please don't mess up our table.. sad for them they couldn't pull it off!!\nFood is excellent don't get me wrong but service was really bad.. You know those place were you need to tell them what to do, like \"were done could you please clean the table...\" this is one of them..\nChef I am sorry, the food was great but for a 400$ bill service was definitely not proper. I wont go into details because its fort greene, a place were restaurants thinks they own the clients.. well wake up, we still need to be satisfied. \nIts a place were i would recommend to sit at the bar to get the best service,,  \nIts sad to see that some place in Brooklyn think they are so cool that they can do anything they want, they are not the first!!\nI would recommend just for the food, and like i said the bar is probably the best spot.\nGood luck anyway.", "author": "John T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-06", "description": "Great food. Amazing drinks. Fun interior decor.", "author": "Tiffanie T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-24", "description": "I'm a fan. Sat at the bar with a couple of friends. They had some food. I had drinks. The bartender was great. He made some fancy mocktail for my pregnant wife. The dining area looks pretty nice as well , if a tad dark. I recommend and hope to be back myself.\n\nPros: nice bar tender; decent beer selection\nCons: Dark in the back; got a bit crowded as the night went on", "author": "Kyle S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-06-13", "description": "Good food and good atmosphere. There was some unexpected entertainment, when the front door became stuck and some people had to come in through a window. Only con is that the air conditioning blows directly onto some of the tables.", "author": "Universal R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-11-09", "description": "Who wants to eat broccoli tacos?  Me!  Believe it or not, they are good.  The menu is limited and has some odd food preparations but the tacos convinced me that the folks here might be up to something delicious.   Friendly service, too.", "author": "Sonya S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-31", "description": "brunch was so damn good. \n\nyou MUST try this: Fried Eggs \u0026 Nachos with beans, gruyere, pickled jalapenos, pho garnish. \n\nmimosas with fresh squeezed orange juice, quality coffee, and an attentive staff made this an amazing lazy sunday spot. we spent about 3 hours and loved every minute.\n\nwhile it's dark and cozy at night, during the day the sun pours in through high windows on both sides of the dining room, making the whole place feel like an outdoor patio  - except there's AC. *might be my new fave summer brunch spot.", "author": "Jody W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-08", "description": "Had a lovely dinner at No. 7 recently. I loved the atmosphere from a few steps away - it was a cold evening but the space looked open, warm and inviting. The staff was friendly and helpful with a good mix of low-key vibe and \"nice\" restaurant attention.\n\nThe small menu had me worried at first - thinking that we would be limited. But my friend and I were pleasantly surprised by the options. It was refreshing to have a menu that felt curated; it actually made choosing a meal easier since our minds were focused by the choices presented.\n\nMy friend had the fried broccoli and the fish (I believe it was grilled grouper, but can't be certain). I had the soft boiled fried egg and the hangar steak with kimchi pierogis. Everything was delicious and beautifully presented. Each dish seemed to have something a little surprising, a little unexpected which kept us sharing bites across the table. The piergogis had a good kick to them which was a great addition to my meal. \n\nThe stand out, however, has to be the coconut pudding for dessert. I don't even like coconut and nearly dove head first into the bowl. The texture, the flavor - it was absolutely sublime. We accompanied this with two selections from their digestifs - a grappa for him and a stellar black muscat for me.\n\nAm looking forward to going back and trying more of the menu - specifically some of the specials which looked amazing when brought to neighboring tables. Also looking forward to how the atmosphere will be in warmer months as it seems like it would be a lovely spot on a summer evening.", "author": "Laila C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-27", "description": "mmmmahvolous. \nI went here for the first time yesterday: as a reviewer said previously, the hamburger is amazing, and you HAVE to get it with the spicy pickles and fried egg. You will have no complaints, and would be crazy not to get it.  If you alone are going to eat the fries, get the half-order.  The full-order is gargantuan and addictive.", "author": "Britta K."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-01-02", "description": "Overrated. The uni-strawberry-rye appetizer was gross.", "author": "Rory B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-03-20", "description": "Décor and service are great. Sadly, the food doesn't live up to either of those or the hype.", "author": "M T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-01-19", "description": "eat somewhere else, then come here for the BAR. like another reviewer said, everything is way too salty (and this is from someone who loves their salt). my burger was greasy and very rare. slimy even without the sauce. i didn't eat my dinner. i guess that makes this a not-very-good restaurant but what a pretty bar. great atmosphere. i hope they'll get a new chef because it's one of the prettiest places to eat in fort greene.", "author": "Chauncey Z."}], "servesCuisine": "American (New)", "priceRange": "$11-30", "name": "No 7", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "7 Greene Ave", "postalCode": "11238", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/lt-w9NOIuTSmE73S6_jLew/ls.jpg", "@type": "Restaurant", "telephone": "+17185226370"}