{"aggregateRating": {"reviewCount": 364, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-09-14", "description": "My wife and I ate here last rainy Friday evening. This place is really taking off, they're in their \"soft opening\" phase, but every table was full, and with good reason. In a restaurant saturated borough, 7 stands out for it's innovative food pairings. For this visit we stuck only to the appetizers, but 4 dishes split between the two of us was plenty. I ordered the pork and soft boiled eggs and the salmon crostini with roasted pears. My wife ordered the green salad and for the life of me I can't  remember the 4th dish, egad, why do I have senior moments when I'm blogging. Oh, I remember, it was the deep fried broccoli with black bean dip. Anyway the dinner was preceded by a butter bean puree with a very good crusty bread. The butter bean dip was very creamy, at first I thought it was pureed cauliflower and cream but the waitperson corrected me. It was served with lightly pickled veggies. The pre-appetizer trio was excellent, it was really nice to get something other than gooey bread and rock hard butter. The broccoli was spectacular, when was the last time you've had spectacular broccoli? The salmon and grilled peaches was a good pairing, the peaches were just acid enough to cut through the oily salmon. The pork and soft boiled eggs, though a nice looking presentation, was surprisingly underwhelming. There were no high notes to the pairing, the pork and the egg were just kind of bland. I didn't get to taste the green salad, my wife loved the grapefruit and green mix so much she wouldn't share. The daring food duos continued in the dessert menu. We shared chocolate cake and a ginger egg cream drink on the side. The idea is to have a piece of the cake and then sip the ginger. It worked for me. I also had a very good grappa that's hard to find in a Brooklyn restaurant. The  wines we had were serviceable but didn't match the innovation of the menu. The decor and service is great, the owner came by to say a few words to us and to show the flowers his mother sent. And you know I  didn't even feel the rumble of the C train underneath.", "author": "kevin b."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-02-25", "description": "Excellent food, and nice atmosphere, as usual.  But when the waitress spills wine on the table and the patrons, and then offers a \"splash\" of replacement wine there's a problem.  A waiter has it in their power to address mistakes.  Skimping is foolish..  Makes you look cheap and ungenerous--did you actually replace what you spilled?  Why should this even be an issue.", "author": "Carly Q."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-10-25", "description": "This is one of my go-to places for Sunday brunch.  The fried chicken at No. 7 is excellent, some of the best in the city, in my opinion.  The grits with seafood are delicious as are the grits with sausage.", "author": "Kasia Z."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2009-06-26", "description": "Took the time to join yelp just to write this review.\nMaybe the WORST experience eating food aside from a Bob's Big Boy I stopped at when I was 10. If I were in charge then, we would have kept driving...\nNo. 7 -Should be called ZERO. Upon walking in and being faced with a swarm of flies I thought about leaving, but my other half was not as turned off as I was. The bread came with that bowl of paste. What was that? They don't bother to tell you, just drop it down and leave. The fried broccoli was disgusting! The hard oily outer crust was nasty and the inside was a runny mess. It tasted like the oil had never been changed. I ordered the chicken with truffle and corn. It came along with some peas and was basically a sorry fried excuse for a salt lick. My partners dish came in a bowl like a soup (but was a fish dish) with some rice in another bowl. Really, this was a total waste of money. Too bad they spent all the money in the first 10 feet of the place and just gave up in the back.", "author": "share s."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-04-26", "description": "Just went for brunch for the first time and it was amazing! I got two small plates - the grits and the poached eggs, and it was a perfect size for me.  The grits are two die for, and tossing in the poached eggs on top was perfection.  The rest of the my party had fried chicken (moist and delicious), the brisket and the egg sandwich, all of which they loved.  Already planning my next meal back! (Hoping some people want to split some waffles and fried chicken with me!)  Portions are on the small side (except for the chicken), but enough to fill  you up so they don't need to be any bigger. Not walking away hungry!", "author": "Dahlia T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-05-26", "description": "Fried broccoli with black bean dressing? Amazing - it totally lives up to the hype.  The fried tofu with strawberries, corn and guacamole was fantastic. The oysters came with a fennel mignonette.  Never would have thought those two tastes could possibly go so well together.  This was our first time here - definitely won't be the last!", "author": "David M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-03-14", "description": "first and foremost- brunch service is always amazing.  what a friendly attentive bunch of servers.  they are great.\n\nbut i am sad to say the i used to love your brunch- love, love, love it.  why did you change your menu? booooo....\n\ngrits used to come out piping hot with broccoli and mushrooms hiding under wonderfully melted cheese... mmmm.  now everything is seperate.  broccoli and mushrooms cold on the side, cheese barely melted on top.  sad looking cold poached egg on the side. you used to be perfection.\n\nfried chicken sandwich gone? why oh why?  so sad. fried catfish sandwich that we got in its place was ok, but the  american cheese was not melted at all, and just not as good.  \n\nand where the heck did the biscuits go??? that was the best part of the meal.  tater tots made us happy but they were sooooo salty.\n\nyou were my favorite brunch spot in brooklyn.  maybe we'll try again in a few months...", "author": "brooklyngirl g."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-12-21", "description": "just got back from there. probably one of the best meals i've had in a long time...\n\nfor starters my friend and i decided on the pork salad, which was amazing, the pork def. had a korean influence and was perfectly matched with the fried/soft boiled egg and a small arugula salad  (seriously, i thought about canceling my entree and just ordering more of it) my friend got the app. special which was a bread salad w/ rock shrimp and chorizo which again was amazing, the shrimp wasn't overly fishy and the bread and dressing were amazing. \n\nfor entrees we got the scallops (with blood orange brown butter and a salsa of possibly sweet potatoes?)  the scallops were huge, seared perfectly and really tender. we also had the braised brisket which came in a cute little pot with small yukon gold potatoes and baby buk choy and this really great gravy/broth on the side was a horseradish creme and a grain mustard which complemented the meat perfectly-- also the meat was beyond fork tender and just melted in your mouth- when the waiter said it was almost like short ribs i didn't know what to think but i got it.. the only thing that would've made me happier was if it came with some of their great bread to dip in the broth. \n\nour waiter also recommended a great bottle of wine to go with it (it was white and stood up quite well to the beef) he really thought about what we ordered and how to suit it.. on the drive home my friend and i were still talking about how amazing the service was and how professional they were without making you feel like the place was stuffy, its like it came effortlessly to them. \n\nfor dessert my friend got the eggnog pudding and i had the apple tart. the  pudding was great but very rich and heavy, the apple tart i'm still on the fence about, i loved the goat cheese mousse and how it wasn't over powering and the apples were still fairly crisp the only thing i really wasn't sure on was the bottom layer (cookie?) it had a really strong flavor that sort of over powered the apples. \n\ni also really liked the fact that as you're leaving the chef's acknowledged us and it gave us the chance to thank them personally for such a great meal\n\nall in all though it was an amazing meal and i can't wait to go back even if it's just for a drink at the bar and the pork app.", "author": "dana s."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-07-22", "description": "Great cocktails, friendly bartender, had fun. (review of visit 6 months ago)", "author": "Max D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-04-04", "description": "Wow, incredible food, great staff and so cute.  It is literally right off the metro so easy to get to. Can't wait until the garden opens!", "author": "nn p."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-03-14", "description": "An amazing new fun restaurant!  I love it every time that I'm there.  Excellent and interesting food and drink.  The staff is very friendly and knowledgeable for recommendations.  This swanky place is a great place to hang out.  Excellent music choice as well.  The interior design and crowd have have a positive and relaxing vibe.  The worn wooden floor and tables near the bar, integrated with the wall, is a throw back to the 1920s.  This is beautifully juxtaposed with beautiful white marble countertop at the bar and arched tin ceiling which is painted white with a bit of blue hue.  I am anxiously awaiting warmer weather so that they can open up the large back patio, which will have a neighboring garden in the near future.", "author": "Steve M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-03-03", "description": "I wrote this review on another website a year ago, but No 7 is still on my top 5 list of restaurants in NYC and i just joined yelp so i thought it was worth posting.  I've been here no less than 5 times and have enjoyed every trip. \n\nNo 7 is a great addition to Ft Green, and worth the trip from Manhattan. We had the Tuna, Fried Broccoli, and a homemade sausage (special) for appetizers. All were fantastic. The fried broccoli was unlike anything we had ever had and absolutely delicious. I don't like broccoli and yet I loved this dish. It is what I remember most about the meal. The tuna on a pear slice had several subtle flavors that worked perfectly and it was presented very elegantly. Excellent. For the main course, we had the steak with kimchi dumplings and  both items were very good. The scallops (special) was also very good with several ingredients that created a full flavored dish. The wine we had was a French blend that was terrific and not overpriced ($32). They also had an organic IPA on draft that was very good.  Overall, there are lots of great things about No 7. Great prices (nothing on the menu is over $20), interesting food that is memorable and delicious, cool atmosphere, a concise and focused menu and a very hip wait staff. Highly Recommend.", "author": "Benjamin H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-02-20", "description": "Overall, the final impression of the restaurant suffered from the high expectations set up by the bohemian-cavernous style decor, a great draft local beer list and delicious free appetizers given at the table (bean puree with marinated cucumbers). But the excitement quickly fizzled upon receiving the entrees. The chicken was a disappointing roulade that while tender was practically tasteless. The half-soggy crust around it- quite bland while the beans that came with it, underdone. My entree of cod was significantly better but overall suffered from too much thought and not enough flavor. The fish was a bit under-cooked and didn't really go together with the (perfectly done) salty spinach  and a crispy (crab/fish?) cake on the side. Overall, though the elements were there, they didn't go together and left a confusing aftertaste. The desert, a Warm Chocolate ginger bread pudding with cherries, mint and melted tapioca tasted only a little less incongruous then it sounded.  The separate elements were great but together they created a mush of flavors. On the whole, it seems that the chef in the restaurant was competing in a Top Chef quickfire challenge, trying to put as many different flavors together as possible to impress but failing to create a balanced and satisfying meal in the end.", "author": "Dina L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2009-03-08", "description": "the service could definitely use some work. remember when you order the fried chicken at brunch that you're only getting chicken. no sides. just overcooked somewhat stringy chicken. the atmosphere is nice, and i LOVED the hot chocolate. perhaps i should try dinner there--seems to be better (according to other reviews)...", "author": "Sara N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-10-10", "description": "We ate at 11:30ish and the food was as good as coming in at 8. So many flavors and the meat (steak and chicken) were very moist. And despite some reviews i thought the service was very friendly and attentive. Can't wait to go back!!", "author": "shannon B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-02-25", "description": "i had heard good thing about this place so i was a little disappointed with the food. i had a special appetizer which was bacon on toast - which turned out to be ham on cold toast - the meat was not fried.  i was intrigued with the kimchi peroggies - which i think was the best thing i had that nite.  my steak was salty and the dessert was nothing special.  my friend had the scallops which she said were salty too. not sure if i will return", "author": "suzanne w."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-05-13", "description": "Excellent food: inventive but not silly, fresh, unexpected. Very pleasant service. Nice decor (except for tables: cheap and raggedy looking; this cannot be a design intention.) Portions are NOT small, in fact neither my date nor I could finish our food, no matter how delicious. Good wine (but they did get a pretty basic cocktail wrong, and the sparkling wine was, well, sparkle-free and on the room temperature side). Definitely going back", "author": "J C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-29", "description": "Yuuuuuuuuum. Loved the scallops. And I really enjoyed the atmosphere and watching the chefs cook the food. I definitely recommend this place.", "author": "Melissa D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-12-13", "description": "Everything is great about this place! Incredible bread, wine, menu choices, atmosphere, mixed crowd, and staff. And, it's affordable. My Italian wine was perfect ($9) My appetizer of fried broccoli was unique and amazing - the main course of scallops/rutabaga\u0026chestnut w. key lime butter was incredible - and my warm chocolate gingerbread pudding was deliciously filled with many interesting tastes. For $50 it was a great investment - hard to find these days! Will return often and happily recommend.", "author": "Anne R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2009-02-16", "description": "the staff was just plain rude. well, less the entire staff, more the BARTENDER. yeah, you and your godawful tattoos. i mean, really, wtf is that layout, man? \n\nyou make me want to rip that rat you call a mustache off and beat you with it!\n\nHe gave our seats at the bar away, because some guy claimed he had a large party that was ordering food. That dude's party (a) was not there; and (b) didn't show up the entire HOUR we were there after the bartender took our seats. D-BAGS. First rule of thumb: if they don't call in advance, make sure their party's there.", "author": "ascheras g."}], "servesCuisine": "American (New)", "priceRange": "$11-30", "name": "No 7", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "7 Greene Ave", "postalCode": "11238", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/lt-w9NOIuTSmE73S6_jLew/ls.jpg", "@type": "Restaurant", "telephone": "+17185226370"}