{"aggregateRating": {"reviewCount": 364, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-06-28", "description": "Hmmm...When there are only five options on the menu, it may be a problem if you are out of one of them. That's like a 20% reduction...Without the arctic char, my options were reduced to hangar steak, tilefish, fried chicken, and mushrooms with zucchini. And let me just tell you, there is no way in hell I'm paying for someone to serve me something that didn't require some effort to butcher, gut or at least peel. So the zucchini was out. \n\nAs for the rest of it, regardless of the assurance of our waitress, the food was under-portioned and overpriced. And I know its not always about the money, but ok fine, listen, I'll eat at Jean Georges and drop  $150 for a meal that makes me melt out of my seat, but I just cant abide by spending $30 for \"meh\". \n\nI did go for the tilefish. meh.  Ok, the scallops appetizer was pretty good. and they serve this buttermilk dip for their bread, which i thought was tasty. The ambiance was great -- very light and airy. The drink menu confused me, but this often happens to me in BK.", "author": "Monique S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-25", "description": "Great bar, bartenders and waitresses are very cool and food is quality. Only critique is their broccoli obsession.\n\nI like broccoli as much as the next guy, but it's pervasive...pervasive broccoli at No 7. Just sayin.", "author": "Matt O."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-15", "description": "I had dinner at No.7 Saturday night. The place definitely felt warm, had dim lighting, nice decor, and the seating made it feel comfortable/almost casual - with banquette seating along the walls. The hostess was friendly and seated us right away, and the waiter came over, soon after,  to rattle off some specials and take our drink orders. \n\nNow to the important part - the food. For an app, we got the mussels. Some of the most plump, fresh mussels with flavorful broth. \n\nFor my entree, I ordered the chicken with blue cheese gnocchi and broccolini. I was really surprised with the portion because it was much larger than I had imagined. The chicken was done to perfection with a nice crunchy outer layer. The blue cheese gnocchi were soft and had blue cheese flavor without it being overpowering. The broccolini were cooked just as well. \n\nMy dinner companions ordered the wagyu beef which I tasted. It was also cooked perfectly at a medium rare, and was tender and flavorful. Again, it was a much bigger portion than I had imagined for a reasonable $24, I believe.\n\nIn short, if you're in the mood for great food, presented well, in a comfortable atmosphere, for a reasonable price, No.7 is the place to go.", "author": "Marivic L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-16", "description": "My favorite neighborhood brunch place!  Broccoli tacos, pancakes, scrambles, fries, coffee: all worth coming back for.  Vintage-minimalist-chic enough that you know you're in Brooklyn, but relaxed and friendly enough that you're delighted to be here.  Great service, too.", "author": "Beth K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-11-02", "description": "Nice decor, food is good. Unfortunately, the wait was way too long. We managed to get a table right away (on a Sunday for brunch) but the service took forever.", "author": "Olivier S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-09-26", "description": "I had brunch at No.7 over the weekend, I have to say the only think I like is their only and vegetarian taco w combination of flour soft and hard shell on the brunch menu. Stir fried broccoli and bean spread def works magic combine w peanuts!  J had hanger steak sandwich, for $16, it came w three tiny pieces of overtly chewy and almsot too raw skirt steaks and a half plate of salad, If the sandwich was better maybe I wouldn't have mentioned the price tag, it was funny to see the expression of J chewing on his sandwich.  we also shared an order of pancakes came w 2 pieces, J had chocolate chips and I had blueberry, honestly, we were very disappointed w pancake that was not fluffy and bland;   I like their rustic and simple decors w high ceiling dining room area in the back, toward the front, there's a lounge seating area, followed by  a bar in the center of the room. Service was casual and friendly, we had to ask to have our waters filled once when it was kind of slow afternoon. No.7 would have to entice us back w a better food quality for us to go back.", "author": "Karry L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-09", "description": "I have been to No. 7 three times since moving to Brooklyn five years ago. The past two times I went with my boyfriend and both times were outstanding. The hostesses were very gracious and before a movie were able to seat us before a later reservation came in. I was so grateful for being able to fit us in for  a quick bite! The brussel sprouts are OUTSTANDING as are the french fries... maybe my favorite french fries in BK. The real show stopper at No. 7 though is the cheeseburger. Amazing flavors, delicious beef, and a hearty portion. You can't go wrong with the burger; its really something out of this world!", "author": "Coupe Et C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-26", "description": "Finally came to No. 7 on a rainy Saturday after hearing great things. It didn't disappoint. \n\nThe free bread came with a delectable white bean and cheese dip and thin-sliced pickles.  For our mains, the wife and I enjoyed the General Tso's Filet o' Fish and the Bratwurst Sandwich.\n\nThe fish sandwich, which, despite sounding like the love child of two classic late night drunken binge foods, was fantastic. The fish was fresh, perfectly breaded, and fried to a golden brown. Topped with caramelized onions, the sandwich had only one minor flaw--a little too much of the sesame-ginger sauce.  But this was easily fixed with a scrape of a fork.  The dish was rounded out by a cilantro mayonnaise and paired with buttered broccoli.\n\nThe bratwurst was mild, but perfectly spiced, served on a hamburger bun with arugula.  Not as interesting as the fish sandwich, but very solid.  The buttermilk cream sauce it was paired with complimented the sausage nicely.  This dish was served with small serving of miso-braised collard greens and kale, which was unfortunately overseasoned.\n\nService was great (and very quick), the atmosphere was quaint  (the dining area looks and feels like a solarium), and all in all, I will have to add No. 7 to the list of things I love about Fort Greene.", "author": "Geoff C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-22", "description": "I took my wife here for a birthday celebration via a how-about-we deal. The ambiance is nice, the casual warmth of wood and simplistic furnishings. We sat in the back at a corner booth that made the whole evening plush and relaxing. The staff were all friendly and helpful.\n\nWe started with a couple cocktails which were solidly crafted and delicious. Our choice of appetizer was the shrimp cocktail. It didn't seem particularly inventive until we discovered the flakes of roasted garlic that gave it a fantastic flavorful punch.\n\nMy wife had the pollock and squid which was marvelous and came with some fantastic roasted fingerling potatoes. I had the paillard of beef, which if you don't know (I didn't) is a preparation where a piece of meat is pounded thin. A quick search I did just now says that it's an older french term that has largely been replaced by the term \"escalopes\". So there you go, a bit of trivia for you along with the review. It was marvelously cooked and the entire dish was fantastic,\n\nWe also ordered a side of french fries, because 1) they were the thinly cut fast food style my wife adores and 2) it was her birthday celebration so why the heck not. The fries were delicious, but I'd advise against them if you're the type who hears your mother's voice chiming in with a guilty bomb whenever you don't clean your plate. A side of french fries could probably have been my entire dinner; it was a huge portion, especially given that it was only $5 (and they didn't even charge us for it, don't worry, I added an extra $5 to the tip). \n\nThe dessert was the creme brulee. It came with several huge juicy figs surmounting its crispy caramelized crust. Just marvelous.", "author": "Will M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-02-24", "description": "Came with a friend for dinner and i was pleasantly surprised. I walk by No.7 on a regular...I used to live around the corner and I get my hair done at Time which is next door, and I never ever thought to go inside. I am so happy my friend suggested No.7. I arrived before my friend and they still gave me a table. You know at some places they will not seat you if the entire party isn't present. The food was great. We order the chicken sandwich and the cheeseburger. We split both so we both could enjoy each sandwich. The chicken sandwich was good, but I enjoyed teh cheeseburger more. IT was juicy and tasty. The french fries were delicious...I read a review of someone raving about how good the french fries were, so I was excited to try them. Let me be the first to tell you that the reason why they are delicious, is because they are McDonald's french fries. Yes you read that correct... they are the same french fries they use at Micky D's. I am not mad at them....they know what people like...and that is McD fries. I will most def go back for brunch one weekend.", "author": "Bev G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-01-28", "description": "Nice place!  Shame about the food though...\n\nThe best part of the meal was the beer selection while waiting for a table.  Also the atmosphere is typical new Brooklyn.\n\nThe menu sounded unique, bordering on shades of schizophrenia, approaching the desperation of a Chopped contestant.  The Chopped contestant would do better.  I'm all for the unusual and interesting ingredients (kohlrabi, celeriac, huckleberry, etc.), but they should make sense together!  Ingredients shouldn't be used only because they are unusual.  \n\nThe fried broccoli?  Pasty for veg.  Kind of like bad Chinese food.  The lychee ruined the chicken dish, which otherwise would have been good, edible comfort food.  As for the pork/duck dish, it honestly tasted like a bad thanksgiving style TV dinner that you bought in college because you were poor and hungry.  Creme fraiche?  Surprise!  Sour cream.  \n\nRan out of there before dessert was ruined!", "author": "Jason P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-03", "description": "BROCCOLI. TACOS. If that doesn't say enough to get you to go - go for the delicious cocktails. Because they're unreal (in the best way that is). It's also the PERFECT brunch spot! GO!", "author": "Kathryn C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-31", "description": "No 7 is an absolute gem!!! Food so good, it'll put a smile on your face!! Aside from a couple cocktails, I had the Double decker broccoli tacos - I kid you not, these were life changing!! And the Fried fish tacos - delicious with a capital D, and recommended with the homemade no. 7 hot sauce. Both plates get my highest recommendation!", "author": "Jonathan Z."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-07", "description": "First time here was great. Food is simple yet great quality. Enjoyed the service--not intrusive yet attentive. Will definitely return!", "author": "ZACK R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-01-05", "description": "They need better ventilation for sure as the kitchen is in the dining room. I don't like reeking of food after I've left a restaurant. Also, for a restaurant so close to Barclays, they need to really figure out the rush dining prior to show / game times. Hire more staff? Offer a prix fix menu? Because, this place really could be quite good if food was all that you focused on.", "author": "Joanie K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-09", "description": "I've been here at night before; this was my first time coming for brunch. I was a bit put off by the daylight. If you've ever been to a nightclub when the lights come on, maybe you'll know what I mean...all of a sudden, the red velvet sofas that seemed swanky in the darkness are tattered and covered in stains? \nSo yeah. The owners of this spot really need to make some basic upgrades. The leather banquette has come apart in a few places and has been covered in patches with cloth. As a girl in a short dress whose bare legs were feeling the seams between the leather and the cloth, this seemed janky. Not to mention looking down and seeing a ton of crumbs and dust in between the cushions. The skylights overhead need some shades over them, otherwise on a hot summer's day you're sitting under blazing sun watching your cold mimosa turn into room temp OJ, as mine did. The curtains over the door were uneven and seem very DIY, in fact, I guess that's the overall vibe of this place in the daylight - a DIY decor, when, with just a little bit of dough and some attention, it could get back to feeling like a professional dining room. \n\nAt any rate, as whiny as I was about the interior while we were waiting for our food, I will say that the service was great and friendly, and when our waitress brought out our order, she threw in some pancakes as well because she felt we had to wait too long. It was a lazy Sunday, we were talking and weren't even feeling impatient, but I was pleased that she was paying more attention than we were and thought to comp us some yummies. \n\nWe got the kimchi nachos, the fried broccoli tacos (my boyfriend suggested they name them \"taccolis\" - you can have that for free, restaurant owners), and the free pancakes were the chocolate, orange, ricotta ones. All very yummy! \n\nThere are new spots popping up all over this neighborhood, though, so, in order to keep their competitive edge, they need a little face-lift.", "author": "Karyn S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-01-01", "description": "Not for the New Years feel good evening that I had envisioned. We had to wait an hour for our table which dampened everything. The food was pretentious and not good at all. We joked that it was all from Trader Joes and reheated. Our meat with broccoli cemented this. The broccoli was actually still cold in the middle, frozen veggie style. On New Years Eve no less! Super!\n\nIt drives me crazy when restaurants want to charge you over 100 a piece for a fancy meal, but they let you wait for an hour without saying anything, then serve you very mediocre food. Small gestures to customers like a free glass of wine or the lack thereof say a lot about the quality of a place. So does the food--yuck!", "author": "Wendy T."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2010-12-09", "description": "Goddam I hate this place.  I've been here 3 times now, was forced to go this last time and only had drinks, and my dislike of No. 7 has only grown.\n\nFirst, their menu is kitsch, unfocused, and generally terrible.  I think they know this and that's why they change the menu so often and so drastically.\n\nSecond, their wait staff, bartenders, and, judging by the quality of food, cooks are all really bad at their jobs.\n\nThird, the food is atrocious.  The plates showcase amateur skills all around and every component in every dish is wrong: too salty, bland, poorly paired, undercooked, overcooked, or just plain disgusting. \n\nI once ordered a waffle at No. 7 and it was inedible.  They fucked up a waffle!.... astounding.  Also, their mixology program is similarly a shambles.\n\nThe only nice thing I can say about this place is it occupies a wonderful space.  Perhaps a real restaurant will make use of it one day.", "author": "Carlin R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-07", "description": "One of the best burgers I've ever had. Small but good beer selection. Check it out if you're in the neighborhood.", "author": "Canan A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-04", "description": "This place has the absolute best burgers I have ever had. They cook them to perfection, as you ask, and the quality of beef is amazing. Their beer selection, although small, is also perfect - you can always find something delicious that will tickle your taste buds and complement your meal.\nI come here for burgers and beer, but they also have a nice, affordable wine list.\n\nThe menu and beer selection change frequently, but everything is, at the very least, good. Of course, nothing compares with the burger, but the burger is just completely out of this world. Broccoli tacos seem to always be on the menu and part of the happy hour - and they are absolutely delicious. Their pickles are also amazing. \n\nI have been there at least ten times and have always had good service.", "author": "Alyssa V."}], "servesCuisine": "American (New)", "priceRange": "$11-30", "name": "No 7", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "7 Greene Ave", "postalCode": "11238", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/lt-w9NOIuTSmE73S6_jLew/ls.jpg", "@type": "Restaurant", "telephone": "+17185226370"}