{"aggregateRating": {"reviewCount": 364, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-10-26", "description": "Met a friend for an early dinner here the other night.  Overall we had a solid time.  Place was about half full when we came in...it was only about 630.  Started with cocktails.  I had a Gin Genever or something like that.  It was very tasty and well-made, and I believe $12.  Pretty typical for these new fancy Brooklyn restaurants.  For dinner I had the half chicken.  Yes it was a little on the salty side, but I really enjoyed it.  It was about the most moist chicken I've ever had at a restaurant, and the sauce and vegetables complemented it nicely.  My friend ordered the pork chop special which was really like pork chop 3 ways.  His plate was substantially larger than mine, so might be a good choice if you have a monster appetite!\n\nOur waitress was adorable and friendly.  She offered us recommendations for cocktails and food and was attentive.  I did like the design and atmosphere of the place.\n\nI'd probably give the place 3.5 stars, but I rounded down because exiting the restaurant proved to be slightly treacherous.  The door is right in front of the subway entrance and there were a couple steps that seemed hard to navigate.  Or maybe I'm just extremely uncoordinated.  Overall, I might return here if someone else suggested it, but with so many other similar places in the area, I'd probably choose to try others before returning here.", "author": "Jeff R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-23", "description": "Lovely interior. Great with a group. Service a little neglectful and sloppy but my entree was truly spectacular. I ordered a fried tofu dish (that is actually no longer on the menu) with guacamole, corn  and strawberries. It was one of the best dishes I've had. Intricate and complex but completely cohesive and comforting. The others at my table ordered somewhat disappointing dishes (the Tilefish, Roast Chicken) and the cocktails were nothing to write home about but I would easily go back again for their vegetarian dishes. \n\nPrices, little steep (maybe not for NY though).", "author": "Gretta H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-09", "description": "Love, love, love this place.  With great veggie options, it a surprisingly chill neighborhood joint that will now be added to our regularly scheduled dinner locales.  On top of some of my newly appointed favorite food items (broccoli tacos, butter bean dip, general tso's fish sandwich), the drinks are inventive, and just strong enough to add to the fun but still be tasty.  And, the location itself is pretty great - almost hidden door that leads to a great bar scene and even better dining room topped with skylight windows.  No. 7, we'll be seeing you real soon.", "author": "Jeanette D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2008-11-24", "description": "We both got the skirt steak + pierogies + puree + broccoli rabe.  We also split a bottle of wine.\n\nThe good:\nThe flavors of the dish were well matched and harmonious.  \n\nThe bad:\nMy pierogies were undercooked and barely room temperature.  The rabe was too salty (and I love salt).  The steak was amazingly prepared and a great cut -- but 1/4 of the portion we get at our favorite TriBeCa steak place (Landmarc) for essentially the same price.  Since when did eating in TriBeCa become a good value??!\n\nThe ugly:\nThe service was terrible.  The waiter was pushy (he as been pushy with my fiancee in the past).  As soon as we finished our meal (which was not a lot to eat!), we had more than 1/2 the bottle of wine left.  The waiter and all the staff circled us like vultures (checking in on us every minute or 2, picking up our bottle of wine to see if we'd finished it, etc.) and made us feel totally unwelcome and rushed.  I've actually never experienced such aggressive and obvious 'turnover tactics.'\n\nI will never, ever step foot in that place again.  If I'm going to spend money on a meal and wine, I want to at least feel like I can have a conversation, enjoy myself, and finish what I've purchased.  \n\nOh -- and I was still so hungry afterwards that I had to get a slice down the block.", "author": "J. N."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-12-16", "description": "Drinks were good. Service wasn't the best. Took a while to make our fancy cocktails while the staff chatted behind the bar. But they were great cocktails, and I had a hard time deciding which one. I'm looking forward to going back to try another one.\n\nDidn't try the food. That night there just wasn't anything on the menu that struck my fancy. Bit of a limited menu, but could be great. Maybe next time. \n\nI love the decor and atmosphere. Would bring a date here or a group of friends.", "author": "Allison W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-04-14", "description": "It should REALLY be called \"No. 1.\" \n\nIf I could eat at No. 7 every day, I would. Unfortunately, Recession Specials are all the rage these days. But if you feel like treating yourself one night, head to No. 7.\n\nGranted, I've only been here once. But once is enough to know that I want to return, and enough to write a Yelp review recommending you go there, pronto!\n\nMy group splurged and we each ordered an appetizer, an entree, and split a couple of desserts. For an appetizer, I got the tuna with korean pear and basil. It was perfect! Just enough tuna served up in bite-sized pieces that teased your stomach just the way you want it to.\n\nFor my entree I ordered the hangar steak. It. Was. Heaven. I can't even describe how tender the meat was. It was packed with taste, and it may have been the slowest I've ever eaten anything because I refused to ever be done with it. But best of all are the kimchi pierogies it comes with--a little bit of spicy, a WHOLE lot of deliciousness. The butternut squash side was really good too. All the components worked so well together.\n\nOf course we weren't going to turn down dessert. We shared the butterscotch pudding and another chocolate desert that I can't remember. But it doesn't matter because it was all delicious.", "author": "Brett W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-01", "description": "Had my first dinner upon moving back to NYC at this joint.  It definitely has a really cool atmosphere, great bar and really solid drinks/beer.  Tasty Manhattans served w/ sidecars and great beer selection, I had the Pale Ale - recommended.\n\nThe food didn't quite live up to my friend's hype (sorry guys).  We had some fried broccoli and fries to start, both were great -- more on fries later.  For mains, it was the roasted chicken and hangar steak.  Steak was solid, but the Roasted Chicken was super salty, they should maybe tone that down a bit :)\n\nThe fries though...the fries were fantastic and they came w/ this dijon/mayo type dip that was so yum...\n\nI had it as a three star until I started thinking about the fries...four stars it is.", "author": "John R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-02-15", "description": "love love love this place. What more could ask for the food is phenomenal, and zero pretentiousness. \nwent for Valentines day and had their buffet, so inventive and amazing. The choice of ingredients are so creative and strange you'll wonder what your getting yourself into but just trust it will be amazing. \nalso the cocktail list is always wonderful and uses great fresh ingredients.", "author": "Olivia A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-11-11", "description": "C Train commuters will only be ten yards away from the Lafayette Street stop exit when they find themselves sipping $5 and $6 beers at the stylishly well-worn bar of No. 7, the debut restaurant of Jean George alum (Perry St.), Tyler Kord.  \n\nWhile the dining room is further from the taps than the taps are from public transportation, nothing about the menu is pedestrian.  Instead, Kord has written a menu that, while terse, borrows from the ethnic diversity of the outer boroughs--kimchee pirogis, Asian pears and Israeli couscous--but still travels to Manhattan for staples that well-traveled diners expect--hangar steak, pork chops, seared tuna.  \n\nNews of No. 7 has been uproarious, given the Brooklyn address (and in Fort Greene, rather than Williamsburg or Park Slope) and well deserved, if not without certain shortcomings.\n\nThe space is well conceived: low, comfortable couches and armchairs sit in a window-paneled nook and look out onto the bar where a number of American beers can be had at reasonable prices.  A patina of age and distress that registers as one wanders over to the hostess stand behind which are three beautifully designed banquets that easily seat five in loquacious horseshoes just across from the pass where the bar adjoins to the open kitchen.  An ivory dining room nestles two-tops around the remainder of the restaurant's perimeter and a larger table still maintains its autonomy.  \n\nThe open kitchen is a sterling touch as it lies in the margin where diners may or may not want to put their attention.  From there, Kord and two other cooks perform a type of East meets West fusion that has moments of great success but also produces certain muddles that would escape even E.M. Forester.\n\nOur meal began with delicious crusty bread served with a buttery butter bean puree and quick-pickled cucumbers, which served to whet our appetite.  An appetizer of tempura broccoli and black bean hummus offered entire stalks of the verdant vegetable, but the black hummus was superfluous as it could not withstand the size, heft or texture of its pairing; furthermore, the florets had been packed with some cheese or curd whose texture mirrored the smear of tahini and black beans. \n\nTwo salads came with the same pile of beautiful baby greens dressed in citrus vinaigrette that was crisp, clean and wholly appropriate.  An \"everything focaccia\" with a goat cheese spread was poorly conceived and should have been argued against.  Previously, the dish was plated with a brioche crouton, but the focaccia (a sad take on the everything bagel) cheapened the dish and made it seem like a lunch special in midtown. In comparison, that same salad served with thin sliced pork, whose color and flavor echoed the red pork that hangs in Chinatown windows, and a panko-crusted and fried soft-boiled egg was a highlight of the meal.  This egg, ingenious and unctuous, gave the salad and the pork counterpoints in mouthfeel and fun.\n\nThe hangar steak was as tender and rich as that treacherous (but cost effective) cut can be.  It was artfully plated on a bed of butternut squash puree crossed by deep green broccoli rabe and three kimchee pirogis.  The much-anticipated pirogis disappointed: they had none of the succulence of ravioli, little of the street-fare glee of Korean mandoo, and none of earthy fire of kimchee.  The conceit of this entrée is on target; only the execution of those pesky pies need be tinkered with.\n\nA plate of grouper on Israeli couscous was ho-hum.  The fish itself was lightly seasoned and overall it worked as a healthy (female-friendly) choice but seemed out of place on a menu that was so much more creative.\n\nAs our meal entered its endgame and the busses and trains that criss-cross Brooklyn awaited, our server (who seemed eager to please but something of a food novice) encouraged us to have dessert.  The banana pudding and the apple tart succeeded in that they did not overwhelm.  The banana pudding arrived in a glass bowl and cuddled a core of crunchy, savory and salty nuts or crackers (our attempt to find out the filling went unrequited).  The apple tart came with a smear of chèvre foam (a tad passé, true) but the flavors were tight and bright.  The \"crust\" was a walnut shortbread that slid too easily across the plate, so an anchor might enhance the diner's overall experience.  Nevertheless, the desserts did not exert too much force on the meal.\n\nThe check was remarkably low at the end of the evening.  No. 7 is just a couple stops from home and, then, a few feet from the subway exit.  As an aside, the bust stop is only a couple storefronts down.", "author": "Kevin K."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2009-03-24", "description": "Did you ever get the feeling that the chef has had everyone he knows write a glowing review of his new joint, and a whole bunch of other people have decided to write overwhelmingly negative reviews to balance the flow?  It certainly sounds like the case here.\n\nNo. 7 is fine.  Just fine.  Nothing more, nothing less.  Worth a visit.  But only once.  I'd struggle to make a case half as passionate as any of the previous reviewers - positive or negative.\n\nYes - the space is really cool, and whoever designed it did an excellent job, but is that why you go to a restaurant?  And yes, the wait staff and bartenders are rude at worst, or abrupt at best, but this is New York.  Would you expect anything else?\n\nThe important stuff, the food, is constantly trying to out do itself and failing.  No. 7 clearly wants to be the clever, avante garde kid on the block - the poster child of New Brooklyn.  It just winds up being really confusing.  Grits with shrimp?  huh?  You're probably not going to find dishes as creative/inventive anywhere else, but all the unnecesary complexity leaves the food overseasoned, oversalted, and often times overcooked.", "author": "Rob W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-10-16", "description": "The second time was even better...\n\nI think that i have now at least tried the majority of the offerings on the menu and am even happier with the food the second time.\n\nFirst however lets have a drink...the bar (while nice in atmosphere) was not terribly friendly and the bartender really seemed like she was annoyed to have to deal with me...i did like the extra little mini-pitcher of martini to supplement the small martini-glass size...\n\nThe food..\nthey seemed to have thinned the white bean puree white a bit and it's a good thing, it's still nice but it is a little less filling now.\n\nThe CHICKEN (!!) is really very nice.  Yes i know that the chicken is often the chef's least favorite offering (added for finicky and tasteless old ladies) - this is not the case here.  It's actually an amazing dish with a boneless breast rolled and crispy-fried in the skin with carrot(?) puree boc-choy and a truffle jus - really a winner - hearty and tasty(!!) but not heavy\n\nI had the Tuna Entree which perfectly-cooked tuna steak served with fava beans and chopped collard greens.  This was really tasty but had been over-salted considerably - otherwise it would have been really amazing.\n\nThe Pork appetizer was really great. it was two hearty slices of cured/smoked/aged (damn-it i need a menu) pork with a small side salad and apple slices (?) was really an amazing flavor combination.  Perfectly balanced salty/smoky/sweet/sour flavors in each bite...just really a nice little starter.\n\nThe only real vegetarian dish (shame - i do get it, forget them, but this is Brooklyn) was ok.  It seemed to be house made noodles (or filo dough even) layered with veggies and topped with (very) stinky cheese.  Personally i think it could have had less dough/noodle and more veggie/sauce and the cheese just took over the rest of the dish..but the layers where meticulously made and very pretty", "author": "Furyk C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-07-14", "description": "The chef at this place never ceases to amaze me. I first went there because i wanted to try their kim chi pierogee, but it was not there so we had other things on their menu. I remember having scallop sashimi, which was great! i'd never think that scallop can taste good raw but they made it work. \n\nAlso love the cocktails there, it's a little funky they put stuff like rhubarbs in it, some think its strange, but i really like it, its like having tasting a really smart dish in a drink, not the usual fruity stuff other places serve. \n\nAnother great thing about this place is that they change their menus every few months so there are always new things to try.", "author": "Cindy Z."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-17", "description": "I've walked by this place so many times without ever noticing the recessed entrance. What a shame! Finally went for a late dinner recently for a friend's birthday. Loved the sparse menu, ordered a few appetizers which were all very good. Our meals were fantastic and the wait staff was very good.\n\nI ordered the steak with the kimchi perogies and absolutely loved it. I think the steak could have been rarer. I ordered medium-rare, will try rare next time. The kimchi perogies are out of this world! They should have it as a separate item on the menu just so I can stuff myself with them. I usually don't like potato products and am not even that big of a fan of kimchi, but somehow the perogies work and I love them.\n\nWill be bringing friends and family back!", "author": "Darren C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2009-04-19", "description": "Picking and choosing among various plates sounds like a fun brunch adventure, but be forewarned, at No 7 they really mean it when they say \"small.\" That, however, is not their main short-coming.\n\nIf, when hearing \"latke,\" you imagine a large appetizing potato pancake (if not two), freshly fried and crunchy, complemented by sour-cream and apple-sauce (in other words, the way latke is supposed to be prepared), No. 7 is not the kind of restaurant you'll enjoy. Here, latke means two tiny dense vegetable turds with a bit of sour-cream, served luke-warm and leaving much to be desired.", "author": "Anna A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-24", "description": "Terrific place!     Able to get a reservation at 7:30 on a Friday night, and when we were running late, they called to ask if they should hold the table.  Much appreciated.  Terrific host and terrific waitress. Hamburgers were very tasty.", "author": "Kristen B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-01-17", "description": "We chose No. 7 as the site of my boyfriend's birthday celebration and then crossed our fingers.  It's a gamble to invite a bunch of people out to dinner at a restaurant you have never visited, but this time it paid off:\n\n1. The restaurant itself is classy and intimate but still easily accommodated our party of eleven.\n\n2. The specialty cocktails (which bear seemingly random numbers instead of names) were unique and proved to be delicious.  Mine was composed of porter apple, tequila, and black tea liqueur, and it was amazing.\n\n3. The appetizers are absolutely insane.  In skimming Yelp reviews, I had seen the fried broccoli appetizer mentioned with some frequency, so we tried that.  We expected it to be broccoli florets that were lightly fried, but no: it was an entire stalk of broccoli, breaded and deep-fried, with some sort of cheesy sauce oozing out from somewhere.  It was decadence at its best.  We also tried the cold octopus, and we were pleasantly surprised to find the octopus was really tender, not chewy like octopus can be.\n\n4. The entrees, while limited in option, were great.  I had the artic char with celery root puree and brussels sprouts.  My only quibble was that the brussels sprouts were really, really buttery - but that didn't stop me from eating every last one.  The boyfriend had the steak which came with a surprising (but delicious) fried pear.\n\n5. The dessert menu was short, but we chose the figgy cake and the staff graciously put a candle in it for his birthday.  Dessert wasn't on par with the rest of the meal - in other words, it was tasty but not amazing.", "author": "Kathleen B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-06-23", "description": "Went to this place for El Jeffe's birthday.\n\nAfter all is said and digested, there's only two items worth ordering here: the Fried Broccoli and the Steak with Kim Chi Pierogies. Those two, and only those two, make the place worthwhile. The Fried Broccoli is quite possibly the best broccoli dish I've ever had. Fried tempura style with a hearty batter that oozes flavor all over your wet dirty mouth. its $7 and comes with dill. With this in my mouth, I thoroughly enjoyed masticating.\n\nThe hangar steak was also extremely well executed and came out nice and red and for $24 is a great deal.  It comes with kim chi pierogies, aptly named, because its a fusion of kim chi \u0026 pierogies.  Awesome.\n\nThe bread also comes with a nice potato based puree, tasty and free.\n\nPlace would get five stars for the steak and brocolli, but everything else is overpriced and ranges from decent to mediocre: this includes the Monkfish.\n\nAs for desserts, what's the fuckin point when CakeMan Raven is down the street. \n\nAlso, it's worth noting that the chicks here are not hot, besides the ones I came here with.  Draw what conclusions you will. Converesely, the martinis come with a flask to hold the extra martini from the shaker, more martini for your money and that is Awesome.  The bartender had nice forearms too, perfect for choking babies.", "author": "Quincy T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-09-13", "description": "I really enjoyed this place. I agree with Furyk - it's a gem! The restaurant is beautiful. The front bar is very old school, intense tile and a lounge area set against very, very, big beautiful windows. This week is their soft launch, so there are some unfinished details. The back room is getting plants apparently, which will be nice. Still, I ate in the back and really enjoyed the banquet and tables. A gorgeous wood floor, too. The bathrooms are great, big with white tile and wood again.\n\nI spoke with the restaurant manager/owner, Matt, who told me about the wines that will be coming in shortly and plans for coffee in the mornings and brunch will be served in the upcoming months. The garden won't be open till the spring, but he let me take a took and it's pretty big, lots of green.\n\nThe staff was incredibly nice. I did wait for a table, but it was only 15 mins., so my friends and I got a drink. \n\nI guess I should mention what I ate:\n\nI had the tuna app. and green salad. Both were delicious. The salad comes with this bread that is simply too yummy for words. We actually ordered a second round of that. Not sure what's in it - butter beans, butter, something else. \n\nI had the roast pork app. as well. My friend ordered it and I will definitely order it next time. The chef cooks it with a fried/poached egg! I recommend it. \n\nFor entrees, I had the hangar steak with kimchi pirogues. Never had that before and was delighted. Hangar steak really isn't my thing, but I wanted to try those darn pirogues! The broccoli and sauce it comes with are also stellar.\n\n I'm not sure what Jim is talking about. The dessert was one of the best parts! I had a banana pudding that my entire table couldn't get enough of. We ordered a second round of that as well. We were there late and the chef sent over a sandwich for us to try. I think it was pork shoulder? Not sure, but it also had cucumbers, spicy mayo, really simple. He was giving it to a few tables as it was under consideration for the bar menu. I really liked it. Surprisingly too, because I'm not so much of a sandwich gal. To Furyk's point - I think the chef is ironing out the kinks in the menu. Brooklyn ain't easy, but I really enjoy the process of making it all work. He's clearly top notch. I googled this place and it came up that he worked at Jean Georges, so you know... \n\nI think this is what Fort Greene is missing right now - a bigger sized restaurant that has a bar and really high level food. \n\nThe real thing about this place is that you want to linger. We were there until around 1:30 (!!!) just drinking. I recommend this place for groups of people especially. I also saw two people eating alone at the side tables that face the very open kitchen. Not sure about the date vibe though.\n\nOne of the bartenders is from Bonita, a staff member from the Farm  was there and it was nice to see some familiar faces. If you read my reviews you know I'm a Brooklyn gal, so maybe that won't thrill you, that community vibe, but I really enjoyed that aspect!", "author": "Vivien B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-08-27", "description": "I'm not sure I'm really even allowed to review this place since I didn't actually eat here, only drank, but it was such a good awesome place to be that I feel compelled to do it anyway.\n\nGot seats in the front bar area.  Squishy and comfy and good for a group.  The bar is extensive and not terribly expensive for the fact that it's a pretty swanky joint.  Everyone was friendly and awesome to us even tho we weren't eating.  Restaurant is lovely inside - dark and romantic.  I was even impressed by the cleanliness of the bathrooms. \n\nI really can't wait to go back and try the food.  It looked A-mazing.", "author": "anni b."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-18", "description": "Dang. I like this place a lot. And I usually dont like fusions. This is Southern comfort mixed with Asian. Great combination. \n\nLove all the windows inside. It's like eating outdoors but with AC. \nWaiter + bartender = hot and attentive.  \n\n3 of us came here for brunch. Can only imagine how good dinner is. \n\nWe didnt want to get the fried chicken-- resist -- resist-- and we already put our orders in-- but as soon as we saw our neighbors eat it-- we added on to our brunch. Great crunchy skin, juicy white meats, and I like the house blended hotsauce-- I tasted chipotle, siracha...yum. \n\n-The grits with chinese brocolli and pulled pork was second best. \n-Biscuits and gravy were undeniably good. Unlike Pillsbury, it smells AND tastes just as buttery. \n-The sausage was peculiar. Didnt expect it to be fried-- but hey-- surprisingly tasted even better that way. \n-Eggs-- cant go wrong, its eggs. Makes brunch complete\n-Green salad-- just green salad (may pass on this next time around)\n-Three bean salad good too-- \n\nMan nothing was bad. We could have ordered the whole menu. And it wasnt because portions were small. It was just good!\n\n*They no longer serve strawberry rhubarb sangria-- it's now blueberry lemondae sangria. I liked!", "author": "Yvonne H."}], "servesCuisine": "American (New)", "priceRange": "$11-30", "name": "No 7", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "7 Greene Ave", "postalCode": "11238", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/lt-w9NOIuTSmE73S6_jLew/ls.jpg", "@type": "Restaurant", "telephone": "+17185226370"}