{"aggregateRating": {"reviewCount": 364, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-05-08", "description": "I've never given one star before bit this place earned it. First of all, the food was boring. We ordered the fried artichokes which included the hard spiny points that got stuck in our throat. We ended up leaving most of it on the side of the plate because it was inedible. We also got the charred octopus which absolutely came out of a can and had very little meat anyway. The fish tacos were the saving grace but were bland and could have used any spices. \n\nThe service was inattentive and everyone seemed bored to be there. We ordered the above and 2 drinks and the bill was $70. We didn't even order entrees and left.\n\nNeedless to say, we won't be coming back and are unfortunately hesitant to try other fort Greene \"gems\". Not Rays across the street afterwards was, as always, excellent.", "author": "Michelle F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-12-10", "description": "Great space, cool ambience, good food, good drinks, decent service....\n\nCame here for brunch a couple weekends ago...  Their brunch food was very good, but the menu was VERY limited.\n\nThe burger was good!", "author": "Sasha B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-16", "description": "I never cared for broccoli but love their broccoli tacos and classy decor.  Bottles of wine are half off on Wednesdays.  Love this spot!", "author": "Akruti D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-01", "description": "Gorgeous dining space \nDelicious breakfast nachos \nRight off the C train", "author": "ReviewHaiku F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-01", "description": "Ive  had some really memorable meals here although I used to go a lot more. The chef is great. Favorites were a good steak over an edamame purée with some type of blueberry reduction, a balsamic strawberry cocktail that was really interesting, the white bean purée with sliced cucumbers and bread , and the double decker broccoli tacos  are delicious and addicting. I stopped going for brunch because it seems a little ordinary now but I once had a butternut squash puréed grits with a bunch of toppings on the side to add in...poached egg, bacon, broccoli, crispy shallots, greens, etc...really good. The space is beautiful and staff was always great", "author": "J L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-05-23", "description": "Had a solid brunch with 8 folks total here. Seating was accommodated. Service was good. Good could have been better. Eggs were over salted. Steak was not browned. Prices were a bit on the high side for what we got, especially considering the carelessness of preparation. But it was still good. I'd come back. Pancake with ricotta side was most memorable. Wish they held more salt from the chuck Norris.", "author": "Igor G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-03-13", "description": "**over all nice restaurant for one on one or after work set\n\nnot to much on the menu\n{{been here twice, my lover several times i got burger n fries both times and he seems to only love the #fishtacos}} and the rose' moscato was cute as well\n \n-the waiters were nice and welcoming\n\ncant rave wasnt much to rave about!\n\nsigned \ni love to eat \u0026 i do consistently \n\nmr. von teese \u0026 lover experience", "author": "Tyshawn V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-02", "description": "Went there for brunch on a Sunday...very limited menu, about 6 items, but all of them are fun, unique and well prepared.\n\nI had the Fried Egg nachos....a bowl of nachos with beans and a fried egg on top...a side of bean sprouts and aromatic herbs made the dish memorable...most everything is vegetarian, without telling you ....so it is nice, fresh and light.   \n\nThe fries were very nice and crispy...Good experience...", "author": "Robert S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-02", "description": "We went for brunch on a gloomy memorial day weekend.  The staff were super friendly and attentive.  The vibe was very chill and relaxed.  We stayed for probably about 4 hours, eating \u0026 drinking and no one rushed us out the door.  The food was DELICIOUS!!  The Chuck Norris, the avocado flatbread, the poached eggs \u0026 hash.....mmmm mmm!  Not to mention the desserts....YUM!", "author": "Ann P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-22", "description": "Definitely worth going here for brunch at least once!  As another reviewer noted my ideal rating would actually be a 3.5 -- the food we ordered was very good and fairly unique, but the ambiance felt like I was just sitting in a generic room (I'm opting for 4, though, because it really was a good meal!).\n\nI got the pulled pork grilled cheese which was as heart attack inducing as you would expect from the name.  The fries were nothing special, but the sandwich was great!  My wife got ricotta, raspberry, chocolate chip pancakes which came out wonderfully rick and moist (with real maple syrup!).\n\nWe decided to split a scramble on the side, which may have been why it wasn't our favorite part of the meal (it wasn't meant to be a side).  Also because the brussels sprouts were a bit on the mushy and wet side of preparation (I like my sprouts burnt to a crisp)\n\nOverall a great place for Sunday brunch.", "author": "Dan S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-17", "description": "I'm torn between 3 and 4 stars - but I'm going with 4 for the sheer creativity of the dishes.  I'm usually not one for fusion food - cuz let's face it..when I want some good Asian food, I want some hole-in-the-wall authentic Asian place.  But I will admit, No. 7 did fusion creatively well.  \n\nMy friend got the Fried Egg \u0026 Nachos - a sort of asian nachos breakfast thing going on.  Surprisingly, all the ingredients went together really well.  \n\nI got the Scrambled Eggs \u0026 Spicy Pork Shoulder with creme fraiche and rice. I know.. you're thinking \"creme fraiche and white rice?! You GOTSTA be crazy, lady!\" But I swear..somehow, it worked. Maybe it was the combination of eggs, rice, pork shoulder, veggies also? Who knows? All I know is...it was good. And I liked it.\n\nNow..the hubby got the Fried Chicken Burrito.  Now, don't get it thinking it's going to be all \"burrito-y\"...but if you want a hand-held roll of fried chicken and asian flavor goodness...then this is your dish.  Really done well...\n\nSo, why am I torn between 3 and 4 stars?  Well, the service that day was just ... meh.  But...thank goodness their creativity saved em ;)", "author": "Melissa G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-01-03", "description": "This used to be my favorite Brooklyn restaurant and my go-to for any type of special occasion. I haven't been in a year, so when I saw the $60 prix fixe ($80 with wine pairings!), I talked my party of 9 into going there for NYE dinner. Unfortunately, it has fallen off a bit.\n\nThe staff was extremely helpful with booking my large party, and even called me when a better time slot opened. The service throughout the meal was aptly attentive, as is always the case. \n\nThe food was so so. Started with celery soup w/ fried squid - YUM. Others had oysters, and enjoyed them. Second course was skewered shrimp which were pretty good. Others had the fresh mozzarella, no one was impressed. The main course was the big disappointment - filet of beef over turnip gratin w/ brussel sprouts. The beef was chewy and bland, none of us enjoyed it and left a good deal of it on our plates. The sprouts and gratin were delicious. The desserts were not good either - apple cheesecake was very cakey and bland. The chocolate and blood orange tart was subpar - I don't think the chocolate was tempered correctly bc it was chalky with no taste - this was enough to ruin the dessert. The wine pairings were spot on, and a good value. \n\nMy friends didn't say anything to me directly, but they were clearly unimpressed with my choice and probably a little miffed. I would hesitate to go back, but I may.", "author": "Shara C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-06-24", "description": "No. 7 was one of those places that I've walked past for over two years saying \"Oh yeah... we need to try this place sometime...\".  Well... we finally made it inside for brunch and I have to say I was pretty happy with the experience.\n\nAtmosphere:  Nice.  They have that modern \"hipster\" aesthetic, but its not so damn try-hard.  The booth seating is super comfortable and feels loungey.  Skylights bring in really nice natural light.  Up front has bar-height tables tucked along the side.\n\nFood:  Solid.  I had the Chuck Norris scramble (brussels sprouts, tomatoes, scallions,\nfeta, fried garlic).  The portion size was perfect and the eggs were not overcooked (high five!).  An above-average brunch dish for sure.\n\nDrink:  The lowlight for me was my bloody mary which was rather bland.  I was able to kick it up a bit with some hot sauce and salt, but it still wasn't a winner and didn't seem worth the price booze-wise.  Speaking of booze... you won't find any great boozy brunch specials here... you pay for every one and they ain't cheap at $9 a pop.\n\nOverall No. 7 was a perfectly acceptable brunch spot with good eats for when you're looking for something more low-key.  It's just not the place to go if you're trying to blow it out with a brunch rager.  (And sometimes we could all do without the screechy brunch set, no?)", "author": "Kevin F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-12", "description": "I like that it is very cozy and they have good service and good food and cocktails. I like the inside a lot it doesn't look like the typical bar or restaurant a bit elegant and seems like a bistro French coffee bar. Try the broccoli tacos please and the margaritas yummy!", "author": "Irving R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-25", "description": "I've only been here for drinks so I'll update mah review whenever it is I come back for food. I hear le brussel sprouts are delish. After perusing the drink menu, there was no question that I had to order the Liam Neeson. Strong, bitter, and brooding with a subtle ability to strike fear in the hearts of all who dare challenge him--what more could I ask for in a drink? Let's say the drink lived up to its name. I also got to sample some fries, which were tasty. People were raving about what they guessed was a mayo/mustard dipping sauce.\n\nOverall, I also loved the upscale yet laidback decor of the restaurant/bar. The bar's located in the front with ample room for people to sit, gather, talk, and other that other wonderful stuff people do at bars. The dining area in the back looked spacious yet intimate. Great for groups or more romantic company. It's also conveniently located RIGHT in front of the Lafayette Ave C train stop! Well, convenient for a few.", "author": "Christina F."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-10-06", "description": "I have friends that love this place but I honestly don't see the appeal. \nThey need to put some money into upgrading the seating - especially the banquettes in the back and by the front window- they are worn out and feel dirty. \n\nI had heard great things about the brocco tacos but they didn't really deliver either.\nAlthough they have a small beer selection, they do carry Harpoon, which is nice to see.", "author": "Rebekah P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-02-22", "description": "I liked the ambiance of this place most of all.  The servers were OK, and the food was just average.  I have to say i was put off that when my group of 4 walked in at 8:30 trying to get a table, they made us wait because they didn't want to seat us at a 6 top.  They said they had a reservation for it, which of course they didn't, and so we waited for a 4 top to open up (only 10 minutes, but still annoying).\n\nThe best thing on the menu was the deep fried Broccoli.  The portion was sort of small though and we had to order a 2nd one.  I got some weird meatloaf dish.  Avoid that.  I'm sure there is better food on the menu.  \n\nI also had a Old Fashioned.  Those aren't too difficult to make, but yet again their's was just OK.  Must have been the whiskey they were using.", "author": "Ari L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-01", "description": "We had our wedding reception here last year, and we are neighborhood regulars. From the start, we knew we wanted to hold our special night here. Every time we go, we love the great service, delicious food (brunch and dinner), and relaxed vibe. \nIn terms of our wedding, No. 7 delivered on all fronts. We had terrific food, amazing staff, and an incredibly fun, cocktail party for us and our loved ones in a beautiful space (the pictures from the night were amazing). Katherine, Tyler, and their whole team were so wonderful to work with. They took such great care of us from the delicious and awesome menu (everything bagel pigs in a blanket; corned beef bao with kimchi \u0026 pickles; gochujang deviled eggs; fried chicken sliders; of course, the classic broccoli tacos; delicious his/her cocktails) to taking care of all the details so we could have the best night with each other and our guests. We didn't have to worry about a thing. We had the very best night and our guests still talk about the party and the food. We're lucky to be able to go to this neighborhood gem all the time. Thank you always, No. 7!", "author": "Dr W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-07", "description": "You will find things on the menu that are totally differnt and sounds odd but take a try they are delish . Loved the Korean Pancakes\n\nSmall portions is the only thing I did not like.", "author": "Maria T."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-07-25", "description": "When a place is half-empty on Sat evening from 7 to 9 that should tell you something.  We stopped here for dinner after a movie at BAM Rose because our two top choices-Berlyn and Prospect were not available.  The drinks were good, mine had absinthe in it, I did not realize how strong or bitter it was.  The food, while interesting, was overtly salty.  We ordered the Brussels sprouts, the fried broccoli and the ice wedge salad for the starters and for the mains, two people had burgers, one had strip steak and the other had the general tso chicken.  The fries that came with the sandwiches were uneventful, I expected more from this place.  The burgers were good, juicy, and tender, but again, over salted.  Definitely not a place to which I would come back given other choices in the area.", "author": "Baby S."}], "servesCuisine": "American (New)", "priceRange": "$11-30", "name": "No 7", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "7 Greene Ave", "postalCode": "11238", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/lt-w9NOIuTSmE73S6_jLew/ls.jpg", "@type": "Restaurant", "telephone": "+17185226370"}