{"aggregateRating": {"reviewCount": 364, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-03-21", "description": "service drenched in love\ndouble-decker broccoli\ntaco - holy shit.", "author": "Will Z."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-25", "description": "Great place to take a date!  The food is great, the service is top shelf, and the atmosphere is comfortable.  I can't wait to go back!", "author": "Michael A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-10-17", "description": "Reliably fun spot with good food in Fort Greene.\n\nI was so excited when this spot FINALLY opened since the sly space behind the subway entrance had been boarded up for ages. Neighbourhood gossip said that something fabulous was in the works behind the spray painted plywood. And I was not disappointed! I have been here a few times for dinner and a number of times to stop in for a cocktail. \n\nFood highlights were chicken dumplings! fresh oysters that were on special, we went back for a 2nd and 3rd order. Oh and of course, the steak. It's got a great ambiance and has been a welcome addition to the block. Also boasts some great cocktails and decent wine selection.\n\nI would give more stars except I have had intermittent service (sometimes a bit too snobby for the fact that this is Fort Greene people and we're eating here because we want a good meal with out the 'tude). Also, a few of the cocktails are very bizarre flavours and on two separate occasions, their cocktail concoctions overshot adventurous and moved into the off-putting categories. Though both times I sent them back they were gracious about it and did not charge. \n\nI have not yet been in for brunch but hear good things about it.\n\nNote, this spot is pretty hopping on the weekends so expect to wait for a table during primetime.", "author": "Brooke C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-02-08", "description": "Food: So the menu has like 5 appetizers and 5 entrees and also nightly specials. It may not sound like a lot but what we had was perfectly prepared and keeping the menu small helps with that I'm sure.\n\nI had the fried broccoli for an appetizer and hanger steak for dinner and both were fantastic. My GF had that evening's special which was braised beef served in a crock with potatoes and carrots which, despite how good my dinner was, gave me food envy. We split a bottle of Spanish red wine recommended by the server and I also had a pint of Mother's Milk beer which tastes a lot like Samuel Smith's taddy porter. Awesome.\n\nAtmosphere: It's a really cool place with a surprisingly open feeling inside. It is dimly lit, great for a romantic dinner out with sky lights over the tables. The place feels like a throwback to another era. The music was kind of an '80's mix which somehow fit.\n\nService: Our waiter reminded me of Dane Cook except he was funny and interesting. He made a great wine recommendation and  was very attentive. \n\nDefinitely going back.", "author": "Andy S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-07-28", "description": "The first time I came to No. 7 I wasn't overly impressed. I had the fried tofu and some salad. Good, sure, but not really worthy of its reputation, nor its mystique, what with its somewhat pretentiously discreet exterior/lack of signage (now made even worse by all the ugly scaffolding surrounding it). But after going back for brunch recently, I now kinda get what people are talking about.\n\nThe first good sign was that every item on the brunch menu sounded delicious. Every single one. I always have a tough time deciding what I want to eat in a restaurant (in that I want to eat everything in the world, all the time), but this was a bigger struggle than usual. Eventually I made the surprisingly uncharacteristic decision of passing over stuff like waffles, egg and cheese sandwiches, and fried chicken, in favor of yellow-squash grits, plus the extremely characteristic addition of some tater tots and corned beef hash on the side. \n\nThe hash was actually a bit of a disappointment--instead of tiny bits of \"beef\" mashed into potatoes, it was big hunks of actual beef mixed in with squash and some other veggies. Well made, yes, but not at all what I wanted when I asked for corned beef hash. (It kinda struck me as a meal the super-rich feed their dogs.) The tater tots, on the other hand, were exactly what I wanted them to be--a noticeably higher-quality iteration of regular tots. Hot, crisp, clean, and clearly made from a better breed of frozen processed potato, with mildly spicy dipping sauce on the side, I highly recommend them. They were a perfect complement to (and for sopping up the remains of) my grits, which were suitably rich and creamy, with a thin layer of melted cheese on top. The grits come with a small salad, a bowl of crispy things you can throw in the grits for texture (bit too hard for my liking, though) and, joyfully, a poached egg. There are few things in life that can't be improved by adding a poached egg.\n\nAll in all, a very enjoyable meal, whose true quality was found in how awful I DIDN'T feel after eating its three pretty nutritionally destitute components. Really my only complaint about the meal is that I ate it while sitting way too close to another customer's mullet, which was easily the curliest, stringiest, patchiest thing I have ever seen in my life. Other mullets want to become this mullet when they grow up-- I don't think I will ever get it out of my mind. I realize I can't rightfully deduct a star from a restaurant for a customer's hairdo, but believe me, if you'da seen it, you'd be considering it too. I'm still kinda wishing I'd docked the tip for their even letting that dude in the door.", "author": "Galvin C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-12-17", "description": "I was going to move out of Fort Greene, but no longer.  \n\nEverything I've ever tried here has been a hit.  I find the food to be very thoughtful and well executed and I'm actually surprised by some of the less than stellar previous comments.  I should share that I've always dined at the bar, but I do feel like this is very much a neighborhood restaurant in the feel and style (and just so happens to have some kickass cuisine), which is not for everyone I guess.   I've always seen staff go out of their way to be accommodating.  \n\nFavorite dishes have been the hanger steak with kimchee pierogies and butternut squash and the hen of the woods stuffed cabbage (incredible mix of flavors!) that was served with a beet risotto and one other component that I can't quite recall (oops).  At the bar I've really enjoyed the shrimp cocktail - they're giant - which has an Asian spin on the cocktail sauce, as well as the chicken fried steak sandwich (good for sharing, or if you've been hitting the cocktails a little too hard!).  Specials have knocked my socks off, too.  I recall a great pork chop and more recently an incredible lobster and veal cheek etouffee (a giant portion, good for sharing). Oh, and the chef makes the best brussels sprouts (why is this so difficult?!)\n\nBrunch is pretty kick ass too; I just tried it.  The pics posted look great, but still don't do it justice.  WOW.  And a freaking strong ass cup of coffee!  The PERFECT hangover cure.  Definitely worth going with a group so you can try everything without putting yourself into a critical food coma.  They had some kind of cider sangria (IIRC) and also a spiked hot chocolate which sound intriguing, but likely too sweet for me so I didn't try.  I stuck with a bloody mary and a beer.  \n\nI love Fort Greene but there was a complete lack of any sophisticated cuisine in the area, so I was always heading to Park Slope or Smith/Court Street.  I am sooooo glad this place is in my neighborhood!", "author": "Melissa B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-06", "description": "Hands down, the best steak i've had in a very long time. I can't praise the food enough. Have the fried fish sandwich with their by-the-glass pinot grigio. \n\nA little pricey for a sandwich/glass of wine. After tip, the total was about $27. But you get what you pay for, and i never regret my visit.", "author": "Joan C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-10", "description": "I never order grits out, because I fear they won't match my dad's. These not only matched, but topped any grits I've ever had. Sorry Dad. They are perfectly cooked with just the right amount of cheese, not too much, and they have shrimp AND chorizo, making them tasty \u0026 spicy. YUM.\n\nWe also shared a cinnamon bun which was huge, you definitely don't need one to yourself. Very tasty though. The seasonal sangria was great too, really liked all the chunky fruit \u0026 veg at the bottom. It helps that it's a super cute interior too that gets lots of natural light. Great brunch spot.", "author": "Colleen L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-10-28", "description": "Fried broccoli is yummy. The red snapper was great. Only negative is they don't sell reisling wine by the glass. The atmosphere is nice.", "author": "Natasha P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-25", "description": "I like the look of it, a lot.  Nice atmos.\n\nThe bar was a good place to hang around with my friend Andy, and the beer was a good deal.  \n\nThe beer being a good deal, I don't remember if the fried fish sandwich (from the bar menu) was tasty or just OK.\n\nHere's what I do remember: that wise balsamic-mayo or whatever it was that came with the fries.  THAT IS SMART THINKING GUYS.", "author": "Sarah B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-01-07", "description": "2.5 STARS rounded to 3.  \n\nShorter bartender is a jerk.  Hands down, absolute fuckwit jerk.  I know I sound crass, like it's been one bad experience, but I'm really friendly, and I've been there quite a few times.  \n\nWhy have I kept coming back until now? Enter, french fries. They are great, vinegar mayo is addictive.\n\nSome attempts at new creations are valiant but fall short of being tasty. \n\nAnd finally, long-haired cook in open kitchen, or closed for that matter, should wear a hair net.\n\nBAM!", "author": "Tom R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-08-03", "description": "We have been trying to go here for months and finally got in last Friday. \n\nI have to say that the steak is one of the best meals in the city. It's enough for two and has delicious spicy Kimchi pierogies.\n\nIf not for the food, I may not go back. I don't feel like the service was excellent nor was the environment. There appears to be no AC, so be ready for it in the summer.", "author": "Lindsey S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-21", "description": "Brunched at No. 7 this weekend before going to the Brooklyn Flea.  The brunch menu is a little different but very tasty.  I sampled a breakfast sandwich consisting of poached egg, smoked gouda, and fried broccoli florets on an english muffin, which was pretty dang delicious.  Also, the blue cheese biscuits sound weird but taste amazing, and come with a tangy fruit relish that pairs well with the bold blue cheese flavor.  The hubs sampled the kielbasa, which comes fried with bits of leek and scallion, which he pronounced quite good, but the best thing about No. 7's  brunch menu is that it includes butternut squash grits.  They are mixed with cheddar cheese and a lot of butter, and the taste was phenomenal.  A little lighter than your average bowl of cheese grits, but very satisfying nonetheless.  My one gripe is that they stuck a stalk of steamed broccoli in my grits.  You can vegify my breakfast sandwich, but keep your health food the heck away from my cheese grits!  \n\nOur brunch was complimented by some bourbon-splashed apple cider, which tasted more of butterscotch schnapps than bourbon, but was at least festive.  The back room is a little drafty, so make sure you have a coat with you if it's cold out.  Very relaxed ambience, nothing frilly or pretentious.  If you're a late bruncher as we are, there's no hustle and bustle.  Can't wait to try No. 7 for dinner sometime!", "author": "Briana H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-03-14", "description": "gf in fort greene suggested we come here for brunch. \n\ni like the aesthetics and decor - perfect for a lowkey gab session w/a gf. food, however, leaves something to be desired. the menu, i was told, has a asian/thai flair to it, as evident by \"pho garnishes\" and \"rice w/scrambled eggs and pork shoulder\". the ingredients seem a bit \"creative\", for a lack of a better word. \n\nhomefries were delicious. cheesy grits were waaay to cheesy and greasy and not done right (and who puts brussel sprouts in their grits!?). my fried broccoli/egg/cheese sandwich ($12) was def not worth the money and very disappointing. \n\ni want to give this place another star because of the decor/service, but the food was utterly disappointing. we spent $30/person (including tip) and simply was not worth it. \n\nwould not return. very lacklustre food.", "author": "jayda i."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2008-10-22", "description": "Maybe I read everyone else's reviews and that built up my expectations for this place. It's so convenient to my apartment ( I mean really really convenient) but unfortunately I wasn't blown away. \n\nI was so not blown away I don't even remember what I ate here that didn't impress me. \n\nMy husband ~did~ have the hangar steak and kim chi pirogi (umm why wouldn't we just call that kim chi mandoo instead of pirogi??) the steak looked really really tender and rare but unfortunately no one offered to share with me. \n\nWent here another Saturday night just for drinks (well I watched my friends drink while I chewed on ice) and it was uncomfortably crowded. The bar extends out too far into the room and leaves patrons squished up against each other. \n\nThen again maybe its just sour grapes (pun intended!), I will have to think about trying out the bar scene again in another 7-8 months when I can actually imbibe.", "author": "nara f."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-20", "description": "Finally an unusual brunch menu that delivers on its promise.", "author": "Alejandro D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-05", "description": "No. 7 Gets five stars for their dinner dishes.  The bar is good, not excellent and the brunch is also good but not amazing.  If you were to go to this restaurant, the best ocassion would be for dinner.  They change their menu frequently to take advantage of seasonal ingredients.  Every appetizer and entree have been excellent.  The dishes are very ingredient-driven with a minimalist culinary approach so as to allow one to truly taste what is incorporated and enjoy it.  The seafood options are always interesting and perfectly cooked.  A truly a great place for dinner!", "author": "Krissy N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-15", "description": "just bananas how good this place is.  not only is it incredibly beautiful, the food is fantastic and the service is great as well.  my husband and i were there last night for the valentine's day prix-fixe which was an absolute steal of a deal and so delicious.  we've gone here several times but have gotten in the habit of it being a 'special' place where we've gone for birthdays, etc.\n\nthis is top notch food, service and decor for a very reasonable price and without the slightest air of stuffiness.  it is brooklyn modern american at its finest.  get into it.", "author": "melanie f."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-06-30", "description": "I just went back here for dinner last week - and they've updated the menu!\n\nWe ordered one of every appetizer, including the oysters, on special.  The fried broccoli, hard boiled egg salad, cheese, oysters... yum.  Totally worth it.  The entrees have been updated as well, and because we ordered so many apps we decided to split the brisket (special) and the steak.  So so good.\n\nOne of every dessert was in order, and each of them are delightful!  My favorite was the passion fruit cake, but the other two (a new amazing pudding that has root beer in it! and a rhubarb tart) were both delectable.  Plates were licked.  Dessert wine was ordered.\n\nPlease go to No 7 - you will love it!", "author": "Arielle W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2010-06-16", "description": "Lovely decor, shit food.  So bad.  With so much good to eat in this town, there's no reason to eat here.  The appetizers were plain bad.  And for an entree: one of the worst cuts of beef you'll find anywhere with a side of bad salad covered in Newman's Own vinaigrette.  Fuck it.  Just stay home.", "author": "Alfons H."}], "servesCuisine": "American (New)", "priceRange": "$11-30", "name": "No 7", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "7 Greene Ave", "postalCode": "11238", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/lt-w9NOIuTSmE73S6_jLew/ls.jpg", "@type": "Restaurant", "telephone": "+17185226370"}