{"aggregateRating": {"reviewCount": 364, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-09-12", "description": "It's really really cute but the food ain't so great.  Specifically--the hangar steak was chewy and accompanied by an unidentifiable mush pile (aka squash ??) as well as the unfortunate kimchi pirogi.  The \"pork face\" appetizer was just plain weird.  The tempura broccoli was hard.  The veggie lasagna was bland.  The wines were so-so.  Dessert was a straight-up disaster--even the highly touted pudding tasted like store-brand.  Sorry to say -- there are tons of other super-cute Brooklyn eateries with better chow.", "author": "Jim K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-10-26", "description": "deliriously delish. \nfriend \u0026 i just enjoyed potato leek soup (w. fixin's du jour: chive \u0026 sundry green spices, apples soaked in vinegar \u0026 bran crunchies) and the pork appetizer.  Yes - the egg was a bit salty but, all in all, the dish was impressive.  friend \u0026 i agreed that we preferred the limited menu because it means that the chef is focused.  and we enjoyed the strange twist of palate -the unconventional spin on the norm.  \ndefinitely will patron again. \nand again.", "author": "Cannon H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-10-29", "description": "A friend of mine suggested we try 7 Greene Avenue for dinner last Friday night. It's a new restaurant, they just opened their doors in late August. 7 Greene Ave used to be an abandoned storefront, right behind the C train Lafayette Ave. station. Aside from having to step around a large quantity of bikes chained to every pole in front of the restaurant (mine included), the entrance is open and inviting. \n\nWe went on a Friday night, and had to wait about 30 minutes for a table, at which point we were so hungry that when two seats opened up at the bar, we decided to just have dinner there, since you can order from both the bar and restaurant menus (the bar menu actually had better-lookng and much less-expensive items). Right away, we were brought a basket of warm, flaky bread and a dipping sauce, which tasted like it was made from cheese and maybe white beans? Anyway, it was really good, and warm. For dinner, we ordered the french fries, fried broccoli, and tuna steak off the bar menu. The french fries were SO good, perfectly fried and perfectly salted, and they came with two dipping sauces. The fried broccoli was also really good, slightly spicy and tempura-ish, but less battered. The tuna was the perfect size, and came with slices of pear. My friend ordered steak, and it was melt-in-your-mouth tender and savory. So overall, the food was really really good. \n\nA few things though, it was ridiculously crowded, probably because the restaurant was recently reviewed in The New Yorker and the Times. I would suggest calling ahead, although I don't think they take reservations, since everyone was waiting at the door. Also, they serve their wine in little water glasses, so one of the busboys accidentally re-filled my wine glass with water, when I still had half a glass of wine left! It was funny, and he immediately refilled my glass with wine, so no harm done. I definitely plan on coming here again and again.", "author": "katherine A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-07-21", "description": "Nice physical presence and friendly, attentive service but the food was just okay. I'd return for a drink at the long, cool, turn of the century marble top bar but will probably skip the food. I had the grilled Char which I expected to be fairly firm but was actually kind of mushy. The Brussels sprout I got as a side were slightly burnt and kind of felt like they were leftovers from the night before. I also had to vodka on the rocks and they were both a little short. My friend had the gnocchi and two glasses wine. Total tab w/ tax before tip was $90.", "author": "Will S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2008-11-24", "description": "A good friend of mine knows the chef, so we headed to Brooklyn from NJ on a very windy and rainy Saturday evening. \n\nUnfortunately, the rain brought in more people, rather deterring them from venturing out and to No. 7. Our wait for a table of 7 ended up being almost 2 hours--definitely not a place for a big group. So we ordered appetizers and ate at the front seating area by the bar. \n\nYou would imagine that the pork would be the star of the pork and panko crusted egg appetizer, but really, the egg was the surprise star. It looked like a hard boiled egg that was fried, but the pleasant shock was when the gooey runny yolk spilled into your mouth while you crunched on the crispy panko covered egg white. Another surprise was the arugula salad, shaved parmigiano with the garlic toast--it was very simple, but again, the surprise element of the salad was the garlic toast.  Thankfully so, or otherwise, it would have been any other simple salad. My only gripe is that the toast should be bigger. I was feeling Bizarre Food-ish, so I couldn't wait to try the pighead--I was disappointed. I was looking forward to an unexpected texture in my mouth, but the pork pieces were not pieces, but more like bits (we had to search for the pork face pieces). The bits were super crunchy and left a fatty aftertaste. Not my favorite.  We also had french fries--you can never go wrong with french fries, especially if you're hungry for dinner and waiting...waiting....waiting...it's a good thing people watching is a past time of mine.\n\nI had the halibut with leeks--good, but nothing special. The hangar steak was prepared well, given the cut of meat, but the kimchi perogie was what made this dish memorable. By the time we finished, we were all so tired that we opted out of dessert. \n\nDespite the wait and somewhat of a disappointing meal, I did enjoy the space, the dimly lit ambiance and the energy of the bar crowd. If I go back, it would be to meet for drinks and appetizers.  The wait turned me off or else this would have been a 3 star.", "author": "Kim L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-05-26", "description": "Went for drinks on a Saturday night. Nice decor. Service was not very speedy. Drinks weren't spectacular. Had the mezcal. Wasn't wowed.", "author": "Meg B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-10-07", "description": "Beautiful space and welcoming atmosphere. I really wanted to love this place. Fig and Frisee app was delicious. The tofu and tilefish entrees were good but not great. It's definitely worth checking out but I didn't love it.", "author": "Jake C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-16", "description": "A friend and I were looking for brunch options and knew No 7 is a nice dinner option. Love the skylight and huge u-shaped booth in the back. We got the spiced sangria, fried chicken, grits, and latkes. The food and service is great...the only complaint we had was we felt the chicken and grits were a tad overseasoned. But maybe we're both just averse to salt. Will go back!", "author": "Jennifer H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-29", "description": "Had drinks and desert.  Great Service.  Excellent ambiance.", "author": "Shaike A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2008-10-17", "description": "It pains me to defame a local Brooklyn establishment; nevertheless....\n\na) The food is... undefinable (for once, ignore the New Yorker).\n\nb) I ordered a $45 bottle of wine and it never came (this alone is enough to delete this place from memory).\n\nc) 'Enjoyed' their signature appetizer, the fried broccoli, with a glass of tap water (which may have been the best thing in hindsight) \n\nc) Successfully ordered two classes of wine with our entrees. They serve wine in orange juice glasses - literally. Needless to say, I left more sober than when I arrived\n\nd) Steak: no complaints, no surprises\n\ne) Chicken: over-thought; weird; but tasty\n\nf) Hostess: attentive and friendly in a genuine kind of way\n\ng) Music: bring your iPod", "author": "Joe B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-10-19", "description": "Went here before a BAM show. Two small problems - the place is hard to find and a hand painted on a nearby wall shows the wrong way! Second, the hostess wasn't there when we came in and then moved us from a table for three in an empty room.\nMaking up for this the service was super- the waiter asked if we were going to BAM and said we had lots of time, and the food was terrific tho the menu is limited. Had short ribs with clams - yummy - and wife had tilefish, both had excellent salad of frisee and cheese and pistachios. Desserts were unusual and among the best we have ever had - a truly wonderful pumpkin tart with miso (!) and chocolate bread pudding.\nReasonably priced and we will go again.\nThe place has a lively bar with lots of brews and wine on offer - also tables for drinkers to eat.", "author": "james h."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-03-10", "description": "AHHHH-MAZING! i went here this past sunday with my boyfriend and another couple. fortunately we all got a different thing on the menu, so i got to sample a few different things. the dish that i haven't been able to stop thinking about was the grits! they were absolutely incredible! it sounds a little odd; grits with rock shrimp and chinese sausage, but delicious taste and very original. the service was really great too. our waitress was all smiles and so accommodating.  i also had the biscuit egg sandwich - fabulous! my bf had the fried chicken, which i had a little taste of. i'm not into chicken for breakfast, but theirs was a little sweet and definitely savory - yum!", "author": "Ana K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-06-14", "description": "I had a few bad experiences here when they first opened, but I've since come to really like it. I have been here often for brunch and love the food. It's creative and well executed. The space is lovely, and they have great bloody marys.", "author": "Keren G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-26", "description": "Went back for dinner... my cocktail (can't remember the name but it was the last one on the menu and had tequila in it) was extremely weird, but potent. Had an excellent frisee with pistachios, then waygu beef for the main course. The dining atmosphere was very alluring and the waitstaff was attentive and prompt.", "author": "Gwin V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-11-02", "description": "Yum. I know other places make a tuna appetizer, but this place makes it right. Mmm, delicious seared tuna. We came with a party of eight on a Saturday night and they were very accommodating. Bout a 45min wait. Also had the soup with crispy, fruity and herbacious (what fun!) and the cold roast pork. Everyone I was with seemed to really enjoy what the had. Extra points for the atmosphere.", "author": "Carl C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-10", "description": "We got there just in time on friday night. It got pretty packed after 8. The menu was really simple but everything sounded delicious. I went with the chicken wrapped with cabbage which was in a stew like thing with big chunks of yummy veggies. Everything sorta has a asian flair to it. Since other yelpers suggested it we got the fried broccoli. It is something that you must share with a few people if not I think you could have a heart attack. For dessert we had the fig cake which was perfect, not overly sweet but just hit the spot. The wine list is wonderful and they also have some fun little drinks. I also love that they have a veggie option. Most places only have fish as the veggie option but they had an actual tofu dish. I can't wait to go back.", "author": "Jenn S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-02-01", "description": "Came here Friday night pre-BAM and it was, as others have noted, a very cozy restaurant with a nice ambiance. Also, the menu is creative and quite interesting, though the food was good but not great.\n\nGiven the positive reviews of appetizers, we started with the fried broccoli, soft boiled fried egg, and frisee and cara cara orange salad. Enjoyed the fried broccoli which has wonderful flavoring and salad, however the broth (sabayon flavored with old bay seasoning) with the fried egg was cold and while they all were good, none of the appetizers save the broccoli were great. Got the matzo-crusted tofu entree to share, which again tasted good but had (i) fried tofu squares crusted in matzo, over (ii) braised vegetables (squash and vegetables and tomatos) in a broth, with (ii) pasta noodles in the broth. A very comforting dish and can't complain about the flavoring, but in my opinion there was way too much happening on the plate, and none of the elements really stuck out. I think I would have preferred the tofu served with the braised vegetables on the side, no pasta - not sure what the chef was intending with this dish.\n\nDrinks were great, wished we could have tried the desserts, and service was friendly though inconsistent. I would go back if in the neighborhood since it is a solid, interesting meal but I don't think I would make a special trip here.", "author": "Seth B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-11-22", "description": "Impeccable brunch! I came for a Saturday brunch around 1:30 and it was relatively full, but not crowded by any means.  The decor is delightful and laid back and the staff were all fantastic.  I did have an issue with a fellow diner, but No. 7 can't really control the fact that Fort Greene is full of graduated Williamsburg hipsters.  You know who you are.\n\nThe food at No.7 is spot on.  The fried chicken sandwich is what dreams are made of and I swear they put crack in the waffle because I don't ever really enjoy waffles and I ate it even though I felt like I was going to explode.  The grits were also cheezy deliciousness.  Though the biscuits are good, compared to the rest of the food they were just average. \n\nOur incredibly indulgent brunch came out to $26 per person, more than I would usually spend on a brunch, but it was well worth it!", "author": "G P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-04-09", "description": "I've been here a few times and I've always had wonderful meals.  The menu is small, but interesting and the food is always delicious. The service is great and the setting is  nice too.", "author": "Alison M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-09-11", "description": "two words: free shots. we happened to be there on the eve of no 7's no 1 birthday. what better way to celebrate than forever wedding the current clientele to your delicious cause through the universal language of vodka? as they say, randomized rewards work best. that's why we're all addicted to email. in any event, i, for one, am sold on this eponymous wonder. and even if that midnight treat hadn't warmed my esophagus, my heart would still love no 7 for their inventive butterbean spread and our waiter's dance moves. the latter makes me wonder how much more i would like any restaurant with waiters who bop around like that...probably a lot. bottom line is that no 7 is both tasty and fun. \n\noh, and it couldn't be closer to the lafayette stop, which should put it at the top of any C train riders easy to get to/no more excuses for not leaving the house (especially during winter) list.", "author": "julia r."}], "servesCuisine": "American (New)", "priceRange": "$11-30", "name": "No 7", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "7 Greene Ave", "postalCode": "11238", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/lt-w9NOIuTSmE73S6_jLew/ls.jpg", "@type": "Restaurant", "telephone": "+17185226370"}