{"aggregateRating": {"reviewCount": 364, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-05-30", "description": "The entrance leaves a bit to be desired (next door is a little sketch), but inside is light bright and airy with a relaxed brunch atmosphere. The rice dish with the deep fried soft boiled egg was really good--comforting yet interesting. I've never seen an egg treated this way, and it was such a great combo of textures; crispy deep fried outer crust and a soft, gooey and runny yolk. Combine that with your rice and YUM. Overall, a nice neighborhood spot.", "author": "Megan R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-08-31", "description": "I love this place and wonder why I hadn't been there sooner. The seating atmosphere is really beautiful and inviting. The service was the best I've had in Brooklyn. Every detail was accounted for by everyone working at the restaurant. It's clear that there is strong communication among the waitstaff, chefs, and bartenders, which is of course why No. 7 is gaining such great praise. \n\nWe ate the fried broccoli appetizer that was delicious and so full of flavor. Both my husband and I had incredible fish entrees that were perfectly cooked and had such a range of flavors. Don't skip dessert, or you will be left wondering how amazing your dining experience could be. \nThe prices are very fair for the freshness of food, ambiance, and service. Now on to brunch!", "author": "Elise P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-12", "description": "This place is awesome and I can't believe it's taken me so long to eat here. The atmosphere is very charming and relaxing and the staff was very friendly. The broccoli tacos - wow! So unique in flavor and a big portion for just an appetizer...I highly recommend those. Honestly, I didn't even get an entree because there were so many great sounding appetizers and veggie sides. They did mess up on one of my orders but the waitress was very sweet about fixing the problem right away. I don't mind when a restaurant makes a mistake so long as they handle it properly. Great beer and wine selection, too. I'll definitely be back.", "author": "Emily B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-04-16", "description": "What a treat. You may not understand half the items on the menu, but rest assured, nothing here is ever boring. And the half you do understand is usually the best of it's kind anywhere -- i.e. the fried chicken, fried broccoli, etc.", "author": "Adam K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-09", "description": "Best fried broccoli,egg and cheese sandwich I have ever had!  Ok, fine it was also my first, but please tell me what could be better than fried broccoli and cheese?  \n\nNo. 7 has the most refreshing brunch menu ever. Except for their drinks (bloody mary = A+), the menu is different and more interesting than the usual brunch. The atmosphere is so relaxed (not an easy thing to find for NYC brunching) and after forgetting something that we ordered, the waitress brought us a complimentary chocolate spice bread with dulce de leche cream. Who knew that would be the perfect pair?\n\nLove to all my Brooklyn (and Bronx) friends for bringing me here.", "author": "Claire H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-24", "description": "We are new to Fort Greene, live right around the corner from this beautiful restaurant and for some reason, have never made it inside. Many nights we have walked home, past the big windows and crowds of well dressed hipsters thinking that we should give it a try. Last night, Saturday, we made our way in. Well, I should clarify. We made our way in so that we could check out the brunch menu for the following morning when we would be entertaining some friends in the neighborhood and wanted to take them out somewhere new and exciting.\n\nSunday afternoon, 12pm, no wait, a table for 5 was ready for us when we came in (they take reservations for parties of 6+). The interior design of the space is old New York bar with white subway tiles and a very spacious back room with beautiful sky lighting. It feels like being in the courtyard of a cozy house. The brunch menu was eclectic without being too out there. We ordered 4 dishes: Delicious creamy, cheesy and salty scrambled eggs, served with 3 homemade mini tortillas, little dishes of seaweed salad, yuzu creme fraiche and thin sliced Parmesan. Delicious. House made naan bread, topped with scrambled egg, chickpeas and cubes of crispy tofu. Cheesy grits, coarse and chewy cornmeal served with little dishes of toppings to stir in: broccoli, mushrooms, cheese, eggs. My favorite, the waffle, was served piping hot with a side of banana butter (that tasted like a combination of butter, brown sugar and roasted banana) and crisp roasted almond. Wow. We all shared a side of biscuits (3 in a serving with soft butter and preserves) and salt potatoes (assorted fingerling mini-potatoes cooked in salt water). Everything was delicious. Portions were not too big but I was full for the whole day. We were left alone to chat and rave about our food. We weren't made to feel rushed out (which is always important when going out to eat) and really had one of the nicest meal we've had a long time. \n\nWill go back for dinner and report back!", "author": "MZ R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-01-20", "description": "Beautiful space. Good service. Nasty, salty, soggy food. I would possibly go back for drinks at the beautiful bar but NEVER for dinner. It's really too bad because it's such a great location and really nice vibe. The place did seem a bit \"young\". The kitchen and service staff were doing shots at about 10pm, mid dinner service. I think it's time for them to seriously consider a new chef.  Or at least they should taste the food before it goes out.", "author": "Rachel M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-10", "description": "Just wanted to also recommend the grits.  They are great.  Maybe a southerner might take offense to them (they have vegetables in it) but I think they are a perfect accompaniment to the fried chicken sandwich.", "author": "Larry L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-07-29", "description": "My gf works like right near this place so of course we ended up back there. Completely redeemed itself. The Hamachi sashimi wasn't great in spite of how awesome the fish itself was. The fried broccoli and cold pork roulade were amazing (although the mole sauce served with the roulade was borderline unnecessary). Service at the bar flawless this time. Thank you.", "author": "Will D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-26", "description": "I really really liked this place..the entrance is rather hidden behind subway stairs but once you're inside the first thing you notice is the amount of space, its one huge room with no pillars and two skylights, absolutely soothing if you ever get claustrophobic in places with too much gloomy \"atmosphere\"..coffee comes in proper white glassware with refills, the food itself sounds complicated but is actually very simple and very delicious..in fact, each plate is so clean and fresh looking, with perfect \"girly\" portions, not small but not overly large either so if you're starving you may need to order two things..suggestions: naan bread and eggs, perfectly toasted english muffin topped with fried broccoli and the waffle..yummmm...", "author": "Nell L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-02-25", "description": "Decent food at affordable prices.  We shared the fried broccoli appetizer which was so tasty.  The outside coating was crispy and not too greasy.  The inside had this oozing cheese that was a surprise since we were not  expecting it.  The matzoh crusted tofu with egg and ramen noodles was really good.  Mix the egg yolk around to bring out all the flavor.  It was a slow night with all the rain but which got us seated quickly.", "author": "Billie C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-09-12", "description": "passed there this weekend and it seems the local hipster-indie place is closed due to a Sanitary Inspection order. eww. doesn't sound very good when the restaurant guys seem to pay more attention to their clothes than to food preparation!", "author": "Edgygirl O."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-18", "description": "Try the Autumn Snake Bite, if it's Autumn. It's a NY regional thing. Great bar tender, service, food and atmosphere. Surprisingly mellow for a Sunday brunch place. It should have been packed.", "author": "Jenn L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-04-20", "description": "I have to write a review before my short term memory disposes of it. LOL. Sometimes, I feel like I have dementia. In any case, we came here on a Friday around 10PM, and it was busy. Not mobbed, but filled with people. We waited about 10 minutes for a table, which isn't bad. We ended up sitting at a high top and sharing a table, but that was OK with us. The waiters are pretty kewl, ours had a very 70s look to him, handle bar moustache and love his floral shirt :) They give out complimentary bread, accompanied by some sort of savory potato-based sauce and also some pickled cucumbers. Just so-so for me. But it was nice since I was starving. For appetizers, we had tuna carpaccio with artichoke chips. Very good :) I had the monkfish, which was excellent. Me BF had the sirloin, OMG, it was orgasmic. I usually can not stand red meat, but they did a good job, and I was really impressed. OH and the kimchi perogies, WOW!!! They have to mass produce it and sell them :) Great place to dine, and romantic :)", "author": "Vivian H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-09-08", "description": "A little pricey, but i love the design/feel of the place.\n\ni recommend: \nfried broccoli \ngrits\n\ndon't recommend:\ncold pork\nand i kind of remember someone not liking the dorade", "author": "John B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-01-21", "description": "So I helped my friend build some IKEA furniture all day today and as a thank you, he took me out to this place. Wow, I think this has had to be the best dinner I have had in NYC. The service was fast, the food was delicious and the company was great. A must go!", "author": "Giancarlo B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-21", "description": "My friend and I shared frise salad and dorade for main course.  The frise sauce was tasty, but my favorite part of the meal was the spicy dorade.  The fish was halved and deboned, then put back together and served as a whole.  The dessert on the other hand (we got chocolate pudding, which wasn't really a pudduing, but more like two small cakes) was underwhelming.  It was served with some sort of sauce I initially thought was currant, but had something chewy in it - not a fan.  One of the two tiny cakes was odd in flavor, but the other one was spicy, like chipotle chocolate and I enjoyed.  Thumbs up for the dorade, but would recommend trying something else for appetizer and dessert.  The cappuccino took some time, but was strong and satisfying.", "author": "Anna S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-10-17", "description": "This is the kind of place I love as a born and bred Brooklynite. Great vibe, broccoli tacos are amazing, bartenders always friendly, and my most important...they play great music!!! I love it when a restaurant isn't afraid to play rock n roll during dinner time.", "author": "C D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-06-08", "description": "Love the space and cocktail ideas and warm bean puree (no bacon and still delicious!). We went early before a show at BAM, so maybe that's why the famous fried broccoli had what I thought might be sauce but really was uncooked dough/batter? Kaffir poached monkfish was ok. Husband liked steak ok, although he ordered medium rare and it was mostly medium well. Dessert of passion-mango-almond cake was good. Is it too high of an expectation that in as cute of a place with $20/mains they should wipe the table down before dessert? I looked at some chunks of fried broccoli until the check came...", "author": "Jessica S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2010-12-29", "description": "I give Number 7 the above LAME rating because they are, well, lame.\n\nYou can tell a lot from a restaurant's pricing on a wine list.....And I understand enough about the food industry and restaurant business to know that wine and liquor can be your cash cow, but their wine prices are embarrassing.  The primitivo that they have by the glass and sell by the bottle is listed as almost $40/bottle ($38 to be exact).  This would be fine and good if the retail price in any respectable BK wine shop wasn't selling the same wine for...drum roll, please...$9.99.  \n\nCome on, people.  If you are claiming to put out a quality product to quality customers who like food, then at least ACT like you think that they have a clue.  I don't mind paying top price for something that deserves it, but nothing gets me going more than overcharging for the sake of doing so.  \n\nGRRRR.", "author": "Cat M."}], "servesCuisine": "American (New)", "priceRange": "$11-30", "name": "No 7", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "7 Greene Ave", "postalCode": "11238", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/lt-w9NOIuTSmE73S6_jLew/ls.jpg", "@type": "Restaurant", "telephone": "+17185226370"}