{"aggregateRating": {"reviewCount": 364, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-06-06", "description": "I can't get enough of this place. The service is wonderful and the chicken and waffles never disappoints. My only complaint is that the brunch no longer has the egg, cheese and Canadian bacon muffin sandwich. Why oh why is that gone?", "author": "Davidson H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2009-01-04", "description": "My husband and I were excited to try this restaurant.  We got there early so we put our name in for 4 people and had drinks and apps at the bar.  10 minutes before the other 2 people arrived, I had my husband check with the hostess and she said it shouldn't be a problem.  However, when we went to get our table she said it would be a 45 minute wait!  It didn't make any sense and she wasn't very apologetic.  The 4 of us walked out of the restaurant vowing not to go back - it's not worth the hype.  There was another guy working the tables list and he rushed out to apologize to us.  He said it was his fault that he let the table fill up but he didn't offer us any other incentive to stay or return for that matter.  I'm quite disappointed.", "author": "Dara E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-02-25", "description": "i went there 3 times, a few months apart.\nThe wine list is great  and affordable, and the bartenders can really help you out with what you'd like, in a \"realistic\"way. By that i mean taht they can actually advise you on a practical way. And get you what you wish for !\nTheir martinis are to die for. Just ask for what you'd like. I guess that it's the same in many nice places : if you ask nicely, you can really have what you wish for.\nAnd the food,,,,\nFor god's sake, for once Fort Green has a place where the menu has a real character. And taste. And flavor. You can really feel that either the owner or the chef decided to give some personnality to their dishes. That;s so rare around here !  It's so well proportionned ! an appetizer + a desert is only what your stomach can hold ! Finally a place that cares more about quality thant quantity.\nI just wish they had more veggie friendly dishes. sorry for being picky.", "author": "Desiree C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-01-04", "description": "We were looking for late late late night food and instead of the usual frozen deep fried pub food or greasy Chinese, we read about the new Ft. Greene hot spot No. 7. We showed up after 1am and everyone on staff was delightful, not tired or annoyed - in fact it was one of the most welcoming dining experiences we've had in a long time. While the late night menu is indeed a truncated version of the full menu (which looks incredible), this is not a fried food short list (as almost all late night menus are), but rather a handful of selections from their incredibly inventive and unique repertoire. This was truly intellectual food, e.g. Thai basil Jello cubes as a garnish instead of fries. We had one soft pulled pork taco dish that was incredible, fresh, filling and unlike anything we've had - from Momofuku and beyond. The other dishes were equally delicious with the same attention to detail (sauces and dips that really stand out). The room was beautiful, romantic and historic, and the location is unbeatable - right above the subway for those of you traveling from afar. I am rarely this impressed, and never with my late night experiences. I can't even imagine how exciting the regular menu must be!", "author": "Janine W."}], "servesCuisine": "American (New)", "priceRange": "$11-30", "name": "No 7", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "7 Greene Ave", "postalCode": "11238", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/lt-w9NOIuTSmE73S6_jLew/ls.jpg", "@type": "Restaurant", "telephone": "+17185226370"}