{"aggregateRating": {"reviewCount": 364, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-11", "description": "Two words: Broccoli tacos.  Doesn't sound good but the mix of the broccoli (not fried!), feta cheese and pine nuts nestled in a hard taco shell, then encased by a soft shell with pesto sauce - YUM!  Two tacos are so filling can be a meal itself.  \n\nBrussel sprouts were also a must.  the mix of chili and garlic is delicious and neither flavor was over powering.  \n\nI went here with a large group of people for a birthday celebration.  Service was good, maybe because we had a large group.  Two servers were helping us, one said we could order food without every sitting at the table, the other said we couldn't.  Outside of that, everything was great and I will definitely be going back to get the broccoli tacos again!", "author": "Krissy K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-19", "description": "Went here with a big group for brunch, which worked out perfectly. Not too crowded, not rushed, took reservations, had great options so everyone could find something satisfying, and good service. Perfect for any size group! The egg scramble was delicious (with cheddar and Brussels sprouts).", "author": "Kathleen W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-12-23", "description": "\"This country is, after all, a huge melting pot. Why should its cooking not illustrate the American transformation of diversity into unity?\"\n\nThat quote from Wolfgang Puck, that David Chang is fond of using, came to mind whilst dining at No. 7. I suppose that if anything is \"New American\" cuisine, this is. No. 7 seems to combine a lot flavors that I've never experienced together; they pull influences and ingredients from all types of cuisine. And I like it.\n_________\n\nI was early, as I often am. While I waited at the bar with a hot toddy to thaw my face, I found the bartenders so accommodating that when my date arrived, we opted to stay there, rather than head to a table for dinner. \n\nLet me preface this next statement by saying that you will probably never hear me utter these words again: sitting at the bar was a GREAT MOVE because otherwise we wouldn't have been able to eat the tofu (that only appears on the bar menu). \n\nTofu Sliders. Served on mini-potato rolls, they were just a pair of surprisingly large patties of fried tofu, accompanied by two sauces, a mildly spicy red, and a dill tartar concoction. It sounds pedestrian, but they had this crispy, crunchy, flavorful skin, and seriously, they blew me away. Probably because I really just don't like tofu. Ever. These sliders, and the tofu salad at Bozu. That's the extent of it. \n\nMoving on. \n\nWe also shared the pork tacos, which were nice and juicy, but could've used the kick of some spicy salsa, if you ask me. And you basically are asking me, by reading this review.\n\nShe got the Arctic Char; perfectly cooked, with a bit of crispy skin on top. It came with mint, lychee, brussel sprouts...a combination I would never think to try, but worked so delightfully.\n\nMy entree was nice and comforting on a cold evening: cabbage-wrapped chicken, served with hearty vegetables, haricot vert, potatoes, carrots, pearl onions. Although I enjoyed it, I do wish I'd ordered the Wagyu steak. The bartender convinced me to get the chicken, and he had been right about the tofu sliders, so I took a chance. I suppose I'll have to return for the steak.\n\nA final note: I like that they serve a white bean dip with your bread, because butter and olive oil can be boring. However, it was fairly bland. Still better than butter, but I much prefer the bean dip at Po.", "author": "Peter D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-24", "description": "No. 7 has a great bar. It's pretty spacious (there's a cool bonus window seating area too that's particularly good for a date) and the bartenders are friendly and knowledgeable. They always have an interesting cocktail menu and a decent beer and wine selection. The food is solid although there are a few nearby places I usually opt to go to for dinner over No. 7.\nI like that No. 7 is not pretentious or trying to be anything more than it is.", "author": "Terry T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-07", "description": "A neighboring diner put it well-- No. 7 offers a nice twist to typical brunch.  The menu is definitely not boring. Many of the brunch options combine ingredients that you wouldn't typically wouldn't think of together.\n\nMy cheese and egg on English muffins had the twist of a battered and fried kohlrabi patty (some sort of vegetable) and a special sauce (like ketchup but not).  I wasn't a fan of the sauce, but the sandwiches were delicious.  \n\nMy boyfriend ordered the butternut grits which came with a small bowl of maitake mushrooms (had no idea!) and other vegetables; a small bowl of fried hominy and a small bowl with a poached egg.  I tasted the grits and they were delicious and very cheesy.  \n\nWe also had a bowl pork sausage-- we had ordered the beef, but they were out.  I thought the homemade sausage was very tasty, with hints of spice.  The coffee was also tasty and served in wide, comforting mugs.\n\nOn each table was a deliciously, flavorful chili sauce.  It looked homemade and was perfect with the sausage.  And it was surprising spicy.  There was no salt or pepper shakers on any of the tables-- a statement perhaps?  Either way, the food didn't need any, as it was all well flavored and clearly well-thought out.\n\nThe service was good and the decor was nice.  The ceiling above the bar area/entrance is absolutely beautiful.  The rest of the resturant is simple and has an overall pleasant vibe.\n\nI'm subtracting a star from perfect for the dirty silverware.  There wasn't only one dirty utensil, but two.  Not good.\n\nI will definitely go back for brunch and  I'm curious about their dinner.", "author": "Maria M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-02-21", "description": "Pretty mixed experience. The broccoli tacos were really really good. The entree I ordered -- pistachio crusted eggplant -- was pretty terrible. Chewy, underseasoned fried eggplant nuggets, risotto that really was not soft and creamy, overly vinegary beets. Everything felt out of balance. My friend was also really displeased with the pork shoulder and found it way too sweet. Those tacos were great though and I'd go back just for those. And save some bucks.", "author": "Sonny S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-06-19", "description": "What kind of a taco has a corn center with a flour outer shell and then what kind of taco has vinegar doused soft broccoli as the main portion of the meal? My dinner date had the fish tacos and even they were terrible and off. How can you mess up a fish taco? Yikes... I really don't like this place and the night that we went there they had a reality show cast filming right in the middle of the dining room. On top of loud music, bad food and watery drinks this place is a hot mess! I do not recommend!", "author": "Simmons S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-02", "description": "Small, interesting fusion menu (it probably changes often), but when I went they were out of the one thing I really wanted to try--the turkey and goose meatloaf--so I had to settle for the skirt steak, which was uninspired.\n\nThe wine and cocktails are similarly limited, but everything they have is quality.\n\n Good ambiance and a nice space. I'd be wiling to go back out of sheer convenience (the door to the restaurant is located  directly above the entrance to the C train).", "author": "Michele W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-26", "description": "The dinner at this place was a lot more memorable than the basketball game we went to see afterwards. Fish tacos were prepared better than any (or any fish n chips) I have ever had- perfectly crispy and light, with a delicious mayo that they had the restraint not to call \"aioli\".  Everybody loved their meals- burger, taco casserole, pork chop, excellent beers and some phenomenal French fries. Would love to know what they do to make them so good, cause they look just like any other fries. The bread and dip were both so good, when the bread was gone I looked around to see if anyone was looking, and since they weren't, I drank the remaining dip (soup really) from the cup. It was that good. Note: if you like spicy things and you like pickles you'll love the muchin pickles- spicy fresh dill spears. mm-MMM!\nService was excellent, and they were accustomed to minding the time so you can get to your event at the Barclays Ctr. \nBar area appeared to possess good craik. If this was my local I'd be happy indeed.", "author": "Marc L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-09", "description": "Love this place. Went again the other night. Great service, great food, great bar. The room is airy and bright.", "author": "Rachael B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-23", "description": "Spotted No. 7 as I was walking down Greene and thought, \"That looks like a nice little cocktail bar - I will have to come here next time I want to go somewhere a little classier than my divey standard.\"\n\nI was mildly surprised when I discovered that the space keeps going and turns into a restaurant! With real restaurant food like steak and chicken! \n\nMy needs are simple: I parked myself at the bar with a Cormac McCarthy novel, ordered pickles and fries and a beer. The pickles are spicy homemade spears with lots of garlic and hot red pepper. The fries come with ketchup and oh-my-god amazing balsamic mayo. Like, pass-me-a-spoon, why-didn't-I-think-of-it delicious. But I'm a savory addict. And the beer...was beer. My friend had the broccoli tacos which seemed like a strange idea but were actually as good as all the reviews say.\n\nMy very adult meal came to $12, and on top of it I got to enjoy the a/c and watch the bartender singing along to the music they had on, so in all I'd say No. 7 has won me over.", "author": "Finlay L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-18", "description": "Great place for a date night. I've always liked the cocktails here. The steak is also really delicious and tender.", "author": "Kathryn H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-12-01", "description": "I came in with some friends on a Saturday night and only had cocktails.\n\nI ordered an old-fashioned, and another bartender started to lament how he loathed making old fashions, how they're pretentious, and they're only popular now because of Mad Men. He also said he drinks his coffee black and an old fashioned was the equivalent of putting cream and sugar in a coffee...\n\nRegardless of whether the bartender is correct in his assessment, he's in the service industry, and the old fashioned is a standard-issue cocktail. \n\nThere are so many great places in this neighborhood, there's no reason for me to stop here ever again.", "author": "Andrew C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-12-06", "description": "Brunch review (dinner review below, also great). \n\nI'm not a brunch guy (usually still lying in bed digesting the korean soup and assorted drinks from the previous night), but this was really good, again.  I normally don't comment on things like fries, eggs sunny side up, and toast - but these were all perfect (eggs verging on runny and cripsy at the bottom, toast looked like it'd be hard but it was soft and subtly buttery).  \n\nShrimp and pork sausage was good.  Sausage is always good tho.  The filet-o-fish sandich was also very good - more healthy than your McD filet-o-fish - but that also means a tomato slice and capers that takes away from the pure guilty pleasure that is a McD filet-o-fish sandwich.  Their own tartar ish sauce on the side was also nice.\n\nCan't believe I'm giving brunch 5 stars. I'm clearly in a good mood.\n\nService great.", "author": "Kevin W."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-01-17", "description": "The late night dinner we had here was okay to average. We were sat at the rear of the restaurant (past the open style kitchen) and it was so dark we struggled to read the menu. One of the dishes we ordered was not available however it wasn't until after they had taken our menus that they came back to tell us it's sold out. The waiter was then annoyed that we requested the menu again to select a replacement. The meals overall were enjoyable however our gripe was with the waiter who was rather rude, abrupt and awkward. The worst was when I went to finalise the bill he was grunting and aggressive and swiped my card hard and aggressively.  He also slammed down the receipt and pen. My fiancé and I were both taken aback by his manner and actions. After that we wouldn't be recommending a return or that anyone strike the male waiter we had.", "author": "Joshua J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-29", "description": "A++ amazing food, great romantic setting. Highly recommended for intimate meals. One of the best meals in Brooklyn.", "author": "Noam R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2008-12-01", "description": "I would love to give No.7 a rousing 5-star review based on the atmosphere, friendly staff, owners, and chef, lovely space, and not to mention the slight nod to Korea (chef's wife being a Korean) on the menu, but I have to point out some of the initial new-restaurant-kinks (I hope) they need to iron out.\n\nMy friend and I stopped by No.7 for brunch after chatting with one of the owners on the night of their first few days of opening.\n\nThe design of No.7's back dining area is quite nice, with the high windows allowing lovely warm natural light to shine in, creating a very refreshing and delightful atmosphere during the daytime.  \n\nI ordered the fried chicken, with a side of Kiebasa (what, you don't eat pork and fried chicken for brunch all the time?!), my friend got the egg and cheese on a biscuit with Prosciutto, and we both tried the spiked coffee drink that I am failing total recall right now.  \n\nThe drink was delicious.  Too much so.  I highly recommend it, but I cannot guarantee that you won't be tempted to order a 2nd.  \n\nThe Kiebasa was all right.  It was good, but nothing special.  \n\nI really loved the deep fried chicken.  It had a very distinct outer layer, which reminded me of some anime-armor, in the most delicious sense.  It was super crunchy with a bunch of flavor.  DO IT!\n\nAs for the Prosciutto Egg Biscuit, it was kind of luke-warm, on the cold side.  Digging into a cold plate of food at a restaurant is like using the office microwave.  Unpleasant.\n\nIf No.7 can work out a better system of keeping their food hot until it gets to the table, I'm ready to dole out the 4- or the 5-star rating.  \n\nYes, I will try them for dinner at some point and revisit with high expectations for brunch.", "author": "Arthur O."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-05-26", "description": "I'm confused if this place is a restaurant or a bar.  The front area has a nice lounge-y feel, and there's always a nice crowd, but it closes pretty early and when I came at 11:45 one Friday night they told me the cocktail menu was \"closed.\" I get how a kitchen can be closed but how could the bartenders decide to just stop making half the menu?  Foodwise, it seems like a cute spot.  I had some spicy garlic scrambled eggs for breakfast which were a little odd, but I loved how sitting in the back room with the sunlight feels almost like a greenhouse.", "author": "Maeve M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-24", "description": "I give this place 4 stars because I like it here. I dock a star because I once had a heavy kind of weird and over seasoned/prepared meal that really stuck with me to the point that I don't want to commit myself to another meal at this place again. That's pretty rough right? I like the bar a bunch. Decent marble situation and cool brasserie feel. They get that right. It's a good place to get drunk, but keep it on an empty stomach;)", "author": "Gene K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-26", "description": "Wow. Did something change? I remember No. 7 being pretty good... Last night: it was freakin' GREAT! \n\nFried Broccoli. Fantastic from start to finish. Fresh broccoli dipped into what I'm going to go ahead and call a hearty Korean chijimi-type batter, and fried to perfection. Served atop a tasty black bean spread and w/a tart n' tasty mixed green salad w/grapefruit on the side. We should have ordered seconds! \n\nIf you're hankering for an incredible sammich, do treat yourself to their Pork Loin Sandwich. This badboy comes w/guac, which could very well be the end of the story, but wait! Let's not forget the slice of f cumin-crusted eggplant. All served on a brioche bun. Seriously. Delicious.\n\nThe $22 Tortilla Soup sounded both amazing and ridiculous at the same time. So I did the dew and was quite impressed. Fresh tilapia, rock shrimp and fried calamari in a flavorful broth w/a slight Asian flair and a side of jasmine rice. It was actually really satisfying; reminiscent of a Tom Yum soup. Hopefully this will be the most expensive soup I ever order. \n\nCan I get a replay?", "author": "Lans S."}], "servesCuisine": "American (New)", "priceRange": "$11-30", "name": "No 7", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "7 Greene Ave", "postalCode": "11238", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/lt-w9NOIuTSmE73S6_jLew/ls.jpg", "@type": "Restaurant", "telephone": "+17185226370"}