{"aggregateRating": {"reviewCount": 139, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-11", "description": "Vegan junk food heaven. Thar be:\n12 kinda of burgers\nMelty vegan cheese\nFries with cool toppings \nVegan shakes\nBeer\n\nDude, you should come.", "author": "Marc S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-03-17", "description": "While making better choices with eating cleaner/healthier, \"Next Level Burger\" is a spot, where, one can indulge and NOT feel guilty, later on. However, although the food may be good, there (cashiers) customer service (most of the time) does NOT reflect the same way, which is unfortunate. Most, if not all, there cashiers should be re-trained on improving their customer service because it is horrible.", "author": "Laura J."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-02-19", "description": "Everyone knows I love burgers- of all kinds. I had been hearing about Next Level for some time and when I found out it had popped up near my house, I had to try. And boy was I DISAPPOINTED on EVERY front there was. \n\nWanting the full experience, I got the \"Special Sauce Burger\": \"Savory Meaty Patty topped with House-made Special Sauce, Dill Pickles and Cheddar or Swiss Style Cheese\" and a small tots. \n\nI ordered my burger at 1:13pm. About 15 minutes in, the couple next to me, who ordered after me,  got their much larger order of two burgers, fries and shakes. OK- maybe they had those on hand??? Rationalizing here. \n\nThe alarms started going off in my head when I heard a couple behind me say \"we ordered two burgers and a french fries and what we got was a burger and bbq fries\"... or something of the like. Again and again I was hearing these \"yes, but I actually order THIS and got this other thing instead.\" Yikes. \n\nAt 1:45pm (I said I would give myself a half hour), I asked one of the waitstaff \"Hey can you check up on 54 please\" and the guy gave me a \"sure\". I asked him again, politely, after a few minutes and he said, \"I don't know what to tell you, it's coming.\" I wasn't having it. I saw the lady who looked like she was calling the shots and I asked her about my order and she said something about \"them not putting my order through and that it's coming right away... to comp you I am giving you two free shakes\" In my head I was like \"GIRL, I DIDN'T ORDER A SHAKE THIS TIME WHAT WOULD MAKE YOU THINK I WOULD WANT IT NEXT TIME AROUND?\" Oh boy, am I getting HANGRY. Keep it calm man, keep it cool. \n\nSo I waited and made sure the manager-looking lady could see me. She finally came back with my food (1:57pm) and apologized profusely, giving me a $50 gift card and asked me to return. That's a bit better. \n\nNow to the food, which we finally got. \n\nIt was.... meh. As far as veggie burgers go this was nothing special. It was also small for what I paid for. I also asked for tots and got french fries. The fries were excellent, however. Rich, seasoned, crispy and the ketchup was out of this world. Best ketchup I probably have ever had. It was a bit zesty, creamy and not a lick of the watery stuff normally found in ketchup. The $50 card will be spent, eventually. In the late future. I will try and provide an update then. I recommend management do a re-up of training and make sure everybody knows their role.", "author": "Safi A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-02-03", "description": "By Chloe, Impossible Burger, and even Beyond Meat burgers that you buy at Whole Foods and cook at home are all better plant-based burgers than these.\n\nI think where NLB falls short is that their food tastes too healthy. Just because I'm veg doesn't mean I want everything to taste like a salad all the time. The bun is health grain and way too big for the patty, the patty itself is very dry and not really comparable to meat--reminds me of the hockey pucks they served at my high school and called burgers--and the vegan cheese really just has a bad flavor. I think vegan cheese is usually a miss though, so not really their fault. Maybe just avoid. \n\nPlaces like By Chloe have really raised my expectations to how delicious vegan can be, and Nextlevel just isn't delicious.  \n\nThe fries are fine.", "author": "Sydney L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-02-19", "description": "I find it ironic that the white manager on shift of a vegan restaurant has a head full of locks..... So you care about animals, but not your fellow man? To make it worse, she's managing a 100% POC staff..... Look up cultural appropriation, this is mad offensice. Incredibly unappetizing to have to look at while eating my meal. And y'all wonder why more Black people don't feel welcome in vegan spaces.\n\nBurger was meh.", "author": "Sierra F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-22", "description": "After dropping off my iphone at the apple store for a new battery and waiting for them to ultimately kill my phone (story for another time), I decided to check out the new whole foods next store.\nHunger kicked in and I found this \"burger\" place near one of the upstairs entrances. It took me a while to realize that it was a plant based burger place. I can eat the hell out of a beef burger but I also share a passion for a well made vegetarian burger. It just so happens that day I was in the mood for one.\nI ordered the Signature burger because i like quinoa and weirdly named mushrooms fascinate me. I ordered it with cheddar but they were out of the cheddar that day. They substituted it with the gouda-like cheese. As far as veggie cheeses go the taste and consistency is quite pleasing. The burger itself was quite good. It also held together pretty well considering most freshly made veggie burgers I have had usually fall apart pretty quickly. \nFinished the meal with fried tots to make a pretty pleasing meal. \nI'll probably be back. \nNot exactly health food but if you are looking for something different, or you are vegan, this might be your place.", "author": "Leala V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-22", "description": "Burger is good but the pace can be misleading for us meat eaters. On my most recent visit, I received the wrong burger and am upset as this was a cheat meal. Good food nonetheless the verdict is out on the shake lol it taste too healthy!", "author": "Asiah C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-24", "description": "Happy to have another vegan spot in this side of Brooklyn. \nStaff: Friendly and helpful\n\nFood: I had the special sauce burger with fried (you can have them baked as well) tater tots. \nThe \"burger\" has lettuce, tomatoes, raw red onions, pickles, cheese ( swiss and cheddar are the options) and of course the special sauce. \nThe tots came with a side of ketchup. Who doesn't enjoy tater tots. Their crispy and deliciously fried. \nIt's all good baby baby!\n\nAmbience: Clean. I could end there but even though it was busy there is plenty of seats available whether it's in the next level area or towards the back of the complex. If you're dining in you'll get a number so find a seat and wait for your meal. They'll bring it to you.  \n\nVegan or non vegans can enjoy as yes it's 100% plant based but, you will still enjoy the healthier version of a burger", "author": "Sophy G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-09-23", "description": "Had the Vegan cobb and tater tots with cheese and onions. The tots were great, but the cobb was not. The dressing tasted awful. And the bacon was weird, I've had better vegan bacon for sure. They should re-think such an expensive salad or remove from the menu. Service was good, friendly. But for a day that wasn't super busy staff still seemed a bit frazzled.", "author": "Alisa V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-31", "description": "It's hard to find, well practically impossible to find a place where you don't have to worry about what you are eating. It's all plant based (vegan). I had the Brooklyn burger and tots and crinkled fries. It was all delicious. Love it. I'm so happy.", "author": "Alejandro A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-31", "description": "This place is excellent. It is 100% vegan and I've only had the Brooklyn burger and the tater tots but I was not disappointed in the least bit. I have never had tater tots made so perfect. They are incredible. The burger was out of this world. Do yourself a favor and get down there. It is worth the trip. I had the lemonade which had that hint of ginger and it was perfectly sweet and delicious. I'm so happy this place is here in Brooklyn so close to me.", "author": "Gisela A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-07", "description": "I just can't with this place any more. I have been a repeated customer here since they opened, and I just waited for 30+ minutes to get a veggie burger and tots. They guy who appeared to be the manager was screaming \"I need x, I need y\" to the guys working their ass off in the back while failing to notice that he'd left my order sitting there the whole time. The worst part of this is that he took an attitude with me when I politely asked if they were working on my order after skipping over me for over 30 minutes!!!! This is ridiculous treatment for this price. You're better off going downstairs to whole foods and cooking your own food - it'll take less time and you won't have to deal with rude managers.", "author": "Adam M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-08", "description": "Definitely one of the better vegan hot dogs I've had. The special sauce was so good, and it was nicely complemented by the coolness of the cucumbers. It was a bit messy to eat though.", "author": "Duffy M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-02-13", "description": "Options, options, options are the name of the game. It's really any vegan or vegetarian's dream to go to a restaurant and not know what to order because he or she is presented with a veritable sea of choices when everything is meat and dairy free.\n\nI had the bbq blue \"cheese\" burger, some loaded fries and a kombucha for a grand total of $28. While it was good, it wasn't blowing my mind (maybe all the hype from the vegan bloggers made me expect more). I felt like the burger was just decent and the fries were doing too much - drowning in sauce and fake cheese- I did like that you can choose whether you want your fries baked or fried though.\n\nOverall this place is pricey for what you get, especially given that it lacks the ambiance to command that kind of price. I would come back , but I'm not leaving my borough to go here as a destination in itself", "author": "Helene A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-29", "description": "Junk Vegan food. Salty, greasy. Very disappointing. Hot dogs and burger patties are salty and like cardboard texture. Chili dog has tons of beans and cheese the bread gets saggy and al that cheese is the only thing you can taste.", "author": "Giselle B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-08", "description": "I love that it's all vegan. Lots of options. Not too tiny like a lot of vegan places. Food was good.", "author": "Sophie B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-12", "description": "Quick, affordable plant-based food.  They have a variety of \"burgers\" and \"hotdogs\", plus shakes and fries.  They also gave a pretty good selection of beer and hard kombucha.  I tried the spicy bean burger, which is made with a black bean and veggie patty.  It was good, but I think it would have been better if they had warmed the bun.  Really, I think the burger warrants a 3, but the location and other offerings make the place overall a 4.", "author": "Candis D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-22", "description": "Everything I wanted in a vegan burger shack and more. To be fair I've only had the Special Sauce burger and the Classic burger, but both were so good it's hard to stray. Service is quick and cordial. Will be back as many times as my \"treat yoself\" schedule will allow. #specialsauce", "author": "Andrea M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-10", "description": "Was at a project site last week, searching for Rip's vegan burger joint and this popped up. I thought let's try something new. It is in the same building as the Apple store and Whole Foods in kind of a food court, like at an airport, but higher end. (Oh how Flatbush has changed.) Anyhow, I ordered their special burger, fries and a coconut 'milk shake. It was delicious. It's a bit pricey, almost $20. That is why I only gave it 4 stars.", "author": "Nick P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-11-15", "description": "Great non-burger burger!!!  My friend took me there today after a local yoga class, and I was pleasantly surprised.  I couldn't decide as there were so many mouth watering options, so I settled on the \"Signature\"; House-made umami mushroom and quinoa patty topped with avocado and roasted garlic thyme mayo. I opted out of the vegan cheese option (not a fan) and added grilled onions.  Bun was fresh (next time I'll ask for it to be toasted), and the lettuce, tomato and onion fresh.  It was yummy!  Will definitely go back to try the other items on the menu.", "author": "Myra S."}], "servesCuisine": "Burgers", "priceRange": "$11-30", "name": "Next Level Burger", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "292 Ashland Pl", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/XOYtaV_PP_1WL1uvo6j_WA/ls.jpg", "@type": "Restaurant", "telephone": "+13473842277"}