{"aggregateRating": {"reviewCount": 139, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2019-05-21", "description": "Their food is really good, but last time I waited 25 min for my food to go. Was sitting right in front of them with my number. Turns out my order had been sitting on the counter for who knows how long but they never called my name or my number. Sad that all my food ended up being soggy.", "author": "Katherine R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-15", "description": "Dope vegan burger joint inside the Whole Foods by Atlantic Center. \n\nWe ordered the special sauce burger, signature burger, and baked sweet potato fries. The fries come with this addicting spicy mayo. \n\nI highly recommend getting the special sauce burger if it's your first time at a vegan place. The burger tasted pretty meaty even tho I'm guessing it's made with soy. And the cheddar cheese tasted really nice. It is not a 100% imitation to an actual cheese burger, but it's one of the closest I've tasted.\n\nThe signature burger was also tasty but it's more of the typical vegetarian burger. It look like it is made with quinoa and beans.\n\nOverall a solid vegan burger place!", "author": "Siyun Z."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-21", "description": "Craving a burger'n fries we stumbled upon Next Level Burger a fast food vegan friendly burger joint. We were quite surprised at the quality of the vegan food. I ordered the Classic Savory Meaty Patty topped with Dill Pickles, Ketchup, Yellow Mustard and Egg-Free Mayo. As a new vegan I still crave meat and I'll tell you I could not tell the difference!\n\nStaff: very friendly and helpful when asking questions about menu items. \n\nEnvironment: located in the Whole Foods food court there is plenty of seating and a great view of Downtown Barclays area. WiFi available \n\nPricing: I would say for the quality of food you get the prices are respectable. \n\nIf you are craving fast food that is healthy this is the place to go even for non-vegans", "author": "Brian C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-14", "description": "I've been quite a few times. My initial review draft was a--5-star, completely lost my s* because there's a vegan restaurant off the 4 train. \n\nBut after several visits, I've calmed down quite a bit. Still above average solely on the premise that they're filling an otherwise downtown BK vegan restaurant void. This chain is also not new to the game and has other locations out West, so I'm giving my warmest NY welcome. \n\nA few things or just one thing: lots of options, not enough flavor. It's as if in their effort to offer an interesting menu, they skimped on the flavor. I've tried 3 burgers and two loaded fries and all were good enough, but on the blander not quite memorable side. I most recently tried the Signature burger, which was the best yet. I believe it's served with ranch which is far better than the \"special\" sauce which leaves a lot to be desired. \n\nShake wise, the brownie explosion is my fave and they're rather generous with the portions. While I haven't tried the beer as yet, I do appreciate the offerings. I'll be here again in spite of the shortcomings, mainly for the Signature burger. I can do without the fries.", "author": "Racquel B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-12-04", "description": "On a scale of 1-10 I was a solid 10 on the excitement scale when I saw next level burger in Whole Foods. Based on their social media the burgers looked extremely similar to veggie grill in the west coast, so needless to say I was pumped. \n\nSad to say that I was extremely disappointed in the quality of the burger. The buns were dry, the burger tasted like it was out of the microwave and the blue cheese was ehhh. \n\nFor being in a Whole Foods, they lacked quality and freshness. I'm not sure if it was the location or what but there was so much potential here and they came up short.", "author": "Christina H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-04", "description": "Late on evening....maybe it was a Saturday, I walked into this spot and began to peruse the menu. Oddly enough I did not notice the that this spot specialized in vegan options, I just thought there had healthy options which made me smile.\n\nAs I stood there confused, the gentleman at the register notice and offered his advice. He mentioned that he isn't vegan but he still enjoys the food here because YOU CANT TASTE THE DIFFERENCE!!!! Let that sink in for a second. Let's say you love bacon cheese burgers like Quincy (I'm Quincy btw) but you're also lactose intolerant like Quincy, chances are you get annoyed when you want a burger and \"can't\" have one.... this place fixes that problem. The burger I ordered, you couldn't tell me that there wasn't beef, bacon, and cheese in there nor could you tell me that there wasn't pieces of chocolate in my cookies and cream milkshake.\n\nI sat there happily enjoying a bacon cheese burger and cookies and cream milkshake.... this place is amazing.\n\nThe staff is helpful and cool a shell.\nThe food taste like the non-vegan alternative.\nThe prices aren't bad.\nLastly, no bathroom issues later lol. TMI? too bad!\n\nPrice: 4.5/5\nService: 5/5\nFood: 4.5/5\nAmbiance: 4/5\n\nCash and credit happily accepted.\nYo, and say waddup to Omar if you see him.... that's the dude who helped me decide.", "author": "Quincy T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-20", "description": "I am in LOVE with this place!! Ive been procrastinating about trying it but after my family raved about it, I thought I better try it. Also, I shop in the Whole Foods in the same building and it smells AMAZING. \n\nWe had a Signature and and Original. I love the wholesome fresh taste and I really love the fact that no animals got hurt just so we could have a meal. I like the sauce, which is unusual for me. \n\nWe had fries and tator tots. Get the tator tots. They are warm and crunchy (my favorite) with the perfect salty seasoning.\n\nThe people are very friendly and gracious. The space is a tiny bit awkward so we took our warm bag home to enjoy. Perfect \n\nHighly recommend!!", "author": "Diane W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-02-17", "description": "Expensive for what it is, I buy beyond burgers;  cooking at home and they're killer;  and I also make the fries. \nI don't think They don't make anything from scratch.\n\nIf money was no object, then it's just OK but I don't see a point in a place like this when this is the simplest food to make at home.", "author": "Rosario S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-04-23", "description": "Found this spot during our day trip to Brooklyn. Loved the menu options. I had the chili hot dog but asked that all the extras be held back just the chili please. It wasn't bad at all but the chili definitely could have used more flavor. Kendal, my daughter had the chicken sandwich, think Chik fil a. She enjoyed it and we both loved the fries, mine sweet potato and hers crinkle. Love that they had a baked option but we both did fried. She and the hubby went for milk shakes and both allowed me to taste. They were delicious!!  Definitely would visit again!!", "author": "Bernie D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-05-05", "description": "Burgers and shakes are really good. Lots of options and I've tried most everything on the menu and been happy. Unfortunately if you don't order online, service has taken a hit here and you could be waiting a while just to place your order.", "author": "Ann X."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-21", "description": "First time every having all vegan food! I am extremely impressed! This place was so delicious i returned every weekend for the last 4 weeks since the first time I went. \n\nPrices are well worth the quality of food! This place should definitely be a stand alone restaurant at some point. \n\nThe atmosphere is very much like a burger joint/diner. \n\nEveryone must try their signature sauce!! It's is DELICIOUS!", "author": "Domeá G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-01", "description": "I am not a big fan of vegan burgers, but this one certainly changed my mind of all vegan burgers. I even went to a vegan festival, and this burger tops them all! This may be the meatiest vegan burger than I have ever tried. This is my go-to burger during my lunch breaks at work not only because it's affordable and fast service, but also because it's delicious. The workers there are also very friendly and attentive! Highly recommended to vegans and non-vegans alike, or if you want a quick bite or stay in!", "author": "Oscar G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-26", "description": "I'm surprised to find this place always so full.  Does the populace really want vegan burgers?  I guess so!\n\nI've only been once, but found my burger - one of the special menu ones - to be quite good. Was it good for the price?  Not really, I think these are quite expensive for what you get, but I cannot say that I wasn't satisfied with the taste and meal. We got tater tots along with our meal, and those were mighty tasty.  That this was all vegan is a treat though, well making the wait, and even the price, pretty acceptable.  \n\nThe staff were cool and handled the bevy of customers well. They also keep what's a pretty small eating area pretty clean.\n\nI still want to try the Signature and the All-American, and even the salads, which look pretty dang good.  Maybe after a workout one-day I'll even try one of their shakes!", "author": "Curtis J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-13", "description": "Had the classic burger which is made with the beyond burger. Have to say, t'was amazing! \nGot it with cheese and special sauce! Closest thing I've had to a real burger.", "author": "cyslin P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-22", "description": "For a fast food style burger place, I'm obsessed. The place is located inside the Whole Foods near the Barclay's Center, so it took my friend and I a while to find it but the hunt was totally worth it. As a vegetarian, I love a good vegan/vegetarian burger that's not just a bunch of lettuce and tomatoes in between a bun, and Next Level Burger did not disappoint. I ordered the Spicy Bean with a side of tater tots. The burger was HUGE and the whole meal really filled me up for what I paid. The wait time was not long either...it took about 10-15 minutes from the time we placed our order to receive the food.\n\nOverall, I was very satisfied with the meal and the overall place. Good if you are vegan/vegetarian and are craving a burger on your way home from work.", "author": "Zainab R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-25", "description": "I absolutely adore this place. The employees always great customers with a smile, and constantly crack jokes. I come to this location often and during my first visit here, they helped walk me through the menu and even gave me some recommendations. The food is incredibly delicious. So happy to have this vegan option nearby! (I would definitely recommend their signature burger!!)", "author": "Shelly Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-18", "description": "It's very hard to come across vegan food that is really tasty. Now I'm not a vegan, I'm a baby pescatarian, but I been here twice already and I must say it is still abslutely amazing. The first time I tried the Beyond Burger which was really good. The 2nd time I tried the classic chzburger and that was amazing as well. Only thing is they didn't put the special sauce on the chzburger but no big deal. Now the item that I can not resist is the Vanilla Shake with coconut instead of soy. It is aaaaamazing. Better than any shake from McDonald's, Burger King even Starbucks (I'm not exaggerating). This shake was so thick and so delicious it was worth every penny. I wish they had larger cups. \n\nAltogether the food is very filling. Very worth it. Taste exactly like meat, but is way healthier. Totally recommended it to everyone. P.S I need the vanilla shake recipe", "author": "Arissa I."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-04-15", "description": "Delicious food, but the experience is kind of wasted by really subpar customer service. I walk up to the counter today and a girl in red glasses does not greet me with a hello, just scrolls her eyes up from the tablet she's looking at with an expression that reads \"what\". Very awkward.", "author": "Jerry C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-06-15", "description": "Went after the gym because I wanted something healthy and great!!! I had the black bean burger with crinkle fries, and the lemonade. Somehow, there was a tater tot tagging along with my fries and damn, it was good!! I tried to exchange those ole boring dry crinkle cut fries for tots but the manager wasn't having it! Don't sleep like me, always get the tots.\n\nRegarding the burger, it was more like mushed black beans, not bad but not the best I've had. The lemonade was delicious.", "author": "Jeanene B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-02", "description": "Absolutely amazing! I literally have come here every day for the past week. I CANNOT get enough! Great location! You can walk downstairs to do all of your grocery shopping in whole foods when you are done and the windows make for some great people watching. The staff is always super friendly and the food is AMAZING! Seriously. Even if you aren't Vegan you 100% have to give this place a shot!", "author": "Liz H."}], "servesCuisine": "Burgers", "priceRange": "$11-30", "name": "Next Level Burger", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "292 Ashland Pl", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/XOYtaV_PP_1WL1uvo6j_WA/ls.jpg", "@type": "Restaurant", "telephone": "+13473842277"}