{"aggregateRating": {"reviewCount": 139, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-12-13", "description": "Great concept and I'm happy there are more plant-based options, but their homemade patty was very lackluster, didn't have great flavor. Really wanted to love this place!", "author": "Dylan G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-20", "description": "August 6, 2018: \nSadly, Next Level Burger is dead to me. One of your staff,Jermel, ensured this outcome today. I ordered a grilled cheese and strawberry sundae to go. Everything seemed fine until Jermel so rudely told me to eat my sundae there or I couldn't have it. Jermel got very loud with me insisting that I listen to him- last I checked I am a 39 year old woman who is not his child. I am not sure who Jermel thinks he is, but you can't force a customer to eat their to-go food in-house. Everyone around me was as shocked as I was- telling me to make sure that I complain to upper management. Jermel proceeded to talk under his breath and loudly slammed the sundae into the trash. Did I mention- Next Level is DEAD to me! \n\nI am a vegan. I work at the hospital right down the block. I used to patronize your store 4 times a week minimum. I don't have many options for vegan food in downtown Brooklyn, but Next Level will never receive a dime from me again. F- \n\n\nOld Review: Food is delicious and this is a go to for me, but some of the staff have \"yuck\" attitudes, which sucks. Also, they are often not open at opening time and/or no one at the register.", "author": "Jolene B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-04-19", "description": "This place is a gem! I had a classical cheeseburger and it was good. Place is clean and the workers were friendly but forgetful. The nice cashier totally forgot our awesome \"milk\" shakes. I finally mustarded up the strength to walk away from my meal to get our shakes. She apologized and upgraded our shakes. Overall, my experience was great and I will be sure to come back very soon.", "author": "Melissa M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-22", "description": "The food is really good here\nIts more like a fast food atmosphere as you counter order so wouldnt recommend a date here\nBut good selection of salads burgers and fries", "author": "Rita J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-26", "description": "YAS VEGAN BURGERS TO (NOT) DIE FOR! \n\nI love the milkshakes. Get an orange cream. Yum. \n\nEverything.", "author": "Kelsey S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-01-22", "description": "If you like to eat hamburger, do not go here. I assumed \"100% plant based\" was meant to be quality of beef.    So I was extremely disappointed by the quality of the pate.", "author": "Hoikiro T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-01-12", "description": "The reason I'm giving 4 instead of 5 is because I never saw an option to have a non gluten free bun. I love that they have gluten free and everything is vegan but honestly I really don't like gluten free buns. I got the beyond burger which I've had many times but every place does it differently. I'd go again if they had an option but I won't because the buns tasted and felt stale (I get it it's gluten free). Not my cup of tea. HOWEVER, I took the majority of it home and ate it the next day. It was way better the next day probably because the buns soaked up the juices from the burger overnight. If you're gluten free this is your heaven. If not, you can either take it to go and use your own buns or just be patient and it'll be good. Whatever your taste it.", "author": "Kate B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-01-17", "description": "Whenever I'm on this side of Brooklyn I enjoy coming to this fast food spot and the awesome service. I appreciate the selective menu and the great tater tots which is my favorite. Always a pleasure.", "author": "Alexis T."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-10", "description": "Honestly terrible from a flavor and texture standpoint. The bun was irredeemable - dull and flavorless and crumbled apart immediately upon eating. It was like dry wonderbread. The patties were devoid of flavor and texturally challenging. Vegan cheese is always a bit of a miss for me, but this was on the lower end of the scale for sure. The tempe bacon was the only saving grace on either of our burgers. The condiments were later on so thick at least I could taste those. Also, salt is vegan. Maybe use a bit?\n\nOur milkshakes were fair. \n\nIn a world where Beyond and Impossible exist on a mass market scale, and places like Superiority Burger are doling our delicious plant based comfort foods that don't compromise on flavor or texture, there is no reason for this place to exist. \n\nI would have given two stars for the fact that the service was friendly, but as the restaurant itself does a disservice to veganism by putting out crap food. If you're flirting with veganism, don't try this place. Even By Chloe is worlds better than this place.", "author": "Ryan F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-20", "description": "This is the best vegan food I've ever had!! Their strawberry basil lemonade is official and it's located right in the Whole Foods Market entrance. There's gluten free options \u0026 their tater tops are delicious as well. For two people we spent $45. It's a little on the pricey side when you add fries and drinks because the burgers are $9.45, but it's worth it.", "author": "Celine J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-22", "description": "I LOVE THIS PLACE! \n\nAs a proud Vegan, I must say:\n\n1) The food is delicious \n2) The venue is clean\n3) The customer service is friendly and fun\n4) The Managers are kick-ass\n5) This is a great place to bring a date\n\nI have patronized here almost every day since opening day.  The staff know my name and the love me.  We as always laugh and have a great time.\n\nI would recommend Next Level Burger to Vegans and non-Vegans alike.", "author": "Malynda R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-09", "description": "Really good vegan burgers. Lots of choices and the patties are really good. I live the Mexicali but I bet everyone on the menu rocks. Great fries too and you get em fried or baked!!", "author": "Neil G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-20", "description": "Came here on a lunch date. My burger was sooo yummy. I'm sooo tired of the boring frozen patty from the grocery that lack flavor and vegan burger tend to taste blah!!! But I must say that these burgers have a lot of flavor. Yay", "author": "Nicola V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-02", "description": "I was really surprised to find this place just a few steps away from Atlantic Terminal. Went with some friends after a long day. The burgers were very good. Neither mushy nor over cooked.But a good balance of texture. Also the 'cheese ' on the cheese burgers is vegan. \nThey also offer fries and tater tots. Tots can be baked or fried. Nice touch!\nThe service is great. Even if the wait times are a bit much, they make up for it. \nI plan to go back and try one of the shakes as well be t time. \nOnly negative would be that there was an inordinate amount of condiments on our sandwiches. Like I had to scrape it off with a fork.\nOther than that minor detail, great.", "author": "Russ N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-20", "description": "The service is good. It's convenient that they bring out your food to your table. Everything is plant based. \n\nVegan grilled cheese to the lactose intolerant lol yesss the bread was (vegan) buttery and it came with tomato, onions and avocado. Get tried the kids version if you don't want the extra veggies. \n\nTater tots are good and they are offered baked or fried. I truly appreciate the dairy free milkshakes. Things add up kinda fast tho.", "author": "Carina C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-18", "description": "Impressive for a vegan restaurant. I'm neither vegan nor gluten intolerant, but my wife is both, so this place was perfect for her.\n\nThe food was a tad pricey, but enjoyable. Ask for the GF patty, they'll make you a Beyond Meat burger, which is by far the only decent meatless burger on the market.\n\nWorth going back, even for a meat-eater.", "author": "Richie G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-26", "description": "I love this place. Fresh fresh fresh!!! The signature burger is everything.  The staff is super nive and accomodating. I tried the beyond burger ...ehhh. I requested to change to the signature burger and it was all I thought it would be.", "author": "VOnda W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-12-25", "description": "The food was very tasty, couldn't believe it wasn't meat. The service very friendly and helpful regarding questions.", "author": "Rodney J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-01", "description": "Wow! Glad Next Level finally made it to the East Coast. The food is amazing! Try the Animal Burger (top right) if you dare - it's humongous and worth every crumb dropped in my car. \n\nThese guys ahve great service, and bring the food to you even if it's to go. Prices are really affordable which is refreshing for a vegan Brooklyn restaurant. \n\nCheck this place out!", "author": "Chaim M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-11-29", "description": "I have been here twice I had the All American Burger with french fries. The burger patty itself is good but, I think the what is most helpful is all the add-ons. You can customize the burger to the bite that you like best. Tempeh bacon is meh but the grilled onions are perfectly cooked. The fries are done in safflower which generates a different grease feel than most fries. Still good just different. I think this is a worthy option especially in this valley of fast food.", "author": "Me 2."}], "servesCuisine": "Burgers", "priceRange": "$11-30", "name": "Next Level Burger", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "292 Ashland Pl", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/XOYtaV_PP_1WL1uvo6j_WA/ls.jpg", "@type": "Restaurant", "telephone": "+13473842277"}