{"aggregateRating": {"reviewCount": 139, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2019-05-26", "description": "On my way to a dance festival stopped here for a snack.\nHad peanut butter milkshake and specialty fries. It's a great organic food choice.\n1. Service was excellent\n2. I felt milkshakes should have more richer blend but otherwise it was really good. My wife had the vanilla shake \n3. The fries are not the average fries-they are not salty, not overdone with a great cheesy and specialty sauce\n\nGreat job NLB", "author": "Darren B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-30", "description": "They are ALWAYS so lovely. I had the chicken sandwich with tatertots and mmmmmm they were great. This location is in a Whole Foods, it's not too big but the customer service makes up for the space.\n\nI would mention just one person but from the moment I go in I'm treated so well amongst everyone. \n\nThe wait time for the food isn't the quickest but it's worth the wait with the amount of smiles and laughter I get from the crew. You are all the bomb!", "author": "Zayn S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-29", "description": "I've been a vegetarian for going on one year and I think I just discovered my new favorite treat yourself Haven. I ordered the classic burger with pepper jack and special sauce and it was the BEST burger I've had since my carnivorous five guys days. I'm not kidding, it was epic! The meaty patty reminded me of a Boca burger except less artificial and tastier. But the star of the show wasn't the patty, it was the special sauce. OMG!! That special sauce is truly special. Remember that movie Good Burger? Remember their special sauce and how much you always wanted to try it? I think this may be the closest we ever get to it. So, to sum it all up my burger was fantastic. The patty was tasty, the bun was good, all the usual burger fixings were fresh, tasty and pretty to look at, the sauce was epic and my oven baked fries were crunchy and yummy. You get two thumbs up from this gal.\n\nP.s. the service was excellent. The woman who took my order was kind and quite cheerful. Midway through my meal a staff member came through and asked everyone if everything was to their liking. My mouth was full so I could only contribute two secret sauce covered thumbs up. \n\nI'll be back.", "author": "Yomaira H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-02-09", "description": "Okay update to my review it's still a solid 4 if you know what to get my mushroom quinoa burger which was their signature burger with vegan pepper jack was so flavorful and just filling and delicious. \n\nThe blue cheese burger was good too but I preferred mushroom one more. They did had beyond meat burger prepared in a regular beef burger style. But I opted for the signature burger!!\nThe fries weren't good they weren't cooked throughout but I think it's coz they weren't fried!! \n\nBut the strawberry milkshake with coconut milk was so deliciously dreamy and creamy and they gave the extra one on the side which was nice me and my boyfriend literally shared one milkshake and it was enough for both of us.  \n\nDefinitely slowly but surely it's becoming my go to place. A must check out for a healthier burger option. And if you want to try one thing try the signature burger with mushroom quinoa patty and thyme mayo!!", "author": "Saba N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-03", "description": "Great stop for a quick bite - and a healthy one too. Right above Whole Foods 365 on Flatbush Ave.\n\nI had a Cobb salad here to stay. Nice flavors and ingredient combinations. They're known for their grass fed burgers. \n\nThey have a bar so you can grab a beer - major draft selection.", "author": "Mary A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-03-17", "description": "Heads up: its inside whole foods but on a different 'food court level'.\n\nCame here for the vegan burgers with my girlfriend. We were Both pleasantly surprised by the flavor of everything. They DO serve meat options but have a few, I think 5, vegan burger options (menu pictured below).\n\nWould definitely come back for a quick bite! Really\nFast. I would say 8 mins from when you place your\nOrder you get a super fresh burger.\n\nOh, Free water!", "author": "James M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-03-13", "description": "Next level burger is located inside Whole Foods 365, under the Ashland place building on the first floor. It's located conveniently in a food court-like area so it seems to be a great post grocery-shopping hangout spot. I came here for lunch yesterday, and there were plenty of seats inside. As a plant-based burger joint, it was nice to see how they have \"meaty\" burgers (soy) and veggies burgers (quinoa/mushroom/bean based) for those who like the flavor of meat and for those who actually want a complete veggie burger. I got the classic meaty burger and mushroom cheese fries (was going to get tots, but they heard the order wrong o well). \n\nThe burgers are served on sprouted grain bun by default, but gluten free buns are available too. It's hard to believe all of these are plant-based when it came as everything was extremely filling and I had to take the fries to go. The mushroom cheese fries had a hint of truffle flavor, and the fries are seasoned nicely with a house spice instead of\nPlain salt. Coming with a friend next time to try the milkshakes and hot dogs...", "author": "Cathy Z."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-02-08", "description": "The review is vegetarians and vegans. Fast casual all plant based restaurant with burger, hot dog, shakes, and fries on the menu. Great that everything is vegan and glad they had fake meat and veggie options (black bean, mushroom quinoa). I avoid fake meat so I liked that the menu broke them apart. Affordable and fast service with beers and kombucha on tap! Would have been nice if they had more unique veggie non fake meat flavors and options!", "author": "Sind P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-23", "description": "I'm quickly becoming obsessed with this place.\nDelicious vegetarian and vegan burgers that are fresh and NOT overly processed with fillers ... blech. Fries, vegan shakes...and options and variations on pretty much everything including GF. I'm so glad I found next level.", "author": "Allana D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-22", "description": "I love love love this place. Been here a couple of times because it's few blocks from my school and enjoyed everything I've tried so far. I tried couple of the burgers and made it my personal mission to try all of them. The animal is by far my favorite burger, but make sure to get it when you're starving because that burger is huge.\n\nWill probably come back soon just to have that banana shake again.", "author": "Estrella E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-05-09", "description": "Every time I come to this place I always order to the beyond burger. They cook it to perfection all the time - I just wish they could put more of the special sauce on my burger. Sometimes it just too dry and not savory enough.", "author": "Raiesa F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-31", "description": "Solid vegan burger option. I like that they have various types of patties and \"cheeses.\" Had the sausage and bacon, which was satisfying.\n\nAlso had the chili cheese fries. There was a bit too much topping in ratio to the fries. The cheese also had a weird processed taste unlike, the cheese on the burger which was quite tasty. \n\nStaff was friendly. Place was relatively clean. I'd go back if I were in the area.", "author": "Adri P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-19", "description": "I appreciate a place that offers vegan alternatives to America's beloved burger. This place can also make pretty much everything gluten free, so that's a huge plus too.\n\nI got the SoCal burger that comes with a quinoa and chia see patty, lettuce, onion, tomato, tempeh bacon, avocado, and special sauce. It was pleasantly tasty! The gluten free bun was soft and also quite enjoyable. The burger part had a meaty texture and was very thick.\n\nIt hit the spot and definitely satisfied my burger craving. For $11.50, it's not the cheapest, but if you're craving a burger and are vegan and gluten free, I definitely recommend this place.", "author": "Alyssa W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-12-30", "description": "Special sauce is very flavorful, I think the ketchup is house made. The burgers are small, but filling if you get a regular-sized side. Love that you have the option of baked or fried tots. Downside is the baked tots were heavily salted. It would be great if salt was a choice. Only one burger on the menu did not have soy/tempeh. \nThey supposedly bus their own tables, but there was no sign. Maybe they can let the customers know that while ordering?\nBurger fell apart, even with the stick. Maybe they can make sure the avocado slices are spread across burger so they don't fall out in a clump. \nClean space\nLocated inside of whole foods 365\nPlus, they take LevelUp \n\nAll in all, tasty food. Soy lovers paradi", "author": "Shanice W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-06", "description": "Soooooo wish this place delivered to me but I love their burgers!! I come here after work every now​ and then to get some dinner and it never disappoints​ Hope they open up more of these. And their staff....woo man, they got some good looking men working there lol", "author": "Jazmyne D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-07", "description": "Come here because you're vegetarian/vegan and/or maybe care about your carbon footprint... but not because you want a healthy meal.\n\nI guess that's the problem with meat substitutes - you gotta dress em up real pretty to make up for the lack of umami.\n\nEverything on their menu lists nutritional stats, including protein content, which is super useful.\n\nI went with the Special Sauce burger with Swiss-style cheese (it's vegan cheese). I was pleasantly surprised with how well it held up (more structured than say, the Impossible Burger). Texture was kinda lacking though, and visually, it looked like a cardboard puck. But like I said, dress up anything with enough \"special sauce\" and it'll be passable.\n\nWe also got some tots and bleu BBQ fries. You can opt to get them baked instead of fried, but then, why even live?\n\nTots were nice and crispy, but nothing out of the ordinary, and the faux cheddar on the fries was surprisingly good.\n\nThey also have a surprisingly good local beer selection (things like Five Boroughs and Wartega). Oh, and of course, kombucha on tap cuz it's the Brooklyn.\n\nThere's seating inside (stools only) as well as some half booths outside the storefront. They'll bring you your food and clear your tables, which is nice.", "author": "Kenny C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-07", "description": "I'm a meat-eater who loves a good veggie burger and the signature burger (mushroom + quinoa) is exactly how I like them. Bonus? The cheese and mayo taste real. Ready in 10 minutes. Five stars on this dish.", "author": "Natanya M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-29", "description": "I'm going to keep this simple - I've eaten at Next Level Burger several times, and each time the food in great. But honestly, not as good as the west coast spots of the same chain. The burgers are all good, especially the ones with vegan bacon, but I have noticed that they're *wetter* or more oily than I'd like a burger to be. Hot off the grill is great, but it seeps into the bun and I usually end up feeling weird as I'm rushing to finish it so the bread stays intact. \n\nThe milkshakes here are some of the best vegan milkshakes I've had in my life. Honestly and truly, they beat out Champs and all the other vegan spots by a long shot. The one downside to Next level is the pricing, its a bit expensive for a semi-shared dining area with Whole Foods and a few other food spots and the service is always meh, never excellent. I'll be a fan as long as the food stays consistent.", "author": "Morgen B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-12", "description": "100% recommend the classic burger, fries and coconut based peanut butter shake. \n\nIt was a little on the pricey side, but very good quality, tasty and filling. The fries were perfectly cooked, lightly seasoned and perfectly accompanied with a chunky tomato sauce. As far as plant based food goes, the classic burger is up there with the best, if only it lasted a little longer - perhaps I should have considered eating slowly. To top off a great meal, I had a coconut based peanut butter shake, the guy serving even gave me the shake in the making tin, what a great guy. \n\nTo conclude, if you appreciate great food, awesome and efficient service, definitely give Next Level Burger a try!", "author": "Mike B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-29", "description": "Don't rush to try it. While everything was good, nothing was uniquely tasty. I tried the Quinoa burger and the quinoa black chia patty was pretty plain. The swiss cheese was simply a barely melted slice of Daiya. I thought the burger was supposed to have tempeh bacon but I didn't get any. The bun is soft and is on the sweeter side. I ordered a side of tater tots, which had the perfect amount of salt. However, I realized later that the cashier didn't ask me whether I wanted them baked or fried. \n\nMore than anything else, I was excited to try their vegan shakes. I got coconut as the base because I try to stay away from soy. This was a mistake, though, because coconut took over the entire thing. Instead of a thick chocolate shake I expected from the Brownie Explosion, it was more a coconut shake with a little bit of chocolate pieces. I'll probably return to try a different shake but I'm not in any hurry. I like that this place is nearby but I wish they improve.", "author": "Kristine A."}], "servesCuisine": "Burgers", "priceRange": "$11-30", "name": "Next Level Burger", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "292 Ashland Pl", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/XOYtaV_PP_1WL1uvo6j_WA/ls.jpg", "@type": "Restaurant", "telephone": "+13473842277"}