{"aggregateRating": {"reviewCount": 139, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-07-24", "description": "Milkshakes were decent. Fries and tater Tots were also okay. But the burgers was super mediocre and actually a waste of money. Their selling beyond meat burgers that you can just go inside whole foods buy it and make it in your home. The Beyond Meat patties aren't even that great to be honest. Not trying to take anything away from this establishment but when i spend almost $100 on takeout and i get what you guys had to offer its only right i give my honest opinion. Switch to the impossible burger and your business will excel. Beyond meat patties aren't the way to go sorry.", "author": "Nic P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-06", "description": "The burgers here were fine, but didn't blow my socks off. I wanted to be able to say \"man whoa eat a burger here and you'll never think about meat again\" but there just wasn't a ton of flavor sadly enough. \n\nI do love the concept though and that you can order anything on the menu without worrying if it'll fit dietary needs- they've got a range of salads and burgers and milkshakes to try so perhaps I didn't choose the right thing. \n\nI found the burger to fall apart quickly and end up as a fairly sloppy mess on my tray. The \"bacon\" on my boyfriend's salad was prob the stand out winner", "author": "Elliott W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-09", "description": "My experience was superb! Transformation as a vegan on a rise with life changes. Next level is delicious", "author": "Mari R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-24", "description": "What more could you ask for? This place is 100% meat free..and it's so good! Sweet potato fries and tater tots are so good! Please come - the staff members are so nice!", "author": "Jaycob D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-19", "description": "I am not a vegan or vegetarian... but I found this meal enjoyable. I was dragged here by a friend of mine who is a vegetarian. The food was good and it really looked and tasted like what it was copying. I can't say that I would eat here often because I rather just eat beef, and bacon- but I'm glad I gave it a shot. The sweet potato fries were good as well.", "author": "Kia A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-29", "description": "This vegan spot is by far the best vegan spot I've visited. Sheretha aka Riri and Lauren were so professional and were very nice to us from the moment we walked in the door to the moment we left. They made sure to make us feel comfortable and welcomed as it was our first time visiting their restaurant. They were very patient with both my cousin and I and explained each item on their menu. I am beyond satisfied with my experience st this amazing restaurant. The food is AMAZING! Let me say it again, AMAZING! I live on Long Island but trust me I will be making the trip out to Brooklyn quite often. I found my new favorite vegan spot! Super excited! :) wish they can deliver to me.", "author": "Ruth S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-04", "description": "Food was really delicious. I got the most basic burger, I believe it was called the all American or something. Next time I come I'll get more fixings. My only gripe is the portion size. Everything is pretty small, save the drink size. I mean I was full regardless but I did pay $16 for my meal and it wasn't much of a looker. It's also a small restaurant located INSIDE of Whole Foods but I didn't mind. Can't say too much else though, I'll probably be back because I really enjoyed my burger and the service was great :)", "author": "Shawnee E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-09", "description": "*It's in the Whole Foods building FYI! I walked around for 10 min trying to find it.\n\nI had the Brooklyn Burger and the chili cheese fries. Both amazing. I was skeptical about the cheese on the fries because there was so much and it's hard to find a really good vegan cheese. The cheddar style cheese on the fries was honestly the ONLY vegan cheese I've ever had that tasted 100% like cow cheese. Amazing. I don't know how they did it, but they nailed it.\n\nExtra points for really nice, friendly staff.", "author": "Zan K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-02-24", "description": "If at first you don't succeed, try, try again.\n\nYou see, the first time I attempted to eat here, it was around 12:30 on a Saturday.  Hubby and I had just finished shopping at WF 365 downstairs and we were loaded down with groceries.  This place was a hot, stuffy mob scene, with no seating to be found anywhere.  I'm barely willing to subject myself to something like this when it involves food I've really been pining for.  But a Vegan Burger?  Um, no thanks.  We had much better luck the following week when we stopped in at around 11, before doing our grocery shopping:\n\nSo-Cal Burger, aka Quinoa \u0026 Chia Seed Patty with 'Special Sauce,' Tempeh Bacon \u0026 Avocado:  In my heart, I really wanted one of the beef 'n cheese-mimicking creations, but hubby pretty much convinced me that eating faux food would be akin to pledging my allegiance to Satan, or something similarly evil.  Yeah, yeah.  How was the damn Burger already?  Honestly, I've had better. The 'Organic Whole Wheat Bun' tasted way too healthy (read: dry). The bland Quinoa \u0026 Chia Seed Patty wasn't any tastier.  The one bright spot was the Tempeh Bacon, which actually tasted vaguely meaty and had a nice crisp to it.  As for the 'Special Sauce,' yo? To me that is the magical stuff of my Big Mac loving days.  It's supposed to make everything taste better.  Not so much here.\n\nKale Salad:  Hubby ordered this and insisted that he really liked it. \"All the ingredients are incorporated throughout the Salad, rather than just piled on top, with no good stuff left as you keep eating,' he explained.  But I found its lemon dressing to be 'blah,' and there just wasn't enough of it. Am also not the biggest fan of using curly, ornamental kale for Salad and far prefer the flat-leaf dinosaur / lacinato variety for that purpose.  Yes, I'm a kale snob.  Only in Brooklyn.\n\nI'm no vegan, but am very open to eating that way. In fact, am always a bit awestruck when I find a vegan restaurant that nails it because I know they've got to try 10x as hard as a spot that caters to omnivores to create crave worthy, aka umami-fied food.  I wasn't even remotely awestruck here.\n\nBottom line:  The location of this place truly is genius.  If it were a stand alone eatery in a random part of BK, I doubt I'd ever return.  But since I'm currently a wee bit infatuated with WF 365, am sure I'll come back to give it another shot either pre or post grocery shopping.", "author": "Yael D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-16", "description": "Next Level Burger has been featured on several blogs / news articles / tastebuds with raving reviews across the board. Newly added to Brooklyn's already-exorbitant list of amazing vegan food at affordable prices, Next Level Burger really takes burgers to the \"next level\" with unique 100% plant-based flavor combinations specifically cultivated to not only copy your favorite big boy / girl burger but improve it with organic and thoughtful ingredients. \nSituated inside at the front door of the new Whole Foods 365 on Flatbush by Atlantic Center, Next Level Burger is in a perfect spot to satiate and obliterate any feelings of hunger or cravings you may have; whether you're a hearty vegan, vegetarian or meat-eater the burgers and sides here are sure to satisfy you. \nWhere the *real story* is and honestly what really takes this place to ANOTHER level (if you're counting, that's two-levels higher than your other burger joint that serves antiquated and unhealthy animal based \"food\") is the amazing beer on tap selection ranging from Racer 5 IPA (one of the best and brightest from California, where the best IPA's are made IMO), Harlem Blue, hard ginger beer, hard kombucha, and just all out going hard plus several more drafts so you can get your burger and beer with the added benefits of 1) not feeling overwhelmed or bloated afterward, 2) no potential feelings of guilt for paying for a dead animal and 3) eating all organic, environmentally-safe foods made to order (and if you get it take away then it comes in biodegradable container with bio-flatware.) \n\nTLDR:\nAMAZING vegan burgers with wide assortment of cheeses and sides\nDelicious beers on tap\nAffordable (~8-9$ for a large burger or 15$ if you're MEGA hungry for \"The Animal\" and think you can handle it\nInside Whole Foods so you can go downstairs and grocery shop before or after\nEnvironmentally friendly\nJust go, bruh", "author": "Michael W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-29", "description": "Back in my days I had to search high and low for vegetarian places to eat. 20-30 years later this place makes up for the wait of good vegan places.", "author": "P J."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-02-15", "description": "Warning you now. This is a very long review, but worth it if you have celiacs, or have a gluten intolerance.  \n\nI'm conflicted. One on hand, I've literally never had a \"good\" vegan burger until tonight. On the other, something went awry in the food prep area causing my having to rush my celiac girlfriend home once her body started to break down. We'll start with the food. \n\nYou. Must. Get. The. Brownie. Explosion. Shake. With. Coconut. Ice. Cream. Intensely cold and rich and thick, yet light because there's no dairy. Reasonably priced (for Brooklyn) at $5-6, they even give you the aluminum...shake thing to finish off the shake that couldn't fit into the glass! \n\nI was feeling extra confident and hungry (fat. I was feeling fat), so I ordered the aforementioned shake and the All-American burger and Bleu BBQ burger. \nAs per their website, the AA = Savory Meaty Patty topped with Smokey Tempeh Bacon, Cheddar or Swiss Style Cheese and Egg-Free Mayo. \n\nWho knew vegan cheese could be melty and good? The patty was savory, but like every other vegan anything I've had, was mushy with no discernible texture. The tempeh bacon (house-made) really tasted House-made, but didn't really provide a difference in texture. I can't say I love vegan mayo, but as a whole, it was a satisfying burger for someone who is neither vegetarian nor vegan.\n\nThe Bleu BBQ = House-made Umami Mushroom and Quinoa Patty topped with Smokey Tempeh Bacon, Creamy Blue Cheese and BBQ Sauce.\n\nI did not particularly enjoy this one. Now, it could've been because I was already full from one burger + shake, but the quinoa and mushroom patty just broke apart as I was handling the burger, and it was surprisingly dry. The \"bleu cheese\" was eerily similar to the real thing, but the BBQ sauce was overpowering. I'd skip this one. \n\nSo NLB is upfront with their food-handling, and they have told me on instagram (letmesq1thing) that though they have dedicated GF prep areas, there is always a risk of cross-contamination. And that's just standard across the board if you go to a restaurant that isn't 100% GF. That's fine. Something happened tonight, though. \n\nMy partner ordered the quinoa burger: House-made Quinoa and Black Chia Seed Patty topped with Smokey Tempeh Bacon, Cheddar or Swiss Style Cheese, Ketchup and Egg-Free Mayo on a GF bun with guac (she got about a teaspoon's worth, so I suggest you save your money) with a side of tots and a chocolate shake. She asked the cashier about the shakes since \"brownie explosion\" and \"cookies and cream\" don't really scream GF, and she was informed that every single shake was GF. She was also informed that the house made tempeh bacon and every other ingredient of her meal was GF.\n\nWe don't know what exactly did it, but the gluten hit her like a truck, and we made it down the escalator to the actual market floor when she couldn't fight it anymore and succumbed to the pain, telling me we had to go home. She is now lying on the couch, having taken anti-inflammatories to mitigate the pain. \n\nCross-contamination is always a risk, and whenever she gets it, she gets minor joint and muscle pain with a minor headache. This wasn't cross-contamination--this was full on gluten. \n\nSince we don't know exactly what element of her meal caused it, we unfortunately won't be able to go back. And that's a shame because of that brownie explosion. \n\nRegardless if you're vegan or not, I recommend this NLB AS LONG AS YOU DO NOT HAVE CELIACS OR ARE VERY VERY VERY SUSCEPTIBLE TO GLUTEN (aka you probably have celiacs).", "author": "Hooney H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-26", "description": "I was happy to see this plant based burger joint when exiting Whole Foods today and was excited to try some things. Unfortunately I ended up wasting 25+ minutes in line with about 4/5 other customers without a single staff member working the register. There was no one to greet us or to take our order. Anyone would assume this place was closed except for the fact a few employees would peer out from the kitchen window and there were a few customers sitting and waiting for their orders. I never saw one of these people served the entire time I waited. How long does it take to make a burger and fries?  Finally I saw one employee make her way to a table to tell a customer that his gluten free burger could not be made because the GF grill wasn't working. I don't understand why she wouldn't tell he people in line this so they wouldn't be wasting their time either.\n\nI was really wanting to like this place but I finally left. I realized if the staff doesn't care about their customers enough to greet them or take their orders they probably don't care enough to make a good product.  This was a terrible first impression. I recommend that you hire a GM or better employees. Unacceptable!", "author": "Chris D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-03", "description": "Solid vegan burger option! Lots of homemade burger patties and sauces (all vegan!). Love that they list the calories and protein on their menu.", "author": "Stacey F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-02-13", "description": "I only tried one burger here and it wasn't bad at all, but as some other reviews mentioned nothing about it stood out. The patty is meh. The fixings are what gives the burgers flavor. I am always hesitant to eat processed plant based foods; I much prefer when it's minimal or not at all processed. A lot of things are soy based but there are alternatives available. If you're vegan it definitely is a good option if you're in the neighborhood as there\nare few plant based options around.", "author": "Naomi T."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-17", "description": "Came here looking forward to it. Heard great things about the food, liked the menu. Even heard the staff was friendly/courteous. I was disappointed on all fronts.\n\nPerson taking me and my girlfriend's order was initially great: friendly/complimentary. A good vibe. At the end of us paying for our order, he gave us our flag, and we asked for some cups so that we could pour ourselves some water from the water spout they have on the counter for customers. He said that he'd give us cups when our order was brought out. That seemed kind of wack, since all he had to do was grab two paper cups from a stack of them that was only a couple steps away from him and hand them to us, and there wasn't anyone on line behind us or anything. But, whatever, not a big deal.\n\nWe waited at a table right in front of where the food comes out, our flag prominently displayed. After about 10 min a server passed by with an order that seemed to resemble ours, but we weren't sure because we'd never ordered the items before. She passed us a few times, never once looking in our direction, so we assumed it wasn't for us. Remember: we were at a table directly in front of where the food comes out. Hard to miss us. Ultimately she brought the order to another table, talked to that table, and then brought the order back behind the counter, once again walking right by us, never once looking at us. I then watched as they proceeded to pack the entire order up into to-go containers, put the containers in a bag, and then sit the bag on the back counter by where the food comes out.\n\nWe decided that must have been a take-out order or something, probably not our food, just something that looked familiar. 10 min passed. Then another 10 min. By that point we had watched several people that came there well after us get their food. And also had time to watch an employee wipe a messy gooey table off with a rag, then proceed to use that now dirty rag to wipe down two seats. Instant cheesy seat for someone to sit down on.\n\nAfter a long time, we looked at our receipt and noticed that the table number on it didn't match the red table number that was given to us to put on our table --the whole way that they're able to figure out who to bring the orders to. We deduced that this must be why the person trying to deliver our food didn't ask us if it was ours, but then why did they ask the other tables also with different numbers if it was theirs? So we explained to the cashier that maybe he gave us the wrong number, and that maybe the food they couldn't find the table for was ours. \n\nHe confirmed that this was what happened, apologized, and handed us the same long cold bag of food. We'd never mentioned take out, had even said eating in multiple times, but he insisted we'd asked for it bagged. He then said that our order might not have sweet potato fries like we asked, might have regular fries underneath the toppings. Lovely. Wouldn't open the container to check for us.\n\nWe left the area to sit down at one of the other tables in the 365 area. We did so, opened up our food, and saw that we had been no dressing for our cobb salad. So we then had to go back and get dressing for that.\n\nBy the time we finally ate, the meal was expectedly soggy and lukewarm and lackluster. But I could tell the food wouldn't have been much better even if it was hot. The chili cheese hot dog was covered with cheese, and barely any chili. The dog was the same kind of field roast hotdog you can buy downstairs and that I have at home, which are good dogs, but if I'm eating out somewhere I expect more than store-bought. The bun too was 365. Again, something I could make at home: except if I did so at home, I'd use more chili than just a spoonful, and less cheese than a glassful. Oh, also, there were thin shavings of red onion on the side of the hot dog, probably a teaspoonful. Maybe they were supposed to go on top? They barely tasted like onion. I've never had red onion so barely taste like anything.\n\nThe cobb salad was extremely watery and bland. It tasted like it had been rained on, washing all the flavor away. And the avocado in it wasn't ripe at all. Very hard and actually difficult to chew. I've never had an avocado difficult to chew in my life. They must special-order difficult to chew avocados or something.\n\nThe bleu BBQ fries (sweet potato--they got it right, unbeknownst to the guy) were smothered in the same cheddar cheese that was on the hot dog. No creamy bleu-- or if there was, it tasted exactly like the cheddar and was mixed in like crazy. There was also no smokey tempeh bacon on it, and i tasted no BBQ sauce. It was basically just soggy, mushy sweet potato fries covered in gluey orange goop. If you like your fries crispy, you've come to the wrong place. I could barely tell if they were even fried. (We asked for them fried.)\n\nWe barely finished our food, threw what was left out, and both agreed we'd never come here again. $30+ down the drain.", "author": "Cody C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-18", "description": "Was so excited to try these guys out - as a big fan of vegan comfort food - and already can't wait to go back and try more stuff.\n\nThe Next Level Dog is ridiculously good - the diced cucumbers and black sesame seeds are unexpectedly perfect texture and flavor additions - and they toast the bun beautifully. Also tried some Special Tots (with grilled onions, cheese and special sauce) and looove their cheese recipe. \n\nAs others have mentioned, they have a huge beer selection + a fresh ginger lemonade that's so satisfying.\n\nThanks for going bicoastal, NLB!", "author": "Amanda D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-08", "description": "I used to love this place... but they might have changed their staff or something... let me explain.\n\nThe concept is great vegan + GF option burgers. \n\nWhat happened is the following. They gave us someone else's order. We didn't notice before we got home (15 min away) we went back, asked for our burgers ( 2 GF my fiancé is allergic to gluten) . When we arrived the cashier asked the guy in the back to remake our burger. He says \" no I don't, there they are\" He wanted us to get the cold burgers. I was not ok with it, I insisted to get new burgers. He was not happy. They finally made them again, give them to the girl in the front. She checked \"the avocados are missing \" She send them back. They apparently added the avocados and sent them in the front again. There we go, finally! Dinner! Wait a second, let's check this time... just to be careful... we checked... my fiancé's burger is still missing the avocado... We went back to the cashier and asked for the missing avocado... OK ... How is it possible they didn't do it on purpose ? ... I have no idea ... Anyway ... Finally got back home, take our first bite My fiancé stopped almost right away... WRONG PADDY ... they put the one with gluten in it... he is allergic and asked specifically for the GF burger with GF patty. A nightmare this attempt for dinner !!! I am SO disappointed! Please change your staff for decent people !!! This can be really dangerous ! You need to be responsible!", "author": "Stanek A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-12-16", "description": "There are lots of choices at this spot and all of it is pretty healthy, especially if you opt for baked fries or tater tots, to accompany your burger or salad. I love having caloric values listed for each menu item--because I'm always interested in learning how to eat what I want in more healthful ways. I chose the \"spicy\" black bean burger which comes with a horseradish sauce and a small order of baked tots. They have gluten-free bread, as well as regular bun options, but I asked for my burger served without either. My order was taken and facilitated by Tamar who is super helpful and has great energy--in fact, he's the one that recommended I get tots and he was right! They're perfect: crunchy, salty, potatoey, comfort food nubbins that did a lot to quell the anxiety I had as my laptop and phone got repaired at the Apple Store. My burger might have been a little on the cold side and the tomatoes that accompanied it, a bit squishy--it's winter and tomatoes are not in season so nbd--but it was good and I'd definitely eat here again, despite it being a little on the speedy side.", "author": "Pritha R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-27", "description": "I was hungry and was looking for a good veg place. Found this one and it was close to Atlantic terminal so that was good for me. They have a lot of selections of burgers, hotdogs, milkshakes, and etc. I got the special sauce burger and baked fries. The lady at the counter who toiled my order was awesome! She was very nice and sweet. When I got my food i found the burger good but wasn't super impressed. I feel like I didn't taste much of the special sauce but overall I was happy with my order, especially since I hadn't had a burger for along time. Staffs were great but there was one lady who seems to have hurt her hand and doesn't look well while she was working. I do hope she is okay but overall, I had a good experience.", "author": "Alicia Z."}], "servesCuisine": "Burgers", "priceRange": "$11-30", "name": "Next Level Burger", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "292 Ashland Pl", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/XOYtaV_PP_1WL1uvo6j_WA/ls.jpg", "@type": "Restaurant", "telephone": "+13473842277"}