{"aggregateRating": {"reviewCount": 139, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-03-13", "description": "Disgusting. My first and last time here. I tried the signature burger and the secret sauce wasn't bad if I had to eat this once again, I would try another burger. The cheese fries are horrible. Please change the type of cheese used on the fries as it's too heavy and stringy. The onions were cut too big. On top of that the presentation was horrible too. It's like they threw my food in the bowl and didn't bother to wipe down the overflow of cheese on the sides. Word of advice, plain crinkle fries is the way to go if going for baked fries. I can't speak on the rest of the menu as I didn't bother to purchase anything else but it definitely was a waste of money for least than subpar food.", "author": "Jo M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-11-16", "description": "The orders to pick up through the app, are usually done ahead of schedule... some items may eventually get cold or soggy, from my experiences. Items are sometimes  not fulfilled as the item description should be I've had to go back,only to have the employee not believe me... And i was correct. Also I've gotten fries and tater tots burnt and double fried or baked and fried.", "author": "Janet C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-14", "description": "Only next level was their burgers coming up my esophagus. My closest comparison to the flavor was sucking on circulated coins covered in sawdust.", "author": "Joseph S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-21", "description": "I love NLB! The burgers are sooo  good and honestly their health claim is legit.... if you dont eat as many fries as i do.", "author": "Rebecca M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-30", "description": "Finally an amazing all vegan burger and hot dog restaurant! The renovated Fort Green shopping and residential area now offers hundreds of options to dine and enjoy. The Next Level Burger caters to vegans and all clients who feel curiosity about alternative life options. It doesn't disappoint. The staff will help you select and make sure what you order is what you expect. Their burgers, hot dogs and sandwiches can be customized. Their vegan shakes are out of this world! Please come and give them a chance, you will become a regular when you shop at Whole Foods or visit the nearby Apple Store. 5 stars! Keep up the good work!", "author": "Tony S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-25", "description": "Friendly staff! Facilities are brand new and throughly enjoyed my meal, quick and easy. Everything is plant-based so if you're looking for  great vegan eats this is definitely a place to try!", "author": "Candice M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-08", "description": "I ordered one of the gluten free burgers with a gluten free bun because I have a gluten allergy. First mistake: They gave us someone else's order. We walked back from home to return it and the guys in the back wanted to give us the now stale burgers rather than remake them. Second mistake: My new burger was missing the avocado. This despite the fact that I heard the cashier specifically ask the guy in the back to add it after she checked the burger. Final mistake: When I got back home to eat I took a bite and they gave me the meaty patty instead of the quinoa. The meaty patty is made with gluten. So they fed me something I'm allergic to at a supposedly allergy friendly place. The guys in the back were clearly upset that we insisted they remake the order. I wouldn't be surprised if they did this on purpose. Could not recommend less. The guys working in the back should be fired.", "author": "Adrian G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-21", "description": "Lately, I've been searching out more and more for vegan comfort food. I have tried basically every casual, affordable vegan place in NYC, and I keep going to the ones I liked the most. I can happily say that Next Level Burger is now one of those places. \n\nThey serve the BEST vegan burgers I've ever tasted. I wouldn't say it could completely fool you into thinking it's not vegan-- it's delicious in its own way. I love how you can get a burger with a side for the same price as you would just getting only a burger at other vegan places. My favorite side to get is the tator tots. (They taste exactly like the ones from Champs). A huge plus is also how since it's run like a fast food joint, you don't have to tip your server or wait to be seated before you go. I can name very few vegan places that aren't like this, which is a reason why I don't eat out as much as I'd like to. \n\nOne compliant I will say is that I would like to see other types of drinks added to the menu. I do like their shakes, but I'm not really a sweets person, so usually when I want to drink, I want something refreshing.", "author": "Nicole G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-08", "description": "Guys..I've been bamboozled. I love meat. I like steak, chicken, beef..you name it -- chances are I'll probably eat it. So you can imagine how I was feeling when my homegirl dragged me to Next Level Burger trying to convince me the Impossible Burger was a vibe. We rolled up to the counter close to closing time and the gentleman behind the register was hella cool and amused by my nay-saying attitude. We ordered loaded fries, the impossible burger and a cookies and cream shake. Disgusted by the idea that someone would think a faux hamburger could top a real one, I walked away certain I'd be disappointed. Once the food arrived and I took a bite of the burger I was FLOORED. Nah. Like, someone was messing with me. There was NO way this burger was plant based and not ground beef. I took another bite, just to see if it was the real deal...and AGAIN -- absolutely floored that this bad boy was so delish! I shamefully devoured my burger and indulged in the cheese fries. Yes, vegan cheese -- issa vibe. The shake was also delicious and the perfect way to top off my meal. Now, let's not get ahead of ourselves, I still will enjoy a good, meaty burger, but I'm here for Next Level Burger and will definitely add it to my foodie rotation.", "author": "Lauren P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-14", "description": "The venue is clean, the staff is really nice, the concept of an all vegan burger place is amazing but the burgers weren't great and on the pricey side. I would certainly go back and try something else but the animal and all american weren't great. The cheese was surprisingly good but I'd recommend it on something else. Worth a shot and worth supporting!", "author": "Ann R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-04", "description": "Food is good. I had their signature burger (delicious), sweet potato fries (good till they get cold, then they're meh), and their cookies and creme shake (my favorite part of the meal, so good). Will i be back? Definitely.", "author": "Nikki L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-07", "description": "My 1st time eating at a vegan eatery and I ordered the special sauce burger and it was delicious! I would have never known it wasn't a beef burger unless told otherwise. Very tasty, as well as the fries! All plant based and guilt free. Highly recommended!", "author": "Charisse F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-31", "description": "Amazing vegetarian/vegan burgers. They are absolutely delicious. Definitely one of my favorite burger spots in the city. I highly recommend the Mexicali burger.", "author": "Arshie P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-10", "description": "Great!!! Its nice to go out to eat at a \"fast food\" restaurant and not have to ask extra questions about the food being vegan. Also the staff is really nice and cool.", "author": "Sherneil J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-12", "description": "The food is delicious! The all-American comes dangerously close to tasting like an actual cheeseburger! It's a must try for vegetarians and meat eaters a like!", "author": "Jess B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-24", "description": "Usually when restaurants have names like \"Best,\" \"Ultimate,\" or \"Grand\" my friends and I sound the hype train alert for the fake news. Next Level Burger, however, is next level. The meaty patty, shakes and tater tots (particularly the baked ones) are very good.  I don't feel as heavy after eating a meal here vs. a regular burger place. I recommend trying it out.", "author": "One L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-10", "description": "Terrible burger, and to make things worse when I arrived the cashier seemed was very rude, despite my ordered being waiting on the countertop for a while. I put my order online and once I took it home, the \"burger\" was falling apart. Nasty flavours from margarine and the bread was just disgusting. Go to 67 burger or shake shack, it's just not worth it, iugh!", "author": "Carmen T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-26", "description": "I've been here several times and dealt with a dozen or so employees, every time no matter who is helping me they are so kind and friendly! I'm so happy this place is here in Ft Greene now, the food is amazing!!", "author": "Emily K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-11", "description": "Next Level Burger is so amazing! I highly recommend it. They've been open less than 2 weeks and I've already been 4 times! The burgers, hot dogs and tots are all delicious! I do tend to modify burgers, and they let me do so hassle free! This is extremely rare, especially for a vegan restaurant. They have so many options as well, and even gluten free options as well as different patty options. The shakes are also so great! And it's all at a reasonable price point for a good amount of food. Many vegan restaurants charge an exorbitant amount for minuscule portions-that is definitely not the case with Next Level Burger. On top of the food and pricing being so awesome, the service is impeccable! The staff is very friendly and amenable to special requests-even in a fast paced environment. You can see that the staff works very well together and that the business is a well oiled machine! And your food is prepared extremely fast! I've also ordered online to pickup an order and had a great experience doing that as well. Next Level Burger is a much needed addition to the neighborhood and has become my go-to spot!", "author": "K W."}], "servesCuisine": "Burgers", "priceRange": "$11-30", "name": "Next Level Burger", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "292 Ashland Pl", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/XOYtaV_PP_1WL1uvo6j_WA/ls.jpg", "@type": "Restaurant", "telephone": "+13473842277"}