{"aggregateRating": {"reviewCount": 139, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-21", "description": "Wow.. insanely good burgers and shakes. I'm not even vegan but try to eat more plant based. Now me and my family are hooked on this place. Staff is always friendly and on point too. The price is actually close to McDonalds so why not just keep it healthy. That brownie shake is something special. It's a shame it had to wait till the neighborhood changed to get here but I'm happy it's here anyway.  Whenever I'm close by or going to Whole Foods I gotta stop here", "author": "Prince R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-23", "description": "I'm not vegan or vegetarian but I wanted to try something different and this definitely hit the spot.  I got the signature and asked for it to not be \"medium or well done\" I know it's plants but I don't want to eat anything that's overcooked. This burger was great and the blueberry tea was great. I got the tea unsweetened and I was glad as I think that sugar would have killed the flavor.  I would highly recommend.", "author": "Kerri M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-13", "description": "Really great vegan \"fast food\" spot. I got the BLT sandwich with avocado and the Hot Dog for my daughter. The \"bacon\" on my sandwich was really flavorful with a great texture and my daughter's hot dog tasted just like the real thing which is great. I got the coffee milkshake for myself and the chocolate for my 5 year old- both really delicious. All in all it was a great dining experience and I will definitely return when in the area.", "author": "Erica A."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-07-13", "description": "I have been to NLB four time since it opened this year, and each of my wait-times were increasingly longer. I will not be going back anytime soon, unless they drastically improve their service. \n\nThe worst part is, I order only a soy/milkshake each time (which I love). Even when there is no line, I have waited between 25-30 minutes each time! \n\nTonight, I ordered my shake quickly and then both the cashier and person making shakes left the area to assist in the kitchen for over 15 minutes. When they came back, my order was forgotten. Finally, when I asked for my order, the wrong shake was made! \n\n\nNot worth my time", "author": "Jeremy C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-07", "description": "I loved how many different types of patties and the level of customization NLB offers. We ordered the Animal (sausage style patties) and the Brooklyn (mushroom quinoa) and were not disappointed. Also, how could you possibly go wrong with sweet potato fries or loaded tater tots?! Great friendly service as well. Gonna try their shakes next time.", "author": "Kim T."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-12-08", "description": "Disgusting and super slow. A cup fell on the floor and she picked it up and grabbed someone food after it. They are so unprofessional will never visit again.", "author": "Ash C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-25", "description": "A great non cheat, cheat day for those struggling to go vegan.  Please open one in Staten Island!", "author": "Urdley S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-10", "description": "Am an omnivore, but love all foods. Trying to eat more plant based meals for (mostly) health and environmental reasons. \n\nNext Level has bomb burgers. If I were vegan I would eat it everyday and probably be 400 lbs. The Special Sauce burger reminds me of In n Out in CA. The tater tots are also effing amazing. But the guy was like \"baked or fried?\" Um. Obviously fried! Their ketchup is also amazing.\n\nI want to go back and try the shakes. The root beer that they serve is the best root beer I've had in a long time.\n\nService was good. Servers seem happy/friendly. It's also in a super convenient location.\n\nAll in all a bomb spot if you're vegan/veg/just trying to be a naughty fatty.", "author": "Rob F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-08", "description": "Love love Next Level Burger!!! They are a fast food restaurant that cares about your health as much as possible.\nThere are so many patty options, GLUTEN FREE BUNS that taste good, and you can choose whether or not you want your fries baked or fried. \nSo many shake options too which are all gluten free!!!! Really appreciate the care.\nI got a burger (gf bun), small fries, and brownie shake. Loved every bite!!!", "author": "Melanie R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-03", "description": "This place is great.  Burgers are delicious and I'm a real sucker for the strawberry shake.  I've also tried the salads, they are tasty as well.  My son usually get the hot dog kids meal, but the bun always seems to fall apart.  Definitely my favorite spot for vegan junk food.", "author": "Angela N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-09", "description": "I am a vegan from south Flordia and this was the best burger that I have ever had!!! The staff are amazing and super friendly sharing the vegan love with some of the best vegan food I have come across in my travels. Highly recommend to vegan and non vegan foodies", "author": "Gabe G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-10", "description": "Finally an all vegan burger place that serves more than just bean burgers. I got the classic meaty patty and it was bursting with flavor. The lettuce, tomatoes, onions, and ketchup are great and not overdone. A bit pricey for the size but then again, it's NYC. I love that you can opt for the baked (instead of fried) fries if you want to be healthy and still get the \"burgers and fries\" experience. Will be visiting again!", "author": "Norbe D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-11", "description": "Badass veggie-stuffed grilled cheese. More than just burgers, despite the name. Very polite staff, quick service, and so delicious. If you love grilled cheese, do it. I had half and half for the cheeses.", "author": "Anthony S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-09-07", "description": "I've been coming here once in a while. It's a good option for when you don't want to eat abject trash but you're still craving something a little naughty, or something that resembles naughtiness. I'm not vegan or even vegetarian, but I enjoy the food here. The patties are juicy and flavorful, and the vegan cheese is surprisingly good, though my standards for vegan cheese is pretty low (there's some terrible cheese out there) so maybe that's not saying much. I think they could improve their nonGF buns, as what they use are now are too soft. I'm a sucker for real, good bread, and if you are too you won't like these. The chili is great, and I think there's quinoa in it so it makes me happy to have that extra protein and fiber. My only big gripe is the price. I think it's a bit overpriced for what it is; the burgers are more expensive than traditional meat burgers (~$10 for burger and no sides, I mean c'mon) and let's be real--what you're serving me is soy patties. I know it shouldn't be that expensive. That being said, I am comfortable coming here once in a while, specifically when I'm craving burgers but I still want to be kind of healthy.", "author": "Candice L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-06", "description": "I love these burgers \u0026 shakes. I'm happy to finally have some good quick food near work.", "author": "Kala B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-24", "description": "It hurts to give this place 3 stars. First of all, I want to say that the concept is AMAZING! The first Plant Based/Non GMO/ Organic Burger/ Shake joint!! That's just genius! It's really hard to find good vegan food, with a nice scenery, that's organic/non gmo! \n\nBeing a vegan chef myself I want to say that the burgers are actually delicious! So many good flavors! The vegan burgers taste very identical to \"real meat\"! I think any one would enjoy the food vegan or not! I personally love the Brooklyn burger \u0026 coconut milk cookies N cream shake.\n\nSo here's why I GIVE THIS PLACE 3 STARS! Even though I was so happy when I found out this place was going to open \u0026 I felt like the owners/founders were genius they definitely failed at hiring decent staff. Your staff are everything in this industry. I've been here over 5 times \u0026 the staff seem under trained \u0026 seem to be having too much fun at work. Fun work environments are essential but when it comes to standing by a companies mission \u0026 customer service there has to be some rules in place. Poor staff can kill your business!\n\n I see the potential in the place! Multiple locations world wide but I wish they hired more passionate staff. People who have interest in the vegan/organic lifestyle, passionate foodies, happy chefs \u0026 cooks! It will reflect on the service. The staff can never  answer if a certain burger include soy or gluten etc. Every staff member should know the menu in \u0026 out! Also, the staff have a hard time getting a lot of orders out at one time \u0026 getting the order correct! \n\nThe first time I ever came here the cashier \u0026 cook were arguing loud in front of a line of customers over my messed up order! Lol it was unprofessional. Also the manager guy is extremely rude every time I come. Every time I order bake fries here they come out either cold or under cooked. Today when I was served raw sweet potato fries the \"manager\" yelled with an attitude saying they are \"baked fries\". Not even apologizing that this is the second time it's leaving the kitchen because the first order was cold. I'm a chef. I know what baked fries are. They were oily \u0026 undercooked. Thankfully another manager came out \u0026 asked \"who served these\" \"who's on the fries?\" Knowing that it was UNACCEPTABLE.\n\nPS: Not all the staff is horrible it was actually A nice guy here today. His service was outstanding. He was attentive. He kept checking on us. Asking if everything was okay. He apologized about my fries being messed up 3 times. \n\nAnyway, I'm no pain in the ass or annoying customer who wants to complain about the little things . I know it's some assholes out there. I'm not one of them. I actually love the place. I just want the owners behind this to see this. They really should re-evaluate their team! I think this place could be the NEXT BIG THING with a strong team!\n\nCongrats on this amazing business venture! I wish Next Level Burger a lot of success! Hopefully on my next visit this place has a bomb ass team!!", "author": "Dont W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-05", "description": "The food here is phenomenal. The all American burger is my go to burger here it's 100% plant based which works out perfectly for me. Also excellent service, if your into small talk before eating. Other than that two thumbs up! Happy eating my fellow yelpers", "author": "Nigel S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-04", "description": "The food is a reasonable speed. And it taste amazing. This is one of the best vegan restaurant I've ever been to. There is not much to say but overall it is a nice restaurant.", "author": "Ethiopia H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-25", "description": "Objectively great burgers, vegan or not. The bleu bbq sweet potato fries and vanilla shake were delicious too!", "author": "Elina B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-04", "description": "Welcome to NYC NLB! I first tried them while out in Portland last summer and when I heard they opened a location here I had to check it out. I ordered the Brooklyn burger, tator tots with the special sauce, onions and cheese and a dark chocolate pb shake. The burger was pretty good, the buns they use are a little dry, but there was enough bbq sauce and cheese to counter it. The tator tots were my favorite!! Crispy on the outside, soft and flavorful, and with the cheese and special sauce, I probably could have just had that and been satisfied. I also enjoyed the shake, which I got with coconut soft serve. Overall, a great experience and I will be back to try some of the other menu items. Another thing to highlight is the service. I came on a Saturday afternoon and it was pretty packed. The space inside NLB is small with some counter tops and high tables, but you can also find tables in a food court like area behind some of the other vendors. They give you a number and you can go sit wherever and they will find you and bring you your food. This is a really nice touch!", "author": "Jackie B."}], "servesCuisine": "Burgers", "priceRange": "$11-30", "name": "Next Level Burger", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "292 Ashland Pl", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/XOYtaV_PP_1WL1uvo6j_WA/ls.jpg", "@type": "Restaurant", "telephone": "+13473842277"}