{"aggregateRating": {"reviewCount": 94, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-17", "description": "If I lived in the area I probably would come here all the time!\n\nThe staff are so friendly and I love the atmosphere of the place. The bathrooms are also very clean which is a huge plus for me. \n\nI came here a couple of times for lunch and I almost always ordered the Thai Iced Tea with every meal and sometimes doubled ordered lol. (It's my weakness)\n\nI believe I ordered a stir fry once which was very, very good. I love full flavor dishes!\n\nOn my next visits I ordered the Crispy Orange Chicken Chunks omg. I probably won't order another thing again besides that because it was too damn good. \n\nI love the sweet and saltiness of the dish. The orange sauce also goes well with the white rice and mixed veggies. \n\nDefinitely one of my favorite place to eat!", "author": "Shayna M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-05", "description": "It's Thai-M for Thaiiii! \n\nI'm surprised that this restaurant has such negative reviews. From the second I walked in I felt such great vibes. The server was so sweet and when you look at the menu it even has a line that says Smiles are Appreciated. Hehe. \n\nAtmosphere:\nThe walls are adorned with elephant statues and wooden planks that give you the feeling you are in a place of zen. Light music plays in the background and some of the throwback songs really made me smile \n\nFood:\nWhat you really wanna know. It was great! We got the spring rolls, Shrimp Pad Thai, and Chicken Fried Rice. The winner winner was that Pad Thai. It had such a perfectly balanced sauce that made you want more. Pro tip: ask for some chili sauce on the side. The rice and spring rolls were great too however the pad Thai was my fav. \n\nService: Our server (forgive me I forget her name) was so sweet. I have allergies to avocado and red onion and I always feel like a jerk having the servers have to check for me about the ingredients but she was so gracious. And filled our glasses so consistently. \n\nI wish more people would come through. We hardly saw many patrons come though we did notice a slew of delivery orders. So I supposed Pad Thai and Chill is the new thing. :).", "author": "Helen C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-05", "description": "Exceptional service and the most delicious pad Thai that I think I've ever had. Asked for some heat and got it. Really well done.\n\nSpring rolls were tasty, as were the shrimp skewers and dumplings that we started off our meal with. \n\nIf you read their story, they're a family operation and they treat it and their customers just that way. They care about your enjoyment of the meal and experience above all. I appreciate places like this that are focused developing and maintaining a local and devoted clientele. I'll be back.", "author": "Charles B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-27", "description": "This is my 2nd time coming back and it was worth the trip! I was craving Thai food so my boyfriend and I stopped in. It was a few guests but not crazy! Nice ambience, wooden furniture, cool air!  Great service and even better food... My boo loved it also....Thumbs up! Plus they're right across the street from my favorite dessert shop Mia's Bakery!", "author": "Shanna O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-19", "description": "This place does not get enough credit! This is my favorite Thai restaurant in the neighborhood. It is never crowded so you'll be able to get a table quickly. They have the typical Thai fare you see at other restaurants, but they also have other dishes from Northern Thailand.\n\nStarting with appetizers, I usually get the Thai toast (which is always delicious, although some people may find too oily), but this time around we ordered the crispy chive dumplings. These are truly crispy, but have a soft center. The flavor is on point; very similar to the chive dumplings at Ayada. \n\nI ordered for myself the braised pork cinnamon noodle soup (boat noodle). The pork easily melts in your mouth. The flavor is not overly powerful, but simply delicious. The noodles create a balance with the broth (cinnamon/vinegar). I'm always on the look out for boat noodles and I'm glad this restaurant has this dish on their menu! You also receive a Thai tea with this order for only $14! Not bad!\n\nI was able to have a taste of my boyfriend's entree, the panang chicken. The panang curry was delicious! My bf ordered it with medium spice. This dish also came with a Thai tea for $14! \n\nPeople say the portions are on the smaller end, but I do not agree. I think they give plenty of food with your order leaving you full. \n\nOverall, solid Thai food.", "author": "Kim D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-30", "description": "My go-to selection at any Thai restaurant is Rad Nar and Wanisa's take on the dish did not disappoint. \n\nSuper fresh gravy with carrots, two types of broccoli and topped with fried garlic, I'll be coming back for this again.", "author": "Matt H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-05", "description": "The Good.\n\nWanisa's pad thai is the most flavorful I've tried so far. It is the only Thai place in the area where I will not berate my wife for getting pad thai instead of any one of so many better options, and the only one where a side of peanut sauce is not necessary to make it palatable. \n\nThey have two tofu options: steamed and premium. If you insist on getting tofu, go with the latter. I just like that they call it premium when it's fried. Damn right it's premium, especially compared to steamed.\n\nThe OK.\n\nDrunken noodles. Not my favorite in the area, but still better than every pad thai ever...except maybe Wanisa's. I don't even know who I am any more. \n\nThe Bad.\n\nThe lunch special isn't as great a value as a few of their competitors. For delivery, it comes in a two-section plastic container (clearly a smaller portion of noodles), with one section reserved for your appetizer.\n\nThey make it seem as though you will have a choice when it comes to your appetizer, but they've only got spring rolls (they're OK). That's an appeTEASER, amirite?\n\nThe Ugly.\n\nMy gut continues to grow (and my willpower continues to not exist) to the point that smaller portions are actually desirable to me.", "author": "Peter D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-08", "description": "My two friends and I were just exploring the area and wanted to stop somewhere to get lunch and randomly chose this spot. Let me tell you... there lunch deal was amazing. The place had a nice presentation and the waitress was very helpful choosing what to order! I would recommend going here for lunch if you're able to for the lunch special. I had gotten the red curry and the spring rolls, which tasted great.", "author": "Peter T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-19", "description": "I stumbled upon this nice Thai restaurant on the restaurant row while traveling NYC and Brooklyn, from San Francisco.  \nVery good food with nice presentation and ambience.", "author": "Charles C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-02-04", "description": "Barely edible. I had the salmon. It was clearly a day or two old. It smelled terribly. The sauce was really thick. The string beans, carrots were visibly past their prime: wilted, freezer burnt. Cabbage was chewy and that's when I gave up. A mess. The rice was great! \n\nI wanted to like and frequent this place, but it a no for me.", "author": "Melinda W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-02", "description": "What an experience!  You are greeted with a friendly smile and wonderful service and just delicious options!  I am looking forward to another visit to explore more of their flavors.  I ordered the fried tofu and thai dumplings which were a delicious start complimented with a Singha beer.  Then, i had to try the hot wings and the presentation was true fireworks and the flavor was just excelllent!  A Must TRY!", "author": "Trisha H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-12-04", "description": "Wanisa Hone Kitchen \nNY BK Cobble Hill\n6pm Sunday 3rd December 2017\nThree Stars\n\nThis restaurant was nice but nothing fancy. It was happy hour from 5pm-7pm which meant 15% off all alcohol. There was definitely some language barrier issues. Tiffany and I both ordered the drunken noodles. I had the \"combo4meat\" which came with beef, chicken, pork, and shrimp. It was decently spicy which I liked but it overly spicy for her. The noodle to onion and bell pepper was 1:1 which made for less than satisfying dish.", "author": "Leonard L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-26", "description": "Ordered delivery. Spoke to a very nice lady on the phone. Delivery never arrived and the restaurant was unresponsive, according to the GrubHub rep. As soon as I got off the phone with GrubHub, I received a call from Tan, who assured me that my order would arrive. He tracked down the driver and made sure ig to my food.\n\nNow it's been raining all day, and it's cold, but the food arrived in excellent condition and was arguably some of the best takeout I've ever had. \n\nThey are my new faves!", "author": "Arkiem L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-01", "description": "Our local go to take out thai, we order from here everytime we crave thai. Usually order beef sirloin pad thai, vegetable tom yum and their special crispy pork basil stir fry. Delicious food considering it is take out, the food arrives hot and delivery is fast. \nOnly thing is with the crispy pork dish I wish for is a bit more meat, it's one of my favorite meals  but had just a tad too much vege. \nPicked up from restaurant one time and spoke to the owner who was really friendly and nice.", "author": "D M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-16", "description": "Roaming around the area looking for a reasonable sitdown-spot. Tuesday night and almost no one inside; menu looked good and the ratings were solid. Immediately got seated and our friendly waitress quickly handed us menus.\n\nMostly your basic Thai fare, however lots of options to choose from. Decided on the Red Curry with Vegetables ($10) and a Hot Sake ($9). The sake comes out first in an 8oz white vase and small serving cup. Drink is flavorful but not too strong so I didn't get tipsy before the meal. Red curry comes shortly after - a medium-sized bowl of hearty broth with an assortment of veggies swimming inside. This is served with a small mound of white rice (though I just stuck with the curry). Felt the veggies were cooked nicely, as the meal was overall balanced. Also got to try the Sauteed veggie duck; amazing flavor that needed no accompaniment.\n\nReally liked the service here, as our waitress came to check up on us without being invasive. Perfect place for a low-key dinner on a weeknight.", "author": "Shaji K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-07", "description": "Wow the best version of pork fried rice! Spicy flavorful and def thai style, tastes authentic!", "author": "Terri L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-14", "description": "Got the spicy basil fried rice with chicken and tom-kha noodle soup with shrimp - both were very delicious and authentic! Definitely must-try. Went around 8pm and it was rather empty, it's way too underrated. Will come back to try other dishes like the green curry and pad thai", "author": "Chesna C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-12-04", "description": "Honestly not sure how this restaurant has stayed open in this neighborhood for so long. Went in for late lunch and ordered curry puffs and ginger pork and instead of ginger pork I got garlic pork - which normally would totally be fine, especially since the server immediately swapped out the incorrect order for the correct one.\n\nThe reason why I'm giving the restaurant 2 stars is that the food is inedible. The curry puffs ($6 for 2) looked pretty but the puff pastry was bready and greasy and the puffs left a strange coating in my mouth after eating. The flavor of the dipping sauce was very off - there's no palm sugar or fish sauce in it.\n\nBoth the garlic pork and the ginger pork were bland and terrible and super salty.  Both dishes were just kind of doused in cheap/fake soy sauce. I ended up ordering an extra pad thai because I couldn't eat the ginger pork dish. The shrimp was nicely cooked on the pad thai, but the pad thai itself was flavorless yet somehow salty and heavy. I felt kind of sick after this meal - not like a food poisoning sick but very nauseated and brain-foggy - even though I only had 3 pieces of pork and maybe a quarter of the pad thai.\n\nFor the mistake she made, our server brought us 2 thai ice teas. My friend and I are not really caffeine drinkers after noontime and this was at 4pm, so unfortunately we were unable to appreciate their gesture, but it was nice that they tried to make it up to us.\n\nThe service was friendly and therefore I'm giving it two stars, but unfortunately I'm left wondering how it's even possible to make food that gross and how anyone can eat food made by this restaurant.", "author": "Jenny J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-09", "description": "Great place, great service! We got one of the special platters, which was beautiful and had tons of flavor and a tofu stir fry with beans and peppers that was also really tasty. Not too many people in the restaurant, so service was very fast. I've also ordered on seamless and it was fast and good as well.", "author": "Emilie W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-09", "description": "I came to order takeout, Lunch special pad Thai with chicken, it included  two rolls and a salad on the side (or soup, your choice)\nAll for 9.80. I found it to be cheap :D.\nThe food was tasty  will def come back again.", "author": "Amanda D."}], "servesCuisine": "Thai", "priceRange": "$11-30", "name": "Wanisa Home Kitchen", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "142 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/QT3v3bgV-cJp-zC1-7U5Dg/ls.jpg", "@type": "Restaurant", "telephone": "+17185223027"}