{"aggregateRating": {"reviewCount": 94, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-04", "description": "First of all, the food is SOO GREAT! The atmosphere in the restaurant was relaxing. The staff is really friendly and nice. Thai Milk Tea is a great match for the dishes they have. I definitely will go again and I RECOMMEND this place !!!", "author": "Crystal L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-13", "description": "Great food! I ordered the calamari and the Basil fried rice. It was so flavorful and well prepared. It was very spicy just as it needed to be. Wonderful service, the waitress was sweet and welcoming  from the moment I stepped in the restaurant. I would definitely recommend this spot as the best Thai place around smith street and surrounding areas. They offer a free Thai iced tea for a check in on Yelp! Wonderful!", "author": "Maylee S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-12", "description": "In the mood for budget-friendly, authentic, AND delicious Thai food? ... THIS IS THE PLACE. The place is family-owned and operated. The drinks are all homemade and/or made in store. Nothing is bought. Not even the desserts! \nThe wait staff is SUPER friendly and sweet. These people truly love the food they put out and the customers they serve. Definitely a gem to the community.", "author": "Christine C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-11", "description": "This is one of the best Thai food spots I've ever been to! The service is so amazing and the environment is very welcoming. The food was so good and I got the lunch deal which was well worth the cost of only $10! 5 stars!", "author": "Dia S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-17", "description": "Sooooo good! I found this spot on seamless. Great Price \u0026 Great Thai food. I love the pad Thai \u0026 Calamari here. This has definitely become my Thai Spot. I was worried after I gave Thaism the boot.", "author": "Natasha P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-15", "description": "We had a meeting party in this place last week, we got a lot of foods. We ordered and shared the foods to each other in order for us to try many things. I like the cashew nut dish and chicken fried rice the most. \nThe cashew nut dish was very full of tastes but only thing, it was hard to take it from the dish so we decided to put it down from the bowl. (It was hard to explain but once you ordered, do it like us ^^)\nChicken Fried rice wasn't enough for all of us, yes it was double ordered that i tried. I like soft rice but i dont like the oily fried rice and it was the good one from this restaurant.\nThe chef's special must try the devil's fried chickens, the sauce was ok but the chicken was so goood, the chef represents the dish so nice with that devils fire~\nTry the plants dessert green tea ice cream!! Was so fun!! Thank you ^^", "author": "Looknumb P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-10", "description": "Food is filling and delicious and at a great price! Would recommend! We had the amazing golden calamari which was perfectly crispy and delicious -that lemon juice squeeze makes it amazing! For our entree we had the pad Thai and panang pork bowl! If you want a nice filling meal the pad Thai will be perfect for you! The chopped peanuts add an amazing texture to it and you will not be disappointed, bean sprouts also very fresh. As for the panang pork bowl, it was an overall great meal, the only thing I would say is that it could stand to have a bit more curry!", "author": "Jason H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-23", "description": "This is my regular thai restaurant. For its standard of pure and nice curry, it is quite cheap for it:)", "author": "Yang L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-04", "description": "BAD FOOD. BAD RESTAURANT. \n\nHow does a Thai restaurant get Pad Thai wrong? The owner/chef just doesn't seem to care. The restaurant itself is also very uncomfortable in so many ways.  I do not recommend this restaurant to anyone. Small portions and below average tasting food.", "author": "Steve L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-12-15", "description": "GGi guess I have to write this to be able to post this review because it won't let me post anything until I write a long review.", "author": "Anila T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-26", "description": "Wanisa Home Kitchen does Thai food right. Was looking for a late night meal and although we came in with only 20 minutes before the restaurant closed, they still were happy to seat us. The staff here is really nice and once we ordered, it did not take long for the food to come out. \n\nThe Thai Basil Fried Rice was delicious. If you like spicy, you will like this. I got it with tofu, which was cooked to my liking. My BF, a staunch meat eater tried some and commented on how he actually liked the tofu with this dish. I also got to try some of the cashew sauce with chicken. The sauce is really good, and reminds me of a sweet teriyaki sauce. \n\nBy the time we were done eating, it was almost an hour past closing and at no point did we feel like we were being rushed out. Our waitress continued to fill our water glasses and ask us if we needed anything else. For the price (about $10 per dish) and the hospitality I would definitely come back or recommend Wanisa.", "author": "Lateefah M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-19", "description": "The Pad Thai here dethroned my previous favorite pad thai. There's nothing I would have changed about it. Perfect noodle texture, ratios, flavors, sauciness, etc. So good! \n\nI came here on a date night with my husband and it was lovely. Not loud at all, nice ambiance, windows open on a nice night, candles lit. \n\nWe also ordered a lychee mojito, calamari, crispy pork belly with crispy basil, pineapple fried rice, and the WK Thai tea float. The mojito was pretty good, the calamari was very good, my husband says the pineapple rice was very good but not a lot of pineapple, and we thought the pork belly was just ok. Texture wasn't that great for us. The veggies in it were good. \n\nThe WK Thai float was fantastic - YUM!!! Would order that again in a heartbeat! We split one and it was a perfect size for splitting if you're a little full at the end of the meal. \n\nAll in all great experience, will definitely be back!", "author": "Sarah P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-11", "description": "Placed an order for pickup via Yelp. I went with the BBQ pork that came with rice and some veggies on the side. I needed a quick meal to eat in transit, but they didn't give me any damn utensils. Had to eat the pork with my hands and forewent the rice. The rice was also semi-sticky and a tiny saran wrapped brick inside a larger box. Meat portions were pretty generous though. It came with two sides of sauce - one was the standard sweet chili sauce you can pick up at most grocery stores, and the other was the hot sauce. The hot sauce was damn good. The restaurant space itself was renovated really well, but seemed pretty dead on a Thursday.", "author": "Kenny C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-27", "description": "Great service and good food!  Nice quite location with family style restaurant with and yummy food!  I ordered Thai tea, and shrimp kee mao lunch special.  The lunch comes with appetizer and soup which is great portion of food.", "author": "Vienna C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-25", "description": "Wanisa Home Kitchen is now my favorite neighborhood Thai restaurant in Brooklyn! \n\nThe sizzling Spicy Combo Seafood (Sauteed shrimps, squids, mussels, scallops, crab meat with bell pepper, onion, bamboo shoot \u0026 basil in red curry paste) here is - this place doesn't disappoint you when it promises spice. The Pad Thai was absolutely delicious- perhaps the best Pad Thai I've ever had. \n\nThe service is friendly and efficient, the prices are extremely fair (even cheap), the portions are generous, and the vibe is very calm, warm, and welcoming.\n\nI recommend Wanisa Home Kitchen to people familiar with Thai cuisine, as well as those who aren't familiar with this kind of food. 5/5", "author": "George S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-27", "description": "Great food and service! Lunch Special is a great value, and be sure to check in for the free Thai Iced Tea. Our waiter was friendly and attentive. We'll be back!", "author": "Greg S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-18", "description": "Does it get any better?? Usually a big Thai curry fan, and that was great. Felt like a safe place to experiment, so went out and ordered rad-nar and crispy chive as well... Everything was phenomenal and delicious and our host/server was very sweet and friendly as well.", "author": "Manan S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-28", "description": "Best thai fried rice, for $10!!!!!!!!! Always a good experience, extremely nice management", "author": "Patrick F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-20", "description": "Great little Thai spot.\nI've come a few times and the different plates I've had are solid all around.\nPrices are very reasonable, and they have some great specials.\nThe people are here are very friendly and glad to serve.", "author": "Joseph C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-06", "description": "I was delightfully surprised by how delicious this place was. My roommate and I got the Pad See Ew and the Pineapple Fried Rice (our standard Thai dishes), and we were both blown away by how flavorful they were. I think this place is relatively new...I hope they stick around. It's my favorite Thai in the neighborhood!", "author": "Brian E."}], "servesCuisine": "Thai", "priceRange": "$11-30", "name": "Wanisa Home Kitchen", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "142 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/QT3v3bgV-cJp-zC1-7U5Dg/ls.jpg", "@type": "Restaurant", "telephone": "+17185223027"}