{"aggregateRating": {"reviewCount": 94, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-02", "description": "Very nice Thai restaurant , fried banana is awesome and the crab meat fried rice is brilliant too", "author": "Vin L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-11-29", "description": "My party of two was seated quickly and the food and service was good.  The decor is pedestrian and the music good.  I will return soon and you should experience it.", "author": "E W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-10", "description": "Great lunch special.  Red curry was excellent.  My new favorite Thai in the neighborhood.", "author": "Omri P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-28", "description": "A classmate and I came in the pouring rain and we landed in Wanisa Kitchen! Pad see ew is one of my favorite dishes and they did a great job at making it! The portions were very big, the flat rice noodles were soft and chewy and not over cooked, a large amount of chicken was used (very unusual) and the peppers and onions were perfect; distributed throughout, perfectly al dente and great complement to the flavored noodles. I'm glad the seasoning wasn't overly sweet (which happens in many Thai places to suit the American palate) and a very mild flavor. I actually wished it was spicier, but the flavor kicks you in the mouth without it being too salty, which I've found to be true about Song in Park Slope or Spice in the city. The noodles really did it for me! They were perfectly cooked...I hate mushy noodles or mushy anything  It was also one of the cheaper options and I found it through LevelUp! They also offer payment options for ApplePay! 4/5 stars!", "author": "Ren C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-09-08", "description": "We ordered 3 dishes. One of the curry beef was unreasonably sweet. Also, the rice was cold and hard. Thought maybe the leftover from last night. Not going back no more.", "author": "Rong C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-02-08", "description": "By far worst Thai food option in area.  Chicken wings undercooked, with thin sauce on side, not cooked in sauce.  Drunken noodles were bland with almost no sauce or spice.  Very small portion and looked so bland and boring when I opened the container.  I had hoped the look was deceiving, but it tasted more bland than it looked.  Will never go back.", "author": "Food E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-13", "description": "I was skeptical with another Thai restaurant in the neighborhood but this place is really good...surprisingly good. The food isn't drowning in oil and everything tastes so fresh...not like they got a shipment of frozen Thai ingredients from the local distributor. The fried calamari are fresh calamari...not tough rings but big meaty strips, it's delicious. Pad Thai is light and the BBQ pork is actually a boneless pork loin chop. Satay is tender and juicy and my friend raves about the Thai fried rice. The staff is also super friendly and they are very accommodating to food allergies. It's my new favorite Thai place.", "author": "B B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-16", "description": "We were excited to try a new Thai restaurant, as so many of them taste like they get their sauces and curries from the same place. We ordered takeout, and the food arrived hot and within a reasonable amount of time. The masaman curry and cashew nut veggie stir fry were flavorful and refreshingly different than other Thai restaurants. The food seems fresh and home-cooked--not mass-produced. This is my new go-to Thai takeout place!", "author": "Loretta M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-12-18", "description": "Never go here if you are vegan as myself I ordered a veggie pad see ew asked if there was any non vegan ingredients they said no. I placed my order online and when it arrived I was presented with egg in my meal so I called and asked if I could get another order I was told no and that I would have to pay for ANOTHER MEAL. Horrible customer service I wish I could give zero stars.", "author": "Daniella C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-08", "description": "Excellent Thai food and friendly service. My favorite pad Thai in NYC. The neighborhood is chock full of Thai restaurants already, but this place is a welcome addition. It tastes like it's made with a little more love. Definitely check it out.", "author": "John K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-08-31", "description": "I ordered pad thai today founded cockroach  on my food", "author": "John L."}], "servesCuisine": "Thai", "priceRange": "$11-30", "name": "Wanisa Home Kitchen", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "142 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/QT3v3bgV-cJp-zC1-7U5Dg/ls.jpg", "@type": "Restaurant", "telephone": "+17185223027"}