{"aggregateRating": {"reviewCount": 94, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-10", "description": "This is our new go to place!  We just found Wanisa last night and have tried many other Thai restaurants in the area. We were in a Thailand last year and Wanisa is the next best thing to being in country!  The staff is friendly and service was wonderful!   We will be back soon!", "author": "Lucia H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-05", "description": "Good thai food and friendly staff!\nI used to live in Thailand and must admit the food was better than the original I tried in Thailand.\nPrice are reasonable, you should experience it!", "author": "Anthony A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-15", "description": "I came here for a quick Thai lunch on Monday, and i had to come back again the next day.\nI ordered off the lunch special, which included a choice of either soup or salad. i would definitely come back again to try there other dish. The young girl staff who work on both day was very nice and friendly too. Overall 5 stars", "author": "Eric H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-11", "description": "This restaurant is by far has the best Thai food I've ever experienced. I work around the neighborhood and I continue to come back for their lunch specials, which consists of a soup/salad and a spring roll.\n\n99% of the time, I would get shrimp pad see-ew, which tastes delicious. If you're looking for something with a smoky taste to it, I would recommend that dish! Their portions are big and every time I leave this place, I am full till the next morning. Today, I decided to try something different, Cashew Nut Sauce and I'm incredibly happy I did. I'm typically a very picky eater when it comes to food and I would say if you're going for something sweet and filling, that's the way to go. \n\nThe restaurant is very clean and dim, which makes it quite relaxing. The environment is calming and it's super casual.\n\nAnother thing that proves I come here so often is when the waiters/waitresses recognize me and remembers my order. As a customer, it's an awesome feeling to know that they listen to you and can remember your favorite dish! \n\nHuge shout out to Toy, who has been my waitress for countless amount of times. She is absolutely amazing. Although there's a language barrier, I've never had any miscommunications. I know she tries for her customers to be satisfied. \n\nFor those reading reviews before they decide to go, I would highly highly highly recommend this spot. I typically never write reviews; however, they really did deserve it!", "author": "Jessie W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-10", "description": "I go here twice a week. Fantastic fresh food, good cost, and fast delivery.\nTheir specials are damn great too,", "author": "Christian L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-09-09", "description": "Ordered delivery today and was really disappointed:\n\nGreen curry: lacked flavor, had to add a bunch of salt to make it edible. Also ordered medium spicy and it completely lacked spice\n\nCrispy calamari: so over cooked that it tasted like deep fried erasers\n\nTom Kha soup: also very unseasoned and tasted like plain coconut milk boiled with some mushrooms", "author": "sarah w."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-01-27", "description": "My wife and I went in at about 1:30pm. It was empty (see photo), which was fine because we had some paperwork we wanted to go over while we ate. we started seating ourselves at a four-top, when the waitress asked ya to sit at a table for two.\nOur jaws dropped. My wife said \"but there is no one else here!\" and the woman said \"sorry, that's our policy\".\nUnbelievable! \nSo. We left.", "author": "J. G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-09", "description": "Try kee-Mai (Drunken Noodle). Good food with good price. I love eating spicy food and they made it spicy for me", "author": "Aakash P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-08", "description": "The pad thai (spicy) is AMAZING. This restaurant is family owned, the ingredients are fresh and unique. The staff is welcoming and the fact that it's cozy and cute is a plus (great for a date). I loved it here, I thought the food was excellent and everything exceeded my expectations.", "author": "Sarita P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-04", "description": "Very nice home feeling Thai cuisine. Nothing extraordinary special, but once in a while it is nice to have something that really stays true to its original flavor. The drunken noodle is a bit too mild, I would give it a five if they can kick the spice up a notch. Green curry with chicken is really delicious and have all the right ingredients in it. For someone who is not a big fan of egg plants, I find it extremely tasty in the green curry. Highly recommend if you feel the urge for a meal of simple yet delicious Thai food on any day.", "author": "Gavin C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-10", "description": "Early on a Wed eve, I came for a light meal. I chose the special salad with chicken, pork, and shrimp.  The food was tasty and healthy, the price was low, the service was very helpful, and the overall experience was just what I hoped for.", "author": "Clark Q."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-12", "description": "The soup is delicious !!! I Love it\nWould like to come and try the thai beer next time!", "author": "Sandy L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-06", "description": "Came here for dinner tonight to try it because wanisa just opened. We really enjoyed it, veg was super fresh with the right amount of crunch. \nWe got the panang and masuman Currys, pad see ew wth shrimp and a side of peanut sauce and a side of veg. Bill was 37 bucks. It's was really nice we will go back I'm sure. They have no alcohol yet or it's byob we weren't sure to be honest.", "author": "Katie H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-01", "description": "Not sure where you can find a better deal for quality and value. Delicious food and very well priced! Free delivery !!", "author": "Ryan B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-01-23", "description": "AVOID. I found multiple droppings of mice poop in my rice. The green curry also destroyed my stomach and often my go-to dish at Thai spots. Avoid unless seeking health issues and food poisoning.", "author": "chris m."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-19", "description": "Authentic, delicious,  Thai food. I spoke to the owner and he's serving family recipes handed down from his mother's mother. Very cool. A gem of a place.", "author": "Heidi C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-17", "description": "So I believe I'm a Thai food enthusiast ha! I'm always down for some good Pad Thai so I decided to give this place a shot as opposed to the other Thai restaurants sprinkled around this neighborhood.  The place was empty at dinner time so I got seated right away and ordered the Veggie Spring rolls and the Tofu Pad Thai.  The Spring rolls were ok. The Pad Thai on the other hand was imbalanced when it came to the flavor. There wasn't a proper balance of the fish sauce and tamarind paste and it was clear because all I kept tasting was the fish sauce.  The tofu chunks were too big and tasteless but  the portion size was abundant.  Now I don't know about you but a Thai restaurant's Pad Thai has to be good for them to get a good rating.  Other than that the experience was ok.  The waiter was nice and the place was fairly clean although I think I'll stick to my neighborhood favorites next time.", "author": "Shiloh A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-10-23", "description": "We ordered food for delivery, 25min later they called us to say they don't serve our area (right in Grand Army Plaza) and they were not bringing our food... sorry bye bye\nRude, and terrible service... either you told me first or once we have ordered you came here as an exception but cancel an order 25 min later is really bad business!", "author": "Pilar A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-10-18", "description": "Poor Thai food.  With all the Thai restaurants in the neighborhood, almost any one of them are a better choice.  And if the bad food wasn't enough, they got  my take out order wrong to boot.  Will not be back.", "author": "John S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-18", "description": "March 18th, just hasd the chive dumpligs- loved it with the ginger sauce. Drunken noodles with 4 meat combo, loved it. Price was very reasonable. Service was good. Will visit again when back in Brooklyn.", "author": "Aaron L."}], "servesCuisine": "Thai", "priceRange": "$11-30", "name": "Wanisa Home Kitchen", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "142 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/QT3v3bgV-cJp-zC1-7U5Dg/ls.jpg", "@type": "Restaurant", "telephone": "+17185223027"}