{"aggregateRating": {"reviewCount": 94, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-05", "description": "This is a great place for Thai food. They have all the standard dishes you'd expect but the execution is better than most run of the mill places that you'd find on any block in New York. In spite of this, the prices are also better than nearby competitors. Service is great - the staff here is very nice and will accommodate whatever needs you have, and delivery / takeout orders are quick. When it's warm they'll open up the front and let the breeze in, which is a nice touch. Destination-worthy if you're looking for Thai food.", "author": "Charles Q."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-27", "description": "Don't let the dull appearance fool you ..,the food is what it's all about here .  Tasty and fresh .", "author": "douglas g."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-15", "description": "The staff at Wanisa are very friendly and kind. We had both appetisers, noodle dishes and curries. Every meal on the table was delicious. The whole experience felt very authentic! Will be back.", "author": "Maria L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-16", "description": "I live in an area where Thai food is horribly made. A friend recommended me to Wanisa Home Kitchen and I'm glad I came because the food I ordered were all delicious. Their shrimp rolls, papaya salad and pad see ew were really good! I came on a Friday and the waitress was really friendly. The restaurant is super clean and pretty. They also have Thai beers! I highly recommended this place :)", "author": "August V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-21", "description": "This restaurant is great! \n\nMy husband and I live in the neighborhood and have tried all the Thai restaurants. Wanisa is new and we thought we'd give it a try. We were really impressed-in fact, this place may have just beat our favorite local Thai restaurant! We ordered the spicy eggplant, green curry, and pad thai. Everything was so flavorful, fresh, perfectly spiced, (not greasy) and very authentic and delicious. Also, it had a great vibe and the service was so sweet and kind. We will definitely be coming back!", "author": "Amy S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-19", "description": "Phenomenal food. Ordered the papaya salad, green curry, and pad see ew. Their spicy is spicy. Staff is over the top nice. Coming back for sure", "author": "Ray M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-10", "description": "I'm notoriously picky when it comes to Thai, so 5 stars means a lot. This space just opened up in Boerum Hill on Smith and not only was the food delicious (I got the Pad Sew--super fresh and not overly oily) but the server was so nice and accommodating--the kind of service that West Coast natives like me opine about missing once they get to NYC. The decor is also lovely, with wood panels that line every wall and flowers on the tables. Will definitely be back.", "author": "Amy Z."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-09", "description": "Delivery: we phoned in, everyone was so pleasant on the phone, and they threw in a Pad Thai just to make friends (it worked!). \nChicken laarb was great-- spicy, cool and fresh. SamTam salad was also super --papaya tasted really clean. Not as spicy or dried shrimpy as I like, but easily remediable. Crying Tiger beef was basically a delicious marinated steak-- cooked to specs, tender-- and some mild, good side sauce. Spicy seafood combo was generous, well rounded flavor but not super spicy. \nVegetable Pad Thai was remarkably plain. Not something I'd order again, but was an experiment anyway. \nFingers crossed that Wanisa focuses on the funky and hot end of Thai cuisine; Brooklyn had enough oversimplified drunken noodle already. Bring on the chili and the fish sauce! Bring on the dried shrimp and and sour sausage! \nDelivery was quick, too!", "author": "M.M. A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-28", "description": "This is a mom and pop restaurant that really puts their best foot forward in terms of service, quality of food and authenticity of flavors. I really enjoy coming back here every time. I hope this place does well and stays around as a neighborhood staple!", "author": "Ellen H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-21", "description": "My friend and I came here because all the reviews were good. Was not disappointed! We got the green curry and massaman curry and they were both very flavorful. The green curry was spicy tho so beware!", "author": "Andrea N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-19", "description": "We had the crispy pork belly with broccoli, and the steamed red snapper. Both were really yummy. The pork belly with broccoli had really bright fresh flavors and the red snapper (which we get a lot) was great and really about the fish. They just opened up and hopefully they will always be that friendly because they were.  Also the Thai ice tea was light and fun as a  sweet treat.", "author": "Kevin F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-22", "description": "I really like this restaurant! My group of friends and I went here before christmas break to relax after a long school year. The lighting was dark and made everything more intimate. The staff members were very nice; they quickly attended to our requests like asking for extra napkins or filling water. I ordered the kee-mao which was delicious! My friend ordered the yellow curry which was extremely delicious, but it would have been better if they served more rice. \n\nOne star off for opening the restaurant at 5:00 pm.", "author": "Alex B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-19", "description": "Food is great, service is excellent. Some of the stuff here can be super spicy if you like spice and ask for it. The food here is some of the best Thai food I've had in the area, and the prices are very reasonable and the employees are fast, efficient, and nice. Would definitely recommend this place both for those who haven't tried a lot of Thai food, as well as those who are Thai food experts.", "author": "Tony J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-05", "description": "OK- Listen- Having spent several years living in Thailand- I am a complete pain when it comes to Thai food- and this place is the real deal- legit and GOOD Thai food.  It is *not* trendy- it IS authentically prepared Thai food that tastes the way Thai food is actually supposed to taste- which means it is delicious! I have no clue why this place isn't way busier-if you live/work nearby you should go and if you don't it's worth the trip and easier to get to than Queens :)", "author": "Concetta B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-11-25", "description": "Ordered food last night and got really sick. I was up half the night vomiting all the food after eating here. The chicken tasted a little strange, but I thought it may have been the curry flavor. I order food all the time and have not gotten sick on it before. The reviews were amazing so I thought this place would be incredible. Sorry for the bad review, but this was awful. Will not be ordering from here again!", "author": "Kelly G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-03", "description": "Ordered the vegetable massaman curry.  Upbeat music, bright lighting, not too loud.  Friendly service.  Tables are spaced far enough apart to allow you to have private conversations.", "author": "Ajay K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-27", "description": "I've only eaten here a couple of times but the noodle dishes that I had were good and plentiful. The prices are a bit cheaper than comparable places on Smith Street, which is a plus. The service was friendly and the room was clean. I'll definitely be back.", "author": "Pandora B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-01", "description": "Overall great food and service. New favorite local Thai food. The crispy pork is so good.", "author": "Yuan L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-24", "description": "Phenomenal fd. Ordered the Crispy spring roll, Mas-Sa-Man curry, pad see ew \u0026 Pineapple Fried Rice. Their spicy is spicy. Staff is over the top nice. Coming back for sure.", "author": "Twin S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-22", "description": "Friendly staff, great green papaya salad accompanied by a whole deep fried red snapper with spicy basil sauce.  Sticky rice was ok, I wish it was a bit sweeter.", "author": "James D."}], "servesCuisine": "Thai", "priceRange": "$11-30", "name": "Wanisa Home Kitchen", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "142 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/QT3v3bgV-cJp-zC1-7U5Dg/ls.jpg", "@type": "Restaurant", "telephone": "+17185223027"}