{"aggregateRating": {"reviewCount": 103, "@type": "AggregateRating", "ratingValue": 2.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-09", "description": "Breakfast is always on point whether you get a sandwich or some grits, egss and meat. You are sure to enjoy such a treat!!! Fresh muffins toasted on the grill are amazeballs!!!", "author": "Taina B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-10-06", "description": "A good lunch spot. Their pasta is so big and tasty. Pricing is medium and a little bit expensive for a spot like this.", "author": "Big B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-10-26", "description": "Decent place with tons of options for lunch, but the food was just okay for me on my visit. I went with the whole wheat penne with vodka sauce and veal meatballs. It is a huge portion, but the meatballs were a bit heavy and dry and the penne was a bit undercooked. I may come back again, but I would have to try something different next time.", "author": "Cynthia M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-21", "description": "Great place, Official lunch, breakfast and happy hour spot for my office. Their lunch selection is awesome. Quality of food is great.", "author": "Pluto G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-06-08", "description": "Luciano's at Metrotech\nThis place is one of my favorite lunch stops; especially since I work across the street.\nMy favorite item is the \"make-your-own\" pasta dishes. Pick a pasta, then a sauce, and topping. They will cook it right on the spot.\nThis makes lunch a lot less boring for me and my co-workers.\nGet your food and find a seat or go for full service and get a waiter \u0026 menu.\n\nIn the evening it is a nice stop for a drink(s) at the bar with free hot \u0026 cold snacks! It is not a club scene so don't expect your typical club actions but it is worth a stop after work.", "author": "Rich W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-08-01", "description": "The first time we ordered, last week, everything was perfect. The food was good and was delivered in under 45 minutes. Today, after waiting almost an hour and a half, I called to cancel the order. It's raining, but the online ordering system said it was a 45-60 wait. Apparently, they were \"very busy.\" Their food is good, but not good enough for a wait like that. :(", "author": "Danielle M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-11-30", "description": "Good food, This includes the pasta bar where you choose your ingreiendents and its made fresh while you wait. The pizzas are good. The table service is good and the bar is well stocked. you can eat in or take out. This place can get very crowded at lunchtime and seating fills up, try to arrive a little bit earlier than the lunch crowd if you plan on eating inside", "author": "Tracy P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-05-20", "description": "The best italian place i have found downtown in terms of value, quality, and portions.   During lunch it gets quite crowded.  They have a fresh salad bar, a nice variety of panini's/sandwiches/heroes made right there, as well as a pasta bar.  It is relatively inexpensive considering the food is pretty good but will be more expensive than this general area (average cost of meal will be around 10 dollars).\n\n If you are a cubicle rocker like myself and you are trying to be unproductive for the rest of the day you should venture over to the restaurant side.  Tender filleted veal/chicken parmiagianis await as well as the class eggplant parmiaginas served on top of a mountain of noodles of your choice along with sides.  Even the strongest eaters will struggle with this amount food.\n\nAlso it is probably the best happy hour spot in this general area.  Gotta love it, i just wish it was a little bit less pricey.", "author": "Ken Y."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-01-27", "description": "Great for Lunch and After-Work drinks.\n\nThey cater to the surrounding metro-tech businesses and do a lot of their business during lunch. I haven't had a pasta dish or panini I haven't enjoyed and my company has used them twice to cater our holiday party. \n\nTypical pasta dish runs you from 7-9 dollars and its a healthy serving of food... so relatively good value. \n\nClosed Saturday/Sunday", "author": "Andrew S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2010-11-30", "description": "DON'T EAT AT THIS PLACE!!!   THE SERVICE SUCKS!!!\n\nI've been eating lunch at this place for almost 2 years and as of today i will never go back.  I was having lunch with a co-worker who bought soup from another store, but came to eat with me at Luciano's.  I ordered and paid for a salad FROM LUCIANO'S.  My coworker decided to purchase a drink FROM LUCIANO's and while she was paying for her drink someone (a janitor or someone) picked up the soup assuming it was garbage.  My co-worker eventually tracked down the soup.  \n\nwhile she is eating her soup and i am eating my salad FROM LUCIANO'S the manager comes over and tells my co-worker she can't eat the soup in the restaurant because its not FROM LUCIANO'S.  We explained to him that I bought a salad from there and my coworker purchased a drink also FROM LUCIANO'S.  A gentleman sitting right next to us, told the manager that it is ridiculous that he is making a big deal out of a small soup and that me and my co-worker were patrons because we had purchased items FROM LUCIANO'S.  He replied that the soup company doesn't pay his rent and therefore he cannot allow my coworker to eat the soup.  Can you believe this?!?!?!?  \n\nHe even told me that it is the law.  I am an attorney and asked him to cite the law he was referring to.  he quickly fixed his statement and said \"it is the law in here\".  It got to the point where he was ready to call the cops and also kick out the gentleman that was sitting at the table next to us....over a soup?!?!?!?  We eventually left because I am not begging anyone to sit in their establishment like there are not thousands of restaurants in the area.  I left my salad there and left.  THIS IS THE KIND OF SERVICE YOU WILL GET AT LUCIANO'S.", "author": "Jeffrey C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-12-14", "description": "I work near Luciano's and come here for lunch and sometimes after work for happy hour. This restaurant has the same menu for lunch and dinner. They have pasta which is customizable, pizza, sandwiches, salads and random hot dishes.  \n\nI would say their food is mediocre and the lunch time crowd makes ordering at this restaurant unbearable. If you come here for lunch, I would recommend eating before or after 1:00pm. During the lunch time rush, it is usually a mad house. Lines appear and reappear in front of your very eyes. \n\nIn addition, they only have two cash registers that are very slow. I always believed that you are only as good as the equipment you use.  In this case, the staff is reliable and fast. However, you will watch your food go cold while you stay on line waiting for your turn to pay. \n\nDuring happy hour, it is less chaotic and has a mixed crowd of students and workers. They have a jukebox and sometimes a DJ. The music is always on some popular song of the moment. It's not a bad place to meet up with your coworkers. Besides that, they do offer free pizza after 7:00pm.", "author": "Lisa B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-07", "description": "Pizzeria with a happy hr bar, why not?! Good drinks as long as you get the right bartender, some tend to water them down where some make them just right :) The owner also hands out a personal pie to each table that is drinking, which always hits the spot. Certain times they have a DJ playing anywhere from some pop to hiphop \u0026 reggae to get the party started.", "author": "Laura W."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-10-08", "description": "I had the funghi pizza. Thin crust with regular and portabello mushrooms and onions. The toppings were very generous, almost annoyingly so. The sauce is light, which is good. I didn't care much for the crust, it had a flavorless Domino's quality to it. Overall not worth $7.25 for a personal pie, I can get two good slices at a pizzeria for $4. \n\nI have not tried the pasta or sandwiches, perhaps those are better than the mediocre pizza. I won't be back though, because the ordering system is a hot mess. No lines, just mobs of people pushing one another and no indication as to where you should place your order. Is it one long line? Is there a line for each \"station\"? Who knows. The cashier is awkwardly in between two stations too.", "author": "Kelly B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-10-18", "description": "I used to love this place I have been there couple of times. But last time there were hair in my pasta. It completely cut my appetite and apprehension of their hygiene. I will not go there anymore.", "author": "Nicolas B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-01-21", "description": "I was surprised at the lack of customer service provided to us today during lunch.  We ordered a margherita pizza as an appetizer and ended up with some sort of cheese pizza.  You could obviously tell that it was not a margherita ( no moz, no basil, no tomatoes) and they insisted that it was all baked into the sauce and cheese.  The shrimp diablo pasta was okay. To bad the service did not match the quality of the food.  Oh well...back to Caffe Napoli - lesson learned.", "author": "Daniel C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-12-01", "description": "I go here all the time for lunch. The food is decent, its close to my work, and the atmosphere is friendly and laid back. The main reason I prefer this place, though, is pretty much because the main bartender, Victoria, makes the best mixed drinks ever. Dont bother coming on her days off, as far as I'm concerned it should be called Victoria's instead of Lucianos...", "author": "Emma E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-04", "description": "One of the hidden gems in downtown Brooklyn!!! I go there all the time, however during lunch time they are very busy so you might want to try during happy hour. The staff can be not so friendly at times but by the time you eat and drink your food you don't care and the world is all great again. See you there!", "author": "Marie J."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-02-11", "description": "decent red wine, decently priced bar food!", "author": "Corey M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2009-12-13", "description": "My office mate honestly had a cockroach baked into the bottom of his pizza...   I know shit happens, but...", "author": "James C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-01-23", "description": "This place is the worst italianm restaurant ever.  Never again will I come here or tell anyone about it.  Food is made with all the same seasonings and the service is horrible.  The manager or owner also asked my friend to leave bc she cant bring food in from another place.  Um Mr. Dick there were 4 of us and 3 of us ordered from Suckhianos!!!!!!!!!  Please fire the manager. Customer service is essential and Lucianos' is by far worst.", "author": "Sal S."}], "servesCuisine": "Italian", "priceRange": "$11-30", "name": "Luciano’s", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "15 Metrotech Ctr", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/mHLzp2ppLVKalbfpqIaH4g/ls.jpg", "@type": "Restaurant", "telephone": "+17188556668"}