{"aggregateRating": {"reviewCount": 103, "@type": "AggregateRating", "ratingValue": 2.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-07", "description": "Come here for breakfast most of the time. Good menu items at a very reasonable price. If you want to substitute something, they are willing to do it without a problem.\n\nI also love the personal pizza that they do here. Occasionally, if there's a nice crowd at the bar, they will make the pizzas and put them out of free! Who doesn't love free pizza?", "author": "Jacky C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-03", "description": "Mediocre food and totally incapable of getting an order correct, not to mention the nasty attitude.", "author": "E S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-02-26", "description": "Good Italian place, but a bit pricey. There is always a long line if you end up going during lunch hour. It also has a nice salad bar.", "author": "Abhichandra R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-08-22", "description": "So I bought lunch (spaghetti and meatballs) at Luciano's yesterday. Something I really do because I really think his prices are too high and all you're really getting is a bowl of noodles and one or another form of the cheapest meats (chicken or in this case ground beef). Now to justify his $9.50 + tax price He says the meatballs are made from ground VEAL--fancy for baby cow, and is the reason for only giving you 3 meatballs. But okay...I'll rock with it. I work hard enough, and the meal (for me) is 2 sittings. \n\nBut my people...that means I should be getting everything in flavor don't you think? As always the pasta was prepared in the sauce of your choosing (in my case tomato sauce) to help enhance the flavor of the meal. Enhance my ass! Those were some of the most TASTELESS meatballs. I mean really...VEAL or NOT...salt and pepper, oregano, basil, parsley and garlic are the Staples for seasoning in Italian food. Meatballs or GROUND meat. How about using some of those seasonings in the preparation of them? So I mostly ate the linguine pasta that it was prepared with and the one little piece of dry bread (not even garlic bread) that they give you and brought the remainder of my lunch home. TODAY I'm having the remainder of my lunch with just a sprinkling of those simple seasons I mentioned, but my food tastes EXPONENTIALLY better.", "author": "Dionne N. C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-01-17", "description": "This place is horrible!!!!!!! The Spanish cooks are  very rude twrds the women who works as operators in 11 Metrotech..... I ordered breakfast which was Grits and Bacon...... the cook put the bacon on top of the grits ... I simple ask him can he put bacon on the side and he went off on me. Threw the food away and said take back my money... I was in there arguing with him..and had to curse him out..... They are Racist and do not treat the workers in the fire department the same way. I will never buy food from there again. ..", "author": "Dimples T."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-02-02", "description": "This place has absolutely horrible customer service. Went here today for the free pizza happy hour with a bunch of friends. One of the people in my group bought 9 shots and together 9 of us bought between 1-2 drinks each. After the free pizza came out I had just finished a beer and asked what seemed like the manager for a piece of free pizza. He quickly told me no because I didn't have a drink in my hand. When my group of friends the  promptly asked (they all had drinks in hands) he once again turned us down? I then asked him why and he told me I hadn't bought any drinks all night and he had been watching us....which is kinda weird because the dude was walking back and forth all night and I must have really dreamt having nine shots ordered and downing two beers. \n\nHow do you run free pizza HH and then literally turn down the people who easily dropped $150+ and Work in the area ( btw We all go here very often for lunch and I can tell we most definitely won't be going again any time soon) please fix your customer service issues.", "author": "James D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-01-19", "description": "Luciano's SUCKS,,everytime I attempt to eat here I am ignored, over charged,all the workers have a bad attitude or don't really speak English well,and the manager with the grey hair is an A**hole,never concerned with the customer, only makes excuses for his\n workers. I'm done keeping me money in my pocket.", "author": "Tuwanna S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-01-05", "description": "These folks are truly rude to black people.  RUDE.  This morning: a woman asked for turkey sausage and the guy gave her pork sausage; she bit into it and brought it back to him telling him it's against her religion to eat pork and can he... he snatched the sandwich and told her to stop talking and just give it to him so he can exchange it, not even looking at her.  \nI ordered a large coffee regular with my breakfast.  When I got to work, there was no sugar in the coffee.  I called and the girl at the register who is always rude, tells me \"well, there is nothing I can do.\"  I don't see them behaving this way towards Hispanics or any other culture. \n\nI have been going here for convenience.  These two have been historically rude.  I generally overlook it, but enough is enough.", "author": "Valerie T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-02", "description": "Great place and good Italian food!", "author": "John P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-09-08", "description": "Apparently the manager at Luciano's read my original review and complained to Yelp about my personal attack. C'mon Yelp, what happened to freedom of speech? So here's an edited version.\nI only go here because it's close to work. The food is so-so. The staff are zombies in a production line of bread, bagels and cheese. The manager is rude who mutters under his breath his displeasures whether it be with staff or customers. Did I already say he's very rude to customers and is super annoying! So this joint is basically, you back in highschool on line at the cafeteria waiting for your grub.", "author": "Miguel Á."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-23", "description": "If you gave 1 star, you're an idiot\n\nOBSERVATION: \nMore than once I have come here for lunch and seen some middle aged loser males occupying their tables with food brought in from OUTSIDE from 5 guys, Chipotle, \u0026 nearby food trucks etc.... THESE PPL ARE DISGUSTING \u0026 INCONSIDERATE. They seem to be co-workers/students that have no place to dine so they just stroll in and plop themselves on tables which are clearly for paying patrons only.\n\nREVIEW: \nI have been having lunch here for the past 7 years, never once have I been disappointed unsatisfied with their service. Our office even orders catering from Luciano's. Both owners are always very pleasant. The set up doesn't take a brain surgeon to figure it out.\n1 line for the pasta, 1 line for the salad, then go to the cashier. The dine-in area is separate. \nAlways delicious, always fresh, always courteous. I have tried almost everything on their menu and it's all very scrumptious. For me, the portions are huge, and I always wind up packing the leftovers. Great value and quality for the money.", "author": "Joujou N."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-11", "description": "Lucianos is the go to Italian spot for those that work in the Metrotech area. However, going forward I will personally be boycotting Lucianos due to the manager of the establishment. He is unbelievably rude, and on multiple occasions, he has approached myself and coworkers for silly reasons. We have been kicked out of the outdoor seating area, because not all of us got our food from Lucianos. Today, myself and another coworker were sitting inside, and we were kicked out, although I was eating a full entrée ordered from Lucianos and my coworker had a snack from next door. He said 'No Outside food allowed' and 'This is not a food court'. He then offered to allow us to sit outside, and we mentioned that he had previously kicked us out from the outside area for the same reason. He is rude, clearly bored, and I have seen him approach other customers as well for trivial things. The food is mediocre, and overpriced, and most people go to Lucianos simply because it is convenient. I will be taking my business, and my fellow coworkers business else where. The crappy reviews on Yelp speak volumes regarding this 'restaurant'.", "author": "Fazia R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-09", "description": "I decided to visit Luciano's last Friday after work with a friend for cocktails and karaoke. The outdoor patio area is very nice. Inside, it was a bit more crowded at the time, around 7 PM. The cocktails I had, Cape Codders and one Mai Tai, were mixed well and economically price about half of what I usually spend in the city. The food my friend and I had, BBQ Chicken and then a Margarita Pizza were delicious! By the time Karaoke was in full swing, the earlier crowd left so it became more comfortable with the much friendlier patrons still enjoying the evening. The staff was attentive. The restroom was clean and well lit. Overall, I would consider visiting again.", "author": "B. M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-02-07", "description": "Absolutely disgusted by this place this morning.  I asked for an Omelette and the guy making my omelette proceeded to use the same bowl he used to make some else's omelette with out washing it out (1) .  (2) He takes the same used bowl and puts it inside a garbage can next to the grill and knocks out the remains from the last persons omelette on the side of the garbage.  He then removes the same bowl and starts making my omelette.  At this point I'm puzzled because I couldn't believe WTF I just saw.  So I tell him what did you just do? Can you use a different bowl and he looks at me like I'm the asshole and preceded to use another bowl.  After letting this settle for a few seconds and analyzing.  I realized they only have three omelette bowls that they don't wash because they don't have a sink near by and they repeatedly rotate the three bowls while banging out the excrements on the inside of the garbage each time. This is absolutely unacceptable and deplorable and saddens me because I really like this place.  I immediately spoke to manager who stepped in and removed the bowls.  I got a refund and left the location. I gave one star because I couldn't give a lower score.  EAT AT YOUR OWN RISK!!!!", "author": "Cedric M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-15", "description": "My favorite place to go grab drinks afterwork. I also go for lunch sometimes, its usually very crowded for lunch. The pizza is good and i always get the usual penne a la vodka from the pasta bar never fails me! The service at the bar is kinda slow if youre going on a friday afterwork early evening -_-", "author": "Melissa E."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-12-18", "description": "How could I give Luciano's one star you ask? Easy! \nThe manager is a total asshole. He lacks customer service skills and that severely took away from the food, decor, price etc. I ate there today(Dec 18 2014) and since I was dining in they put my food in a ceramic bowl. I was not able to finish all of my food, so I requested a to-go bowl. I was given a metal pan with a plastic lid. I requested the plastic bowl, they didn't want to give me plastic. The girl behind the counter simply said \"We are not allowed!\". I ask to speak to a manager. A white male, short, thin, with a dark green button down polo shirt with a red horse on the pocket and slightly balding comes out and says the following things:\n\n-When you eat in and you think you are not going to finish your food you should get your food in a to-go (plastic) bowl.  (So now I'm psychic about if I am going to finish my food. )\n-It costs him too much money to give everyone who wants their food to go a plastic bowl (really?! They sell those at the .99 cents store and as a business owner you buy in bulk- so WTF)\n-He has to pay the cost of cleaning the dine in bowls that people eat out of and has to factor in the cost if one gets broken. (seriously!)\n-He hasn't raised the prices of the food there in along time and it is attributed to his not giving out plastic to people who dined in. \n-While he said all of this his finger was mere inches away from my nose because he was holding his finger up to make a point\n\nHe said he would give me the bowl as a \"one time courtesy\" for free, because the price is usually a dollar. \n\nPlease note: Luciano's is not cheap food. The average meal is like $9-12. The fact that he acted like this is ridiculous. \n\nI was so appalled by his attitude I have no intentions of EVER eating, or drinking from this place again. I also will make sure I tell everyone I know in the area (where I have worked for 5 years now) about this and to be wary of spending their money here.", "author": "Kia A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-08-23", "description": "The manager sucks! Very rude and shows no respect or tolerance at all!", "author": "Anthony R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-20", "description": "I come here fairly often be it for lunch, dinner, or after work drinks.  It's convenient, reasonably good quality, and affordable.  It can get pretty crowded, especially around lunch time.  What do you expect though?  Good food at a reasonable price is worth waiting a few minutes for .", "author": "Joe B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-08-31", "description": "Lousy service. Came in for breakfast. Few customers in line near cashier and no signage saying where line starts, so we get in line for the cashier. Place our order and pay. Fifteen minutes pass before we realize we were supposed to first order and get our food from the cook line right before the cashier line. No signage saying this. \n\nSo we figure it out, tell the staff, and the cooks are making our food. Bagel and cream cheese. Worker makes it, throws it to the cashier, and barks at me to go get it. No other customers around so she could have handed it to me. Owner watching us, staring daggers.\n\nWe sit down, start eating. Husband gets up for the bathroom, accidentally walks through seating area marked \"this area closed\". Owner (or manager?) meets him at the other end and harangues him for walking through. Husband says he's sorry. Just wants to use the bathroom. He pushes open the door with the man/woman bathroom symbol, but oops! It's a computer closet. Owner is watching him and snaps that the bathroom is the next door. Which is marked \"woman\". More confusion. Husband gets back, owner watching us, still staring daggers as we finish our food. \n\nWe had a few awkward bumbles, but the lack of signage, unhelpful workers, and owner who seemed personally offended by our presence made us feel like we were stupid people and unwelcome. A bagel and cream cheese shouldn't be this complicated.", "author": "Julia H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-28", "description": "My co-worker introduced me to Lucianos when he found out that I was disappointed in Cafe Metro and said the salads at Lucianos are affordable and fresh, so I knew I had to give it a shot.\n\nThe interior looks like a hot buffet place. It's spacious and lots of seating area and has a full bar.\n\nChicken Parmigiana Panini - It was absolutely tasty and humongous. Pretty good for $8.50. The quality is good and it just tasted very juicy.\n\nSalads - There's a pretty huge salad bar with different ingredients you can choose from. It amazed me that they had portobello mushrooms as one of the toppings for the salad. The salads here are fresh, tasty, and cheap!\n\nPesto Pasta with Mushrooms - The pasta was a little overcooked, but otherwise it was very flavorful and love that the chefs gave a lot of mushrooms because I love mushrooms. \n\nOverall, Luciano's is a step up better than Cafe Metro and it's a good place to come for good Italian food. At least I think it's good enough for Downtown Brooklyn.", "author": "Jessica D."}], "servesCuisine": "Italian", "priceRange": "$11-30", "name": "Luciano’s", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "15 Metrotech Ctr", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/mHLzp2ppLVKalbfpqIaH4g/ls.jpg", "@type": "Restaurant", "telephone": "+17188556668"}