{"aggregateRating": {"reviewCount": 103, "@type": "AggregateRating", "ratingValue": 2.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-21", "description": "The portions they have are huge. I had one of the pizzas and it comes with a soda. I definitely want to go to try their other foods. They have a huge variety, from paninas to pasta to salads. They have it all. They have a dine in, take out, even delivery option which is really nice.", "author": "Ellie O."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-05-21", "description": "It would be generous to call the food and the service mediocre. That's not the tale I'm telling today, though, folks. Here's what happened:\nMy colleagues and I went to Luciano's after a meeting to get some food. Luciano's is over-priced and under-staffed, but it's in the area and there's more seating there than at the Chipotle.\n\nWe waited for a half hour after being seated, at which point I flagged down a waiter so we could order. We ordered some food, and waters--not cocktails or beers, waters, which should take maybe 5 minutes, tops (I used to be a server, it makes absolutely no sense that we had to ask for water and then never received it).\n\nLuciano's was crowded for a Thursday-- lots of Finance bros from Metrotech being obnoxious. \n\nMy one friend, who is a person of color (more on why I mention this in a moment), was sitting at our table. A white man passed by us and told my friend he had to move, because he was blocking the aisle. The man was rude, and my friend wasn't blocking the aisle, he was just sitting where the chair was placed at the table. My friend said \"don't worry about it\", at which point this \"gentleman\" identified himself as the business's owner and told my friend \"that's not the correct response to what I said\" and that my friend had to move to another seat. \n\nThings quickly got loud, and we decided to leave. None of our food had been sent to the kitchen, and we hadn't even received our waters, so there was no need to charge us. However, when I went to get the credit card I had left for a potential tab, the white guy said he was going to scan my card, because we ordered food and we owed him that. We argued with him, he argued back, it got ugly. It took me calling him \"disgusting\" (which he was) and pointing out that the only people he bothered were at my table, with the only minorities in the establishment, to get him to give back my credit card.\n\nI'm extremely disturbed by this event. The owner was openly rude to us, and on top of having bad service and bad food, Luciano's apparently racially profiles. I recommend you go literally anywhere else and let this miserable gentleman go out of business.", "author": "Lisa M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-02-05", "description": "Luciano's is a decent enough lunch option in the MetroTech area.  I usually come here with my co-workers when we're in the mood for some lunch hour bonding.  This place can get really busy around noon, but if you come a little later you will actually be able to talk with people you're sitting with.  The service is usually pretty good because the sit-down area isn't very large and so the staff has plenty of opportunity to handle any and all of your requests.  It should be noted that there are basically 3 distinct areas in Luciano's.  There is an area near the cooking stations where you usually go to order your food to go.  There's an area near the bar if you feel like sitting in the restaurant but don't want to be waited on throughout your meal.  Finally, there's restaurant area for seated dining with service.\n\nWhen making use of the seated dining option I've tried several of the pasta dishes as well as the broiled salmon.  The pasta is alright and the salmon is slightly above average as the taste leans towards bland more often than not.  The highlight of getting the salmon is the vegetables that come with the meal as they are just deliciously buttery, salty, (possibly unhealthy) and amazing.  There's no consistency to which vegetables will be served with the salmon, but whatever comes out is usually tasty.  The biggest problem with the salmon dish is that it's hard to justify the price just because the vegetables are awesome. \n\nIf I'm just grabbing something to go I highly recommend the Grilled Chicken Panini and adding some prosciutto. It should be noted that the sandwiches are enormous and are probably good for 2 meals or at least a meal and a half so you get fairly good value for the money spent.  If the bread hadn't done serious damage to my gums on multiple occasions I would probably order it more often.", "author": "Fabian M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-09-08", "description": "Do not go to this place unless you don't mind the disgusting service from the employees and owner. This place takes forever to take your orders simply because the employees are slow and they have nasty attitude. They act like \"they are the only restaurant in town\" attitude and either you like it or don't buy. \n\nMy co workers and I have been going there for three years for our breakfasts and lunches. We never sit at the tables, and the only one time we've decided to sit for lunch, we received the nastiest attitude from the owner. \n\nThere were 6 of us who order foods to dine at the table. And one of our co workers brought in some food to have on the table and aside from that, she ordered food as well. The waiter came and told us we are not allowed to bring outside food. The waiter was literally standing there watching us to make sure she didn't eat her outside food. My co worker took out a small portion of her food and left it on the plate where her fries were at. The owner came out with an attitude telling us we are not allowed to bring outside food. The owner said most people would come in with outside food and take over the tables. We kindly told the owner that we have been coming here for years, and everyone ordered food and we don't see why would there be a problem. We told the owner this will be the last time we will be coming here. He replied back by saying,\"Is your choice, I could still pay my rent without your business.\" \n\nYes we were shocked how at this shocking service.", "author": "Wendi Y."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-01-24", "description": "Very inconsistent pricing and super expensive for mediocre food.  There are so many places in this area that I wonder if not for its proximity to the Metrotech buildings this place would have closed long ago. \n\nPanini bread quality varies from day to day. Pizza quality varies from day to day. The cook is eager to get you out of the line rather than taking your order in a respectable manner. I only eat here because its too cold to go any where else. \n\nOne particular incident which irked me is when I asked the server at the salad bar for some green beans. He puts exactly ten beans in the box ,writes 3.50$ on the box. I asked him \"Aren't you  supposed to weigh it?\" He was least interested in answering my question and totally ignored me. As I approach the cashier I ask the same question, she answers me \"He weighed it\". I was witnessing the whole charade, he did not weight it. She blatantly lied to my face. \n\nNot all cashiers and servers are like this. Cashier at the pizza and pasta bar is very nice. This particular incident irked me to point of the writing this review.\nHopefully they will train their staff in ethics and good customer service, if not about good food.", "author": "Arjun L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-06-10", "description": "I think a bottle of Budweiser runs $5/$6... house liquor shots are $4 The owner/the owner's dad also kind of looks like Bill Maher. Plus if they have pizza left over towards closing time, you might get a individual pie for free. Generally good vibes, crowd seems to be all people who work in the area (based on stopping by on a Friday evening). Tons of seating inside, and they have tables out front as well.", "author": "Anna K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-09-20", "description": "This place does not even deserve 1 star! Food is disgusting and service is appalling! Overpriced \"Italian\" food is only for idiots that don't know better.", "author": "J J."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-05-19", "description": "Good lunch place. Efficient and professionally run.", "author": "Juan S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-24", "description": "Decent pasta and sandwhich place.  A bit disorienting regarding getting your food, but the price is right and they have a wide enough variety.  Chicken parm pasta and sausage (hot and sweet) with vodka sauce are my faves.", "author": "Stuart B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-09-23", "description": "I would not go back there for a salad.  They are overly priced and the server is cheap with the chicken.  Nonsense to pay $14 for a salad.", "author": "Skyler S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-22", "description": "Lots of options for pizzas, pastas, and sandwiches. Many of the items are cooked right in front of you.\n\nPortions are pretty large and you will likely have leftovers or be too stuffed to eat another thing later!\n\nif you work in the downtown Bklyn area, this is a good place to add to the lunchtime mix.", "author": "Arielle S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-29", "description": "For months, I have avoided Luciano's. And in all honesty, that is my own damn fault. I had a couple bad experiences at nearby Kevin \u0026 Barry's (so lame) and therefore took the prejudiced stance that my coworkers have awful taste in downtown BRK bars, and that all bars any of them go to would be shitey dives with overpriced drinks. Luciano's, or Luci's as everyone calls it around here, is actually the opposite. Mama mia. \n\nLet's get something straight. I HATE the name \"Luci's.\" I grew up going to Providence and New Haven all the time, the Guido-est of the Guido in New England, and I really have a dislike for cheesy nicknames of Italian joints. However, actually going to Luci's two weeks ago helped ease me away from the images of Jersey Shore that were dancing around in my head, and helped me realize that Luciano's is just a normal, albiet cookie-cutter, bar and restaurant in the downtown Brooklyn neighborhood. It's pretty much what you would expect from anywhere nice-ish around here (and if that's what you're after, avoid KB's at all costs). \n\nThe four star review comes from the fact that on a Friday afternoon, beers were cheap, and as it was (and is) gorgeous out, we got to sit on the patio and shmooze in the sunshine... and at no time was it so crowded as to be uncomfortable. Don't get me wrong, if this was a neighborhood other than downtown, I probably would give it three stars... but considering that it's bajankity downtown Brooklyn, well, I'll give it four.", "author": "Elishevah G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-24", "description": "Two words: Thursday Lasagna. If you haven't tried it, you haven't lived. Their Fungi Pizza is my go-to for the rest of the week, though in my opinion they're a little overzealous with the onions, so I generally opt out of those. Seating is sometimes a little tedious around noonish, but the food is always on-point. Their pasta bar is another one of my favorites, I recommend the spinach ravioli (pretty sure it's #13). I will say, the ordering and checkout process here is...well...disorganized at best. If you can manage to push your way through to the register, you will not be disappointed. Great food and generous portions for the price.", "author": "Anne-Marie B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-07-28", "description": "Don't come here if you work somewhere in the morning you will wait 20 min for a breakfast sandwich. And deal with incompetent and rude employees!", "author": "Felicia B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-01-27", "description": "Food is ok/mediocre I come here because it's close to work.  Manager/owner with the grey hair is unbelievable.  I asked for a plastic cover for a container because as another customer opened the door to leave a gush of wind came and knocked my container on the floor.  You would not think anything of it however the Manager tells me \" I will lose my count\" and repeated it to me several times.  I thought he was joking and when he said it again I responded by \"The wind knocked it on the floor\"  he then has the nerve to tell me that it's not his fault. I got frustrated and said \"do you want me to pay for it?  He says no, and then repeats again that it will lose his count.  Inventory???? Give me a break.  You make a notation and initial it.  It's not hard.   My coworker told me that he was a PRICK and now I know why.  Poor Customer service skills buddy.  Been coming here with my coworkers for years. Probably won't anymore.", "author": "Spud K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-01-24", "description": "I like this place - close to work, pretty quick turnaround. \n\nNothing too special, just another pasta place that will make your customized pasta in front of you. The food is okay, definitely pretty good compared to the places around here.", "author": "Alice Z."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-12-11", "description": "This place is pretty convenient and reasonable value for you buck until you run into the owner Mr. Butt Head. Mr. Butt Head is a part owner splitting the buck with the older Luchiano who is a gentleman. Unlike Luchiano, Mr. Butt Head is a food nazi barking at people who bring food from outside, ordering people which line to stand in, and putting up annoying signs around the facility. Speaking of lines. There is line for salad, line for pizza, line for sandwiches, line for pasta, and line to pay. Mr. Butt Head has no idea how to run his place other than to blame his customer for not learning his \"system\". Don't waste your money and time waiting in long lines and instead go to Hill Country, Roco Tacos, Chipotle, 5 Guys, or a dozen other places near by.", "author": "Nazar K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-07-28", "description": "I was pleasantly surprised...  I was in Brooklyn for the day and this was next to where I had to go for meetings with the NY Department of Education...  It looks like fast food, and I said um, any better choices?\n\nThe setup was very convenient and fast, and often when you have so many options to create your own meal things go down hill fast.  But my whole wheat pasta was cooked perfectly and was delicious, the chicken was really good, and the marinara was amazing (plus the spinach and hot peppers really made my dish complete).\n\nI don't much about Brooklyn, but if fast food is this good there, what does that say about the really nice places...   going back soon and will explore more.", "author": "Das K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-05-14", "description": "Food is good but staff have an attitude problem. ....don't come in with a list of more than 4 things.....they get annoyed and have 2 speeds slow and slower..... 30 mins for 4 egg sandwiches really???", "author": "Chris C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-12", "description": "I absolutely love the food here. The penne pasta with olive oil and garlic is amazing.  There cesar salads are so delicious.  The only down side is the pricing is a bit high. Yet I love the food. Very clean and fresh food.", "author": "Alexa F."}], "servesCuisine": "Italian", "priceRange": "$11-30", "name": "Luciano’s", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "15 Metrotech Ctr", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/mHLzp2ppLVKalbfpqIaH4g/ls.jpg", "@type": "Restaurant", "telephone": "+17188556668"}