{"aggregateRating": {"reviewCount": 103, "@type": "AggregateRating", "ratingValue": 2.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-10", "description": "Today I had the pleasure to eat at Luciano's for the first time. I was not disappointed. \n    It is quite spacious inside Luciano's, with plenty of seating and a nice bar by the front with several large televisions. I went ahead and ordered a personal 9' pizza as it seemed to be their signature. I got the 'Luciano Pizza' which is topped with prosciutto, mushrooms, grilled onions, fresh mozzarella, basil, and tomato sauce. It was even larger than I anticipated. This and a small fountain beverage cost me only $9. Very affordable, especially for the city. I was extremely satisfied. In fact it was the best pizza I had in quite some time. This particular pizza might be a little spicy for the average eater, but not for me. \n    In finality, my trip to Luciano's was sublime. It probably earns 4.3 stars from me, but I saw that it currently has a 2.5 star rating which is ludicrous. 5 stars.", "author": "Larry S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-02-20", "description": "The staff here are EXTREMELY RUDE!!! I ordered a pizza from there, but neglected to mention that I did not want tomato sauce on my pizza. I know and admitted that this was 100% my fault, however the manner in which the owner/manager handled the situation was the most horrifying. I've never been spoken to so rudely in my life, EVER!! He was so fired up, that he aggressively yelled at another customer that had nothing to do with the situation, he didn't take the time to find out which one of us had the issue with the pizza before he started flipping off at the mouth. Once he found out who the person was, he basically said I was an idiot and have no common sense!\n\nThe food here is definitely not that good enough for me to have to subject myself such deplorable service, and such disgusting behavior or lack thereof -_-. Luciano's has seen the last of my money", "author": "Michael M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-01-10", "description": "I have been to Luciano's a few times and was surprised to see their rating at only 2.5 stars. The ambiance of this restaurant is impressive to say the least and the food was even better.\n\nTypically, I come here for lunch because they serve personal pizzas and a small soda for under $10. They have over 15 different types of pizza, a personalized pasta station, and a counter to make a hot dish. \n\nThis restaurant would also be ideal for business meetings or corporate get togethers as the prices are more than fair and there is easy access to the bar. \n\nI would definitely recommend any of the personal pizzas as it is the best item on the menu for the lowest price.", "author": "Dom P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-06", "description": "Good place to go for lunch in downtown Brooklyn \nThey serve breakfast as well...though I have only frequented.\n\nLunch options: pasta - create your own or pick from the options. Create your own: pick a pasta, then sauce, then items. Extra $2 per additional item.\nThey have paninis, pizza and salads as well. Pick from the selections. Variety of drink options as well.\n\nFresh made pastas are good. Would recommend sharing a personal pizza and panini unless you are hungry and take the rest home / save for later.\nGrilled chicken and the chicken parm paninis are two of the ones I have tried and they are good.  No matter what you select the food is good so you can't do wrong. \n\nThey also have a bar for after hour drinks.", "author": "Winny L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-02-02", "description": "So I was hungry and decided to give this place a try since it was the closest to my job that day. What a mistake! I knew by looking at the pictures that the pizza could not possibly have been all that good, but I tried it anyway. The dough is so bland, and the sauce tastes really off. The pepperoni was bad also. It just tasted like a really bad version of cafeteria pizza. I wouldn't go here again and wouldn't recommend it.", "author": "Cyn C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-05", "description": "Lucianos has been my co-workers go to lunch stop within Metro Tech.  They have such a wide variety of options including speicality pizza, a full pasta bar, sandwhiches, and a build your own salad.\n\nEverything at Lucianos is fairly cheap especially when compared to everything in the area.  A full personal pizza is $8 including a drink!  The salads I usually get range from $8 - $11.  Pasta bar also has great prices.  \n\nMy favorite things here are the spinach raviolis in pink sauce and the salads.  I'll usually get my spinach raviolis with chicken.  The salads are great, with so many options you can have an entirely different salad every time for a great price.  \n\nFor decent food at an affordable price, Lucianos is a go to!", "author": "Joe G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-04-12", "description": "This restaurant has been part of my lunch rotation since I started working in Metrotech Center in 2006. Through the years their prices have gone way up, its insane to pay $16 for a salad, to go. Food is okay, not the best I've ever had but good for the convenience of walking from next door. Today, I made a special request to have just shrimp, spinach and mushrooms in cream sauce, minus the pasta... that's minus the pasta, less food... My \"special price\" was $16.50, per the manager after the worker consulted with him, of course before tax. I was not looking for a heaping helping mind you, just toppings you would normally get mixed with the pasta. The special they had for the day which had shrimp was only $13.50. He is out of his damn mind thinking I would pay that much, its insulting. The puss of his face when I looked at him while he peered in from the back watching the exchange between me and the server showed he really couldn't care less. After 13 years of being a patron at this establishment, today was the last day. Good luck staying in business!", "author": "Marisa G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-15", "description": "Luchiano's is probably one of the nastiest restaurants that my wife and I have a been to ever been to we wanted to share a meal as my wife is not feeling well and they had the nerve to say no I have worked with Fdny for 31+ years they have a lot of nerve that should be ashamed of themselves", "author": "Bruce S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-24", "description": "I work in metrotech center and Luciano's is a staple in my coworker's and my lunch rotation.  The food there is consistently good and pretty fairly priced--you can get a large bowl of pasta for $11 or a pizza for $8-10.  \nI usually go for the spinach ravioli or the #4 sandwich.  All the pasta is made to order and you can add whatever meat or vegetable options you would like.  The spinach ravioli comes with a pink sauce, which is delicious and I always soak up the remaining sauce with the piece of bread that they give you. \nThey have a panini station and there are two vegetarian options, the one I go for is the #4--it has tomato, mozzarella, avocado, roasted red peppers and is delightful.  \nMy coworker always goes for the personal pizza and I've had it a few times and it's also very good, pretty oily, but very good.  It doesn't note it anywhere, but all of the pizzas that aren't the plain cheese option come with a small fountain drink, so that's a bonus.", "author": "Liz F."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-09-22", "description": "I took off 1 Star Simply because the day time crew that makes breakfast are RUDE. If you don't speak Spanish the main guy taking your older won't even acknowledge you.  There are times when you're waiting on line and he Actually looks past you and take some one else's order. Often times your order is wrong. (There's No Such Thing As Customer's Always Right) instead the Man that took your order or the Man on the grill will look at you like you're stupid when you let them know that the order was incorrect.(NEVER APOLOGETIC)  Why keep coming here for over a decade? Simple. I work extremely close and a lot of times this is the spot to grab something quick. I wish there were more affordable options with seating in that area but unfortunately I'm stuck with dealing with poor service. Lunch crew and food  however is better.", "author": "Rashawne H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-02-04", "description": "The owner is so rude. Four of my friends bought meals in Luciano's but I opted for a salad next door. When I went to sit and eat with my four friends who purchased food there, the owner kicked me out because I had outside food. He did not care that I was with a group of other people who had bought his food. When I came back to sit with my friends and buy a drink, there was a $6.00 minimum credit charge. No exception.", "author": "Lisa C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-09-26", "description": "Food is decent. Staff is rude and act as if you're a vagrant at a food pantry. The staffers get orders wrong and barely speak English.", "author": "Jay M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-04-19", "description": "Fine for a drink if you're in the area.\n\nThe good: We paid $5 per glass of wine. It's relatively quiet, so you can have a conversation during happy hour. They give out leftover pizzas at the end of the night, and the guy next to us offered us a few slices (we weren't offered a pizza, but he was). The space is huge and you can find a cozy spot at the bar or at a table.\n\nThe bad: The bartender was an amateur. He served my friend--who I arrived with!--then decided to acknowledge me. Any bartender with a clue serves a pair or group together. We never saw a bar menu, but he could barely remember the wines. He never made eye contact. He played a weird tv show about former ultimate fighters who peed on each other (no joke) on the big screen. \n\nThe ugly: The staff clearly don't care at the end of the night. No one paid attention to the bathroom and they ran out of toilet paper hours before closing. Which happens, but if you can't get the bartender's attention, how do you correct the situation?", "author": "Jess P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-01-14", "description": "The food is okay, but watch out their pricing! They overcharge you if you use Seamless or Grubhub. They're obviously trying to make up what they lose in commission to online services. Just an example: a personal pie in the store is $7. Through the app, it's $8 (EVEN IF YOU'RE PICKING UP!) It's just frustrating to get overcharged for not ordering and waiting around in person.", "author": "Carolyn H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-01-11", "description": "Me and colleagues at work like their Margarita Pizza so much and from past few weeks we are being disappointed with their quality of food. The pizza was dry, dough not cooked very well. Not enough sauce and no cheese on one slice. It usually has basil in that but basil was missing and too much salt. They are going down on quality. It had some green stuff in between god knows what was that. Didn't look like basil leaf anyway. Worst choice we made for lunch!! It may be the lunch time crisis but was not really happy with our choice.", "author": "Peridot J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-14", "description": "This a great place , the servings are pretty full, the prices are very accessible next to the anothers food places, they try very hard to please all the huge amount of customers that goes there in a daily basis, the pastas, the pizza, the paninis and the salads are delicious, So if you are in the area visits this place, you wont regret it", "author": "Jorge M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-03", "description": "The thing with Luciano's is that it's a quick option in the MetroTech area. Sure there's a lot of food options in the vicinity, but if you want to get something decent for lunch but is also pressed for time or don't actually want to venture far because you're starving, this is a great place. This is also an awesome option to have lunch with colleagues that also work in the MetroTech area and not having to worry about walking far back to the office. In other words, it's perfect for lazy people like me!\n\nYou can either order you food to go or you can have a sit down meal. The portions are pretty big; however, the food is hit and miss. I've had great veal parm here and I've had not so great ones. I recently had the tortellini for a change and it was average. The bolognese sauce was decent but the tortellini seemed to be overcooked.", "author": "Nilsa L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-08-23", "description": "The manager here is rude and condescending. Today we joined our friends who were eating here and he threw a big stink about us having food from outside. Food which we already finished by that time and the restaurant was nearly empty. We also had literally eaten in his establishment yesterday. \n\nHe is on a complete power trip, he told (yelled) at us about how he's been here for 13 years and informed us he doesn't care that he is providing a bad customer experience or that we will relate this poor experience to the rest of our company in the building. \n\nGenerally not a big fan of their food either, super greasy!\nWhen I ordered pizza for the whole team once, they made it seem like we were bothering them putting together an order for multiple pies (because they can only make personal pies, and let's be honest not actual Italian pizza pies). Unreal. Might be time for a change in management here to be honest. Hope this helps!", "author": "Cat S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-06-20", "description": "Sooooo I Come To This Place Every Morning For Breakfast And Lunch And They Normally Do A Good Job But RECENTLY My Goodness They've Been Doing An ABSOLUTELY HORRIBLE JOB!!! The Guy In The Morning Who Takes The Orders For Breakfast Is The Worst!!! He Doesn't Remember Anything And Then Wants To Be Upset When You Correct Him On His Fault...You're Clearly Not Paying Attention Why Get Mad At The Customer?! If You Can't Remember Anything Within That Gap Of Me Telling You Maybe You Should Start Using Pen And Paper!!! He Shakes His Head/Makes Faces And Talks In Spanish Not Knowing I Understand He's Talking About Me...Again Its Not My Fault IT's YOUUUU!! The Bacon I've Been Receiving Recently Has Been Burnt..Very Disgusting(and I love bacon)!! And For Lunch Today The Pasta Guy Was Simply The Worst!! I Told Him Everything I Wanted In My Pasta And He Forgot Most Of What I Said \n-_- I Told Another Guy Who Was Working With Him And He Turned Around Yelling At Me Saying WHAT?!? And I Told Him To Add Whatever The Guy Didn't Add In And The Other Guy Got A Bit Upset And When He Finished Making My Food I Got No Cheese Still And He Decided To Act Like I Told Him Nothing About That When I Definitely Did!!!!!He Tried To Explain Himself But At That Point I Was Annoyed And I Just Took My Stuff..Paid...And Got The Hell Outta There!!! Luciano's You Suck Now I Won't Be Returning!!!!!!", "author": "Imani G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-02-01", "description": "Went in to grab some lunch.. decided to grab a pint of Guinness while i waited. The bartender began pouring it and left it unattended to make change for another customer leaving the beer overflowing then laughed about it. Wanted to pay with card but it was supposedly a 10 dollar minimum which i never experienced before. Pretty bad experience. The bartenders clearly need training.", "author": "Tahrik F."}], "servesCuisine": "Italian", "priceRange": "$11-30", "name": "Luciano’s", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "15 Metrotech Ctr", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/mHLzp2ppLVKalbfpqIaH4g/ls.jpg", "@type": "Restaurant", "telephone": "+17188556668"}