{"aggregateRating": {"reviewCount": 103, "@type": "AggregateRating", "ratingValue": 2.5}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-11-28", "description": "We call this place 'Lucky Luke's' aware that it changes it from an Italian to Irish sounding place, but never-the-less. It's a good spot for lunch during the week. It's way better than it's surrounding Metro Tech eateries. Salad bar, pasta bar, paninis and pizzas. Serves booze too but the only people I see drinking when I go in for lunch once in a while are the firemen. \n\nIt attracts the office crowd and nearby workers so lotsa firemen and cubicle dwellers in here. Gets pretty crowded during lunch and can be intimidating since there are lines everywhere and people waiting for whatever they ordered to finish. Though there seems to be a method in the madness and the employees are good at recognizing who has what and I've never had an order messed up or anything like that. \n\nFood can be a little heavy, with the exception of the salads (which are really good). I typically shy away from the pastas, but the pizzas are tasty and the paninis as well. For the area, which is pretty poor with culinary options, this is a good bet.", "author": "Jim C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-25", "description": "Jim C must be looking at a different bar. The only people I see at the bar at lucianos are executives and construction workers. There are barstool tables that a lot of people including firefighters sit that are in close proximity to the bar, but that has more to do with not enough tables.\n\nThe best thing about lucianos is the food. Very good Italian with huge portions. And probably THE cleanest food establismemt around MetroTech. Pricing is slightly high however, I'd rather pay a \" little more than I expected than less than I should have\".\n\n9/10 if you ask me. They also do breakfast as well.", "author": "Ed P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-11-08", "description": "Good food, but the staff don't appear to change their gloves too much.  I've seen them many times putting their gloved hands in their pockets, through their hair, and wiping down counters, without changing the gloves.  Not too appetizing.  Please review health standards.", "author": "j i."}], "servesCuisine": "Italian", "priceRange": "$11-30", "name": "Luciano’s", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "15 Metrotech Ctr", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/mHLzp2ppLVKalbfpqIaH4g/ls.jpg", "@type": "Restaurant", "telephone": "+17188556668"}