{"aggregateRating": {"reviewCount": 103, "@type": "AggregateRating", "ratingValue": 2.5}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-10-21", "description": "Guide to ordering pizza at Luciano's on a rainy day. \n\nStep 1 - Walk straight to the back register and immediately make eye contact with the person working the register. \n\nStep 2 - Let them know you would like to order pizza and give them your order. \n\nStep 3 - Pay for your pizza. \n\nStep 4 - Wait for your pizza. \n\nStep 5 - Repeat step 4. \n\nStep 6 - Repeat steps 4 \u0026 5. \n\nStep 7 - Check the time. \n\nStep 8 - Speak with a manager about getting a refund. \n\nStep 9 - Get your refund and enjoy the rest of your lunch knowing you just wasted 45 minutes of your life that you will never get back. \n\nThank you Luciano's. I hope tomorrow isn't raining.", "author": "OM B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-20", "description": "If you are ever spending a day in downtown Brooklyn and want to avoid the typical fast food stops, Luciano's is that place you should hit up...FRESH Italian foods, sandwiches and pizza's made on the spot. And not to mention the pizza here IMO is some of the best in the city.\n\nDefinitely come here if you want some inexpensive Italian food and avoid the typical fattening fast  foods.", "author": "Jay L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-06", "description": "I work for a law firm in Westchester and I had meetings in downtown Brooklyn all week. I asked some colleagues where to eat and they said try Luciano's. I went there on Monday and tried their paninis, had the Luciano's cheesesteak. It was amazing, they took raw beef sautéed it with onions and hot peppers on a grill in front of me topped it with provolone and put it on a fresh hero. So I came back on Tuesday to try their pasta bar. I tried the penne 4 cheese alfredo, also prepared at saute station in front of me. It didn't disappoint, creamy and cheesy, flavorful ad hot. Wednesday had the Hawaiian pizza, bacon pineapples and sautéed onions, delicious. With so many choices why go elsewhere. Thursday we were going to work late so we ate on the waiter service side. I had the chicken parmigiana with a side penne tomato. It was huge, crispy, tender and the sauce was great. We ended with some espresso and the manager brought us some chocolate dipped almond biscotti to go with it. NICE! We finished our work early and wouldn't be coming in Friday so we decided to have a drink, where else Luciano's. My co workers had beer, they have a large selection 4 on tap and about 10-12 in bottles. I wanted a cocktail and the bartender (a good looking young man who was also our waiter at lunch) suggested the Angel's rum punch. I think it had 5 different rums in it. It was wonderful and the manager brought out free pizzas!! If you work at the metrotech center you have it made at Luciano's", "author": "Gina M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-05-31", "description": "This place has the worst service ever. They never get your order write, they are rude, and the food is horrible. I tried numerous times with this place and they never get it right. Save your money and go to ladefense.", "author": "Nizka L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-10-11", "description": "Located in the heart of Metro Tech Commons, Luciano's is the closest restaurant to grab a quick meal.  I gave  them 1 star for location.  The owner is a complete nasty rude individual, and it's no wonder why the service and staff is equally as rude!\nMost people find other restaurants to patronize if they have a few minutes to go further.  \nToday, my eggs were \"perfect\" because I insisted, that the toast guy took them off the grill! Eggs over medium (they never understand the concept), are always over cooked! The toast guy who turns out to be the manager, called me a MaMao (Spanish word for stupid) as he .aggresively threw my toast on the dish! \nAfter speaking to Mike the owner, he basically defended the cook staff, getting very loud with me, stating not to get the eggs anymore, if they're never done right.  He proceeded to say \"it's insulting to tell them how to cook\"!  He was even more condescending to me, than being called a MaMao by his toast guy/manager! \nI won't ever give another penny to Luciano's in Metro Tech, for the rude staff, disgusting \nowner, and sloppy short order cooks!\nGo Out Of Business already!!!", "author": "Starr S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-05-22", "description": "To James S: \n\nFirstly, the food leaves much to be desired. It gives little reprieve to the hungry or someone desiring an enjoyable meal. Hopefully they improve their menu and the cooking staff. However,   Yet my real purpose here is to warn others of the absolutely unacceptable and boarder-line abusive  \"service\" one receives from the staff at Luciano's.  If you go here be prepared to wait and to possible by treated badly. \n\nIn scrolling through the reviews posted, there are much fewer reviews about the mediocre food and atmosphere at this spot than those of the poor customer service one receives at this establishment.  \n\nI went to the spot with a group of friends after work yesterday and the \"owner\" as he introduced himself of the establishment approached us in the least tactful way any restaurant staff  could. The seating arrangement that Luciano's organized caused a portion of the chair to poke into the isle-way, but still left ample room for one to pass. \n\nWhat grinds my gears is the audacity of the \"owner\" as he felt the need to identify himself as rudely TOLD me \" You gotta move that chair in\". In as establishment where you are paying for service, no one should be told they \"gotta\" do anything - other than pay for their meal of course. \n\nJames S - you should get your facts together before posting publicly - using abusive language: calling patrons of your work place \"clowns\" and suggesting that they were more suited for \"Chipotle\", makes you sound foolish and yes racist!. \n\nYou were no where near the table to know what was going one, since you \"our waiter\"  who never showed up for some 15 mins after were had already sat down ( which by the way... there was not one greeting and asking if you would like to be seated).  You went to get water and was gone another 15 mins without saying a word to the our table. There was 1 order of hot water. They others were regular water. So I find is hard to understand why you would take so long to get back to us, since one one even ordered cocktails . \n\nAttacking your customer in a public forum, like your boss also did, only goes to show the kind of service you provide and the lack of respect you have for people who patronize your establishment. Even in taking our order your attitude was curt.I often wonder why folks like you ever go into service positions if thats not what you want to do with your life. \n\nThey fact that establishments can treat paying customers this way in 2015 shows the prejudice and mediocrity is alive and well. The height of the evening was when we decided to leave and the \"boss\" refused to return Lisa M's ( see review) credit card and threatened to charge us for food we never received and probably had not even getting ordered in the kitchen as yet, judging by how long it took you to get the water, which never came. \n\nTo James S - I hope that you learn better customer service and your establishment makes some changes because you will see a lot more of these kinds of reviews before your business is sanctioned by the BBB.", "author": "Atiba T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-09", "description": "Been here a few times and the portions are generous.   The sit in area is on the left and the take out is on the right. I once ordered two pies and shared it with 3 others and it was good.   Came out to be 4 bucks a person and we we're all full.. Might not be enuff if it's a guy.  The calamari is good and the chicken parm is good.   So far I haven't been disappointed with any of the dishes I've tried.  I find the prices a bit high but I take it as a treat.   Around 15 bucks for lunch.", "author": "Olivia C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-10", "description": "Awesome for a fast and easy lunch! Got a personal sized pepperoni pizza which was still huge. Definitely taking the leftovers with me ! The line moved quick and easy. Pizza tastes good can't complain for a lunch under $10 in downtown Brooklyn !", "author": "Melissa W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-09-15", "description": "Came during lunch time for the first time and it was very confusing. Didn't know who was ordering, which lines they were in and then people were just standing not knowing what to do. I order the American panini and it was not bad just wasn't sure if it was mine or someone elses. All they did was call out the number of the panini (not an orser number but the panini number on the board) and not a customers name. Again, the food wasn't bad but the ordering, paying and getting your food was a mess.", "author": "Andronico R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-03-24", "description": "The food is not bad, just the service.  Do not come here if they have more than 10 customers in the restaurant, you will not get your meal.  I came to this restaurant with two of my co workers for lunch and I never received my meal.  I only order pasta.  My other two co workers received their meals  and I waited for 45 minutes and I am still waiting.  Even the other waitress asked what did I order.  I asked two times and no one had a clue about my meal.  I kindly told the waiter just forget it my lunch hour is over.  Instead of the manager coming over to apologize, he told me because I came in after my other two coworkers I had to wait.  FYI- We all came in at the same time and I actually ordered first.   \n\nBecause of his attitude, the company's social gathering and holiday will no longer be there.   Been coming here faithfully, but not anymore.", "author": "Roslyn S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-08", "description": "Had to go to Metro Tech Plaza in Brooklyn on Friday, but got there early and had time for lunch. Thought I would try Luciano's. Best decision I made all day. I tried the build your own hot pasta dish for lunch. I had penne past with pesto sauce, fresh spinach, broccoli, and chicken breast. The dish was full of flavor and the smell was amazing. The dish comes with a piece of Italian bread which came in handy for dipping in the pesto when the lunch was done. The only down side about the dish was the large amount of salt in it. The resturant has great ambiance. I found window seating and enjoyed my meal while listening to a rock and roll music playing in the back round.", "author": "Josh R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-02-02", "description": "I went here with a bunch of coworkers and together we spent over 150$ during happy hour tonight. The place advertises free pizza during happy hour so we asked a gentleman serving the pizza, he seemed to be the manager, and he denied us even one slice stating he saw us here and didn't see us drinking at all. I literally had a drink in my hand but he continued to condescend us and deny us pizza. However, he didn't trust us and only when he asked the bartenders, who we tipped extremely well, he came back and eventually gave us a pie. He did not apologize at all for being rude to us. You would think that the customer comes first in a place that is supposedly dedicated to good service but this was not the case. We as people who work in the metrotech area come here for lunch on a regular basis. But after being treated with no respect from a manager of sorts, and even being told that we \"should run the business since we know so much\" is condescending and rude. I really did enjoy my time there other than being talked own to by the manager is unacceptable and unprofessional. I don't recommend this place to anyone given that there are so many other better Italian places in new york.", "author": "Olivia C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-08-16", "description": "Morning breakfast is served at such a glacial pace, that one should consider themselves fortunate if they were able to obtain their order within 30 mins.  There is a constant inconsistency during the lunch hour of menu pricing and order placement that makes this restaurant unbearable to withstand for future visits.  The pasta and breakfast are  provided in satisfying portions, that are enjoyable,once received through the hurricane of service.", "author": "Porcha H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-02-06", "description": "I should preface my review with saying that the food alone would receive a 2 to 3 star rating. Do not walk in expecting a gourmet Italian meal, I know and enjoy well done Italian cuisine but this was just fine for a lunch close to work- you get what you expect in the quality department.\n\nMy bone to pick is with the staff. As a group of 12, we made a reservation for 1 o'clock, with a possible arrival time of 1:02 or 1:03. We sat almost immediately and were given two menus. After waiting 5 minutes or so we asked to put in drinks- at which point we requested to order our meals. The waitress told us to \"hold on.\" Ten minutes later the drinks arrived and five minutes after we ordered. \n\nIt is now 1:55PM, and many of the colleagues at lunch are support staff without the flexibility of returning late to the office. After being in an establishment that only caters to a lunch crowd for over 50 minutes I was outraged when the waitresses became annoyed at our party for requesting the food to go.\n\nA few of us stayed back to take all of the orders at around 2:10/2:15. With mediocre food, an absurd wait time and a rude waitress and manager I refuse to give them business again. I wouldn't sit in Peter Luger's for over an hour without food- I'm certainly not going to do so in an establishment whose sole purpose is to serve a midday office crowd.", "author": "Alexandra G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-09", "description": "I've only been here once but I am a fan. The dishes are huge and fresh and reasonably priced. How can you beat that? You can't! I ordered the chicken penne pasta. The sauce was delicious the chicken was tender and they gave me enough food to have it for lunch again the next day. Definitely give this place a try!", "author": "Cin C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-27", "description": "The only bad thing I can say about Luciano's is the way they have the ordering and paying system set-up.  You can never tell who is on line for what.\n\nI also don't like that they have a credit card minimum.  The amount of volume they do should more than make up for that.  \n\nThere is one really annoying guy that eats here all the time.  He follows the owner around like a lost puppy.  He thinks he is the Godfather of Luciano's.  \n\nAnyway, now the great stuff.  The staff here is awesome.  Even though it always insanely busy they take the time to smile and make sure they get your order right.  The pasta bar is incredible.  The personal pizzas are always good and they actually have the best breakfast nearby.   And last but not least, the cashiers, very nice and very beautiful.  Don't blush now girls.", "author": "Johnny F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-28", "description": "This place is great!  Most of the week, I work near Luciano's and come here for lunch.  They have soups, salads, paninis, pizzas and a made-to-order pasta bar.\n\nI always get pasta but customize the heck out of it.  You can choose your pasta, sauce and toppings.  A favorite of mine goes a little something like penne-creamy alfredo-grilled chicken-mushrooms-garlic.  So good.  Portions are huge too so if you want, you can take part of it home.\n\nThe people that work here are very friendly and become your lunchtime Italian family.  Mr. Luciano usually works the lunch rush and we joke around with him all the time.\n\nThe after-work happy hour scene here is struggling at the moment as there aren't too many people that", "author": "Ray M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-16", "description": "I love eating at Luciano's.  Laid back atmosphere and the food is always great.", "author": "Michelle F."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-06-02", "description": "DO NOT EAT AT LUCIANO'S.  If there was ever a restaurant to boycott in this area, it would be Luciano's just on the basis on how amazingly nasty and inconsiderate the owner is toward customers.  I have never had to do something like this and write a review about a place on how I was treated, but this could not go unheard...... After they attempted to charge me $14 for a vegetable panini (No cheese, no meat, ONLY VEGETABLES) I politely brought it to the owners attention and he quickly became aggressive with me, yelling how \"this is how he runs his business\", \"he does not negotiate with customers!\" and slammed the sandwich down on the counter.  Trying to explain to him how he can have a sandwich on the menu that has three imported meats from Italy, cheese and dressing only costs $10, but dare you ask for onions, peppers, and zucchini on a piece of bread for the same price or even less, no, that's going to run you $14!! Doesn't make sense.  He even become more aggravated and verbally pushed me out the door.  So I left, to go around the corner to get the SAME EXACT SANDWICH for only $8.  Brought the sandwich back to Luciano's I purchased to show him how exactly business works and how he lost some.  After reading some of the other reviews here I found it astounding the overall negative consistency customers have experienced with this guy.  Anyone know of other sites we can bring attention to this matter or even file a complaint?", "author": "John V."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-02-28", "description": "Soooo.. I go to Lucianos maybe 3-5 times out of my work week.. sometimes twice a day ... the service is slow .. Leo can't take an order properly and  when I come in here they make me feel as if it's a privilege to be served amongst the others.. although the food is great I will be limiting my visits ... I'm over it ...", "author": "Desiree S."}], "servesCuisine": "Italian", "priceRange": "$11-30", "name": "Luciano’s", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "15 Metrotech Ctr", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/mHLzp2ppLVKalbfpqIaH4g/ls.jpg", "@type": "Restaurant", "telephone": "+17188556668"}