{"aggregateRating": {"reviewCount": 9, "@type": "AggregateRating", "ratingValue": 5.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-20", "description": "I recently got back from Bangkok and have been binging Netflix's new \"Street Food.\" It's left me wondering... why is NYC stuck in the perpetual halal / hot dogs/ Nuts4Nuts? Why don't we have more diverse street food?\n\nWell, there's probably a reason. But, I was lucky enough to discover Thai on Wheels.\n\nThai on wheels has all the basic noodle necessities you'd be craving. They had Tom Yum and Tom Kha soups, Pad Thai (yes, pad Thai is authentic), Pad See Ew, Kua Gai (what I had), Basil Fried Rice, curry options, and more protein focused over rice. I read from other Yelpers the chicken garlic sauce over rice is delicious!\n\nThe only thing I wish Thai on Wheels carried was papaya salad... but hey. I'm glad this little cart is around. Period.\n\nIf you're in the area and walking by this cart, definitely stop over and try some of their noods. Order extra and save in the fridge - that's what I did and zero regrets!", "author": "Katey G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-06", "description": "So freaking good. Love they have Tofu as an option! I've had 5 orders from them and referred 15 of my peers. We just keep going back! Love the Tofu Pad See Ew and Tofu Pad Kee Mao. \n\nFor meals w/ chicken--the Chicken Garlic Sauce over rice is A HIT! Pineapple Fried Rice is banging too! \n\nThe Pad Thai honestly wasn't my favorite as it wasn't seasoned at the bottom but shake it up a little, seasoning from the top makes its way down. \n\nPeanut Curry w/ rice is a smaller serving than others, but good too! \n\nI call before I walk over, and my meal is ready when I arrive. Only thing--cash only \n\nVery happy customer!", "author": "Nyesha D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-06", "description": "I walk by this street every day as I work in the area. \nToday for the first time I saw this food stand, I was very early, I was not satisfied with the lunch I had, I needed some comfort food, even just a bite, before work, and the cart says Thai food.... so Yessssss! \nAnd I love leftovers so - if any - I will finish it tonight. \n\nThe guy is super nice, his \"kitchen\" looked super clean and when I asked what kind of noodle he would suggest, he said the Kua Gai. \nPerfect, I wanted flat noodles and not much sauce. \nThis one is like, for us Italians, Spaghetti Aglio Olio e Peperoncino! \nI like that it was a clean taste, spicy enough but not overwhelming (just tell him how spicy you want it) simple and well made. No sauce. \nI added shrimps but they have tofu, beef or chicken options too. \nThe guy is new here , just a couple of days he said.\nOpen from 10.30am to 5pm but not sure is 7/7 or if he is here in Weekends too... I will ask him !", "author": "Gessica D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-29", "description": "Tried Thai on Wheels today, passed it by chance. Possibly the best food cart in NYC. Fantastic food and quick and friendly service. The pad see ew was great and I'll be back soon to try the pad Thai", "author": "Jane W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-03-26", "description": "Gotta start off by saying, this is a great idea and there should be more of these. Someone took your average halal cart but instead they serve a variety of Thai dishes. The guy was super nice, handed me a little cut out menu, asked how spicy I wanted my food. Basically did everything to make sure my food was exactly how I wanted it. I ended up getting the chicken dumplings and the pad see ew with chicken. The dumplings were pretty nice but the sauce they came with stood out more, had a nice kick to it! The pad see ew (a dish I love but hadn't had in a while as places tend to make it way super greasy with no flavor) was SO GOOD! The noodles had a ton going on and there was a great ratio of chicken, egg and Chinese broccoli. The dumplings were $5 and the pad see ew $8. The dumplings may not have been the best I've ever had but they more than hit the spot and the pad see ew, again, was great. Much better than some of the Thai restaurants in the area that are way more expensive.", "author": "Adam L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-14", "description": "AMAZING, AMAZING food! These women ROCKED IT! I am so glad that they are here in downtown Brooklyn and I hope they never leave us -- unless they plan to open a restaurant which I would totally support.\n\nI just finished eating the GOYZA and it was delicious. I am now I am devouring the Pad Thai with chicken and the Thai Ice Tea. \n\nI have just found my new lunchtime \"home\". Thank you, ladies! This was a wonderful treat.", "author": "Terri S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-14", "description": "This became my go to place. I've never seen a Thai food truck around where i work. I tried the beef pad thai before. It was amazing. This time I got the shrimp pad kee mao. Everything was better than expected.  I will definitely go back again.", "author": "Mai P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-19", "description": "Amazingly Good Food!\nExcellent service, and a wonderful attitude, each time. \nModerate prices \u0026 definitely a great spot to stop by for lunch.", "author": "Christeen E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-23", "description": "Had the tofu pad kee May ($7). The tofu was tender and absorbed the flavor, noodles were just the right level of spice. Will definitely come back!", "author": "Angela W."}], "servesCuisine": "Thai", "priceRange": null, "name": "Thai on Wheels", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "172 Montague St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/Lei0cCX25s4gZ6I3JID2gg/ls.jpg", "@type": "Restaurant", "telephone": "+19177026055"}