{"aggregateRating": {"reviewCount": 41, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-10-06", "description": "I've tried this location 4 times. Very unprofessional. The front workers need training on customer service. So far in my experience, they all have bad attitudes. I'm not puttin down on their jobs, but them in general. If they don't want to be in customer service, find another job. They roll their eyes, suck their teeth, turn their back on you and snicker, laugh, or making fun to another employee. I've tried the location at Court St., Bklyn. It's a little better. Everything is overpriced. I can get same size soup and salads for cheaper at Panera or local grocer/deli market. I go there only because they sometimes have varieties of soup I want to try.", "author": "Pui C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-04-18", "description": "The Customer service at this location is horrific. I eat at this restaurant often because it's across the street from my job but I won't be visiting any longer. The food is great but the employees that work there don't seem to care about anything else besides their personal conversations. The first time I was ignored while waiting for a salad I thought it was a one time thing but over the weeks it's gotten worse. There have been times where there are 3-4 employees staring directly at me, nobody else but me in the restaurant and they pretend I'm not there. I recommend walking a little to the other location on court street , it's usually a little busy but you won't get ignored.", "author": "Stephanie D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-16", "description": "When all else fails, Hale \u0026 Hearty!! \n\nNot feeling like a big, juicy, greezy Five Guys burger? Long lines at Chipotle got ya feeling sad? Au Bon Pain...well, it's Au Bon Pain.\n\nNever fear, Hale \u0026 Hearty to the rescue! They split this up into three lines. Salads, Soup and sandwiches. But don't worry, if you want soup and a sandwich or salad you can do that. Just get your soup first as that's usually the longest line. \n\nEvery time I see the Curried shrimp and corn chowder on the menu I Twerk a little before I order. That's how good it is. There are normally about 7 or 8 different sandwiches/wraps to choose from and you have your choice of half or whole sandwich. \n\nI won't say it's \"pricey\" because everything in this area hits your wallet kind of hard. \n\nAll in all this is a nice spot to get a good lunch.", "author": "Johnny F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-19", "description": "Lapin and I visit this location every so often as he lives close by.  The staff is very friendly and the store is usually pretty empty most of the times. Sad part is, most of the flavors are gone (when we usually visit) and they don't replenish it when it's late in the day.", "author": "Andie B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-16", "description": "My meal was $13 and change but it was a vegetarian's dream. I had three bean lentil chili (with bread), a half of mozzarella, tomato and basil sandwich with vinaigrette dressing, a dark chocolate chuck cookie and a diet coke. It was delicious. The soup was tasty and had a nice spice to it. It was chunky and hearty. The sandwich was fresh and had lots of cheese. They definitely didn't go short on the mozzarella. The atmosphere of the restaurant was nice. The staff was helpful and polite. And there was pleasant backround music playing. It was nicely lit. It wasnt too noisy or crowded. The seating area was neat and clean. It is my first visit to this restaurant and I would definitely return. Sure you pay a lot for what seems like just soup and a half a sandwich but when you want quality you will pay more than you would for a burger down the road I suppose. I choose this over Chipotle down the road (the other vegetarian alternative) with their food poisoning reports or an open Halal cart grill in the other direction. Definitely made the right decision.", "author": "Andrea K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-13", "description": "The service at this location is much much better than at the other ones, that I have to change my review to a much more positive one. The staff seems very well trained and even at the end of the night, which is usually when I go here, they are very professional. Much kudos to them!", "author": "Curtis J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-29", "description": "I love their soup, love their salads..we dont have them in CT so this is a must stop anytime im in NYC..last stop before I catch the train in Grand Central to go home is always Hale \u0026 Hearty", "author": "Jessica H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-04", "description": "The soup is good. I had tomato and basil. The line moves quickly and they allow you to sample the soup if you wish. It's pricy but hey its the Metrotech  Center. The tables are clean as well as the floors. The music is good and it's warm inside. Staff is quick and friendly. They have a great system system in place.", "author": "Kristofor N."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-09-06", "description": "The super actually delicious. They do tend to run out quickly of your favorite soup. However the customer service at this location is very blank. They are not friendly and they do not give you eye to eye contact. When they are serving you don't even know who they are talking to. I had to ask the girl 3 times who was making my salad to repeat herself. Then the cashier didn't smile 4 presented a friendly gesture.", "author": "Maylin S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-23", "description": "As good as any other Hale I've been to.  Lines move fast and the service is friendly.  The variety of soups is the same as others I've been to.  My favorites are any bisque and the corn chowder.", "author": "Stuart B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-10", "description": "I love H\u0026H soups.  I've been to this location a few times and the service is top notch.  Very friendly staff and did I say I love their soups.  The crackers that come with it are also very tasty as well.  The lack of a star is for the price...there soups are pricey $8-$9 for a large, but it's worth it in my opinion...", "author": "Tanya B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-20", "description": "I come here frequently because I live really really close by. The soup is so freshly made and the salad is fresh too. Whenever I want to eat something healthy but am too lazy to cook, I hit up this place. \nIn response to the other review, yeah the service isnt white glove service. I dont now if thats what you were expecting from a soup joint.. but Ive been here about a little over 10 times and never had anyone be overtly rude to me. They were always nice without over doing the niceness to waste my time with petty small talk.", "author": "Jane K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-20", "description": "I really love hale n heartys in generals. They can be a little on the Pricey side but I always like the salad options and their soups are also really good. They have a good soup and sandwich combo. Definitely a great spot to grab lunch or a quick dinner. My only complaint is that this location always is out of things when I go. Good for them for being busy but it's a little disappointing.", "author": "Brenna B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-01-13", "description": "I've been here about 3 times. In hopes of getting to really like these soups. But nope. Can't happen. I find their soups tasting terrible. Panera blows them away. Also, too expensive. I just tried the Chicken Tagine. Soup and a water cost me $14.75. Are they kidding me? Total disgrace. Will never go back to any Hale and Hearty.", "author": "Damian D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-06", "description": "During out time living in NYC, my husband and I became big Hale \u0026 Hearty fans. We love the variety of soups and the fact that they have so many locations. We've only been to this location once, but we found it very clean and the employees were pretty friendly. The location isn't very big, so we were worried we wouldn't find a place to sit, but even during the lunch rush, we easily found a table and enjoyed our meal.", "author": "Victoria K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-02-14", "description": "I have a child at NYU - Tandon who likes this place.  Stopped in today to pick up a gift card.  After waiting in line, when it was my turn I was told I'd need to wait.  Several people who came in after me were taken care of.  Although there were multiple people working behind the counter, more folks came in and there was no hope of getting that gift card.  \n\nSad, and empty-handed, I left.", "author": "S H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-07-09", "description": "Three stars for the overall restaurant because salads are not that fresh and varied and because they cannot heat sandwiches...but an FYI the three lentil chili is AMAZING! Combustion of spice and flavor in my mouth. Love it!!", "author": "S B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-04-20", "description": "I ordered a salad from here yesterday. I did a pick 5 and choose tofu and avocado , etc (NO MEAT) \u0026 after eating my salad for a few minutes a I bit on a big piece of bone ....... disgusting.", "author": "Lynn A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-01-08", "description": "If I could do negative stars I would. Received a salad from there yesterday and could not stop throwing up. 90 percent sure I got food poisoning. BEWARE!", "author": "Michael R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-10-05", "description": "This was probably the worst lobster bisq soup I've ever eaten - way to sweet and sugar tasting. Would get a one star, but service, location, and organization of the line were good.", "author": "M R."}], "servesCuisine": "Soup", "priceRange": "Under $10", "name": "Hale and Hearty Soups", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "2 MetroTech Center", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/tAvgE0d9hhGoYOVpqfX18w/ls.jpg", "@type": "Restaurant", "telephone": "+13478895258"}