{"aggregateRating": {"reviewCount": 41, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2019-05-17", "description": "The soups here are always hot and tasty.  The best deal downtown, medium soup, salad pairing and government discount comes out to $10.29.  A real bargain for downtown Brooklyn .  The staff there are always fast and efficient and they keep it very clean there.  The salads are always very fresh.", "author": "Bo B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-07", "description": "Sigh. I really should have just ordered from online and spare myself the misery of ruining my lunch break today. \n\nI came here after doing an errand run at TJ Max during my lunch break, eager to use my 10% off from Unidays (an app with discounts for college students) and to enjoy some Hale and Hearty which I normally don't order from unless I am recovering from a cold or craving for some hot soup. \n\nWhen I stepped into the store, the layout of the store was completely wrong. The register was on the left side, while the soup and salad bar was on the right. In order to order, I have to walk to the right then back to the register. Confusing. \n\nThere were three ladies behind the counter, and a customer in front of me. A male (which was the store manager), yelled at me to give him my order. I ordered a lobster bisque, and he proceed to yell at the lady next to him to make it. \n\nWhen it was time to pay, OH ALL HELL BROKE LOOSE. I have no patience nor tolerance for these incompetent individuals. I showed the lady my app for the student discount, and she proceed to ask me if I am from NYU. I understand that NYU is the local school there, and when I answered no she said there are no discounts available. I again, showed her Unidays the app again, this time asking her to read it. She then calls over her manager, same guy that yelled at her to make the food earlier and his exact words were, \"We only give discounts to state and federal schools.\" \n\nAt that point I was so done. I do not know why it had to be a hassle to redeem an discount from Unidays just because these stores that sign up to participate neglect to educate their workers. And to have to take the attitude and look of disbelief from these front house staff is unacceptable.  Fuck this shit. \n\nAlso - the lobster bisque had like tiny red sands which I assume were meant to be the \"lobster.\"", "author": "Jenny L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-09", "description": "The ordering is weird. One line for salads and one for soups/sandwich's. Can fill out a salad sheet while you wait to make the process faster when you get up to where they make it. \nI had the half soup half sandwich combo. The sriracha chicken was really good and the bread was fantastic. The clam chowder wasn't as thick as I've had it other places but, was tasty as well. They have an \"open faced\" pot pie that looked really good. \nWill be stopping here more as the temperature drops.", "author": "Scott B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-25", "description": "Pricey, but the quality of the food and the fact they deliver makes it an at-your-desk lunch worth ordering. The soup, salad, and/or sandwich combos (pick two) are the best section of the menu.", "author": "Colin C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-10-19", "description": "Very disappointed with this location. I ordered a soup on Wednesday for my evening class, I get to class at 7 starving and it's the wrong soup. Spoke with the manager on Friday and he says come in get a courtesy soup. He set aside my initial order since it was sold out by the time I got there, and that order was still wrong. HOW DO YOU PACK THE WRONG SOUP TWICE!!!!! Complete incompetence I will not be returning to this location ever!!!!", "author": "Stacy S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-11", "description": "Deal  price with perfect pair ,  have a lot choices of soup, nice salad bar  and good size ,  place very clean,  love it", "author": "Michelle L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-11-12", "description": "The staff at the salad bar are extremely unprofessional and should be better trained on how to handle food properly so that it does not look unsanitary to customers. A to-go container was being used to scoop that lettuce and was seen being thrown over a bed of lettuce as if it was being thrown into a pile of trash. Brought it to the attention to the manager and was not offered a solution nor did he agree that there was an issue. Whether the container was clean or not, nothing should be thrown onto the food that customers eat. Not a good look, and will not be returning to this branch.", "author": "Juliana C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-30", "description": "I love the soups here. My favorite is the macaroni and cheese with Beef. It's so yummy. The spinach artichoke and cheddar is also delicious as well as the lobster bisque. The best part about Hale and Hearty is you get points every time you buy something.", "author": "Denise Z M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-23", "description": "A really great selection of freshly made soups. The line moves fast at lunchtime, though it's not too busy if you get there on the early side. \n\nI only wish it was open later in the evening and on the weekends.", "author": "James D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-08", "description": "Love hale and hearty, this location has great service and lines generally move fast. Taking one star off because I've occasionally waited a while for a salad. During the winter months you can also have a long line for soups, but again, it moves pretty fast.\n\nBest part is you can pay with the Level Up app and you get $10 credit for every $100 you spend. Since I work right here it adds up fast. Super convenient that I don't have to even take my wallet!", "author": "Anvita S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-07", "description": "SALADS: OK if you are the first ten people of the day to order salad, any later than that and they'll get your order extremely wrong. Many toppings will be missing, dressings will be missing (and replaced without your permission), they'll prepare it the opposite way from what you asked, e.g. if you ask for dressing on the side, they will mix it in the salad instead and it will be the wrong dressing too. One time, I ordered a custom salad for pickup and later found out half of the toppings were missing and they threw in A LOT of some sour garbage dressing in it too (even though I asked for avocado dressing ON THE SIDE), ultimately I had one of the most disgusting salads I've ever tasted.\nSOUPS: the ones that are supposed to have fillings, such as shrimp, other seafood, or chicken, barely have anything in them aside from broth and some pieces of pasta (depending on the soup). And that doesn't stop them from being much more expensive than plain soups.\n\nUpdate - HH Customer Service sent me a gift card. I had to go to the store to use it (otherwise I wouldn't have gone there) and not only were the employees unhelpful and rude as always, they still got my order wrong and gave me a bad attitude when I pointed it out. The cashier lady even rolled her eyes and tried to charge me in full, completely disregarding what I was saying. But it's not my fault you are incompetent. Maybe do a better job next time and spare me from having to look at you make stupid faces at me.", "author": "Jules W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-12", "description": "I question why more soup places don't exist in this city. This is deliciously amazing. They've got their daily soups as well as everyday soups. Vegetarian friendly as well.", "author": "Priti R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-14", "description": "The krispy treat is a(n overpriced) standby for a sweet treat:\n\nTransaction Amount $2.54\nLevelUp Rewards $-2.00\nKRISPY TREAT $2.50\nOther* \n* tax or other one-off adjustments $2.04\nTotal Rewards -- $2.54\n$2 Credit -- $2.00\nGlobal Credit -- $0.54\nTotal Balance $0.00", "author": "George C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-03-15", "description": "This is a place that is often recommended by those who do not have food budgets. I finally decided to give this place a try, because it was the only place that could break hundreds. Unfortunately, they said they did not have change to break my hundred, and did not offer to use the other register. They just said, \"No one here uses cash\".\n\nThe layout of the store is a bit confusing, I think mainly because the signage was pointing in the wrong direction so numerous customers were getting confused. The line moved very quickly.\n\nThere is a very large selection of soups, all different types. However, the soup is VERY expensive. They give free bread with any size soup.\n\nHailing from New England, I decided to try the clam chowder. The soup is quite good, but wasn't the best I have had. The potatoes were slightly underdone and the soup was lacking clams. Additionally, the potatoes had failed to thicken the soup adequately as they were a bit under cooked. The soup has good flavor, with many green herbs and spices visible.\n\nOverall, the price is far to high for what you get and the taste isn't that great. I would recommend going elsewhere.", "author": "Joseph N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-03", "description": "I was very late to try this place but I actually like their soup. They are pricey; a small soup is approximately 6 dollars and compared to panera bread where the biggest size is around the same price it makes it less appealing.\n\nHowever, their options sometimes seem endless! I really enjoy autumn squash from panera but that is only seasonal whereas here it seems to stay around a lot longer. Its a lot richer and thicker but its pretty good. They also have an amazing new england clam chowder. I love that soup.\n\nThe best part is the oyster crackers that come with the soup, they are my favorite!", "author": "Amanda R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-30", "description": "Omg these soups are amazing my office orders from here all day I was hesitant at first but definitely worth trying. So far the lobster bisque is my favorite, it's very hearty and very filling the medium is a perfect size", "author": "Isadora D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-06-20", "description": "I wasn't feeling too well so I decided to grab a soup. I have had some terrible soups before, so when I tell you their vegetable chicken soup was bad I mean I threw it out after taken a sip, the noodles were way to soft almost doughy and the soup had absolutely no flavor, the salad was ok but i have had better. Overall the employees were really sweet and helpful but the food was expensive and below-par. I would give a 3.5 out of 5 but I cant", "author": "Rana M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-08-22", "description": "I really like this place a lot. I just wish that their staff could step it up a little bit and be a bit better; especially when you are checking out. Everyone seems a bit tired. If you are a City Employee - Make sure you flash your ID; you will get a small discount - which is very nice. Soups are really good and the bread is great; Again - something is missing. A bit pricey - I wish they would just give you a little more bang for your buck. But - I like this place.", "author": "Louis R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-05", "description": "This was was relatively less busy than other eateries during lunch time and surprisingly had seating available. I remember having tried H\u0026H once before at a midtown location and the soup quality was meh. But since I was in a hurry, I decided to give it another try. The soup menu is extensively -- much more so than what I remembered. A few caught my eye including the Winter Chicken Soup and the Corn Bisque, but I decided to go with the Wild Mushroom Risotto and a half turkey avocado and walnut pesto sandwich. I could really taste the seasoning and mushroom flavor in the soup but the risotto probably have sat too long and it was mushy making it more like Chinese congee. As for the sandwich, it could use a bit more meat, lettuce, and avocado in it, but the basic flavors are there. It just seems like with the price, there should be more stuff between the bread. \n\nMy coworker did have a bit of a problem with the cashier who insisted that my coworker gave her a $10 bill when it was a $20 bill; therefore, didn't give my coworker the appropriate change. The manager later on did a count-out of the cash register and found that it was $10 over and came over to the table to apologize and returned the $10 back. It's not a pleasant experience but the manager did her due diligence so, that is a good sign of responsible and good management. Given we are all human and make mistake particularly it was a busy lunch period.", "author": "Nilsa L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-11-01", "description": "Overpriced food for truly mediocre salads and terrible quality products. Good service but really not worth it.", "author": "Samantha P."}], "servesCuisine": "Soup", "priceRange": "Under $10", "name": "Hale and Hearty Soups", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "2 MetroTech Center", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/tAvgE0d9hhGoYOVpqfX18w/ls.jpg", "@type": "Restaurant", "telephone": "+13478895258"}