{"aggregateRating": {"reviewCount": 458, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-10", "description": "Had a nice brunch here a few weeks back.  Must've been a lull after the main rush, so we were seated quickly.  Food was good and the atmosphere was nice and relaxing.  Will return for dinner another time.", "author": "E D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-25", "description": "Delicious!  We had a great brunch here.  Food and service were both fantastic.  The place is warm and inviting and the communal table in the middle is fun for parties of 2-3.  I had the egg and kale sandwich which was delish.  My boyfriend had the lasagna which was also great.  Looked like a good bar scene, too.", "author": "Ali S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-05-16", "description": "Rude service from barista who gave me caffeinated coffee when I clearly asked for decaff. The $10 \"preserved\" tuna sandwich is actually regular canned tuna! A little too much Wburg attitude for the neighborhood.", "author": "Peter W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-29", "description": "We dropped in to Rucola for a drink after celebrating my birthday.  The space is gorgeous, the drinks are excellent, and the service was hands-down awesome.  No fussy attitude, no silly fanfare, just really good cocktails in a beautiful spot.", "author": "Rebecca A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-07-15", "description": "Food: Both cod and monkfish dishes were delicious.  \n\nAmbiance: SOOO incredibly LOUD!  \n\nOverall rating: cant. think. because. i. can. still. hear. the. loud.", "author": "Judy C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-08", "description": "I went to Rucola for the first time last week and had a wonderful time. This place has really nice ambiance and is very well priced. Every part of the meal was fantastic. They're also amaro geeks, which gives the restaurant an interesting added facet if you're into cocktails.  Beautiful room, great food, friendly people!", "author": "Michi R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-22", "description": "We (a party of two) were lucky enough to get a table for an early dinner on a Saturday night. We called at 4 pm and left a message requesting a table for 5:30. They returned our call with a message that we were on a wait list. When we strolled in at 5:25 and gave our name, they seated us immediately. \n\nWe did not have drinks or dessert, as we were headed to a 7:00 event at the nearby Barclays Center. But we did order appetizers and entrees. Our food was delicious and perfectly prepared.\n\nThey started us off with freshly made focaccia and olive oil. Delicious!\n\nI had the charred string bean salad. I wouldn't call the beans string beans; they were thicker, more like a pole bean, but it was a delicious salad. The ricotta salata was clearly freshly made. My dining companion ordered the grilled octopus appetizer, with heirloom beans. Not a combo I would have prepared, but he pronounced it delicious-possibly the best octopus he's ever had.\n\nFor entrees, I ordered the housemade garganelli, which is served with a tomato-almond pesto that is outstanding. My companion had the roast chicken which was tender, moist and delicious.\n\nThe dessert menu was tempting, but we didn't really have the time to enjoy it or even a cup of coffee. We were planning on getting frozen custard from Junior's at the Barclay's Center, anyway. I would definitely return to Rucola if I were in the neighborhood and had more time to enjoy the meal. And I would order a glass of wine from their more than adequate wine list and, hopefully, dessert.", "author": "Ali M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-05", "description": "I really love this tiny place, I just wish less people felt the same way so I could enjoy it more often! The food is always good- lots of options for vegetarians. But the place is small and can get cramped during busy hours- you are very close to the diners next to you. Still I give it 5 stars because I enjoy myself and eat well each time I go!", "author": "S F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-27", "description": "Love Rucola for its homemade, delicious, rustic-ish Italian food. I don't want to call it \"traditional\" because I'm not entirely sure what that means, plus it's subject to interpretation. So maybe classic is the right word. Anyway the food is great and unpretentious, and they've got some classy cocktails as well. Great place for a dinner with parents or a romantic date. I appreciate that the menu offers a nice variety without being overwhelmingly large, and much of the food is filling without being heavy.", "author": "Alison G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-12", "description": "One of the best Italian I had so far in New York. The pasta are made fresh everyday, you just want to have a significant portion of pasta with Olive oil and Parmesan - it's that good. Fair wine list, best panacota I had outside of Italy and France.\n\nI asked for a coffee, I was given a Ristretto of great quality.\n\nI will go there many more times and will add to this review.", "author": "Canadian M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-05-23", "description": "We came to eat and there were no tables taken. The food was good but the staff didn't pay attention at all. We asked for olive oil and never got it and had to wave at them like crazy to get any of the 8 waiters to come and bring the check when we asked for it. Might have caught them at a bad time but the experience was not good.", "author": "Alejandro A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-03", "description": "I went here for dinner and it was great! The food was delicious and the service was good. The decor is great, but it is a bit loud. The garganelli was particularly good.", "author": "Beth C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-17", "description": "Nice ambience , very crowded. Not a big menu. Slow service. Their signature trout is delicious", "author": "Ashu S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-28", "description": "I had a great experience here a few weeks ago.  Even though they don't take reservations, I called ahead and they took my name down and were really accommodating.  The decor is lovely, lots of interior brick and nice lighting- perfect date spot or place to catch up with friends.  I have been craving the brussel sprouts with apples (think it was a special) ever since, and hope to go back soon!", "author": "Joey B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-16", "description": "I came to Rucola for dinner, and I really enjoyed everything we ordered. They have good coffee, delicious pastas (though very limited selection) and a cozy atmosphere. The scallops we ordered were delicious, and the bread was delicious, though if I recall the olive oil didn't have much flavor.  One of my favorite Italian places now; if only I lived nearby!", "author": "Justin H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-11-19", "description": "This is the place I picked for my bday romantic dinner. The food is simply amazing! My favorite dish is the stripped bass: no matter how they served it (I already had it in different combinations), it's just perfection", "author": "laura g."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-07", "description": "I had an amazing evening here the other night. The place was lively and certainly busy but the staff still seemed to be able to make time to properly take care of all their customers. Everyone that worked there was super warm and friendly. Not only was the service great, but the food was delicious as well. We were recommended the chicken breast which is normally something that never really would catch my eye on a menu but I am so glad we ordered it here...so moist and flavorful! All the other dishes recommended to us were on point as well. By the end of the meal, my boyfriend and I were barely able to hobble home because the food was so tasty we couldn't help ourselves.", "author": "Anna C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-19", "description": "Great atmosphere, nice staff, delicious, moderately priced food. Occasionally they get overwhelmed and the food will arrive a bit cold, but they are still a lovely restaurant and well worth the trip.", "author": "S. E."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-06-17", "description": "I went here for brunch on a Sunday and while this place gets 5 stars for ambiance and decor, it gets 2 stars for food. The best part of my meal was my iced coffee. I ordered the poached eggs and my friends ordered the same. The eggs arrived on two slices of sourdough toast and were covered in marinara sauce. I was not expecting the marinara sauce and it made the bread really soggy. The poached eggs were nice - the yolks were still runny, but again - the marinara - threw off my breakfast experience. Unfortunately my friend's poached eggs were cooked all the way through and she was basically eating boiled eggs with marinara sauce. The dishes were not served with traditional potatoes or hashbrowns or any sides. The dish came with a pork sort of like prosciutto and was not very flavorful. Head elsewhere for brunch.", "author": "Rachel S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-21", "description": "I love this place. Best restaurant in the area. I've had the roast chicken, branzino crudo, meat plate, caponata and my wife loves the house made bread. Ive been 4 times and ive been satisfied everytime. Way better than frankies. One of few places in bk worth coming to from manhattan.", "author": "Charles B."}], "servesCuisine": "Italian", "priceRange": "$11-30", "name": "Rucola", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "190 Dean St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/ea87R47Kp_k95_fE7ginIA/ls.jpg", "@type": "Restaurant", "telephone": "+17185763209"}