{"aggregateRating": {"reviewCount": 458, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-10", "description": "Five stars for quality and deliciousness and atmosphere \n\nWe stopped in for brunch \n\nThere was a large selection of wines, cocktails, beers, and brunch drinks (try the Italian)\n\nI like their minimalistic approach to food \nExcellent quality, excellent pairings, and delicious \n\nThe atmosphere was rustic and peaceful, clean and calm \n\nThe crowd was calm as well. Not noisy.\n\nGet there early as it gets crowded\n\nI think maybe the seating  arrangements were a little too close for comfort.\n\nThe smoked salmon was delicious \nPulled pork was great for spicy lovers \nAvocado toast is a must try\n\nThe only down side was the menu is heavy with bread dishes (sandwiches). \n\nThey dont have too much variety in terms of meat dishes and sides\n\nThey serve one type of desert from four and twenty blackbirds bakery (which is oh so good).", "author": "An B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-14", "description": "Enjoyed a solid Italian dinner here.\n\nWe had a group of 4, so we are able to share a few of the dishes. One of the things I enjoy about Italian food, most dishes are great for sharing.  \n\nTried the antipasto plate, crostino, escarole salad, lumache, and a side of polenta. Most of the dishes were great and the pasta was very fresh. One of the dishes had a hint too much of salt, so I just had less of that dish and gave more to others that like salt.", "author": "Tim R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-09", "description": "The food though delicious, come in really small portions for the price. I had the duck, delicious and that portion was decent. My wife had the chicken and that was really small. She felt hungry still after. We did however chow down on many pieces of their focaccia bread. I seriously would like to go there and give them $20 and just ask how much of their complimentary bread can I buy to take home with me and that's it. That's literally all I want. Seriously. Their bread and their olive oil, but I'll just buy their bread. Please?", "author": "Heather S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-27", "description": "Stayed at the Marriott a few blocks away, found this gem and will come back again! Quaint, small and delicious! Price is right and food is FRESH!!!", "author": "April C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-12", "description": "Adorable cafe for a date or intimate discussion over dinner. It's on the first floor of a cozy brownstone and serves modern Italian food. Don't expect a full menu of pizza and pasta, expect to leave feeling warm inside", "author": "Rachel M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-06", "description": "This was our 1st time here. Man I was not disappointed. We were celebrating my birthday (my server- receipt said Quincy, didn't know this) he was from the 1st interaction super amazing, friendly and patient. He also gave suggestions and helped us with the menu. We ended up with 2 chickens and also the cod entree. Appetizers were escarole salad, roasted carrots and crispy polenta. Everything was delicious and flavourful. The cocktail The rider is a superbly balanced cocktail. Don't expect 'huge' portions, every dish has the right amount of food. The freshly baked focaccia bread is amazing. The aesthetics of this restaurant was well though out and that booth seat at the corner was magical. Thanks for a great birthday dinner. Ps I never write reviews but Quincy gave amazing customer service. Back soon!", "author": "Ayo W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-11", "description": "I've been familiar with this place for quite some time and decided to walk in for the first time for some lunch. \n\nI decided on the Escarole Salad and a side of the marinated olives.\n\nThe Salad was AMAZING. Initially I wasn't thrilled at the price but the portion in my opinion was very fair. The salad was perfectly dressed and had just the right amounts of smoked feta accompanied by the crunch of the roasted almonds. Delicious. \n\nThe olives were okay. The portion was huge for the price! \n\nAside from food, it wasn't busy at all and the ambiance was pretty and chill. \n\nI definitely will be coming back here. Excited to try dinner next.", "author": "Marsha G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-27", "description": "Squash salad. My lordt. \nTight space, delicious meal and great location. House made pasta is a game changer(although very al dente). Did I mention the squash salad?\nThank you", "author": "Meghan G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-17", "description": "Rucola was my spot for the four years I lived in the neighborhood. Sometimes I still head back that way to visit!\n\nWhat I like about it is that, even though the menu changes seasonally, the basic structure of it is pretty consistent - and the quality is consistent as well. You really can't go wrong, though there are some things that are total must-haves. If they ever have duck on the menu, order it. It will be the best duck you ever have. The chocolate and olive oil pudding is to die for. Octopus on the menu is always a good sign. Pasta is top-notch, as are the veggie antipasti. The only thing I've never quite enjoyed at Rucola is the cocktail selection, but I think it's more a palate difference than anything.\n\nEarly weeknights are the best times to go for dinner. It also makes a great spot for solo weekend brunch. Just post up at the bar with a book and people watch - it's extremely cozy in the autumn and winter!", "author": "Melissa S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-14", "description": "A hidden gem in Boerum Hill! I would have never been able to find this place without Yelp but I'm glad I did. The restaurant is small but when you walk in you feel like your in a old Italian wine cellar, almost underground in a way. It made the dining experience all the better. The menu is short and simple, we ordered the lumache pasta and flank steak. There is nothing worse then over cooked pasta but not here! The pasta was cooked perfectly and each piece of pasta was coated in the delicious sauce, I could eat a shoe coated in the sauce. The flank steak was cooked to a perfect medium rare, my girlfriend refuses to eat bloody meat and she enjoyed this steak. The meat was done perfectly without leaking too much blood. It was a delicious and hearty dinner. We will definitely be coming back for more!", "author": "John T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-31", "description": "Cute brunch place in great BH location. \n\nIt's designed well with lots of natural light and two tables right beside the window. \n\nI wish there were more places like this in BH as the wait is often too long to be reasonable for a relaxing brunch.", "author": "Benjamin J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-13", "description": "Rucola is such a gem of an Italian restaurant! I ordered the escarole salad, the crudo, the chicken entree, and the pie! Everything was beyond my expectations. The escarole salad was so fresh and simple yet flavorful at the same time, by far my favorite out of everything ordered. I came here with a bunch of friends but the ambiance is perfect for a date night. Overall, I highly recommend it here and can't wait to come back!", "author": "Kristen V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-19", "description": "This place is favorite restaurant in Brooklyn. Now I don't like pasta, I've been low carb for free and 15 years and avoid pasta whenever I can. But you come here and you just have to try the pasta because it just tastes different. It's not doughy, it's not too cheesy, it's just right. And that's every dish, it's just right.", "author": "Alek G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-10", "description": "My friend and I came here prior to a show at Barclays and was happy overall with Rucola\nLove the ambiance here and it's a nice small restaurant that sits well within the surrounding neighborhood.\n\nI had ordered the Flank Steak which overall was good, but the only comment I would have to say is that entire dish tasted like it was all mixed with the same sauce.  I personally would think the dish could be better if the spigarello was off to the side instead of hiding the main component of the dish which is the steak.  the black garlic jus appears to have been mixed with everything so your greens tasted the same as the steak.  Maybe it's a personal preference, but the spigarello should be on the side with it's own dressing.\n\nRegardless, food and place was great and would recommend stopping by if you're in the nieghborhood.", "author": "JT T."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-11-27", "description": "dinner is very cramped and loud. Communal tables place you touching elbows with the persons on both sides and the back of your chair bumps up against the person behind you. It is unnervingly loud, you have to lean forward and face the person you are speaking to and then speak forcefully for them to hear you. The food sounds interesting and the menu is trendy, but it tastes unremarkable. Of the 5 different servers I saw, 4 of them had a scowl. They seemed impatient and did not recommend anything on the menu with passion. They just didn't seem to want to be there. Lots of other better choices in this neighborhood. I regret going to this restaurant for a special occasion.", "author": "Ben S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-05-25", "description": "Very mixed feelings on this place. A friend and I met up with some college friends who live in Brooklyn and they took us here. \n\nI ordered the shells. The pasta was delicious. Noodles were al dente and lots of flavor in the sauce. Perfect portion to not have leftovers. The downside was that this is pretty much the only thing that appealed to me on the menu. Not a ton of variety or choices. \n\nThe atmosphere was cozy and inviting. We sat inside but the patio looked great! Also, one of the best restaurant bathrooms I've ever seen! It smelled phenomenal (candles...nice touch!). I oddly wanted to just hang out in there. \n\nThe other major downside was our server. It was like everything we did was a massive inconvenience for her. Maybe she was having an off night...it happens. Also, my friend overheard her conversing about tables with the bartender and her comments were not very nice. \n\nIf I lived in the area, I might give it one more shot but I don't see myself seeking it out on my next trip to the city.", "author": "Mandy J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-27", "description": "Place it lit...hands down the best restaurant in Boerum Hill! It's cozy and welcoming! The pasta is dank and the breakfast is damn good. Do not sleep on this place!", "author": "Craig K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-25", "description": "Showed for a table for two at 9pm to be told it was a two hour wait. Received a call 15 mins later to ask if we were still interested in a table to which we said yes. The hostess said a table was on dessert and she would call back when they received the check for us to head over. Did not receive a call back all night. Waited to hear until it was too late to go anywhere else. Went home 7 months pregnant and hungry.", "author": "Tara G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-15", "description": "Really cute little Italian place that was absolutely packed at 10:30 on a Saturday night, but by 12:30 was much calmer. Staff is friendly and pleasant. The atmosphere is very comforting and welcoming - I almost didn't feel I was in a restaurant, but rather in a friend's dining room. It's just a very nice ambience (probably all the wine helped!). My party of three ordered lots of wine and pasta and were delightfully full - too full to order dessert. Menu offers lots of options and prices are good. Cute spot!", "author": "Perry T."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-02-13", "description": "3 for the food and 0 for the service. I went here with some friends because I heard their homemade pasta is divine but even great food is hard to swallow when the service is as bad as it was. I won't get into the nitty gritty but as far as the food goes definitely try the rigatoni with pork bolognese! You won't be disappointed. I would probably say pass on the braise pork shank. I am sure the way it is cooked depends on the person but my dish was overcooked and chewy. The wait isn't that bad so it's worth a gamble if you're in the area and craving some Italian.", "author": "Genevieve L."}], "servesCuisine": "Italian", "priceRange": "$11-30", "name": "Rucola", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "190 Dean St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/ea87R47Kp_k95_fE7ginIA/ls.jpg", "@type": "Restaurant", "telephone": "+17185763209"}