{"aggregateRating": {"reviewCount": 458, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-29", "description": "Rucola certainly has a charming interior and is located on an equally charming block of brownstones. There are ups and downs with this place for sure, but I waver more on the positive side than the negative - Probably between 3.5 and 4 stars.\n\nI think it's lovely when it's not too packed and the pastas are usually very well executed and tasty. The cocktails are also quite good, though perhaps not at the level of some of Clover Club's better mixes. The downsides probably come alongside their popularity. I appreciate that they let you leave your phone number and suggest you get a drink around the block at the Brooklyn Inn, or you can go for a stroll and know that they will indeed call you and seat you once you get there. However when it is packed (and it often is, any day of the week), service does get slow and sometimes the food suffers. I hadn't noticed it so much at dinner, but brunch was cheek to jowl and the rigatoni was overcooked. Poached eggs with tomato and parmesan and toast tasted eerily like the rigatoni, or some kind of breakfast pizza. And though we weren't chomping at the bit to eat, the wait for our food was rather larger than the portion size. We even ordered the homemade bread with butter and jam (be warned that this is actually two pieces of toast with the jam already spread - reasonably tasty, I like jam that's not too sweet), but it came at the end of our extensive wait, a split second before our food. It would've been a nice filler with our coffee.\n\nI don't harbor any bad feelings for them though because they aren't a bunch of @$$holes, and I think they're still trying to get their legs under them in the course of their surging popularity. I'll give them another couple months before I kick them off my list or move them up.", "author": "Erica K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-03", "description": "I really enjoy Rucola.  I have been 6 or 7 times to date and have always enjoyed my time there.  The food is pretty outstanding - always fresh and well prepared. The standouts for me have been the fish dishes, the duck and the home made rigatoni is amazing.  All the appetizers are great for sharing and I particularly like the fresh summer salad and the heirloom tomatoe salad.\n\nA great place to eat dinner with a small group of friends!", "author": "S J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-12-14", "description": "Fantastic. Food to service to price to vibe.  Makes me love my neighborhood.", "author": "Sir M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-10", "description": "Rucola is a very cute, quaint restaurant on a quiet street in the neighborhood.  BF and I sat at the bar as the place fills up and i don't think it takes reservations.  Drinks were fantastic - approx $10 each.  I got the trout - served head and all and BG got the rigatoni which was delicious.  Fish was good and pasta was great (though pasta portion was a bit on the smaller side for a main course).  My only complaint - menu is a bit limited.", "author": "Krista C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-10", "description": "I was VERY excited to try this new star-powered restaurant and it did nothing but exceed my expectations! I thought the food was creative and wonderful (the menu changes daily). The staff was INCREDIBLY welcoming and very knowledgable. I've had dreams about the desserts and must go back for the cookie tray soon.\nOverall, I am very happy that Rucola is right down the street. It is a mixture of all the things I love about a restaurant: Great wine, Great people, New and interesting Food, Comfortable and welcoming space.... Way to go guys!", "author": "kerri C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-18", "description": "Who knew that Boerum Hill was such a happening place!  The energy at  Rucola is palpably youthful and enthusiastic.  Located in an historic building in Boerum Hill, the decor is homey and warm with lots of wood adding to its charm.  There are two large farm tables as well as regular tables and bar seating.  When we got there, the regular tables were all full, so my two companions and I opted for the farm table, something that I was initially somewhat ambivalent about, but wound up feeling like part of the two groups of young people (under 40) that were sitting next to us.  \nOne would think that a menu with only four main entrees would be sparse.  In reality, the opposite is true.  With its choice of appetizers, cheese, meat, and vegetable platters, sides, and pasta, there is actually a great amount of choice both in foods and in eating styles (i.e. tapas, full meal, vegetarian).  The young women next to us opted for a selection of appetizers and sides, while my party opted for a more traditional meal, eager to taste the main courses.\nWe were offered drinks just a little while after being given our drink and regular menus and we passed on the interesting-looking cocktails in favor of less adventurous beer, wine, and plain vodka and soda with lime.  The bar (and the restaurant itself) was full, and while we waited perhaps a little longer for our drinks than we anticipated, the people-watching made the wait more than tolerable.  \nOur appetizers came soon after our drinks.  The market squash salad was tops, and went well with our meat platter (Italian meats) which was quite generous.\nOur dinner choices were LI monkfish, Chatham cod, and duck breast.  All were cooked perfectly--i.e. the duck was rare but not too rare and both fish dishes were moist and appropriately flakey.  The flavors and textures were magnificent!  The LI monkfish was served on a bed of Farro (a wonderful grain) ,carrots and capers, and was well presented with thin slices of squash running across the top.  The Chatham Cod was accompanied with mussels, on a bed of chickpeas, and tomatoes, and was simple and delicious.  The duck was exquisitely and subtly flavored with just the right amount of cherries, and rounded out with swiss chard and pieces of turnip. The portions were quite appropriate.\nWe shared the chocolate torte for dessert.  It was the perfect finish to a great meal, especially with the hazelnut brittle and whipped cream which accompanied it.\nA caveat to the old and grouchy:  If you don't like the enthusiasm and energy of the younger generation this is not the place for you.  The restaurant is noisy when crowded.  Also, the food is extremely fresh and cooked to order, and therefore wait tmes are appropriate to fine dining.\nHowever, if you're old (our party were all over sixty) and love to be infused with the energy of the young while enjoying fantastic food, put on your sneaks and run to this place!\nBy the way, the prices are really reasonable and below what you would pay for an equivalent meal on Fifth Avenue in Park Slope.", "author": "Irwin R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-19", "description": "I had the most wonderful birthday dinner at Rucola! In fact, this adorable spot just may be my new favorite Brooklyn restaurant.  Everything about it works for me---the charmingly rustic decor (including the lights made out of jars, I think, and plants in hanging tins) AND the delicious food and drinks.  More on those later.  One thing that truly impressed me, outside of the outstanding food and service was how friendly and easy they made it for me to make a reservation for a party of 12!  They were beyond accommodating, dare I say a pleasure to work with.  Now, back to the good stuff.  I started out with a fabulous cocktail called Il Gitano.  Yum!!  Then we moved on to some appetizers\nThe stuffed artichoke was seriously one of the most delicious items I've had in a restaurant or elsewhere in a long while.  Also, the cheese plate was fabulous, and there was a homemade special of fried zucchini with fresh ricotta cheese that was to die for.  Apparently, the duck was also the best some of my friends have ever tasted!  I had the strozzapretti--homemade corkscrew pasta with pesto and zucchini. Unbelievably good.  Do yourself a favor and try it. Honestly, everyone LOVED their meals, no question.  And the server even brought me a dessert for my birthday with candles and everything--gratis! He was so attentive and thoughtful.  Too bad I can't remember his name (damn those Il Gitanos and the birthday Champers that my friend gave me before heading over...)  In any event, this little restaurant is near perfect, and I can't wait to go back again.  The ambiance, the staff, the food, and the drinks were all superb.", "author": "Joolz M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-11-30", "description": "I would rather go to a restaurant, that has a small menu and has perfected each dish, rather then a restaurant that has a large menu and the dishes are ok. Rucola is definitely the ladder. Rucola has perfected their dishes and every part of my meal was delicious. The atmosphere was so much fun, the service was great and the staff was very knowledgeable and had great recommendations. I will definitely be back!", "author": "Katie M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-03-25", "description": "Good.... I wished it was better.  Came here for new years eve dinner, and i guess  based in that I should have been prepared, my track record with pre-fix dinners is less than desirable.  The menu was nice and varied, just didn't blow any of us away.  Really cute environment, would be a great date place, feels intimate inside and off the beaten path.  Will give it another try on a normal day!!", "author": "Stephanie C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-07", "description": "Holy crap, this was amazing. Zero pretension, great food. Brooklyn at it's best. Try the pudding.... and the pasta with meat sauce, oh and the chicken... and the salad. Uhm, try everything. I love love love this place.", "author": "Sara G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-01-04", "description": "Charming and friendly, but the sauces overpower the food, both for the salad and the pasta.", "author": "Stephan H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-05-04", "description": "Word to the wise: Perhaps it's not such a good idea to visit a restaurant on their second day open. I learned this the hard way when I showed up at Rucola in Boerum Hill, Brooklyn. The anticipation of the opening of this new spot that touts northern-Italian cuisine was palpable when I arrived on Friday to a swarm of patrons outside the door. Probably because it's the baby of alums of the Prime Meats, Death \u0026 Co., and Cafe Boulud \"restaurant titan trifecta.\" And I fell for it. I even waited for over two hours to be seated, which I would never do! This time was an exception, as the hours pass pleasantly when you have a friend who works at a bar down the street and you're not yet famished. Cut to us merrily merging forces and sitting at a table for three at 10:15 pm.\nWith some trifecta power of our own and a short listed offering of 5 plates and 2 desserts, it was only natural to order the whole menu. Turns out even that was not enough and we wound up having to double up on items. It also would have been considerate if they had mentioned one minor  detail: They had no power! Excuse me? How could you confidently invite patrons to spend a pretty penny (yeah, it wasn't cheap) on what they think is a fully supported menu of food worth a 2-hour plus wait, and you don't have a functioning fridge and burner? Well it didn't go unnoticed, as our food left much to be desired - and we ordered everything!\nI will commend Rucola for the ambiance set by perfectly placed rustic wooden tables, romantic candle-lighting, and an extremely genial front of the house. Our server was genuinely bubbly and Julian Brizzi, managing partner and \"name-taker\" of the night, was all smiles and enthusiasm as he jotted our phone number and nonchalantly mentioned it's a 2-hour wait for 2 - which couldn't help beget the \"don't call us, we'll call you\" sentiment.\nIf you still feel hungry after a meal out, there is a screw loose somewhere. I don't appreciate dishes overpriced for their portions, but can give a pass if the food is at the least thoughtful and tasty. But the leave-you- feeling-hungry, uninteresting, pricey fare doesn't jive with me. And this was Rucola in a nutshell. Two bottles of wine made this pill easier to swallow, but my party was still all too aware of our disappointment. We wound up with two meat and cheese plates - the second, one of those duplications that came at the end of the meal when we still needed more to put in our mouths. These were acceptably edible and as interesting as a charcuterie board might be, showcasing three of each, but in a portion that did not reflect the $19 a pop price.\nMove to the two salads on the menu that looked almost identical. One presented itself as an octopus salad, but had more tasteless arugula than the thread-thin fish. The other with radishes and dandelion greens was as robust and intricate as it sounds: not. Whatever else was in them to contribute some sort of flavor failed. It was unfortunate that the octopus was another repeat dish. But excitement abounded when the pasta plate approached, as surely this was fail-safe. We were so confident in this homemade fettuccine carbonara with ramps that we doubled up on this dish right from the start - only to be informed post-ordering they only had one left (hence the second, but unfulfilling helping of octopus salad.) Well, we found it wouldn't have been worth the carb consumption. A blessing in disguise? How do I know this pasta did not meet anyone's tongue in the kitchen? Because they would have dumped the whole batch had the overload of salt assaulted them as it did us. The resulting taste was akin to the all too familiar experience of merrily salting along when the loose cap of the shaker demonically flies off, a flood of salt crystals rushing out like a broken dam. When it comes to salting, a heavy hand can be a bad, bad thing - and it was. \nThe only thing that was notable by comparison was the whole fish on the bone, decorated with clams and a simple lemon, oilve oil, and basil pesto. This was good as far as these things go, but nothing outstanding, as one might hope for with such a hefty price. \nAn assorted cookie platter was not a comprehensive dessert by any stretch but the hodge podge sufficed as little sugary nibbles. The chocolate cake tasted like it was compliments of Betty Crocker, living up to the after-thought it probably was without an appearance menu. And the soupy rice pudding - ah, make that two. Oh right, hungry still - was the best of the three options, with a rhubarb compote that added a spruce of color if not a benign sweetness. Hunger plus mediocrity equals over $80 per person? So I guess we won't be doing that again - not unless I can be assured that all the electrical appliances are powered and there is a salt patrol on duty. Even with these things, the thought put into the dishes needs to be more deliberate, focused and creative. Not to mention better supported by substantial ingredients.", "author": "Rebecca K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-12", "description": "I'm writing this review after our second visit to Rucola. We had a fantastic meal thanks to Julian and the incredible crew there. \n\nThe Bolognese, hands down the best I've ever had and the crudo was something exceptional. The grilled trout was similarly impressive and perfectly cooked and seasoned. \n\nOverall, it's a wonderful and much welcome neighborhood spot, unpretentious, dependable with delicious food. Considering its size and how busy it consistently is, it never feels crowded and there's no deafening roar, plus we've never had to wait long for a table.\n\nIt great to have another go-to in the area where you're guaranteed a good fare and a good time.", "author": "LJ C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-10", "description": "My family and I were in Brooklyn for the day and decided to have lunch here. We were pleasantly surprised with the simple menu and the friendly staff. The pricing was very reasonable in my opinion and the food was delicious.", "author": "Mark E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-01", "description": "Came to Brooklyn for a New Year's concert, with no specific dining plan in mind. Read a little bit about it \u0026 gave it a whirl.  So glad we did...staff was warm \u0026 welcoming as soon as we came in.  Without a rez, they accommodated us at the bar.  Very good drinks and a $65 NYE prix-fixe dinner of 5 courses.  Good cooking, good flavors, simple and tasty.  Made new friends at the bar and had some fun tasting a few different amari, which weren't very familiar with.  Would go back anytime.", "author": "Frederick L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-23", "description": "i've been curious about what was happening on this corner, which really feels like my corner, for months. \n\nsecret fact: i secretly wished it were me opening up a bakery on bond but that's beside the point. \n\nnot so secret fact: this place is delightful! i pretty much loved everything about it: loved the host, loved the waiter, loved the shoes, loved the bag. wait, where was i? but it's true: i did love this place. i adored the ball jar chandelier, felt cozily tucked into the brooklyn-ed out atmosphere, lost myself into the baked rigatoncini, and admired the balance of the arugula salad and dressing. \n\nthat said, i think there's still room for improvement here. but, i trust this place will grow into itself well.", "author": "julia r."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-12", "description": "I've been here several times, and each time I love it. Their dishes are simple, reasonably priced, and perfectly done. The dining room is delightful and welcoming, as long as some honker isn't howling her dumb face off in the corner. But I love Rucola, and you should too.", "author": "X. J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-16", "description": "Great little Brooklyn spot - rustic and cosy, with especially beautiful windows (random but true - the windows are covered with ornate bars and plants).  I've been mostly for brunch and lunch, both of which are great.  Definitely check out their sandwiches if you happen to stop by for lunch.", "author": "Karen C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-10-13", "description": "Amazing place for brunch and dinner!  I had the smoked trout salad and it was delicious and totally unique.\n\nAt night the vibe is amazing and their staff is friendly, attentive, and not too in your face.  This is my new favorite spot in Boerum Hill.", "author": "Maureen O."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-12-04", "description": "Th food is always great as is the coffee. I haven't gone for cocktails yet so I am not sure how they are. The service, however, leaves something to be desired. I have been a few times and I always find myself having to remind the server that I ordered something, and sometimes it never comes at all!", "author": "Grazina S."}], "servesCuisine": "Italian", "priceRange": "$11-30", "name": "Rucola", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "190 Dean St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/ea87R47Kp_k95_fE7ginIA/ls.jpg", "@type": "Restaurant", "telephone": "+17185763209"}