{"aggregateRating": {"reviewCount": 458, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-03-21", "description": "This place is so overrated. On a recent trip for lunch, I tried to order a turkey sandwich- turkey being one of the ingredients most represented on the very limited lunch menu- and was told, without regret or apology, by the dismissive and rude server, that they were out of turkey. What followed was almost comically bad service, with it taking an hour to prepare a sandwich that consisted of one piece of meat and bread, and a shockingly inattentive- mostly absent- server. Also, it's not cheap!\n\nDinner experiences have been better there but still don't understand the lines/wait/hype surrounding this place.", "author": "Serena J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-26", "description": "We literally live next door so it's hard to stay away from this place.  Luckily the food is great and the staff is nice (to us) too.", "author": "MARISA P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-04", "description": "Pretty loud and tight atmosphere but great service and amazing food. The portions are small so don't bring a large appetite. It's best suited for a palette craving, in which they provide fresh and delicious options, artfully plated.", "author": "Serena G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-19", "description": "Absolutely lovely. The ambiance, the food, the FOOD, and the service. Necessary to mention food twice because it really is the food that steals the show. My friends and I shared all our dishes:\n\n- Burratta. Divine concept combining sweet jam with some kind of crispy sweet potato chip things. We were DYING because the flavor combo was so good. Plus that burratta texture. Mmmm yum.\n- Charcuterie. Chef's selection of meats, cheeses, and veggie antipasti, which included maybe the best blue cheese any of us had ever tasted. The beets were quite lovely as well! We even mix and matched them with the burratta because we're crazy like that.\n- Chicken. Cooked to perfection and so much more than *just* chicken. Definitely had that slow cooker moisture and flavor, paired with crispy polenta. POLENTA! A comfort dish to write home about (sorry ma!).\n- Brisket. Also cooked to perfection. Served with some kinda Brussels Sprout salad that had the perfect combo of tangy/creamy sauce.\n- Rigatoni. OH YEAH. What else can I say besides \"cooked to perfection\"? I sound like a broken record because it was hands down the perfectly concepted and executed meal. Really lovely pasta, well seasoned, and every bite tasted savory and not at all heavy. Just like in Italy! \n\nA good venue for being able to carry a conversation with your table. Definitely a spot for foodies. Looked like a great place for a date, too! \n\nIn summary, this place is not only cute as all get out, it left my taste buds quite happy! I will be returning next month when I have friends visiting from out of town.", "author": "Stacey T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-06", "description": "Great meal at an adorable, romantic little spot.\n\nMy date and I shared a cured meat plate, chicken liver mousse, heirloom melon salad and the campanelle pasta. Meat plate was delicious, as expected. You can't ever go wrong with cured meats, and same with the chicken liver mousse. Holy crap, the heirloom melon salad was good. I could've eaten plates and plates of that. The mix of flavors was so interesting and  surprisingly complimentary. I would definitely order that again. The pasta was perfect. Cooked  well and the the sauce... the SAUCE. The smoked tomato butter made me drool. It was the perfect balance of being rich but not too heavy. For $16, it was an impressive steal, and portion size was generous for the price and quality.\n\nService was wonderful - attentive and kind. Cocktails were delicious. Overall, great experience. Excellent food at an excellent price.", "author": "Rebecca W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-01", "description": "This place is a straight up GEM. So amazing in both service and food quality. The only downside is that they get booked to fast!", "author": "Tony M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-23", "description": "I love Boerum Hill for many reasons and Rucola is one of them. This. place. is. so. good! We got the crudo to start and shared a pasta dish - both were out of this world. It's the perfect intimate-meets-rustic spot for date night!", "author": "Regina V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-21", "description": "Some of the best Italian food I have had in the states. Squid Ink pasta was out of this world. We started questioning why it was taking so long for our food but we didn't mind as we were drinking and having food conversation about work when the waiter came over apologizing that there was a computer error and the chef was on it then. Without asking he brought us out 2 appetizers to try, extra bread, and a spread of meat and cheese all on the house to make up for it. Absolutely worth the inconvenience. Everything we ate was delicious. Group said their shells dish, sea bass, and chicken were all delicious as well. Good pricing for Brooklyn as well imo.", "author": "Peter L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-12-22", "description": "This review is coming from an angry place, so take that for what it's worth. I walked in today (which is a touch drizzly - relevant later) and asked whether there's wifi available for me to do work. Someone appearing to be the manager says, \"absolutely.\" \n\nSat down at the bar, ordered tea (with intentions on ordering lunch), and asked for wifi password. After logging in, I discovered that their wifi is absolute garbage. Asked the bartender about it - it was her first day so she asked the manager. He told her that the wifi isn't great when it rains, which she relayed to me. I said I wanted to settle up and leave, because I needed wifi. They charged me $3 for the tea and I left. \n\nIssues:\n-Manager should have notified me that the wifi isn't functional on days like today\n-Manager should have come over to explain rather than dispassionately answering the bartender - or at the very least the bartender should have offered a response other than, \"Shucks, sorry.\" \n-THERE IS NO WAY THEY SHOULD HAVE CHARGED ME $3 FOR A TEA I DID NOT DRINK\n\nTalk about first world problems. But still, I'm angry.", "author": "Mike W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-01-13", "description": "Went there for brunch and the food was excellent. Would have given them 4 stars except there was a grumpy male server that I could have done without.", "author": "Food M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-02-04", "description": "The kitchen and host should get 5 stars. The server however was absent the entire meal, didn't know anything about wine, never checked in on my guest and I and pretty dismissive even after I asked him for input regarding the menu. \nMy friend and I came in and were greeted by the host who told us it would be approximately 45 minutes, but could take my name and number and call me when our table was ready. My friend and I went and grabbed a drink up the road and when we were called we were back within 10 minutes. Host took us to a nice table at the back of the restaurant next to the kitchen. I asked him for a crisp clean wine to go with the crew though, he said \"our wines are on the menu\" and then proceeded to read the parietal of the few whites they had. Mind you I didn't ask him to read me the menu, I can read the menu. What I asked for was a recommendation that went with one of your specific dishes. Whatever. I told him I was thinking about doing 3 courses unless he thought a better way. Anyways at the risk of making this the longest review ever, he was relatively condescending and pretty snotty while he took our order. I had to ask two different people for wine throughout the meal, and the only time we saw him again was when he dropped off the bill (after I gave my card to someone else.) \nI spent 15 years in \"the biz\" and realize that the last thing you want on a busy Thursday night is a talkative two-top (or a 6 top that has never been out to eat before). But dude, it's called the Hospitality Industry for a reason, not the \"Don't inconvenience me by giving me money industry.\"", "author": "Chris G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-17", "description": "THE BEST EVER. I never wait for tables but I don't mind waiting here. I'll be dreaming about that trout with lemon. Or just come ask Kevin for the the New Ryder cocktail. Perfection.", "author": "Melisande H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-10", "description": "Oh shit! Stay away. It's mine. ALL MINE! Absolutely fantastic. Drinks, food, ambiance. Heaven.", "author": "Roger B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-28", "description": "Finally made to this charming neighborhood spot after having heard rave review from some pretty hardcore foodie friends. I hear it's often packed - but on Monday night it was perfection. Had the DREAMY roasted Brussels sprouts \u0026 potato app (5/5), the ribs w/ mint slaw (4/5), the monkfish with veggies (4/5) and bolognese which was a creamy dream of a dish with the subtle secret ingredient nutmeg (5/5). They only serve the bolognese in the winter months so get there ASAP! Great unpretentious, friendly waiters \u0026 delicious wines too.", "author": "Heather L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-26", "description": "I'm not sure when this happened, but sometime between now and the summer this has become one of my favorite neighborhood eateries.\n\nBrunch is great (and well-priced), though I wish the portions were just a taaaad bigger. Coffee refills cost $1, sorry caffeine addicts. The potatoes au gratin are a must!\n\nBut what really revs my engine here is dinner. It's such a great spot for a rainy day, when you want top shelf bread and piping hot soup to warm your heart. And did I mention the pasta? No? Well...it's carbolicious.\n\nService is outstanding -- I've never had a bad experience with a waiter. Plus, one of the dudes looks like Aaron Paul, so you're going to want to bring your Breaking Bad fanboy here.", "author": "Sarah G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-02-20", "description": "The food is decent, and you can tell they use good ingredients, but nothing outside of standard italian fare, pasta was overcooked, which was all such disappointment considering the 1.5 hour wait time to get in here. All in all without the queue I'd probably have given it 3.5 stars but the whole experience left me underwhelmed. I'd say skip it go elsewhere. Lovely wait staff however.", "author": "Michael G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-10-19", "description": "Perhaps it was a coincidence that while we were waiting for our party of eight to fully arrive, Ethan Hawke went inside and came out saying \"It's ours,\" and was then seated at the big table by the window... and mysteriously our reservation had \"disappeared from the system\" a few minutes later. Perhaps not. Who is to say, really? \n\nOur waitress was lovely. The hostess was absolutely not. I understand brunch is a tough shift. But come on.\n\nCon: crowded.\nPro: full view of Ethan Hawke while dining.", "author": "Jen M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-02", "description": "How have I not written a review of this place before?\nLike Peter D, my wife and I were also late finally trying this place. \nIt's small. The seating is tight. They don't take reservations. It can get a bit loud.\nThat said: solid food. \nWe love the chef's board of whatever cheese and meat they are serving that night. The focaccia they serve before the meal is just... stupid good.\nCocktails! Did I mention cocktails? They have a good bar staff.\nPasta. Fish. Chicken. Lamb. Various salads. We've enjoyed everything that we've had there over our many visits.\nThat said: Please don't go here. It's getting way too crowded.", "author": "Rich B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-10-12", "description": "This was our first meal on our recent NYC trip and we were starving after taking a morning nap after our red-eye flight.\n\nWe found this spot and the hanging plants on the outside and wood interior made it quite inviting.\n\nIt was a little on the crowded side for lunch but we got a table. Along with some beers we ordered the following:\n\na Cuban sandwich, a salad, a pizza slice, and a few selections of cheese with bread.\n\nWe figured they'd bring out the easier-to-prepare items first but we waited a LONG time and nothing came out. Other tables were getting their food and needless to say, we were agitated and hungry.\n\nAnyway, I finally spoke with one of the servers and miraculously, the food came out promptly. The server I talked to said they were busy but our server should have asked about bringing out the dishes in the appropriate order.\n\nI liked that he apologized for the error but we were left a bit underwhelmed with the food and still upset about the wait.", "author": "Art O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-01", "description": "this little gem is our favorite date night destination. \n\nThe dishes are seasonal and are absolutely delicious. For us, we enjoy having food that makes us feel good and doesn't lay heavy, Rucola nails it! \n\nEvery dish is well thought out and for desert THEY KILL IT! Their chocolate pudding with olive oil is something I crave on a daily basis. \n\nYes, the place is tight and you sit close to the neighboring table, but it is worth it. I would give this place 50 stars if I could. My favorite", "author": "Sofia G."}], "servesCuisine": "Italian", "priceRange": "$11-30", "name": "Rucola", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "190 Dean St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/ea87R47Kp_k95_fE7ginIA/ls.jpg", "@type": "Restaurant", "telephone": "+17185763209"}