{"aggregateRating": {"reviewCount": 458, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-03", "description": "Arrived early on a Sunday night, 5;30ish and was seated right way.  Good thing, because by 6 the place was packed, and people were being told that it was going to be an hour wait.  The tables are packed tightly, so be prepared to be sitting on top of your neighbor.   \n\nThe food here is great.  Especially, the freshly baked focaccia on the table.  Seriously, it was the best bread I have had in a while.   I'm sure the pastry's that they serve in the morning compare, I just wish I lived a little closer to be able to try them. (so cool that this place is open for breakfast and lunch on the weekdays)  We ordered two cheeses and a salami.  the cheeses were super fresh and the waiter helped us pick cheeses that paired well with the meat.  I especially like the Toma Del Rocca- which was a blended cheese.  Also shared the watercress salad, which was light and refreshing.  Our entrees were the short rib special over spatzle and the rigatoni, both were super flavorful and I especially love homemade pasta, but the short rib was a bit dry .  The price point for this place is just right, and most bottles of wine were 40$ and under.  \n\nOverall, this is a cute neighborhood Italian spot that has a friendly knowledgeable staff.  Food is excellent, and reasonably priced. The decor is nice, but it feels really cramped when its a full house, which I think is most of the time.", "author": "Lauren H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-26", "description": "One of my favorite restaurants in all of Brooklyn...a bit pricey but the food is tasty and the atmosphere is warm and friendly. The only big problem is the wait, but if you call ahead then you can usually put your name in. I love the chef's selection of cheese and meats, and the homemade pastas....though really everything is good! Go for dinner as brunch doesn't seem to be as good of a value--but definitely go for dinner!", "author": "Ann W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-12", "description": "This is probably my favorite restaurant in Boerum Hill.  The menu isn't extensive, but everything I have had there was FANTASTIC.  My husband loves their cocktails, particularly the \"New Rider.\" The ambiance is very relaxing, although they get VERY busy during prime hours.  So either get there right when they open, or prepare to wait on a weekend evening.  \n\nI believe they take reservations only for parties of 6 or more.  You can also call ahead and ask them to put you on the waiting list.  If that's your plan, definitely consider calling 40 minutes in advance on a Friday or Saturday night!  Oh, we have gone on the early side before and there were quite a few families there.  There really isn't much room for strollers and the like.", "author": "Christine T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-10", "description": "My evening at Rucola was a long time coming. The first time I tried to go there a private event has the whole place blocked off. The second time I tried to go there we were kindly told there was a 2 hour wait. No thanks. The 3rd time we tried to go, there was a 2+ hour wait. Maybe we should have gotten the hint, and stopped trying to go on the weekend. \n\nSo, on a pleasant Thursday evening we trudged down the hill to Boerum hill, ready for the crowds. Thankfully, there were none. But, this time we were inside! The minute you walk inside it's like you've entered a little oasis of rustic Italian joy. The lighting is perfect, and everyone is just so calm and welcoming, I was entranced.\n\nThe food was perfection. Everything delicious and fresh, and beautifully presented. Highlights include the house made spaghetti with clams, and the chocolate pudding. but really, i can't pick a favorite item. I just can't wait to go back so I can try more. \n\nThe drinks were delicious too. Creative cocktails, and an excellent wine and even beer selection. \n\nWhen I was younger my mother used to tell me that you can tell a really good restaurant by their bathroom. And, if I were to only rate Rucola on their bathroom they'd get 5 stars. Why? It was a fantastic bathroom. Painted steel blue, it even smelled nice....and there was plenty of paper towels and soap to go round. \n\nDefinitely ranks in my top 3 restaurants. I am in love.", "author": "Shira R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-28", "description": "Went there on a Friday night at 8pm, for table for 2.\n\nPro: \nHomemade mushroom pasta was sooooooooooooooo good.  Al dente homemade pasta with roasted mixed wild mushrooms and a little bit of crunchy breadcrumbs. Yum.  \n\nCon: \n1. Wait time was a big horrible consider it was Friday night at 8pm.  We called ahead of time and still waited for 30 minutes.\n2. Depends on your liking, me and my date were being seated on the long table across each other, it was hard to talk and hear each other with the loud music.  we ended up have to yell at each other and if we still cannot hear by the 3rd time, we just smile and pretend we understood. LOL.", "author": "Piggy C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-28", "description": "Always impeccable from the service/staff and food.\n\nThe chocolate pudding is hands down the best dessert I have ever had.\n\nNot a fan of their lunch menu though, dinner is their strong suit.", "author": "C B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-15", "description": "Great place to eat and drinks are wonderful. All of the seafood is delightful; I had the whole trout and it was spectacular!  And the complimentary bread-yum.\n\nThe waitress and the bartender here were so nice too; they seemed genuinely happy to serve you! \n\nIt's small so call ahead same-day to put your name on the list or grab a drink if there is room at the bar. Our wait for 4 on a sunday night was about 20 minutes.", "author": "Utaukwa A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-26", "description": "Limited but delicious menu, friendly service, warm and funky atmosphere, full of happy diners ... This is truly the bar/restaurant where \"everyone knows your name.\"  Fresh bread with sea salt pared with the appetizer olives and proseco is a great way to start.  Don't miss the roast chicken on spinach with puréed celery root. Cap it off with the dark chocolate pudding. Heaven. Can't wait to go again.", "author": "Dana T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-01-02", "description": "3 stars only because I came here on New Years and they were not on their game for the biggest night of the year. \n\nUnder normal circumstances this is a solid, good restaurant that most people will love. \n\nOn New Years though when reservation is at 10:30pm and I sit down 30 min later that a negative but they made up for it with our first round of drinks being comped so that was gracious of them.\n\n\"See they know how to take a reservation but they don't know how to hold the reservation. and thats really the most important part of the reservation. The holding. Anyone can just take them\"- Jerry Seinfeld \n\nTheir 5 course fell short. \n\nCroquette to start was very good , in my opinion the best part of the meal. Needed very little to no improvement except that they gave you one which was weak. almost an amuse not a course. \n\n2nd course was a beautiful plating of an octopus dish that would have been great except they have cut the octopus so razor thin you get no texture or flavor from it when its on the plate with the onions and capers. You lose the octo and the main star of the dish is basically lost in a small pool of olive oil.\n\n3rd course was black pepper strozzapreti with some black truffles. Someone went ape shit with the black pepper and had everyone! at my table coughing. I made mention to the server about it saying \n\"I think someone went a little crazy with the black pepper\" she replied\n\"oh really, you can never get to crazy with black pepper\" as she walked away. \nA friend of mine at the table simply wanted to retaliate by saying\n\"oh you can never go too crazy on a tip\". \nHad their not been forced gratuity this staff would've gotten stiffed off the industry lunacy of 20%. \n\nAgain! the servers get the tips not the cooks. The cooks cook all day the servers come in late and all they do is run our the manufactured product that took all day to make and kiss your ass to make you feel good. Yet they make more money producing less and having less talent and skill. Not hard to kiss someone's ass and make them feel good for literally 10-15 min of total social contact in a 1.5 hrs sit. \n\nYou sat us late, but comped us a around. \nPoorly paced the meal where the first 3 courses are flying and then its a stand still , not even a crawl for 30 min and then another 20 min after that sitting there. You rush food then slow it way the fuck down. \nMidnight came and a table of 8 got 6 glasses of champagne. Without anyone coming back to bring the other two until I said something. \nWe even sent a drink back that was not for us, we could have been dicks and taken a drink we never ordered. Told us you would take it off our bill, no shit!\n\n4th course was fantastic, roasted venison was great, not one complaint everyone loved it and anyone would and should.\n\n5th course , Tiramisu in a cup. Fuck you it sucked! aspire for something more on New Years. come on, this place is so much better than that.\n\nOverall, service sucked. For New Years the entire meal wasn't that great. \n\nBeen here for brunch and dinner both times were great. I would give 4 stars but you sucked ass on New Years when you should've picked up your game. \nI expected better because I've gotten better. I left there concluding I should have gone elsewhere for dinner and that was the most disappointing thing since I actually like this place.", "author": "Dimitri K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-23", "description": "This is my #1 favorite restaurant in the Cobble Hill/Boerum Hill area. Food is fresh and delicious. Cocktails are inventive. Ambiance is as perfect for first or second date as it is for an anniversary or Valentine's Day. It's small and often full, but doesn't feel crowded once you sit down. Prices are what you should expect: not cheap, but certainly not overly expensive. The servers know their stuff and strike that balance between can't-be-found and won't-go-away. I've come here several times and have not only never been disappointed but always walk away re-impressed.\n\nWhat else can I say. It's great. Just go.", "author": "William H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-18", "description": "This is what I have to say 'bout Boerum Hill newcomer Rucola.\n\nI am super happy to have it in the neighborhood. It's exactly what we needed.\nEveryone that works there is outrageously friendly. Which stands out to me, especially given the hipster pedigree.\nThe place is gorgeous. Sure, it's small, and a little loud. Who cares? \nThe wine list is full of serious bargains, and the cocktail list is not messing around either.\nThe food isn't quite there yet, but nothing was off to the point of mentioning it. I just think they haven't hit their stride in the kitchen, but I fully expect they will. Can't wait to see what they do for breakfast.", "author": "Diana R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-17", "description": "We had our wedding dinner at Rucola and it could not have been nicer. The restaurant had a warm, cozy atmosphere and the staff was so accommodating to us and our guests allowing us to concentrate on mingling and celebrating the occasion. Food is really great here too.", "author": "Kalle G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-15", "description": "Food was great. Small restaurant but busy. Ambiance is relaxing but romantic. Their chef's meat, cheese, and antipasti platter was great! Only two home-made pastas but they were both delicious! I've been to Italy and this food is comparable! I would love to go back there one day.", "author": "Flora G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-24", "description": "Damn fine place. We shut this place down last night, lots of screaming and drinking, probably wasn't appreciated, but the staff is always great. The food is amazing, they have a very simple mainstays, which everyone of them are delicious.\n\n A bit pricey but it's Boerum Hill so can't really complain about that. Every time I'm over in the are I always make a visit.", "author": "Anthony S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-27", "description": "Love the warm rustic vibe. Love the food even more.\n\nStarted with the Chef's antipasto with cheese and veggies (no meat, no fennel, as they totally catered to our request). Roasted cauliflower was the star of the plate, with a strong supporting cast of 2 delicious cheeses (don't remember which ones), pear jam, roasted beets w/ balsamic, olives, eggplant caponata and warm crusty bread.\n\nFor entree, we went with Garganelli with tomato-almond pesto, cherry heirloom tomatoes and zucchini--hearty and comforting. Perfectly al dente garganelli tubes were bathed in a slight nuttiness from the pesto, creaminess and a little tang from the tomatoes. Spectacular. Hell, I'd bathe in it too!\n\nAnd when it came to dessert, my friend asked me split one or get two?...  Two, duh! My motto: never skip dessert! She was leaning more chocolate, I was leaning more blueberry. Went with the Chocolate pudding with olive oil sea salt \u0026 whipped cream. Rich, deep cocoa flavor with bursts of zing from the flecks of sea salt--this ain't your typical Jell-o pudding! It's amazing, as I love a good sweet \u0026 salty combo. And the blueberry almond cake with sea salt and whipped cream was tart, airy, not terribly sweet, nutty, buttery... a good balance of textures and flavors and altogether delicious.\n\nDrinks were dangerously refreshing as well and simply elevated our already amazing meal.\n\nSimply put, it's places like Rucola that are making me fall in love with Italian.", "author": "Elvir C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-20", "description": "Rucola is a hidden gem in the middle of residential Boerum Hill, and it just sort of emerges from among the brownstones as you walk along Dean St.  You wouldn't know from its exterior, but this place is hopping for brunch, so my boyfriend and I squeezed in between two other brunching couples and quickly made the decision that, yes, we were getting cocktails.\n \nI got the Rucola Bloody Mary and was blown away by its veritable punch of flavor and spice.  This is not the kind of bloody mary that you suck down because it tastes like V8 and vodka.  As I kept drinking it, I was impressed that the spice only seemed to build, but never reached painful levels.  My boyfriend got a cocktail that involved Scotch but I can't recall the name, and while he liked it, once he tasted my drink he immediately ordered one for himself as well.  \n\nFor food, I got the bacon egg and cheese sandwich, boyfriend got the broccoli rabe plate, and we shared the sweet potato gratin.  My sandwich was a standout--it was served on a fluffy roll, with wonderful chewy bacon, 2 fried eggs, some type of cheddar-y cheese, and arugula.  I loved all the flavors together, and just wished that the eggs had been runny.  Maybe you can request that?  The broccoli rabe platter was amazing.  Legit, amazing.  Tender broccoli rabe, tasty beans, an egg with a runny yolk, and a sausage, all mixed together.  It hits all those spots--savory, salty, snappy sausage, and some veggies.  Then the sweet potato gratin was just an explosion of cheesy goodness.  It was a really small little square of this confection, but it was so flavorful it didn't really matter.  \n\nIf you're in the mood for something healthier, the yogurt and granola that many people were ordering looked delicious and seemed like a decent portion.", "author": "Maeve C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-04", "description": "Don't walk. Don't pass go. Don't collect $200. RUN to Rucola. I don't live in the neighborhood. I don't even like Italian food in general, but this little romantic spot in the heart of Boerum Hill is absolutely amazing! From the moment we walked in, we were treated ever so graciously by our host and waitress. Their customer service is impeccable! The ambiance is perfect for a cozy evening out with your family, impressing a few out-of-towners, a much-needed late night dinner with your best friends or a delicious dinner with your love. \n\nWe tried to order an eclectic mix of everything on the menu. Here are my favorites (mind you, this list includes EVERYTHING we ordered - yes, it's that good): Chef's selection of cheese, meat and vegetable antipasti (if you think it's too much, don't miss out on the pickled fennel - it's to die!), Roasted Carrots salad (so full of flavor - a must), Crispy Brussel Sprouts, Garganelli with short rib ragu (the house-made pastas change, so I apologize if you miss out on this incredible burst of flavor), whole roasted brook trout and the roasted chicken. I honestly don't think there is a single thing on the menu that could disappoint.  We also had a special of chicken liver mousse with kumquat on a crostini which melted in our mouths. You'd think after all of this that we would have no room for dessert, but we couldn't help ourselves. Along with Stumptown coffee and tea, we ordered the Buttermilk Panna Cotta with pear, almond and fennel pollen as well as a slice of almond cake with blood oranges (and salt, oh my!). \n\nThere are no words to describe how wonderful our experience was at Rucola. I cannot wait to return for brunch!", "author": "Alyvia M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-03-05", "description": "We went here for brunch sunday afternoon. Two fritattas, both bland and greasy, one better looking than the other. A plate of farro, also bland but with a large hen of the woods mushroom thrown in. Overall uninteresting, average menu and average food. The service was bored and disinterested, at times \"I dont get paid enough\" rude. If you have a chance check out other places nearby. The only thing likable here were the choice of cotton stems in the flowers.", "author": "S. S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-13", "description": "Loved everything we got here.  I split the chicken and steak dish with a friend and enjoyed them both.  We had creative and tasty starters as well.  Great service, cozy atmosphere - would return.", "author": "Adam S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-08", "description": "I have been to Rucola for dinner four times, most recently last night. Unfortunately last night the service was very disappointing. The food was just as amazing as the three previous times but the lack of service was a major let down and took away from the overall experience. To start, the hostess said it was an hour wait and she would call me when a table was available around 9:30. I went and grabbed drinks and when we hadn't heard anything by 9:30 we wandered back over to walk into numerous wide open tables. Next, the waiter started bringing out the appetizers before the sparking water we had ordered and when we had to ask about it he blamed the bartender. Me and my boyfriend had both ordered pasta for our main courses and the first one came out by itself. After 10 minutes the second had not come out and we again had to flag down the waiter to find out where the other pasta was. He finally brought out the second pasta only after the first was completely finished. At this point we had to switch to another waitress who informed us the credit card machine was not working so we would need to go get cash. \n\nI am hoping this was just a one off night or perhaps their regular servers were off because it was a Tuesday night (although as someone who lives close by I would hope I could expect the same great service every night of the week). The food was still excellent!", "author": "Ann G."}], "servesCuisine": "Italian", "priceRange": "$11-30", "name": "Rucola", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "190 Dean St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/ea87R47Kp_k95_fE7ginIA/ls.jpg", "@type": "Restaurant", "telephone": "+17185763209"}