{"aggregateRating": {"reviewCount": 458, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-28", "description": "I've only ever come to Rucola at 5:30 on a weekday so it's never been an issue for me grabbing a table. But Rucola is the only restaurant I recommend to people looking for a place to eat in my neighborhood. I have never eaten anything at Rucola that wasn't absolutely delicious. The portions are perfect and the food is tasty and cooked beautifully. I could eat their crudo every meal, every day, for the rest of my life. The olive oil they use is liquid heaven. Speaking of liquid heaven, their servers are chock full of knowledgeable wine recommendations and I've never not had a delicious glass of wine at Rucola. Even their salads are flavorful and delicious, and it takes quite a bit of convincing for me to truly enjoy a salad. I recommend this restaurant to everyone.", "author": "Sarah F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-08", "description": "The food and the drinks here are always delicious. Clean, highbrow, complex cocktails, and warming, hearty food. Even the asapragus is good. The setting is great - very Brooklyn-edison-bulb-underspoken-chic. \n\nThe staff may have stepped out the Portlandia Season 2 opener, The Dream of the (18)90's Is Alive In Portland. In the dozens of times I've eaten there, I've found them to be pretty cold. There are a couple of male waiters that will smile back at you or share a kind casual word, but all in all they are concerned with getting your order, capable of answering any and all questions about food and drink with expertise, and only going to have conversations with their colleagues.\n\nI once saw a waiter eating the chocolate mousse from a shot glass in the back of the bar and told him it looked pretty tasty. He blushed and joked about being ravenous, then exclaimed about all the great ingredients with true sincere joy. I felt like I'd won a big prize and/or seen a unicorn.\n\nI've learned to not take out of towners here because of the indifferent service, but NYers know the deal, and I love taking city types to the beautiful yummy spot.", "author": "Stefanie S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-11-23", "description": "Here's one of those times I schlepped out to Brooklyn and forgot to complain about it!\n\nSo, my co-worker and lady friend Ricca was having a birthday party. She lives in Brooklyn, is very VERY pro-Brooklyn, and this was a constant drain on our friendship. But since it was her birthday, and since my other co-worker and lady friend Jill R. sent me special e-mails just to make sure moi would be attendance, how could I say no? Well, I guess by opening my mouth and making that one consonant sound that forms the word, but I decided to acquiesce, suck it up, and take one for the team.\n\nThis place was cute. Dark, intimate... things I like in a place where I ultimately spend my evening. But it was loud. Loud as in, you cannot here what the person next to you is saying unless they are screaming on the inside of your earhole. I'm getting a migraine just thinking about it. I know I complain about loud places a lot, but this place... ugh. It was one of the top 5 worst.\n\nThe food was good, but the weird style of \"everyone take whatever you want\" was a little haphazard. As was the bill when that finally came. As were cocktail orders that took a little bit too long to come in. I think this place might be fine - good even - if it was for lunch or a weekday evening they weren't getting slammed with 50 people, but the night I went? I didn't really have a good dinner.\n\nMight try this place again, but not any time soon.", "author": "Ryan D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-28", "description": "Ate at the bar. Had the pork loin. It was tender and flavorful. The roast fennel was great.", "author": "Karl B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-24", "description": "Hipster doofus vibe.  Had a salami and hot peppers sandwhich nothing else..was good..picnic bench seating..strange.", "author": "Stuart B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-24", "description": "Would be a 5-star eating. I thought this neighborhood spot is really cute and cozy.  Immediately when we got there we were seated.  The service was a quick turn around.  The food was overall good but towards the end of our meal I found a hair mixed into with my veggies and it's not mine. I pointed it out to the waitress and she came back and took out the charge for that dish, so at least they were apologetic about it. Other than that, I thought the overall experience was pleasant, maybe the cooks need to wear hair nets?", "author": "Dreamwultz Z."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-01", "description": "Went here on Thursday night with a party of 3.  The service was excellent, as I got there a quarter before 7 and they sat me before the other 2 in my party came.  The host was outside and very attentive and friendly.\n\nI was offered wine/drinks on 3 separate occasions, which shows the eager staff, but even when they were offering, I never felt like they were pushy.  We were able to sit and enjoy dinner at a leisurely pace, and the ambiance was nice.\n\nThe food it self was excellent.  My wife loved her Pesto Pasta dish, and we'll be back for it. I had the Brook Trout, which was a whole fish with olives, lemon, and Parsley (I think?).  It was quite good even though I don't like Olives...My favorite dish though was the Fairy Tale Eggplant.  Crisp, with capers on top, and the most delicious eggplant dish I've ever had.  Def a try!", "author": "Simon C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-04", "description": "Perfect for a low key brunch or a delicious dinner. I've tried the short rib ravioli, phenomenal and for brunch the smoked salmon which hit the spot.", "author": "Danielle A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-11-12", "description": "It was a Thursday night around 7pm, a post-hurricane Sandy night, but it was still busy as always, I called ahead to put my name down and it was going to be a 1.5 hour wait. I was happy I could time my arrival accordingly and not have to wait there. Once we arrived there, there was maybe 15 more minutes of a wait but someone constantly kept tabs on us as to when we could expect to be seated. A good start indeed.\n\nImmediately when I stepped inside Rucola, I felt at ease. It had a charming rustic atmosphere that I wanted for my future home! We started off with the cheese platter which was pleasant, moist bread, good cheeses. I got the gnoche for my main dish which came with squash, mushrooms and kale. I also wished I had a bit more sitting/breathing/eating room. I like the sauce, it was a white sauce but it wasn't heavy at all. I did wish there was a little bit more of the mushroom and kale however. Plus, complimentary dessert! Delicious chocolate mousse.\n\nOverall, superb service and a wonderful atmosphere.", "author": "Pam H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-12-31", "description": "The food was delicious. It was a fixed price menu of $95 on new years eve. We arrived hungry  and left hungry. One mini ravioli,  four  mini carrots, one small but delicious short rib. Also five tiny raw scallops which I don't eat. They were nice enough to substitute roasted cauliflower which was also delicious but not enough. Very disappointing for the price. I've had larger appetizers.", "author": "John P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-30", "description": "Their brunch is delicious. Went here on Saturday and it was pretty packed, but we didn't have to wait for a seat. Not necessarily cheap, but not too pricey. I had a salad, my friends had the broccoli rabe and the bacon, egg and cheese. We got the apple pie from 4 \u0026 20 Blackbirds. YUM. Definitely recommend!", "author": "Kelsey B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-18", "description": "Very cute place. Very good drinks. Really nice menu - very veggie friendly - lots of options at reasonable price points... and BEST OF ALL... they will seat you until midnight. Which is amazing. Arrived with 3 friends at 11.15pm and we left happy and sated.\n\nLate night date spot!", "author": "cait l."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-11-24", "description": "There can be a wait, and it is a small restaurant...but I gave them 5 for the following:\n\nExcellent staff and service.  The wait staff is friendly, and the managers tries to accommodate you to the best of their ability.  If you call ahead it will save you some of  the frustration others had mentioned.\n\nThe food is amazing, and the servings are well proportioned.\n\nThey have an extensive Italian wine list, its pretty awesome.", "author": "Charlie M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-18", "description": "So I returned to Rucola, with super high expectations after my first trip here. The food was still very good, however not as fantastic as last time. (I'd give it 3.75 stars this time, versus 5 last time.) \n\nI ordered several vegetable antipasti dishes: beets, fennel, fried cauliflower, and the slow roasted parsnips to share. For my entree, I went for the brook trout, again. The vegetables for the most part were excellent (especially the cauliflower). However, everyone at my table was in agreement that the parsnips were over salted. This was disappointing as they would have been incredible had they not had such a heavy hand with the sea salt. I had a bite of the Sardi pasta again, which was as good as i'd remembered. The texture was just impeccable. As for the brook trout, not as much attention was paid to it as last time, it seemed. The thinly shaved garlic did not garnish the lemon slices this time. The biggest disappointment was that the texture of the bottom half of the trout was a bit mushy. Perhaps it was just frozen from the night before, as It was a Sunday evening. \n\nFor dessert, we ordered the Four \u0026 Twenty Blackbirds pie of the day: a chocolate, oat, and pecan pie. Crispy oatmeal was on top of a layer of chewy, sweet pecans. Beneath the pecans was a small layer of chocolate ganache. This was served with some of the best whipped cream i've ever tried. The pie was reminiscent of a freshly baked, chewy, chocolate chip oatmeal cookie. So good. \n\nI will be back to Rucola again, though probably not on a Sunday. Hopefully if will be more consistent on the busier nights, as I was super excited after my initial visit, having found my new favorite restaurant in the neighborhood.\n\nUPDATE: I've returned to Rucola several times and have had nothing but great experiences since. Also, i've got to mention they have an awesome wine selection,, and the New Rider was one of the best drinks i've ever had!", "author": "Sarah G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-17", "description": "My boyfriend and I came in for a small bite to eat during a weeknight. Ambience is quite cute -- love the tulips! \n\nFood was pretty good. We enjoyed the complimentary bread and olive oil. My boyfriend and I shared the arugula salad, and then the crudo, which was good but had so much olive oil that we needed more bread to dip! For my entree, I had the sardi which I also enjoyed (but the rigatoni nearby looked delicious and I kept eyeing it :( )\n\nService was just okay -- we had a male waiter who was on top of his game, but other times I felt as though some of the other servers who came to our tables weren't very in the mood to serve... We also sat right near the kitchen and cashier, so we were in an area with heavy foot traffic. \n\nOverall, a pretty good dining experience. We had only wanted to have a tiny meal but ended up spending well over $100! \n\nWould come again.", "author": "Siv L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-03-31", "description": "I had brunch at Rucola amongst several Brooklynites sharing a long cafeteria style table. They definitely pack you into this place. \n\nSitting right next me was a woman holding a newborn baby boy. He was adorable and didn't cry, so I was happy to be in the presence of him. Normally I steer clear of restaurants where I'm forced to dine so closely with anyone under the age of 10. \n\nI ordered a risotto patty with a fried egg and béchamel sauce, on a bed a arugula. It was enjoyable, albeit very small for the price I paid. Their coffee is also a bit pricey since you don't get free refills, but our server was a delightful young man who gave us free refills anyway simply because we asked about it. \n\nRucola has a beautiful decor, and is located off the beaten path of Smith Street, which is nice. \n\nI'd like to come back and try their dinner or have a drink at the bar. \n\nThe staff is friendly and welcoming at this restaurant, and good service is always a reason to come back at least one more time.  \n\nHelpful tip: you can call ahead of time during brunch and put your name on the list.", "author": "jennifer d."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-18", "description": "Venturing out to Brooklyn last week, my wife and I decided to go to Rucola. Upon arriving, we were told that the wait for a table was an hour and a half. Reluctantly we put our name in and went to a near by bar to grab a drink. After about 45 minutes a table opened up and we happily sat down for our meal. We ordered the meat and cheese plate which was spectacular, my wife ordered a pasta dish which she liked,  and I ordered the dorade for my entree. The dorade was perfect, well seasoned with crispy skin and fresh seasonal vegetables on the side. It was one of the best fish dishes I have had in recent memory. Overall it was a great experience", "author": "Rahul S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-22", "description": "My new favorite! Love this place- a neighborhood spot that's becoming a bit of a destination. My favorites: the salads, charcuterie, fantastic wine list and excellent cocktails, and dessert pies all from Brooklyn's Four and Twenty Blackbirds. The service is also above and beyond what I normally experience- I even saw employees walking patrons out to say \"goodnight\" and \"thank you for coming.\"", "author": "Shari H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-09", "description": "Rucola is THE spot. I feel so fortunate to have stumbled upon this restaurant in my travels. The staff was super attentive. Leading the way was the bartender, Lucas, who offered great conversation and attentiveness so that I didn't feel as if I was eating alone. The food was excellent, the attention to detail and execution was impeccable. Every bite I took directly refuted the laws of diminishing returns. Incredible. I was also lucky enough to meet one of the owners, Julian, who sat outside and shared a beer and slice of 420 Blackbirds pie with me. What an incredible guy. It made me really feel at home. As patrons walked out of the restaurant there was a chorus of 'oh my god that was delicious' and 'we have to come back soon'.  I can't rate or recommend this restaurant high enough. If yelp offered 6 stars Rucola would be a ten. If I find myself in Brooklyn again, I will most certainly come back!", "author": "Lenny S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-05-14", "description": "I loved this place. My partner and I had our first date here, and then our 6 month anniversary. It's super cute and scrumptious. \n\nAnd then I went in for lunch earlier today. When I asked the server how his day was going he scowled and said \"terrible\". It went down hill from there, and I walked out rather than try to enjoy myself under is hateful glare.\n\nI won't be returning.", "author": "Shelagh M."}], "servesCuisine": "Italian", "priceRange": "$11-30", "name": "Rucola", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "190 Dean St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/ea87R47Kp_k95_fE7ginIA/ls.jpg", "@type": "Restaurant", "telephone": "+17185763209"}