{"aggregateRating": {"reviewCount": 458, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-07", "description": "Hands down the best pasta I've had in NYC to date. I had the spinach ravioli. With the burrata prosciutto while my friends had the truffle oil pasta. The food was divine. In addition we had several of  bottles of red wine which were delicious.", "author": "Adam Z."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-12", "description": "Consistently one of the best brunch and dinner spots in Boerum Hill. Always impressed by the quality of the food, service and value.", "author": "Sam M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-21", "description": "Rucola is a cozy Brooklyn neighborhood restaurant with fresh, green food and a charming neighborhood feel. With the solid execution and quality ingredients, is worth the mini splurge and leisurely pace. Portion sizes can be slight and service can be slow, so I would definitely recommend for days where there isn't an hour long wait.  \n\nI've been here for lunch on a Friday and Sunday brunch around 11:30 am. I was seated immediately every time, but saw a huge rush of people about half an hour later. The inside tables are a bit close together and it can get a little noisy when its full. There are only two outdoor tables, which are stroller friendly. Otherwise, leave the stroller parked at the door. There are no steps, so definitely wheelchair friendly dining, but the bathroom is not compliant. They do not do reservations. \n\nFood is really good. I've had the dutch baby with the tahitian vanilla custard - amazing. Really mind blowing light and crisp and buttery and soft and just sweet enough with perfect summer fruit. I've also had the farro salad, which is green, wholesome, and deliciously refreshing, yet filling. Hubby has loved the breakfast sandwich with bacon and egg. He's had mixed feelings about the slow roasted pork sandwich, which he felt was a bit dry and too sour. We haven't yet tried Rucola for dinner, but the menu looks great. (If only the lines weren't so long!)", "author": "Suanne L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-03-23", "description": "Besides the odd vibe I got from it, the menu is very limited and the food is bland. The French toast cost $13 and we got three tiny slices. The mimosa I got was really good but I definitely won't be returning here.", "author": "Karli D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-02", "description": "My cousin I meet up once a month for a dinner date, and when she suggested Rucola I was excited because she is a bonafied foodie and knows what she's talking about and I had been meaning to come here for awhile. This is a cozy, slightly rustic space with an intimate feel - perfect for date night or a catch up with a friend.\n\n We were seated without a wait at the communal \"farm\" table and service was swift and attentive, starting with drinks (the Jack Rose and Shozu Fizz...delicious!) complimentary bread, and escarole salad. The honey-vinaigrette dressing was some of the best I've ever had, and paired with the cocktails was the perfect start to a beautiful late spring evening in Brooklyn.\n\nOpting to for once not order pasta (there were only 2 options) we went with the whole trout and chicken dishes, which were small for the price but probably for the best (we left comfortably full). I personally thought that the chicken was a bit dry, but it was nice when paired with the artichokes and onions. The trout was relatively flavorful, though I feel that I wanted wanted more out of it. While I like a place that has a smaller, more specialized menu, I felt that the choices were limited in terms of entrees, and less so when it came to charcuterie and small plates/sides. Though tempting to go back and order a series of smaller dishes in lieu of an entree, doing so could result in some pretty big spending.\n\nAs a reward for not getting pasta, we ordered the ice cream special: tahitian vanilla with chocolate fudge. This was probably the highlight of the entire meal - perfectly minty, salty and sweet. \n\nA part of me wants to try dinner here again, and I've also heard great things about brunch. But if after that the entrees don't completely stand out I may just swing back around when in Boerum Hill for some yummy appetizers, drinks, and hell maybe even dessert.", "author": "Ariella G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-29", "description": "Came here for my birthday dinner a few years ago and me and my sister were totally impressed! Great food, great service, excellent rustic vibe. They have amazing seafood and cocktails, and it's such a treat to go to a nice restaurant and splurge a little while still enjoying a healthy, balanced meal. Service was friendly and attentive, but not overbearing, which is the sweet spot for me. Can't wait to go back.", "author": "Amanda H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-02-12", "description": "Went to this adorable restaurant last Wednesday around 830 pm and it was packed! It's a tiny restaurant and very popular so I was expecting a short wait and had a seat at the bar until my table was ready. The tables are crammed pretty closely together so don't expect to have too much privacy for your conversations, I felt like I was basically sitting with the couple next to me but on the plus side they were friendly! We shared the crudo appetizer which I thought was really nice and fresh and also ordered the mushroom pasta. I'm usually not a fan of creamy pastas but that was the only vegetarian pasta dish so I went with that. It was really flavor full and I could tell that the noodles were homemade. The menu is seasonal so I would love to come back and see what they have for spring, I also saw they have an awesome brunch!", "author": "Danielle W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-02", "description": "Perhaps my all time favorite place in Brooklyn, Rucola has clean and scrumptious food! I love the vibes, the drink menus, and the staff.\n\nThe arugula salad is so delicious! The pasta is epic and changes seasonally.\n\nSave room for dessert their cookies are life!", "author": "Kellee K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-04-24", "description": "If you don't mind a wait (took us 30+ minutes to get seated), it's definitely worth waiting for.  Brook trout was excellent ... very fresh and tender. Chocolate pudding was very rich and tasty.  The place is a bit cramped, and loud, but service was attentive and friendly ... a good  choice (if you can get in ...)", "author": "John C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-22", "description": "This may be the ideal neighborhood restaurant. Which I feel pretty good about, because I live in the neighborhood. \n\nThings You Should Know About Rucola:\n\n1. It makes me want to use the word 'cozy.' From the moment you walk in past the gorgeous ironwork exterior until you leave the rustic, comfortable glow of each candlelit table, you will feel at home. \n\n2. They serve breakfast, lunch, and dinner, and all are stellar thanks to quality across the entire menu. Which means it's always a good decision. Salads, sandwiches, charcuterie, seafood, pasta...it's got something for everyone, and it's all good.\n\n3. Dinner is especially nice because wine and the aforementioned candlelit tables, but breakfast may be my favorite (I never seem to make it in for lunch, because it's not as acceptable to drink lots of wine in the middle of the day). On a weekday when I can sneak away from work for a bit, with the natural light illuminating the round table in the window, I'd rather be here than just about anywhere else. \n\n4. Remember back when they first opened, and I mentioned how after I floated Rucola as an option for dinner, my idiot friends would invariably respond with long, drawn out yells (a la the commercials of a cough-drop brand that shall remain nameless)? Well, as a direct result I've grown apart from those idiots, and grown closer to Rucola. I wouldn't say me and Rucola are best friends, because it's a restaurant and not a person. But we're pretty good friends. I'd invite them to my wedding, and try not to get offended when I didn't get invited to theirs because they are much, much more popular than I am and I really don't come in as much as I should. \n\n5. It still isn't perfect. Sure, dishes have been under or over seasoned, waitresses have forgotten about orders (or us entirely), and I don't really like waiting for dinner. But you know what? I'm not claiming to be perfect either. Like I said, we're still friends, and perfection is a lot to demand from your friends. I'll settle for damn good, especially since Rucola may be my only friend at this point.\n\nOh, and when they celebrated their second anniversary a few years back, they left bunches of ramps outside the restaurant for anyone that was paying attention. That was nice. And still the best risotto I've ever made. x\n\nThanks for being here, Rucola: https://www.youtube.com/watch?v=KiQzUEc_FmI", "author": "Peter D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-02", "description": "Good neighborhood spot. Great for brunch or a cozy dinner meal. Has a homey, neighborhood feel!", "author": "Luisa D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-13", "description": "Love this spot!! One of my favorite spots in the neighborhood!! Most recently I enjoyed a plethora of appetizers with my delish wine! Muscles, Hamachi, and Steak tartar to die for!! Wrapped my meal up with an incredible homemade pasta dish. Yum!!", "author": "Beth R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-31", "description": "My affinity for this place probably has something to do with the fact I had been singing the RICOLAAAAAA thing every single day leading up to this place or that it took 7 minutes to get there on foot. No subways... no ubers/taxis, just about a half mile on foot. It could not have come at a better time... the end of our trip. I was starting to see the glaring ugliness of New York. I think New York is probably the greatest food city in America basically out of necessity. High and super dense population, you gotta feed those millions somehow. Anyway... I digress. \n \nThis place is phenomenal. Great place for brunch and for some not so common takes on the classics. And decent size portion to price ratio... for New York.\n \nHad the pork sandwich that was delicious and mainly bread. Thankfully the bread was really good you could still manage to get some taste from the pork and green tomato. All it actually needs is some sort of sauce to soften the bread and that matches the unique combo of green tomato and pork. (They do have a sauce on it but... wasn't anything special).\n \nBrioche French Toast was a welcome hit to the pallet. Perfectly crunchy outside with a warm soft center and strawberry rhubarb for a nice not too sweet topping. Highly recommend.\n \nWe had some pie, I don't remember the name of it though. I think it was the lime pie, and don't worry they don't make it in house anyway so... it varies day to day. Good pie, maybe it was lemon. I honestly don't remember it has been almost two weeks now.\n \nTHE VERDICT:\nIf you are in Brooklyn I suggest this place for brunch. It might not be a go all the way out of your way place but it was a really great breakfast that was close by and a very nice location. You are basically going to the very typical New York style place right now, a little rustic and vintage. I had a great time and the food was good enough for a 4-star review. Probably my least enthusiastic 4-star review ever... screw you.", "author": "Alex S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-02", "description": "Outstanding. We were pleased with everything: food/wine selection, ambiance, service.\n\nMust try: THE HOMEMADE PASTA... So delicious. There were two options so we got one of each: (1) rigatoni with pork bolognese, nutmeg, grana padano and (2) campanelle with porcini mushrooms, rosemary, sapore del piave\nBoth dishes were balanced and portioned perfectly as to not be overwhelming or heavy. There were only a few flavors per dish but done so, so well.\nWe also shared an assortment of meat, cheese, and antipasti to start. The entire plate was lovely but the balsamic roasted beets were definitely a standout for me.\nEven the salad we chose was impressive... The escarole with toasted almonds, smoked feta, and lemon wildflower honey vinaigrette was so simple yet super tasty and large enough for us to share.\n\nOverall, I think Rucola does a great job combining just a few ingredients, yet producing an outstanding dish.\nGreat food, lovely atmosphere(intimate and cozy, well decorated), and attentive service. I hope I find myself here again.", "author": "Mala L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-05-01", "description": "Just park your triple wide baby stroller at the door, come on in and join feeding time at the nursery. Good God...we showed up at 6 on a Sunday evening and the place was mobbed with hip Caucasian families. The noise level was ratcheted up to 11 and the conversation at the adjoining tables consisted of, \"Madeline, please stop screaming please\" and \"yes Henry, the noodles taste just like the ones Daddy Josh makes\". \nThe food? Can't really give a honest review. I just scarfed down whatever was placed in front of me and beat feet out of there before the food started flying.", "author": "Moe B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-27", "description": "This is a nice, small restaurant that is very busy. The service was friendly and even though there was a massive amount of people steadily flowing through the door, the servers still interacted and made sure you were ok. I had the Country Breakfast and my friend had the French toast which were both manageable and really yummy. I definitely recommend this place if you are near Dekalb Avenue and you want a yummy bite to eat.", "author": "Katie D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-19", "description": "Loved this place! One of the finest Italian restaurants in the neighborhood. The ambience is nice, the place is super cute. Have a decent selection wines, and if you are not into wines they have a good selection of cocktails too. The food was delicious we got spaghetti and steak both were delicious. Highly recommend this place.", "author": "Megha G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-02-21", "description": "It was ok. Portions are on the smaller side. I'm not sure why this place has such great reviews on yelp.", "author": "Cathy J."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-11-29", "description": "This place is SO AESTHETICALLY PLEASING, but I came out feeling much more claustrophobic than I initially ever want to be. If you have a larger group and you're by the windows, that is probably the best spot in the house. Now, the cramped quarters of a place doesn't deter me from trying new places because I like my share of hole in the wall areas, but trying to fit everyone in and then trying to provide service for all the tables was more of a nightmare than anything else. \n\nGranted it was rainy so it may have been more packed than usual, it seemed that there just wasn't enough people to wait on all the tables. It took a while to get our coffee and then a while longer to receive our food. I went in a group of three and it was pretty difficult to hear the other two people I was with because conversations surrounding us would cut into ours. For the price paid to coffee and breakfast, the food was mediocre and I wasn't a particularly huge fan of the taste of their coffee. For some reason, this place can get pretty packed during brunch time, so I'm hoping my experience was just an anomaly!", "author": "Sherry D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-06", "description": "My favorite restaurant in NY. Farmhouse Italian style dishes that never disappoint. Every single thing on the menu is amazing. The vibe is very laid back and chic. A great place to take a date or go out with friends and family. So happy that it's down the block from us!", "author": "Jesse M."}], "servesCuisine": "Italian", "priceRange": "$11-30", "name": "Rucola", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "190 Dean St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/ea87R47Kp_k95_fE7ginIA/ls.jpg", "@type": "Restaurant", "telephone": "+17185763209"}