{"aggregateRating": {"reviewCount": 458, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-07-22", "description": "Bartender was an asshole.\nI don't know what his problem was, but man he was just some tight shirt wearing greaseball asshole who treated me like shit. Gave him no lip, said yes, please and thank you, but for whatever reason he decided to act like some kind of weird power hungry crazed man and told me that I was drunk after pouring me my 3rd glass of wine (btw with dinner). Super confused why he thought that as I was alone and not even talking to anyone at the bar just eating my food and minding my own business. I asked what he was talking about and he asked if he should call the police. Huh???!!! I was stunned, confused and a bit terrified. I paid my bill. No tip of course. And then found the manager outside who apologized for this dude's behavior. Still super confused!!!", "author": "Deanna S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-30", "description": "Romantic restaurant, great ambiance. Good service. They start you off with delicious bread and olive oil to dip. \nThe Roasted Chicken entrée and Bucatini pasta dish were incredible. I would definitely recommend for a date night or if you're in the mood for some good Italian food.\n\n** I will add that they do change menu items, the first chicken entrée was my favorite and the next time I went I was disappointed to see a new chicken dish. None the less, they have excellent food.", "author": "Hana K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-21", "description": "The chef deserves a raise. \nThe place was completely packed last night and for good reason. The service was good. The cocktails we had were great and the food was well worth the price.\nIt got a bit noisy since it was so full but you forget the noise the second the food touches your tongue.", "author": "nick h."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-12", "description": "This is our go-to spot to local spot and everyone we take here raves about it! The food is delicious and it's a rare place where you can put together a totally satisfying gluten-free, vegetable-centric and/or lean protein meal if you like, but that would of course mean resisting their focaccia bread with incredible olive oil that comes with the meal. All of the entrees are stellar and the cheese and charcuterie plate is top notch. Brunch options run the full gamut from decadent to super clean- you can actually get an amazing salad and green juice on their brunch menu, somewhat rare for french-toast-and-whipped-ricotta-with-bacon loving Brooklyn! In addition to the quality of the food, the ambience also really sets this place apart. The lighting inside warm and beautiful. Only potential issues are it's pretty tiny inside and they don't take reservations for small parties, but I have found they try to help you out if you call and they will take your name and let you know when your table is ready, so you can always grab a drink elsewhere or walk around this beautiful neighborhood in the meantime.", "author": "Tara R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-05", "description": "We took the ferry over from Rockaway and arrived early in the evening. Had the privilege of watching Rucola go from an intimate tete a tete to a comfy friendly meet up spot. The staff was attentive and friendly from the get go. Were I to start on how perfect the food was, we'd be here forever; pork that falls off the bone, scallops melt in your mouth... Do yourself the favor and come up here, like, yesterday.", "author": "Marieke B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-06", "description": "This review is long overdue, regarding our private event at Rucola.\n\nMy husband and I held our wedding at Rucola on a Friday afternoon in May 2015. From the time I contacted Rucola to inquire about using their space for our wedding, they were so incredible and gracious. After meeting the owner, Julian, and trying Rucola's food, it was a no brainer for us. \n\nWe had 33 guests which fit perfectly in the space, full but not tight at all. We held our ceremony and reception inside Rucola; the decor and lighting is so beautiful, our photos turned out amazing.\n\nThe staff was so wonderful leading up to our event and the day of. The food was phenomenal, all of our guests enjoyed it. Overall we had the best day and we are so happy we picked Rucola for our wedding venue!", "author": "Mary P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-17", "description": "If you are going to read this, please do so in totality including the update.\n\nThis review is more about the treatment of service I recieved then it is about the quality of the food. For what it's worth I'm solely basing the food review on the Chocolate Pudding. Also, I took it to go. I did not actually dine in the restaurant. My experience with the service is really upsetting. I entered into the restaurant about 11pm, which was an hour before they would close. Additionally there was a couple who came in immediately after me, who were seated for dinner so it just to show you that the kitchen was still open. \n\nAs I entered and moved toward the bar I let the bartender know  I wanted to place a to-go order and all I wanted was the chocolate pudding. However, I felt as though that I was not welcome in this establishment,  the bartender seemed very standoffish in the manner in which she presented the menu, (flicking it at me). Also, in the manner in which she handed me the bill.  When she handed me the chocolate pudding in an 8-ounce coffee cup which wasn't even filled to the top as you can see in the photo. Also, without even so much in a bag without any utensils and without a napkin. Of course I did ask for these things and was told they did not have any. Really? No to go utensils or napkins???. The fact I asked for a bag came with a facial expression reserved for maggots.It really was not necessary. This is a reflection of the ownership. This individual should not be working in service, nor in any person to person capacity.\n\nFor what it's worth I did tip the bartender 30% simply because I work in service as well. I know what it's like to stand on your feet for 12 hours in a day,  but to feel like I was more of a nuisance then a patron. Uncalled for. This establishment will never ever receive another dollar from me again. There is no reason to justify treating someone as if they do not belong in your place of business especially if they themselves are not the owners. I feel really bad that this had to happen and moreover I feel even worse knowing that this has happened to other people, as stated in other reviews. \n\nFinally,  the chocolate moose was something out of this world and I never thought olive oil and sea salt on chocolate pudding would taste so wonderful,  so I appreciate knowing they had a quality delicious dessert item. Unfortunately it will be the last time I ever have it from here again.\n\nTo the owners: Replace your FOH staff, it will be the best decision you could do for your business.\n\nSincerely,\n\nA patron who contributes to your bottom line. Get it?\n\nUPDATE\n\nThe owner of Rucola (Julian) contacted me the following day, and expressed his sincere apology. He also expressed the treatment I received was an isolated incident and not indicative of their standard and procedures. I felt comfortable with our correspondence. I have updated my post as well as my rating to reflect the totality of the decorum, the food, the service and price.", "author": "Basher N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-10", "description": "Great place for brunch!  Gorgeous decor with a really distinct rustic weathered-wood theme going on -- I would kill to have this place be my kitchen / dining room.  \n\nI came here with a few friends for brunch on a Saturday -- prices are reasonable, and servings are also fair for the price (especially sandwich plates).  I had the smoked salmon platter with deliciously crispy potato pancakes and sour cream, which was good and filling, and also the (very creamy and rich!) yogurt topped with granola / berries / local honey.  The coffee selections are a little bit on the pricey side.  Overall, adorable farm-themed place that I will be looking forward to visiting again for dinner or regular lunch!", "author": "Anita T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-04", "description": "Number 1 choice in our neighborhood. This restaurant embodies NYC. Dark, romantic, lively and great food. Pastas are a standout.", "author": "Jase M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-12-10", "description": "This small trendy neighborhood restaurant was quite crowded on the Sunday morning we visited. Fortunately the wait was short. We were seated at the big communal table in the center of the room. The décor is typical of places like this: exposed brick wall, long counter on one side.  The Green Juice made up of squeezed kale, cucumber, carrot, parsley, ginger, celery and lemon might sound nutritional but was a bit hard to imbibe. What sacrifices we made for good health. The side fennel sausage was a bit on the salty side. Both the bacon, egg \u0026 and cheese sandwich and the roasted pork sandwich were tasty and satisfying, however.", "author": "Geri C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-05", "description": "Cute, quaint, good food, strong hipster vibe.  Not sure about adding all that spiciness in pastas, seems to take a bit away from its simplicity, but the service is great and place very adorable especially if you get a seat up front by the little window alcove.\n\nOne big plus is this place opens late.", "author": "Annie H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-27", "description": "I just moved to the hood and discovered Rucola on a nighttime walk and boy am I glad I did.\n\nThe food here is stellar, seriously something to write home about.  Everything I have tasted has been top notch and I've been here handful of times already (both brunch and dinner).  \n\nThe ambience is sweet, killer windows that look onto Bond and Dean.  The pasta is perfect (even though there's only two regular pasta dishes and sometimes one special) I could eat it all day every day.  The heirloom tomato burrata situation???  Let me tell you, I eat burrata everywhere I go, this may be the best I've ever had.\n\nI am giving it four stars because of the service.  It's not super helpful and it takes 30+ minutes between starters and entrees (or so it has a majority of my times there).  As a former server I know the number one thing you should never say to a customer is a hard \"NO,\" there should always be some sort of suggestion or leveling, I don't get that here.\n\nNonetheless, i will continue to go back because the food outweighs all of those things and if I could, I'd marry Rucola.\n\nIf you don't live in the hood, IT'S WORTH THE JOURNEY TO GET HERE.", "author": "Taylor D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-06", "description": "WE LICKED OUR PASTA PLATE CLEAN. SERIOUSLY - PLATE IN FACE.\n\nThe fresh homemade pasta at Rucola is like no other. A total knock-out. If you plan to go, just go to the gym that day and make sure you are aware that you will engorge your face with some of the best carbs in the area. Have a bowl... or two... or three?\n\nThe last time that we ventured to Rucola the following happened:\n1) I ordered the Black Sea Bass (may have been a special),\n2) Spouse ordered some unmemorable meat dish,\n3) We ate our entrees and unmemorable appetizers and thought bleh - what's the big deal about this place,\n4) Table next to us was raving about some pasta dish,\n5) We ordered the pasta dish, \n6) After one bite each, our insides exploded with WTF - HOW IS THIS POSSIBLE??? The pasta was so simple, few ingredients, but exploded. A Shaman must have done some magic and infused the pasta with the unimaginable. \n\nI would give 5 stars if the other food was outstanding. It wasn't. But the pasta??? The pasta is amazeballs.", "author": "Fazeela S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-30", "description": "I read a recent eater article that explained how yelp reviews should be dismissed/discounted based on their factoring-in of the quality of service (or lack thereof).  I'm not sure I agree with this, especially after my most recent dining experience at rucola. I review dining holistically - there are many factors I consider when I rate a place and I believe the service quality has to one of them. In this case, our server's poor service completely detracted from what was otherwise a great meal. I won't go into specifics, but I really hope this was an off night for him (although... we actually had the same server the first time we visited the restaurant and he was the same. this time was worse). \n\nThe food, however, is outstanding. From the bread and olive oil, to the pasta (spaghetti is better IMO between the 2 options), the endive salad, the trout, the standout being the beef shank. Absolutely delicious. \n\nSuper cute atmosphere, dimly lit and very rustic feeling.  A bit tight on space (don't expect space to spread out). Wait time can be long, but there are bars nearby.", "author": "Corrina S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-16", "description": "What a great little spot in Boerum Hill! I visited a few days ago for lunch and all of the food was perfect and the service was excellent. Unfortunately I cannot remember our servers name, but she had mentioned it was her first day. I wouldn't of known if she hadn't tell me, so they obviously give their employees good training over here! I started off with a green juice, which had amazing flavor. Next we ordered the Chef's selection of antipasti, which is a great value for the $19 cost. The best part of the meal was my eggplant sandwich, very delicious. Everyone here is doing an awesome job!", "author": "Bonnie R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-29", "description": "Fresh, delicious and tasty. However, homemade bread for brunch is just a slice of crusty bread like you'd get from any italian restaurant....and breakfast sandwich with bacon, egg and cheese is really dry and boring - an egg in a dry bun with an almost undetectable amount of cheese. Blech. \n\nEverything else though is delicious and interesting!", "author": "Ash C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-25", "description": "A neighborhood favorite and a gem of a place. Uncomplicated food that's great quality and never disappoints. Reliable and friendly service and a creative and well-done bar. A place I wish I frequented more. The one drawback can be the clientele, which, typically for Brooklyn, can be entitled and obnoxious--whether they insist on navigating a stroller the size of an aircraft carrier into the tiny space or moving seats to accommodate their whims, your fellow diners might be real boors. But don't hold it against the restaurant--it's just the price of doing business in Brooklyn these days.", "author": "Harry A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-19", "description": "Left locali hungry and I stumbled upon this restaurant! Excellent service,food was good! Not really Italian but really good and felt fresh!good job for a local place", "author": "Greta P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-22", "description": "This place is adorable. You can't go wrong with this place for a date. \n\nThat said, I will say, the tables are small and close to nearby guests so don't have any illusions about a private, cosy place where you can chat loudly in privacy. \n\nThe dishes can be a little pretentious but they are yummy.", "author": "Shelly R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-01-17", "description": "Brick walls, mason jar light covers, and communal tables adorn this small Italian restaurant tucked away on a quiet corner in Boerum Hill. I visited for the first time on a Friday night with my boyfriend, surprised at how crowded it was despite the 20-degree weather and snowy streets. They had rap music playing which threw me off a bit - that, plus the odd decor, what vibe is this restaurant trying to achieve? \"Brooklyn\", my boyfriend quickly reminded. Ah, of course. Typical Brooklyn locale. \n\nWe were sat in the middle of a communal table, sandwiched between a party-of-7 birthday and a trio of friends. It was so loud! We had to shout at each other. Eventually we moved to a couple of empty stools at the bar for easier conversation and breathing room. \n\nThe food was good. We started with the Bibb Lettuce salad tossed with toasted almonds, smoked feta, and preserved lemon-wildflower honey vinaigrette, which was delicious! For entree he had the Beef Short Rib with herb spaetzle, savoy cabbage, and roasted turnips. I had the Lumache, a homemade pasta with roasted mushrooms, fontina Valle d'Aosta, and rosemary breadcrumbs. We found the short ribs to be a bit dry, and the pasta didn't taste fresh. When I see \"homemade pasta\" on the menu, I expect a fresh, doughy pasta, which this was not. Despite our nit picky critiques, we did enjoy the dishes. \n\nThe real reason we came here though was because they have Four \u0026 Twenty Blackbirds pie on the dessert menu. Their pie of the day was a chocolate pecan pie with whipped cream - delicious. \n\nService was fine. If it weren't so disruptively loud and crowded, I would have enjoyed it more.", "author": "Jeannette N."}], "servesCuisine": "Italian", "priceRange": "$11-30", "name": "Rucola", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "190 Dean St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/ea87R47Kp_k95_fE7ginIA/ls.jpg", "@type": "Restaurant", "telephone": "+17185763209"}