{"aggregateRating": {"reviewCount": 458, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-08", "description": "One of my favorite neighborhood spots. Service is always great, food is consistently delicious, and if they are serving the duck breast... have the duck breast. Not always on the menu, but I'm always walking in there with fingers crossed!", "author": "Renee I."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-03", "description": "Probably my favorite neighborhood spot for a nice dinner. I love how they are tucked away on a residential block in the heart of Boerum Hill. I've been here several times but recently came with my aunt and uncle on a cold windy night. Rucola really hit the spot. The ambiance is warm and inviting and the staff is friendly and helpful. The wait can get long and since they don't take reservations, come on the early side! \n\nFood- we started off with some of the vegetable antipasti, specifically the marinated olives, balsamic roasted beets and eggplant caponata. It all went superbly with the great bread they bring to the table. I don't even like eggplant, but they somehow made it so tasty that even I enjoyed it. For the main I got the sardi- a housemade pasta with butternut squash puree, kale and mushrooms. It was excellent. \n\nThey have tables for small parties and then they have one long table in the center of the restaurant, good for big groups or just family style seating with strangers. Can't wait to go back again soon.", "author": "Sara K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-12", "description": "Had a nice brunch here while visiting the neighborhood.  Bit of a wait and quite small and cramped but the food was excellent.  I had the smoked salmon sandwich.  Very tasty.", "author": "Erik S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-12-21", "description": "I went here recently for a late brunch with the family after a show at BAM and was extremely disappointed.  Here's a tip management: If you are going to offer brunch until 4pm, you may want to plan accordingly so you don't run out of half of your menu (no smoked salmon, no chocolate croissants, etc.).  Although the food was reasonably good for what was available, the lack of options was a disappointment.   Suffice it to say, we won't be back.", "author": "Ben S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-20", "description": "This place is cute and intimate; great for a date night. The service is quick and very helpful when it comes to picking a type of wine. The food is tasty and different. It's a nice change from the usual but not your typical Italian restaurant.", "author": "Julie J."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-06-18", "description": "This is a Charming restaurant with a limited dinner menu. We both ordered the roasted chicken which was excellent, very moist and the presentation was lovely. I also ordered the polenta and was very pleased. However, there was a large party that was quite boisterous and loud. We couldn't communicate over the noise, hear the waitress review the evening specials and it quite ruined the entire dining experience. We ordered our coffee and desert to -go, in order to escape. I won't be returning.  The restaurant management should require large parties to reserve the entire restaurant. \nI won't be returning anytime soon.", "author": "Martha S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-02-16", "description": "The food here is so yummy, but the service is not exactly welcoming. A bit of a damper on our festive occasion. Our server was a bit unpleasant, which was a shame because with so many amazing restaurants in the area, means I'd rather go somewhere else for the next get-together.", "author": "Claire B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-13", "description": "A wonderfully quaint restaurant in Brownstone Brooklyn. The food is as excellent as the service.", "author": "Terrence M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-07", "description": "I've had this place bookmarked for ages so am glad I finally got to try it last night for dinner. Knowing they didn't take reservations, we put our name down on the list and went to the Brooklyn Inn for a drink while we waited for our table. The 45 minute wait was expected for a Friday night at around 8. They called us back about 40 minutes later but when we got there, we were told that our table wasn't actually ready yet because the people were just finishing up dessert. Maybe they didn't expect us to actually come back so promptly, but it was a little annoying. We got seated about 10 minutes later.\n\nThe restaurant is so charming and cozy with it's tall open windows with indoor planter boxes. The lighting above is made out of what looked like milk bottles that covered the dim yellow light bulbs. I love the dark old weathered fixtures that give the place such character. Our waitress was friendly and great at describing the popular dishes. \n\nWe started with a bottle of the Montepulciano and a bunch of appetizers: the pickled fennel, the Sapore del Piave cheese, eggplant caponata, roasted carrots and grilled octopus. The big chunks of fennel were lightly pickled, crunchy and refreshing. The waitress described the Sapore del Piave cheese as similar to a cheddar and the best cheese she's ever had in the world - big call, lady. With that statement, I had to try it. When it came out, I thought it was more nutty and hard than a cheddar and while it was delicious, I don't think I'd say it was the best in the world. But could I say that about any cheese? There's just too much good cheese out there. I was a little disappointed to see only three thin slices of the cheese, but I did really like the homemade pear jam it came with.The roasted carrots were served on a bed of black lentils topped with goat cheese. Delicious! Carrots can be one of the most boring things to eat in my opinion but these were great. The grilled octopus was served on some pinto beans and was pretty good, and the eggplant was tasty but not that memorable. \n\nFor the main, I ordered the roasted chicken. Divine. The skin was crispy and light and the chicken was so juicy and tender. It was served on top of a creamy celery root purée with some sautéed spinach. I certainly ate the entire dish with minimal sharing.\n\nWhen it was time for dessert, our famously upselling waitress recommended the Four \u0026 Twenty Blackbirds fig crumble. I had no idea what Four \u0026 Twenty Blackbirds was but apparently it's one of the best pie places in Brooklyn, and as a Californian, I love figs so of course I ordered it. It was magical. It tasted like Christmas, and the fresh whipped cream on the side was perfection.\n\nGreat spot! I'll be back.", "author": "Tiffany F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-06", "description": "This place is a magical, romantical retreat in a sea of hipstery, overrated, overpriced Cobble Hill restaurants. Everything I've ever eaten or drank here is thoughtfully executed and delicious. Service is attentive and friendly. Just all around fantastic.", "author": "Sasha L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-15", "description": "Such a lovely spot. Intimate, romantic. Will definitely take my partner here for a special night in the future. The food was delicious and beautifully plated.", "author": "AN B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-03", "description": "An absolute gem! Wonderful warm neighborhood feel, great staff, great wines great cocktail, great food, lovely decor. I can't say enough good things! In an area with wonderful food options Rucola really\ngoes above and beyond b/c of their staffs attention to detail and accommodating nature. I may start eating here once a week!", "author": "Rachel D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-21", "description": "Very, very delicious. And thanks to the superbowl, easy for our group of 4 to snag a table. \n\nWe shared an antipasti plate-which I'd highly recommend. \n\nWhile others ordered mostly pasta items, I went for a combination of veggies and the soup.\n\nThe soup was good, and the vegetables were amazing. Perhaps one of the best brussels sprout dishes I've tried. I also snagged a few bites of the husband's roasted carrots and thought they were equally delicious. I'm not usually a cooked carrot person, but these were so nicely roasted \u0026 seasoned that they tasted more like sweet potatoes than carrot. Yum. \n\nChocolate pudding to end, and we left happy. \n\nWe'll be back soon!", "author": "Saskia S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-12-17", "description": "Awesome place, I can't wait to go back! We came in at 10:30 on Saturday night and were told that there would be a 30 minute wait. They offered to take our number and call us but we opted to hang out at the bar. The bartender did not seem to notice us at all while we waited (we were standing, as there were no seats left) and I mentioned this to the owner. He apologized profusely and really made us feel like VIPsafter that.\n\nThe food was amazing, we had the brussel sprouts, olives, and a special (baked parsnips) which were so good. I ordered the butternut squash salad-it wasn't a large serving but it was delicious.\n\n\nTip: you can call the day of to make reserverations!", "author": "Chaya L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-24", "description": "Superb pasta, great atmosphere and kind personnel, we loved the evening in this woody brick and mortar friendly restaurant.", "author": "JP A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-09-16", "description": "Usually we love this neighborhood friendly place...but tonight it was everything but. It was a Friday night...they told husband and I it was a 45 minute wait...no big deal, it's a gorgeous night we will hang outside. After 50 minutes and an estimated 15 parties sat before us we asked how much longer. The rude young man taking names told me that it would be another 45 minutes and it would of been smarter to call ahead. Not only was I caught off guard that the wait is now double our original time, he scolded me! It was now 10pm, we are starving and its too late wait another 45 minutes somewhere else or anywhere else for that matter! We left. Rude staff tonight and very unhappy with the organization of a place we used to love to frequent.", "author": "Elizabeth M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-24", "description": "I have only been here for brunch - simple yet delicious dishes.\nService is a bit slow, especially if you sit at the bar.", "author": "Michelle R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-05", "description": "Ate here a few weeks ago\ni gotta say it was pretty damn good.\nthe bronzino with olives was off the meat rack\nthey also got a great beer selection.\nonly reason their getting a 4 is cause the service sucked that day, and my friend didn't get his bronzino he got the other fish instead cause the waiter wasnt paying attention. by the time he got his branzino he was too pissed off to eat cause i was already done with mine lol", "author": "Jose S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-03", "description": "My boyfriend and I had come here before for brunch and really enjoyed it. Today we went back for dinner, and it blew us away. We sat outside both trips and will continue choosing that. Both times we've been, there have been large parties inside. The neighborhood is peaceful and the outdoor tables are lovely. The service isn't speedy but it's friendly enough and fine. We had the arugula salad, crudo, duck liver mousse with blackberries, an amazing pasta dish called garganelli, and crispy polenta. It was the sort of meal that forces you to say things like \"oh wow\" and \"oh my God\" every time you take a bite. We will keep coming back here; the food is truly transcendent.", "author": "Karyn S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-19", "description": "Rucola has done an amazing job in establishing an interesting and Brooklyn-appropriate theme inside their quaint space.  A buddy and I arrived for a quick breakfast and were pleased with the delicious coffee (Stumptown maybe?)  I had the broccoli rabe and cheese scramble and was satisfied, buts not won over by the slightly runny eggs, although I liked the combination of eggs and broccoli rabe.  My dining companion had the egg and kale sandwich which I admit, looks better to me than what I was having.  All in all a nice experience with good service.  I'd certainly return for lunch or dinner to try some of their signature dishes.", "author": "Ryan P."}], "servesCuisine": "Italian", "priceRange": "$11-30", "name": "Rucola", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "190 Dean St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/ea87R47Kp_k95_fE7ginIA/ls.jpg", "@type": "Restaurant", "telephone": "+17185763209"}