{"aggregateRating": {"reviewCount": 458, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-22", "description": "We had a wonderful dinner.  My wife, niece,  and I shared several dishes and thought everything was great.", "author": "Tom E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-07", "description": "Delicious, fresh, seasonal Italian food in cozy surroundings. My friends took me to dinner here for my birthday and I loved it. We started with braised short ribs, a branzino crudo and some nice bread. I had a squid ink linguine that was amazing and finished  with tiramisu.", "author": "J L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-15", "description": "Small quiet place (at least for brunch). Lots of quite fresh and health items. Friendly service. Not sure it'd be great for big groups", "author": "D Z."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-07", "description": "The food is great. Tasty, nicely plated, at temperature. Atmosphere is nice: quiet, cozy.\n\nProblems:\n* Portions are small. I paid $10 for a breakfast scramble that was effectively a side. Went home and ate after.\n* Server (and service) was indifferent. Didn't check on us. Wasn't alert when we tried to flag him or called out his name. Brought incorrect change.", "author": "Paul S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-02", "description": "Rucola is an Italian restaurant in Boerum Hill with a very nondescript exterior. The interior, however, is wonderful. It's boisterous, friendly, and even a little romantic (for dinner anyway).\n\nThe menu is awesome, with lots of pasta, meat and fish options (it's an Italian restaurant, after all). They also do charcuterie plates, which I highly recommend. We went with the Chef's Selection (which included various amounts of cheese, meats and a veggie antipasti on a platter for $19).\n\nWhat we got in our platter:\n-Pecorino Gran Cacio\n-Casatica di Bufala\n-Speck Alto Adige IGT\n-Finocchiona\n-Pickled fennel\n\nI liked the bufala and speck the most.\n\nFor my main, I had the leg of lamb. It came with baby carrots that were roasted to hell and back (not a bad thing, they were melty tender). It also came with anchovy butter, which thankfully didn't overpower the taste of the lamb (which was cooked perfectly).\n\nI also had a side of the crispy polenta, which was definitely crispy and definitely polenta. There was a light dusting of parmesan and light tomato sauce. It was pretty good.\n\nMy friend ordered the fingerling potatoes. An order came with a LOT. So much that one person probably couldn't finish that and an entree.\n\nWe sat at the bar, which wasn't too bad, except for the people who bypassed the host and came to the bar asking for a table.\n\nThey have a decent beer selection too!", "author": "Kenny C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-15", "description": "It was ok.   Very slow service.  Food was just ok, but the wait was incredible long. Don't go if your hungry.", "author": "Melanie T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-04-27", "description": "Prices are really reasonable for the quality, portions, and location. But the food wasn't especially impressive.\n\nThe rigatoncini ($16) and spaghetti ($17) were both good. We also shared the appetizer of three veggies ($14), crudo ($13), and lamb ($24). The flavors were ok, but nothing that really stood out.\n\nMy favorite part of our meal was the Panna cotta ($7). The texture was perfect.\n\nLeast favorite was the side of turnips ($7). Mostly tasteless and we pretty much left the whole dish untouched.\n\nOverall, an ok neighborhood restaurant, but not worth making a special trip out.", "author": "Diane Z."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-10", "description": "Our favorite neighborhood spot! This is my go-to place for quality and creative food and cocktails. Delicious farm-to-table options in farmhouse style space. It can get very cozy at the communal table and during peak hours, but worth it!", "author": "Kate B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-03", "description": "Really yummy! Excellent service, ambiance and wine list. Creative, local menus. I had the chicken, which was cooked perfectly. One note of caution though-if you are starving, be sure to order a starter. Portion sizes on the petite side.", "author": "Rebecca M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-11", "description": "Pleasant neighborhood restaurant and bar.\n\nStopped in late for a drink.\n\nCustomers moved down to make room at the bar - very friendly.\n\nPleasant staff !\n\nI enjoyed a lovely mixed drink with fresh flavors and a sprig of sage - i loved looking at the many glass bottles filled with fun flavors on the bar!!  \n\nThe cookie i ordered appeared small at first, but was bursting with flavor - perfect size !\n\nWe will go back for dinner!!!", "author": "Karen M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-01-22", "description": "Service is terrible.  Everyone seems to be doing a favor.  Food is ok but doesn't make up for everything else.", "author": "forrest z."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-08-20", "description": "My review is for brunch. I am giving it 3 stars because I think it is a bit over priced. I have been here awhile ago for dinner (I remember having a great time with friends). It is one of those very \"brooklyn\" kind of places. The ambience is great and always lively with great crowd. So it does pain me to give a 3 star review but it was just too overpriced in my opinion. I will lead with the most outrageous thing on the menu -We had one 3 inch sausage side for 6 dollars. If I had known that the  sausage side consists of one small sausage, I would not have ordered it but there it was. My boyfriend ordered pork sandwich, which was actually sized decently. But for the price, it really should have came with some sort of salads or chips. I had summer squash with eggs. I had 5 piece of potato wedge sized squash and three or four cherry tomatoes and two sunny side up eggs for 16 dollars. Again, it really was good but at the same time it really was overpriced.", "author": "June K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-15", "description": "Came here for brunch with my girlfriend and some friends - the breakfast hash was one of my favorite dishes from the whole trip! That particular dish had an amazingly rich and savory flavor which certainly hit the spot first thing in the morning!\n\nThe ambiance was quite nice - mix of quaint with almost farm house feel. Not an overly large. Real fast menu, but from what I saw they do it all very well!\n\nWould happily come back for future brunches!", "author": "Mark B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-28", "description": "Excellent Italian food (with some American accents), the place is wonderful: cosy, romantic, great decorations.\nThe service was perfect, everybody was smiling, the clients too! (I can understand, I was the same)\n\nIf you want to go for a business meeting, a date or with your family, that's the perfect place.\n\nI will come back soon!", "author": "Dorcas C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-12-06", "description": "Food was ok the server was terrible.  She was rude she had an attitude and walked away while I was talking on more than one occasion.  I will not be going back as a result of the experience.  \n\nIf you go there to eat, as you sit at your table  and become frustrated at the terrible service and bad attitude you will remember this post.  You will think why did I waste 3 hours of my life eating at a place where I was clearly warned about how bad the service would be.  You will be so upset about your decision to eat at this place. \n\nSo I told my coworker who referred me there about my experience  and she said\" yeah I should have told you the service there always sucks, but I wanted you to enjoy the food\" \n\nI wish she would have warned me about how bad the service is there and I would have passed. \n\nMy coworker went on to let me know the waitress with the tattoos on her left arm is the worst of all.  Well guess who waited on us last night? That same worst waitress. \n\nBottom line save 3 hours of your life and go elsewhere.", "author": "David T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-01", "description": "Rucola is one of my favorite brunch places in New York. The salmon dish is just perfect. The color of the salmon as it comes to your table is enough to leave you salivating. \n\nWould also recommend the Farro bowl and the egg and cheese sandwich.", "author": "Sriram K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-02", "description": "Such a great dinner spot. Local corner restaurant. Food is very authentic and insanely delicious. The timing of the food was a little bit longer than most places so don't go if yo want a fast dinner. Love this place!", "author": "Molly C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-09-11", "description": "An out of the way, kind of in the middle of nowhere restaurant that wins points for their full blast air conditioning and rustic decor more than for their food or service.\n\nWe had weekday breakfast here, which was filling but lackluster. The country breakfast, while a big plate, didn't astound at all: the potatoes were flavorless, the toast was almost burnt, and the smoked pancetta was kind of weak.\n\nAll in all, an okay breakfast spot if you're in the neighborhood but don't go out of your way.", "author": "Kristen L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-05-30", "description": "I had always wanted to come here and when it was my birthday, I thought I would give it a try! I soon\nbecame super disappointed as the service was terrible and the food was underwhelming. Not sure why we were treated the way we were but the environment here is not super welcoming to people of color who live in this neighborhood and our server had classist undertones in the way she spoke to us. The food went from either being super salty or just plain bland and overpriced. The cocktails were pretty descent so shout out the bartender here. We still tipped above 20 percent so that it's understood, we should be able to come here and be treated equitably and with respect no matter what we look like, how we are dressed, and where we come from.", "author": "Parastoo Nina M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-12", "description": "I can't wait to come back here, everything we had for brunch was fantastic:\n\n- Food - groan inducing \n- Service - attentive and warm\n- Vibe - just about the cutest place ever\n\nEverything we had was well prepared and flavorful.  I was nursing a wicked hangover, so I ordered the only known cure for a hangover, the Egg Sandwich (egg \u0026 cheese sandwich - Arugula, two farm eggs $8). The eggs were perfectly cooked and the bun was divine.  I'm not sure what cheese they use for the sandwich, but it paired very well with the arugula and eggs.  I also loved the side of olives served with the dish.  We arrived early, around noon and had to wait a few mins for a table to open up, but once we were seated it cleared out a bit.  My friend and I were catching up and lingered at our table for quite some time.  We were never rushed by the staff to settle our bill and vacate the table, quite the contrary in fact, which I really appreciated.  If you're in the area definitely come for brunch as Rucola throws down some of the best quality brunch food I have had recently.", "author": "Bloss C."}], "servesCuisine": "Italian", "priceRange": "$11-30", "name": "Rucola", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "190 Dean St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/ea87R47Kp_k95_fE7ginIA/ls.jpg", "@type": "Restaurant", "telephone": "+17185763209"}