{"aggregateRating": {"reviewCount": 458, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-01-08", "description": "This is an updated review, having been back three times in the last few months, I have to say I'm (sadly) not as impressed as i was initially. \n\nThe good: Both the beat and eggplant apps are still fabulous- simple yet flavorful. We also had a great waitress who was upbeat, aware, and super competent. \n\nThe blah: Rice ball appetizer with saffron had little to no taste. The porchetta entree involved a small piece of fatty, seemingly low quality meat over a heap of well flavored grains. Meh. The trout was just okay- again on the very bland side. The wine pours are terribly stingy and that's probably the worst offense of all.\n\nOverall the meals and pours feel cheap under the guise of 'simplicity'. No thanks.", "author": "Rachel R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-08-26", "description": "Went for a brunch with my girl friend and my baby in a stroller. The place is so cute, but the A/C wasn't working so it was a little too warm inside. Lunch menu is sandwiches and salads. Ordered slow roasted pork sandwich. I didn't check it comes with green tomato, that I can't eat as I don't eat spicy food, but overall it was delicious. Mimosa was okay, nothing special. We shared a pie, but I forgot which kind... I wish the gentleman was a little more attentive there were only 2 parties at that time and toward the end, I was eager to leave as I was sweating like a crazy person!", "author": "Mika I."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-10", "description": "Very cozy ambiance with a decent brunch menu. Had the avocado toast with tomatoes and shared the French toast with my friend who ordered the salmon plate. All in all, a nice little brunch. The service was good too. Would love to go back!", "author": "Emily R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-19", "description": "Love the food here. Went here twice. Had the cauliflower and eggplants for an appetizer and then moved on to the pastas. Everything was superbly delicious. Made the mistake to get the chocolate pudding and couldn't finish it - it was so good, though! Next time I will share it, no way to finish it otherwise. \nThe service is reasonably nice and pretty fast. We sat at the bar once and at a table another time. \n\nThe only downside is the huge wait on some weekdays and of course the weekend. It's a bit of a turn-off having to wait 40 minutes for a free spot, but I guess that's a good sign for the restaurant. \n\nWhen in doubt, I'd give 4 1/2 stars, but yelp only allows for full stars so you get my full vote, Rucola....", "author": "Laura K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-03", "description": "Lovely dinner in a very quaint, rustic restaurant in Boerum Hill. We were able to easily get a table for two at 7 pm on a Thursday night but Rucola was full by the time we left.\n\nAt the waitress's sublime suggestion, we shared a delicious cheese to start (Toma Della Rocca), served with bread and a fabulous fruit compote. It was an amazing softish, spreadable cheese. We also started with the beef carpaccio - perfectly done!\n\nBoth entrees - the spaghetti and the roasted chicken - were fantastic and we scarfed them down, barely pausing to breathe. Yummy meal. Not cheap, but very good quality for the price!!", "author": "Sol C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-17", "description": "My visit here was for one amazing couple who picked this place as their wedding reception! Thank you friends for fulfilling my appetite with the incredible food at Rucola! I have to say nothing I had was short of delicious. The menu included trout, chicken, fennel and cauliflower (among a few other dishes). I can't stress enough how much it's worth coming here and how great it was to have been a guest at such a great wedding with fabulous food and drinks! Thanks friends, thanks Rucola! 5 Stars, well deserved!", "author": "Lilian Y."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-11", "description": "A small dimly lit restaurant with closely packed tables. The food is worth it though. Small menu but everything sounded great. I had the Bolognese Rigatoni which was so rich and hearty. I would go back for that bolognese anyday !", "author": "Bridget G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-12-13", "description": "I went here for a bacon egg and cheese sandwich which was quite good. I also had the potato gratin which was also good. In fact there was nothing left on my plate. I think the three stars is a combination of the space is cramped and the hostess and servers were apathetic at best. I would have given it two stars but the food was deserving of four stars. The waitress reached for my plate and began picking it up as I still had my hand to my mouth with my last bite of sandwich. When she saw I still had half of the potato gratin remaining and that my utensils were on the plate she picked up and then put down. Also I was dining alone but not once did anyone ask if I needed anything or if the food was to my liking. \n\nI'm not sure if I would return...I might because I enjoyed the meal just not the service.", "author": "Jack Straw S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-13", "description": "My friend and I had the arugula salad to start, the whole roasted trout (fresh and light with lemon and parsley) and salmon entrees (my friend had this one, but I did have a bite of the wild mushrooms). We both enjoyed the food! Simple food, done well. There is something on the menu for everyone!\n\nMy take away, is that they're a local restaurant that really succeeds with having great food, and great staff. I'll definitely be back to try other items on the menu- especially one of their pastas! Ideally, getting a few things and sharing would be nice!", "author": "Anna T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-11-17", "description": "Went there for breakfast and I liked it. The food is good and he ambience is lovely. Although the service is terribly slow and the waiter had kind of an attitude. That was not pleasant at all. Overall cute place!", "author": "Silvia Z."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-23", "description": "We went to the Nets game on Sunday and found this Rucola through Yelp!  The stellar ratings are justified.  It is a corner location and very cozy inside.  Rucola was packed with cool happy people sitting at the bar and all the tables. The six of us had a quartine of wine, shared an antipasto plate (the accompanying bread was awesome), chicken liver mousse, arugala salad, cod - good but had very light flavor, spaghetti with clams - excellent, and whole trout (deboned).  After a round of coffee/tea and shared desserts, the bill only came to less than $400 with tip.  When we left there were about half a dozen people standing waiting for tables so this was only downside - space.  Also very dim lighting.", "author": "Cal C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-11", "description": "We found this place almost by accident but its a wonderful place. Both the atmosphere and the food are perfect-the decor, ambiance and music gives it a unique feel unlike being in Brooklyn. The food has some Italian fare-we had pasta with lamb ragu and also a short-rib appetizer both were surprisingly good. We returned for breakfast today and the laid back atmosphere helped us get our act together for some serious sightseeing. A find!", "author": "Efrain R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-12-13", "description": "I wish I could give Rucola a more positive review: their interior is nicely decorated, and their food -- in terms of taste -- is a solid 4/5. \n\nUnfortunately, the portions they serve are drastically overpriced. Paying $7 for a side of sausage, for instance, one expects a little more than *one* sausage. \n\nAdditionally, the staff close to neglected us after bringing us our food. After waiting close to twenty minutes for our check, I had to go to the bar and ask them if we could pay. \n\nI would not recommend Rucola. There are other Brooklyn brunch spots just as charming, except with better food, service, and prices.", "author": "Stef O."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-19", "description": "So. darn. good.\n\nMy boyfriend \u0026 I were a few blocks away (he was getting his haircut), and it was around 7pm, so I figured a Thursday night would be the perfect opportunity to get into Rucola without a long wait.  I was right (we didn't have to wait), but it's not because the place wasn't PACKED, it was definitely because we got very lucky and the timing worked out perfectly.  I ordered a glass of their sangiovese and their cavatelli with wild mushrooms for my meal.  The pasta was perfect!  And the portion was huge, so I happily allowed my boyfriend to have as much as he wanted with his steak (which he also said was perfect).", "author": "Michelle R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-28", "description": "Lovely little restaurant in the 'hood. Slightly upscale (i.e., a bit pricey), cozy ambience, casual and comfortable but not rag-tag. Not an everyday kind of place, given my budget, but someplace I would return to for a birthday or special night out. Excellent service. Families with kids, groups of friends, and couples on dates all fare well here. Northern Italian food prepared with flair and subtlety. My companion and I shared a delicious pate with pickles and a silky aioli with mustard seeds. I had perfectly cooked cod with a nice crust over a yummy risotto that was toothy but not tough.  My friend enjoyed her homemade pasta with ramps and cheese and other good stuff.  Portions are a tad on the small side, but you won't mind if you eat slowly and savor the flavors, as you should anyway when the food is good. The wine was good and I probably drank too much because I was enjoying myself and feeling expansive. I'll be back, with friends and/or family.", "author": "Pandora B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-17", "description": "Went for brunch with my husband over the weekend and we were definitely impressed. Great decor, lively atmosphere and a bit tucked away from the \"main drag\" of Smith Street so it feels like you've stepped inside some great secret when you arrive. But let's talk about the food.\n\nEvery restaurant in New York offers brunch these days, but I feel like it can be a bit difficult to get away from the usual mediocre eggs Benedict and pancakes/French toast that seem to dominate every menu. Rucola's take on brunch was a refreshing change of pace, though they do offer poached eggs and brioche French toast if familiar is what you're looking for. More unique offerings include a Caprese sandwich and a broccoli rabe dish with sausage, heirloom beans and a poached egg. \n\nI had the smoked salmon which was served with a very refreshing cucumber salad, crispy hash brown potato cakes (which were a lot like fat latkes) and sour cream with fresh dill. They weren't stingy with the salmon and the cucumber salad complemented the meal quite nicely. My husband got the breakfast sandwich with a side of potato gratin - both of which were fabulous. I have a world of appreciation for a deliciously greasy deli breakfast sandwich, but one made with a soft, airy roll and local bacon and eggs is really something else. We didn't partake in the brunch cocktails, though they had a decent selection (and the Bloody Marys at the next table looked damn good). \n\nMy only complaint is that Rucola is a small space, and they really utilize every inch of the place, so you're often -- quite literally -- back to back with someone else. It's a bit of a thing to get up to use the restroom, or leave, as a result. But, the food was perfect and the price was right, so getting a little cozy with your neighbors is a pretty small price to pay. Already planning our next visit to try out dinner and dessert.", "author": "Diana B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-27", "description": "Excellent Northern Italian cuisine. Service here is always great, which is a challenge with the aerobics the servers need to do to navigate the cozy restaurant. They make the best burrata I've ever had. The vegetables are always fresh and the turn over on the menu balances new/seasonal additions with maintaining what they do well. The trout is my go-to main course. The pastas are always great as well. I hope they can bring the truffle tagliatelle back this year!", "author": "Vincent R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-26", "description": "Dinner Friday evening / 7 pm / walk in\nGreat service, cocktails were amaze balls, food was extraordinary, one of the nicest I've eaten in Carroll Gardens, cobble hill etc, \nMy only gripe, if I'm paying 12 dollar for a glass of wine, don't short pour me. . . . . . Come on \nWill definitely be back, will recommend all round, excellent establishment- keep it up", "author": "Karl M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-01-19", "description": "We've been to Rucola many times and loved it. But this place has \"jumped the shark\". Today, we were seated right away and looking forward to a great lunch. We ordered -- soup, sandwich, salads, some wine. First, it took nearly an hour to get our food. Second, when we got our food it simply wasn't good -- wilted salad, completely average tuna salad sandwich, luke-warm soup. The bill was over $100 for what I could have prepared at home for $20. When I told the waitstaff, the response was a snarky, \"we're understaffed.\"\n\nNext time I will go to Frankies where I know that there will be a wait but the food will be worth it.", "author": "Chris F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-06", "description": "My boyfriend and I stumbled in to this adorable little restaurant last Tuesday and boy were we glad we did! First off, I've never felt cozier. Very Brooklyn hipster vibe with a down home relaxed feel. \n\nNOW LETS TALK ABOUT THE FOOD....\nWe shared the Burrata Crostino with sliced peaches and honey...as amazing as it sounds\nFlank steak over kale and Gorgonzola ...perfectly cooked with amazing flavor\nPasta Special which had cheese and corn and shrimp and blew my mind!!! Me and my boyfriend literally fought over these leftovers the next day!!!!\n\nThe service was excellent, the food was excellent, the vibes were excellent...\n\nso nice to find a restaurant with this great of food without the pretentious attitude or price tag.\n\nWe will be back....\n\nthis week???", "author": "Evin L."}], "servesCuisine": "Italian", "priceRange": "$11-30", "name": "Rucola", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "190 Dean St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/ea87R47Kp_k95_fE7ginIA/ls.jpg", "@type": "Restaurant", "telephone": "+17185763209"}