{"aggregateRating": {"reviewCount": 458, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-12", "description": "A freezing Sunday morning. Hungover as all hell after passing the splo with a gang of frenzied Ukrainians. I needed something heavy and rich to turn things around. Ruuuuuuucoooolaaaaaa!\n\nThe place was packed for brunch so we sat at the bar. The bartender was a nice dude. I went with the slow roasted pork sandwich with peppers. Not just a good sandwich. One of the best sandwiches I can ever remember eating. The wife had the poached eggs with speck and said it was one of the best brunches she's had in the cobble hill area. That's sayin something.\n\nHappy wife equals happy life. We'll be back folks.", "author": "Ben L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-26", "description": "Nice little Italian place to eat. Good drinks and food was very good. The atmosphere is great for conversations with friends and having a great time. Definitely a place worth visiting. I have been twice now and food was good each time.", "author": "Joshua M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-30", "description": "I come here at least once a month and I've never been disappointed for brunch or dinner. Service, quality, etc. are unparalleled, only downside is that it's too popular and getting seated can be a tight squeeze. I could write love letters to this place that are more enduring than any relationships I've had.", "author": "Daniella S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-31", "description": "So good! Yelp actually led us (my mother, a family friend, and I) to this place and I couldn't be more thankful. It was delicious and even though they were packed to the brim when we sat, we still got great service.", "author": "Kenzie P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-10", "description": "Very cute little place! Great atmosphere and service.\n\nOne thing we loved: their Toma Della Rocca cheese. Loved it so I had to mention it!\nDo try. It reminded me of soft goat cheese, but not as tangy... more mild. Really enjoyed it.\n\nOtherwise, we snacked on the melon app, the fried cauliflower, salads, and drinks. All was great!", "author": "Riley H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-23", "description": "Will definitely go back for whatever is on the menu. They pay attention to all details and it's simply delicious. The staff and venue is very inviting as well. \nFriends just moved in around the corner and I think we'll be back. Yum!", "author": "David B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-14", "description": "This place was DELICIOUS!  The staff was so kind, and the food was outstanding.  We had just come from the Brooklyn Tabernacle, and we did wait a little (it was 10:30), but when they sat us, it was worth it!  We had the fried brussel sprouts (thank you to the customer who recommended it!), the roasted chicken, moist and PERFECTLY cooked, and three of us had the homemade Lumache pasta.  Shared a bottle of wine, it was awesome AND the price was great.", "author": "Laura L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-14", "description": "I thoroughly enjoyed my lambrusco and pulled pork sandwich lunch. In the interest of full disclosure, the high rating might be in part because I was with a nice (cute) date, and it was a gorgeous afternoon on a rare day off from work.", "author": "Kayo N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-24", "description": "I have to admit that Rucola is hands-down one of my favorite restaurants in Brooklyn, and not just because it is a block away from my apartment, but because it is consistently delicious! The restaurant itself is very small, and you have to prepare to wait if you plan on getting dinner on a Friday or Saturday night. However, they allow you to call ahead or walk over and put your name on the list and they will call you when you're table is ready.\n\n As for appetizers, I strongly suggest the speck alto adige paired with the toma della rocca( the soft, luscious creaminess of the cheese is heavenly and they serve it with a side of cinnamon apples= unreal!) Their homemade focaccia is awesome! I appreciate how fresh all of their food is and that every meal is made to order. Every dish I've had off of their dinner menu has been delicious; however, my favorite has to be the rigatoni. It's understated, yet so fresh and the homemade pasta is to die for! As far as lunch goes, the pork sandwich is the way to go! \n\nThe only negatives for Rucola are that 1. They no longer serve the sloppy joe which was unreal (I still crave it regularly) and 2. As far as brunch goes, the nutella french toast isn't anything to write home about.  I was actually quite surprised that they served something that I could've easily made at home (toasted wheat bread with nutella smeared in the middle) and a few hazelnuts on top. \n\nOverall, definitely worth going to Rucola over and over again!", "author": "Kayla C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-12", "description": "Best meal that we've had in Brooklyn. Loved the spaghetti, lamb, carrot salad, cauliflower. Delicious \u0026 the atmosphere is perfect.", "author": "Allison B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-19", "description": "Great neighborhood restaurant... with crowd control issues.  Been several times and always have had to stand around and wait... \"you're next...\" then wait and watch others be seated in front of you. wtf? \nDefinitely hearty fare, brunch menu doesn't really have any breakfasty stuff.\n\nTheir pasta bolognese rocks.\nThe place is too small ...please don't go, so there will be more room for me!  ; )", "author": "Steve H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-27", "description": "I live in Boerum Hill and have come to Rucola regularly since it opened. It kind of boggles my mind how anyone from the area could give it a less than great review. Most delicious dinner and brunch spot we have, hands down. If anything, the kitchen has gotten better with time, and the owners really care about what they're doing. They occasionally host special events, like a dinner where locals could meet organic farmer Jim Gerritsen, who fights so hard against Monsanto. Just a fantastic place.", "author": "Melissa G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-25", "description": "My girlfriend and I were looking for a place that was a little off the beaten path, had good reviews, and not far away from the house since we just gotten a dog. She found this place. It's small, but has a rustic feeling to it and the staff is very friendly. Our waitress came over right away, and showed us a wine special. It was a white that regretfully I missed the name, but it was so delicious, and exactly what she described it as. Sandy, Summer feeling, and a pear after taste. It was perfect to pairing to the chicken I eventually ordered, along with the beet salad. Very delicious. Granted, not exactly cheap dining, but tough to find in Cobble Hill/Boreum Hill. I don't mind paying if the meal is delicious, and this meal was very delicious. I will definitely be returning to this spot for more.", "author": "Frank B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-30", "description": "I've been to Rucola twice now. I hope Building on Bond knows it has some serious competition - competition that is blowing their stale menu out of the water. Since I first went to Rucola a few weeks ago, they've already changed up their menu. \n\nThe Bloody Mary's aren't cheap, but the mix is good and I love pickled fennel so I'll gladly part with $10 or maybe even $20 for that pleasure. The last time we went, my husband and split a pork sandwich and ordered all of the sides - polenta, Brussels sprouts, and pancetta. It was the perfect amount of food and everything was delicious. We spend around $65 (including tip) for three cocktails, one entree, and three sides. \n\nThe ambiance is really nice at Rucola. It's a quiet block and the decor is the ever-popular rustic mix of old wood, aged metal, and handblown glass. It's very charming and unpretentious. Skip the wait at Mile End and head over to Rucola where delectable eats abound and the waitstaff is friendly.", "author": "megan P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-01-09", "description": "My first night in my new apartment, and we were looking for somewhere to celebrate: thanks to peter d's review, we ended up at Rucola.\n\nOverall, I love the rustic Italian vibe of this place, even though Italian isn't their specialty. There are a few two and four-top tables around the edge of the space, with one long communal table down the middle; everything's packed in there as Rucola is doing its best to maximize the small space they have.\n\nThe pros: the staff were fantastic, really knew their stuff and were more than helpful in trying to direct us to the food and wine we'd like. Our waiter listened patiently, intent on figuring out what we wanted and even when correcting my pronunciation on a particular type of cheese, did so in a way to not make me feel like an idiot*.\n\nThe cons: sitting at the middle, communal table meant that patrons and servers were walking up and down the row a lot and with not a lot of room, often bumping into us which was annoying (and not really anyone's fault -- they do the best they can with the room they have). Basically, the only safe spot was at the opposite side of the smaller tables.\n\nThe food also wasn't particularly noteworthy -- we found our dishes to be generally bland, and the chef's selection (including cheeses and meats) to be fairly non-descript. The fusili was incredibly salty** and my dining companion didn't finish her dish while, after moving heavy boxes all day, I had no problem polishing off the pan roasted chicken, which was juicy and tender, but tasted basically like chicken. \n\nWe didn't get dessert, and possibly sitting at a table where we were a little more out of the way, it'd be a more enjoyable dining experience. But overall, the price seemed high for a nice neighborhood restaurant, which is where Rucola lives for me.\n\n* - To be fair to him, I am often an idiot.\n\n** - so much so that when we mentioned it at the end of the meal, with more than half the bowl remaining, they apologized profusely and took it off the final bill.", "author": "Danny P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-01-03", "description": "Horrible and slow service, food is nothing special. I came here for lunch on a Monday at about 2pm.  The restaurant was nearly full, but we got a table almost immediately.  Inside the decor is really pleasant and low-key and I had high-hopes for the food. \n\nOn the waiter's recommendation, I ordered the Fried Mortadella sandwich and a lentil soup.  My dining partner ordered another sandwich.  Should be quick, right?\n\nWe waited over an hour for a bowl of soup, during which our waiter never came back to check on us or explain why it was taking so long.  When he finally arrived with the soup, he told us \"Your sandwiches should be right up.\"  The soup tasted like something that I make at home, not anything special or particularly delicious.  \n\nAfter another 45 minutes, our sandwiches arrived.  That's right --- an hour and 45 minutes for two sandwiches.  NO EXPLANATION.  The house recommended Fried Mortadella sandwich came on a SUPER DRY BODEGA BUN.  Seriously, I've would have gotten a better deal by going to the bodega down the street and getting an egg on a roll.  Inside the sandwich, they slapped in a few slices of Mortadella and a small egg.  It was so dry, it was like eating a sponge. Did I forget to mention that no one refilled our bottle of table water?  And our waiter had disappeared for the rest of the afternoon? And no one on the waitstaff would even look me in the eye?\n\nSeriously Rucola, get your act together.  If you run out of soup, let your customers know.  If you ran out of bread, don't run down to the bodega and get day-old buns and then toast them without any butter and try to pass them off as a $9 sandwich.  I would have been fine with a different dish, but this kind of service beyond the pale.  If you can't get your act together for making soup and sandwiches, I shudder to think what the dinner service is like.", "author": "Steph X."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-02", "description": "I've had a few more dinners here since my initial review, and I'm pleased to say that I like Rucola more and more each time I dine there. The pacing of courses has improved, and the service seems significantly more attentive and personal.\n\nI've discovered the chicken entree, which really is good. A couple of my trusted fellow diners have said it's too salty, but I'm fine on that front.\n\nI'm also starting to think that the bar/beverage program is more legit than it needs to be for this neighborhood. I had a Negroni there recently that was everything I wanted it to be.\n\nKudos, Rucola. I'll see you soon.", "author": "Jonathan B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-31", "description": "The incredible Rucola team hosted our party of 16 for our wedding dinner in June and we could not have asked for more. It was the perfect end to our wedding day - gorgeous food and wine, intimate setting and lovely and accommodating staff. \n\nWe eloped from Australia (with a few friends and family in tow) so we chose Rucola based on reviews we saw online and organised the dinner via email. From the very first enquiry email, I knew we'd found the perfect place. Julian and his team were incredibly accommodating in building the perfect wedding day menu and hosting our happy Australian group in their gorgeous space. Our guests adored the restaurant, the food, the wine and everything about the evening. Thank you!", "author": "Sarah P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-18", "description": "Everything was spectacular. Worth the wait. Some of the best Italian food I've ever had.", "author": "S P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-10", "description": "I always pass this place and the atmosphere looks so nice that I finally tried it with a friend. I had a huge burrito at Fast \u0026 Fresh Burrito on Hoyt St.  (that's a separate review) three hours earlier so I swore I wouldn't eat very much. I got the spaghetti with mahi mahi.  I ate halfway through the dish- told my friend I would take the other half home, and then proceeded to eat all of it. I also had the broccoli with garlic oil. It was ok. Had a glass of white wine, the glass could have been just a tiny bit more full. Here's the kicker. The pudding. Thank God we split one. It's rich and amazing. I probably would have eaten a whole portion by myself had we gotten two.  This place gets crowded, so I would go on the earlier side.", "author": "S M."}], "servesCuisine": "Italian", "priceRange": "$11-30", "name": "Rucola", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "190 Dean St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/ea87R47Kp_k95_fE7ginIA/ls.jpg", "@type": "Restaurant", "telephone": "+17185763209"}