{"aggregateRating": {"reviewCount": 458, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-05", "description": "I'm lucky to live by this place. They have a fresh we'll thought out menu that always dishes out something outstanding. The atmosphere and the staff truly seal the deal for this being on your top 10 places to eat in NYC.", "author": "Sarah E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-04", "description": "Comfy, cozy, rustic feeling, and pleasant people. Rucola is a great place to stop in and just enjoy yourself. The decor is unique and the cauliflower was incredible.", "author": "Mathew T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-01-21", "description": "Two \u0026 a half in a good way, kind of...Some of the food was very tasty and the technical skill of the kitchen was quite evident with some of the dishes, particularly with the quail and the veal spiedini(however meager), squash roasted with pumpkin seeds, ricotta, and and brown butter, and the Pork shank slow cooked with mustard and cabbage .  None of the dishes were particularly exciting or innovative however and some dishes verged on being downright boring (fusilli with kale and walnut pesto. The antipasti was maybe the only thing that was below average due in large part to a selection of vegetables that left a lot to be desired and a yellowish sauce that verged on offensiveness in both flavor and appearance.  \n      Service is the definition of spotty,  with some of the servers displaying warmth and professionalism, and others demonstrating that particular brand of eye rolling condescension that all too often helps give Brooklyn  a douchy bad name. \n    The room was very nice, and the place is well served by the quiet classic charm of its location in this mostly residential stretch of Brownstoneland once known as South Brooklyn.\nThe biggest problem with this place is unquestionably the minuscule portion sizes that certainly didn't justify the prices.  $14 for the tiny plate of the above mentioned fusilli, and the two puny skewers, maybe holding two inches of meat with the spiedini are par for the course here.  I don't think I will be rushing back, particularly if I am the one paying.", "author": "Brendan T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-01", "description": "GREAT customer service! The menu isn't bad either!\n\nWent here for brunch on a Sunday around 1pm. Pretty busy but we didn't have a wait at all. I will say the brunch menu is a bit limited for my taste but I ordered the bacon/egg/cheese sandwich w/ arugula. Not bad! \n\nThey brew stumptown too -- awesome! \n\nThe vibe/ambiance is really great and I think this is a great after work/date spot. No doubt a much more extensive menu for dinner.\n\nThey accept CCs! Yay!\n\nI will definitely be back during the week to try the PM fare.", "author": "jaclyn g."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-09", "description": "This review is way overdue, because we went to Rucola back in November, but luckily I still remember how much we enjoyed brunch! The best part? The sweet potato gratin. I realize that sounds weird - and we weren't sure what to expect, but we could've just gotten 5 of these and eaten them and been happy. The sweet potatoes are cooked perfectly (with tons of butter) and spiced very well. I can't do it justice by describing it, but just know that you should try it. We also got the bacon, egg, and cheese sandwich, with the bacon on the side (because my boyfriend doesn't eat it). The sandwich was very good, but the bacon is definitely the best part :) For the sweet part of the meal, we got the nutella french toast. The portion wasn't as big as I would have liked, but how can you go wrong with nutella french toast? The chopped hazelnuts are a unique touch -- I recommend it!\n\nThe atmosphere was perfect - and exactly what we expected in Brooklyn :) We sat at the end of a long, communal table. Everyone was friendly and laid back. The light fixtures and wood tables were great. I definitely recommend Rucola for brunch - I'd go all the time if I lived nearby!", "author": "Jess G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-15", "description": "Great place for groups as they take reservation for parties over 5 people.  9 if us went there for a birthday party.  Food was good and service was amazing.  I would suggest the cured meat and cheese appetizers for the group and the trout for entree.  The honey and sea salt pie made my day!", "author": "Juan J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-10", "description": "I LOVE the food here, and the decor is super stylish and pretty making for a great atmosphere. I recommend the rigatoni - it's a unique and memorable sauce. So delicious!", "author": "Amanda F."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-11-03", "description": "Perhaps I would really enjoy this place if only I knew the secret code to get a table there. We attempted to eat here on a recent Saturday night, knowing that it gets crowded and thus we arrived at 6:30. I expected there might be some wait, but I was excited when I walked in and saw a couple of open tables. Given that their website clearly states that they do NOT take reservations for parties of less than 5 people, I got my hopes up only to have them dashed by the host who informed us that we'd have a 2 hour wait! Wait a minute....I asked....there was no line and I spotted a couple of open tables. Oh, those people called ahead to get a table, the host told me. Apparently, one can call in advance and make a quasi-reservation, even though their website states a no reservation policy. What?? \n\nPlace looked cozy and I am sure the food is delish. Maybe some day I'll learn the inside secret to enable dining there. For now, I am turned off by their game playing. Either take reservations or not, and please be clear about it on your website. Don't use this system for some folks, but not others.  I suspect they think the secret to being popular is to turn people away in some sort of hard-to-get fashion. I played those games in high school . Not interested now.", "author": "Alex S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-18", "description": "Really loved this place!  Went this evening for dinner with a handful of friends -- all agreed that it was exceptional!   Loved the fresh, interesting cocktails to start, and great \"chef's choice\" antipasto platter to share.  Entrees were terrific: Arctic char, flanksteak and several of the homemade pastas.  Everything delicious, authentic.  Service was very friendly and attentive. Ambience just right.  Will definitely go back.  Highly recommend!", "author": "Kathy D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-07", "description": "Great atmosphere!! Love the crowd/neighborhood and intimate seating. However the food isn't that tasty, it's ok(I finished it) but I didn't lick my plate. Will go back for the crowd.", "author": "Nica H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-28", "description": "Crowded. A good place to catch up, have a conversation over wine and cheese as the service is slow. Overall they use fresh ingredients, everything was flavorful and well seasoned. The roasted brook trout and crispy polenta were amazing.", "author": "Mike S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-25", "description": "Anyone hating on this place just doesn't know their onions. We love coming here for breakfast, lunch and dinner. Small menu with freshly sourced ingredients and very reasonably priced food that is consistently tasty. This is a must for anyone who lives locally and enjoys good food.", "author": "Simon K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-02-28", "description": "The food was delicious. The coffee (Stumptown) was horrible. It tasted gritty. Other than that, lovely time and good food.", "author": "Emme P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-10", "description": "Great place, great food, great cocktails. We were here before going to the Barclay center to see \"The Weeknd\" and were served promptly with good food, I wanted to stay longer for some more food and drinks!", "author": "Ad P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-07", "description": "I love this place! I've gone once in a huge group (we sat at the center table), and a couple times with one other person. It is such a nice place. The brunch is great, but I can't stay away from the pulled pork sandwich. I recently had it over greens instead of on a bun and it was on point as a salad.\n\nThe service is great but not obtrusive and they serve iced decaf coffee. An all around win.", "author": "Bevin B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-02", "description": "Hey Rucola, you served a sumptuous platter of meat cuts and cheeses tonight at LMHQ for The New Downtown event and I gotta know what cheese was the one you served with some bluish spots on it. One of the best cheeses I've ever tasted yet. Definitely a fan now.", "author": "Terence John C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-18", "description": "A lovely neighborhood restaurant. I have visited 2 times for dinner so far, definitely will go back. Great cocktail, nice service. It can get really busy, I would recommend to avoid prime time, the wait can easily be 40 minutes. For the foods, I was a bit disappointed by a pasta dish  (lagu?) which was painfully salty but other than that one dish everything I tried was very good. I especially liked fish dishes.", "author": "Hiroko N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-18", "description": "Most amazing dinner - not just the food, the server and staff were amazing too! Ordered 2 burratas - it was so devilishly good. We asked for suggestions for wine, and we were served 3 different wines generously for tasting! The server was attentive, and knowledgeable. The space was beautiful and cozy. Will go back in a heart beat.", "author": "Rupa G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-11", "description": "I think this might be our new favorite place.  Went there on Sunday and met there with friends who had been there or a while, just having cocktails and beers waiting for the kitchen to open.  The staff was very attentive and accommodating and I really enjoyed the rustic decor.\n\nThe cocktails were delicious and we ordered some food to share.  Twice we ordered the Chef's Selection (yes, it was that good!) and it was different each time, and delicious both times. Loved the olives and the beets and the cheeses went really well with my Rose (and my friends' cocktails).  We also ordered the two pasta dishes which were outstanding.\n\nIt got really crowded just after the kitchen opened, so I can see that there might be a wait and I would say it was a bit loud.", "author": "Carolina C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-11", "description": "Time to add Rucola, a wonderful little restaurant hidden away (but extremely popular) in Brooklyn Heights, to my list of favorite Italian restaurants.\n\nThe wait for a table was over two hours long but we were lucky and got bar seats much quicker.  To be honest, I preferred the bar over a table - it's a much more intimate experience with the restaurant staff and those you're dining with. \n\nAlmost everything was notable.  Deliciously marinated mushrooms, thin slices of hot coppa and a surprisingly affordable quartino of very decent red wine (we had the \"Ceregio\" 2011 Sangiovese for $14).\n\nThe highlight for me were the two pasta entrees.  Shells (Fall squash pureè, broccoli rabe, Pecorino Romano, black pepper, $15) and Tagliatelli (Veal breast ragù, tomato, Grana Padano, $16) both cooked to a perfect al dente and with wonderful, rich, but not overpowering sauce.\n\nThe Bourbon Pear Crumble ($6) from a famous Brooklyn pie shop called Four \u0026 Twenty Blackbirds with a side of whipped cream was an outstanding finish.\n\nNo question - I'm coming back.", "author": "Adrian K."}], "servesCuisine": "Italian", "priceRange": "$11-30", "name": "Rucola", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "190 Dean St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/ea87R47Kp_k95_fE7ginIA/ls.jpg", "@type": "Restaurant", "telephone": "+17185763209"}