{"aggregateRating": {"reviewCount": 458, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-24", "description": "Very cool \"speakeasy\" kinds of cocktails and drinks with authentic ingredients.   The roasted carrots were awesome; the tagliatelle was insanely delicious, the beets were terrific, and we shared so many other dishes (party of 6) and were happy with ALL of them.  It was crowded, as many of the reviews say, so if I could change anything it would be to give them more space.  When we arrived (the night of the big snow storm a few weeks ago), someone mentioned while leaving that it was an hour and 1/2 wait -- luckily, they do take reservations for parties of 6+.  Otherwise, you might end up waiting for a while.  Luckily, though, the bar will make it worth that while.", "author": "Sharon H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-10-25", "description": "I don't live anywhere near here, but I have eaten here quite a few times, often after attending arts events in the area. Last night's visit was a pleasure, as always. At 9 pm the place was packed and had a nice vibe, but fortunately it started to clear out and we were treated attentively and seated after a pretty short wait. (Once before we had been told honestly that it was a 45 minute wait, but they offered to call us when a table opened. Nice.)  The wines are always tasty choices, reasonably priced, as was the cheese and the tapenade that we ordered right away. I could not resist trying one of several new salads on the menu. It was both tasty and an extremely huge plate full of the very freshest baby carrots, blanched and chilled, and ricotta, with some yummy nuts. I probably should have added a pinch more salt, which they do put on the table in a tiny dish. It was really enough for four people, so my equally large plate of yummy gnocchi was unnecessary but delicious. I ate it all. My boyfriend ate things we had eaten before, notably the rigatoni which is out-of-the-park home-run delectable, always. They typically have things like trout, duck, and chicken entrees on the menu, too. I tend to like the pasta offerings, and usually one of them is vegetarian or near-vegetarian. We sat at a table near the kitchen, which meant a lot of traffic near our table but also prompt attention from the staff. I mentioned to our server that I was too stuffed for dessert, which seemed sad since it was my birthday. They then brought out a sweet, tiny helping of delicious chocolate pudding that the two of us a shared. A really fun and satisfying night.  Looking forward to my next visit.", "author": "Hilary C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-19", "description": "Delicious food with a well curated menu in a charming atmosphere. The ball jar light fixtures with edison bulbs set just the right tone. And their list of digestive drinks -- amari -- is particularly strong. \n\nTwo not-so-small but not-so-big drawbacks: sometimes mediocre service, particularly at brunch/lunch; and the noise level, which can be ear-splitting.", "author": "Julie E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-04", "description": "This restaurant has such an amazingly warm and inviting atmosphere.  The communal table gives you a sense of shared enjoyment with those next to you.  And the food is absolutely fantastic - had the special pate and caponata, then enjoyed an amazing cod fish entree.  Drinks were perfectly prepared.  The restaurant has the feel of something in a far off corner of Paris...where locals are rewarded for their curiosity with consistenly excellent fare and familiar faces.", "author": "Macy W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-27", "description": "I had lunch with a colleague at Rucola a few weeks ago. It was amazing!  The pizza and asparagus appetizer was divine and I have since planned my birthday dinner this week for ten people.  The staff is super friendly and the space is lovely.  With new businesses, we all need to give it a chance to get its legs.  It's like a  BABY people - I'm speaking to you negative reviewers who slash a place within 1 to 30 days of a restaurants existence.  Really? You know most people don't ask a baby to run a marathon.  It's gotta learn to walk, learn it's steps, it's strengths, it's weaknesses. That all comes from real experience.  And yes, they need to get the kinks out in due time and I wish Rucola all the success in the world.  It's a great addition to the neighborhood and Yay! I'm a fan!", "author": "Jennifer S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-12", "description": "Love this relatively new addition to the neighborhood.  Rucola's brunch rivals the best in the neighborhood.  The offerings are seasonal, that said their beet salad was delicious (and I'm definitely not a beet person).  My wife loved the poached eggs and the bread was awesome.  In spite of being full, we managed to find room for the fresh bread with peach preserves.  Decor-wise, the place was very Brooklyn-rustic.  Wait staff was really nice. Looking forward to trying their dinner service, in the near future.", "author": "Chris O."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-06", "description": "Had the sloppy joe for brunch. Am craving it now. Great place with fantastic attention to detail (shaved salt in a little spoon at each table). Reaffirmed my opinion that Brooklyn sets the bar for food in NYC. Can't wait to try the dinner menu.", "author": "Bkduc D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-07", "description": "Thanks for being awesome, Rucola. Hands down, best service I have had in NYC. On top of that, the food was simple and out of this world. The drinks were different and delicious. Its vibrant, sexy, and a total must for all foodies.", "author": "Rachel B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-07-15", "description": "Hi again. Here to update my review.  Please Steve W., no nasty personal emails. I'm probably old enough to be your mother-- you wouldn't do that to your mother, would you? I've lived in this neighborhood longer than you may have been alive-- so when you were 1 and starting to eat solid foods I was a recent college graduate going out to nice restaurants so I feel qualified to give what may be a broader view of the neighborhood dining scene  as well the tragedies of 'not getting into Frankie's'.  \n\nIn essence, I still feel generally the same about Rucola-- it's all becoming abundantly clear (more on that in a bit).  Still, the positives: achingly friendly staff, so you only want the best for them.  They leaned out the size of the farm table, I can only imagine they were tripping over themselves.  The menu was so much more generous in both portion size and options. I generally enjoyed the food-- but certain things like waiting 1 hr more than what was expected (1hr +1hr= most of the night is over before being seated) and an extended period of time between courses as well  exceptionally over-salting most dishes. Hey, I adore salt, it's practically endemic to me-- but not like: can I have a little chicken for my salt? I never thought I would mention salt being an issue anywhere, ever.  All this is easy to correct or it will suss itself out-- so all's good.\n\nStill, I had a lovely evening marred only slightly by the little things.\n\n  As mentioned above, I've been in the neighborhood longer than I have lived in any other place in the world. I have ushered in literally all of the restaurants that emerged in this neighborhood--I'm friends with most of the chefs and owners because I love food and dining and would visit and eat at their restaurants weekly. For example, last week I was at Grocery and Charlie and Sharon acknowledged they were weeded because their tiny restaurant triples in size on warm summer evenings--so the 'slower' pace was met with personal appearances, about 5, seriously 5 additional little courses in between what was ordered and copious wine and apologies as well as incredibly warm and professional service.  I guess what I'm saying is that you either want to 'get into to Frankies' or Rucola-or you want to be taken care of with expert food and service and a dining experience that caters to perhaps a more sophisticated diner.  And by sophisticated, I don't mean 'older' or stuffy-- just a little more experienced, seasoned and careful.", "author": "aimee m."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-07-06", "description": "We live around the corner and want so badly for this to be our neighborhood spot. The place is very nice and cool and dinner is delicious - really very good. Brunch is just such a disappointment, we have been for brunch/breakfast/lunch about 10 times this year and for the prices the portions are just too small. One egg for 10 -12 bucks, today it was chicory salad, with chopped egg so fine you could barely see it, 2 fingerling potatoes cut in half and three 2 inch by 1/2 slices of house smoked salmon for $14. I always leave with my pocket much lighter and still very hungry. Mixed drinks are very small for the standard NY prices..$12-14. The only other thing is that if you sit in either of the two aisles be prepared to get knocked, elbowed, smacked by a purse or water spilled on you because they have not left enough room for the customers to sit and servers to comfortably work. they need about a foot more room on each side - this alone has ruined my expensive meals before. For perspective I have lived in the East Village for 14 years and Brooklyn for two, I am fine with small spaces and paying premium...but sometimes I just feel like i am being taken advantage of here. I will go back for dinner, but I think I have given up on going any earlier.", "author": "Angus D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-18", "description": "We walked by on a Friday-it was slammed.  Went back on Tuesday, it was happily abuzz.  The staff is friendly and attentive, and the atmosphere is graceful and relaxed.  The food was great, in particular the generous meat/cheese plate, caponata (perfect!) and foccacia.  The Vermintino and Zuccato were both super dee-lish as well.  I'm looking forward to going back, and super psyched that it is just around the corner.", "author": "misty w."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-12", "description": "I have now eaten at Rucola twice and both times was knocked out by every dish, including the desserts.  The ingredients are fresh and interesting, the preparation and presentation are flawless, the service is friendly and fun and the ambience is relaxing and inviting.  Anyone who has an issue with portions must have been raised at the all-you-can-eat troughs at Denny's, because I ened up with a doggie bag last time I was there.  While I love Frankie's, Prime Meats and Brucie, I find Rucola to have a more comfortable vibe - it's the kind of place that makes you want to hang out longer, hoping to digest quickly enough to have the chance to try somethig else.\n\nAs for the dishes that I and my wife have tried, the gnocchi was light, pillowy and practically melted in my mouth. A green salad accented with pickled ramps was absolutely delicious.  The cheese board with rosemary bread and the sliced meat sampler had an unreal mix of flavors, and I think alone (with one of their matched wines) would justify Rucola's existence.  The chicken is moist, flavorful and survives the doggie-bag test the nex day with flying colors.  The octopus salad - well, I couldn't say because everyone at my table fought over it like rabid hyenas and so I didn't even get to try it.  The cavetelli  - my fave so far - was firm and tasty with a sauce at that critical point just creamy enough to pack each bite with flavor but without at all being heavy.\n\nI agree that the menu is still limited, but that strikes me as normal for a new place.  That just makes me excited to see what's going to appear on the menu each time I go back, which will be often", "author": "Dave G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-09", "description": "The half roast chicken was incredible as was the pasta, wine and desserts.  Wonderful to have in the neighbrohood.", "author": "kena p."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-07", "description": "Wonderful food, great service, beautiful restaurant. We had appetizers, entrees and desserts and all was delicious. People were happy, babies were well treated, crowded and happy.", "author": "Molly M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-16", "description": "Just went for a cocktail, cheeses and coffee/dessert.  Staff was very curteous and attentive and the chocolate pudding w salt was phenomenal.  Espresso was robust and great complement to the dessert.  Atmosphere warm and romantic.  Well worth the short walk from our downtown brooklyn hotel.  Highly recommended.", "author": "Casey J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-12-13", "description": "great ambiance, great place to hang out, had excellent brunch here - get the bolognese and ask for an egg on top!", "author": "James R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-05-17", "description": "This place is tasty, and I liked the friendly wait-staff. The decor is really nice - a little bit played out by this point, but hey, nice is nice, even if their look is almost ubiquitous at this point. \nDelicious meat/cheese platter, awesome bottle of wine. \nThe dorade-for-two could have been a large meal for one, but it was cooked very well and perfectly salted. My only significant complaint is that I want more \"main-dish\" size things on their menu - there was a pork loin dish, and the dorade...their pastas looked pretty good but we weren't in the mood for pasta. And then it's just small plates. Very nicely done dishes, all - but small. All in all, a very nice job of a restaurant and I think I would go back.", "author": "b c."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-06", "description": "Really really excellent food here. If you're in Boerum/Cobble Hill and want a satisfying, delicious meal, definitely go here instead of Building on Bond. It's worth every penny.", "author": "El D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-01-08", "description": "I had high hopes of discovering a true \"neighborhood gem\", but it is, at best, a diamond in the rough. The service was remarkably slow and the food, when it arrived, was room temperature and bland. As I was seated at the bar, the bartender, without me overtly indicating displeasure felt compelled to apologize and did not charge me for my wine; a very nice gesture. The restaurant was full, but a chef and staff should anticipate this and be able to handle it. Overall, good atmosphere, but there are much better options for Italian fare in BoCoCa.", "author": "Timothy S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-05", "description": "Take me back to this place.  We ordered a good assortment.  The Toma del rocca  was a brie like creamy cheese.  I thought the seafood was over-cooked in all the dishes we ordered so would avoid those.  Despite that, the flavor profiles were good though.  Not a fan of the finocchina, which I was told was Biellesse but I doubt it.  My tasting notes were not so favorable but I am making notes of the bad but will note that there were more good than bad.", "author": "Taylor M."}], "servesCuisine": "Italian", "priceRange": "$11-30", "name": "Rucola", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "190 Dean St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/ea87R47Kp_k95_fE7ginIA/ls.jpg", "@type": "Restaurant", "telephone": "+17185763209"}