{"aggregateRating": {"reviewCount": 458, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-28", "description": "Rucola is the quintessential neighborhood restaurant. From the ironwork on the outside to the beautiful rustic interior, it really could not get any cuter.\n\nThey only take reservations for 5 or more, but I've never had to wait long for a table when I've stopped by (usually late).\n\nThe menu at Rucola is solid. It is always changing, so if you visit every 3-4 months like I do, there will always be something new to try. \n\nFor starters they have a good charcuterie, cheese, or vegetable option, and they happen to serve my all time favorite eggplant caponata, which I highly recommend.\n\nWe had the beef tartar which was good, panzanela salad (loved the radishes), a pasta, and the hanger steak. Although it may seem like a lot, this was a decent amount of food for 2 people. \n\nThey have a daily pie from Two and Twenty Blackbirds, so we tried the lemon chess.\n\nI'm thankful I have Rucola as my reliable neighborhood restaurant.", "author": "Katey G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-05-23", "description": "Waited over 90mins and I'm not a fan of small restaurants since they just jam pack you in there. We ordered a few things to split between 3 people\n\nThe appetizers came out quickly, but the mains took a while.\nBeef Tartare - no flavors, it helped a little when we added salt\nMussels - delicious\n\nMain: Casarecce - this was decent \u0026 Short Rib - this was ok, meat was tender", "author": "Sandy K."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-03-14", "description": "Meh.\nFood took a really long time to make. It was just two of us with relatively quick-to-cook dishes and right around 6pm - 30 min after the kitchen opened and hardly any customers in the place.\nWhen it did come, the food was cold and brought to us by a sourpuss server. \nGreat wine, though.\nProbably won't return.", "author": "M. M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-21", "description": "Rucola is my favorite neighborhood brunch spot. It's quaint, there's no ridiculous wait, and the food is always quality.\n\nI've had the classic breakfast with eggs, sausage and home fries, and it was perfectly done. I recently got the Dutch pancake, which is like a pastry but more filling because it's egg-focused. \n\nRucola is the neighborhood spot to take an out of towner, who will inevitably be impressed. Or even better - make it your local go-to with your friend \n\nI haven't checked it out for dinner yet, but it's on the list.", "author": "Mary A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-03-03", "description": "Unfortunately, I will never again eat here. The service we received last night was atrocious. \n\nWe arrived as a walk-in (no reservation) before the dinner rush, there were three of us, and were immediately seated at a table. As soon as we sat, the hostess came back over to us and explained that the couple who had just walked in were a table of four, she asked us to move to the communal table. Generally, I would be put off by this, but we were happy to accommodate, though it was kind of tactless.\n\nHowever, when we sat at the communal table, over the next 15 min we were ignored by everyone in the restaurant. The couple who was given our original table received water, they made a wine selection, received bread AND their wine... AND ordered and received an appetizer before anyone even acknowledged our presence (and I want to note the second half of their party didn't arrive for another 20 minutes). I was literally making note of all of this after I became more and more upset. \n\nDuring this period, they were setting the communal table for a big group. While we were sitting and waiting, a server dropped bottles of water for the expected group at the table (none of which had shown up at this point) my husband stood up and grabbed a bottle of water that was set out on the table, this because in the 15 min wait, none had bothered to bring us water. When the waiter noticed my husband doing this, he glared annoyingly at us and aggressively replaced the bottle of water. I was absolutely shocked. \n\nWe were about to walk out when a server finally came over at about 18 min of waiting, and took our drink orders. It was at this time the large group started to arrive. The restaurant immediately became so crowded that the servers had to inch their way behind me to work and they were constantly hitting my arms and back. We received our drinks as my husband tried to tell the server that we were ready to order, they had rushed off again, and waited for another 7 min... before they came back around. Still no bread, and the bottle of water we had acquired on our own was long gone.\n\nAt this point we were so upset, we decided to leave. My husband talked to the waiter about all this, and asked for the check... not one apology, nothing. Even the hostess ignored us and our obvious dissatisfaction with the way we were treated. \n\nListen, their food may be good but the service is horrendous, there are so many gems in this neighborhood that treat their customers like family. It's a shame this place misses the boat. Final warning: avoid Rucola it's just not a cool place.", "author": "Jesse M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-18", "description": "Went on a Friday night, very busy as expected, put our name in and went to get a drink. After only fifteen minutes we got a call that our table was ready, very nice personal touch. The service was very good and the food was great. Not too many selections, they prepare what is in season, we all had pasta and it was made to order and very fresh, very favorable. Will definitely come back, atmosphere is load so just understand that be for coming", "author": "Big P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-15", "description": "Tuna sandwich for lunch. Oh Man. Amazing. Just perfect.\n\nNot your grandmas canned tuna with mayo. Real chunks of Tuna on great bread!", "author": "Abul R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-23", "description": "From the cast iron work that I like to awk at outside, to the the wood paneling indoors, to the incredible service and food, you just hit the spot in so many different ways, Rucola. I dig it all.\n\nNow let's talk food - it's no joke here! I very rarely get pasta anywhere because carbs are the devil, but I ate every single shell this time closing my eyes to savor the flavor with zero guilt. Perfectly cooked (by a chef who lived 21 years in Italy) shell pasta in glorious butter sauce with meat and peas - oh hello, my new guilty pleasure. The prosciutto just might possibly be the best I've ever had, crudo is a delight, and the carpaccio deserves a standing ovation. And because I apparently have no shame, I mopped up all my dishes with the fluffy ciabatta bread, and I recommend you do the same. I finished this feast with a perfect little chocolate chip cookie, which is gluten and dairy free, by the way.\n\nPersonal tip: snag a seat at the bar if you're here on a Friday or Saturday and watch Kevin (the bartender) do some serious work - this guy loves and knows what he is doing. The drinks are strong and complex without being pretentious and overpriced. After taking a stab at picking out a couple myself, my new drink order is now \"\"just surprise me\".\n\nNot to get all corny and emotional, but I actually feel pretty lucky to have this restaurant in my neighborhood. A reliable dinner spot like this is rare. See you soon, Rucola.", "author": "Nataliya M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-05", "description": "5 stars for this cozy, creative northern Italian neighborhood corner bar/bistro featuring home made pasta, fresh seasonal entrees, exciting appetizers and delicious salads. \n\nArugula salad and radish/tahini salads were standouts, as were the grilled sun chokes with cilantro sauce. Three pasta choices today and I had to sample all three: shells with peas and a wonderful Parma cotton and grana Padano sauce, nettle strozzapreti with wild mushrooms, ramps, cacciocavalli and Meyer lemon and the daily special,  a house made ravioli stuffed with pork. All delish. The chocolate chip /amaretto cookies were over the top. The menu changes seasonally, which is a good thing. I enjoy \"in season\" foods. \n\nService on par with the food...just wonderful.", "author": "Joseph P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-20", "description": "OVERPRICED \u0026 OVERRATED COZY PLACE.\n\nHonestly I don't know why this place has such as great rating considering the food.\n\nENVIRONMENT\nVery nice. They used an old house and decorated every single inch of it and made it feel like one of the coziest places you've ever been.\n\nSEATING is COMPLICATED.\nMy friend Phil called in advance asking for a table for 3. When we arrived we learned we had to share a long table with 17 more people... Which is not a problem but definitely not what you expect when you have a RESERVATION.\n\nFOOD IS AVERAGE\nFor appetizers we ordered the \"Chef's Selection of Cheese, Meat and Vegetables\" ($22 USD). The chef chose for us Spicy 'Nduja,  Prosciutto San Daniele, Moses Sleeper and Comte cheeses as well as Marinated Olives and Pickled Fennel. Amongst all 3 of us only ate half of that because IT WAS NOT GOOD.\n\nFor my salad I chose the Radicchio \u0026 Endive SALAD ($12) that comes with walnuts and Gorgonzola cheese. That was an GOOD choice. They add some orange to it and it makes a great combination for a salad and the ingredients tasted fresh.\n\nFor the entree I chose the Whole Roasted Brook Trout. The fish was too salty, although the presentation was good.\n\nSERVICE IS MEDIOCRE. The waiters seems anxious to get us eating, wouldn't let us have a peaceful conversation without interruptions such as \"Are you ready yet?\" \"Need more time?\" \"A few more minutes?\". Ugh. Top this off with lack of smiles or wit that you'll find in any modern restaurant today... Even in Starbucks!\n\nNOT ALL WINES\nAlso, what type of fancy restaurant doesn't have all the wine they show you in their menu?\n\nPRICE\nFor 3 people having a bottle of mediocre wine, average food and Ok dessert, mediocre service and paying $250 seems EXPENSIVE for what you get.", "author": "Baltazar R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-02-16", "description": "Came here once and the service was awful.  This restaurant operates on California time.  Extremely slow!!!\n\nLast time I came here, they took down our number and asked us to wait 45 mins -to 1 hour and no one ever called, which was unprofessional.\n\nBut sometimes, you gotta give a place another chance and I did.\n\nRucola once again has disappointed me with horrendous service.\n\nCame in at 4:50pm today and were told we cannot order food until 5:30pm.  So, we sat down and ordered cappuccinos.  It took 20 minutes for them to make 3 cappuccinos.  I don't understand how that is possible when the place was pretty much empty.  Little did we know this was just a pre-cursor of what was going to happen next.\n\nAt 5:30pm we ordered our food.  \n\nAbout 40 minutes later, a guy came up to our table and said our food was coming soon because he noticed we were the first people there to order food and everyone else was getting their food besides us.\n\nWe were starving and did not receive our food until 6:40pm.  Unacceptable.\n\nThe salad we ordered came out WITH our main entrees.  If we would have known the salad and the entree would come out at the same time, we would have never ordered the salad.\n\nWe promised that none of us will ever come here ever again.  Don't care how good the food is - bad service is a huge turn off.", "author": "Mandy M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-04-28", "description": "This place is hit or miss. 50/50 chance you'll have an incredible dinner or a mediocre one. Tonight was mediocre as the food has been on many occasion. The pasta was dry, tartare flavorless, salad so basic. Meanwhile, our neighbors ordered the same pasta and salad yet the pasta had a luscious sauce (where was ours?) and the salad was filled with greens that ours was lacking. Service is good more than it isn't and tonight was no exception. The scene is consistently cozy and delightful. You are seated so close to people that conversations with strangers are commonplace and I welcome them because the place draws a nice crowd. Net net: it's a hit/miss place when it comes to food but I'll continue to visit from time to time. Oh, the pricing is reasonable for a seasonable neighborhood spot so keep that in mind. Cheers.", "author": "Jimmy Z."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-11-01", "description": "Came on a date night Wednesday, prompted by regularly walking by it's cozy atmosphere. My wife demanded cozy, and the next day was her birthday. So cozy it was.\n\nWe were there at 5:45pm, so there were only two others, packed by the time we left around 7pm.\n\nWe started with a quartino of wine. It was the special, so a little pricier than we might typically choose. But it tasted better, so what the heck. Following that, the complimentary bread was very tasty! \n\nWe ordered the crostino (it was fine, but can't recommend), the cauliflower (fantastic, maybe the best dish), the fusilli (disappointing - tasted like good mac and cheese - which, who doesn't love mac and cheese? - not what we were looking for), a side of fried shishitos (very good), and finished with a slice of pie (like all 4 and 20 blackbird pies - very good.) \n\nSo I write this as a 4 star review based on the options of the menu, good service, and coziness. In my one experience, I would say 3.5 stars for the food we chose. However, it was really the pasta that brought it down, which the server did not recommend when running through the menu. \n\nIt's easy to expect a good pasta from an \"Italian restaurant\", even though there is plenty of good, non-pasta Italian food - including the rest of the menu that we haven't yet tried.\n\nIf you live in another part of the city, I'm not sure if you want to make a grand-gesture style trip to eat at Rucola, but on the hand, I'm not sure you don't. Give it a shot and let me know.", "author": "Benjamin C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-21", "description": "This place is a Boerum Hill staple - and unfortunately, selfishly speaking, everyone knows about it (which means getting a table during peak dinner hours is tough to do). Tucked in a the corner of the neighborhood, it's off the beaten path of Atlantic Ave and almost blends into the residential brownstones surrounding it - easy to miss if you don't know its there. The owners have nailed a unique vibe that suits its surroundings perfectly: super charming, cozy, rustic feel that plays well to its farm-to-table menu. The only downside to Rucola is waiting to get seated - it's a small restaurant with very little standing area, so call in advance; they don't take reservations (unless you're a party of 5+), but they'll put you down on a waitlist so you can manage around it.", "author": "Faisal S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-03-03", "description": "Good brunch, lunch, cocktails.  I live in the neighborhood and appreciate the consistent food and service in a pretty setting.  \n\nWhole fish, wine list, salads and pastas are easy to praise.", "author": "Eve H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-29", "description": "Love the concept of communal tables. Your party may be seated next to complete strangers. The rustic decor is warm and welcoming.\n\nNot many vegetarian or vegan options but you can substitute things on the menu.\n\nI ordered the heirloom tomato salad and the home made pasta. This was a farm to table restaurant so the salad was very very fresh. The pasta was homemade and quite good. \n\nOverall a must try at least once kind of place.", "author": "Shruthi R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-30", "description": "Came here twice, the entrees were good but get the shrimp pasta and the starters are all on point. Space is tight so not great for large groups but the cute decor and friendly service more than makes up for it", "author": "Pavan S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-03-14", "description": "The food is really lovely (if expensive) and the location is quaint, quiet and neighbourly. I just don't know why the staff are so rude. Am I missing something? Do you need to be obnoxious to be cool these days? Maybe you do. Ah well, I wish them the best but I'll not be making this our local.", "author": "Olaf D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-10", "description": "Warmth, relax and cozy spots for celebrities.\nI'm not a celebrity, but we saw Ethan Hawk and family sitting next to us for dinner and he seemed like a regular.\n\nThe restaurant is super small, but it's super intimate and casual. The staff is very cool and lay back.\n\nThe food is mysteriously ok. Maybe because the menu does not have a wide variety of Italian dishes even though when I was looking for Italian restaurants in the area Rucola was one of the first ones on the list.\n\nThe overall experience was ok. Food selection and prices can be better.", "author": "Wendrich J. M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-21", "description": "For real everything was perfect and I died and went to delicious food heaven there. We ordered the Montepulciano and it kind of went with everything so I think the wine list is great too, and I dont know anything about wine. The pasta was DIVINE. Also loved the skate fish dish. Really lovely place.", "author": "Karen K."}], "servesCuisine": "Italian", "priceRange": "$11-30", "name": "Rucola", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "190 Dean St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/ea87R47Kp_k95_fE7ginIA/ls.jpg", "@type": "Restaurant", "telephone": "+17185763209"}