{"aggregateRating": {"reviewCount": 458, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-15", "description": "Sat at the bar after getting engaged and had an awesome dinner. :) \n\nTerrific duck and small plates, tasty wine list and well-made cocktails. I would highly recommend for a romantic evening, a small dinner with friends or as a random walk-in when you don't feel like cooking. Excellent version of what every site on Smith St. claims to be, but this place actually performs!", "author": "Kara C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-05-26", "description": "The food was great, but the restaurant is loud and they have jammed too many tables in. The waiters are friendly, but not all that attentive. I love the venue and the vibe, but I think they need to work out some of the kinks. Removing some tables would help.", "author": "Lee W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-08-09", "description": "Had coffee, tea, pork sandwich and hash browns with salmon. The Stumptown was very well brewed, and only a dollar for refills. Great atmosphere and decor, tasty food (esp. sandwich) but small portions, and unfortunately the service was lacklustre. Looks like it would be very romantic for dinner though - might try again. Came to $40 with tip for two people for late lunch - a bit pricey when considering the portion sizes - but overall quite nice.", "author": "Diana C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-16", "description": "I live in the neighborhood and have been going to this spot since they opened. It has become my all time favorite restaurant. Sure it's a long wait but it's well worth it. The host are always more then accommodating. Julian one of the owners is more then jolly and handles the hectic night crowd with such grace he makes it look easy. So the service to me is good, though I wouldn't mind being able to walk right up and have a seat to sit at the wait is the price I will pay to have a lovely fresh meal. I also love coming here for breakfast during the week or lunch, you can pretty much always get a seat and its a good deal for quality. The chicken is my favorite, their pasta is always on point, and all the veggies are fresh and in season. The chefs cheese and anti pasta starter is amazing, I'm addicted to the fennel and I am smitten with the cocktail The New Rider. Desserts are a treat as well! Hurray for Rucola! \n\nI don't think I will get tired of going here once a week.", "author": "Ashley T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-02-24", "description": "Nice ambience. Food is unremarkable. Service is friendly but absentminded. Not worth a return visit.", "author": "Becky L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-09", "description": "Really excited to have this place in the hood!\nWent here the other day with a few friends. We arrived before the dinner rush (around 6:30) and our party of 4 was seated right away - although maybe we got lucky because within 30 minutes the guy at the door was putting people on a waiting list.\nIt's in a beautiful space and the decor is comfy and creative. Love the milk bottle chandeliers!\n\nBut more importantly, the food is great. The best things on the menu that night were well curated meat and cheese plate, a really unique and DELICIOUS charred fava bean dish, and an outstanding handmade pasta with ricotta. Everything looked and tasted like it was made with a lot of love.\n2 fantastic bottles of wine and an amaro digestif later we were all in foodie heaven.\n\nSort of want to go back every night to taste the new things on their ever-changing menu. And to drink some more of that amaro. Yum!", "author": "Mara T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-11-27", "description": "Incredible food! There is a trick to getting right in on a fri/sat night. Although they dont accept reservations you ca call ahead on the same day you plan on coming, they start this around 4pm. So say you want to go Sat. night, call they place around 4pm on saturday and tell them you plan on coming at lets say 7:30, they will put your name on a list and you get there at 7:30 and you'll wait 5 min. max. Ive done this 4 times and it always works. Good luck getting a table if you don't do this! The food is great, try the squash pasta and the brussel sprouts. Both are perfect. And for dessert I am in love with the sea salt and olive oil chocolate mousse. Best dessert i've ever had. This is hands down my favorite italian place in Brooklyn. Great wine selection too! Cute little restaurant, very tiny and pretty loud.", "author": "Yara C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-05-07", "description": "bleh - unfortunately all I can comment on the details of this experience.\nBut I completely agree with all the other reviews giving it 1 star.\n\nBtw Frankie's is quite good, as is Daniel, Gilt and Gramercy.\nBut the food here is nothing to match any of those places - it's hard to imagine veterans from those restaurants producing what is served here.", "author": "Ying Q."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-06-16", "description": "While we were waiting for a table at the bar, just as we were about to order cocktails, a young woman came over and loudly asked for my friend to move his bag (which was hanging on the back of his chair) because it was in the food runners way.  Would've been totally fine and we would have no problem moving it , but she came off pretty rude with her request.  \n\nShe said it loud enough for the most of the restaurant to hear and acted like we were an inconvenience.  So sorry to be annoying!   Would have preferred her to be less loud and  intrusive and more welcoming.  \n\nImmediately following her suggestion, my friend and I looked at each other and simultaneously said \"let's get outta here.\" Clearly we didn't feel very welcome.  Thanks for that Rucola.\n\nI'll give it another try because the food is delicious and our first experience was pleasant but please be nice to us.", "author": "Ashley J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-12-30", "description": "A wonderful place! Fabulous simple italian food done perfectly. Great warm atmosphere with perfect lighting. We had a party of six and we all felt it was a really special place- most of us had the housemade rigatoni with bolognese, my mom had the whole brook trout and we all had the chocolate pudding with olive oil and sea salt which was to die for. The roasted brussel sprouts and the canneloni beans and escarole were also great.\nGood beers and wine list- and it looked like they knew what they doing in the cocktail department. \nGo and enjoy!", "author": "Darragh B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-08", "description": "After walking past this spot dozens of times since it opened, I finally rallied some troops and tried it out. Rucola is always packed, so calling about an hour ahead of our arrival and making a non-reservation reservation was key to minimizing the wait time. The decor is great here, with the whole reclaimed wood / old-timey light fixture thing in full effect, but I already knew that after my extensive surveillance. I would say it's cozy bordering on cramped. The waiters have sort of a tough time navigating between tightly spaced tables. The noise level is high. Not too big a deal, unless you're like me and your voice cracks like a 12-year old boy when you have to raise your voice.  We had some interesting cocktails, good wine, and pretty great food. I had the LI Duck and it was stellar. The price point here is maybe slightly high, but if they can keep a packed house every night then it's clearly not too high.\n\nAfter our meal here, I'll be only slightly less envious in future when walking past and seeing all the happy people inside. The experience is not perfect, but it's a strong addition to the neighborhood and I'll be returning. I'd go 4.5 stars on this one.", "author": "Toby S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-07", "description": "This place feels like a little restaurant in the West Village....except you are in Cobble Hill. Intimate and romantic...nice selection of wines...lovely pastas! Can't wait to try the larger entrees, we opted for the two pastas and loved the kale pasta...it was creamy goodness. It's a tight squeeze navigating to the table but once you are there, you are comfy. We didn't sit at the communal table though...so can't comment on that. The bar looks like a great place to grab a bite solo. Great neighborhood joint and worth trying out if you don't live here! Yummy chocolate torte too!", "author": "Anita C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-03-29", "description": "Nice atmosphere, but the waitress repeatedly recommended me to sit down at a  communal table while I was waiting for my friend to come, and when he came, she recommended me again to sit at communal table while two of two-people tables were open. I had already told her I wanted to sit down one of the two-people table if it was still available when my friend arrives...I thought it was unusual and a bit uncomfortable...", "author": "Athena G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-12-22", "description": "There's a reason there's a two hour wait on weekend nights.  It's the quintessential corner restaurant.  Have you seen it?  It's freakin awesome. Located on a residential street in the ground floor of a brownstone.  It's hard to believe that a place like this isn't pretentious.  But it's not.  Yes, the bartenders have beards, but so what.  They make damn good drinks.  I've been about four times and always left satisfied.  The roast duck was especially good.  They have a great wine menu.  NOTE: don't schlep out here from Manhattan.  Those of us that are raving about it have limited choices, mind you. It's nice when it's in your neighborhood.  (PS. It's not exactly worth a two hour wait.  Maybe 25 minutes, max)", "author": "Matt D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-22", "description": "Sometimes I wish I could eat every meal at Rucola. Seriously. I'm obsessed.\n\nFirst, their food is delicious. Their menu isn't the most extensive, but there's something for everyone, and I've never had a single bite of something there that I didn't like. The food isn't too heavy, it's well prepared, and it's amazing.\n\nI highly recommend the chef's selection of meats and cheeses to start--going with what s/he chooses is a totally safe bet. For main courses, I'm generally a pasta or chicken orderer--not the most adventurous things on the menu, but I've never been disappointed.\n\nThe other thing that I have to give Rucola a big shout-out for is their service. the restaurant is, justifiably, ALWAYS crowded, so I often stop by thinking I might not be seated or there will be a long wait, but I don't mind because the staff is SO nice. They're never frazzled by how busy they are (or if they are it never shows), and their kind and beyond professional with their patrons. It's the only restaurant that I return to over and over again equally for the food as the service.\n\nIn the interest of fairness, I will give two cons: 1) I was a little intimidated by their sample menu online at first, so I didn't rush to Rucola as soon as I found it. 2) I'm not obsessed with the focaccia they serve at the start of the meal. That's right, the worst things I can say about Rucola are \"I'm sometimes a whimp about menus I see online\" and \"I'm not obsessed with the thing they give you for free.\"\n\nFor dessert, have the chocolate pudding with olive oil and sea salt--you'll be hooked too.", "author": "Jenny H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-06-14", "description": "The drinks are delicious and the wine list is appealing. I only had one meal that was perfectly ok. I can taste the potential the kitchen has to offer.  This place is a great addition to the neighborhood and I look forward to its evolution.", "author": "Unkl- T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-26", "description": "From the cheese and anntipasti platter to the roasted carrots, and duck breast, everything was to yummy. We were celebrating my sister's birthday and from the moment we told our waitress she was super attentive. I enjoyed everything I ate and happily told my coworker about it--she went and had an enjoyable experience too.", "author": "Heather J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-03", "description": "I'm the first to admit, there are a lot of great Italian restaurants in the neighborhood, and Rucola is yet another welcome addition.  Charming, intimate, deliciously simple Italian fare, attentive, warm service, fair prices and great wine - it does get crowded, but it's so worth it.", "author": "Dana B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-02", "description": "Great food, great atmosphere (small, intimate, casual, rustic), nice service, relatively inexpensive. I'll definitely will be back. Ate breakfast here but will come for dinner next time. $32 before tax and tip for two", "author": "Will S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-02", "description": "Food was really tasty. I had the pate to start (special), which was very good and a very generous portion. The rigatoni bolognese was excellent. The bolognese sauce was very light but seasoned perfectly. The service was friendly and attentive. The decor is really nice, kind of rustic and the light fixtures are really nice. They look like old milk bottles!", "author": "Aidan L."}], "servesCuisine": "Italian", "priceRange": "$11-30", "name": "Rucola", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "190 Dean St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/ea87R47Kp_k95_fE7ginIA/ls.jpg", "@type": "Restaurant", "telephone": "+17185763209"}