{"aggregateRating": {"reviewCount": 458, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-01", "description": "Hidden gem!!! Amazing staff, amazing food amazing ambiance and overall style. Nice place to come with a friend for lunch of dinner. Went with a friend near 6 (fairly slow) so we sat by the window seat, and probably the best seating! The food was great overall moderate servings but don't be fooled as it is enough, \"it's quality not quantity\" trust me! For drinks my friend had root beer no complaints there and my lemonade was perfect! A bit of an orange twist, not too sweet not to sour. We ordered (Rigatoni) and (spaghetti) and we had ZERO complaints as the food is very presentable and delish!! We both agreed to come back and try everything on the menu, for sure with more people. It started to pick up around 7 so if you want to avoid the crowd, come before 7 but people in the area seem pretty nice. Also didn't feel pressured or rushed out, nice and relaxed staff again quality not quantity. Water glass never reached halfway as our waiter was very attentive.", "author": "Stephanie D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-25", "description": "Started off with the cheese selection which was good and came with a nice apple jelly.  Had the pasta for dinner which was fresh, cooked perfectly, and delicious.  Great service and knowledgeable staff.", "author": "Jenny W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-06", "description": "Ok, something weird is going on with a couple of these reviews. \n\nFirst of all, I live nearby, just ate here for the first time tonight and thoroughly enjoyed the food, ambiance, and service. I don't know the owners or anyone connected to this place, but I'm already a fan.\n\nBut some people had a different take -- and I dunno, seem to be working out their own, uh, personal issues, issues that perhaps have nothing to do with Rucola. \n\nWhy is it appropriate to waste my time (1.) complaining about the size of a table, (2.) opening by saying \"Perhaps it's not such a good idea to visit a restaurant on their second day\" and then ranting for an exhausting 900 words about first night jitters, or (3) rambling on about a Radiohead concert?\n\nWannabe food critics who couldn't get a reservation at Frankie's?", "author": "Steve W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-15", "description": "I walked back into the apartment Saturday afternoon a bit vexed after watching my team draw a game it should have won. The love of my life said to me, \"I haven't left the house yet, we should go out.\" As we hit the bricks, she continued, \"I'd like some good food made from fresh, local vegetables.\"\n\nNow by this she could have meant \"let's go to the greenmarket and buy stuff for you to cook\" but I was still feeling a bit under the weather from the night before, so I thought frantically and recalled hearing about Rucola because of their proposed a la carte CSA thingy. I had signed up for the email list but only received 3 emails from then indicating that they had items (but they all sounded good: garlic scapes, heirloom beets, and baby lettuces. If only either of us liked beets). \n\nAnyway, we walked in to Rucola at 3:45 on a Saturday afternoon. The block was pristine, and the same atmosphere carried over into the restaurant. The place felt both sleek and comfy, attributes that don't often coexist. There was only one other occupied table inside, though four other parties arrived over the course of the meal and the tiny outdoor tables (which were taken when we arrived) turned over as well. \n\nBut what I really wanted to relate to you was the smell. When we walked in, it smelled so intoxicatingly good that I knew right away we'd hit paydirt. \n\nWe had \neggplant caponata\nescarole salad\na slice of the pizza of the day (capers, mozz, sauce, hot peppers)\na slice of the seasonal frittata (cippolini, piave, zucchini) \nmimosa\nglass of rose\nespresso\ndrip coffee\n\nThe eggplant was great. If I'm not mistaken it had capers, pine nuts, mint, and a little sundried tomato. When my mom makes it she puts in celery and I don't think she uses mint. Usually my mom's methods form my preference, but I think Rucola's version was better. The foccacia that came with it was solid but not spectacular (could have been better if it was warm and a little crispy on the edges). \n\nThe pizza was also great. The sauce was from cherry tomatoes I believe they said, and it was intensely sweet and flavorful. The cheese was applied sparingly but tasted excellent, and the peppers were even more sparing, which was good because a little went a long way. \n\nThe escarole was extra fresh and the crutons it came with were nice. The rose, recommended by the server (a friendly blonde lady named Jess [ica?] I belive) was more than sufficient. \nI thought the frittata was slightly bland, but my wife loved it. \nThe espresso was great, though tiny. \n\nThis gets five stars because of (1) the high quality of the food and ingredients, (2) the extremely reasonable prices, (3) the seeming intent behind it (emblematized by the CSA idea and the local ingredients, and (4) the virally charming overall atmosphere, including the service and decor.", "author": "Josef K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-15", "description": "Its my favorite!! Small and a delicate place. The food is very fresh and delicious. The servers attitudes are very positive. There is not much to say.. You can find peace in this neighborhood and in this place...", "author": "Ceren A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-07-03", "description": "Went back to give the place another try. We were told to expect a wait of about an hour, so we wandered off to have a drink nearby and await a phone call. It was nearly two hours before we were finally seated (with much apologizing from the host - who was just as charming as on our previous visit.) \n\nWe took our seat and ordered some wine and a meat and cheese plate as we began to peruse the substantially expanded menu. The meat and cheese plate arrived and was much improved from our previous visit altho it took a good 20+ minutes to come out. The balance of our meal was ordered and arrived in a similarly slow fashion but always with a big smile and frequent check-ins. The portions of all the plates were much better and we left feeling satisfied. The mains were over salted but were well cooked and nicely presented. \n\nSo in conclusion - staff is as pleasant as you could ever wish for but the kitchen still seems wobbly. Food is slow to come out and inconsistent in it's quality. It's been a couple of months since our last visit and things are definitely improving. Keep it up! I will continue to root for them and their charming little spot.", "author": "Eric O."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-02", "description": "Love their Bien Cuit croissants and yogurt, fruit and granola! Their granola is actually amazing! The service is kind of slow on busy days - dinner is fine but I find that they are more of a day place", "author": "Calliope C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-04-29", "description": "Food was very good--we had the pork sandwich and the pizza of the day. The former had a ton of flavor, very tasty; the latter, at $5, was a really good value--while not big enough to feed a nose tackle, it's a great menu option for kids or someone who wants a little snack without having to shell out $15.\n\nThat said, I was disappointed by the service, which was very aloof. No one ever checked in to ask how our food was; the greeting and overall interactions were cold and unwelcoming. Moreover, the waiter brought our check before we asked for it, and didn't ask if we wanted anything else. Ironically, we were hoping to order coffee and dessert, but that put us out of the mood. N.B.: the place was half empty, so it wasn't as if the server was too busy to check in, nor had we camped out there for hours, wearing out our welcome.\n\nOn the fence about going back, since there is no shortage of good choices (Bldg on Bond, Ganso, etc.) nearby.", "author": "Food Jerk X."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-16", "description": "This is the place where I go to get good food and drinks in a laid back environment. The plates can be a bit pricey for the serving sizes, but the food is amazingly flavorful. My husband and I usually get an appetizer and a pasta dish to share, and then we each get a meat dish. This is the perfect serving for a petite me and him. The cocktails are also well crafted and smooth. This is the place where I first fell in love with bourbon, so of course it is a very sentimental place for me.", "author": "Cathy C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-06-03", "description": "Rucola is perfect as a neighborhood restaurant, but not destination-worthy as of yet.  Solid drink menu with inventive and low-sugar cocktails, pleasant service, a cute if somewhat jammed space, and friendly staff.  The food just didn't blow any of my party of 4 away; I would not point to anything being particularly bad, but nothing was particularly great either.  The soft shell crab dish seemed oversalted and overbreaded; the chicken was oversalted, and my fish dish was somewhat bland.  Again, perfectly great spot if you're already in the neighborhood, but if you don't live around there, there are probably equally good places to go.  \n\nNothing on the menu particularly wowed me to begin with, either... again, not bad in any particular way, just not particularly Italian, and not many things that grabbed me.\n\nAt any rate, I'm pulling for them, as the people running the place seem very cool and friendly.  Considering it was packed when we ate there at 8 on a Wednesday, it looks like I don't have to pull for them too hard...", "author": "Jonas B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-06-14", "description": "A magical restaurant tucked away in a fairytale setting. The cocktails, wine \u0026 negronis exceed expectations. Quiet enough to actually heard your date or friends talk. \n\nA friend is an investor in this place but that doesn't stop me from really enjoying this adorable place. There are rumors of setting up a CSA for a local school.", "author": "Jasmine T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-27", "description": "Rucola is a favorite of my girlfriend and me.  The menu is fantastic, the atmosphere can't be beat, and the wine list is reasonably priced.  We just went back to Rucola for our anniversary, and the folks at the restaurant made us feel very special.  We venture out from Manhattan for this, and it's definitely worth the trip.", "author": "Patrick M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-24", "description": "We arrived early on a Saturday night, at 5:15 pm before the kitchen opened at 5:30 pm and the waiter gave us a choice of tables and let us know we could order drinks. We ordered drinks, yummy cocktails, and then he came with great bread \u0026 oil and took our order even though the kitchen wasn't officially open. We got the arugula salad - great flavor, very fresh, and the rigatoni with meat sauce, and the roast chicken main dish. Everything was excellent! Service was a 10. Did not feel rushed. The place fills up very fast and by the time we left at 6:30 pm it was packed and people were waiting outside. \n\nAlso, its way too small inside to wait at the bar for your table. The whole bar was full with people eating. So if you have to wait they usually tell you to wait outside or they will text you if you go to another bar to drink or wait.", "author": "Julie C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-08-07", "description": "Three stars, on account of an average of 5 star and 1 star experiences. When Rucola is on, it is amazing. Great food, good service. The restaurant itself is adorable. We've never had to wait very long for a table, even for brunch on a Saturday. The coffee is good. It's usually a place I'm happy to have in our neighborhood.\n\nBut when they fall short, man, do they fall short. They definitely have issues sometimes with staffing sometimes. I remember once spending literally two hours there for breakfast, 1.5 of which were enduring incredibly slow service. Most of the time, a restaurant will comp your coffee or send over side dish or SOMETHING to make up for this, but nope. In terms of personality, I've had experiences here where the staff were the nicest people ever, and experiences where I felt like I was an unwelcome guest in someone's house. It seems to be luck of the draw.\n\nOne thing that does really get me about them is the almost complete and total lack of options for vegetarians/vegans for many of their meals. I am not saying that you have to provide this, but come on, you're in Brooklyn. The fact that a vegan is stuck literally with bread and jam if they come for breakfast is pretty unfortunate.", "author": "Cay V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-06", "description": "Excellent experience! Homemade shells with spicy lamb sausage, kale, and ricotta is to die for. Can't wait to return!", "author": "Christine A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-13", "description": "amazing dinner, though i'm surprised how busy it was for a thurs night at 930p. i think it's the proximity to barclay center. \n\nanyway, we sat outside as it was a few decibels lower than the indoor dining area. it was a perfect setting. \n\nservice was amazing. generally, it's hard to get any attn outside esp since there are only two tables, but someone checked up on us at least every 5 min to refill water and to see if we were ok. \n\nfood was amazing as well. for two, we ordered \n- crudo of branzino. favorite dish of the night\n- coppo, finocchiona and sapore del piave. could've passed on the finocchiona but it wasn't terrible, just a lot of fennel. i did like the side of pickled fennels that came w the meats\n- tagliatelle. i didn't try this but my date said it was delicious, and ate it all. \n- roasted chicken: well flavored and juicy, though i'm not big on white meat\n\ndessert was delicious. chocolate pudding was overly decadent. but, INTERNET THERE WAS PIE. blueberry lavender for the night i was there.\n\noverall, an amazing restaurant located on a sleepy street. delicious food, unpretentious atmosphere. god, i love brooklyn.", "author": "Joanie K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-08", "description": "Made a last minute decision to try out that \"cute little corner spot we always walk by on Hoyt\" and were very happy we did. It was early on a rainy, Thursday night so the restaurant wasn't crowded when we arrived. We chose to sit at the bar and promptly ordered drinks. \n\nI had a quartino of wine (half carafe) which is really more like two moderate glass fulls so is a great option if you're leaning towards one of the higher priced \"per glass\" wines.\n\nTo start we had the Branzino crudo which was gorgeously delicate. The flavor of the raw shaved fish was accented by the very floral olive oil and overall the dish was very light and very well put together.\n\nFor my main, I had the whole grilled trout which came arrived on a plate completely whole (head to tail). The skin had was nice and crispy and the flesh was perfectly cooked, flaky but still firm. I began to eat, keeping an eye out for bones and noticed that there were none. They had completely de-boned the fish before cooking it which was quite impressive. The dish was seasoned well, with thyme, lemon and was topped with an olive salad that paired well with the earthier flavor of the trout.\n\nThough dessert looked heavenly, we were happily satisfied with our level of fullness and decided to pass. I will definitely be going back again soon.", "author": "Lizz H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-22", "description": "We've been here the second time now and everything was excellent again! We had a bottle of Wine (Montepulciano d'Abruzzo - Cantina Colonella), a few appetizers (olives, and the appetizer special of the day), the pasta special, braised beef shank, and spaghetti. As a desert we chose the flourless hazelnut cake. The restaurant is definitely one of our top 5 in New York ! Not to forget the atmosphere there, everything is just perfect. *Lecker*", "author": "Chris F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-09", "description": "Wow - helloooo adorable date spot! Well off the worn path of Smith Street, I actually visited here with a couple girlfriends.  I had called ahead to put my name on the wait list which is not the same thing as having a reservation FYI (those are only available for parties larger than 5) and the manager called me when my table was available - we only waited about 10/15 minutes.  I tried the pasta special of the evening which I found to be just meh but my girlfriends had the spaghetti and roasted chicken dishes and loved them. Their bread is pretty outstanding as is the antipasti. Outside seating is minimal but the restaurant itself is very warm and inviting, and the restrooms are actually something to write home about - super clean, roomy and pleasantly scented by candlelight. Would love to go back for a romantic date night or to try the brunch.", "author": "J L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-08", "description": "It was such a treat to eat here. The special truffle pasta was amazing. Each dish just really surprised you with flavor. Awesome atmosphere and great service.", "author": "Steve Z."}], "servesCuisine": "Italian", "priceRange": "$11-30", "name": "Rucola", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "190 Dean St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/ea87R47Kp_k95_fE7ginIA/ls.jpg", "@type": "Restaurant", "telephone": "+17185763209"}