{"aggregateRating": {"reviewCount": 458, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-06", "description": "great bloody mary.  spicy and tangy.  nice looking place with a very comfortable vibe.  perfect for a weekend afternoon.", "author": "Tom O."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-05-06", "description": "Just came here for dinner, had spring salad, ragu pasta, the charcuterie plate and the ricotta cheesecake.\n\nThe food was not only uninteresting, but poorly prepared.  The leaves in the salad arrived wilted, due to the large quantity of salt on the leaves.  In addition, there were few other flavors, such as herbs or vinegar, in the salad to balance out the overwhelming flavor of salt.  \nThe pasta was served with a ragu that was watery and also lacking in flavor.  The was comprised of shredded beef short rib - bits of it were crunchy - maybe was burnt from sticking to the bottom of the pot?  The tomato base did not taste of fresh ripe tomatoes and was lacking in complexity (herbs and spices).  The pasta itself was cooked quite well, just a touch other al dente, but the quality of the pasta suggests that it was cooked from the dried boxed variety - lacking the fresh chewy texture and also lacking in complexity due to the simple wheat base used to make the pasta.\nThe ricotta cheesecake - maybe it wasn't a cheesecake, but either way it was not smooth and creamy.  But the taste was nice, a little tart and a little sweet.  However, the crust was again poorly constructed - soggy and again uninteresting in flavor.\n\nOverall, food lacked flavor and balance and was poorly prepared.\nThis would be alright - except for the price that was charged.  Expect to pay $60/pp for these courses without alcohol.", "author": "Food L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-05-28", "description": "Super good. Service was excellent, everything from salad to dessert was superb. Tasteful cocktail menu with none of the \"hey, we're mixologists\" bartender shtick that makes me want to order a Schlitz in disgust.  Nice atmosphere, though I'm not at all a fan of the bench seating trend that seems to be catching on in NY, particularly in Brooklyn. If I'm spending more than $50, give me a seat back, please! Notwithstanding this very minor gripe, I'll definitely return.", "author": "Ryan S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-02", "description": "I've been here several times but have never reviewed before, and I had such an amazing experience last night I thought it was high time I yelp'ed for this place.  I used to get frustrated at the long waits (and the waits can be very long!) but since we were planning a big group, we were able to get reservations easily.  We had a birthday dinner with 12 friends last night and and it went off like clockwork.  We emailed with Aiden to confirm details and even changed the head count a few times--he responded quickly and always said \"No problem, we'll take care of it\".  When we arrived the table was ready to go.  Servers immediately took our drink orders and food orders shortly after.  All of the food came out together and quickly I might add--we finished a 3 course dinner for 12 in 1.5 hours.  That's pretty damn impressive.  Let me add, its not as if we were in a rush, nor did we feel that they were rushing us--they were simply very prepared and on top of things.  The food itself was DELICIOUS and we had some vegetarians in the group but there was a great vegetable antipasti and a pasta entree for them.  Their preparations are simple and the menu is small but it's got crowd-pleasers on it including pasta and roast chicken so even the pickier eaters can find something.  It's well prepared, tasty and filling--we walked out of there totally stuffed!  They even brought me a dessert with a candle so my friends could sing to me :)  All in all, a VERY good place to have a group.  Thanks Rucola for making my birthday dinner such a success!!", "author": "Spike G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-10-19", "description": "Disappointing--totally charming room and friendly service but waited forever for our simple order and despite staff apologizing  the (inexpensive lunch) wasn't comped. Probably wouldn't have minded as much if the food had been more remarkable. Mediocre eggplant sandwich and lasagna. perhaps dinner is their forte.", "author": "David T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-10-13", "description": "The food is terrific. But I don't like feeling like a sardine. It's great that the waiters apologized when they bumped into me, but it happened _every time_ they walked by, because the bench and the chairs behind them are only separated by about 9\". The crudo is pretty special though.", "author": "Ben R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-07-18", "description": "We went to Rucola on the recommendation of two separate friends for an anniversary dinner.  After being told it would be 60 to 90 minute wait, we grabbed a seat at the bar to try the cocktails knowing it would be a long wait.  The host came over within minutes to seat us, and maybe that should have been a sign.  The service was VERY rushed - the waitress was behind the host asking for our dinner order within seconds of being seated at our table. We were granted a few minutes, and placed our order while enjoying the appetizer we ordered at the bar.  Our dinner plates were out about 5 minutes later, when we were hardly through our appetizer.  The risotto was fine, but the fusilli was a beige mush.  The cocktails were delicious, and the setting was charming.  I hope it was just an off-night, but unfortunately for them, I won't go back to find out.", "author": "Catherine J."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-07-06", "description": "We went to eat here for the first time last week and we very excited.  Pros:  great food!  The cons:  by the time it arrived, we were ready to leave.  Our server that night repeatedly passed our table, glancing to see empty wine and water glasses, then continuing on, often to \"chat\" with other tables for 5-7 minutes.... and not taking orders as the room is small enough the hear the topics of coversation.  Slow food isn't a large issue when it's really good AND when you're not sitting there out of wine and can't get anyone to stop by.  The odd thing is that there also appeared to be 2 managers and 2 other people working the room, glancing at tables,  but still no one ever stopped by, or noticed these things.  If your service matched the quality of the food (in terms of attentiveness - everyone was very nice) you would be a great neighborhood place.  We'll come back because everyone can have an off night - but this was very, very off.", "author": "David J."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-06-07", "description": "I love the food here, but the service is generally pretty awful. You will wait about 15mins to have your order taken with not so much as a glass of water during lunch. I've watched the staff text or do everything else before taking an order. I've watched customers get up and leave out of frustration because no one took their order or they just simply forgot too. Go for the food but bring lots of time and patience.", "author": "j R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-09", "description": "My new neighborhood favorite - great food and great service at a reasonable price.  The waitstaff and the bartender were friendly and helpful.  Porchetta and fluke were extremely tasty, and the pie was very good too.", "author": "P. J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-30", "description": "risotto was delicious and tangy. It's still in process of fully opening, but what they have is good.  Drinks were wonderful.   VERY crowded, but totally friendly staff will call on your cell phone when table is ready.", "author": "Toni S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-28", "description": "Get the veal spiedini and the arugula salad. And the pastas are yummy. I also grab a coffee from the counter now and again. I would say that the entrees are just okay, but that's always the way with Italian places. And from the outside, it's just about the coziest looking place in the universe.", "author": "Ilana M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-11-28", "description": "This is my favorite restaurant.  The food is five-star caliber at neighborhood prices.  The wine list is both broad and deep.  The chef worked at Danielle and Cafe Bouloud and just wanted his own place.  The manager worked at Prime Meats and is super-welcoming.  The staff are all-stars of the industry and just make you feel good to eat there.  The design and decor are aesthetically superlative.  The atmosphere is upbeat and welcoming.  And the last time I was there I saw Michelle Williams and Jake Gyllenhaal on a date!", "author": "Marc W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-16", "description": "great atmosphere, kind \u0026 knowledgeable staff.  i've been twice.  once, i sat at the bar with a friend and had wine and the meat \u0026 cheese plate with their house focaccia.  the focaccia is terrific and the meat \u0026 cheese plate delicious.  some restaurants don't fill up the plate with meat and cheese and there is only enough for two people to each have a little taste, but this was a nice serving and a good variety of flavors.  the restaurant is a little expensive for my budget but the cheapest glass of wine was delicious and i didn't feel like a slouch ordering the cheapest glass on the menu because the wine menu is very thoughtfully chosen.  \n\nanother time, i was with a big group and we shared a lot of dishes.  we had a reservation but the group before us arrived late so we had to wait a bit.  the staff was very apologetic and i really don't know how they could have helped the situation.  its a small restaurant.  i had the trout and it was very good.  i tasted my friend's pork shank and it was so tender i wished i'd ordered it.  the chocolate pudding is delicious; definitely order it!  i never would have thought to order it but i really enjoyed it and think i am addicted.  \n\nmy friends and i splurged on a big celebratory meal and i was really happy with the food, service and atmosphere.  while it is expensive for my budget, i think the prices are fine for the neighborhood and the great quality of the food and wine.  i felt every penny was well-spent.", "author": "Annie G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-11", "description": "All the right ingredients - nice staff, excellent local food, great prices.", "author": "John B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-05-31", "description": "Great service and vibe. Pasta is tasty but the portions are really, really small.", "author": "Shazza F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-11", "description": "I am torn between telling everyone how wonderful this place already is -- after just a week in business -- or keeping it to myself! But given the low star-ratings I'm seeing, I have to say something. First, the staff is beyond nice -- chatty, motivated, smiling. Next, everything on the (still limited) new menu was wonderful, innovative and delicious. As the restaurant finds its feet, more items will be added and they'll even get bar stools that are tall enough to reach the bar (they're coming soon, the current ones are from the owner's apartment!) I had a delicious glass of wine, the bartender's recommendation, and I'm sorry to say it, but it's a rare thing to get a really good glass of wine (I could list the restaurants on one hand where I know the wine will be good, every time, including JakeWalk, Grocery, Saul, Buttermilk Channel). I'm not saying Rucola is The Grocery or Saul...  yet; but they've made a darn good start.", "author": "Alice G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-02", "description": "corner brownstone tucked on a beautiful street in the neighborhood.  decor is wonderful.  vintage farmhouse accents.  the lights are made with milk bottles - too cute.  chalk boards. cute bar. went on a thursday evening and there wasn't an empty table in the house.  it was a mix of clientele - families, couples, small groups.  we sat right down (one of the last tables available) at about 8PM. we started with two delicious/fun cocktails.  to make the most of the menu, my bf and i decided to share a three course meal.  for an app we had a sashimi style bronzino with basil/olive oil/sunflower seeds - it was simple and delicious.  the ingredients tasted incredibly fresh.  for a pasta we had strozzapreti in a pesto sauce.  the garlic smell was divine and the pasta was cooked perfectly.  had a great texture and tasted homemade.  our final course was duck on a bed of figs/turnips.  again, cooked perfectly.  the combination of flavors was excellent.  it did take quite a long time for each course to come out.  my sense is that since the restaurant is on the newer side, they are still working out the kinks in the kitchen in terms of dealing with a packed house.  the slow service didn't bother us much since the decor was so cute and the food so delicious.", "author": "Brenna G."}], "servesCuisine": "Italian", "priceRange": "$11-30", "name": "Rucola", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "190 Dean St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/ea87R47Kp_k95_fE7ginIA/ls.jpg", "@type": "Restaurant", "telephone": "+17185763209"}