{"aggregateRating": {"reviewCount": 458, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-31", "description": "WOW! My Thursday night experience could not have been better. Rucula is the perfect neighborhood locale, with a very friendly atmosphere that made me feel like I was part of the fam. As I have a dairy allergy, I chose the Tartar and an assortment of vegetables. The fennel and greens were my favorite. We sat at a communal table, which at first appeared small and crowded but revealed itself to be the perfect setting to share a meal surrounded by great company. After our meal, we ordered a few desserts. At first I was saddened that there were no vegan options... but our enthusiastic server John let me know that the cookies were actually both gluten and dairy free! After trying one, I had to have more... and ended up eating a full plate of four! They were served warm, and had walnuts and melting chocolate inside... melted in my mouth. I could not reccommend Rucula more, and will definitely be back for the veggies and dessert!", "author": "Matt G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-28", "description": "Local spot which I hesitate to expand on too much because I still want to find a table on busy days.  Seasonal menu that's thoughtfully curated and always fresh.  Service is friendly and they know their regulars names.  Pudding is to die for- not a joke.  I've even tried to make it at home- I mean how can their pudding be this good? This alone should tell you they take the least complicated dish of all and perfect it.... this should leave you to believe me when I say the rest of the menu basically is genius.  I will give one small critique- bacon in am is so inconsistent and sometimes overcooked which I overlook bc the latte and ambiance are worth the less than perfect bacon ;)", "author": "Nichole S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-10", "description": "I echo Balthazar.  This is my second time giving this restaurant a chance. I am on business so I don't have the local inside track but... drinks/cocktails are great.  Food -way over engineered.  First time here not overly impressed with pasta dish I tried . Tonight tried the fried quail which sounded interesting and the line caught cod.  Fried quail appetizer was like eating chicken wing flats without the meat- all breading. Cod over a risotto main course- while tasty and ingredients fresh was presented on an appetizer plate. While not expecting \"family style\" my 8 yr old would have scoffed.\nI'm sorry but good Italian food is good basic food and best in a simple setting.\n\nI can not recommend this restaurant.", "author": "John S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-11", "description": "HOLY MAN, OH, MAN is this place is super cute, cozy and delicious! It's one of those places that makes it worth it to hoof it on the F train to BK even on a rainy Saturday night. I had the roasted sunchokes, eggplant stuff, and Spaghetti with walnut pesto, smokey cabbage, Caciocavallo. Each dish was incredible. My mouth was so happy! I wish we had nice food like this in the East Village. The atmosphere and decor reminded me of the now closed Northern Spy on 12th. Highly recommend checking this place out. The bartender dude was a bit on the cold side, but other than that I'd say this place is the best there is. \n\nNote to Rucola: PLEASE open a spot in the East Village. We need your type of charm and awesome food over here. Come on, ovah! Also, please add an email address to your site, would've liked to email you about possible allergens in your food before coming.\n\nAlso would like to officially request some tasty vegan items (not a salad). Seems like your chef knows his/her stuff, and would likely be able to sub in almond milk/cheese and invents something amazing.", "author": "Ruby F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-14", "description": "A little off the beaten path (a couple blocks off Atlantic in a residential area), decided to try this place on the recommendation of one of my co-workers. The cuisine is modern Italian. The food was delicious and both my wife and I enjoyed the food. The atmosphere is casual. Service was good. We came early and easily found a table, but it got busy by the time we left. Would definitely recommend.", "author": "Darryl R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-04", "description": "I love Rucola.\n\nRucola is one of those neighborhood gems, a \"go to\" spot that transports you to another place in time and has a solid and delicious menu. \n\nMy husband and I (and now along with our 10 month old babe) come here often for lunch and dinner dates and it's always a no brainer.\n\nThe charcuterie is tasty, the schnitzel was quite good, and the polenta was superb. I have nothing but fond memories of the dishes we've eaten here.\n\nBut don't stop there! Dessert is also delish! They always have pies from Four \u0026 Twenty Blackbirds and an ice cream creation. Yum.", "author": "Amber E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-18", "description": "This reminds me of your cool cousin's swanky pad where he/she spontaneously brings together cool ass people for a small party. \n\nThe restaurant itself is small and narrow and gets busy during peak dinner times. It probably has a total of 12 tables and a short bar. \n\nThe food was REALLY good. It was simple but each dish had a distinct flavor. The picked fennel in the choice charcuterie plate was awesome! \n\nI ordered a mushroom pasta with breadcrumbs on top. My fiance  got the clam pasta. Bless his soul, he said my clam pasta was better but I know he was trying to be nice.", "author": "Bianca V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-17", "description": "What a fantastic establishment! It was suggested to us by a family friend. They had described it with such enthusiasm that we decided to have our fathers day brunch there with our large party of 9 people. \n\nThe staff and the food quickly exceeded our already high expectations and enhanced our already special day! \n\nMy only regret is that my wife and I don't live closer!", "author": "Pierce M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-05", "description": "One of my favourite restaurants in BK. Fresh, seasonal ingredients and a beautifully engineered menu! \n\nI'm fearful that I could be downplaying it, but the honey pie dessert was FREAKING INCREDIBLE.", "author": "John M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-13", "description": "Pasta was great as well as the fried calamari. The tri tip steak came pre sliced which is unexpected and not ideal. Chef selection board was lame as well as the $13 single piece of toast with pate on it. Ambiance and drinks were great.", "author": "john s."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-11-10", "description": "I heard so much about this place and had such high hopes - maybe that was the problem. But I was very much let down for a few reasons: the service was very subpar for this area of Brooklyn (don't need to give me attitude, host! I'm simply just asking how long the wait is), the pasta didn't taste quite as fresh (and it was nearly flavorless - I got the cessoli or however it's spelled), and there are VERY very few vegetarian options! There's the pasta, and then the side dishes and cheeses are vegetarian, but that's really it. \n\nWe also started with some sweet potato and fig dish... which was pretty flavorful but wow those figs just tasted very out of place and did not mesh well with the rest of the dish.", "author": "Priti R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-11", "description": "Delicious food and a great atmosphere!\n\nThere is always a wait at Rucola, so go early\\ier than you plan on eating in order to get on the list. \n\nWe started with a selection of cheese, such a good choice! Then because we couldn't decide on entrees, we got three to share. The trout was by far my favorite and what I would get again next time (and there will be a next time) I eat at Rucola!", "author": "Samantha C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-12", "description": "We came in for a late dinner on a Friday night. The wait was about an hour however the hostess recommend a bar close by for a drink while we waited, she would call when they are ready for us.\nWell worth the wait. \nSalad and Charcuterie for starters and Pasta for main. Lovely service and fantastic food.", "author": "Cynthia B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-02-03", "description": "Really nice atmosphere and good service; however, the food was only OK. Ordered the rigatoni, which was burned and the sauce was really watery. The menu for brunch/lunch is really limited.", "author": "erica s."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-03", "description": "Ok how beautiful is this restaurant? It's like something out of a movie. This nondescript exterior tucked away in a barely trafficked corner (at least for me) and then you walk through the doors and it's gorgeous, romantic, cozy, and understated all at the same time.\n\nArrived early and waited for my friend at the bar. Got the Reiner cocktail, which was very refreshing and quite strong. Really like their extensive cocktail and wine list. \n\nI had the brisket dish and it was delicious. It was perfectly cooked and seasoned and was plated atop a yummy parsnip puree and topped with a Brussels sprouts salad. Huge portion too, I barely managed to finish it. My friend enjoyed her trout dish as well. \n\nService was also great throughout. The server was extremely attentive and didn't mind that we took a while to eat because we were busy catching up. I will definitely return.", "author": "Steph C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-05", "description": "Only great things to say about Rucola! Good for families around brunch time, though evening is definitely more for grownups. Romantic and intimate atmosphere, lovely for groups as well. The food is seriously delicious. It's in the little things... that unexpectedly outstanding smoked salmon... impeccable salad dressing (w/ pickled onions stealing the show on that one). Yum! Will be back very soon.", "author": "New Yorker N."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-01-03", "description": "I came for lunch with a friend. Cute cozy place. Super friendly server that was very knowledgeable about the items in the menu. Slim pickings for vegans! Salads can be had without cheese and meat but it was super chilly. I opted for the only other two items the side of cauliflower and the caponata appetizer. Both were great I got a good amount of bread with the caponata so it was a bit more filling as the portion itself was really not a lot. \nNot sure if I'll be back it's pretty sad there was not more that could be adjusted\nTwo glasses of Sangiovese wine plus the little side dishes came to over $40.00\nIt's not a fancy place. Hmmmmm", "author": "Felicitas O."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-01-25", "description": "I really wanted to like this place based on the glowing reviews by my fellow yelpers but I couldn't. 3 stars for the lovely decor and good neighborhood but-2 stars for the slow service and the food. My friend and I ordered two of the warm farros, pizza of the day, latte and coke. Everything but the farros was good and that's a shame because the farros were the main entree. The warm farro tasted bland and foreign, it was recommended by the server so we decided to give it a shot. Sadly it did not taste that good and it was $30 down the drain. Our server although very kind, was slow to attend us and we were constantly looking for her. I'll probably give Rucola another shot by coming for dinner time though.", "author": "Michelle S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-24", "description": "Seven of us stopped in a week ago for Sunday brunch. The cocktails were delicious but our server was distracted and had to be reminded to bring them to the table. The food was fresh, wholesome, and beautifully presented.  Their signature breakfast dish appeared to be the Dutch Baby pancake, topped with seasonal fruit and an awesome custard.  We shared a couple at the table - yum. I had the smoked salmon with a side of scrambled eggs which was an essential compliment, and the salad that came with the dish was very flavorful. Everyone thoroughly enjoyed their relaxing breakfast.  A big shout out to the chef and staff for a lovely time!", "author": "ScrapFe F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-01", "description": "Came here on a Wednesday night for a dinner of 6. Love the ambiance- romantic and not too cozy. It's actually on the bigger side for a Brooklyn neighborhood restaurant. Will definitely want to return with my girlfriend sometime.\n\nLike all the other reviews say, the cocktails are the bomb. I got the New Rider, which was the perfect blend of boozy and spicy. Tried my girlfriend's Negroni- very refreshing.\n\nAll the food was wonderful. We shared the chef's choice of meat/cheese/antipasto and it was all good- one of the cheeses was especially creamy and so yummy. The arugula salad was standard fare. \n\nMy girlfriend and I shared the fish stew special and squash campanelle. Both were delightful- the fish stew especially had the right amount of tomato, a little spice- and all the seafood were lovely morsels.\n\nHope to be back.", "author": "Bob K."}], "servesCuisine": "Italian", "priceRange": "$11-30", "name": "Rucola", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "190 Dean St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/ea87R47Kp_k95_fE7ginIA/ls.jpg", "@type": "Restaurant", "telephone": "+17185763209"}