{"aggregateRating": {"reviewCount": 458, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-06-20", "description": "We went 2 weeks ago. Granted, the restaurant is new and probably has some kinks to work out. But... service was sloppy and the food was mediocre. I got the roasted chicken and while the veggies were nice, the chicken was SUPER dry. Disappointing but not horrible. \n\nThe really unfortunate part of the meal was the part I was most excited for: the stuffed artichoke appetizer. It looked great when it arrived (25 minutes after we ordered it) but when we tasted it, we both made faces. It tasted... bad. Like spoiled. Not good. Gross, in fact. It didn't taste right. It was strange. \n\nMy boyfriend's meal was more normal - he got fish cheeks or something like that. His cocktail was good too. \n\nWe waited over 30 minutes between appetizer and main course. No wonder my chicken was dried out by the time it arrived! \n\nRucola is 3 blocks away from our apartment so I'm sure we'll try it again. But we're certainly not rushing out to eat there. \n\nSide note- we did see both Emily Mortimer and Michelle Williams there that night. Either Rucola is a hip little spot or everyone who lives in my neighborhood is just so thrilled to have another option for dinner that isn't Building on Bond or Jolie.", "author": "Alexandra F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-14", "description": "The slow roasted pork sandwich is crazy good.  The pickled green tomatoes and speck are perfect compliments to the pork.\n\nOh, and the salted honey pie from four and twenty blackbirds was incredible too, but you knew that already.", "author": "Zach L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-05", "description": "I think I am in love... I absolutely adore this place and would most def come back to try the rest of the menu. Tried the chef's selection (I know nothing special) but it was huge! There was 2 of us and it filled us up pretty good and we sort of regreted ordering another app + entree but it was worth stuffing ourselves full. Tried the veal speidini and it was delicious with the Rigatoni and parsnip side. My favorite would be the parsnip just because I loved parsnips... the Rigatoni was a bit too buttery but had a smooth texture that melted away in your mouth. Sadly did not get to try dessert as we were too full... I love the ceiling!", "author": "Aimee K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-06-28", "description": "Good: Excellent food (+ dessert), great prices, stellar and cheap cocktails, nice atmosphere.  What else can you ask for?\n\nBad: Well, service has often been very rude and snotty, enough to keep us from wanting to come back, even though everything else is aligned perfectly and we have fond memories of the cocktails \u0026 desserts in particularly.  Potentially being a super-hipster would keep them at bay, though, unfortunately it's not us.", "author": "Cabalistic A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-11-20", "description": "Brought a very famous artist here. They were very crowded, and good for them, but we were treated really rudely: although cheerful about waiting as long as it took, if we could just wait at the bar and have some wine and talk, we were hustled out after a glass, told that they needed a spot at the bar for diners, and generally treated as though we were undesirables, and possibly radioactive at that. And we were nice! Which is more than I can say for the resolutely unfriendly staff. So, i guess the food is good, but I will never find out voluntarily. Personally, I will always walk past, and go to the unpretentious, inexpensive and yummy restaurant \"building\" on the next block. When a restaurant in Brooklyn makes a restaurant in Paris seem like a warm and fuzzy experience in comparison, it's time to retrench.", "author": "Peri L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-02", "description": "Went here with a few friends last night. Everything was great. Our server was super friendly and attending to our needs. The food was delicious. I had the river trout and it blew my mind.", "author": "Peter B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-08-30", "description": "Went for brunch here. Out $15 plus tax and tip (cool $20) for coffee and a piece of toast with one poached egg, asparagus, and bacon on top. It tasted decent, but I think I've had appetizers with more food than that.\n\nDecor \u0026 atmosphere is nice and peaceful. I would go here for just coffee if the owners were cool with it, but brunch really isn't worth it. For $20, I'll go elsewhere.", "author": "Daniel E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-14", "description": "We had about 30  minutes to get in and out and they have no problem graciously and  quietly moving the courses through the time we had.\nThe pasta with shrimp, although small shrimp. had a delicious kick to it - the squash dish was perfect, adding green olives for a salty addition - the melon/proscuitto was very nice - bibb salad was fine - fried cauliflower with a hint of lemon was a scrumptious side!", "author": "Gail L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-10", "description": "Everything I ate from this place was like a piece of heaven. Must try it!", "author": "J D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-06-05", "description": "Service was very friendly, that's for sure.  The arugula salad was great but had a bit too much salt.  The artichoke was OK.  I had the rigatoncini which was really delicious but the portion was way too small.  My husband had the roasted chicken.  It was just OK.  We left paying $65 and with hungry stomachs.  UGH.  \n\nThe inside was way too loud.  Noise bouncing off the walls and ceilings. Too bad they didn't hire a good architect to take care of that when they were building the restaurant.", "author": "Peggy O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-09", "description": "I visited Rucola last week for dinner. It's definitely the kind of place where you can expect a long wait, but we happened to walk in an hour early for our reservation and a table was opening up. Sweet!\n\nWe ordered the chef's selection of antipasta, crudo, and the roasted chicken entree and drinks. Both the antipasta sampler and the crudo were amazing. The chicken was incredibly tender and meshed well with the sauteed spinach and celeriac potatoes. \n\nIn short, dinner was exceptional. It's well worth the wait, even if there is a line when you drop on by.", "author": "Sarah L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-09-14", "description": "The server took a while to seat us- there is no clear arrangement of who one should ask to be seated. Though some servers saw us waiting at the entrance, they took a while to seat us-even though seats were available. They were impatient when taking our order (even though we already knew what we wanted, they neglected to tell us at the start that they were out of one of the items) and we had to ask twice for the check.\n\nThe food came out fast and tasted fine, but nothing out of this world.", "author": "Nayantara P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-07-23", "description": "Worst brunch service in quite a while.  My friend and I both ordered a simple eggs/toast/potatoes dish without meat.  The waiter and waitress (yes-two!) happily suggested to replace the meat with arugula.  YES!!!  Except both dishes arrived with meat somehow woven over the potatoes, through the toast, and under the eggs.  My companion was ok with them just removing the meat, I asked politely for them to make a new dish for me.  I waited FOREVER (longer than the wait for the original dish, and the place was not crowded) for the correct dish to arrive.  Not once did my original waiter duo come over and notice the problem - my friend was finished and I did not have anything to eat.  The corrected dish had fresh eggs, but the potatoes were cold.  \n\nWhile I ate and my friend waited for me to finish, another waiter offered a refill on his decaf coffee.  But then came back to explain that since it's decaf americano, there are no refills.  How about giving him a free refill for screwing up both of our orders? \n\nWhen the bill came, nothing was comped.  My sour face led the original waiter to come over and genuinely ask what was wrong.  I politely explained to him since he didn't have any idea, and I suggested that my $3.75 cappuccino be comped.  He later returned with an amended bill that had a total credit of $2.24 for me and my friend to share.  Slap in the face.  Paid cash and left.  \n\nI understand mistakes happen in the kitchen, but this was handled so poorly.  I want to like this place; the decor is lovely, but the attitude says \"go elsewhere.\"", "author": "Shea D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-26", "description": "There is nothing more exciting in my book than finding the perfect restaurant half a block from your apartment - and lucky us, Rucola is right on the corner! I have been anxiously watching as the restaurant came into being and waited for the perfect night to try it out. We went on a Friday night and it was super packed. No problem, the super nice guy who greeted us took our name and cell number and called us when our table was ready - perfect! \n\nFirst bit of excitement was the intriguing cocktail list - rye with sage? Yes please! We tried 4 different cocktails and all were really unique and tasty. \n\nFor apps we had the stuffed artichoke and asparagus with shredded egg. Enjoyed both a lot, but not as much as our mains - soft shell crab with pancetta and peas and a delightful lamb special with fresh greens. All was very flavorful, seasonal and fresh! \n\nIf it couldn't get better... Then there was dessert: some of the best tiramisu I have ever had. A very generous slice with great flavor and not overly sweet! \n\nThe service was really friendly even though they were very busy. The only negative is the space is a bit small for how popular Rucola already is proving to be!", "author": "Rebecca L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-21", "description": "I went here for my birthday dinner last week and I was really blown away. I heard great things about this restaurant and it exceeded my expectations. The atmosphere is lovely and the food was outstanding. I really enjoyed the fusilli (the homemade pasta is amazing)and the Dorade was really tender and creatively prepared. Best of all was the exceptional customer service. We were given free Prosecco because my partner let the waiter know it was my birthday and they didn't charge us for our dessert - a divine dark chocolate pudding. Thanks for making my birthday so delicious!", "author": "Miz Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-05", "description": "Amazing food in a super-cute, romantic spot in Boerum Hill. Everything we had was amazing, and the service could not be more friendly. I've heard it can get a bit crowded, but it's a perfect brunch or dinner spot with a date or small group of friends.", "author": "Adrienne C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-12", "description": "4 friends and I had a wonderful dinner!  Got there early, so there wasn't a wait.  We'll definitely be back!  We shared the following dishes:\n\nFresh Focacia Bread with olive oil (delicious)\n\nAppetizers:\nCured Meat \u0026 Cheese Plate - tasty!\nFrisse \u0026 Charred Fava Bean Salad - totally unique and fun\n\nEntrees:\nPasta w/ Gorgonzola \u0026 Kale x2 (it was too delicious to eat only once!)\nVeal w/ Ramps (out of this world!)\n\nCookie Plate \n\nService:\nOne of the owners, Julian, was working the door.  He was friendly, funny and fast, as was our server Keith.  Another server (though I don't remember her name) was also the baker.  She was just as charming as the rest, and snuck us a few extra cookies as well!\n\nWhile the menu was limited, I got the clear impression that it will change with the season.  Hello... ramps are only around for like two weeks!  If there were any first week hick-ups, they have been resolved perfectly.\n\nMy suggestion: head to Rucola for dinner tonight!  It's an excellent addition to the neighborhood.", "author": "Jed C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-03", "description": "So I wanted Italian in the area and found this quaint little place at the corner of Bond and Dean...reminded me of Seersucker on Smith when I went in. Was early so I sat at the bar...bar stool was uncomfortable but oh well. Hooks underneath the bar for bags and coats. Seems like a neighborhood bar, the guy beside me was talking to staff and diners alike who all lived around the area!\n\nFriend came, we were sat promptly...host made sure to check in with us even though we had to wait 15 mins or so. I had that ear-shaped pasta with salt cod and broccoli rabe...LOVED it. I polished it off...was about to lick my plate. The broccoli rabe was amazing...not bitter at all. The salt cod was..interesting, wasn't too salty or overwhelming. Only complaint: TOO LITTLE (well, I am greedy so...) My gf had the baked pasta with cheese...same thing, amazingness in too little a portion. Prices were decent for the quality of food I must say...I wish there was more though!\n\nI cannot wait to come back again!!!! :)\n\nTip-bits:\n\nCash only...for now\nGets busy so come early and wait at the bar\nSingle unisex bathroom to the R in the back, by the kitchen\n3 draft beers only for now\nGood for couples/dates/small groups\nGet loud when busy\nCouple of outdoor tables", "author": "Florence Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-27", "description": "gorgeous neighborhood spot, love the look of this place and will definitely be trying to recreate some of the cocktails at home. Friendly staff, comfy corner table, yummy food (especially the squash pasta) will definitely be back.", "author": "Alicia B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-28", "description": "You can't go wrong here. Split as many dishes as possible with friends. And for dessert - four and twenty blackbirds pie!", "author": "J C."}], "servesCuisine": "Italian", "priceRange": "$11-30", "name": "Rucola", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "190 Dean St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/ea87R47Kp_k95_fE7ginIA/ls.jpg", "@type": "Restaurant", "telephone": "+17185763209"}