{"aggregateRating": {"reviewCount": 458, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-17", "description": "This place is a great neighborhood spot - good food and a warm atmosphere.", "author": "Laura W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-05", "description": "this place is perfect and we ordered half the menu so i'm fairly certain that nothing will disappoint.  Terrific service that will make you feel at home and insanely good food.", "author": "Luu H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-02", "description": "Small menu but it was still hard to make a decision based on the delicious-sounding options. Great wine selection and cozy ambience. Highly recommend the beet salad, roasted cauliflower, and roasted chicken. It was perfect for a chilly, rainy night.", "author": "Allison B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-30", "description": "Loved this place!\n\nWe were not disapointed by the ratings here. Very cozy place with delicious food. We ordered some wine and fish, which was well made and had some sensational taste! I also enjoyed the free bread and olive oil with sea salt in it, they give you to each meal. Tasted really nice.\n\nthe good thing is they also serve quite late. we went there on a weeknight at 11pm.", "author": "AL V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-28", "description": "Rucola is amazing! I had my birthday there awhile ago and it was great! The staff is sooo incredibly friendly and the food is amazing. I usually get the grilled octopus and a piedmont fizz. Great!", "author": "Jasmine G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-02", "description": "MMMM I am still thinking about that roasted chicken! I loved this place. Super chill and good atmosphere. Good service and delicious cocktails. i would definitely recommend this place to anyone looking for the best food in the hood.", "author": "Brigid S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-25", "description": "Wow, best food yet in NYC.  Thanks for the recommendation, Frederick.  Cocktails are unique.  Each entree (only four on the menu) was great.  The service was impeccable.  Try it.", "author": "Rick D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-18", "description": "Very nice experience. Went there for brunch. Had eggs over cheese risotto. Definitely interesting. Would go back and try their dinner menu, definitely. Very nice and cozy setting. Feels like home.", "author": "Aissatou Marie B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-08-22", "description": "The brunch I had here was just OK. I ordered the french toast and the bacon (which they needlessly referred to as \"pancetta\" on their menu), and was still very hungry afterwards - the french toast was delicious, but it was literally only 1 1/2 slices of bread. They took two slices of bread, cut them both in half, and then threw out one of the halves. Why not just make two full slices? It certainly cost enough...", "author": "Patrick Q."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-03", "description": "Came here with the Gentleman just days after their opening - and while they were clearly still figuring out some things - nothing was terribly amiss for us when we were there, which bodes well given they are so new. \n\nWe went around 7:30 on a Saturday and it was bustling but we were still seated quickly.  Love the super cozy, rustic wood-and-brick space - what a great addition to the neighborhood.  We ordered a few glasses of wine, and enjoyed them both. We also got an arugula salad and the risotto.  The salad was excellent and fresh and the risotto was very good, if a bit on the salty side. \n\nI'm looking forward to a more expanded menu! Prices were really decent.  Cash only for now but highly recommended.", "author": "O R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-20", "description": "- adorable cozy little spot nestled in a cute residential block. we went on a tuesday night and got a spot at the bar right away.\n\n- really good food. the menu was simple, which i love. i always feel like when places have too many options, there's just no way that they can perfect all of them. i had the trout which was cooked and seasoned perfectly and was a surprisingly large portion. the brussels sprouts are also a must try and the chocolate pudding was amazing.\n\n- and delicious cocktails and wine - love that they have a 2-glass sized carafe option for wine! \n\n- wtf is up with the bartender? normally i would probably rate a place lower based on service like this, but it was almost entertaining? i'm fairly sure this guy was actually a professional actor studying for a role in an upcoming movie where he has to play a distressed bartender, down on his luck, who just discovered the promising investment he had put every last penny into was just a scheme and his girlfriend is cheating on him. while i know he saw us, he didn't acknowledge us for the first few minutes and would answer our questions in either 1 or 0 word responses. neat. then after managing to get all the way through the meal without communicating, he decides at the very end to buy us 1 shot of some liqueur to go with our dessert because \"it just goes so great with the pudding - you have to try them together!!\" oh. so you don't hate us? i'm so confused...", "author": "Kristen A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-28", "description": "Had a great dinner here. Appetizers/mains were excellent, the dessert sure hit a spot. Good atmosphere, our server and the host was great and very good about the wait time/list.  Between the 4 of us we ordered the trout, skate, pork loin \u0026 chicken. All amazing. Desserts we got the blueberry almond cake (my fav), choc cream \u0026 apple pie - all done really well. I don't live in the neighborhood but I'm definitely coming back.", "author": "Tasteful O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-10-13", "description": "Service is even better than the food and the food is fantastic.  Crudo, Brussel Sprouts and Rigatoni are exceptional..  Good cocktails and wine list.  As good as it gets in Brooklyn.", "author": "Adam F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-17", "description": "Perfect in every way! Beautiful residential location. Cute decor. Friendly and efficient service. Ridiculously reasonable prices. And oh, the food...! I went with a group of 6. I had the roasted carrots. Delicious and different. Several of us had the risotto special...red wine, sausage and treviso raddicchio. One of the most delicious and perfectly prepared risotti i've ever had. We were all swooning. Every bite had a slightly different flavor...lemon, thyme, fennel, sausage, etc...We all tasted each other's dishes and all were superb. Servings seemed a bit small, but we were full by the end of dessert...which was also delicious. A black-bottom oat pie...oh, alright, I confess...I had 2 desserts...shared the chocolate pudding with olive oil and salt. Very different and delicious. This might be my new favorite place. Can't wait to return!", "author": "Lawrence R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-06", "description": "I came in for a great lunch on a sunny day. We were seated right away since it was ~1 pm a weekday and not to busy. Delicious well cooked food with perfect portion sizes.  The carrots on their lentil salad tasted exactly like roasted garlic, genius. Decent cocktails but not very strong, I guess it was a little early....", "author": "Nick W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-08", "description": "I've been wanting to try Rucola for awhile and when we called and they said there was no wait, we finally went for it. We ate on al fresco and the whole thing was pretty damn nice. We started with the roasted carrot salad (pretty incredible) and the chicken liver/foie gras (suck it California). I had the petite filet and my girlfriend had the spaghetti. One of the few times that my girlfriend ordered better than I did. Overall this is a great restaurant but I highly recommend getting there around 6:30 just to make sure you get a table. Saturday nights are busy (really busy) so get there early and enjoy...", "author": "Matt D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-30", "description": "Favorite dinner spot in Boerum Hill. The go-to spot in the neighborhood to take out of town guests as the menu seem to have something for everyone. Can get a bit crowded and loud, but if you're lucky enough to go on a quiet night you're in for a treat.", "author": "Matt P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-14", "description": "Solid joint. Good vibes. A bit pricy at lunchtime though.", "author": "Howard R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-05", "description": "Went on a Tuesday night last minute dinner around 9:15pm. Was able to get a reservation for that time. The place was packed, small and the seats were crammed together. But, we didn't care!! I loved it!! It all just worked along with the noise, good service and delicious food. Definitely trying this spot again.", "author": "K K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-27", "description": "This truly romantic spot has delicious food and good cocktails.  I ordered an after dinner bandy and when our waitress brought it out, she also brough a taste of another that she recommended as well.  I'm not a huge fan of the communal table in the middle. Our service was great, though others around us seemed to have a few complaints.  Overall very good.", "author": "Carla C."}], "servesCuisine": "Italian", "priceRange": "$11-30", "name": "Rucola", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "190 Dean St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/ea87R47Kp_k95_fE7ginIA/ls.jpg", "@type": "Restaurant", "telephone": "+17185763209"}