{"aggregateRating": {"reviewCount": 458, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-08", "description": "A friend invited me out for dinner and this was our first time there. He lives in the area and it was a great find! We'll definitely be going back. \n\nTop portion of the menu:\n\nThe La Tur, Finocchiona, and Pickled Fennel were TO DIE FOR. \n\nSalads:\n\nMy friend had the Arugula salad and I tasted some. It had a tangy, yet tasty celery seed vinaigrette and was delicious. \n\nAppetizers:\n\nRoasted Cauliflower and the Crudo! We did not have these ourselves, but were tempted, as the couple next to us raved about these two appetizer items. \n\nHouse-made pastas:\n\nThe Rigatoni was perfect! You won't go wrong.", "author": "Stacy H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-26", "description": "Nice place!  On a hot and humid summer day, they have a nice environment inside - the AC blowing but not super cold.\n\nWe had a starter-cocktail, which ultimately I didn't drink since I didn't like the whiskey-base; I switched to nice Italian red by the glass, which was nice.\n\nI thought the carrots were not great.  I like the base/sauce under them, which has a nice lemon-and-spice flavor.  I had a chicken, and Stacey had the trout.  We each liked our main course.  I didn't think the polenta was nice, but we let it get to warm (not hot) before eating it.\n\nThe dessert was great, if over-the-top sweet.  My cappuchino was very tasty!\n\nIt was about $180 including food, drinks and tip.", "author": "Liam R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-21", "description": "A pretty solid four. Everything is very good, with no risk of not being that way, and it's very comfortable food in a friendly, familiar atmosphere. \n\nNothing much to complain about here -- highly recommended.", "author": "Joe S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-30", "description": "Went to this cute restaurant on a Monday night.  Service was excellent and the ambiance in the place is terrific!  Gives off a cozy atmosphere, although it was somehow so loud we had to shout to the person a foot away.  This died down by about 9pm.  Would definitely come back, would not come for a date with someone I wanted to get to know more!", "author": "Belle Z."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-21", "description": "My beau and I had tried to get into Rucola on Valentine's Day this year. Ha! As if. \n\nWe tried again, and had better luck, on another weekend. Feeling a little indulgent, we settled into our seats at the communal farm table with the well-rounded wine list. A bottle of Sangiovese, fresh bread and some appetizers were the perfect way to start the meal. The roasted beets were delicious, and the fried Brussels sprouts were to die for. On my way out later I noticed that they do call-ahead orders for pick up, and I might just have to start working fried Brussels sprouts (to go) into my weekly grocery list. \n\nI got the pasta w/tomatoes and eggplant, and it was great. Perfect size to make me feel satiated, not completely stuffed. He got the roast chicken and polished off the entire plate as well, although commented later on that it was a bit salty. All in all, a great meal in a nice atmosphere. Our server was very friendly and helpful as we were placing our orders, but after we'd gotten our main course we noticed that she didn't come over until we were finished to ask how the food was. I'm sure if we had been noticeably unhappy she would have stopped by sooner, but it would have been nice for a stop-over regardless.", "author": "Cynthia C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-17", "description": "Came in last night with a group at 11pm just for dessert and wasn't disappointed. Awesome chocolate pudding and great pie!!! Can't wait to come back for dinner. Super cute atmosphere. Great 90s hip hop jams. Friendly service. The place was still nearly packed at 11pm on a Saturday, which is always a good sign.", "author": "Missy S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-04", "description": "My wife and I, upon a friends recommendation, suggested this place for our 10th Wedding Anniversary. Having not lived in NY for a decade we were so out of the loop in terms of the BoCoCa food scene any suggestions were welcome.\n\nWe were not disappointed at all. I had open tabled a nearby restaurant but figured I would give them a call to see how it was looking for a Saturday night at 7.  As soon as I mentioned our special occasion the kind gentleman on the other end didn't flinch for a second and welcomed me with open arms and a solid guarantee that he would be able to seat us.  \n\nIt was one of the best meals my wife and I have had in a long time and were so happy to dine at this excellent restaurant. It reminded us a lot of Peasant on Elizabeth Street one of our favorites and similar in cuisine and atmosphere.\n\nThanks man with glasses and a hat and your warm disposition and attentive staff! We walked over to Brooklyn Social for a night cap and vowed to be back to Rucola in the near future!", "author": "Michael J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-18", "description": "Went for brunch, a really nice atmosphere and good value. I wouldn't make a trip out there just for that but would definitely go back if in the area. Would like to try dinner.", "author": "Natalie M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-08-18", "description": "Used to be one of my all time favorite restaurants-- great ambiance, romantic, on a beautiful block. Went back tonight for the first time in awhile and had a pretty disappointing experience. Our waiter was strangely rude, and the lobster risotto special was one of the worst dishes I've ever ordered in a restaurant. It was literally drowning in butter, seemed like a butter soup, and the \"lobster\" was indistinguishable from the mushrooms. It must have been either canned or imitation lobster-- not what you'd expect from a restaurant like this.", "author": "Ella b."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-21", "description": "I have been to Rucola twice - once for dinner and again for brunch. The food is great and the overall feel of the dining room is just a nice experience. They have a great negroni.", "author": "Ryan L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-01-03", "description": "We came in from out of town for NYE and were directed to Rucola by a friend. It was a great suggestion! The atmosphere was fantastic for a date, a tiny, trendy, hole in the wall in a lovely part of Brooklyn.\n\nI hope to eat here again without a pre fixe menu (I'm sure this was a NYE only occurrence). The food was prepared to perfection, but I would have liked to see the chef's creativity more clearly in a full menu.\n\nWe did leave a little hungry! At the risk of sounding cheap, I think Rucola would do well to increase the portions slightly for a $95 price tag. It just isn't the type of place that can pull off a single ravioli and an ounce of short rib for \"dinner\". Maybe it's the neighborhood...", "author": "Abby B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-02-07", "description": "Really cute, intimate place, and maybe the dinner menu is better, but brunch is supremely disappointing. Ordered the heirloom beans (with sausage, escarole, and an over easy egg) and was shocked to see a handful of beans, 3 pieces of wet escarole, and a single sausage on my plate. For the price, it's not worth it. I've also had their sandwiches, which are better, but if you want a great sandwich just go to court street grocers instead. \n\nService is ok, but the servers never seem pleased to be there. Not sure why this place is so popular other than the fact that the decor is cute and it seems like hipster celebrities come here.", "author": "Hannah S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-04", "description": "Limited menu and small portions but I give this place a 5 stars for the quality of the food and the kindness of the staff. Great ambiance", "author": "Matteo T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-16", "description": "I will admit that after the mixed reviews I was a little dubious, and I almost didn't order the roast-pork sandwich because I was so afraid that it would be a repeat of the disappointing sandwich at the White Dog in Philly.  But oh, I am so glad I did.\n\nThe bread is crusty and substantial.  The slices of pork are thick and savory (but there is actually only a comfortably modest amount of meat on the sandwich).  The pickled tomatoes and hot peppers were actually plentiful and flavorful and made the sandwich.  The bit of cheese brought it all together.  The rest of the service, etc. was perfectly pleasant and adequate, but this is the best sandwich I can remember having in a VERY long time.", "author": "William B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-02", "description": "Get the Bucatini! One of the best pasta dishes I have ever had. We sat at the bar and ate, which I think is the only reason its not a 5* review, the bartender was a bit annoyed with us for some reason? Or maybe he was just annoyed with life that night. Who knows. TRY THE BUCATINI.", "author": "Dee L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-04", "description": "Pretty big fan. Can only speak to brunch though. The bacon i had the other day was quite possibly the finest I've ever had. \n\nNearby, not terribly expensive, nice to kids.\nSmall though, so call ahead or something, because it fills up quickly.", "author": "P M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-04", "description": "Lovely spot for a lunchtime glass of wine and bite to eat, would love to check it out in the evening. Service was excellent - barista and server were very engaging without being pushy. I had a salad which was very nice for the first few mouthfuls, but became somewhat bland rather quickly. A little pricey, though they have a lunchtime pizza slice offer that seemed droolsome. Definitely both vegetarian- and carnivore-friendly.", "author": "Sadhbh O."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-05-10", "description": "Went for brunch 5/10. It was pretty busy.\n\nService was lacking. Hostess was quite flippant about our need for a hi-chair: \"Like I said, it's right back there and your server will be right with you to get it for you.\" Wrong answer, Missy. Awful customer service. Just get the hi-chair and make your customer happy.\n\nAlso, 20 minutes for a hot chocolate with no apologies. \n\nFood was bland (eggplant sandwich and roasted asparagus with poached egg) and it took about 30 minutes for it to arrive. \n\nThis place used to be a go-to for weekend brunch. Never again.", "author": "Jay K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-11", "description": "Went here for a birthday dinner and had a marvelous time! Love that they take reservations! Enjoyed the wine immensely, and the food was really good too :) would definitely come back!", "author": "Hannah D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-28", "description": "Food was outstanding, had the sausage rigatoni with crispy polenta. Started with the chef's selection of veggies, meats and cheeses which was also great, the pickled onion was a surprise hit. They also had a reasonably large by the glass wine list and the wait staff seemed to be very knowledgable of everything on there, asked for a couple of recommendations which didn't disappoint! \n\nOnly criticism is that the service was a little slow but we also weren't ready to order at first so they may have assumed that we wanted to take our time (it was early evening on a Sunday after all).", "author": "Devin M."}], "servesCuisine": "Italian", "priceRange": "$11-30", "name": "Rucola", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "190 Dean St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/ea87R47Kp_k95_fE7ginIA/ls.jpg", "@type": "Restaurant", "telephone": "+17185763209"}