{"aggregateRating": {"reviewCount": 458, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-13", "description": "Casual, cozy restaurant with a great bar. Enjoyed eating our meal at the bar. \nBartender was efficient and friendly and made us several terrific cocktails. \nThe dinner was very good- I had an excellent grilled trout and my wife had perfectly done chicken.  \n\nFor whatever reason we had the impression going in that Rucola was an Italian restaurant- the name threw us I guess.  But they seemed to be majoring in New American, with a minor in Italian.. never the less, we enjoyed it very much and would recommend.", "author": "E P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-09-17", "description": "Came here Thursday night with the lady for dinner.\n\nGetting in:\n- They don't take resos, we walked in around 8:30 and they had a spot for 2 at the large center table\n\nAtmosphere:\n- 2 tables out side and then a number inside\n- Large center common table\n- Bar on the side with seating - probably the place to sit\n- Great vibe to it, reminds me of the James in a way\n- However, this place is EXTREMELY loud.  Painfully loud.\n- Tight seating - reminds me of a Manhattan resto (e.g., Bianca's)\n\nService:\n- Service was great\n- Prompt and polite and non-intrusive\n\nFood:\n- Veg courses were very good (got fried cauliflower, eggplant caponata and the roasted beets), although a little heavy on the oil\n- the Rigatoni pasta dish was fantastic.  Really liked it.  tastey - but expensive for such a small portion\n- Lamb was very funky - supposed to be leg of lamb, it came out not on the bone and looked like a piece of steak.  The meat tasted like they used the same pan to sear the lamb as they did to sear some fish.  The veg that came along with it were over roasted, bordering on mushy. This was a disappointment.  Size was small and quite expensive for what it was\n\nDrinks:\n- They made a nice aperol spritz\n- Reasonably priced wine\n\nOther:\n- I really wanted to like this place more and the lamb dish really failed here\n- Portions are small and prices are high\n- I likely will not come back here for dinner, but would like to try brunch", "author": "Matt B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-25", "description": "I live nearby and come here mainly mornings and afternoons, when Rucola is at its best.  It's a beautiful space and although sometimes packed, I generally have not had too much trouble getting a table or good service. Some of the food is delicious (their pork sandwich in particular)  and most of it is pretty good. I would love to see them change up the menu more often, but you can't go wrong with this place as a great neighborhood restaurant.", "author": "Neil M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-29", "description": "The wait can be a drag so get a group of 5 and make a reservation. This place is yummy \u0026 cozy! The slow roasted pork sandwich for brunch is out of control yummy. Did someone say pickled green tomatoes?", "author": "Veronica A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-13", "description": "A solid choice, fresh and local, friendly staff, pretty quick service. I find it a bit surprising that the menu basically hasn't changed in about a year--I like a little more variety. The orange-something fancy soda tastes aspartamey, and they watered it down with a ton of ice despite my asking for none, s it didn't even taste carbonated. Still, the roast chicken is delicious, and my mom liked her fish. The pasta is a skip, in my opinion. The waitress told my dad the squash pasta was pretty light, but the sauce turned out to be just the opposite, and he wasn't thrilled. The place is wildly loud. They don't do reservations, but you can do same-day call-aheads. Overall, I like rucola, but wouldn't go back too often.", "author": "Mira S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-23", "description": "I came here for brunch and it was very pleasant. The food was good and the outside seating was beautiful. I can't wait to come back for dinner.", "author": "Scott W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-10-04", "description": "The first time I got here, my dining companions and I all decided that they needed to get their Front of House act together.  The second time I came here, my boyfriend and I had a 45 minute wait and then were squeezed like sardines into the long middle table.  The third time I came here, we came right when they opened, as our friends brought their baby girl.\n\nThird time is the charm.  Although, since we got there right when they opened there weren't many other diners for the waitstaff to service.\n\nOverall, the food is good. Pastas are yummy in particular.  And they have a solid duck dish.  In the three times I went, over a span of the summer, their menu didn't change, which was disappointing, especially as their website had said their menu changed weekly.  \n\nHowever, the clientele, in my opinion, isn't of your Boerum Hill muster.  (Do I sniff a Manhattanite?).  Everyone just seemed really bougie for no reason.  But, I've been there three times so what does that say about me?\n\nAlso, I think they're trying to cram too may people in the restaurant at dinner.  It's WAY too loud and very cramped when you need to get up.\n\nEvery time I come here, I tell myself I shouldn't bother with coming again.  Who knows if I will make a fourth?", "author": "Jordan S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-10-11", "description": "My wife and I live half a block and spotted this place when they were working on it!\nTo tell the truth our first visit wasn't totally satisfying. The staff was super friendly, but the food... But from our second visit this place has definitely became our favorite restaurant in the area! not only the waitress remembered our names (I was stunned! and I'm sorry I can't recall hers...) but the food improved so dramatically. My wife loves the sea bass, and I can't resist the duck breast, whichever way they decide to present it! Very cozy, great for dating your loved one. \nCheck out the bomboloni in the breakfast hours too!", "author": "Luca A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-10-27", "description": "Great food, stumbled on it by chance as walking on Bond St.\nNice decor and very welcoming space, lots of character.\nTried their pasta and highly recommended it, also their bread.\n\nht i was sold on was the decor, ambiance, and great service.", "author": "Fabian R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-20", "description": "Just went here on the recommendation of a nearby store clerk. We both got the slow roasted pork sandwich, which is served with delicious olives on the side. It was perfect. The atmosphere is relaxed and there was so wait at 1pm on a Saturday. Would love to come back here to try dinner.", "author": "Rebecca M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-06-22", "description": "I do not live in the neighborhood. Drove to Brooklyn specifically to have dinner at this place. They do not take reservations. I was rejected at the door because they were closed for a wedding. There was no indication on the website that something like that was probable. I will not go back.", "author": "Senad R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-07", "description": "The food and service here is out of control good.  I have had the experience 2 previous times in my life where I woke up the next morning still blushing over how good the food was the night before and this was my third.  We feasted! Everything was spot on...chicken, trout, arugula salad, olives, chocolate pudding, and carmel dessert. The absolute standouts were the brussels sprouts, short rib, and rigatoni.  Thank you for such a great experience.", "author": "Ciara G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-03", "description": "Very very happy. Ordered seemingly boring rigatoni but it was SO good that I can't figure out how they did it with maybe 5 ingredients. Fantastic. The fact that a waitress interrupted me ordering a pear-and-whiskey crumble to be sure that I knew it was not a parrot-whiskey crumble made me laugh so hard I was crying. Easy choice to eat here.", "author": "Jim R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-14", "description": "Rucola is, above all, an attractive restaurant..  All brick, and wrought iron, panels and Brooklyn.  \n\nDespite that, the food is good too; pretty well priced (very few dishes broke $20) and tasty (I loved that my papardelle with stewed lamb was so understated - just a few chunks of meat, and pasta sauced very lightly with broth and a little tomato).  Dessert was another high point; our rhubarb crumble was very good, although a little too much crumble and not enough rhubarb, while the chocolate pudding with sea salt was, according to my friend, the best he'd ever had. Certainly, we preferred Rucola to Brucie, which it reminds me a lot of. \n\nHaving said all that, I found the appetizer plate we started with to be almost entirely a waste of space, other than some excellent olives and pickled fennel.  So maybe next time I'll just stick to the pasta.  In any event, a worthy addition to the neighborhood, which I suppose I'm now supposed to call BoCoCa. \n\n\nBe warned; the restaurant is very loud indeed.  I found myself screaming most of the night.", "author": "Raffi M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-13", "description": "Really nice, homemade food; all five people at our table loved their dishes. Service was excellent, extremely accommodating. Very cozy, perfect place especially for groups!", "author": "M G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-14", "description": "Her are the components that made me give this 5 stars.\n1. Really fabulous service\n2. Adorable decor\n3. Wonderful prices that were very reasonable\n4. Fabulous food...details shortly\n5. Good music/air temperature\n\nWe had the stuffed artichoke. Which was delicious, though slightly messy. We also had the beets(more 3-4 stars), the beans(5 stars) and the Chicken entree(also 5 stars). The chicken was both moist on the inside and crispy on the outside. The onions served with it were especially tasty.", "author": "Jenn S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-02", "description": "Let me keep this short and sweet. Being in the service industry myself I know how annoying customers can be. I showed up with my sister a few minutes before lunch closed and we couldn't find a restaurant anywhere for an hour. The gracious staff here took our lunch order despite the time and were super friendly!!! They made me want to be a better server / bartender just by the excellent customer service they provided. I hated to be that customer coming in when the kitchen closes but they assured we were no bother !! Amazing food as well good god!!!! Thank you so much!!!!", "author": "Theresa A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-11-07", "description": "We arrived here one morning mid-week for breakfast.\nWhen my eggs and Broccoli Rabe scramble was put down in front of me, it was embarrassing...the portion was so small...think the size of a deck of cards and two scrimpy bits of crusty bread...$9...I can hear the defense....free range eggs, organic broco rabe....come on, let's get over the small portions in NYC...WE WANT FOOD FOR THE PRICE..we are busy, we burn energy, we do a lot here, WE ARE HUNGRY!.\nI don't know about anyone else but, I go out to eat to get fed...this was at best a sampler of an appetizer.\nI won't go back here and will not put Rucola on the list for the hundreds of airbnb guests I host a few blocks away.\nWe returned home and made breakfast - free range eggs and organic broccoli Rabe.\nNot - worth - it - at - all.\nDon't waste your time.", "author": "Sue b."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-28", "description": "Rucola, which mean rocket in italian and is that delicious bitter green leaf used for salads, is pretty amazing.\n\nEverything from their iron-clad entrance to all the wood-accented decor--communal tables, vintage delivery boxes, wooden ceiling.\n\nJ and I decided to join them for brunch this past Sunday and we were not disappointed in any respect of the word.  \n\nWe we so surprised how empty and open the place was on a Saturday afternoon around 1:30ish. For a hot new spot, it is still on the DL (so don't tell anyone!).\n\nThey are still ironing some kinks. Our coffees took a while to arrive and when they did, the coffees were not made with soy. The waitress apologetically brought us a new one and put it on the house (that was completely unnecessary but awesome).\n\nWe ordered the brussel sprout salad with a poached egg and a mortadella/speck sandwich. The sandwich was heavenly. Sesame toasted roll with mortadella, fried egg, and speck. GD!\n\nThe salad on the other hand had an overcooked poached egg and was switched off immediately. \n\nI really like this place and think it is special, but they do need to iron those first year kinks.", "author": "Ishmael V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-13", "description": "Cozy, charming and good food.\n\nWas w/a group that shared a bunch o'stuff. Had the charcuterie platter, fennel salad, brussel sprouts, white beans to start.\n\nThe pork dish I had with some kind of sauerkraut and horseradish cream was excellent. Everyone else enjoy their pastas (white bolognese rigatoni I tried was nice too) and other mains.\n\nService was fine, but a bit slow. If you are with a group of friends chatting, you won't care.\n\nOrder the chocolate pudding w/olive oil, sea salt and whipped cream for dessert. Sleeper hit if there ever was one. Surprised how good it was.\n\nSolid meal.", "author": "Brigita J."}], "servesCuisine": "Italian", "priceRange": "$11-30", "name": "Rucola", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "190 Dean St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/ea87R47Kp_k95_fE7ginIA/ls.jpg", "@type": "Restaurant", "telephone": "+17185763209"}