{"aggregateRating": {"reviewCount": 704, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-08-22", "description": "As others have mentioned, this place does have a similar vibe to Xi'an Famous Foods... a younger, slightly more hip version. However, when it comes to food quality this place falls a bit short. It's definitely more of a fast food type place, especially with the food trays and plastic bowls. The food is just ok. If you're looking for a quick fix in the area and aren't expecting much, then this place would do!", "author": "Mei Mei L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-24", "description": "It was good, very fast, hot, and yummy. The only thing I disliked that it was cold, everytime the door opened, cold wind would make us shiver. Not their fault, though ;)", "author": "Ida K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-27", "description": "Went to lunch with a co worker and had the ribs and fried rice. Food was great and was prepared fast.", "author": "Tyshia A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-08-29", "description": "I don't understand the 5 star rating here- I mean, it's fine. But it's like fine for a neighborhood where there are literally no other options for soup dumplings. Prices are high, portions are small and quality is mediocre. It's not terrible, but I wouldn't go out of my way for this place again.", "author": "Aisha K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-15", "description": "Friendly service! The menu is unique to the neighborhood too which is appreciated. I especially love their shanghai cold noodles and veggie dumplings. Sometimes the wait line can get crazy but it's all good.", "author": "Melissa C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-26", "description": "Tasty, satisfying noodle soup. I tried the spicy pork soup, and I wasn't disappointed. I also had the sauerkraut spring rolls and was surprised at how well the flavors worked together. This spot has a full range of Bruce Cost ginger ales, which I love. I spent $17 for all three; not bad for a full meal in the area but more than average for Asian street food.", "author": "Carmen W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-15", "description": "Some great baos. Expect to spend 15 - 20 bucks for a meal, a side of baos and a very tasty organic ginger ale.", "author": "Kirill S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-12-27", "description": "This is my third time at this restaurant. The food tastes authentic though portions were small and prices were overpriced considering it was fast food style self serve.  Today was the worst,  I ordered vegetarian dumplings and crispy noodles with garden vegetables. The vegetarian dumplings were good -  fresh and piping hot.  However, the crispy noodles were not pan fried as advertised. (In Chinese the menu for this item said pan fried - which means crispy on both sides, a standard dish.)  Instead of crispy noodles they served boiled noodles smothered in a starchy gray sauce, which is unacceptable.  \nHey Yaso, if you are reading these reviews please take notice.\nSincerely\nBarbara", "author": "Barbara L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-02-25", "description": "I have been to this place a bunch of times before the renovation and even took friends from out of town. Considering we live on the upper west side, that's a big endorsement. I went again tonight with my family and am surprised they had a renovation and change of menu. They got rid of the open window that you could see people making dumplings and I can see the operator is more streamlined. We ordered most food eat in but they still give us the plastic containers for the soup dumplings. They are all stuck together and we ended up breaking them when picked up and hence wasted all the delicious soup. Very frustrating as I missed the old bamboo steamer. The fried pork buns don't have the golden fried bottom and seemed undercooked. Worst of all, my mom had diarrhea after getting home. Probably won't be going back again as this is the rare case when I see a promising establishment going downhill after expansion and renovation. Such a pity! When you do certain things well don't try to cut corners and expand menu into non authentic items...", "author": "Yelin L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-23", "description": "Ordered couple dishes. Pork ribs and pork meatballs were absolute delicious. Can have that everyday. Hope they can open one near my home. Super satisfying fast meal.", "author": "Wei M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-19", "description": "Nice and trendy setting with clear glass kitchen (always a plus). The table settings were quite interesting. They have bigger tables to share with other people, which embeds more of Asian culture. The food is very cheap (for NY) and delicious. Excellent experience overall :D", "author": "Steven K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-20", "description": "I am so happy there is a decent noodle and dumpling place. I could just order 1000 dumplings and eat it all day. I love the Meatball noodle soup as well. The service is good and fast. I sometimes go after gym and probably it's like once a week.", "author": "Rollin L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-13", "description": "This place is definitely a lot more chic with higher price tags than neighboring restaurants in the Fulton St area.  It reminds me of the ramen noodle joints in Manhattan.\n\nDropped by for lunch...\n\nTangbao means soup dumpling so you gotta try the namesake dish.  The Blue crab soup dumplings are legit but be prepared to wait 15 min while it is made fresh. Next time I will order online before coming as they do not take phone orders. \n\nMinced pork soup noodle has a bit of spice and excellent broth that makes the dish.\n\nWill be back for more", "author": "Lily L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-06", "description": "As a Shanghai local, I love love this place. They r little pricy but compare with those shit shanghai restaurant in China town, this place deserve a 4 star. Especially the soup! So delicious and it reminds me of my childhood back in Shanghai. Love this place and just keep coming back.", "author": "Aeril X."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-27", "description": "I don't live in the area, but I came here to eat lunch and was pleasantly surprised.  We ordered the pork soup dumplings, wonton soup, pork shao mai (not to be confused with shumai - this is more like a sticky rice dumpling with soy-marinated pork inside), and the garden vegetable crispy noodle.  Prices are reasonable here, not as cheap as Chinatown but not expensive either.  You order at the register and wait for your food - they have a soy sauce dispenser, hot sauces and utensils near the drinks.  The decor is modern and clean, I would come here again without having to make the trip to Chinatown!", "author": "Risa H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-08", "description": "The answer to soup dumplings in Brooklyn is this place!! Go hungry and try their spicy soup dumplings (Y3), I don't think you can find this delicacy anywhere else in NYC. I always pair that with their meatballs soup noodles, shao mai (sticky rice dumplings), sweet short ribs, you tiau (fried dough) to dip in a warm bowl of sweet soy milk = one comforting delicious meal! Oh, they also have seasonal sautéed greens too for those of you (like me) who always need a side of greens with your meal.", "author": "C C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-08", "description": "Great Shanghai dumplings. Right up there with best I've had. They also have You Tiao and Soy Bean Milk which were very authentic. Price is also reasonable plus nice decor.", "author": "Albert O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-05", "description": "tl;dr: wide variety of Asian food that is flavorful and very shareable. I would order the garlic bok choy, fried rice, and BBQ pork ribs. Casual wooden benches atmosphere where you order at the register, creating a cozy environment. Very reasonable prices!\n\nWent to Yaso Tangbao with friends during a rainy day. Seating is mostly first-come, first-serve on wooden benches, so you might find yourself sitting next to randos while you eat, but that just adds to the casual environment of this restaurant.\n\nWe decided to order a few dishes to be shared: garlic bok choy, BBQ pork ribs, fried rice, pork soup dumplings, and fried chicken over rice. Everything was delicious and my two guy friends and I walked out stuffed, despite having paid roughly $40 between the 3 of us. The bok choy was simple and pretty standard, although I like the added garlic. BBQ pork ribs were tender and savory and had just the right amount of tang--very shareable! I was skeptical about sharing soup dumplings (assumed that was an actual soup-y dish), but so glad we got it! It was a fun experience to suck out the broth from the dumplings. The fried rice was perhaps my favorite item because there were many layers of flavor. It was the perfect accompaniment to our BBQ pork ribs. My friend thought the fried chicken over rice was underwhelming, but my husband and I thought the chicken was very good, especially since they are sliced thin and fried creating a very crispy dish.\n\nDefinitely will be back to try more food items. Especially happy to find a good Asian restaurant in the area.", "author": "Cecily S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-06", "description": "Here is the complete guide to this restaurant.\n\nFirst things first: do not ever order in person. Always order in advance, they make food to order and it takes extremely long. Your experience will be MUCH more pleasant if you pick up.\n\nThe food: The eponymous tangbaos are the main attraction here. Don't be fooled by their lack of variety, order one set of every tangbao if you can. The noodles and rice while made with quality ingredients taste okay but pale in comparison to the Baos. The soup noodles are especially not spectacular. \n\nDrinks offered are quite marked up but quite tasty.\nThe youtiao are dry and taste slightly stale.\nThe katsu is often a good pick with a side of veggies; I had it with a side of the garlic greens. The greens themselves tasted good but were kind of oily and there were way too many chunks of garlic, almost more garlic than veggies.\nThe ribs are very sweet and hearty, a decent pick with a side of rice.\nCurry chicken is not very flavorful, do not recommend.\nSimilarly, the beef and pork noodles have a tasty broth but the noodles themselves weren't as chewy as I would've liked. I recommend the pork over the beef; the beef is not the nice kind of stew cut you imagine when you order it and will dissapoint you.\n\nLast but not least, the famous TangBao here are AMAZING. You can see them making them through the glass and they taste as good as any tangbao in flushing. My favorite is the crab and pork, but definitely try the spicy pork at least once, there's a great flavor and kick in the soup. Make sure you eat them as soon as possible after ordering to prevent the soup drying out or sticking to the wrapper and tearing the tangbao.", "author": "Hub H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-29", "description": "Found this little gem on Yelp and it was great. Inexpensive and no frills but the food was good! The woman at the register helped us order and we enjoyed everything we had. The spicy pork soup dumplings were especially good.", "author": "Leah H."}], "servesCuisine": "Shanghainese", "priceRange": "$11-30", "name": "Yaso Tangbao", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "148 Lawrence St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/n8qkl-utd4uCMlOy46G05g/ls.jpg", "@type": "Restaurant", "telephone": "+19293377599"}