{"aggregateRating": {"reviewCount": 704, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-11", "description": "Walked by this place a few times and was curious, so I checked yelp.... good reviews and great pictures (thanks yelpers!) and of course, I went in. First impression... there is bench seating (sharing a bit of personal space) and it's hot inside (minimal ventilation). Should I stay? Why not!? \n\nI walked up to the cashier and asked a few questions about the menu (which is conveniently posted on the left wall (with pictures!). I decided on a small order of rolls and buns, paid, and grabbed a seat (bench). I waited about 15 minutes because the buns are made per order. I got a little bored and walked around a bit. There is a self serve station (soy sauce, venegar and sriracha), the hallway to the bathroom has cool artwork, they sell merch, and there is a glass window where you can watch them make the buns! These folks are skilled! As I was standing there mesmerized by the roll, swirl, pinch.... my order was called. \n\nIt took more time than I expected, so I ate the rolls there and took the buns to go.\n\nThe rolls were delicious! The exterior was crispy but with a firm bite and not too flaky. The inside had a great balance of moist veggies and juicy meat. The rolls tasted fresh and light even though they were deep fried! \n\nThe buns were very good. The flavors were subtle yet tasty. There was a good balance in the portions, and the meat was tender. However, I didn't care for the seeds on top and I prefer the darker rolls that have a slight crisp on top that's ever so slightly sticky and sweet. But that is just preference. These are different and they are very good. \n\nBottom line... It's hot inside, there is a 15 to 20 min wait, consider making friends with your bench-mates.... but the staff is super friendly and the food is really good. Worth the wait.", "author": "Kiki K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-05", "description": "The food:\nI got the pan fried pork buns. They are really flavorful and the meat inside is juicy.\n\nOrdering:\nI came in on a Sunday around 2pm. There was no line and you can order really quickly on an iPad. The wait for the food was only about 5 minutes.\n\nValue:\nAbout $7 for 4 decently sized buns. Might be enough for a full meal for some people. Super worth!", "author": "Sam Z."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-01-13", "description": "So I've been coming on and off for about 2 years, within the last year I must say their tang bao aren't as good, it's smaller and there's not as much soup. It went from my favorite tang bao place meh. The lion head meat ball is smaller and has less sauce. they've replaced the fresh vegetables bak Choi with the cheaper school lunch broccoli and carrots. They've even done away with the ginger for the soy sauce dip. They have added different types of tang bao and a few other dishes but the overall I have to say it's disappointing. They seemed to have kept prices relatively stable but it went from oh man I'm craving it to meh not worth the calories.\n\nI'm downgrading this place to 3 stars", "author": "James C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-01-08", "description": "This place USED to be awesome, but something has changed for the worst. I would have given this place 4 stars in the past but on a very recent trip, there were a lot of observed customer service and operational problems. Specifically, I ordered two orders of soup dumplings and received one batch that was room temp and another that had raw pork in it. The preparation and service of these dumplings is audacious. You need to train your back of the house and front of the house staff better.", "author": "Denny H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-09-08", "description": "This is for the braised beef over rice and soup dumplings. It was like a fast food Americanized version of authentic Shanghainese cuisine. Overpriced probably because it's industry city. Went out of the way to try this so probably wouldn't return unless I'm in the area and no other options.", "author": "Mellissa K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-10", "description": "Found this place on Yelp and have to agree, very tasty! We had a lot of items but went back for seconds on the Spicy Pork Soup Dumplings. Busy place with lots of takeout orders. They are very popular. I would highly recommend!", "author": "Rod F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-16", "description": "Stopped by after some shopping in the area. Skipped lunch so was starving. So glad I stumbled upon this gem.\n\nI had the spicy pork soup dumplings and the pork baos. Both were flavorful and delicious. The soup to meat ratio on the dumplings was perfect and the soup was delicious. The steamed buns also had a delicious filling. \n\nWill be back!", "author": "Pooline N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-03", "description": "Delicious.  I am a happy girl!  I had the pork dumplings and chicken curry bao.  It was a hard choice.  I will be back for more.  Cute little restaurant, food served up at the counter after you order.", "author": "Megan M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-04-24", "description": "Had a great and enjoyable meal here.  I was a little skeptical because of the review but was pleasantly surprised.  The food came quick and was yummy. We ordered 4 different types of soup dumplings and a noodle dish and they were great. Good price for ~$4 for 4 dumplings. Lots of soup inside the dumplings and they offer vinegar and sriracha. If you're looking for soup dumplings in Brooklyn this is definitely a good option to fill that craving!", "author": "Carol H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-30", "description": "***3.5 stars***\n\nYaso Tangbao brings Shanghai street food to the heart of Brooklyn. You've platters of crawfish to munch on to your heart's content, freshly made Nianxing soup dumplings and pigs feet larger than your hand.\n\n/THE GOOD/\nSoup dumplings:\nYaso pork, blue crab pork, spicy pork. The skin is perfect: neither too thick nor too thin, not overly droopy. It's hard to choose a favorite between the blue crab pork and spicy pork.\n\nBraised pork meatballs:\nIf you could eat clouds, I'd imagine this dish to be just that. It's the lightest, softest, jiggliest, and fluffiest balls of pork I've ever had. So good. \n\nSweet \u0026 sour pork spare ribs:\nYummy, finger licking sauce that thickly coats the spare ribs. Perfect tartness \u0026 sweetness. \n\nSweet pumpkin cakes:\nThe perfect dessert to end every meal. The shaved coconut sprinkles were a pleasant finishing touch. \n\n/THE OKAY/\nPan fried pork baos:\nThe baos and meat were a bit too dry. \n\nGarden vegetable dumplings:\nA colorful and fun skin representative of an all veg dumpling. I just wish it was more flavorful/savory!", "author": "Lisa Z."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-24", "description": "We are visiting in New York and happened upon this place and are very thankful. Delicious refreshing food, quick Service, cleanliness, and a good environment. If you're looking for a great meal with healthy ingredients this is the place. Please bring to Greenville SC", "author": "Will L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-01-30", "description": "I ordered the spicy pork soup dumplings, which didn't have enough soup in them and were lukewarm at best. You can get cheaper, better quality and better tasting soup dumplings at an actual Shanghainese restaurant. Ordered the pan fried curry chicken dumplings which tasted like they were frozen and reheated especially because it was still cold on the inside. The soy garlic noodles were really greasy. Not sure why there are such great reviews when it tasted like takeout. I guess if you're on the run this is a good place to stop by but for the price and quality of the food, I wouldn't come here for an actual meal.", "author": "Gloria K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-21", "description": "As a native Shanghai girl, I will have to say, the Shao Mai and Tang Bao is legit! This is what you'll taste in Shanghai. Staff was very friendly, and we got our food fast. \n\nPork tang bao: very very good! The soup inside the bao was light and flavorful, not greasy which is a plus! There was so much soup inside that when I took my second bite, the soup spilled on my pants... good thing is that the bao is filled with soup. Bad thing is that I wasted some soup on my pants :( \n\nShao Mai: this hit the spot! I've been craving Shanghai Shao mai for the longest and this place gave it to me! It's sticky rice with pork, absolutely amazing! \n\nSweet and sour ribs: a little dry, but the shanghai flavor is definitely in there. I don't know if I'll order this again, but it's good. \n\nGarlic rice and chicken fillet: pork and chicken fillet is a tradition in Shanghai. This chicken fillet is thin, juicy and crunchy, how a Shanghai fillet should taste like! Loved it! The garlic rice was just rice with garlic flavor, it was good but not a Shanghai dish. \n\nBeef with noodle: this was a bit disappointing. The beef is known as Hong Shao Rou, which is beef or pork cube with soy sauce. If this dish is done right, it's delicious. But sadly this dish was not done right, no shanghai flavor what's so ever, I'll give it a pass next time.\n\nOverall, I will definitely come back! Order the tang bao, Shao mai and the chicken fillet!!", "author": "Tian Q."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-12-28", "description": "Definitely a place I would visit again or one of their other locations! The menu is pretty simple and it has just the right stuff on there. \nIt was my first time trying soup dumplings and I am in LOVE! The place is pretty much self serve. They even have a self order station. Initially I thought it would be a sit down and order type of place but nope! I was okay with that. My husband was thrown a bit off but he enjoyed it as much as I did. \nWe had two types of soup dumplings, spicy pork and pork. We loved the spicy pork more than the regular ones but the regular ones were great as well. We also ordered the spicy dumplings and they were AMAZING!!! To be honest, my favorite of the bunch. They are a lot smaller than what the picture depicts but they are also shareable when you order a bunch of other stuff. We also ordered the curry bao which was the best I have had thus far. The bun is crispy and the inside is soft. The meat is succulent. The only plate we did not care for were the bone in ribs. At first the taste is great but after a couple more bites, the meat just tastes weird. The sauce is good but even that wears off after a while. The food does not come out in plates but in plastic/disposable containers. \nThe manager is friendly, he came around to see if we got our order correct. The employees behind the counter just sat around and chatted, without a care in the world. \nThere is a bathroom but you need to check the receipt for the code.", "author": "Georgia N."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-06-23", "description": "I trekked all way from the city to come here to taste those \"oh so delicious\" soup dumplings...\n\nThis is my second time coming here. I also got the chicken cutlet noodle soup for an astounding $9.85 per bowl and three orders of soup dumplings for take out. The fried chicken noodle soup was good but I didn't like the fried chicken siting on top a bed of noodles. Inadvertently, the breaded part turned mushy. \n\nAs I finished my $10 inflated bowl of noodles, I ordered a side of fried chicken cutlet to go but when I got home, I was disappointed to see they made the portions smaller since last visit. I don't think I would come back for chicken noodle soup - I also noticed they gave less noodles this time. I had the beef noodle soup last time and I liked it better since itwas more flavorful. \n\nThe place was packed from 7-8pm and takeout orders sitting on their counter waiting for the Uber delivery person for pick up.", "author": "Vivian L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-08-01", "description": "Very Americanize! I was so excited to try the soup dumplings because it had such great reviews, but highly disappointed. It didn't even come out hot, just warm like it's been sitting there for someone to order it. The flavors was okay but not what I expected. The sweet and sour ribs was decent, probably the most favorite thing out of all the things we had gotten. And the pork bao, was good. Crispy bottom, soft top, and juicy in the middle. Overall, nothing spectacular.", "author": "Ngan N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-12", "description": "This Place is you need to experience soup dumplings at. Their food is full of flavor and as authentic as I could assume the real thing is. Just try it and you will not be disappointed. Straight up amazing. I judged my review on the Y1, Y3, S2,S5,B1, and more to come\n\nUpdate**** just went today Monday March 12 2018 which is my first time back after the opening. I am happy to report that the food is just as good and that even though they added some unique dishes and changed the inside around slightly, the original soup dumplings Y1, 2, \u0026 3 are still the best soup dumplings in Brooklyn. It is disappointing you can't see them making the dumplings anymore like you did in the past, but I guess watching people prep in a fish bowl isn't that important. One other thing is that a new dumpling was added to the menu that states a wonton with activated charcoal. Well that in English is what Americans used to use to induce vomiting, so maybe charcoal infused may be better. Anyway I still hold at 5 stars. Keep it up Yaso and next stop industry city", "author": "Sal L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-30", "description": "I have to admit something here: I've only gotten Yaso delivered. But let me tell you, the first time my roommates and I discovered this place through DoorDash, you could see an empty Yaso bag in our kitchen every week or so. \n\nTo have something so affordable, fresh and quick nearby is a treat. I order Yaso when I'm starving. This isn't a light snack sort of order with all the carbs. I imagine if you head inside to the restaurant, it could be different.\n\nLet me break it down:\nChicken Curry: reminds me of Korean/Japanese curry. The flavor isn't too pungent, just the right amount of comfort and flavor you'd expect in a curry with rice, potatoes, chicken, etc. \nTry it!\n\nTofu: delicious mapo tofu is the silkiest tofu possible that basically melts in your mouth. It's in this nice pork sauce/glaze on a bed of rice. \nTry it!\n\nBraised meatball: the pork meatballs are juicy and delicious, especially combined with egg. I think it's both of my roommates' favorite dish here. I prefer the flavor of the other two above better, but it's solid. \nTry it!\n\nBlue crab and pork Soup dumplings: for fast casual type of place, it's great. The flavors are there and the soup has always been a nice amount. Obviously, you can get better in Chinatown but it's good.\nTry it if you want!\n\nPan fried pork baos: I mean, is there ever a time you see fried pork on a menu and NOT order it? No. It's flavorful, filling, and quite the treat. Think thicker dumpling with pork bun texture on the exterior.\nTry it!\n\nCoconut dessert: don't even know if it's still on the menu. All I remember is that it was tasteless and I didn't finish it. I always finish dessert.\nSkip it!\n\nShanghai cold noodle: think there's one element that's missing with this dish.... it's a little too simplistic with not enough sauce. My favorite version of this is at xian famous foods. \nSkip it!\n\nPork and Bok Choy wonton soup: I always order this when I'm sick. It's hot (temperature wise), savory, filled with umami and with a good portion of wontons. \nTry it!", "author": "Gina K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-07", "description": "Delicious! Really fast service and fresh food. Definitely some of the best food in the neighborhood. One of the better options for folks who work in the area.", "author": "Bushra M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-09", "description": "Really good food. Gem in the neighborhood!! I got a meatball rice bowl with the dumplings. Definitely recommend!", "author": "Ellen L."}], "servesCuisine": "Shanghainese", "priceRange": "$11-30", "name": "Yaso Tangbao", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "148 Lawrence St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/n8qkl-utd4uCMlOy46G05g/ls.jpg", "@type": "Restaurant", "telephone": "+19293377599"}