{"aggregateRating": {"reviewCount": 704, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-27", "description": "Excellent dumplings, soups, etc! The place is very clean and nothing seems like too small of a detail for them to excel at. Recyclable paper containers for takeout, very nice interior and everything is fresh. You can watch them making dumplings in the kitchen while you wait for your food. And the food... wow! The dumplings are to die for and the noodle soups are unbelievably good.  Soups that contain meat, like the meatball or spicy pork are especially good because the meat is always tender and succulent - never chewy and tough.  I can't say enough about Yaso.  Its definitely worth the trip.", "author": "Brian M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-15", "description": "Tangbao tastes good. However, it is not considered as typical Shanghainese Xiaolong. Worth my trip. However, it does not remind me of my hometown, Shanghai.", "author": "Sophie X."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-13", "description": "Delicious and authentic food. Slightly on the pricey side for the amount that you get, but a great addition to this neighborhood. I went there with my husband for dinner on a weeknight a couple of weeks ago and we tried an assortment of dishes including the crab soup dumplings, the ma pao dofu, garlic cucumber salad, and the room temperature chicken dish (forgot the name) - all was delicious. The atmosphere is modern and warm, and the community tables make for easy and comfortable seating even at crowded times. I would give it 5 stars if it weren't quite as pricey ($45 to feed the 2 of us with no alcohol) but it is definitely great to have a place like this in the neighborhood when you don't feel like taking the F train to Manhattan Chinatown.", "author": "Jen Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-12", "description": "I like the ambiance, nicely decorated, makes people feel relaxed \u0026 comfortable.  The food comes in small portions, so I can taste a lot of different dishes.   There are so many different dishes to try (~30-40 items?). Strongly recommend tangbao (blue crab and pork soup dumpling), Garden Vegetable Crispy Noodle, G2 Kao Fu. I've only been there once so far, but I will definitely go back and try more dishes! Part of the kitchen has glass walls and you can see how the chef makes dumplings", "author": "Cathy H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-08", "description": "Expensive for what it is, but the braised meatballs over rice with eggs are on point.", "author": "A L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-09", "description": "Second time here. The place is in good decorations. I really like the soy milk and xiaolongbao here. Some traditional cold dishes are also delicious. The noodles and shengjianbao is just so so. As a shanghainese I think overall it's the best shanghainese restaurant around this neighborhood and the price is fair.", "author": "Jiachen L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-02-01", "description": "tried coming last week but it was so packed that i couldn't even get in. so i decided to come back yesterday with a coworker for lunch. it was a bit late and it wasn't as packed as the first time we went. i ordered the mapo tofu with rice and egg. it was pretty decent. the portion wasn't so bad. i feel like it's a bit overrated tho. i might come back but i'm not 100% sure about that.", "author": "Sue W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-14", "description": "We loved this spot!  Super fast service and addictive food! The Juicy Pork Bun with crab meat tastes amazing.  Unlike those more \"formal\" Shanghainese dining places, this is where we could just stop by having juicy buns on our way home for a quick snack or take out without waiting for 45 minutes. Will certainly be back soon.", "author": "Zing B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-04-16", "description": "Ordered pork soup dumpling, bean soup, pan fried bao, stick rice shuimai, pork meat ball on rice and drunken chicken. What a shame for them to price those dishes like 20 to 30 % more vs other authentic shanghainese restaurants in china town. Soup dumpings tasted blend, stick rice shuimai uncooked like just took out from the fridge. In addition, they were so cheap to give us 2 more extra bowls to share our rice and bean soup. Definitely not rrecommend drive 15mins more across the bridge to have better food. Do not go!!!!!!!", "author": "Yungte Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-10", "description": "The number-one to-go place around metrotech center if you like Chinese foods. Even my friends from Shanghai told me it's authentic. Really liked the pork chop and noodle too.", "author": "Rom G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-12-01", "description": "Ordered the wrong dish. Menu is placed on the side of the Wall partially behind the counter. Very confusing. Be careful when you order. I ended up handing back my uneaten food for them to trash.", "author": "Bob T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-14", "description": "The xiaolongbaos were awesome, so were the noodles. Never thought I would taste these goodies here in NY. The spicy diced pork noodles were really delicious too. Licked the bowl clean and been thinking about the meal all the way home. Coming back here again! Wish there were more locations tho. Thumbs up!", "author": "Cherie K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-05", "description": "YS1 Yaso Pork Soup Dumplings quantity 4 are pretty good vinegar comes from a water dispenser. Side of fried chicken was crispy and juicy and a tad salty but I seem to always order it. They had sweet and spicy dumplings in a chili oil as a special. While this is one of my favorite things to eat and I seek these hangover helpers quite often, these were not the way I like them. The sauce was a little too sweet BUT their dumplings are very good. While the portions are smaller than Manhattan or Flushing I think the quality, execution and cleanliness makes it a nice spot to go when you don't want to head to C-town for soup dumpling. As far as the price I am surprised that so many have commented on price/value since the food is good and it is Brooklyn. Last time I checked living in BK trumps the cost of living in Manhattan and of course Queens. To be honest the portion size here is actually perfect since you don't leave with a food coma because you can not leave that last soup dumpling it would just be wrong and mean to the dumpling gods.", "author": "Jack Straw S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-17", "description": "Surprised to see so many reviews already considering that they've only been open for a week. To be honest I expected a long wait, bad food and disorganization since YT is so new. But these reviews well deserved. They're running a pretty smooth operation as far as I can see. Prices were affordable and it took less than five minutes to receive my order. The food? I was pleasantly surprised by both the authenticity and quality. I couldn't be happier to have a proper Asian joint in Downtown Brooklyn. Welcome to the 'hood, Yaso Tangbao.", "author": "Nikki C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-27", "description": "thought it was table service, but its order, pick up and sit or go. the neighborhood its in is kind of confusing to find at first and its away from the pretty lights in christmas time  my dumplings soup was good, spicy bao was spicy \u0026 good. nice decor, ambiance ok too. just kind of small \u0026 the people yell out the order # and if you dont respond within 5 seconds they legit yell it out \"TWENTY TWO?!?!\" calm down.", "author": "Rofelmae D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-31", "description": "Truly an offbeat location, but the food is wonderful and apparently authentic. Soup dumplings the meatballs even the cucumber salad are all recommended.", "author": "AJ K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-16", "description": "soup dumplings were delicious. clean and great service. i ordered soup dumplings, beef noodle soup and the soy marinated fried egg. all have authentic flavor to them.  definitely coming back if I'm ever in this area again.", "author": "Cat N."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-05-19", "description": "What I thought would be a modern take on Shanghainese food was instead a watered down disappointment. \n\nI tried two noodles, first the N2 pork meatball (the soup lukewarm and flavorless, the meatballs straight up cold)...then the N3 garden vegetable. \n\nIn both soups...it seemed they threw in a pack of noodles that cooked stuck together because I lifted out a nearly intact noodle bunch.  \n\nThe pork meatball soup was truly inedible. The garden vegetable was better but I still didn't finish it. \n\nAnother review wrote that this place seems to cater to the nearby white collar workers...after eating here is have to agree.", "author": "J M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-10-29", "description": "Big fan of Soup Dumplings and other similar fare, this wasn't anything great. The curry chicken in pan fried noodles was tasty but meager portions. For $10 and mostly vegetables, next time I'll pass.\nThe soup dumplings were nothing special. They are heavy on the sesame oil. With Chinatown a mile away, spend the extra 10 minutes on the subway or a car and go to one of the local spots on Pell Street", "author": "Matthew R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-09", "description": "The crab and pork soup dumplings are the best!!! The spicy and regular ones are also great. You really can't go wrong with any of the dumplings here. And the sweet and sour pork ribs were a pleasant surprise. Would definitely come back again!", "author": "Xinyi G."}], "servesCuisine": "Shanghainese", "priceRange": "$11-30", "name": "Yaso Tangbao", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "148 Lawrence St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/n8qkl-utd4uCMlOy46G05g/ls.jpg", "@type": "Restaurant", "telephone": "+19293377599"}