{"aggregateRating": {"reviewCount": 704, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-08", "description": "The pork soup dumplings are amazing. So are the Sweet \u0026 Spicy Dumpling Jiaozi. I recommend them both. You order off iPads and seat yourself which makes this place a great spot for a quick, delicious and cheap lunch. I'll be back!", "author": "Sabina O."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-05", "description": "Xiaolongbao and shaomai were very good. This is a fast service restaurant where you seat yourself. Order comes in pretty fast and food tastes quite authentic. Ordered cold peanut butter noodles which were not up to par, but otherwise no complaints.", "author": "Christine H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-09", "description": "Amazing dumplings. I had the Spicy pork soup dumplings and the steamed baos which were perfectly cooked. Even my seven year old who is a very picky eater loved them. The food is very good and the restaurant was clean and from the front the kitchen staff looked well organized. The young lady at the register was pleasant and helpful making menu suggestions. The only thing that I didn't care for was the music was terribly loud.", "author": "Lucas C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-25", "description": "I'd describe this place as modern, fast casual dim sum eating meats Taiwanese tea house eats. The dumplings were good but I'd pass on the meatballs.", "author": "Sophie L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-05", "description": "The quality of the food is basically trash and is such a huge disappointment! Being Chinese I grew up eating basically everything on the menu so I know how it should taste like, but everything is either way too salty (their chicken) or not much flavor at all. Don't come here for authentic food it is over priced and taste like something straight from the garbage", "author": "Pierce H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-16", "description": "Ordered one order of the spicy pork soup dumplings and an order of the original, unfortunately we got two orders of the spicy soup dumplings given to us. I think there are some changes going on as their soup dumplings were also on sale because they were having issues. The wrapper was thicker and not as much soup in the dumplings. The flavor was great, so I may be back after they've settled out some of their issues. Also their dumplings came with these cute little spoons", "author": "Katie H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-18", "description": "The spicy pork soup dumplings are delicious! I have gotten then a few times already. The first time I went I asked the cashier what she recommended as an entree, and got the chicken noodle soup, and that was pretty disappointing--very plain for ~$10.  When I went recently I got the charcoal chicken soup dumplings alongside the spicy pork ones. I thought they were a little sticky/gummy and definitely nothing special. Overall, the spicy pork soup dumplings are tasty and the way to go, nothing else I've found there was too wonderful. Also, the wait can be quite long--5 minutes to order but 10-15 minute wait for your food!", "author": "Wanda P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-11-14", "description": "I just want to start by saying I've been to this restaurant before, awhile ago and it's obvious the personnel as change! The customer service I experience at YASO today was horrible! First of all the unprofessional cashier had the worst attitude it was noticeable from the moment I was placing my order! Second she had gloves on while handling the cash which is perfectly fine but how the hell can you handle cash with gloves on and then go cut up my chicken with the same gloves on??! I told her I didn't want it and of course the attitude got worse. Her manager came over and asked what was wrong I was going to explain when she cuts me off and said she changed her gloves (yeah after the fact) so what's the problem, she says! If she would've apologized I would've been perfectly fine and I wouldn't be writing this review right now but since she had an attitude and was acting really unprofessional making faces shacking her head like I did something wrong and screaming out omg in Spanish!! What?? This girl clearly needs training in customer service because she has none. Btw won't be going back and if could 0 stars I would for me experience!", "author": "Jay S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-03", "description": "Went to this place on a Saturday morning and it had a decent amount of people come by. \n\nI had the Spicy Pork Noodle Soup and my boyfriend had the Beef Noodle Soup. We also got the chicken cutlet and shared the soup dumplings with a group of friends (they come in 4). \n\nThe pork broth was a lot more flavorful than the beef, but both were great. The serving sizes are pretty big and definitely worth the price. The chicken on the other hand was very average - definitely would not get it again. The soup dumplings were fine, yummy and flavorful but really sticky. \n\nIf you want to take the food home, you should know that the bowls are made out of cardboard so beware of any leakage!", "author": "Emily U."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-20", "description": "First review, huh... well here I go.\nI don't really go out much, so the only chance I get to venture out to different places is when I'm done with my classes in college. The place was pretty close by, so I decided to check it out. Didn't wait too long to get what I ordered (I believe it was the blue crab thing...), and it tasted alright. Maybe I'll come back and try something new.", "author": "Despair M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-03", "description": "The braised beef noodle soup is fantastic! Soup dumplings are also very good. Nice fast service too", "author": "Suzanne Y."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-03", "description": "Quite solid XLB but pretty terrible cold noodles. I'm still giving it 4 stars because you should just not get the cold noodles. The chewiness of cold noodles is probably my favorite thing about them, but I guess to try to achieve this texture they figured maybe they'd just cook it halfway. But that means you're just eating super undercooked noodles.\n\nAnyways, the XLB have a fairly thin skin and the soup inside is pretty tasty. As with most XLB, I'm never quite sure I can taste the crab when you get the fancier of the two varieties.", "author": "Misha T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-09-25", "description": "I was craving Kao Fu so I made the trek to this spot instead of finding a place in Chinatown or Flushing.\n\nThe space is more takeout/fast dining where you order your food, pick it up and eat at their tables.  It was clean and roomier than a lot of Chinatown places.  The soup dumplings were good but like other reviews said, it only comes with 4.  The size might be a bit bigger than the ones you get in Chinatown but it was still a little pricier.\n\nIf I lived around the area, this would be a good spot to fix my Shanghai craving but coming from Williamsburg, I rather put in the extra effort to go to Chinatown.", "author": "Nas L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-09-26", "description": "Meh. \n\nThis is not exactly fast food, maybe  extremely informal dining. There's a walk-up counter and a few long tables for communal eating. I recommend getting this food for take out. \n\nThe food was just alright. I know Chinese food is usually salty, but it's usually balanced with other flavors. This was not. Just salt and grease. Also, I asked for a little less of something, I can't remember what, in one of my dishes and the employee treated me like I slapped his grandma. \n\nI won't be coming here again unless I want a bowl of greasy salt on a bench with a bunch of strangers.", "author": "Chris B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-11-09", "description": "I m shanghainess so I think foods were ok.\n\nBut the price was litter bit expensive\n\nOverall still good place", "author": "Mars L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-30", "description": "Wow what a great place. They display the menu in pictures so you know exactly what you're getting. At first, I wished the prices were a little bit cheaper, but when I got my food I realized what huge portions it was! I got the vegetable rice bowl. It tasted amazing, not too salty or fattening like \"typical\" \"Americanized\" Chinese food. I don't have any experience with Shanghainese street food and there were some parts of the dish that I did not know what it was- for example, the gluten balls or the tofu skins (which I had to go up to the counter and confirm it was vegetarian,) and they were pretty nice about it. Not their fault I didn't know what it was. They have a bunch of vegetarian options, which is nice. Lots of open seating, super fast service, and great food. I would definitely come back here.", "author": "Laura G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-21", "description": "Excellent dumplings if you are feeling too lazy to travel to Flushing or even Manhattan. Spicy soup dumplings are excellent!  Ribs \u0026 peanut dry noodles was delicious too!", "author": "Kieran H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-06-19", "description": "I'd give this place more of a 3.5. The steep prices are a bit hard to swallow, but somewhat understandable given the location in downtown Brooklyn.\n\nThe space itself has a clean, simple, modern decor. Multiple long communal tables. The place has counter service and they call your number when your food is ready. Staff was friendly when I was there too. So onto the food: the xiao long bao (soup dumplings) were quite good. Wrapper was thin, good structural integrity to prevent inadvertent breaking, and the innards soupy and flavorful. But the price - ouch. $5 for 4?! A bit tough to stomach - I know that this is downtown Brooklyn and not Flushing, but you're paying almost a 200% premium (for example just had 8 XLB for $4 at Yoz Dumpling in Queens). I also had an order of the sheng jian bao (pan friend buns) - these were absolutely terrible. Nothing like the ones I've had in Shanghai. Part of the bun on top was ice cold. Absolutely no soup inside. For those who haven't had them before, the proper way is for the bottom to be slightly crispy, the top soft, and the inside is loaded with soup (more volume than soup dumplings). It was so terrible I couldn't even eat the last one. Will have to come back on future trips to check out more of the menu.\n\nSo....If you're craving some decent xiao long bao, too lazy to travel to Chinatown or Queens, and willing to pay a steep premium, the Yaso Tangbao is a reasonable place to go.", "author": "Gene L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-27", "description": "Bomb dumplings, skins were a bit thick but still good.\n\nGo for the pork and crab, the soup is a lot more balanced than the pork only. \n\nThey only have one kind of greens listed but they were delicious. \n\nChili oil for $1 is not necessary as they have sriracha", "author": "Jonathan K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-09-06", "description": "Ehh...not really worth the hype. Everything was okay to good but nothing was great. We tried a variety of items, XLB, shui mai, veggie dumplings, meat balls, pan fried buns and ribs. Shui mai and dumplings you can skip and everything else was okay.", "author": "Joy M."}], "servesCuisine": "Shanghainese", "priceRange": "$11-30", "name": "Yaso Tangbao", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "148 Lawrence St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/n8qkl-utd4uCMlOy46G05g/ls.jpg", "@type": "Restaurant", "telephone": "+19293377599"}