{"aggregateRating": {"reviewCount": 704, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-07", "description": "Been here 3 times now! Quick tips:\n\n-Stick with the soup dumplings. Solid value for food considering quality and location. \n-most of the fried items are skippable and not that special\n-noodle soups are decent, the beef one has nice chunks of meat with tender tendon (obvs watch out if that's not your thing)\n-pumpkin cakes with coconut are surprisingly well done; lightly sweetened, tender and chewy. Not stretchy like mochi though\n\n\nOverall: For about $10 you can have a nice lunch. I'll probably be back and will keep updating regarding various menu items.\n\nFOOD: \n-Drunken Chicken: very tender and juicy but the poaching liquid was too salty so any drunken and chicken-y flavors were largely drowned out. Good potential though, could have just been a subpar batch. \n-Soup dumplings: The XLB were great! Soup was nicely sweet and porky, with definite hints of dried shiitake and white pepper I think. The skin was a fair thickness and the gingered-vinegar dipping sauce was a welcome condiment. \n-Chicken sauerkraut spring rolls: well fried but very little filling. Flavor was good, but again, very little inside. Not worth the price.\n-Pan Fried Pork Bao: a little on the oily side, dough was very well risen. Pretty big overall though. Still would say the XLB are more satisfying, even if not as filling.\n[4.5/5]\n\n\nSERVICE: Fairly quick; there was about 5 orders in front of me and I still got my food within 10 minutes. The people taking orders were polite and repeated my order back to me to make sure everything was correct. [5/5]\n\nROOM: Nice looking place, very trendy and woody. A decent amount of seating, I'd guess the room could probably fit 30-40ish diners at max. Lighting is a bit sparse and there's a bit of a bottleneck next to the condiments and trash. Beware hitting your legs on the table legs- hurts a ton, trust me. [4/5]\n\nVALUE: Decent value. It takes real craftsmanship to make XLB and Yaso did not disappoint. I've been to the king of XLB, Din Tai Fung, and while DTF's XLB are arguably better, Yaso's are satisfying. Other menu items aren't as good as a value. [4/5]", "author": "Nick H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-25", "description": "I had the spicy chicken noodle soup here, and while it was pretty good, the spicy portion of the name is a joke. I have had spaghetti sauce with more bite. It was during lunch time and came out reasonably quick for takeout. The restaurant is clean and I'll most likely be back for some bao down the line, but if you get the noodle soup, add some mad sriracha if you want the name to be accurate.", "author": "Katie E."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-08-03", "description": "We tried the sweet and spicy dumplings, drunken chicken, and sweet and sour pork ribs dry noodles. This place is supposedly known for its soup dumplings, but we weren't quite in the mood for it. It seems to be a well-rounded Chinese restaurant, so the other dishes should be decent too right?\n\nHow wrong we were!\n\n- the sweet and spicy dumplings were some of the worst we ever had. The dumpling wrapper/skin was ridiculously thick, and the meat fillings were subpar. The picture on the wall was quite deceptive because the dumplings were actually bite-size, with each costing more than $1.\n- Sweet and sour pork ribs dry noodles was overly salty, nothing to write home about.\n- The drunken chicken was actually quite good but unfortunately was not enough to sway me.\n\nI guess the thing this restaurant excels at is its decor, but unfortunately not the food.\n\nPS. this place uses plastic plates/bowls and utensils  so that may be a huge turn-off for those environmentalists.", "author": "Johnny S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-05-05", "description": "I had this place bookmarked for a while after seeing a video featuring the restaurant on Facebook. I got to go one afternoon with my mother, and it was nice, but not the most memorable dining experience. I haven't really had any pull to go back there, although I am often in the area. Not to sound like a crotchety old lady, but I personally would recommend not going around the time schools let out. There are a couple of schools in the area and there always seem to be crowds of teens being loud and taking up unnecessary amounts of space. If you don't much mind that, then you can ignore how much of a boring, irritable adult I'm becoming. \n\nAnyway, back to the food. I loved the soup dumplings I had, although they still do not beat these dumplings I had in a restaurant in Manhattan once, the name of which none of my friends nor I can remember. I also really enjoyed the veggie dumplings--very flavorful. They have a pretty good selection of beverages here, and I didn't think the prices were too outrageous. Nice place, nothing wildly exceptional about it though. I guess it was a little hyped up in my mind from the video I saw. \n\nI had a fine time. It didn't take very long for my mom and I to get our food. We ate at one of the benches against the wall, and had access to an outlet, so points for that. My mom wasn't too happy with the fact that some of our food was served on to-go/Tupperware lids and such. That did seem like a pretty cheap move. All in all, nice place. I wouldn't write it off to anyone, but I'm not dying to drag anyone here again either.", "author": "Shazi L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-03", "description": "Get the meatballs. I know, that is a weird choice in a restaurant that specializes in soup dumplings, but trust me, you will not regret it. We also got the beef braised soup and that was a great choice for a cold winter night. \n\nWe placed our order for delivery (through Caviar) and everything came packed very neatly. In fact, the broth and everything else that goes in the soup was packaged in different containers. I recommend it!", "author": "Alex W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-06-04", "description": "I wish they had more vegan options- hardly anything to eat on the menu- even the veg buns had egg in it", "author": "Supriya M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-02-12", "description": "Fried buns are good juicy, drunk chicken has no flavor compare to many other I had before, ribs are tender and flavorful, soup dumplings is okay, not too outstanding, I have had better soup dumplings", "author": "Jane W."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-12-07", "description": "Been coming to the Brooklyn location since it's opening, and it's sadly taken a drastic turn for the worse. Yaso is well known for their quality soup dumplings, but changes in management have pulled good items off their menu, extended wait times, and (more importantly) downgraded the quality of food. \n\nLast night, I arrived at Yaso hungry but learned that not only was the curry rice dish taken off the menu, but that I should expect a minimum of 15 minutes for soup dumplings. An over sized sign next to the register showcased an exhaustive letter from management explaining how the company is experiencing changes in their supply chain and how they're experimenting with their soup dumpling recipe. They APOLOGIZED IN ADVANCE for any \"lumpy or thicker\" soup dumplings during this process. \n\nNo one wants either lumpy or thick soup dumplings from Yaso-especially not after waiting 15 precious New York minutes. The meatball with rice dish I ordered was 80% rice and came with 4 sad looking pieces of broccoli instead of the usual Bok Choy. I expected more for my $13 meal. My girlfriend and I both left feeling both dissapointed, unsatisfied, and dumpling-less.", "author": "Christina M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-23", "description": "Went last night with friends. The place is quite clean and surprisingly spacious compared to some of the other Chinese restaurants. Not a problem for the five of us to find comfortable seats together.\n\nThe food is just incredible!! The soup dumplings tasted just like the ones I had in Shanghai if not better. And the pork meatballs!! The meatballs are the best meatballs I have ever had in my life. One bite of it and rainbow came out of my mouth. Excuse my Chinese here：这狮子头真的太好吃了！口感柔软而且香而不腻。完全吃不到一般狮子头的面粉味也不会因为吃到荸荠这类的东西而扫兴。原料的质量吃一口就能感觉到。配合米饭煎蛋简直无敌 The meatballs went down too fast before I could take a photo of them. But I'm sure you can find that in other people's reviews. \n\nWould totally recommend this place to my other friends. And will be back for more", "author": "Nuoya L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-17", "description": "This is my favorite lunch spot in the area. The space is nice and clean, the staff is helpful and provides fast service. The food is delicious and authentic: I am from a small town not far from Shanghai and the food at Yaso Tangbao reminds me of my hometown, especially the drunken chicken and pork meatball. Overall highly recommend this place.", "author": "Shermin L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-18", "description": "I came here with my bf and his family for lunch. I'm a big fan of xiao long bao \u0026 im glad I was able to finally try yaso! \nIt was easy to find parking, surprisingly and I do not have any complaints here.\nNo more need to trek all the way to chinatown for XLB.", "author": "Gloria K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-29", "description": "Congratulations Brooklynites, you're looking at the next Xi'an famous foods. This place has got the it factor to make it big and I am surprised how it hasn't.\n\nWhen you browse up the address and make it to the store, you might have some second thoughts before going in considering how it is on the shabbiest stretch of Downtown Brooklyn next to a shoddy nail salon and some unknown prepaid phone reseller. But the fun really begins when you go in.\n\nThey follow a counter ordering with square checkout model quite similar to Xi'an famous foods. You know the drill, just place your order (you can even do it online) and grab a seat until your number is called. They were pretty efficient and I got my freshly made tangbao (soup dumplings) and cold noodle in a matter of minutes.\n\nAnd boy did I love the food. The tangbao was fantastic, the dough skin was just the right thickness, the soup still boiling hot (make sure you don't burn your lips though) and the cold noodle made a perfect complement even on a day when temperature outside leans on the low side. They give you both soy sauce and vinegar and a host of Chinese chili sauces to pick from, which is hard to fulfill at some sit-down Chinese places, let alone a fast-casual store like this. But they did it.\n\nThe vibe of the store bodes well with Brooklyn, and you will be surprised how colonial Shanghai artworks blend with Brooklyn brick walls, all of which making the space even more exquisite and pleasant to visit. Come in and you won't make a mistake.", "author": "Wayne C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-27", "description": "If I lived near here, I'd probably come here every day. We ordered the pork soup dumplings, fried chicken noodle soup, vegetables over rice, and sweet and sour pork ribs. Not saying it's the best I've had of any of those, but everything we had was super delicious. A bit on the salty side, especially the soup for the noodles and the sweet and sour pork. But I loved every bite.\n\nThey don't have too many things on the menu but they do have enough that I would want to come back and try pretty much everything. All the restaurants next door don't look anywhere near as good, while this place has a nice ambiance, is very clean inside, self-service so you don't really have to tip, and plays sad love songs the whole time you eat. Probably not a great place to date, because you'd be coming back here to eat dumplings and listen to those sad songs, crying, if you broke up. :)\n\nLoved it. The dumplings are better while they are so hot they burn your tongue, so don't let them sit too long!", "author": "Alex K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-10", "description": "The self serve model is interesting and efficient for busy lunch time, however I did notice that people take a log time ordering their own orders on the iPad-like device. Regardless, it's a good idea to still have one manned counter to facilitate the orders. The food is okay. The xlbs are not quite as hot as I'm used to, but they were still decently flavored. The consistency of the noodles were a little too firm and doughy. The broth was mediocre. Their service is great tho. Probably wouldn't come here again unless I get jury duty again.", "author": "Joey T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-08", "description": "I absolutely LOVE this place!\n\nI finally tried this place after several colleagues have tried to get me to come here but I was almost positive I would hate it; I was wrong.\n\nI got the beef noodle bowl and I fell in love with their style of food. It's so fresh and tastes amazing! It is genuine Chinese food (\"street shanghai\") and thats hard to find especially in this area. \n\nI want to come here again because I had a taste of their pork meatballs- MY FAVORITE. It didn't really taste like pork, which I rarely eat, and I look forward to having their meatball/rice/egg bowl. \n\nThe quantity of food you get is worth the price. You will pay an average of about $13 for a bowl and will be full. \n\nI recommend this place to people in this area, the line always moves quickly!", "author": "Amanda R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-20", "description": "Soup dumplings have the potential for being better, but the soup is lacking. Not as soupy as Joe's Shanghai or even other various Shanghainese restaurants in Manhattan.", "author": "Stephanie D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-25", "description": "Yaso Tangbao serves authentic Shanghainese and has completely changed the Chinese food options in Downtown Brooklyn. You no longer need to hike to Chinatown to get your soup dumpling fix - just head to Lawrence St and the new shiny storefront on an otherwise not notable block.\n\nThe crab and pork soup dumplings are perfect, with super super thin dough wraps, delectable soup on the inside, and hearty flavor. They are really good, since the chef is from Joe's Shanghai, you know they are better than legit. \n\nI've also had their pig ear salad (yummy chili oil), the crispy noodles with chicken curry (coconut curry tastiness), the Napa cabbage salad (sweet and sour and refreshing), and the pan fried pork buns, which are tasty, but not as good as the soup dumplings. \n\nThe prices however are high relative to Chinatown - $7 for four crab dumplings, $9 for a plate of noodles.  Considering the really welcoming and nice fit out I think it's worth it to not go to Chinatown and deal with grimy restrooms and loud Cantonese shouting. Also, I think prices are fair relative to similar restaurants of other cuisines. I actually want to sit here and eat my noodle soup instead of take out!\n\nHipster count here is very high, however, and I will be monitoring Yaso Tangbao for continued authenticity going forward!", "author": "Suanne L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-07", "description": "As a native Shanghainese I can say Yaso is the BEST and MOST AUTHENTIC Shanghainese food I have ever had in NYC so far without running into the long lines of waiting at Joe's Shanghai. I can't remember how many times i have been here for weekend brunch or for dinner when I am too tired to cook after work. Yaso Tangbao always gives me comfort and nostalgia for home. The restaurant is run by a bunch of international students from Shanghai who stayed in US after they graduated. So happy that they are bringing authentic Shanghainese food to share with a broader audience in NYC!\n\n[Food]\n\nThe must get Shanghainese food here is soup dumpling (pork and crab). The soup dumplings are on the top of my list even compared with those in Shanghai - the skin is chewy, the consistent and clear juice and the meat is not too fatty. The crab option is beyond my expectation - you can see and taste the real crab meat (rather than imitation crab) and the taste of crab is well blended with that of pork - a trace of sweetness. For those who never tried it, you have to bite a little opening on the skin first to suck out the hot juice before you can put the entire thing in your mouth. But be careful, don't be tempted to eat too fast - the host juice could hurt you (as I did once...)\n\nAnother must get is the \"lion-head\" over rice. \"Lion-head\" is actually Chinese meatball - pork blended with some veggie (sometimes chesnut) and braised in shaoxing wine and soy sauce. I also comes with 2 fried eggs on top and some bak choy. The best way to eat it (to me at least) is too mix the rice, the meatballs and the eggs all together and eat it like fried rice, as the meatball is a bit too salty too eat alone. I always make sure that I don't miss a single grain of rice in the box.\n\nThe side dishes are also good options, though I often find myself too full after soup dumplings and meatball rice to enjoy them. I tried: sweet sour rib, chicken cooked in wine, kao-fu (dried-ish tofu with mushroom - I'm not a big fan for this though). They are decent, especially the sweet sour rib, but not outstanding.\n\nI tried other main courses as well throughout the time, and they are definitely not as good as meatball rice. The noodle soup is a little bit too blend. The curry is good but it is not authentic Shanghainese food. \n\n[Service]\n\nYaso is set up like a fast food place where you order, pay, get a number, get called your number and pick up your food and therefore there needs no tip. The staff is always very nice and friendly. If you use the same card again and again to pay, you get a free serving of pork soup dumpling the 8th (or 10th, can't remember). They also did a promotion on instagram for people to win a return ticket to Shanghai. \n\nThe space is clean and often there are seats. The wait time for food can be a little bit long sometimes (~5~10 min) but not too bad. You also need to clean up your stuff after you finish.", "author": "Shen Q."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-12-24", "description": "4/5 Dumps for quality. These are great tasting XLBs\n2/5 Dumps for price. Pretty expensive for four XLBs.. but worth it since they're the only place around.", "author": "Sophia H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-08-10", "description": "Not authentic, americanized and over priced. Rice was soggy from overwatering and braised beef had minimal flavor. Only good thing was the egg which no one can mess up.", "author": "Anthony K."}], "servesCuisine": "Shanghainese", "priceRange": "$11-30", "name": "Yaso Tangbao", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "148 Lawrence St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/n8qkl-utd4uCMlOy46G05g/ls.jpg", "@type": "Restaurant", "telephone": "+19293377599"}