{"aggregateRating": {"reviewCount": 704, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-08-16", "description": "A bit pricey for the servicing size.  Tasted ok but not all that authentic.  but for the area, it's good enough.", "author": "Honest R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-30", "description": "They serve Shanghainese style snack food, as well as some rice dishes here. Order the soup dumplings and wine chicken! Sesame cold noodles are a bit on the sweeter side. The noodles were a bit hard, perhaps they keep the noodles in the refrigerator. It didn't have the chewiness you normally would find in Chinese noodles. Overall, this place is highly recommended. Spacious dining area, fast and friendly service.", "author": "L T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-04-28", "description": "The soup dumplings are awesome. I also loved the subtle sweetness of the pumpkin cakes. The pan fried pork buns were crispy on the bottom and fluffy on top. Not particularly generous on the filling. It was just enough to be satisfactory. I had the beef noodle soup too. The soup was very light. The bok choy and meat worked well but I felt the noodles overwhelmed the soup. A heartier soup base would have made it an excellent dish. Needless to say, I ordered too much. I have a hearty appetite. In hindsight, I would have left out the soup and split the pumpkin cakes with someone. The food items are pricey for what you get. 4 dumplings for 5-7 bucks is steep. Normally you get 6 at any other soup dumpling shop in Chinatown. 4 bucks for two pumpkin cakes is over the top. My bill was 30 bucks. Minus 1-star for pricing but it's understandable given the location and lack of competition for residents within a 2 mile radius. I would go back if I were really jones-ing for soup dumplings or a snack but for a planned dinner, I'd stick with Sunset or Chinatown.", "author": "Eli R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-02-07", "description": "No delivery. Tried to order online but online ordering ended at 7:15 and I placed my order at 7:14 and it was not accepted. Tried to phone in an order for pick up and they wouldn't take phone orders. Business must be booming. I'll take mine elsewhere.", "author": "Bonnie B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-04-20", "description": "The set up here is very nice. Nice seating and restrooms for a quick eatery. The prices I think are a bit high--especially for their smaller side plates. There are a few vegetarian options which is great, but I wasn't blown away. I would not recommend the fried rice sticks--not very good and definitely not healthy.", "author": "ursula l."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-25", "description": "Winner, winner.  I ordered the spicy soup buns, mapo tofu over rice, fried seasonal greens and spicy rib bites.  It was all delicious but the tofu was our favorite along with the greens.  The tofu was well seasoned with lots of gravy over the good quality rice and topped by two crispy edged eggs.  I only wish the yolk was not cooked until it was like a hard hocky puck and instead was done medium, so that the yolk could spill and seep into the gravy.  I hope it is an option I can request the next time I eat there.  The greens were bright, crunchy and garlic laced.  The pork ribs were flavorful but I wished they had drained some of the oil it was cooked in.  Soup buns are always fun and these had the perfect tenderness yet strength to hold the hot spicy broth!", "author": "Conni M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-18", "description": "The ribs were sweet and feel apart in my mouth.   A surprise find in the neighborhood, it's part of the creeping gentrification.", "author": "Vicki V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-19", "description": "This place is absolutely a great place for Shanghainese street food lovers like me. As a Shanghainese local, Yaso Tangbao gave me wonderful dining experience and food quality the SAME as I had in Shanghai. It absolutely worth the 4-hour drive from DC to enjoy the food. Recommended.", "author": "Shuo W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-05", "description": "I LOVE this place!! Nice decor and it's clean. You can watch the soup dumplings being made!                           We've ordered almost everything and they are amazing! The Braised Pork Meatball over rice is my favorite! Very juicy and soft! You can't find it elsewhere. I've tried many Chinese restaurants and the soup dumplings here are the best! I can't wait to go back soon. ;)", "author": "Claire W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-05-02", "description": "Not bad considering the location but how I wish they do more authentic dishes...!  The mapo tofu had no Sichuan numbing peppercorn powder and is just bland... Them seem to think that they need to cater to certain American taste but common! This is Brooklyn! People love authentic flavor!!", "author": "Nina K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-02", "description": "The soup dumplings were amazing... which is why I tore through two orders just for me! The only item I didn't like was the soy milk soup... which was suggested to me as an alternative to tea.  Perhaps if I'd been expecting a chunky soup I would have enjoyed it?", "author": "Carol F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-11", "description": "This place is all about the dumplings. Yes, the dumplings are a bit pricey, especially for a self serve place, but the atmosphere is actually pleasant and no servers means they don't have to be tipped. It's been a while since I had dumplings this good. We tried \"Blue Crab And Pork Soup\" and \"Pan Fried Pork Baos\". The soup and filling in both was very good. The dough was especially great in the latter and a bit rubbery in the former. They also had a special \"pig's foot\". How often do you get that?! It was delicious and very filling. None of my fellow eaters were cool enough to share my pig's foot and had ordered ribs and different noodles. Unfortunately, none were really impressed with their dishes. (Their verdict was not bad, but not great.) My verdict is that this place has its specialties and if you stick to them (and those specialties are your thing, of course), you'll probably be happy.", "author": "Aliz C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-06-22", "description": "Great soup dumplings (spicy pork) and held up really well on the 10-min walk home. Crispy noodle veggie dish had no flavor and was all book choy and soggy noodles. And charging extra for chili oil!?!", "author": "M. P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-02", "description": "Very tasty and quick.  I ordered the spareribs, which were excellent--marbled with fat (but rendered down) and they had a sweet and tangy sauce.  I also ordered the cucumbers which were nice and briney.  Finaly I had the crispy noodles and vegetables--fresh bok choy, mushrooms, etc.  No hassling with Chinatown and the food here tasted very authentic having been to Shanghai a few times for work.", "author": "Sean R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-22", "description": "Pretty good considering the neighborhood has very limited options for good Chinese food.  Shao Mai was weird, don't get it", "author": "April Y."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-11-03", "description": "My friend sent me here she was raving about it I value her opinion so I turned up for lunch. I had 4 dumplings - and a small soup. Both dishes were okay nothing to rave about and expensive for what I got. My main problem was with the staff: snooty- I asked how big the various dishes were and what they were and neither of the two women I asked were helpful - it's as if I should know even though this restaurant has only been open for a few weeks - I felt like I was bothering them. I work on Willoughby and my co workers were excited when I came into the office with the bag but they were all unimpressed by what I revealed. Shame because Downtown Brooklyn's lunch choices are so boring this place could have been the light I was looking for. I was put off by the people behind the counter making the dumplings were not wearing gloves. I won't be back.", "author": "Angela W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-23", "description": "This place is excellent. Fresh and delicious food with standard favorites and Shanghai specials. It's the real deal.", "author": "Brandon C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-04-01", "description": "Pretty good, but thought it would be even better given the hype.", "author": "Barbara B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-29", "description": "Excellent noodle spot! The spicy diced pork noodle soup was on the money! Going back there tomorrow! Only negative is you have to order online for pickup and delivery, no orders taken over the phone.", "author": "Ray C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-11-23", "description": "nice solid shanghainese restaurant in an interesting location in downtown brooklyn. the soup dumplings are probably the best item on their menu and their noodles are pretty decent too. minor ding - the plastic chinese spoons detract from the experience of the dumplings a bit.", "author": "Wesley H."}], "servesCuisine": "Shanghainese", "priceRange": "$11-30", "name": "Yaso Tangbao", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "148 Lawrence St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/n8qkl-utd4uCMlOy46G05g/ls.jpg", "@type": "Restaurant", "telephone": "+19293377599"}