{"aggregateRating": {"reviewCount": 704, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-05", "description": "I don't know why this place has less than 4 stars. I've been a few times because I worked across the street when they opened a few years ago, I now live in Downtown Brooklyn and have ordered takeout a few times and the only things I was disappointed in were dishes I was trying for the first time and just didn't have a taste for, not Yaso's fault. \n\nIt's also reasonably priced I mean if you look at my last take out order, I ordered a TON of food and almost half the cost was all taxes and fees!\n\nMy favorite things to order are the sweet and spicy pork dumpling jiaozi, ANYTHING  with the sweet and sour pork ribs, and the spicy pork soup dumplings. And with takeout, everything was still very hot, not soggy or anything. \n\nFully disagree with a lot of the more negative reviews on Yaso - my experience has always been positive :)", "author": "Samantha S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-05-25", "description": "Words can't Express how much I was looking forward to going to this place based on the reviews I had VERY  high expectations about my visit. Well boy was I wrong, I was hungry and in the mood for steamed dumplings and decided to give this place a try. \n\nI got there went to place my order then waited for my food. I did notice that alot of the workers in the back talking alot and not really getting the food out in a timely manner. Also people who ordered after me got their food before me. My food took approximately 45 minutes by the time I got my order the dumplings, short ribs and rice were all cold . This is by far the worst experience and they were not even apologetic about that. I was so disappointed. Don't know if i will give it a try again. If I'm going to spend money on cold food it might as well be ice cream.", "author": "Almaria B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-05-24", "description": "Man I really wanted to like this place but today was kinda the last straw for me \n\nIll keep it short and simple \n\nHipster Overpriced zero personality......\n\nthe fried chicken and rice was completely tasteless\n\nthe staff isnt welcoming at all .... \n\nyou will spend around 20$ for mediocre shanghainese food \n\nits better to go to next door and get a 7$ Chicken teriyaki meal", "author": "Andy L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-04-06", "description": "I continue to ponder why anyone would say this is \"legit\" Shanghainese street food..?  I've tried the Industry City location as well; that didn't go so well and after tasting what Yaso Tangbao has to offer here... I can LEGIT tell you - it's not on my list to eat here - ever again. \n\nI've tried their Xiao Long Bao before and I know for a fact it tastes like dried dough; so I skipped it.  I decided to try their steamed mini dumplings in a soy-chili oil sauce.  It's as good as the frozen packs but with a much cheaper price at my local J-Mart; 3 packs for $12. You can fancy it up with some chili oil mixing at home (cilantro, fresh chili, add chili oil and to be extra, add fresh minced garlic - some soy sauce).  Now you can sell it for $6 and make a killing.  My point is, the focus should be the dumplings... not the sauce.  Yaso Tangbao does the latter.  \n\nI also got their sticky rice dumpling; which is just gelatinous rice stuffed inside a wonton skin. This has absolutely no taste whatsoever. This is not food. This is laziness. This is not Shanghainese food. This is \"Gwai-Lo\" modified take-out junk. \n\nI do want to thank Yaso Tangbao for feeding me \"paper\" and giving me the excuse to trash everything; for I hate food waste. #crosscontaminationmuch", "author": "Karen Y."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-05-21", "description": "Went back today after a few years.  It doesn't seem as authentic and the prices have gone up.  Much less crowded than I remember.  There's always a reason...", "author": "Stuart B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-03-02", "description": "I came to Yaso Tangbao on a Saturday afternoon at 1pm. We came here deliberately with recommendation of a friend. We went to order on the iPad and it said all of the soup dumplings and dumplings were out of stock. Thinking it must be a mistake we asked the cashier and he said they were truly out of everything dumpling/bao related but we could come back and try again in about two hours. \n\nFor being the namesake of the restaurant and the signature dish during presumably a peak business hour this was truly a let down. We were recommended to try the xiao long bao soup dumplings by a friend, so we ate somewhere else, passed the time elsewhere and came back two hours later. \n\nWe ordered one order of pork and one order of crab XLB just to try. The soup dumplings were not hot as they should be, just rather warm. For taste they were definitely just okay. For price, they are significantly more expensive than soup dumplings in Chinatown. \n\nDefinitely save yourself the trip and if you want good Chinese food, go to Chinatown.", "author": "Amy F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-02-23", "description": "Yaso Tangbao's not a good representation of Shanghainese cuisine in my opinion, but it's a decent option in the area if you're opting for something a bit more \"adventurous\" (multiply those quotations by 10) than Americanized Chinese takeout.\n\nThe self-service kiosk makes things nice and convenient. Welcome to the 21st century, where robots are preferable to human beings. We ordered the chicken shumai dumplings, blue crab and pork soup dumplings, braised pork meatballs with egg and rice, and sweet and sour pork ribs over dry noodles with an extra braised pork meatball.\n\nGlad to have shumai I can actually eat, since those normally have shrimp and that's a no-go for me wanting to live, but each shumai was literally just chicken and sticky rice. It was too simple and missing that extra something reminiscent of the usual shumai. The soup dumplings were flatter than expected. While not on par with better ones I've had in Chinatown and Flushing, they temporarily satisfied my craving.\n\nThe pork meatballs were really tender and flavorful, so I'd recommend getting these. The ribs were glazed in a sticky sweet sauce. They were tasty and delightfully lean, though I would've preferred more tender meat. I would've also liked some sauce on my dry noodles. There was a bit from the ribs to mix in at the end, but adding some on top would've been even better.\n\nI will say that halfway in, my mouth started to suffer from salt overload. Prepare for plenty of water refills and don't overindulge here. Save it for the better-quality places.", "author": "Wendy W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-09", "description": "I'm obsessed with these soup dumplings!! The soup is flavorful and always nice and hot. The original pork are the best. Also try the buns, so good! This is a great lunch time or take out spot !", "author": "Carly G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-03-02", "description": "Came here at the recommendation from a friend from Shanghai really excited to eat some good soup dumplings. I came at 1pm on a Saturday afternoon and all of their soup dumplings and baos were out of stock.\n\nI think that's ridiculous for a restaurant called \"tangbao.\" The cashier did not say there were any extenuating circumstances which resulted in the outage and that they would have some in about 2 hours. My excitement quickly deflated and I left the restaurant to find somewhere else to eat.\n\nThis is not a review of the food, since I didn't have it, just of the restaurant in general.", "author": "Kevin H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-05-01", "description": "This place really fell off. When I used to intern in the area, a few years back, you could see the older workers making the dumplings. Now it seems the staff has been replaced with young people who slam down your meal and call the wrong numbers, as they laugh without apologizing. \n\nAlso, the price of dumplings are way overpriced but at least they used to be good. Now you get a mushy mess and wasted time. Avoid and go to any legit soup dumpling spot. This is fast food, chain shluck at best.", "author": "Ashley W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-02-19", "description": "I saw chicken soup dumplings and went in to try that. I am disappointed with soup dumplings here. Looking at it, it seems, mostly these are machine made. Skin is a lot thicker and the amount of soup inside is less. Also they don't provide chili oil. That is one thing I love with my dumpling. Spicy soup pork dumpling is good. It has chili oil inside the dumpling. Chicken soup dumplings and blue crab and pork dumplings were ok. Curry chicken pan fried baos were really tasty and flavorful. Chicken shao Mai was good too. This place looks modern, spacious and well maintained, unlike other dumpling places.", "author": "Sho R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-10-27", "description": "We came here per our friend's recommendation.\n\nShared the soup dumplings. \nspicy pork - this was the best dumpling they had. Liked the extra spice. \nchicken soup - menu says it has activated charcoal, but when we received it it was green? supposedly the menu is misleading, so I'd recommend that they change the pictures and menu. \nblue crab \u0026 pork soup dumpling - I personally couldn't really taste the blue crab so sticking with pork soup would have been sufficient. \n\nI also tried to order some pan fried/steamed baos, but they were completely sold out. This was a huge disappointment since it was like prime dinner time. \n\nWe also ordered the beef noodle soup. I thought it was decent, but I prefer thicker noodles. \n\nI liked that there was a self service option. Certainly a novelty, but not very user friendly either.", "author": "Edward W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-02-23", "description": "Yup, delivery is the way to go for this. \n\nOrdered the Braised Beef Noodle Soup with Poached Chinese Cabbage (N1, $12) and the Braised Pork Meatballs over Rice with Egg, Broccoli, Cabbage, Carrot, Zucchini, Corn, Baby Corn (R2, $12). \n\nTheir rice bowls are solid - I'd highly recommend those. The noodles left some to be desired. I think I found my new go-to delivery place in Brooklyn Heights for Chinese rice bowls, yum.", "author": "Judy S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-03-07", "description": "My friend described it to me on the walk there, and I was hungry and wanted it to be great. Despite having a great convo with that friend, the food wasn't great. At all.\n\nSpicy pork soup dumplings. Smaller than I'd ever seen. I figured, well that's their speedy style and it's only $3.95, sooooo.... But it wasn't very hot like I expected, the taste was meh, and the spice was harsh like it was injected last minute.\n\nSweet and Sour Pork Ribs Dry Noodles with an Extra Soy Glazed Egg. Ok. So the ribs had a nice sauce, but a couple pieces were tender, the rest were tough. The noodles had not enough sauce, and were buckwheat \u0026 thin like vermicelli. I expected thicker noodles because of the meat in the dish. All else was a sprinkle of peanuts and a pinch of green onion. My egg, I thought would be the highlight. Very overcooked. Brown externally like it was soaked in a soy mixture, but the yolk was so overcooked I had to leave half in the bowl and drink water to get down the half in my mouth. \n\nI also went to their condiment area and got some of their ginger dumpling sauce. Tasted ok, but made my face around my mouth tingle like I was allergic to something in it, which made me think I'd be traveling back to NJ with a swollen mouth, scaring little kids on the train. Ugh... anyway...\n\nGo to Chinatown for bao. Nice try y'all, but #NOPE.", "author": "Allison T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-25", "description": "I don't usually write reviews but I had to write this one. I went to the restaurant on Monday about noon time. The hospitality I received was amazing it was my first time there as well.. the young guy at the register was amazing to me and my friends. He looked like he was the manager because he was giving orders..the food was great I will definitely come back and also bring some friends with me. It was an pleasant experience.", "author": "Shorn B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-04-27", "description": "A simple self-order sit down restaurant that serves mediocre Shanghainese food. I ordered the pan fried pork dumpling and the sweet and sour pork over rice, the latter only because the beef noodle AND beef rice were out or stock. The food took around 15 mins to arrive, an above average wait for a relatively quiet noontime. The first thing I noticed was that the pan fried dumplings felt really hot, as if they came right from the pan! However they did not look like the authentic hand folded dumplings I was expecting from a restaurant that prides itself on selling Shanghainese street food. Biting into the dumpling was sadly disappointing too, it lacked the crisp of a properly pan fried bao, the skin was too thin so you couldn't appreciate any change in texture as you dig deeper, and the pork filling was this tiny ball that took at least 2 bites to get to, and often burst through the other side of the bao. A rather difficult eating experience and I've had my fair share of baos. \n\nThe sweet and sour pork was flavored well superficially, but way too overcooked and oily; I couldn't even finish the whole dish. I was filled after finishing as much as I could of my meal, which was freshly cooked and easy to order, but definitely did not feel satisfied with this new mildly mutated food baby in my tummy.", "author": "Dan J."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-10-23", "description": "Not really understanding all the great reviews this place is getting. I don't taste authentic shanghai cuisine...I really only taste fast-food quality chinese food. \n\nI was so hungry from not eating all day, and finally had time to stop by yaso tangbao at around 3:30pm. This was actually my 2nd visit here, and I don't remember it being so horrible the first time around... I ordered at the kiosk, which was pretty simple and waited for our food. We got the below to share:\n\nYaso Pork Soup Dumplings (4) $3.50\nThere were 3 of us, so we got 2 orders. These came lukewarm at best. The skin is super thick and there wasn't much soup inside.\n\nDrunken Chicken $5.95\nMy fiance ordered this - he says it tastes like this had been in the fridge for a very long time. He only made it through 2 pieces...\n\nBraised Beef Noodle Soup $11.95\nUgh this reminded me a lot of an instant ramen from Taiwan I used to eat all the time but tasted way worse - Kang Shi Fu Beef Noodle Soup, the ones that come with a packet of real beef (as an instant ramen, it's amazing tho!). Even looks like it! The vegetables were not really cooked nor flavored, tasted like those deli ramens where they just throw the vegetables in your bowl and dump soup on top. And since when did shanghainese places throw broccoli and corn in their beef noodle soups? The only good thing was the texture of the noodles, but i'm sure this was not made in-house.\n\nI expected better from all the hype!", "author": "Patricia C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-02-24", "description": "Not bad for a neighborhood soup dumpling joint but definitely doesn't ladder up to your Joe's Shanghai or another one of your better soup dumpling places.", "author": "Jane N."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-01-20", "description": "I noticed Yaso Tangbao on a spontaneous day trip to Brooklyn. I've never heard of the place before, but it seemed nice on the outside and the photos on the menu looked REALLY appetizing. Since it's around lunch time, I figured I got nothing to lose so in I went.\n\nI ordered the Spicy Pork Soup Dumplings as well as the Braised Beef Noodle Soup. The two came out to be around $17.50, which I'd say is on the pricier side. Normally, I wouldn't be able to finish an appetizer and main course by myself, but both of these were on the smaller side, so I had no trouble stuffing everything into my stomach.\n\nThe quality of the food was fine, but the flavor leaves something to be desired. The soup in the Spicy Pork Soup Dumplings were pretty bland (traditionally, they're supposed to be extremely rich) and most of the taste was dominated by the spice instead. The Braised Beef Noodle Soup had decent noodles, but the broth was as flavorless as the soup dumplings, so not a good dish overall.\n\nThe staff were nice, and the atmosphere was decent, too, which is why I'm giving this 3 stars. I can't see myself going back - I'd recommend a trek to Chinatown instead if you're craving some real Chinese food!", "author": "JB L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-02-03", "description": "Popped in here for a quick bite the other night, and decided to write a review since I certainly won't be coming back the foreseeable future.\n\nWe ordered the Blue Crab and Pork soup dumplings\nand the Sweet and Spicy Pork dumplings, both of which were very underwhelming. Freshness was lacking and each item tasted soggy. There was certainly no heavenly feel when gnawing into the soup dumplings that you would find at a quality establishment, and the meat itself had tough pieces throughout. \n\nOverall, it felt like there was a strong lack of care in the product that was put out. Not a cozy environment, either. Steer clear.", "author": "Rich B."}], "servesCuisine": "Shanghainese", "priceRange": "$11-30", "name": "Yaso Tangbao", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "148 Lawrence St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/n8qkl-utd4uCMlOy46G05g/ls.jpg", "@type": "Restaurant", "telephone": "+19293377599"}