{"aggregateRating": {"reviewCount": 704, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-29", "description": "I like this place but it's a little too expensive for what it is. It's a bit awkward for the sizes too. For example, I would like to get a couple soup dumplings but then I have to buy 4 for almost $7. And then that sort of becomes the entire meal, which isn't enough and only one food. so I have to order something else, but then the total meal comes closer to $20 and then it's too much food. It would be great if I could ideally do a value meal or something and do two dumpling add on to an entree.", "author": "Adelyn Z."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-05-19", "description": "After perusing yelp pictures and reviews, i dragged 3 hungry pals here to sample their dumplings and buns. the star of the meal was the soup dumpling (among a sea of buns, pork ribs, garlic noodles, veg dumplings). if I could do it again, i'd stick to those. great option for lunch in the area- quick service, and very chipotle-esque space.", "author": "Steph G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-11", "description": "Very much enjoyed both the food and service here on a Tuesday afternoon for lunch. Met up with Hubby and 1 year old and snagged one half of a communal table to share our treats. We had the sticky rice, the spicy diced pork noodle soup, and the tomato soup. Everything was cooked perfectly and the workers were super nice to our kid. Would come back to try more of their dishes in the future!", "author": "Tiffany L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-05-27", "description": "The food is decent but not amazing. If you're craving Xiao long bao it'll still satisfy your craving though. I tried the crab soup dumplings, sticky rice shumai and drunken chicken. I think out of everything my favorite was the sticky rice shumai.", "author": "Julia L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-13", "description": "The restaurant just open not long ago And the food are very good and tasty. The environment are clean. I think I will go to try it , again.", "author": "William C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-09-12", "description": "Been a couple of times now. First time was fine, nothing earth shattering. Second time today at 6pm, with not very many people there. Somehow it took them 20 minutes to serve up soup dumplings and some ribs that were pre cooked. Not sure I'd come back if hungry again. Kitchen seemed disorganized and orders were being screwed up left and right. I'll head to Chinatown for my next soup dumpling fix. Quite disappointed. Street food should not take 20 minutes to serve unless you're slammed at lunch.", "author": "Wade B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-28", "description": "If you have 20 extra minutes, take the subway and visit Chinatown instead as it's cheaper and there are bigger portions.  Otherwise this place is pretty solid for some Shanghai cuisine.  Recommend take out as tables weren't cleaned very often.", "author": "Albert W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-28", "description": "Waw. My mind was blown away... I can't believe I've been searching for some good old Shanghaiese pan-fried pork dumplings (Shen Jian Bao) in the US and I found them in Brooklyn/NY!!! I wish they could open one in San Francisco!!! It's $5-6 per portion with 4 buns. The bun's size and texture was just right, once u take the first bite, there is no super hot soup running out and burn your tongue, but a nice juicy pork filling with the right temperature. I love how they fried the bottom - it's not over cooked or burnt. It's crispy but not flaky. I enjoyed every single bite of it! Hao chi!!!", "author": "Shaz L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-25", "description": "Yaso Tangbao is fun and trendy Shanghainese spot. The pork soup dumplings and fried pork baos are homemade, fresh, juicy and flavorful. Although it's an order-at-the counter restaurant, the presentation of the food is nice despite the fast-food concept. The size of the buns and pork dumplings is definitely filling. If you're wanting to stay in Brooklyn, this place is a good alternative to Chinatown.", "author": "Rebecca L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-12-09", "description": "The soup dumplings and similar (shengjian bao) are very good in an underserved part of town. Many of the other items are almost shockingly bad: kaofu way too sweet, cucumber salad that had clearly been sitting around for a long time, cheese soup dumplings (okay, an obvious risk, maybe I have only myself to blame) nightmareish. Not cheap either.\n\n4 stars for soup dumplings, 1 star for everything else.", "author": "Michael B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-03", "description": "Best Chinese food in nyc! We've travelled all over the world and this us just like in shanghai if not better... it's clean, fast, and great service too. Make sure to double up on soup dumplings and pork ribs! We just hope they open more locations :)", "author": "Mosh E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-03", "description": "This has become a regular since we moved into the neighborhood a couple weeks ago. \n\nThe food has always been good and tasty and quick which is awesome. It's also not expensive for the quality which I definitely like. \n\nThe only thing is that service is not awesome and if you order online, be ready for it to be a couple minutes late.", "author": "Deborah L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-08", "description": "The xiao long baos here are huge and delicious! Got the original pork dumpling and the spicy pork dumpling. Both are great and the spicy is the perfect amount of spice. The great thing is, you can watch them make these XLB's from scratch as they have a room on the right with glass walls so you can watch them prepare them as your wait for your order to be ready. You walk up to the counter and place your order and sit where you want. They will call your number and you just walk up to the counter to pick up your order. They also have a water dispenser on the right with water cups so you can get water as you please. I recommend!", "author": "Ally T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-20", "description": "Was in the area for work and decided to stop by this spot for a little lunch.  I'm not mad with my decision.\n\nCool space with big communal tables and hip modern decor.  I asked the young lady at the counter for some advice on what to order and she covered a good portion of the menu without being overly wordy.\n\nI went with the fried dumplings and sticky pork ribs.  The dumplings were tasty: great contrast of textures and a rich flavor that wasn't overbearing.  The ribs took a little while to arrive, so they gave me a couple extra ribs.  I wasn't expecting them to do something like that, so a pleasant suprise.  The ribs were good, but not the greatest I've ever had.\n\nOverall a good lunch experience, if not life-changing. I would come back if I was in the area and craving some dump-dumps.", "author": "Dylan C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-12", "description": "Blue Crab \u0026 Pork soup dumplings, Spicy dumplings, green cucumber salad.  Delicious.", "author": "Dick W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-18", "description": "Great casual spot for good soup dumplings and other snacks.  The place has 0 ambiance, which is too bad--the same menu in a nicer spot could be a great date restaurant.  Unfortunately, with it's fountain soda, lack of waiter service, and fast food feel, this is a lunch spot or quick casual meal only.  That said, I love the soup dumplings and ribs.  \n\nOne request would be to get 6 soup dumplings instead of 4 with the order.  For 2 people, you are going to end up wanting 2 orders because 2 isn't enough (that said 4 is a bit too much).", "author": "Ian A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-18", "description": "I walked in on a rainy day and I was glad I did. They have a pretty decent menu in terms of size and variety. They have delicious dumplings of which I tried the crab and pork, traditional pork, sticky rice shumai, and fried pork. They also have soups which I will try the next time I come in as they looked delicious. I also got the garlic fried rice which was great. All in all, it cost me around $30 which is honestly not bad as I was really really full and didn't eat again the rest of the day. I could have done with maybe 2 items and spent around 10-12 bucks.", "author": "Arthur V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-28", "description": "Finally! A place to get legit Chinese food without getting on a train. Not to mention the fact that soup dumplings are involved!\n\nMy husband and I ordered 2 trays of crab/pork soup dumplings, fried pork buns, and the mapo tofu with egg over rice. All of them taste exactly how they should and comparable to what you could get in Chinatown! Soup dumplings are juicy and the skin is perfect. Mapo tofu is great but could benefit from having a runny egg vs. a fried egg wth hard yolk. The place itself is super clean and modern, can accommodate big groups, and the staff is young and friendly. There's even an all you can drink soda dispenser, which is sort of my weakness in life.\n\nThe only drawback is that all dishes are 1.5 times the price of what they really should be (or I am accustom to paying for this type of food). Regardless, I'll be back!", "author": "Crys Y."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-22", "description": "Probably best soup dumpling place I've had in NYC so far; only con is a bit pricey compared to other shanghai eats.", "author": "Chi Chiu L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-06-26", "description": "First time visit. This was not bad but also not great. Nothing special about the xlb or beef noodle soup with better and cheaper alternatives in Manhattan.\n\nXLB was soupy. Crab and pork was ok. The dough was plain. Ginger in the sauce was fresh although there were only two strands. Order comes with four.\n\nBeef noodle soup was quite disappointing. For $12, the portion was small, beef was overcooked, noodles undercooked. The vegetables were good although only a stalk of bok choy and I think was napa. Pickled veggies was good. Soup was good but didn't taste like normal beef noodle soup. You can get way better ramen noodles for around the same price.\n\nI would give the place another try if the opportunity came up but I've only started exploring Brooklyn so very unlikely. Next time if like to try the mapo tofu.\n\nPlace is super clean. Service was ok.", "author": "Douglas L."}], "servesCuisine": "Shanghainese", "priceRange": "$11-30", "name": "Yaso Tangbao", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "148 Lawrence St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/n8qkl-utd4uCMlOy46G05g/ls.jpg", "@type": "Restaurant", "telephone": "+19293377599"}