{"aggregateRating": {"reviewCount": 704, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-06", "description": "Cute Dumpling Shop in the middle of Downtown Brooklyn. \ncrab \u0026 pork dumplings: It comes in 4 for about 7$\nRibs: decent portion for about $7\n\nThe food was really good but it is very pricey. Also, it was a really long wait for my crab dumplings.", "author": "Natasha P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-26", "description": "It may not be the most authentic Shanghai Street food but it is still a tasty fix for your bao and noodle soup craving! Easy to order and fast.", "author": "Elliott W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-11-23", "description": "I love the food here  (got the spare ribs) it wasn't too salty and I felt healthy eating it.  GF on the other hand felt that her meal was plain (simple vegetarian option).  I highly recommend getting some of the dumplings.", "author": "Elliot R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-11-03", "description": "Didn't expect a self service dining place.  It actually worked out well for ppl for who want simple and straightforward experience.  I like the ordering machine on the side so you can take time to place an order. Food is prepared fast. 6-7 minute my number was called. My meatball were delicious and my  xiaolongbao was not bad, for a person that both food are local. I do like the concept that make xiaolongbao a tapa/side dish size because most of the places offer 6-8 pierces.  The size is too big for a person, that will me too much fat from the soup for one meal.", "author": "Janet H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-09-22", "description": "Very mediocre, fast-food style shanghainese food. The noodles were clearly out of a box and topped with frozen veggies from one of those variety grocery store bags. Soup dumplings were also nothing to write home about and came out lukewarm. Definitely not worth the price or the hype.", "author": "Kathy L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-10-21", "description": "Not to say their food isn't good.  I've eAten there multiple times.   I'm here Bc I placed an order on grub hub. I waited nearly 2 hrs n 30 mins just to find out when I called they said my food was still there.  the staff tells me he'll call me back when they find out where their 3rd party delivery drivers are.  2 mins go by and I receive a cancelled notifcation.  Gj asshole, your customer service is hot garbage.   Been eating there for 2 yrs now.  Really disappointed in how they treat customers.", "author": "Michael L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-08", "description": "Excellent food, great variety. \n\nOrder from them on Caviar for delivery regularly.\n\nFavorite food items are the meatballs, ribs, and pan fried buns. Also a huge fan of the dumplings in soup. \n\nUsually only order the soup dumplings in store since they don't transport as well as other items, but have ordered them for delivery now and then when pining for them.", "author": "Jacob C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-14", "description": "Still thinking about this place. Something about it is very satisfying. I was just talking about it and trying to describe it. Perhaps it was a good night, but it was very very good.", "author": "Paul C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-11-15", "description": "You order from an order kiosk. The soup dumplings are a 4/5. It has a thin skin with a lot of soup inside. The skin sticks and easily rip when picked up. I recommend either a piece of vegetable to separate the dumplings or more space between them. The filling was average. \n\nThe chicken cutlet noodle soup was a 3/5. The soup was chicken broth. The noodles were thin flour noodle. The chicken cutlet and veggies were good. There should ve an option to have the chicken cutlet separate so it doesn't get soggy when eating it.", "author": "Steve F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-30", "description": "Finally a fast casual restaurant with pretty authentic Shanghainese food in Downtown BK. It's nice not having to trek to Chinatown or Flushing.", "author": "Brea T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-02", "description": "Helped a friend moved to downtown Brooklyn today and was searching for lunch. Stubbled upon this place and we loved it! It is like Xi'an Famous Food but Shanghainess. You order at the counter with menus on the wall and pick up for to stay or to go. We got a couple different things to share and were satisfied with the meal.\n\nWe shared the XLB, drunken chicken and sweet and sour pork ribs. The XLB were very good. Not as oily as many other places. The skin was thin but did not break easily. Every little one had plenty of soup in them. The drunken chicken was served cold and super refreshing. It was a bit salty to our taste but in all very tender and you can taste the rice wine. The sweet and sour pork ribs are also great with just a little bit tang. It is sweet just as most Shanghainess dish should be.\n\nMy friend got the braised beef noodle soup and he like the chew of the noodle and the flavor of the soup. I got the braised pork meatballs over rice and it was really yummy. The meatballs are so soft and flavorful it falls apart as soon as you bite into it. It went really well with the rice and it came with a lot of veggies and a fried egg. \n\nPrice is also affordable given the smaller size of the dish. You can definitely try and sample a couple without breaking your bank. Great if you want some authentic bites when you are in the neighborhood.", "author": "Nancy N."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-02-23", "description": "You finally reopened after a month of undergoing renovations and you have disappointed me with your portions and prices. \n\nYou raised your prices yet decreased the portion sizes. C'mon...I'm pretty sure you guys are making money because you just opened 2 other locations. Please don't skimp out on the portions if you are going to raise your prices.\n\nThat sauce container is sad as also the nonexistent veggies that are suppose to come along with the dish. It felt like I was eating dry fried chicken with just white rice. Absolutely no flavor at all. \n\nI'm so disappointed and won't be returning any time soon.", "author": "Laura C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-18", "description": "I had this place bookmarked for awhile and just found out my friend lives nearby, so we decided to eat at this place to catch up. Whooo!! Only 3 stops away from me to visit my friends and eat these little cuties.\n\nGo up to the counter to check out the menu with pictures on the wall and order. You'll be given a number which they'll call so you can pick it up. Seating is communal. It was a bit hard trying to find space for 6 people to sit at bc single/couple customers sat at the longer tables, but we managed to squish in and were cozy with one another.\n\nORDER\n- Xiao long bao: comes in four's and costs around $5 or more depending on the variation (pork, pork \u0026 crab, spicy). Size was perfect. Skin is a bit on the thicker side, but the soup stays intact and is clean tasting. The soup broths in the chinatown xlb usually have so much MSG that I have a weird film coating on my tongue or aftertaste after eating them. These DO NOT.\n- Pan fried pork dumpling: nice crust on the bottom and lotsa sesame sprinkled on top.\n- Fried chicken noodle soup noodle: Bf wanted to try this. I'm not fond of mixing fried food with something wet like soup bc it defeats the purpose of eating something crispy. It just gets soggy, duh. I did nab some mushrooms and broccoli from him. Bf is excited to come back and try the other noodle dishes.\n\nOverall, the experience was pretty good, especially with great company. One complaint was the dipping dishes. They have tiny pastic cups where you can fill up with soy sauce, vinegar, and sriracha where the soda machine is. I usually set my dumpling in a bath, but here I could barely fit the dumpling on the spoon to let it rest in my makeshift vinegar bath that I carefully poured onto the spoon. I'm very precisional in my eating and don't make a lot of mess, unlike the bf, so I can definitely see many people struggling to eat with the tiny dipping dishes.\n\nAnd after your 10th visit of ordering more than $6, you get a free order of XLB on your next visit. So remember what phone number you give them to rack up visits.", "author": "Nicole T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-24", "description": "The Brooklynites of this neighborhood should considered themselves very lucky. The soup dumplings here rival the ones in Chinatown. The skin is just thick enough to hold in the juices and the juices are a-flowing. It's just enough porky fatty goodness with a hint of sweetness. It's magical and with a drop of vinegar and ginger, you are in pork heaven. \n\nThe real star here though is the  pan fried buns..this suckers are my fav. These little pillows of goodness will blow your mind. The bottoms are crisp and the buns are soft and tender. The meat is nicely flavored but wait there is some soup in the buns as well. Be careful, if you bite it the wrong way, you will squirt out the soup. Don't be that person. \n\nThe menu is quite impressive and extensive. The bok choy shouldn't be overlooked. It's garlicky and crisp. It would benefit us all to eat some greens. It's heavy hand on the oil but at least it's some vegetables. The ribs are so tender and are sweet and savory. They go nicely with a bowl of rice. The whole meal was delicious and no, it's not as cheap as Chinatown but it's also not as far.", "author": "Eve C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-12-01", "description": "It's a decent neighborhood spot. But I wouldn't travel to get food from the location. Can satisfy a soup dumpling craving if you're not going to queens.", "author": "Julia R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-05", "description": "Probably the best Chinese (Shanghainese) option in all of downtown Brooklyn/Brooklyn Heights.  I know that doesn't really say much, but it was genuinely good as well as surprisingly quick.  \n\nSure, the prices may not be as low as those found in Chinatown, but they seemed a good deal for the neighborhood.  I tried the soy garlic noodle with pork, and the pork and crab soup dumplings.  The noodles were nice and flavorful, with bits of peanut and cilantro. Soup dumplings were very tasty. although the skin seemed to break easily.  Two of the dumplings were already leaking soup before I started on them.  The filling was equal parts crabby and porky, and easily rivaled some of those I had in Shanghai.  \n\nDefinitely a destination when in the food desert of downtown Brooklyn /Brooklyn heights.", "author": "Kayo N."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-18", "description": "I loved them for awhile, to the point where I ordered from here at least once a week. However they have been changing some of the ingredients that go into the soup noodle dishes.  Why did you guys veer away from the chinese vegetables that were originally in the soup noodles? I miss them....now it's either cabbage or lame veggies such as carrots and broccoli. \n\nAlso they took away the tomato soup that was delicious too, I'm a bit bummed about that. \n\nAlso, $7.99 delivery charge via Caviar? C'mon.", "author": "Jen L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-09-14", "description": "Speaking from a Shanghainese perspective, this place is sub-par. But in terms of grab and go, the food is not that bad. I appreciate how they refrain from calling their baos, soup dumpling vs. xiao long baos (all the other Shanghainese restaurants in the city serves soup dumplings btw). The noodles I have a problem with though, their more along the lines of spaghetti than shanghainese noodles. Besides that, edible.", "author": "Stephen W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-05", "description": "It smells like ass in here.  It's possible a homeless dude just left or something but it's certainly off putting and there are flies buzzing around the dining room.  The food was delicious though.", "author": "Kelly S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-07", "description": "I wish I lived around the corner so I could eat here all the time.\n\nI really enjoyed the food.\n\nThe people are nice.\n\nThe food selection is great.", "author": "Clint B."}], "servesCuisine": "Shanghainese", "priceRange": "$11-30", "name": "Yaso Tangbao", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "148 Lawrence St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/n8qkl-utd4uCMlOy46G05g/ls.jpg", "@type": "Restaurant", "telephone": "+19293377599"}