{"aggregateRating": {"reviewCount": 704, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-27", "description": "Good is amazing.  So happy I found this restaurant.   Definitely apart of my lunchtime rotation.", "author": "Paul F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-26", "description": "Good staple xiaolongbao in Brooklyn. The layout makes me think \"chipotle for Shanghainese food\": think wooden benches behind a metallic counter that serves in turn of order time. I love the transparent kitchen that allows you to watch the chefs folding and steaming the bao. \n\nI wasn't sure what to expect since it was my first time there but if I were to go again I would only order the XLB. I had ordered a variety of dishes and was honestly not as big a fan of the other items on the menu (noodles, pan fried buns etc). The noodles were kind of bland and he pan fried buns too doughy. That being said the xiaolongbao was juicy and delicious. I highly recommend if you decide to stop by.", "author": "Anny Z."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-02", "description": "You get the \"Xi An\" feel once you step into this place. Blasting pop music along with staff wearing their caps. You would think wait is this one of their branches. Walk all the way in and you'll see a large menu-board to your left with picture and prices on them. Once you are ready step up to the cashier and order. Make sure to keep your receipt for the food and the bathroom code. \n\nThere are condiments to the right. All utensils, sauces, plates, napkins and tap water are all located in that one section.  I'm surprise to see a jug of vinegar and soy sauce. This is a self service restaurant, so once you order your food find a seat and wait for your number to be called. There are plenty of seatings on a Sunday evenings. Food came out fairly quick. We got the: \n\nBraised beef noodle soup: ($11.95) the beef was cut up into small bites, wished that it was larger chunks, can't really taste the flavor in it. Came with yau Choy vegetables in which they gave only the stem. What happen to the full veggie? Prefers some people don't like the end piece. Overpriced for a noodle soup. I can get the same thing in manhattan's Chinatown for half the price and better quality. \n\nPork Mapo Tofu with egg over rice: ($9.65) too much sauce lead the dish to become overly salty. Not enough ground pork. \n\nBlue crab \u0026 pork dumplings: ($6.95) the soup dumplings was okay. I had better. \n\nAfter my meal, I really needed soda to wash everything down, as the saltiness of the food still clings to my mouth.", "author": "Carmen L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-03", "description": "I don't care what people say, Yaso Tangbao has my favorite soup dumplings. I've sat in the restaurant and ordered in. I prefer the restaurant because you get everything fresh but when you order, it does come pretty fast. \n\nYou definitely need to get an order of the pork soup dumplings and the spicy soup dumplings. The spicy pork are my favorite. The soup dumplings here have a thicker skin compared to other ones I have which I actually like. The pan fried baos are also a winner in my book and are crispy on the outside and doughy on the inside. Their fried rice is okay but not the reason why you come here. Finally I always get an order of their seasonal greens. They are really my favorite to go with the soup dumplings and I honestly feel healthier when I get them.", "author": "Lateefah M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-04-12", "description": "I used to come to this place before the buyout/shake shack esk remodel of this place. HOW ARE YOU OUT OF a soup dumplings at 2:40pm? On a weekday. So we got the spicy ones. There's a horrible loud over the music even beeping from the open kitchen that keeps happening. \n\nThe dumplings skin was so thin. I also wouldn't even call them soup dumplings at all. The entire staff has changed. I wouldn't call it friendly. I will not be coming back. Truly sad because this place was great. Close to home. Now I will just go to Chinatown. Don't wast any nostalgia on this place. It's not what it was.", "author": "Sarah E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-18", "description": "My husband and I decided to venture out to this dumpling spot in the heart of Downtown Brooklyn to give it a try. We parked our car in SoHo and took the train here because of the difficulty finding parking. The restaurant was designed with a cafeteria feel with bench seating where you order at the cashier and then they call your number to pick up your food. The menu was on the wall with pictures of the food, which makes it more helpful/ somewhat easier to order. The self-service concept was different/ nice especially at a soup dumpling place and it was a cost effective price although it is slightly more than Chinatown and Flushing prices. \n\nThere is a self-serve station for sauces, utensils, cups and water so it makes it more convenient for all their customers. We ordered the spicy pork soup dumplings (4 for $6), blue crab \u0026 pork soup dumplings (4 for $7) and pan fried pork baos (4 for $6). The food didn't take long to come out, maybe about 10 minutes or so. All the food tasted decent but it didn't wow me like other Shanghai spots that we ate at in our past food escapades. The spicy pork dumplings (w/ Old Bay seasoning) had a kick to them and I wasn't a fan of the pork baos, they were too thick/ doughy for my liking. We may eat here again whenever we come to this area to do some shopping.", "author": "Cecilia T."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-14", "description": "Worst Dim Sum I've ever had.\nAlso had hair in the food.", "author": "Jenn K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-28", "description": "Good noodle and dumpling spot in Downtown Brooklyn close to many subway stops. The soup dumplings are a staple and if you live in the area, a short walk away instead of having to head to flushing. The soups here are also good and there is plenty of heat the spicy dishes. \n\nThe ambiance inside is very causal with stools and low tables in the center and bar type seating elsewhere. In the winter the door opens constantly at peak times so the seats near the door get chilly. I have yet to try take out but am anxious to see how the soup dumplings hold up !", "author": "Allie B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-10", "description": "Ah yes this is exactly what we needed for a cold day. Love the casual ambiance of order. Even though it was just two of us, we ordered quite a bit of food so we could try as much as we could. My favorite was definitively the chicken curry we ordered. I don't like spicy food but tried the spicy dumplings and they were hardly spicy at all. I was very excited for the soup dumplings but they ended up being okay. Which I was surprised about because it was definitely their most popular item. We had to wait much longer for those than anything else. The skin was white thick and not as light as they should be. Would definitely stick the the over rice dishes. Would come again and order take out all the time.", "author": "Brittany N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-23", "description": "I really like the concept of this restaurant . They have multiple tables that run the width of the room for people to share seating with. You place and pick up your order at the register , but the rest of your dining experience is pretty much self service. Everything from water to utensils and sauces can be found on a high top table along the wall. Pricing is very reasonable which makes his a great option multiple times a week. I have tried both the spicy pork soup dumplings and the pork/crab combo soup dumplings. The spicy pork ones were amazing!", "author": "Kevin R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-13", "description": "We were surprised to find a Shanghainese soup dumpling spot in downtown Brooklyn.  Yaso Tongbao also left us utterly speechless when we walked in to discover its modern ambience, comprised of long wooden dining tables, cool lamp fixtures and a mixture of brick and wooden walls.  The concept is almost fast food-like; you walk in to the cashier, order and pay for your food, grab a seat and wait for your number to be called.\n\nWe ordered the spicy pork soup dumplings, blue crab and pork soup dumplings, pan fried pork baos, spicy cabbage salad and wine chicken. They mistakenly gave us the cucumbers instead of the cabbage, but we ignored the error and quite enjoyed our pickled cucumbers.  The soup dumplings were shockingly tasty - thin dough, flavorful soup filling and a decent chunk of marinated meat.  The spicy pork one was prettttty spicy - so beware!  My only complaint is they only offered 4 dumplings per steamer ... and $5-$6+ for a tray is overpriced!  Besides that, the food was delicious. My favorite dish was probably the pan fried baos - crispy bottom with savory meat and thin dough.  I'd definitely return for more!", "author": "Maggie L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-18", "description": "Good dumplings, but the value is questionable as I cannot justify $6 for only four small dumplings.\n\nWe got the Yaso Pork Soup Dumplings ($3.50), Chicken Soup Dumplings with Activated Charcoal ($3.95), and Signature Chicken Shao Mai ($5.95). The soup in the dumplings were tasty (and even better, they were hot without burning your tongue), as was the shao mai. However, being from California, I've been to too many places with the same quality for less of the price, though I'm not sure if Brooklyn locals would say the same. The place itself is cute and spacious, and we did not have to wait in line on the Monday of MLK Weekend.", "author": "Lily L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-04-12", "description": "This restaurant definitely hit the spot however the food was only okay. We are vegetarian and they messed up the order of R3 and brought out the meat option instead which we had to send back, hopefully not wasting the meat. It also had SO much rice. The steamed buns were tasty and the fried dough was extremely gluttonous but still very good. Enjoyed but will not be returning.", "author": "Miranda P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-16", "description": "Cute add to the area and a nice change of pace from the bodegas and fast food abundant strip, and serving up Shanghai street food. There are 4 vegetarian options here: vegetarian steamed dumplings, fried rice, a noodle soup and entree N8. Crispy noodles with vegetables. \n\nI found the dumplings missing that burst of flavor and the dough a bit too heavy and overpowering the filling. The fried rice is tasty but has been salty on the last two occasions. \n\nN8 seems to be my dish since I'm a sucker for crispy noodles. The first time around ordering it, I found it too salty and drowning in sauce and losing all of that crispy noodle goodness. I did want to give it a second try, so I ordered it on my recent visit and asked them to separate the sauce from the noodles leaving me room to control the sauce to noodle ratio. It was so much better. I used less than half of the sauce and it makes for a dish true to the name, crispy!", "author": "Racquel B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-01-26", "description": "Probably the most shockingly bad meal I've had in a long time. The braised beef bowl w/ rice was poorly presented (esp in comparison with their photo) and basically cost $13 for a majority of rice. Greasy and gross. Avoid.", "author": "Christopher C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-03-17", "description": "Finding decent grub in the Fulton Mall area is a practical joke. I had a craving for dumplings and all roads led here. My intestines are growling in disappointment. \n\nI had a few other options in this neighborhood. The Mediterranean Grill or McDonalds. I decided to try something new and curiosity failed me. I decided on the Yaso pork soup dumplings and Wonton soup. Unlike Chinatown or flushing, the prices are geographically inflated. $1.00 each for a weak dumpling ? The Yaso soup dumplings were a disappointment. Very flat. I'm not sure where the pork was.... The positive was that these dumplings were made in front of me and took more than enough time for them to be so wack. The Vinegar paired nicely with them but they just didn't taste good. The soup was comparable to the dumpling being filled with water. Lackluster. The wontons in my soup broth were much tastier than the soup dumpling. \n\nThere was a large crowd of American teens seated behind me that seemed to be enjoying their meal but their palettes have not matured as yet. Maybe this may be a preview of who their regular customers are. \n\nI'll be sure to visit the mall in flushing for some real flavor and more affordable prices.", "author": "Marissa M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-16", "description": "The soup dumplings are pretty good and feels like they're slightly bigger in size. The only downside is they're a bit more pricey for only 4 pieces as opposed to the usually 6 or 8 pieces you can get at other shanghai restaurants in Chinatown. \n\nI've tried the noodle soup here also and they're a good portioned size. The drunken chicken here is deboned which makes it easier to eat.", "author": "Tina W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-01-29", "description": "Just got the most disgusting tofu, soggy and tastes like it's been sitting for hours, maybe days? This place use to be excellent, and the do still have great food but it feels more hit or miss now. Not to mention they got rid of their hot and sour soup which was amazing. The soy garlic rice is very strong but the portion is huge.", "author": "Katherine O."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-05-24", "description": "The quality of the food is very low. I ordered soup dumplings and the sweat and spicy dumplings both with pork. The pork stuffing was very bland and the paste like consistency was unappealing. The broth in the soup dumplings was extremely oily and the sweat and spicy souse was too salty and overpowering. \n\nOn the other hand, the place was very clean and I liked the automated ordering system where each customer can self order. The food was ready very quickly. Unfortunately this is not enough to entice me to come back.", "author": "Boyana M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-24", "description": "The XLBs here are the real deal my friends. Expensive, yes. But worth it. The skin is thin and light and the soup flavor is rich and umami-licious. The beef noodle soup here is also legit - one bite and the beef falls apart in your mouth. The chili wontons here are also on point -- the wrappers weren't too thick and the slight sweet and decently hot sauce on top were excellent. \nThe shu-mai here is worth trying too if you like the Shanghai style shu mai: stuffed with sticky rice and bits of chinese sausage (unlike the more prevalent Canto style filled with pork). \n\nI was a bit disappointed by the wonton soup and the pan fried pork buns (sheng jiang mantou) -- unlike the ones you  might find in Flushing or Shanghai, the soup inside these were minuscule and weak. The wonton soup had 4 measly wontons - and they were too heavy on the wrapper. I thought the broth was nice and light, but some think it might be heavy on the MSG. \n\nAs others have mentioned, the space is self-serve (which I like -- less fuss). But not sure why the prices are so high given the self-serve nature. Maybe it's the downtown Brooklyn real estate. I also found how everything is served in plastic or paper bowls/plates a bit strange and wasteful/unecofriendly. But maybe it saves time - no dishwashing needed and XLBs get pumped out faster.", "author": "Jen H."}], "servesCuisine": "Shanghainese", "priceRange": "$11-30", "name": "Yaso Tangbao", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "148 Lawrence St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/n8qkl-utd4uCMlOy46G05g/ls.jpg", "@type": "Restaurant", "telephone": "+19293377599"}