{"aggregateRating": {"reviewCount": 704, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2019-05-08", "description": "Eh...basic Japanese noodle fair.  It does the trick but go to Chinatown if you can. It reminds me of mall food...think sbarro pizza but Japan style.  I think the soup dumplings are frozen.  The sit down area was nice and clean.", "author": "Tracey H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-11-04", "description": "I walked in optimistic but pretty disappointed that their food is good enough to curb my hunger tonight but not tasty enough for me to ever crave it.\n\nI honestly would have rated them 3 stars but after scanning the area and noticed tables are dirty and the self-service area (where they have the chopsticks, fork, spoons, napkins, etc) needed a clean rag and sanitizer I thought three is too high. I think to add insult to injury the gentleman manning the register did not even bother smiling no matter how many times I smiled and was polite at him. LOL! He was seriously (no pun intended) lacking customer service.", "author": "Darla W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-03-04", "description": "This place having 4 stars is baffling, so not good ! Really low quality and the taste was not impressive. We tried a number of dishes and they where all underwhelming. Much better options !", "author": "Daniel R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-06-08", "description": "Overpriced! I came here right before classes started with a friend to catch a bite, the decor is nice and modern, and i liked that its a service yourself type of joint but the prices for the soup dumplings and the spicy wonton and noodles are definitely above my pay grade. I couldn't justify spending $12 for a tiny noodle soup so I ended up going with the spicy wonton... they were okay but not worth the price i paid and the soup dumplings were mediocre.", "author": "Annie N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-17", "description": "This place is pretty good, but they don't have a ton of vegetarian options for how large their menu is. They have a soup with kao fu (wheat gluten), but I'm pretty sure it has meat stock in it as it's not marked with the \"V\" that the other vegetarian items on the menu are.  \nThey have a nice little bar with soy sauce, ginger vinegar and sriracha to spice up your dish. \nI go to Yaso Tangbao with my co-workers for lunch and they all really enjoy the soup dumplings.  They seem a little tricky to eat, but have gotten rave reviews.  They do have vegetable baos, which are sort of like dumplings, but more bready.  They are pretty tasty, but one order isn't enough to fill you up for lunch so you need to get another side or order of noodles to go with them in order to make it a meal.  Doing that wouldn't be so bad, but that kicks up your bill quite a bit.", "author": "Liz F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-03", "description": "I cannot imagine a more perfect food than a soup dumpling. A spherical,  juicy  meatball surrounded by steaming hot  broth and  encased within a delicate thin pastry . Whoever invented this dish is a genius. \nImagine my happiness when learning that soup dumplings had arrived in downtown Brooklyn! WhoooooHoooo! But could these dumplings live up to my high expectations especially after having had the real deal in Shanghai ??\nThe answer was a resounding Yes!!!!! \nMy family and I enjoyed every single bite of these delicious umami filled jewels and were fighting for the very  last one . \nOther dishes we tried :\nCold noodle dish - springy and well seasoned \nMarinated cold cucumber dish - tasty but nothing special\nFried pork buns - whoah this dish totally swept me off my feet in an  unexpected way . I'm not a big pork eater but this dish was something else. I simply can't describe it . \nJust go eat some - NOW!", "author": "Wenn S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-10-10", "description": "I love Shanghainese food and have visited Shanghai many times within the past 3 years, so I came into Yaso Tangbao with high hopes. I didn't dine in the store, but rather did carry-out so that may have had something to do with the mediocrity of the food. I would recommend Yaso Tangbao to people who are seeking \"healthy\" Chinese food - oil and grease are minimal, and overall the meals felt very \"clean.\" \n\nI ordered the Braised Beef Noodle Soup and the dumpling noodle soup. To put it simply, the dishes were just fine. Both were bland and flavorless - perhaps I am more biased towards the heavier cuisines of Xi'An and Sichuan, but nothing about the meal was compelling or made me want to go back. Regarding the beef noodle soup, there were very few braised beef chunks. In addition, the beef was too lean and tough, and the cabbages on top just seemed more like an afterthought. The noodles themselves were well-cooked and not soggy; I appreciate them placing the soup in a separate container. The dumplings were too doughy and the meat lacking that savory, fatty quality that I look for in a delicious dumpling. Perhaps I would go here if I were sick and craving some solid chicken broth, but there are cheaper ways to acquire that. I do wish to give Yaso Tangbao another shot, so maybe next time I'll try some of their pork soup dumplings. However, given their lackluster regular dumplings, I won't go in with high expectations.", "author": "Claire L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-18", "description": "Really a 3.5. I've been to yaso a bunch. It's never bad. It always hovers between damn that's so good and I don't mind that I'm eating this. Today I got the pork soup dumplings (4 for 3.50, a steal), the sweet and spicy dumplings and the sweet and sour pork ribs with dry noodles. Soup dumplings are always yum, sometimes they fall apart here at the slightest touch. I'm a fan of the sweet and spicy dumpling especially dipped in vinegar. I'd never had the ribs and dry noodle and thought it was probably better than any of the other entrees I'd had here. Ribs were cut up into little pieces but we're still meaty and the noodles actually outshone them flavor wise. Definitely one of the better overall meals I've had her!", "author": "Adam L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-05-28", "description": "The concept and idea of this place is cute. They have a nice restaurant layout (kinda reminds me of Chipotle), a huge menu on the wall with pictures (so you know exactly what your getting), and mobile kiosks so you can place your own order. Modern, fun, and convenient. \n\nHowever, the food is whack. This is what gentrified Chinese food tastes like. First of all, they pride themselves on selling Shanghainese street food but beef noodle soup is more so Taiwanese??? \n\nIf you want good Chinese food, you are better off going to Flushing or Chinatown, my friend. I had the soup dumplings and beef noodle soup. The soup dumplings were pathetic - they were lukewarm and they all had holes in it so the soup leaked out! Moreover the meat inside the dumplings tasted like ground up dog food. \n\nAs for the beef noodle soup, the noodles are NOT hand pulled or fresh. They are just frozen, packaged noodles. It tasted like plastic noodles if they were edible. The saving grace was that the broth was pretty good/rich and they gave a generous serving of beef.", "author": "Isabel L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-24", "description": "I'm happy I discovered this place- food is so good-service is great. I had N7 sweet and sour ribs my favorite-also had the meatballs which is pretty good. \n\nIf you are into dumplings this is the place for you. Overall I like this place.", "author": "Leon S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-11-28", "description": "Stars for the speedy ordering/delivery process and them buns (not soggy from the delivery and not too bready:). The congee was lackluster. It was bland with max three minuscule pieces of \"sweet potato\" (not sweet at all) thankfully I purchased a side of picked veggies (wish it came with it like the sauces but no biggy) and that help give it flavor. I was unable to eat my oil wrap (I mean egg wrap) I brought it home in hopes I could salvage it but the wrap was too drenched in oil to do anything but toss it in the trash (I hate doing this and hate wasting money) the egg was just an egg so I wouldn't say it was worth spending money on). Overall the buns are 5 stars but the menu I saw during breakfast time was limited and heavy on meat options (would love more veggie or seafood options). Till then I'll hold off ordering during that time.", "author": "Clari B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-29", "description": "Pretty expensive for 4 shanghai dumplings but the size of it is pretty big and there's a lot of soup. The soup base inside the dumplings are not as fattening compared to other places in Chinatown. For this location, it's pretty good.\n\nI tried 3 different types of shanghai dumplings. Pork/ Crab \u0026 Pork/ Spicy Pork. Out of those 3, Pork is the best. Crab \u0026 Pork has this extra heavy taste to it whereas the spicy pork is really just soup base with hot sesame oil. When I drank the soup, it taste like I was just drinking pure oil. \n\nWait time for food is average. Even though this place is semi small, you can normally get seats within 5 mins of waiting. This place is kind of like food court style where you order and pay at the counter and then bring your food to the table, eat, then bounce.", "author": "Diana T."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-02-26", "description": "I'm so disappointed with the state of affairs here. I used to love their soup dumplings. I was even the mayor on Swarm for two weeks when they first opened. However, since they remodeled and stopped making soup dumplings fresh on the premises, the quality has dropped off a cliff. I had actually noticed the change on my previous visit before they remodeled, but wishfully hoped it was just a one time slip. However, now having tried them again after they reopened, I realize that they must have been doing a test run then, and this is now a sad and permanent modification to their recipe and process. \n\nThe dumpling skins used to be thin, delicate and slightly translucent, and if you were gentle, you could pick up one up and place it onto your spoon without breaking the skin and spilling any of the goodness inside. But now the skin is thick and doughy, and somehow breaks open upon the slightest provocation. The soup used to be hot and steamy and would flow out when you pierced the skin. Now, the dumplings are lukewarm at best, sit sad and flat on the tray, and barely any soup comes out when you undoubtedly break the skin on accident before even being able to pick one up. The soup seems to have fused with the meat inside to form a semi-solid congealed slurry that sticks to the top of your mouth as you try to chew it.\n\nI really hope Yaso realizes that this change to their recipe/process severely hurts their quality and brand before it's too late. I wish I had frequented them even more than I had before they updated. Appreciate your neighborhood gems people! Because even if they stay open and thrive, you never know when they might just up and change their flagship product in the name of convenience over quality.", "author": "Eric W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-08-14", "description": "Yaso Tangbao was quite an interesting experience. It kind of reminded me of dimsum/yumcha but you order at the register first and they call you up when your food is ready. \n\nMy party was made of 6 people and we definitely over ordered! Lets see if I can remember everything we got. \n\nPork/ Crab \u0026 Pork / Spicy Pork Soup Dumplings: Okay... I personally thought the skin of the dumplings was too thick. It was hard to just bite into them to suck out the soup so it ended up spilling into my paper dish. \n\nVegetable Dumpling: Pretty flavorful but once again skin was too thick. \n\nCold Noodles (peanut sauce): Noodles were too thick and not al dente. There also wasn't enough sauce in my opinion. \n\nPork Meatball: Very flavorful, kinda fatty, and extremely greasy. \n\nSweet and Sour Ribs: Very good! The meat was seasoned very well. Highly recommend.\n\nSeasonal Garlic Fried Veggies: It was chinese broccoli for us. Very very garlicky and very very good! Definitely recommend. \n\nSweet Pumpkin Mochi w/ Coconut: Pretty good. Not a whole lot of pumpkin flavor if any. But the coconut was good. By the time I ate it it was cold so the mochi was pretty firm. \n\nChicken Curry Crispy Noodles: Chicken was very tender and well seasoned. Not a whole lot of curry flavor. Noodles were crispy tho. \n\nPanfried Pork Bao: My sister loved this but I thought it was a little too oily. \n\nOverall, pretty decent food. It's unique and is a good gateway to introduce traditional Chinese food to people who don't usually eat it. Service was quick though which is a plus.\n\nThere was plenty of seating (community tables). And it is self service so place your trays and steamers near the trash after you're done. Don't forget to pour yourself some soy sauce and vinegar for your dumplings.", "author": "Jessica N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-25", "description": "Pros: good food. Cons: ordering process. \n\nFinallas lay I came across good shsnghainese food in BK downtown. Their soup dumplings had thicker skin than in Chinatown, but for BK it's still marvelous. The flavor was right, and I looked their original leaf-shaped dumpling spoons. Beef was tender with the right flavor. Pork meatballs were a tad salty,  but overall it doesn't get better in BK downtown (sorry Brooklynites).\n\nThe only downside is they don't have a Spicy option in their touchscreen ordering menu, I had to get rid of some surprise pepper seeds in my plate. Also I had to wipe crumbles off my table, they should clean tabletops more often.", "author": "Peter H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-02-14", "description": "Convenient and decent soup dumplings but far from the best I've had. \"Yaso pork\" ones were the winner, although more soup would've been nice. Crab ones were borderline cold and less cooked than the others. Drunken chicken was way too salty and flavorless. On the other hand, I realy enjoyed sweet and spicy pork dumplings -- they were similar to the spicy wontons in chili oil from Sichuan cuisine.", "author": "Juriy Z."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-10-08", "description": "I feel pretty ambivalent about Yaso Tangbao, but I do keep coming back. The soup dumplings are good - not the best I've ever had - but if I'm having a soup dumpling craving, this place is good to have around. My favorite is the blue crab \u0026 pork filling. The ordering process I find quite convenient (it's all self-serve) and it's a satisfying and tasty meal especially when I'm in a rush, or between things. Overall, worth checking out, but not really a destination spot. Order all the dumplings if you go! Also, I *really* wish they didn't serve everything in plastic take-out containers.", "author": "Victoria S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-15", "description": "Yaso Tangbao is a super casual restaurant with open seating. It is good for a quick lunch or dinner. The activated charcoal xiao long bao tasted like a regular pork xiao long bao to me. It tasted good but felt that the charcoal did not add much. The sweet and spicy dumpling jiaozi was really great. It had a nice spicy numbing flavour and the peanuts added more texture and nuttiness. The cucumber salad was refreshing. And the chicken cutlet noodle soup with peppercorn sauce was not super heavy and rich while still being good. One minor critique is that I wish that the community tables were wiped down more often. There were quite a bit of spills and remnants of previous diners on the tables.", "author": "Jem S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-18", "description": "This place is a super convenient and good value fix for some dumplings and noodles in downtown Brooklyn.\n\nFOOD - I tried the spicy pork soup dumplings, pan fried baos, and spicy diced chicken noodle soup and I thought all were pretty good! The small plates were maybe $4 each and the noodles are about $10-12 depending on what you get. It's all filling.\n\nSPACE - This is a fast casual spot, filled with mostly students and families when I came in on a Sunday evening.\n\nIf I'm being honest, I can't recall a time when getting dumplings so quickly was this easy. So thanks a ton for existing, Yaso Tangbao! :)", "author": "Connie H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-27", "description": "Highly recommend this place! At an amazing price that you can get so delicious soup dumplings  Very authentic and yummmmmmy!", "author": "Yueming Q."}], "servesCuisine": "Shanghainese", "priceRange": "$11-30", "name": "Yaso Tangbao", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "148 Lawrence St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/n8qkl-utd4uCMlOy46G05g/ls.jpg", "@type": "Restaurant", "telephone": "+19293377599"}