{"aggregateRating": {"reviewCount": 704, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-11-06", "description": "This place is the worst. Cmon people, this isn't even real shanghaiinese food. Everything was not good. Firstly, chinese spots that charge extra for hot sauce - like are you serious? What kind of spot are you that you have to charge $1 for chili oil?? Spice is a necessity in chinese food! We ordered: \n\n1. XLBS - super small portion and over priced\n2. Pork chop over rice - I liked that this had rice, veggies, egg and pork chop, but it was SOOO bland. Lacked any flavor and the porkchop didn't seem fresh at all\n3. Pan fried dumplings - these were super juicy, you should beware that when you bite into it, all the juice comes squirting out. My friend had it go in her eye and her eye was red all day. \n3. Noodle soup - again nothing great and esp since they were stingy on hot oil, i was really disappointed\n4. Sticky rice dumpling - it was so terrible, it was too much rice ratio and we expected there to have some sort of meat in them\n\nYou can get way better chinese food in chinatown so please don't waste your money on a spot like this.", "author": "Anh Thu P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-04", "description": "Excellent food ! Yummy chicken soup dumplings and pork baos ! Cute inside as well! I would defiantly recommend this place . I would like to try more on the menu if I ever go back and defiantly is a must to go to !", "author": "A R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-12", "description": "We stay in midtown manhattan and don't really have many great options of dim-sums unless we go to Canal Street and wait an hour on the weekend. On researching we came across Yaso Tang Bao in Brooklyn and did a little trek which was a hundred percent worth it. \nA quick low down of what we ordered-\n\nWe got the pork soup dumplings which were some of the best I have had with a well flavored broth and easy to handle( most soup dumplings tear when I try to pick then because of their size. Here they were just right) \nWe also got the spicy soup dumplings which weren't as good as the regular soup dumplings. \nThe sticky pork ribs were bite size and tender. We enjoyed them a lot and ended up ordering two servings.\nThe pan fried baos were a taste and texture revelation for me because I usually find baos to be a little sticky and doughy for my liking. But these were anything but that. The exterior was lightly pan fried and the bao itself was thinner than usual with a generous filling of pork. Absolutely amazing and a must-get.\nLastly we got the dim-sums with a chicken sticky rice filling which was chewy and bland and not something that stood out for me.\nBesides the extensive menu that this place has to offer,it's the little details like their selection of self serve complimentary condiments-ginger vinegar which was nothing like i v ever had and soy sauce(the usual) made this place a stand out. However, i didn't quite get having to pay an extra dollar for chili oil :/.\nI am very glad that Yaso Tang Bao is opening a few blocks from me in Midtown and I am sure to be a regular and try the other interesting things on the menu.", "author": "Amrita A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-01-01", "description": "I came here for the soup dumplings and was severely disappointed. First of all, the dumplings were served in a takeout container, not the traditional steaming baskets. There was not enough soup in each, and the little soup that was there was very lukewarm. The flimsy spoons that we got with this order was extremely hard to eat with. The one upside was the ginger ale- the regular and blood orange flavor were the best part of this meal.", "author": "Kimberley G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-30", "description": "This is my go-to for nummy dumplings and greens and small plates.  It's really affordable and a low-key setting.  Nice spot to meet up downtown and the staff are really nice and helpful.  \n\nThe mural is pretty cool too.  It's dumpling NYC! :)", "author": "Sharon H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-01", "description": "Food is alright,  the venue can be brighter.  Cost not too bad tho. It is good for a quick and full one.", "author": "Annie F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-22", "description": "OMG so good. I over-ordered because I was so excited to try everything. Soup dumplings were perfect. My fave was the pork and crab. Such a delicate flavor. And yes it was steaming hot but who cares   The spicy pork with oil- not a fan. A little too greasy. The bao was so different than I expected. The meat was savory but the pastry was sweet. No bad but takes some getting used to. I'll definitely be back", "author": "Dina L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-04-11", "description": "I would never think to go to brooklyn heights for soup dumplings, but since I'm in the area for jury duty, I had to try it out because of its good reviews! This spot turned shanghai food into fast food which is pretty perfect.\n\nThe regular pork soup dumplings were really good. It's $5 for 4 soup dumplings and while that doesn't compare well to chinatown prices, it's the perfect price and portion for 1 person. I also ordered the pork and bok choy wonton soup. It was light, but the broth was a little too salty for my taste. I wasn't that big of a fan. It was also $5 for a small portion, but once again- good for one.\n\nThe bad part about this place is the service. The girl at the cash register today (Tuesday 4/11/2017 at around 12:45pm) looked super miserable like she hated life. She also took down my order wrong so I had to go back and pay a little extra and wait really long while she figured out how to work the computer to charge me for the right item. Not really an enjoyable experience.\n\nI wouldn't direct people to this place if they're wanting the best soup dumplings in NYC, but it is good if you work in the area and want something other than pizza or chinese takeout. It's an interesting gimmick with pretty good food.", "author": "Arielle Lana L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-11", "description": "Wonderful customer service. I ordered from their online site on Sunday thinking it was delivery to my door but it was actually pickup. It was completely my fault but they gave me a full refund after I called them even though they'd started cooking the food. They were also very nice about it!\n\nHaven't tried their food yet but I'm definitely going and bringing friends because I want to support these guys.", "author": "Olivia B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-12-27", "description": "This place is not good they gave me and my friend both the wrong order, and the dumplings were weird and the bar buns were weird too and the drinks are no bueno.", "author": "Sophia B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-26", "description": "Loved it!!!\nCombines my love for XLB and fast casual style of restaurant!! \nDefinitely a great spot for Chinese food without the long commute to Chinatown or flushing.\nFood taste: 5/5\nSeating 4/5 (bench seating)\nAmbiance 5/5\n\nRecommendation: don't try the cold salt chicken (forgot exact name) app but definitely try the different XLB flavors", "author": "Ling Q."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-10", "description": "No frills, but fast and delicious Shangainese food! Not an area I'm usually in, but glad I stumbled upon this place. They had the food ready in about 2 minutes and with decent prices and great flavor.\n\nYou pick up your order and self-seat which helps maintain the pace of the orders but there are plenty of seats and space to maneuver around in. \n\nThis is a place that is great to dine in at but also does a hearty carryout business as well. I'm looking forward to trying it again when across the street St Circa brewery or coming from an Alamo movie.", "author": "John M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-12", "description": "This is more of a self serve eatery. The food was mediocre but it was on the pricey side. The fried pork buns were too doughy and also be warned, there's a lot of soup inside. The charcoal pork dumplings were decent, didn't really taste the uniqueness of it. The spicy pork dumplings and the tender spare ribs with warm noodles is what I would recommend!!", "author": "Jenny L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-10", "description": "Yum! This was the light in my life when I had jury duty! It's located right around the corner from the courthouse and I've actually already been back since serving! Their pork soup dumplings were fantastic as well as their garlic fried rice and the beef noodle dish. You cannot go wrong! It's reasonably priced and quick! For sure worth stopping in!", "author": "Teagan R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-07", "description": "I always go to Joe's Shanghai for soup dumplings, but I wanted something cheaper that was less of a tourist trap and found this place. It was so delicious- JUST as delicious as Joe's Shanghai. We got the pork and chicken soup dumplings, steamed pork buns (omg. Omg omg omg I want them again, RIGHT NOW), fried dough and the sticky dumplings. It was all delicious.", "author": "Sarah K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-04", "description": "Ordered a pork bao. It had plenty of soup inside, and the skin was nicely pan fried. I will definitely come back for their soup dumpling and noodles.", "author": "Patrick N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-16", "description": "Ok here's the deal.\n\nFantastic and inexpensive (fantastically inexpensive?) soups, soup dumplings and noodle/rice dishes located right next to the jay street train station in downtown Brooklyn. \n\nI don't think there's much else to say. (Mike drop?)", "author": "Allana D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-14", "description": "I had a lot of high hopes for this place as I dug it out of yelp while in the Brooklyn area. \n\nI ordered the pork dumplings (I wanted the spicy ones) as well as the blue crab dumplings and grabbed a BBQ pork noodle dish. \n\nThe dumplings looked flat and odd, almost like they were prepared quite a while ago and were heated up quickly and ready to serve. The pork one tasted nice, but the crab one was not so good in my opinion. \n\nThe BBQ Pork noodle dish was bland. It lacked really any good flavor or taste. I had to pour a ton of spices just to get it to a level that was tolerable. \n\nThe price isn't terrible I think all three items cost me around $20 for everything and the service wasn't half bad. You place the order on the tablet and they call the order number out for you. \n\nI just know I won't be back.", "author": "Jon G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-11", "description": "There are some mistakes that you can never recover from as a restaurant. Specifically, sending a takeout caviar customer an order of RAW soup dumplings. Biting into raw pork is certainly an unforgettable culinary experience.", "author": "Gia S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-20", "description": "This place is legit and authentic enough for soup dumplings, only.  The meatballs are close enough to my family's meatballs.  \n\nA bit of history to write a review on Yaso: I'm as Shanghai native as you could get from an American born Chinese. I speak fluent granny Shanghainese. In my millennial life, I've flown to Shanghai a dozen times to visit family and friends.  \n\nSpeaking from experiences in Din Tai Fung in Shanghai (highly recognized and reputable soup dumpling restaurant in Shanghai), NY Chinatown,  and Pinch, the fancy Chinese restaurant in SoHo on Prince Street featured by Fung Brothers on YouTube, the Yaso soup dumplings are on par with Chinatown.  In order of authenticity, Pinch would be last on the list.  \n\nTo address overpriced items on the menu compared to Chinatown, yes, I agree.  However, Yelpers should be aware of two words: location and rent.  As a fairly young restaurant in a gentrifying, business commerical neighborhood with exhorbitant rent, does it make economic sense to charge prices the same as Chinatown? No is the answer.  \n\nFor two dollars extra, I pay for the price of convenience and authenticity. The \"overpriced\" item will offset MTA fare, if you have limited rides, and the value of time.  \n\nRecap: authentic soup dumplings and clean restaurant", "author": "Jolly H."}], "servesCuisine": "Shanghainese", "priceRange": "$11-30", "name": "Yaso Tangbao", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "148 Lawrence St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/n8qkl-utd4uCMlOy46G05g/ls.jpg", "@type": "Restaurant", "telephone": "+19293377599"}