{"aggregateRating": {"reviewCount": 704, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-27", "description": "i would definitely head back to this place! \nthey're very friendly here and the food is very delicious! and of course, their soup dumplings are the besttttttt!!!", "author": "Jenn L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-13", "description": "Good price and amazing food. The chicken broth that accompanied the pork noodle soup had some much depth in flavor, and my kids really loved the dumplings and pork buns.", "author": "April N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-14", "description": "delicious soup dumplings! perfectly juicy and flavorsome. I've tried some of the other stuff and they're alright (except for the duck soup, which was pretty good)", "author": "Magdalene L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-11", "description": "I absolutely enjoy the soup dumplings at Yaso Tangbao.  I usually grab a quick meal when in the Metrotech district and/or after my evening classes.", "author": "Mayra O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-08", "description": "Super authentic, tasty Shanghainese food! I highly recommend the spicy soup dumplings, the short ribs, and the pan fried pork buns. Can't wait for them to open more locations!", "author": "Rosa H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-02", "description": "I ordered the N9 Soy Garlic Noodles and the G3 Garlic Cucumber Salad. Both were delicious and a good amount of food. The place is nice and definitely draws in the lunch crowd. Be prepared to wait for your order. I didn't get the dumplings but they looked very plump and juicy. Seeing through the window where they are being assembled, they don't skimp on the filling. It was a little on the expensive side, but worth it.", "author": "Rachel J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-19", "description": "I came here while I was on jury duty and was nearby. I really should have tried the soup dumplings, as everyone seems to rave about them but I really wanted fried rice that day. Fried rice was good and the seasonal vegetable was delicious. It had a garlic sauce and was better than the rice dish. Very casual place for lunch, felt like a lot of people from nearby jobs came here. Unfortunately, I work far away and can't come back for lunch.", "author": "Beth B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-19", "description": "Great soup dumplings, especially the spicy pork. Fast and fresh. Definitely satisfied my craving without having to travel into Manhattan.", "author": "Erin E."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-12-14", "description": "I have been to most soup dumpling places in NYC. This is one of the least authentic place. Portions are small and overpriced. 4 dumplings for $6? That's 50% more than the price in flushing. Not sure if it was just the day I went, but the cashier was very rude. It's all advertisement that attracts people here.", "author": "L H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-22", "description": "This place is incredible. Everything I tasted was exceptional! The ambiance is great. Plenty of comfortable seating. Friendly and fast service. I wish I could go back, but I live in Texas.", "author": "Aiya W."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-12-10", "description": "I feel this place is literally a rip off. Despite the soup dumpling the rest of the dish are so bad.i ordered dumpling, spicy pork noodle and fried chicken. It cost me 20 bucks and ruin my day.The spicy pork noodle is literally salt water plus plain pork..it's not even braised.. Jesus...I would not recommend this place.. Piece of trash...", "author": "Yvonne H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-03", "description": "Good offerings at good prices and very tasty.  Quick and efficient, if not exactly cheerful, service.", "author": "Eugene P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-10-29", "description": "There's nothing wrong with the food, but this is not, as another reviewer said, comparable with Chinatown establishments in affordability (-1 star). The portions are small, for one thing, and there's no table service.\n\nThe place looks much cleaner than the other Chinese restaurant there, but I didn't see a city health grade on the storefront. It's very well furnished; along with the location, the prices correlate.", "author": "Clinton D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-03", "description": "Food is so good. Great soup dumplings, vegetables and great noodles. Also, you know it's legit when they offer you ginger to go with the vinegar! Everything is also at a great price.", "author": "Jeremy A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-24", "description": "Quick, tasty, neat and clean. Long communal tables, yet comfortable neighborhood spot. Worth a try, as you exit Jay-Metrotech. Buns, noodles, rice, meat or vegetarian. All good.", "author": "Steven B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-30", "description": "Their soup dumpling is tasty, however, not very authentic imo. Their soy milk is not so good though. It seems that their food is like a fusion of shanghai cuisine and a little bit japanese.", "author": "Big B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-03", "description": "I was really excited to find good mapo tofu in the neighborhood.  Also the dumplings, of course.  Four stars instead of 5 is that I wish I could just order a big container of mapo and not a serving of 1/3 mapo + 2/3 rice but I guess that's not the way they do things here... Still, great quality food.  Make sure to specify if you want it actually spicy.", "author": "Rachel O."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-03", "description": "Great food, slightly expensive for what it is. Definitely get 2 orders of soup dumplings. The noodle bowls are also great.", "author": "Ryan H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-20", "description": "Try the chinese meatballs so soft and juicy! Every time I walk by I undoubtedly have to stop in to get some quick soup dumplings!", "author": "Karen S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-30", "description": "Ordered delivery on Xmas Eve. Was nervous that the soup dumplings wouldn't travel. They did! And they were GREAT!", "author": "James H."}], "servesCuisine": "Shanghainese", "priceRange": "$11-30", "name": "Yaso Tangbao", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "148 Lawrence St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/n8qkl-utd4uCMlOy46G05g/ls.jpg", "@type": "Restaurant", "telephone": "+19293377599"}