{"aggregateRating": {"reviewCount": 704, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-16", "description": "This is a nice place to stop if you're in the area and need a quick bite. I wasn't a huge fan of the soup dumplings, but I enjoyed the pan fried dumplings and the sweet and spicy dumplings too (a bit on the salty side, but still very tasty). The space is clean and has a nice ambiance with the brick walls, wooden tables/fixtures, and lighting. It's a nice place for a snack on a rainy day. The free water is a nice bonus too! I'm looking forward to trying some of the other items on the menu.", "author": "Meghan W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-28", "description": "Decent.  \n\nWe got the garlic fried rice, curry over pan fried noodles, pork siu mai, and spicy pork noodle soup.  \n\nThe flavors for everything did not pop, but everything was solid.  The noodles in the curry pan fried noodles were a little starchy for my taste.  The spicy pork noodle soup was tasty.  The pork siu mai was a bit odd, it only had sticky rice inside, no pork.  I am not sure if that is Shanghainese style.  The garlic fried rice had an odd taste like they dumped sugar in it.  \n\nOver all it was a good experience and a bit of a change up from the normal Chinese take out places.", "author": "Jon L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-15", "description": "All the xiao long bao here are really good but the veggie dumpling and sticky rice dumplings r just eh. The beef noodle soup is good too", "author": "Jenny N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-09", "description": "Great soup dumplings! It's a a bit small so not really great for more than a few people in your group.", "author": "Richelle T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-23", "description": "Best soup dumplings in Brooklyn. I also love their chicken ramen bowl. This place is byob so bring some sake or Sapporo ;)", "author": "Sara I."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-12", "description": "Awesome bowl of spicy pork noodle soup, and the soup dumplings are addictive (we had two orders and devoured them instantly). Can't wait to return and try more of the menu!", "author": "Chase M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-12-30", "description": "There are not many good places for dim sum in downtown Brooklyn, and this is a decent choice. A bit on the expensive side (compared to Sunset Park or Chinatown) but not terrible. Portions were good sized. The coconut pumpkin pancakes, and blue crab soup dumplings were hits, but the curry chicken over rice and Pork Mapo Doufu over rice were misses, as was the pork buns. Overall, food was on the greasy side and counter service was a bit slow (you pick up your meal when your number is called). Not sure I would return unless really wanting a dumpling fix.", "author": "Darryl R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-17", "description": "You order and sit with a number. It's a fast casual place but the food is good. Their soup dumplings are not bad! We tried the spicy pork dumplings and they were actually spicy! Juicy and flavorful too. Their beef noodles were good as were their spare ribs and this tofu dish we had. The garlic soy noodles were a bit salty and the sticky rice shumai I would skip. It has no flavor whatsoever. The prices are pretty good.", "author": "Elizabeth N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-01", "description": "I love this spot. \n\nWhen my man and I were finishing surfing the books of sea. We felt hungry and we were in BK. So my man, who is a Shanghainese, suggested that we could check out this new spot. He heard it from his old school mate. \n\nThen tang bao was cute and yummy, price is great and I love the wood decor.", "author": "Spencer L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-31", "description": "This place was awesome.  Some of the best vegetarian dumplings I've had in a long time!  Peanuts galore (if you're really that sensitive to those, I wouldn't recommend stepping foot in here) which is perfect for someone who wants peanuts on everything!   \n\nI also ordered a wheat gluten mushroom dish (with peanuts, of course!) thinking it came on noodles but it didn't and it came out looking like meat.  I asked but they confirmed it was wheat gluten and not meat.  It was damn tasty, regardless (and definitely not pork since it didn't make my stomach hurt- so yay! on no pork cross contamination in any of our veggie food)!!  Also had the soy tea eggs, since i'm a hard boiled egg fan, and these didn't disappoint.  Perfectly cooked yolks and not too salty.  My friend ordered some soy noodles which tasted like peanut noodles to me, so also was a big fan of those, too! \n\nMy friend and I stayed til closing and they had those chairs on the communal tables, right quick but never told us to leave (which I would have completely understood!).  Definitely going back!", "author": "Lady M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-18", "description": "While the food here is great and for a reasonable price. The table is not being kept clean and it has happened twice during my first visit and my current visit.", "author": "Darren L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-12-10", "description": "I like the concept - casual Shangainese street food. However vegetarian options were not great. The skin of the dumplings were too thick and overpowered the filling. The cold cabbage was too sweet. The koofu was quite delicious, but needed more mushrooms to balance the seitan. I heard the meat dishes were good.", "author": "Judy Y."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-24", "description": "The pork soup dumplings are great and the house made vinegar sauce is a little sweet; however the drunken chicken is way too salty.  The mixed veggies are just so so.", "author": "Chris C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-20", "description": "After spending some time at the nearby NYC Transportation Museum, my wife and I decided to make a pit stop for some Shanghainese food before heading back to Manhattan. Even though it was almost 2 PM when we came in, there was a few people ahead of to order - and more folks waiting for food. While the ordering part was easy, it was the waiting that really sets back the experience a bit - it took us a full 40 minutes to finally get our last 2 dishes, from time of receipt to food on my chopsticks. Most Chinese joints I've been to never take anywhere close to that long, so something really needs to be done to make the process more efficient. We were warned that one of our dishes (not disclosed) would take 15-20 minutes, but this was far longer than expected.\n\nThat said, while you are waiting, you can get yourself situated at window seating or at some of the tables that looks communal but actually has separate square stools for everyone to sit on. No privacy for sure, but once the food actually arrives, you will be chowing down in no time flat. Our first set of food was the pork meatballs and 3 orders of soup dumplings. The meatballs are absolutely fantastic - nowhere close to overcooked, but with an extremely savory sauce and tender meat that is extremely tasty...probably the highlight of the meal. The soup dumplings were quite good as well...perhaps a little more saltiness (MSG?) could have been used, but the skin was the exact right thinness/thickness, and there was plenty of soup in all of them. As usual, I just didn't end up caring all that much for the crab and pork version, but that's not a reflection of the dumplings here - just something that I keep repeating everywhere and expecting a different result. Our second order consisted of the kao fu and the pan friend buns; the former was quite good - a little more textured and spongy than others I have had, and the peanuts and veggies gave it a bit more character than just having the wheat gluten on its own. The pan fried buns were okay, but they really could have used more soupiness inside them, a la Yang's (one of our favorite joints for these kinds of buns in Shanghai). I probably would end up going without them next time, even though they were okay...the bun itself doesn't add much flavor, and the soup dumplings definitely seemed to come out more quickly.\n\nThe food here is pricier than Chinatown - don't get sticker shock when seeing the levels - but at the same time, it's a bit of a saner environment than some Chinese spots can be, and the food overall is still quite tasty. I would come back for more xiao long bao, as well as to sample their noodle soups (of which there seemed to be many tasty choices). A worthwhile place to eat lunch if you don't want to make your way to more remote environs in NYC.", "author": "Asuka N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-05", "description": "This place is a jem. Not the best soup dumplings I have had by far but still very tasty. Love that I can get some vegetable-heavy dishes here for lunch at a reasonable price.", "author": "Christopher L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-19", "description": "Expensive, but tasty and good source of good food choices.  Tasty dumplings and soups and broths.  Maybe not super super traditional, but a good addition to downtown brooklyn.\n\nLunch of some vegetable, and spicy noodles was ~$18.", "author": "Liam R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-25", "description": "This has been in my bookmark for over a year, and here I come! I ordered meatball over rice which was super good! Probably the best around Tandon. The skins of the soup dumplings were too think to be authentic, but taste fine. Overall you can good quality for what you paid for.", "author": "Yue L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-17", "description": "If you want to try some food that is out of this world... YOU GOTTA GO TO YASO TANGBO!\n\nWatching them make the Spicy Pork Soup Dumplings through the window glass is simply amazing, but once you come to their counter and pick up the Dumplings,  they're steaming Hot!!!\n\nThe best part about the Dumplings is when you bite into them and sip that Hot, Juicy Soup, and when you add a little SIRACHA Sauce... BE PREPARED TO SLAP YA  MAMA... #OffTheChain! \n\nThere are so many dishes to choose from that are just as awesome,  but for me, the Dumplings ROCKS!\n\nSo, if are in the downtown  Brooklyn area, and you are interested in something  different. for lunch (best to get there by 11 am, not too crowded) check out YASO Tangbao,  try them for yourself...#Amazing!", "author": "J R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-01", "description": "A little pricier than Manhattan Chinatown but definitely still tasty if you're in the area. We ordered 2 orders of the pork soup dumplings, 2 orders spicy and 1 order crab and between 2 people, we devoured 18 dumplings. We also ordered chinese broccoli/the vegetable changes depending on what they have and that was standard. Service is quick and for lunchtime on a Saturday, there was almost no line or wait for food (~10 minutes) though the restaurant was decently filled.", "author": "Vicky L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-01-12", "description": "This review is not for the dumplings but for the braised beef noodle soup (menu item N1). Very disappointing. For $11.50 (over $12.50 when tax is included), I got a bowl of mostly noodles, only a few pieces of beef and yu choy, and a weak, salty broth. You can get larger portions, richer flavors and cheaper prices in Brooklyn or Manhattan Chinatown, which is where I'm sticking for this kind of soup. One possible mitigating factor was that I stopped in about half an hour before closing, but even so, I'm not going to try the soup here again.\n\nOpen to coming back to try the dumplings and other dishes, though. We'll see.", "author": "HQ P."}], "servesCuisine": "Shanghainese", "priceRange": "$11-30", "name": "Yaso Tangbao", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "148 Lawrence St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/n8qkl-utd4uCMlOy46G05g/ls.jpg", "@type": "Restaurant", "telephone": "+19293377599"}