{"aggregateRating": {"reviewCount": 704, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-09", "description": "Went with a group from work.  Very good Soup dumplings, both pork and pork and crab.    Restaurant was packed 10 minutes after opening.  Fried spring rolls were cooked at too low a temperature and were somewhat soggy.  Bao were excellent, soups were excellent.\nThe whole crew eat for under 12 a person.\nWe will be back.", "author": "Joshua R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-08", "description": "OK. So I work near here. And honestly around this area there are only a couple of places that are noteworthy. This place for me is like a gold mine, Granted I came on a Saturday when New York had a snowstorm so there was absolutely no wait. I love Soup dumplings (xiao long bao) and this restaurant had one of the best crab shao long bao that I've ever had. The flavor of the blue crab was so much stronger than that of places like shanghai cafe and joe shanghai in Chinatown NYC. (I am in no way stating that these restaurants are subpar because I do love those restaurants as well). There's also a spicy pork soup dumpling that was really unique, but still quite good. The other dumplings and noodle soups were also good as well. I had the braised beef noodle soup (one of my favorite dishes) and i would say it was a 6/10 in my book. I would say however, the timing of when things are cooked needs to be worked on. The sweet and spicy wontons I had were a bit cold, like the cook prepped and cooked it first and just left it on the side. The flavor for the wontons were great. So, yes. I would go back here. Whether it be for my hour lunch break or if I'm having a weekend craving for good food. Props to you yaso tang bao", "author": "Michael M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-14", "description": "XLB are so deliciously shanghainese.  They are my favorite in Brooklyn and Manhattan, near the top compared to the Flushing competition.  Great flavor and skin - thin and doesn't stick to one's teeth. My Chinese grandmother would've approved. I ate a steamer of dumplings and spring rolls solo while waiting for a takeout order.", "author": "S L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-07", "description": "To keep it short and to the point:  This is one of the best places I've ever eaten.  BEST soup dumpling ever - Trust me!", "author": "Rachel M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-11", "description": "I was surprised to find good dumplings in the Fulton mall.  Everything we had was very tasty, and I would definitely go back.  That said, some items on the menu are more of a bargain than others, so watch the portion sizes.  The dumplings are $5+ for four, which is on the pricey side.", "author": "Reiko R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-12", "description": "Stopped in for lunch during the soft opening and got the pork rice and soup dumplings--both excellent (though some of the soup seemed to have leaked from the dumplings). The dumplings came with a delicious vinegar. Portions were generous and the service was quick. Will be back.", "author": "Christina C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-04", "description": "This is my favorite restaurant. The dumplings, noodles and fried rice are really tasty.  Support Apple Pay so I can pay when I am surfing.", "author": "Joe T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-04", "description": "Got the pork soup dumplings as an afternoon snack. Hot, savory, delicious. The service was friendly and very prompt, and the place is great for a casual group meet-up or solo dining.", "author": "Tony U."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-13", "description": "Really great place. A change from the other restaurants around here. They should add restaurants like this around here. Up the place even more. Great service", "author": "Dom M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-15", "description": "I came here for soup dumplings and was not disappointed. Got the crab and pork, both great. I like that you can go watch the chef make each order by hand through some glass. Tried some short ribs, meh. Stick with the dumplings.", "author": "Chris H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-29", "description": "i have high expectations for XLB as someone who lived in taiwan for years and ate dtf on the regular. yaso FINALLY has given me the best XLB in manhattan so far (next to the bao, or better). i their other options are so good (like beef noodle soup). it is pricier, but it is worth it.", "author": "Kale H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-02-10", "description": "Overpriced for the quality of food. Ordered the soy garlic noodle with cilantro and it is extremely bland and greasy. The you tiao is horribly greasy and flavorless. The vegetable dumplings are rock hard. Won't eat here again", "author": "SK S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-16", "description": "The authentic and flavorful dishes at Yaso Tangbao brought this Shanghai girl great joy. The pork soup dumplings and the shumai were comparable with the good ones in Shanghai. The sweet-sour pork ribs were so tender and juicy that even my mother, known for mastering this classic among family and friends, would be very proud of Yaso Tangbao's interpretation. Although the price may be higher than what is available in Chinatown, we find it fair considering the quality of the ingredients, the bright and clean interior, and the efficient service. I will definitely trek here again to try other items on the menu!", "author": "Yichun F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-06", "description": "Yaso Tangbao is a great place for a casual bite to eat in stark contrast to its surroundings. The soup dumplings are solid- steaming hot and juicy as expected. I also tried the beef noodle soup and mapo tofu, both of which were tasty. The sweet pumpkin cakes were a nice surprise; while not very flavorful, they were subtle and had a good chewy texture. I'll be back for sure to try more of the menu, but so far this has been the most legitimate Chinese food I've found in this area of Brooklyn.", "author": "Emily S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-23", "description": "Sandwiched between Papa John's pizza and Sister's Unisex Salon, Yaso Tangbo is a haven of delicious Shanghainese cuisine. The customers are provided with a wide range of food options, ranging from pork dumplings to rice bowls. For those who aren't as familiar with Shanghainese food, Yaso Tangbao provides images of the various choices on the menu to help new eaters determine what looks appealing to them. The food, while it may take longer than a typical fast food place, is filled with rich spices, tenderly marinated organic meats, and an orginal flavor. Put down the burger and come on over!", "author": "Elizabeth P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-02-28", "description": "As good \u0026 tasty as the soup dumplings are, but the size of it is less than desirable - They're pretty much bite size...And the cost for it... $8.95...No thanks.\n\nOh, and as good as the Mapo Tofu dish looks, there is zero taste to the entire bowl...:-(", "author": "Ada C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-17", "description": "Yaso Tangbao offers authentic Shanghainese dishes at very reasonable prices. Having lived in Shanghai for some time, I think the the pork \u0026 crab soup dumplings and the shumai were comparable with the good ones in Shanghai. The sweet-sour pork ribs were well cooked, tender and juicy. Prices were very good considering the quality of the ingredients, rapid service and the modern designed clean interior. Bonus point to the chef who explained us how soup dumpling are crafted! Overall it was a pleasant and authentic Shanghainese dinner, something everyone has to try! I will definitely come back again to try other dishes!", "author": "Xavier M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-11-03", "description": "You would think for a new place on the block, that this place would try to please all your needs. Unfortunately that is not the case. I came into the restaurant to get a seat 10 mins before they closed after calling ahead and they wouldn't seat us. Totally bullshit. When you close at 10, you close at 10 and not 10 mins before. I hope the manager reads this and tells his staff to not leave the job early. Was so turned off will not go back to try it. Cutting corners isn't the way to do business in NYC. There's a million other places to try. Take note!", "author": "Sarah M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-12-06", "description": "Came here during my gap because I found out this place has just opened up. Nice to see that a Shanghai restaurant open up but I feel like everything is a bit overpriced and the portion was quite small.", "author": "Ariel W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-01", "description": "Soup dumplings were very good although I wish the broth was a bit more seasoned, but still they were very good with a generous amount crab and pork. Beautiful, warm, comfy interior as well.", "author": "Ray E."}], "servesCuisine": "Shanghainese", "priceRange": "$11-30", "name": "Yaso Tangbao", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "148 Lawrence St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/n8qkl-utd4uCMlOy46G05g/ls.jpg", "@type": "Restaurant", "telephone": "+19293377599"}