{"aggregateRating": {"reviewCount": 704, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-03", "description": "For the folks who are craving delicious soup dumplings but can't handle the Chinatown crowd, this is the place for you. I am super lucky this is right by my Brooklyn office. \n\nOn a normal day, I'll typically order the garlic cucumber salad (extremely refreshing) and 2 orders of the 4 piece pork soup dumplings.The broth in the dumplings is great, full of thickness and flavor! The cold cucumber salad adds a nice balance to the hot meal. \n\nOn a more hungover day (but worth a bit more $), I definitely recommend the Braised Pork Meatballs Over Rice with Egg. The meat is again, very flavorful, and the fried egg completes the meal. I'll usually order a hot and sour soup with this as well. \n\nJust a few tips: Beware of the lunch crowd which usually comes through at noon. I sometimes make the run for it around 11:30 so I don't have to wait in line. And be prepared to wait a few extra minutes if you order the soup dumplings, it is always prepared hot and fresh. Seating has communal tables and bar seating which for the most part, is limited due to the crowd. \n\nFIVE STARS all the way. Yaso Tangbao, you keep bringing me back.", "author": "Juliana C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-02-11", "description": "Chinese fast casual self-service in an inconvenient downtown Brooklyn- a far stretch from mass transit.  With a good friend and fellow poet we trekked to downtown Brooklyn in hopes for Shanghaiese cuisine.  Our first impression was great dismay and utter disappointment to see a street panhandler quietly begging for money among Yaso Tangbao customers walking between tables which the staff did not confront the disturbed man to usher him out for a fast exit.  Orders are fulfilled by screaming out your order number stated on your sales receipt for self-pickup (no waiter service) on cheap flimsy  disposable utensils.  Seating appears wooden picnic tables with stools (no backing) and a restroom facility on the premise.  Water is free and available at the amenity/ condiment counter.\n\nChicken Curry Crispy Noodle $8.75 - overflowing with heavy MSG and layers of grease, the noodles were excessively too crunchy and chicken was extremely pink in color for the appearance that it was undercooked.  When inquiring to the the cashier/server staff showing the color appearance of the chicken our response was a callous, dismissive attitude \"that is the way we cook it\" subsequently the female cashier/server turn her back and walked away dismissing concerning issue refusing to divulge a valid response.  We both fallen slightly ill from un-cooked chicken and the heavy MSG cooking lard induced.  As the evening grew onwards I became a victim of diarrhea but my homemade remedy was Camomile tea and Chinese Pu-erh tea (bou2 nei2) 普洱茶 to flush out the indigestion. \n\nYaso Pork Soup Dumplings $4.99- Xiao long bao (siu2 lung4 baau1) 小籠包, a Shanghainese staple which is prepared with excellence and effort filled with generous broth steamed in minced pork and served in traditional Chinese bamboo basket.  These siu2 lung4 baau1 is a must-have during a Shanghaiese meal.\n\nPork and Bok Choy Wonton Soup $6.95 - incorrectly overcharged as we order their daily special of Pork Siu Mai $4.95 but was billed for wonton soup.  We consumed pork siu mai- NOT wonton soup.  Our pork siu mai was NOT sweet or spicy as written on my sales receipt.", "author": "Tina C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-29", "description": "Absolutely loved the food! Quick service, easy access from the F, R, 2,3 trains. Do not leave without getting the spicy pork soup dumplings.", "author": "Shalini I."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-05-10", "description": "Decent Spot \n\nDisclaimer: I am not an expert in Shanghainese street food, so perhaps my review may be a little off.\n\nAfter eating, I did not really see the big hype behind Yaso Tangbao. Do not get me wrong; the restaurant has a lovely setup and the service is pretty fast. Plus, the menu is pretty straightforward and ordering is a breeze. \n\nI ordered one of the spicy pork noodle soup and I found it to be kind of bland, because I put quite a bit of Sriracha in the soup. Also, the soup had a really high oil content . . . this amount of oil could be normal for Shanghainese food and it may not be a big deal for true fans of Shanghainese food.\n\nOn to the staple of what brings people here: SOUP DUMPLINGS. I ordered the crab and pork dumplings and I did not get a wow factor. Actually, I was a little disappointed, because I really did not taste any crab meat in them. \n\nPerhaps, I expected a lot because of all the reviews and the fact that there slim pickings for decent asian food in this particular part of downtown Brooklyn.  I will say that the price point is not too bad for the portions of food that you receive. I believe that I paid about 18 bucks for my noodle soup, the soup dumplings, and a soda, which is not a bad deal. It's a great place for a nice bite (or rather drink) to eat but I would am not super pressed to come back . . . maybe once in a blue moon.", "author": "Kwame S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-02", "description": "Thanks to everyone here on yelp for helping me find this awesome place! Another one of these recently opened in Sunset Park, but being in industry city it's really a lunch spot (and I not generally a lunch goer-outer) My mom has mentioned a few times that she wanted to find a dim-sum-esque place and I figured that since we were in the area and this place is open for dinner, it'd be a good spot. We got four dishes, the soy garlic noodles, cucumber salad, pork soup dumplings and pork and crab soup dumplings. The soy garlic noodles were delicious, and we wolfed them down as the soup dumplings were being prepared. The garlic cucumber salad paired well with their soy and ginger vinegar, and were a nice lighter bite to go with the rest of the food. (Their ginger vinegar was a favorite of both of ours!) Then came the star, the reason I suggested this place, the soup dumplings. Mom got pork and really enjoyed them- I got the pork and crab. (And if you're wondering like I was, it is definitely real crab!) We both liked our respective choices so much that we didn't even think to swap one to try the other's variety. And I didn't get a photo until 2 were already history... Overall it was a really great meal, and even including 2 ginger ales was under $30. I'm excited to bring other friends here and try more of what they have to offer!", "author": "April H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-19", "description": "Came here because the brewery across the street was closed for a private event. What a wonderful twist of fate! This place is awesome. You order on an iPad from a list of menu items, and everything I got was delicious. Especially recommend the sweet \u0026 sour pork ribs over dry noodles, and the chicken soup dumplings. On a Saturday night there weren't too many people here, but I can imagine this place getting crazy during the lunch rush. It's awesome. Highly recommend!!", "author": "Lauren M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-03-25", "description": "In a word: too expensive for the portion (non-noodle stuff) and food itself, although the taste was okay (but I won't call it \"authentic\").\n\nWe had one or two from each genre: soup dumplings, pan fried baos, noodles, shao mai, savory soy milk, and hupi egg.\n\n1)) Compared to the Yaso pork soup dumplings, I prefer the spicy ones, although they were not spicy to me.   2)) Pan fried baos were okay but not as good as those in Flushing.   3)) Noodles were alright overall. There was good amount of vegetables in my veggie noodle soup and the portion was good, plus I did enjoy the garlic flavor in the soup, however, $9.35 is just too much for what I got. In Flushing or Chinatown, the same thing would only cost $6-$7 on average. My friend's Meatball noodle soup was even more unreasonably expensive. Almost $12 for a bowl of noodles just because there are 2 greasy meatballs?   4)) Hupi egg was tasty, but it's nothing more than a fried marinated (whole) egg.   5)) I do NOT recommend their savory soy milk. It tasted nothing but water with salt. No soy milk taste at all. Don't know why it's $1 more than the sweet version.\n\nStaff were friendly and helpful, but they need to adjust their pricing. It's Brooklyn, come on.\n\nP.S. Self-service dining style. They call up numbers and you go get your order. Clean up yourself after finished.", "author": "Jingqiao H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-02", "description": "Ridiculously good food. I got the garlic fried rice with egg, vegetable fried dumplings and vegetables with egg over rice. Food was delivered through caviar, food still made it to me great. Reasonably priced. Highly recommend this place.", "author": "Mohammad A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-12-05", "description": "we were shopping in the area so decided to stop in for lunch. the setup has cashiers but also can self service and order via the pad which is what we did. the seating is open without service so you get your food and sit and eat. we over ordered but also spent a fortune considering what Shanghai food would have cost us if we were in Chinatown. everything was decent but not for the price we paid. if you've never had shanghai style then this is a good introduction at a premium. nothing was that amazing that we'd go back anytime soon. I'd also wished they had more meat based dishes on the menu because everything was on the lighter side.", "author": "Sasha C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-01-18", "description": "A place for a quick bite. Nothing special about it.  Food quality is similar to Chinese fast food. Not impressed.", "author": "Angel Z."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-22", "description": "Yaso Tangbao\nNY BK Downtown\n6pm Tuesday 20th December 2016\nFive Stars\n\nI didn't want to like this place but it's pretty amazing. It feels like Xian Food decided to open a Shanghai style eatery. You order by letter and number. We enjoyed:\n\nY1: Pork Soup Dumplings ($5 for 4), \nY3: Spicy Pork Soup Dumplings ($5.65 for 4), \nG5: Chinese vegetables sautéed in garlic ($5.5)\nN1: Beef Noodle Soup, ($11.50) and \nB4: Hot and Sour Soup (3.50).\n\nThe dumplings were delicious and are freshly made. The skin was translucent, al dente, and had an opening at the top for ventilation. The meat had a perfect balance of lean and fatty pork. The broth was warm and unctuous. The only down side was that 3 of the 12 dumplings stuck to the paper and broke before getting to my mouth. \n\nThe Chinese vegetables were crispy with plenty of garlic. The beef noodle soup was not as good as xian food's tingly beef noodle soup. The noodles were very spaghetti like, the Braised beef was tender, the mustard greens and bok choy were tasty. The hot and sour soup was mediocre but worth the three dollars. \n\nThe place was crowded and the guy who shouted out the numbers for food pick up was confused. We found a bench seat along the wall. \n\nOverall very satisfying.", "author": "Leonard L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-12", "description": "These may be some of the best dumplings you can find in at least this part of Brooklyn without having to go to chinatown, brooklyn. Portions are a bit small, quantity wise - $6.95 for 4 blue crab and pork soup dumplings, but the quality is worth it. I've tried the above soup dumplings with perfectly tender skin. The Yaso pork bao which are like big pillowy clouds with roasted sesame seeds on top and stuffed with pork. But not an ample enough of pork. Pork Shao Mai - always pretty good. The green garden vegetable dumplings are shockingly incredibly tasty and packed with great flavor for you vegans out there. Their Shanghai cold noodles could use some more peanut sauce but the heat was good and the noodles had a nice texture. Fried chicken cutlet fillet was dappled with a nice hoisin sauce that I treated myself to smearing it all over my dress. \n\nMost surprising are usually their specials. I've only been here once but they keep coming out with innovative treats and dumplings. When we came in for our feast of all feasts before thanksgiving there was a cheese soup dumpling and it was pretty outrageously good. My favorites out of everything though would be the traditional crab and pork dumplings and shockingly the vegetarian. Nice set up here. They have long picnic tables and all the condiments are set to the side so you don't have to bother anyone about needing another bucket of sriracha sauce. There is usually a bit of a crowd. At least when I came in, which was a weekday during lunch time and I managed to take the day off, jam packed. Kind of surprised. But that just means this place is doing well!", "author": "Ingrid S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-02", "description": "Amazing soup dumplings that actually have soup in them as opposed to other dumplings that claim to be \"Xiaolongbao\" -- \n\nYes, you only get four but the size of each are almost equal the six you can get at other dim Sum joints... \n\nAll in all -- fast service, not pretentious and reasonably priced makes this a \"repeatable/ regular \" place for future dumpling cravings !!", "author": "Thomas M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-20", "description": "Took a stroll to one of my favorite places, Yaso Tangbao, a quaint little place that serves some awesome Shanghai Street  foods. I had frequently dine at this place before. Gone are the days of watching the elder Asian mom and pop behind the glass wall putting together the food inside the dumplings, causing the juices from the meat/chicken/ pork to become the most delicious soup EVER! #YUM!!!\n\nNow the next generation has taken cover to continue the preparation of Delicious meals. For those of you who are vegan, they have a few selections of vegan/vegetation foods as well... Just go to the website and make your own choices... thère are quite a few selections...\n\nThe preparers are a little young, but they were taught to prepare great food. Just finished my dumplings and the video\nand I am developing what is known as the \"itis\" time for me to start heading on home before it rains! I loved the food, but the choice is up to you to try the food... \nCheck out the website, go pay a visit and have a great-time! #ENJOY!", "author": "D R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-18", "description": "Fried egg was super rubbery.... Not that much protein. Flavor is ok though. It's nice that you can customize the meal.", "author": "Danbi L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-21", "description": "I'm a fan! Yaso Tangbao has a great selection of noodle dishes and side dishes! I really like their fried chicken noodle soup and their beef noodle soup. Their soup dumplings come with a cute biodegradable spoon thats friendly for the environment, holds the fat dumpling well, and doesn't soak through. That's awesome lol. \nI also love the fact that they package to-go orders very well. They separate soup and noodles and they make sure the package will be safe from spills and leaks.\nApparently they have a new menu coming out, so definitely excited to come back.", "author": "Jodie Z."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-12", "description": "I had so much fun eating here with their \"fast food\" like service.  You order at the front and pick up your food and sit somewhere in the communal tables.  The pork dumplings were slightly different than soup dumplings I've had before.  Still pretty good and filling.  The chicken katsu was fried nicely.  The sweet and sour pork was pretty heavy and greasy.\n\nYou eat the soup dumplings with a paper soup spoon that was just the cutest thing I've seen.", "author": "Nancy P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-28", "description": "Good options for vegetarians such as tasty Wheat Kao Fu (wheat \"meat\") and Soy Garlic Noodle w Cilantro (yum noodles in a delicious sauce).", "author": "Sarah J."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-09-14", "description": "I love soup dumplings and these just didn't do it for me. I order one of each (pork, crab, spicy crab), sweet and sour pork ribs, and braised beef noodles. I was told there would be a 20 minute wait for soup dumplings, which was fine since it'll be fresh. After 35 minutes, we decided to ask them where our order was. It's a busy night, we get it. But I would have gotten my soup dumplings by now if I ate at a sit down restaurant. \n\nWe get the first half of our order which was the pork soup dumplings, the beef stew noodles, and the pork ribs. I was so disappointed when the soup dumplings weren't pipping hot, but at this point I was so hungry I didn't want to ask for another one. The pork dumplings were warm. I didn't even have to let it sit or blow on it. To make it worst, it lacked flavor. There wasn't enough flavor in the soup or meat. I let it go, hoping the others are better. Another 15 minutes later, we get the crab and chili one. The crab was probably the best choice out of the 3. It has the sweetness of crab, but still lack some flavor. The spicy pork one is a skip for me. All you taste is oil and it's not even spicy. You can't even taste the meat because the oil overpowers everything.\n\nThe braised beef noodles is also a skip. You can get better beef noodles for a cheaper price elsewhere. Not only that, what you get doesn't look like the picture. What you get looks more like the diced pork one. It got me confused for a second.\n\nThe best thing out of all would be the sweet and sour pork. This was the most flavorful thing we had. It's actually sweet and not really sour. The bones easily came off and it wasn't dry. I'm hesitant to even come back even though the rice dishes look kind of good.", "author": "Vivian Y."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-21", "description": "This is a gem hidden in downtown Brooklyn!  If you're familiar with Xi'an Foods, this feels like a similar type of place but higher quality.\n\nFood: We ordered the XLB, pork buns, and the cold noodles.  The price is pretty decent and cheap for a dinner out!  The food is good but don't expect it to be the best Chinese that you've ever had.  XLB are filled with soup but the exterior is a bit thick.  The cold noodles were refreshing.  \n\nSpace:  It's always packed at lunchtime and was also crowded on a Friday evening.  There's plenty of seats though so you can find seats with a small wait at most.  You order at the cashier and bring the food to your table so you don't need to worry about service. \n\nDefinitely will return for good, cheap Asian food!", "author": "Brandon P."}], "servesCuisine": "Shanghainese", "priceRange": "$11-30", "name": "Yaso Tangbao", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "148 Lawrence St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/n8qkl-utd4uCMlOy46G05g/ls.jpg", "@type": "Restaurant", "telephone": "+19293377599"}