{"aggregateRating": {"reviewCount": 704, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-24", "description": "As a Shanghainese, I am pretty picky on restaurants who are trying to sell Shanghai cuisine, but this place surprised me by its sweet and sour pork ribs and braised pork meatballs. I've tried to make these dishes at home but the experience was not that satisfactory, but Yaso TangBao has done a perfect job in making these traditional Shanghai cuisine perfect. Later on, I tried their Soup dumplings and other dishes. All taste good! Plus the serving is pretty big and a noodle bowl can feed a couple.", "author": "Jilin Z."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-17", "description": "I was really excited to finally be in the area to try out  the newest Shanghai hotspot located in Downtown Brooklyn. It was afternoon/lunch time, Downtown Brooklyn is filled with other businesses, companies and offices so I knew there was going to be a wait. Since I had a time limited lunch hour, I decided to order pickup online via ChowNow. ChowNow is the ordering online system specifically used by Yaso Tangbao in which all of the sale revenue will go directly to the restaurant instead of other commission based takeout systems. Ordering online definitely saved me a lot of time because I just walked in and my order was ready. I was really happy that my order was ready since I'm 15 minutes earlier than the time I specified, however if I wasn't early, that would've meant I would be receiving cold, soggy soup dumplings by the time I get to eat them. My order was just sitting there all packed, not  anywhere within a warm atmosphere. And I believe hot soup dumplings is the best way to go. Just to justify the restaurant on their end, they do highly recommend customers dine in when ordering soup dumplings (on the ordering system). I did consume my soup dumplings inside the restaurant and it was warm already. I'm glad everything kind of worked out for me overall with the timing but c'mon what if I really was picking up the time I specified, I would not appreciate my order made too advanced of it's timing so I would like to conclude that Yaso Tangbao should work on their timing because pickup is eventually a big part of your business. I have no idea how long my soup dumplings were sitting there for. \n\nThe restaurant is a self-serving kind of business, I guess you can say Chipotle setup style. You walk and the line is on your left with many communal seats and tables for you to sit at with friends or independently. Then the pick up area is in the inner right side from the entrance. All utensils and condiments are located at a side station with a trash compartment for you to self-clean (or not depending on how much etiquette you have) the menu is really close up by the front of the line, which kind of does give customers the opportunity  to think about what to order until they get up close to the register. However, the menu is nicely printed with pictures to match along each description. The paper menus are also located in the front by the register. \n\nThe pork soup dumplings and blue crap soup dumplings were amazing, not the best I've had but I'm very glad to have tried it. The cost to keep this place running is probably costly so that makes it hard to make the prices on the menu more affordable. In other words, I would still rather eat my soup dumplings in Chinatown where it's a better portion for a better price. I can't be having a single $20 Lunch a habit. The drunken chicken was very disappointing, it was a total waste of $5 for a few tiny pieces of disappointment.", "author": "Carrie C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-02", "description": "Used to come here a ton and loved it! After they expanded and reopened, the bao, which were soft and yeasty, are now industrially moulded hockey pucks. To add insult to inedibility, today they were still frozen in the center. When I told the cashier they were frozen, the replacent order didn't fare much better. \n\nThe xlb have also become doughy and overly porky, as if the seasonings were off. They also, today,  forgot them... twice!\n\nA good idea has gone terribly wrong to the tune of petit commerçant cum greedy landlord capitalism. \n\nPlease return quality to the mix. If I wanted reheated frozen bao, I could get better in a convenience store warmer.", "author": "Andr D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-17", "description": "Solid soup dumplings in a more cafeteria-style setting. Is it the best soup dumpling I've ever had? No. But it isn't far from it and it's definitely convenient and QUICK! It is a satisfying, good meal when I'm craving Shanghainese food and don't feel like trekking out to Chinatown (not that it's far but a girl's gonna be lazy sometimes). Close to Metrotech so it's close to my boyfriend's grad school classes, too.\n\nWe've gotten the soup dumplings (pork and crab, all the way) a number of times and they're always good. Not greasy! I got the fried sticky rice last time cus I was starving and wanted something to eat with the dumplings without ordering another full-on dish. It was good and I really liked the texture. It's sticky rice, pressed into rectangular blocks and lightly fried, with a sauce on top that's like a not-spicy version of spicy mayo... maybe a play on Thousand Island dressing even. Weirdly, it works and I enjoyed it. We've also had a couple of the soups and those were great too. I like the decor and layout too. Def recommend!", "author": "Sahar N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-27", "description": "I was lucky enough to lunch here for a year. It is literally impossible to leave disappointed.", "author": "Dennis O."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-07-08", "description": "Way overpriced for that type of food! I have had better and half the price or double the portion. I got 3 different dishes and left hungry. Mind you, Im size Small and don't need much.  \n\nHow many ribs came in the portion I asked, the answer was 8 or 9. Which technically is true, except its 1 or 2 max cut into 8 or 9 pieces. Also, had better soupy dumplings at Joe Shanghai in China town that serves 8 per order for the same price.\n\nShanghai is a part of China, so I gather the concept of this brand is: lets call this Shanghainese, make Chinese food, reduce the portion to a bite size to make it fancy and charge full Chinese food prices. \n\nThey did spend money on the brand developing, nice logo and interior decor. Its nice, but Im still hungry.", "author": "Nataly H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-27", "description": "The food is good but cannot believe how inefficient this store is. The operation does not seem stream lined at all. Takes more than 30 minutes to get food on a not so busy day.", "author": "Yanqi W."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-05-23", "description": "Should be 4 maybe 5 stars for the food, but they lost 2 stars just for the customer service.  I ordered a 71.10 pickup for my office, and arrived early to make sure that they included the free spicy dumpling offer.  I even put the reminder in the comments section of the online order.\n\nSo when I got back to the office and it was not in the bag I called back and let them know, and they took my number and name and said they would give me next time I come in.\n\nTHEY THEN CALLED ME BACK AND SAID THEY CHECKED THE CAMERA AND SAID THEY GAVE IT TO ME THE ORDER. Wow!!!!  I then had to go over the bill slowly and then demanded they check the camera again.  10 minutes later they call back and go they will give me my free dumpling (ONLY 4 DUMPLINGS) again.  I go was I right??  Yes you were right.\n\nI will never got back for my free dumplings, as im still shocked you fight me over 4 dumplings for an over 70 order.  Who does that???\n\nFood wise my blue crab and pork dumplings was great and the best crab dumplings I ever had.  Loved the ribs also and my coworkers enjoyed their bowls and dumplings.\nShame I will never go back as I did enjoy the food", "author": "Deacon H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-06-09", "description": "Went to this place for lunch and had the braised beef noodle soup. Decent flavor for both the beef and the noodles but the texture of some of the beef pieces was a bit rubbery.  \n\nShould have tried the xiao long bao (soup dumplings), many people around me were eating them and they looked very good.", "author": "Tim R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-19", "description": "The best quick food I've had in a long time. I would never call this fast food at all even though you do get your food just as quick as you would at McDonald's. The food is extra fresh and to die for. The service was quick and good. They are very friendly and provide a warm family environment. I\nWill be returning very soon...", "author": "Jasmin O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-11", "description": "Best soup dumplings. Sometimes the dumplings take a while but it's worth the wait. They were having a few hiccups because of their rapid expansion but they made it up to us by temporarily lowering the prices until the kinks were smoothed. Excited for the reopening. Miss my weekly dumpling outing.", "author": "Truckie P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-09", "description": "This is really a gem in an area generally lacking good Chinese food. \n\nVery good southern Shanghai style soup buns, and has a nice, clean trendy interior. I haven't tried the delivery service as it is just a short walk away.", "author": "Andrew A."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-06-01", "description": "terrible  service. food wasnt that good for a 45 minute wait on some pork buns and shumai.... i would not recommend this place that value their time. when i went to question why my food was taking so long, an employee rudely tells me \" we are making it now\". that was one of the worst experiences i've had. okay food, long wait time, rude staff, no thanks. i will not be going back.", "author": "John X."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-09", "description": "Extremely authentic flavor. I haven't had Kao Fu with this flavor outside anywhere in the US. Instantly transported me back. Plenty of vegetarian options too. Thanks so much Yaso Tangbao!", "author": "Alex M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-15", "description": "Omg, I'm in love with this place. This is my second day eating here for lunch.  Yesterday I had the dry noodles with pork. Can you say delightful.  I also brought the steamed pork boas that I ate for dinner.  I would recommend  everyone try this place at least once", "author": "Cashana B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-14", "description": "Fast food Shanghai food. Lots of space and lots of choices from the menu to choose from. The soup dumplings were ok for being a fast food place.", "author": "Cindy L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-02-19", "description": "Eaten from here twice now, once was delivery, the second time was at the restaurant for a late lunch. The braised beef soup and sweet and sour ribs are my favorite. Very comforting on a cold day.\n\nThe soup dumplings are good but small, and not the best I ever had. (That honor goes to a place in Flushing.) I'm glad to have a location in walking distance when I'm craving some of the mentioned items. But if I REALLY want the good stuff, I still have to get on the subway.", "author": "Erica M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-30", "description": "Fast counter-served Shanghainese food \u0026 Soup dumplings = thank you for coming to Downtown Brooklyn, the hood needed you. When I saw this place while I was in the area, it honestly looked like a 25 year old at a high school dance... \"what are you doing here???\" - with the other places in the area this one looks much more presentable. I had the vegetable crispy noodle with a side of crispy chicken fillet because there is no way in hell I could ever be a vegetarian. Both were delicious but the prices are a little over the moon. And though pricey, it's nice to dine in as you are opting for a clean, welcoming, and cozy setting.", "author": "Shakira W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-25", "description": "Being on a poor student's budget in Manhattan, I'm not exactly surprised I had to come to Brooklyn to find affordable, but more importantly, delicious AUTHENTIC Shanghainese food. I decided to give the relatively new restaurant a go since I really wanted that home cooked feeling that I just don't have time for myself. Their xlb are excellent, with the soup just oozing out after you take the first bite. Not the best I've ever had since the skin could be a little thinner, but sooo good. The black vinegar and ginger came on the side, which was great for me since they were willing to give me extra, while the tourists next to me didn't even brave tasting it!\n\nI also tried the Braised Pork Meatballs w/ Egg over Rice. It sounds so weird to translate to English... (There's certain dishes in every culture that have nicknames that just don't make sense in any other language) My biggest gripe was that there was too much rice and lacked a yellow pickle, but the flavor of the Meatballs were so spot on! It was also quite large. Since everything in the bowl came in twos, I really feel like this could be a shared dish.\n\nEven though I ate in, there were only cardboard spoons and takeaway chopsticks, which I felt added to the authenticity of the meal. I can understand how other people don't like it, but it feels like home.", "author": "Kimberly C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-07", "description": "I found this place during my break for Jury duties. I ordered the Blue crab with pork dumplings and a spicy diced beef noodle soup and it was delicious. It was a bit crowded but overall it was really good. The blue crab with pork dumplings came in 4 as a order. On the inside, it was really juicy and full of soup. For me, it was worth the price. I would like come here again to try the other type of noodle soup and dumpling or even the dessert that they serve.", "author": "Anna Q."}], "servesCuisine": "Shanghainese", "priceRange": "$11-30", "name": "Yaso Tangbao", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "148 Lawrence St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/n8qkl-utd4uCMlOy46G05g/ls.jpg", "@type": "Restaurant", "telephone": "+19293377599"}