{"aggregateRating": {"reviewCount": 704, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-26", "description": "Mmm soup dumplings. The dumplings were delicious and I liked that they gave you the appropriate utensils to eat them. They are a fun treat!\n\nOtherwise, I got the breaded chicken soup. It's definitely heavy, but the broth is top notch. I recommend. \n\nService isn't the friendliest, but they are relatively quick. Great place to try in an area that is hotel/conference heavy and doesn't have the most exciting options. Solid 4 stars!", "author": "Nisht G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-01-12", "description": "Such potential... but such disappointment.\n\nmy friend and i got there at 11am on saturday, right when they opened.\nfood:\n- soup dumplings: both pork and the pork/crab ones were good. good flavors BUT... the soup inside was barely warm. Usually, i have to be super careful not to burn my tongue from eating soup dumplings too quickly, but this time it was just warm... ugh.  it let me eat it quicker/easier but took away flavor and experience. moreover, we were there at opening time, so they should have their freshest products!\n-sweet and sour ribs: this wwas really good. sauce was great. .meat on the ribs was tender and juicy. realllly good. \n-mapo tofu over rice: flavor-wise this was really good. but once again the tofu was mildly warm (but the rice was very hot)\n\nI don't know why their foods were so lukewarm. My guess is that the food isn't fresh and they just heated up something premade from last night which would be terrible... i'm hoping this isn't the issue. \n\ntheir prices are also pretty high for shanghainese food. For the amount of food I ate, i paid a little too much. probably because they are in brooklyn.\n\nOverall.... if they had cheaper prices and actually fresh food, this place would be great! there was a lot of good flavors and potential, but this visit for me was so disappointing.", "author": "Yong K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-18", "description": "Great new Shanghainese restaurant with excellent soup dumplings. They are every bit as good as those at Joe Shanghai (where the chef is from) but without the wait for a table. I also really enjoyed the hot and sour soup. I didn't have one but my friends really liked the drink selection.\n\nIt's a nice, sleek interior and there is plenty of seating. Highly recommend.", "author": "Eric W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-08-08", "description": "Not a bad spot for the soup dumplings, but the beef noodles are below par. Nothing about it seems to be made with care or dedication. I'm not looking for a ramen style bowl of noodles where the broth is made over hours of preparation or the noodles are designed by Sun Noodles, but if it's something you want on a cold and windy day and there's absolutely no other choice, okay. (btw, Ganso Ramen is just a few short blocks away). We also had the steamed buns and Shanghai Cold Noodles, which were both okay. \n\nWe still need to go back to try the rice bowls, but it's relatively pricey when you compare it to a few other places that are either better quality or same quality but more affordable and just a few blocks away.\n\nThe seating is communal, so be prepared to share a table if you're down for that.\n\nAfter the rice bowl run, I doubt we'll head back. We dropped around $30 for four dishes. My opinion might be skewed because I still remember prices from the 1980s and 1990s for the same food, but better quality and generally lighter on the wallet (I'm taking into account inflation, folks, but still).", "author": "1st M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-01", "description": "Oh man. I've come here more times that I'd like to admit, but the close proximity to my apartment (and deliciousness) is hard to ignore. The spicy pork dumplings are the way to go -- I found the original pork ones to be oddly sweet. I also love the fried pork baos, the chrysenthemum tea and the spicy pork noodles....oh oh and the mapo tofu. Ok, I love the meatballs too. So happy to have them in the neighborhood!", "author": "Shu Jin S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-18", "description": "Very good restaurant! \nBeen there for the first time today, really enjoyed the vegetable soup with noodles, crab dumplings and cury noodles.\nWell decorated, clean, very good vibe .\nHighly recommended!", "author": "Yael I."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-22", "description": "Why didn't they have this place here when I was still attending school in this area?? I would have eaten here for lunch between classes every day if this existed in the area, but instead, I was stuck eating cafeteria food. So, I had my eye on Yaso Tangbao because a friend of mine posted a picture of the cheese soup dumplings, so I knew I had to try them! The chef there was also former executive chef of Joe's Shanghai, back when it was not overrated. That was another reason for me to try the soup dumplings here! \n\nI came here with two friends on a Friday night around 6:00PM and it was pretty lively at the time, but not too crowded. We didn't have to wait in line too long to order. It is one of those places where you order and pick up your food at the counter when they're ready. It's not a large restaurant and most of the seating is communal style, so you'll be seated next to other guests. They have a utensils and condiments station with their house ginger and vinegar sauce, soy sauce, and sriracha (yesssss!!). We didn't have to wait too long for our food to be ready.\n\nI love that the soup dumplings came in fours, so we were able to try more flavors. We had two orders of the spicy pork and one order of the three cheeses and pork. We also ordered pork shao mai, sweet pumpkin cakes, braised pork meatballs over rice with eggs, and mapo doufu over rice with eggs. I really loved both flavors of the soup dumplings. I also liked their ginger vinegar, it has a unique taste and I didn't think I would like it, but I actually used it with every dumpling! The three cheeses and pork soup dumplings had a little hint of sweetness in them, but I actually liked them a lot and ate more of those than the spicy pork. The broth was nice and thin, just the way I like my soup dumplings. The skin was also thin, but not thin enough where it will break with a brush of my chopsticks. The sweet pumpkin cakes had more coconut flavor than pumpkin, which was a little disappointment because we ordered them because we love pumpkin. The mapo doufu, which was my entree, had a lot of flavor, not too spicy for me, but the egg was a little too fried for my liking. \n\nOverall, I loved it here! Their soup dumplings did not disappoint! I also liked the ambiance of the place. The downside is that it is a little out of the way for me, but I would love to return whenever I'm close by.", "author": "Lorraine C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-16", "description": "The blue crab dumpling tasted delicious and the pork was very juicy. I loved all of the dumplings and the soup looked really good even though I didn't get it. You order and take it to your own spot which I really like. The only problem I had was with the water dispenser. It let out water by literal droplets, so you either had to stand there for 5 minutes to fill one cup or go waterless, which is terrible when you're eating such high sodium food. Other than that I thought the food was great and the pricing was good. You can get totally full off of like $15 a person.", "author": "Ani S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-04-01", "description": "Food took forever to come. Was number 86 .. other orders were called and when I went to ask the worker replied with \" we are making it\" in a rude way. The food wasnt even that good. I only ordered 2 things..", "author": "Shirley S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-02-26", "description": "I've had delivery here a few times and throughly enjoyed the pork soup dumplings. They are very flavorful and full of that yummy juice! \n\nI will be ordering again and again just for these soup dumplings!\n\nI wasn't impressed with the veggie (mostly tofu) or pork dumplings.\n\n I got another noodle dish with veggies and did not like that either. All the veggies were brown and wilted like they had been overlooked for hours. Noodle part of dish was decent.", "author": "Kelly G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-06-07", "description": "I left a review before about how I was a fan of this business.\n\nI changed my mind.\n\nA bowl of soup...ramen is 10 dollars.  Which is fair.   \n\nI got some chicken and vegetables with a few noodles in the latest bowl.  They're using tiny bowls and you get about half the food for the same price.  What was a decent value has become a disappointment.  I mentioned it to the man serving me, and rather than offer a solution to the situation he tried to tell me it was the same size.  It's not even close to the same size, and I don't appreciate someone denying the obvious.\n\nI am finished with yaso...mostly because it's no longer a good value.  I suggest you also keep it moving.", "author": "Julian M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-04", "description": "Have been here a couple dozen times and always love it. My last visit however wasn't the best. All the food was served in plastic to-go containers rather than bamboo steamers. The containers are too small and all three orders of soup dumplings sat on each other and everyone would rip when trying to pick it up. On top of it being a huge waste(think about the sea turtles) it greatly affected the dumplings. Besides that everything was good as usual.", "author": "Kevin N."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-06-09", "description": "Go try the soup dumplings\n\nPros: soup dumplings are good, also try the blue crab soup dumplings\nCons: other menu item are overprice and doesn't looks as appetizing. The owner decides not to use AC on the 85 degree afternoon.  The drink menu is limited, seating does not have the best arrangement.\n\n-A", "author": "Andy L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-07", "description": "Overpriced Shanghainese food at its best. \n\nCrab pork xiao long baos\nFlushing - $6.95 for 6-8\nYaso - $6.75 for 4\n\nBraised beef soup noodles\nFlushing - $5.95\nYaso - $11.50\n\nBottom line... It's pricey but the food is decent. The soup dumplings are freshly made and they do taste good. \n\nNot a bad place to eat given the limited options in the area.", "author": "Brian L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-12-27", "description": "Passable but not great. Make the trip to Chinatown if you want real Shanghai soup dumplings.", "author": "Tony L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-05", "description": "Vibe: cozy\nDecor/seating: mostly picnic style bench seating\n\nHave been looking for good soup dumplings around the neighborhood after moving here a few months back, and was pleasantly surprised by this place! Loved the soup dumplings.\n\nAlso ordered the braised beef noodles, which were decent but not as great as the dumplings.\n\nLived in Asia for a while and now I've found my new favorite spot in the neighborhood! Reminds me of home.", "author": "Amanda H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-07", "description": "Soup dumplings in Downtown Brooklyn. Close to where I live! They're quite flavorful and have appropriately thin skins. They're more expensive than in the Chinatowns, but that's what you get for being in this neighborhood.\n\nThe khao fu--gluten with mushrooms, peanuts, etc., was really good and unobtainable in any place around here. We've also had the braised beef noodle soup--great flavor and beef, but the noodles are a little character-less. \n\nI've been waiting for a REAL Chinese  (of any region) restaurant to show up in this area, and my patience has been rewarded.\n\nYou order at the counter and sit at the bench/table things they've got going on. A perfunctory selection of cold drinks and I haven't even noticed if there's tea.", "author": "Penelope C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-01-25", "description": "Perhaps i'm a bit biased since I've lived in Asia for over a decade but having experienced Yaso Tangbao, there's a lot of things i noticed which made my experience less than stellar.  The xiao long baos are fairly priced, 4 baos for 3.50 usd.  What really irritated me was that their dumplings in sweet spicy sauce (6 pcs) was 6.50 usd.  Whoever was designing their menu is a profit genius for using the xlbs as a breath taking item to attract orders of other items..effectively sourcing their profits from all the other menu items.  Simply put, everything but the xlb's are a rip off.  I'm sad that good simple food has to be this relatively expensive.  That's what happens sometimes when you try and export foreign food to America.", "author": "Howard M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-03", "description": "The soup dumplings are authentic enough and quite tasty, albeit slightly over-priced.  If you are on the supermodel diet, then getting one order would be enough.   I also ordered the garlic cucumber salad, again over-priced.  However, the place appeared quite clean and service was speedy. I would probably come here again.  Definitely authentic Chinese food.", "author": "Lan L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-20", "description": "Love this place. I spent a Summer in Shanghai, and grew a real fondness for soup dumplings. Of course, Yaso Tangbao specializes in them. No surprise, but I recommend them highly. Also, the sticky rice dumplings are super tasty! They're a little sweet, but awesome if you don't mind that.\n\nThe other items are ok, but maybe a little hit and miss. I saw that some people recommended the meatballs, but I think that's a matter of preference. I find them a little mushy and undercooked. My wife likes the pork buns, but I find the filling a little oily. Again, probably a matter of preference. I really like the drunken chicken, but most people will be put off by cold chicken.\n\nI almost only eat there at the restaurant. We got it take-away once and it was ok, but not as good. The food really gets a lot worse when it cools. I imagine that delivery would make it even worse, so if you see bad reviews, check and see if they're delivery. Yaso Tangbao uses a third-party delivery service, which will probably add delays to the delivery and make it more likely that it arrives cold. So yeah, if you're going to eat from here, I suspect you'll do much better eating at the restaurant.", "author": "Noah S."}], "servesCuisine": "Shanghainese", "priceRange": "$11-30", "name": "Yaso Tangbao", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "148 Lawrence St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/n8qkl-utd4uCMlOy46G05g/ls.jpg", "@type": "Restaurant", "telephone": "+19293377599"}