{"aggregateRating": {"reviewCount": 704, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-22", "description": "Love, love,love this food. Delicious spicy pork dumplings are my favorite. Also love the Wonton soup. The curry is lovely and mild. The big soups are all good with great noodles. The stir fried chinese greens are yummy as are the ribs. It's a bargain for quality, authentic Shanghai cuisine.", "author": "Jane R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-19", "description": "Pretty decent food here at OK prices. The pork dumplings are delicious. The soup is pretty good. Will come back for more.", "author": "John L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-09-25", "description": "if i had time, i would take the train across the bridge for cheaper pricing and same quality food.  good food for the area, but not AMAZING that i have to return.", "author": "Amy L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-12-02", "description": "Good soup dumplings but Joe's Shanghai is better. Noodle soup is good too. Skip the chicken curry.\nYou can technically order out but for soup dumplings - don't, they're made to be eaten hot.", "author": "D Z."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-11-23", "description": "i really wanted to give Yaso a 3.5 star. \n\nThe main complaint is that there is not enough value for this type of restaurant: casual Asian fare with a focus on pick up/delivery, lunch crowd consistency of office workers and students, and locals. Portions are relatively small compared to what you would get at other Asian shops. \n\nThe soup dumplings are great for the neighborhood, but not among the best in the NY area; overall great serviceable for a neighborhood spot. The spicy soup dumplings probably use a mix with paprika, and reminds me of spicy Doritos. Many of the rice dishes are average and serviceable with the exception of the meatballs, which are great. I just wish I can get more of it per order. \n\nThe cold noodles are on the greasier side. \n\nI have not tried the other appetizers, but they could be the standouts on the menu. \n\nThis restaurant is well covered by many of the delivery services in NY.", "author": "Quincy L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-25", "description": "Great new addition to the neighborhood. Casual, fast and easy. Ribs were delicious! Cold noodles were ok. Soup dumplings were great.", "author": "Julie J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-19", "description": "Best soup dumpling place in NY! As Chinese, have to say it's really authentic--exactly like food from home!", "author": "Linda W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-18", "description": "I've been a few times. Thank god we've got some decent Shanghainese food in downtown BK. The food is tasty. It ain't Chinatown, but it's the best we've got. Definitely too expensive for what you get (small portions), but it's good quality. I wish the seats had backs, but otherwise it's easy to find a spot to sit. All-in-all, a welcome addition to the neighborhood!", "author": "Andrew L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-08-20", "description": "Went back the next day to try new things, and everything was bad to eh. We got the chicken curry rice, the beef noodle soup, the ma po tofu, and the Chinese greens (currently gai lan - Chinese broccoli). The chicken curry was sweet, the fried egg was precooked and COLD, the beef noodle soup was ok but the noodles were too soft and not Q (chewy) and the beef was dry and there was a tendon that wasn't cooked long enough so it was tough and inedible, and everything was way too salty. I still think everything we had yesterday was fantastic, so I would come here and stick to the left side of the top row of the menu. Honestly, if we weren't in Brooklyn for a convention and within walking distance of this place, I would go to Joe's in Chinatown (the Shanghainese restaurant of my childhood). I know it's a tourist trap and there's a line down the street, but it's still there decades later for a REASON and there's a line down the street for a REASON. (Do NOT go to the Joe's in Midtown -- YOU HAVE BEEN WARNED) (the one in Queens is not as good as the original either).", "author": "Ataru N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-20", "description": "Loved the curry noodles!  Around $10+ a meal so will not be a regular customer on a student budget. Maybe once a month :D", "author": "Sabreen M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-11", "description": "Really good soup dumplings in an area that does not have a whole lot going on like it. No, it's not Chinatown or Bay Ridge but for the area they are pretty darn good. I also had the sautéed Chinese greens with tons of garlic, needed a little soy sauce and vinegar but hey, they have a whole water dispenser full of soy sauce at the condiment counter so no worries there!", "author": "Sasha K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-11", "description": "Love, love, love Yaso. They have a great selection of Shanghainese food, including one of my favorites of all time, soup dumplings! I also love the chicken curry crispy noodles and the Shanghai cold noodle. Great addition to the neighborhood for eating in as well as delivery (although the soup dumplings won't be as hot as they should be).", "author": "Giulio D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-30", "description": "Great addition to the neighborhood. I've lived across the street for a few years and have been waiting for something like this to come for a while.", "author": "Mike P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-11-30", "description": "This place was okay. The prices are reasonable, and it's a great location, but I found the food to be just okay. I had the soup dumplings, the crab pork dumplings, and vegetables over crispy noodles. \nThe meat in the pork dumplings was delicious, but the soup inside was so-so. \nCrab pork dumplings were good. Again, meat was great, but soup was nothing to rave about. \nWould probably not come back.", "author": "Jeremiah S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-18", "description": "pork soup dumplings - amazing, some of the most flavorful soup dumplings i've had\npork ribs - very tasty, not to fatty\nvegetable dumplings - pretty good, nothing exciting\nGarden Vegetable Crispy Noodle - would not recommend. the sauce felt slimy and didn't taste too great.", "author": "Brittany R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-13", "description": "I can't speak for how good the xiao long baos are since I don't eat pork, but I tried the sesame cold noodles and the noodles with garlic cilantro and soy sauce. I enjoyed the sesame noodles more since they weren't as salty and the noodles were chewier. Definitely try the handpulled noodles. I also had the veggie dumplings and they weren't bad but you pay more than Chinatown prices for only 4 in a bamboo steamer. Not the best price for value but certainly not bad for a Shanghainese place in downtown Brooklyn.", "author": "Melissa L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-22", "description": "While I am normally wary of Chinese restaurants due to their use of MSG - and its consequential migraines - Yaso was a good surprise. The portions are very big and filling. Good quality meat. The chicken is clean cut chicken with no nerves. \nOn different occasions, I've tried the chicken curry on rice and eggs, the pan fried buns, and the braised pork meat balls soup. All three were very good and filling. \nI also tried the soup dumplings for the first time; the eyes of the staff were on me, curious to see how I would handle the mission of eating these juicy treats. I ended up eating them with my bare hands. \nThe soup dumplings were delicious and I provided free entertainment to the staff. They are tricky to eat with chopsticks, so I picked them up, bit the top off, and drank the broth off them. Then I popped the rest of the dumpling in my mouth. I'm pretty sure that's not how you eat them. They were amazing. \nYou could split in half one order and feel just fine. The appetizers are conspicuous too, and they may make up a meal. \nIt is reasonable priced. They do not serve tea or coffee...just soda and water. I like to take out because my house is very close and I do not feel like always drinking soda.\nService is very nice and the menu is easy to navigate. They offer few items, but they are cooked great.", "author": "Dullua C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-09", "description": "Best Chinese restaurant I have been to in NYC! Definitely try the spicy pork soup dumpling and shrimps! Dishes come out fast and service is great! Great ambiance!", "author": "Yun L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-10", "description": "Cheap, delicious, and the real thing. Bao and soup dumplings are the biggest winners, but I haven't tried anything that disappointed. Nom nom nom. I'm obsessed.", "author": "Cara T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-22", "description": "Easily the best dumplings I've had in Brooklyn. Unsure if it's a match for the soup dumplings at Joe's Shanghai, which were heretofore my favorite, but they left absolutely nothing to be desired: adequately soupy and flavorful, with unique flavors between the pork and crab options, which is rare in soup dumplings. The buns too were incredibly juicy and delicious. Order as many of the dim sum options as you can; the sampling I had was tremendous.", "author": "Tim F."}], "servesCuisine": "Shanghainese", "priceRange": "$11-30", "name": "Yaso Tangbao", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "148 Lawrence St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/n8qkl-utd4uCMlOy46G05g/ls.jpg", "@type": "Restaurant", "telephone": "+19293377599"}