{"aggregateRating": {"reviewCount": 704, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2019-02-08", "description": "Way overhyped. Mediocre fast food served by adolescent and perpetually confused waitstaff. Bland food, poor selection, ugly street. Avoid.", "author": "Romanos F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-20", "description": "I passed by and stopped here for a quick lunch. Regrettably I didn't try the dumplings since I had some the other day, but I got the beef noodle soup and it was ok. It was a little pricey for noodles, but the flavor was much better than expected.\n\nThere was pickled cabbage with contrasted really nicely since it was crunchy and a little sour with the beef soup. The braised beef usually comes in slices in my experience, but was chopped up here. There were medium thickness noodles, and it was cooked to the right softness. \n\nOver all I'd recommend this place for a quick meal, and there's open seating.", "author": "Belinda L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-11", "description": "Yaso Tangbao is legit. I came here expecting a poor approximation of a Shanghainese classic, but was pleasantly surprised. Sure, their portions are smaller (4 soup dumplings to an order instead of 6), but that just means you can order more stuff!\n\nI ordered the pork dumplings and their Shanghai cold noodles. The dumplings were excellent. Hot with borderline scalding soup, and filled with pork. The skin was just the right thickness. And I don't know if they've changed spoon purveyors since the first couple of reviews with complaints, but I found their biodegradable spoons to be a-ok for the task.\n\nThe Shanghai cold noodles were just okay. A bit bland, and a hint of sesame oil. Nothing to write home about. Should've just done two orders of buns.\n\nThe space itself is really nice. Huge, with some communal and private tables. Definitely a great option for lunch or dinner in Downtown Brooklyn!", "author": "Kenny C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-05-01", "description": "Here's my genuine review of Yaso Tangbao, and please read on if you're looking for an honest commentary from a Chinese person and someone who frequents soup dumpling shops. \n\nA young and modern take on Shanghainese street food.  Though far from authentic, it appeals to the white collar, college crowd that flocks in during the weekdays.  \n\nAfter shopping with my mom and aunt all day, they rewarded my dedication with food. (they know me well).  Late afternoon on a Sunday, the place was not as busy as yelpers seem to suggest during the weekdays, phew! \n\nCounter-serve restaurant with menus items pictured along the walls.  We were quick to order the N1 beef noodle soup, N3 veg noodle soup, and the obvious ~ default S1 xiao long bao. \nS1 xlb $5.45 for 4 pieces, the flavor was surprisingly good. Though comparable to nanxiang in Flushing, it does not justify the hike in price. \nN1 beef noodle soup $11.50 for a hefty portion of noodles, a few chunks of beef cubes, and pickled veggies.  \nN3 vegetable noodle soup was meh.\n\nTastewise 2/5\n it does not do authentic Shanghainese cuisine justice, if you have any love for Chinese food, please check out your local Chinese restaurants(-takeout). Beef noodle soup did not provide the juicy beef stew as a base, rather it tasted like they used chicken broth instead. The vegetable noodle soup was equally underwhelming as it was just a handful of seasonal vegetables sauteed in garlic and topped on a bowl of chicken noodle soup.  \nThe XLB was the saving grace, pork juicy without being too gamy. \n\nTo be frank, I entered the restaurant with hopes on the low.  However the audacity of the place to double and triple in price compared to local shanghainese restaurants, makes it me wonder if they deserve any sympathy\n\nService was A-ok.  \nFood has plenty of room for improvement. \nPrice should be adjusted unless they are only looking to appeal to a very specific crowd of clienteles.  \nI see this place with great potential, as they seemly are already packed during peak lunch hours.  However, I also see the area with a growing potential for competition as well.", "author": "Yannie E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-06", "description": "Absolute go to for buns from a native Beijinger. Now in midtown and Brooklyn? What could be better.", "author": "Sally G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-06", "description": "Came here on a whim on a Sunday afternoon before heading to the new Trader Joe's nearby and I'm so glad I did. Now I don't have to go all the way to Chinatown to get amazing soup dumplings. I ordered chicken curry with egg but when I got my food I got something with spicy tofu and not what I ordered at all. I figured what the hell, I'll try it and I LOVED it. Thank you for messing up my order and introducing me to something new, I'll be back quite often.", "author": "Hanna T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-14", "description": "Hole in the wall it is not. This place looks like it just opened up, that's how clean and fancy this place looks in the inside. They have a small menu, but that's all you really need to be satisfied by their delicious food items.\n\nI got spicy pork soup dumplings and their garlic fried rice (I think it's called) with chicken cutlets. The fried rice is pretty decent, a little heavy on the soy sauce which doesn't appeal to me, but great nevertheless. The soup dumplings were tasty too, burned my mouth on the first bite from the boiling hot broth, ouch! They also sell this ginger ale soda brand which is pretty tasty as well.\n\nOverall, great food. I will be definitely coming back to try their other food items.", "author": "Jacky C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-05", "description": "Decently price but kinda expensive for their soup dumplings . I don't get why they charge you extra for hot oil ? Like it should not be $1 something extra . Maybe $0.50 extra but deff not more than  a $1 .", "author": "Ivy P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-10-13", "description": "Food was aight. Could see some food safety violations from where I stood at the registers. Prices were aight.", "author": "Adrian H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-26", "description": "This place was delicious! I loved the whole vibe of it and the food was amazing. I loved the soup dumplings and everything else. Everything tasted good with the lychee soda.", "author": "Helen F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-15", "description": "This restaurant is very busy during lunch time but the food is very good. However, only 4 stars because some of the food is really expensive but there are items that are not so expensive. It usually takes about 15-20 mins wait time for food if you order from the counter. The staffs are usually nice and I like how they have the water cups with the sauce area so you don't have to ask the staffs for water or sauces or utensils.", "author": "Ann W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-03", "description": "Perhaps the best soup dumplings in Brooklyn. There aren't many Shanghainese restaurants in Brooklyn or NY in general but this place does it right. Serving all the original favorites my grandparents used to make. I brought my parents here and even they agreed it taste pretty good (obviously they wont admit it's the best...).\n\nParking can be a pain here but it's worth the hunt for some soup dumplings in good ole Brooklyn. \n\nGO SHANGHAI!", "author": "John T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-13", "description": "You know a place is good when people dining there are of the nationality of the restaurant and there's always a good amount of people inside!\nEverything I've eaten here is delicious! My favorite is the garlic cucumber salad! It is so full of flavor and very well-seasoned. Next, I always get soup dumplings and the pumpkin spice cakes I think they're called. Just delicious! Go and enjoy!", "author": "Andrea A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-25", "description": "I came by because of the reviews, but after arriving I was disappointed.  Fast Shanghainese food that is Americanized?   I didn't order the food and left.   Overpriced and small portion.", "author": "Ninja M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-02-05", "description": "If you've ever had soup dumplings you'll know these are probably the worst ones. Basically the same as frozen store bought ones. The soy glazed egg had the flavor but has horrible texture.. I think it was a boiled egg peeled and then fried? Honestly it seems like this place took extremely good cultural food and hipster white washed the fuck out of it. I don't  recommend or even go back. Cute place tho. What a shame.", "author": "Gloria Chan G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-27", "description": "Food is great and delicious. It was very clean and all greasy. Will definitely frequent this restaurant", "author": "Kenny X."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-28", "description": "Been here twice, tried all of the dumplings, my favorite is the spicy pork. I've had a couple different noddle bowls here, that were all good, but the highlight here is the soup dumplings. Also good service, and plenty of seating. Food does take a minute, but it's worth it", "author": "Manny G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-17", "description": "It did disappoint me at first because of the noodle, as a Chinese I could not even finish it. However, I love the meatball rice here, and it is now my first eating selection.", "author": "Sicheng H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-30", "description": "I have bookmarked this place for awhile, but was never around the neighborhood to give it a try. And 2 days ago (4/28/17), I was able to come eat here. My sister \u0026 I ordered 2 items from their menu: 1) the blue crab and pork soup dumpling (S2), and 2) the braised beef noodle soup (N1). \n\nThe blue crab and pork soup dumpling was delicious and quite juicy. It was not the best soup dumpling I have ever eaten, but it was good enough in my standards. I liked that there was a lot of soup inside these dumplings, and that it was freshly made. I would come back to reorder this. This is not as good as Din Tai Fung or Flushing's Nan Xiang, but was good enough for Brooklyn.\n\nThe braised beef noodle was delicious as well. The noodle was al dente, veggies were delicious, and the soup was quite flavorful. My only complaint is that the braised beef was hard, overcooked - hard to chew. This dish would have tasted so much better if the braised beef was more tender. I would order this again w/o the overcooked braised beef (i would be fine just eating the noodles, veggies \u0026 soup). \n\nRestaurant was very nice, spacious, and super clean. Menu was beautifully presented (reminds me of Xi'an's menu). Staff was super friendly, helpful and nice. Because the food is freshly made, it takes time - for those coming here to eat patience is recommended. We came on a slow day, so our 2 items came out in less than 10 minutes. No tipping is necessary because it is self serve (you order, sit and eat, throw your own garbage, and then leave). I guess gourmet fast food is the trend now.", "author": "Sandra S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-10-02", "description": "First time here. Food was good, but I'm not coming back until food gets served in single use hard plastic bowls. Sorry guys. It's 2018.", "author": "Anna R."}], "servesCuisine": "Shanghainese", "priceRange": "$11-30", "name": "Yaso Tangbao", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "148 Lawrence St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/n8qkl-utd4uCMlOy46G05g/ls.jpg", "@type": "Restaurant", "telephone": "+19293377599"}