{"aggregateRating": {"reviewCount": 704, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-09", "description": "How did I not know there were legit soup dumplings in downtown Brooklyn? What a lovely surprise on the worst day ever (the day after the 2016 election results). \n\nThe line was long when I got here on a rainy lunchtime. It went pretty quickly, though, and the crowd control seemed to be working. I had no issues finding a place to sit after I put my order in with the pleasant guy working the counter.\n\nThe crab and pork soup dumplings were great. Perfect shell, not too thick but not so thin that they burst too easily. The filling was fresh and tasty and nothing struck me as greasy or heavy. \n\nI also got the hot and sour soup, which had satisfyingly snappy mushrooms and semi firm tofu. The textures were good, the flavor was just salty enough and again, I didn't have a gross heavy feeling after eating. \n\nIt's inexpensive but not cheap cheap- I paid about 15 for four soup dumps, a smallish soup and a fancy soda. It was well worth it, though, and I am full and happy. \n\nI'm not from Shanghai, so I'm not the authority on authenticity, but I think this is the real deal. Bonus: they have a reward program where you can earn free dumps!", "author": "Jennifer S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-13", "description": "I like the interior for a quick bite and staff is nice. The food was really forgettable for me. It wasn't bad, just not notable. Also pricey in my opinion for small portions. My friends had raved about the soup dumplings but they didn't curb the craving for me.", "author": "Jennifer M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-01", "description": "I will try any place that has soup dumplings so had to stop by this place during a trip to NYC. I ordered the spicy pork soup dumplings (order of four) and one of the chicken rice bowls. The soup dumplings were great. The skin was a little too thick, but the soup + meat inside was good and spicy, so it didn't bother me too much. They were also really fresh and came out piping hot. The rice bowl had a great flavor and comes with a decent amount of chicken - just wish there were more vegetables in the bowl as well. Overall, good place for a quick lunch!", "author": "Bhavana C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-12", "description": "I stopped by upon discovering this place on yelp - good thing I did cause it definitely did not disappoint! It functions sort of like a fast food restaurant, which is great because it's also near NYU where students can conveniently stop by to munch. You basically order your food and then pick a seat to wait until your order is ready. The whole process took less than 20 minutes even when the lines were relatively long (and only 10 minutes to eat cause it was too yummy). \n\nI ordered the braised beef noodle soup and regular pork dumplings. I must say, both the noodle soup and pork dumplings were delicious especially eaten on a chilly winter day to warm you up. The soup was tasty that I drank a lot of it! It made me quite thirsty afterwards though, so it probably consisted a lot of msg. As for the dumplings, they were very juicy! You know dumplings are going to be good when you take a bite and a lot of soup squirts out! The skin was neither thick nor thin, somewhere in between. Overall, it was a pretty satisfying experience! Great place to grab some quick food!!", "author": "Eva C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-03-29", "description": "Nice place for lunch in MetroTech/downtown area. The décor and atmosphere is totally unexpected for a Chinese restaurant. The communal tables give you the feel of the cafeteria. The place was packed for lunch!\n\nI think I ordered somewhat expensive noodle on their menu which is Beef Noodle Soup (N1) for $11.50. We also ordered Yaso Pork Soup Dumplings and Sweet \u0026 Sour Pork Ribs. They all look appetizing. The presentation was spot on!\n\nI think the noodle soup needs a little more seasoning. Braised beef was a little dry. But overall, we were happy with our lunch. Will stop by to try other stuff in the menu.", "author": "Jedsada Y."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-29", "description": "Been waiting for a spot like this to open in the neighborhood for awhile. The beef noodle soup is fantastic.  The tangbaos are decent and it's pretty no frills and quick. Does the trick in a pinch! Plus there's a boba place next door that you can pick up a little beverage to complete the experience.", "author": "Ray C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-03", "description": "Pretty good! The serving size was very generous. We ordered the Braised Pork Meatballs Noodle Soup, Braised Pork Meatballs over Rice w Eggs, and the Yaso Pork Soup Dumplings; and we were very satisfied. I would say it could be a dollar or two cheaper, but it was worth it. I might prefer going to another place in Chinatown in Manhattan, but if I lived in Brooklyn, I'd be a regular.", "author": "Rachel K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-10-12", "description": "Have been so excited for the opening of Yaso Tangbao and apparently I am not the only one - went on a Monday around 12:30 pm and most tables were full. They specialize in shanghainese street food.\n\nThis review is for takeout only. My order only took about 5-7 minutes, so they are quick, even with lots of other people waiting. I tried the mapo doufu (tofu) over rice. It consists of ground pork mixed with soft pieces of tofu in a sauce, served over rice and topped with two fried eggs (yolks were hard, sadly). It was tasty and a generous portion.\n\nI also tried one of their \"bites\" - the shaoxing wine chicken or \"drunken chicken.\" I've never had this dish before so maybe I just need to acquire a taste for it but I felt it was mainly fat and bone, making it hard to eat and slightly unappealing. I will absolutely be back for dinner so that I can dine in and try their soup dumplings (dine in only). They have specials going all through october (my lunch was 10% off) so I definitely recommend heading over and giving them a try!", "author": "Sol C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-06-10", "description": "I am shanghainese. I tried all four kinds of Tangbao and ShengjianBao, pan fried buns. For those of you guys who knows what I am talking about, I give this place three stars because they use sesame oil to make the flavor of Tangbao which make it really oily and greasy if you have more than three. At the end, it make me feel sick. Among all of them, spicy pork is my favorite. Blue crab is below average and smells fishy. Just an average fast food chain overall.", "author": "Zhang A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-04-24", "description": "I have been to Yaso Tangbao couple times because of work related meetings. It's one of the few Asian restaurants nearby, and I was happy to find it in the area.\n\nPros: \n1. The taste of the Baos are good. \n2. Staffs are nice and bilingual(English and Mandarin)\n3. Bathroom has a password, and it is clean.\n4. There is a big window that you can see how your Baos are made.\n5. Comparatively spacious with many seats.\n6. You can find spots to charge your phones.\n7. You can choose the sauces you want. \n\nCons: \n1. The Baos I got has little stuffing.\n2. It's a bit pricy. \n3. The soup taste cheap and not that good.", "author": "Kayla W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-02", "description": "Ummm... yes the perfect lunch spot!!\n\nCame here for lunch with the boyf and ordered the curry chicken soup and the beef soup.  We love and are very picky about our asian noodle soups and were very happy with both of our choices.  The beef was delicious and the curry chicken had good seasoning.  We asked for extra curry sauce since we love the spice :)  They also have homemade chili oil that you can get on the side to kick up the spice more (of course we had to get it).  We of course got the soup dumplings.  Soup dumps are at the top of my favorite foods to eat and these did not disappoint for a fast/casual restaurant.  Yes the spoons are small, but don't worry about it, just eat them - you'll be fine!!\n\nThe ambience/atmosphere here is also really cute.  It's communal dining, but definitely get's busy so you will get some eyes if you are lingering.", "author": "Danielle L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-20", "description": "Great local place to enjoy traditional shanghai soup dumplings! Prices are a little higher vs Chinatown but you save on tips! Service is friendly and dumplings are soft, juicy and flavorful! Recommend the soup dumplings!!", "author": "Ye T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-11", "description": "This deserves more credit than what I gave it with my last review.  Since last a year, I've eaten a lot of dumplings and the soup dumplings (Y2 - crab and pork soup dumplings) were absolutely amazing. It is a casual place. Great option for lunch if you work in the hood. Yumminess!!!", "author": "Sarah T."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-06", "description": "So incredibly disappointed. I brought my coworkers in today thinking that we could have had some soup dumplings around 12:30 pm. Not only that the machines on the side don't really work and are so confusing - you still have to go to the person cashier to take your order, the cashier was so unclear just mumbling that there were NO MORE SOUP DUMPLINGS at the time. WHAT? How do you have all these soup dumpling pictures on your t-shirts and saying it's your specialty when you don't have any? It's so confusing. It's like McDonalds running out of burger and fries? What? Just close the entire store or something or at least let us know at the door. The portions here were so measly and insanely expensive. There's really no need to order anything here - please just go to like a dingy looking more authentic place if you're going to eat noodles, dumplings, or anything. I really don't need to pay that amount of money....$13 for a simple braised beef noodle soup with some lame broccoli and like 2 corn kernels? The soup had NO taste whatsoever and the beef tasted like it was from a can. ugh. What a waste of time and money. This is just another bougie place just trying to cheat people who have never had real chinese food hah! I feel so ripped off.", "author": "Pinky C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-29", "description": "Yaso Tangbao really brings out the traditional side of Shanghaiese food. One of their dishes called Drunken Chicken really rewinded many of my childhood memories when I was back in Shanghai. My grandma used to make those Drunken Chicken (糟卤鸡) dinner for us when I was a kid. This restaurant really brings my memory back.", "author": "Danny S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-06-13", "description": "Have to say, never having tried soup dumplings, Yaso Tangbao surprised me with their juicy signature dish, but the bao was uninspired. About what you'd expect from a place jumping on the train catering to NYU students and a growing oh-so-hip population in the metrotech area. On the upside, if you don't like talking to people you can order from one of their iPads and no one will ever know you can't pronounce shaomai.", "author": "Ed S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-12-29", "description": "Hipster soup dumpling place.  Th soup dumplings were ok.  The noodle dishes and others are not authentic at all.  Tough to pull off soup dumplings in a fast food restaurant which is what this is.  Soup dumplings MUST be served right out of the steamer.  The 1st order we got had been sitting around for a while.  They were promptly replaced by a new order but those had also been sitting around but just not as long.  \nAs expected prices are on the high side.  If you are a soup dumpling connoisseur, avoid this place. If you don't know the difference between a soup dumpling and a pot sticker, this maybe the place for you.", "author": "Phil C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-12", "description": "During my first visit, I ordered the spicy pork soup dumplings and the vegetarian rice bowl. While the dumplings were good, my rice bowl was fairly cold (aside from the rice underneath), and the eggs seemed like they were sitting out for a while prior to my order and had gotten cold/hard. The prices were nice for the amount of food you receive, but unfortunately it just wasn't satisfactory this time.", "author": "Asia O."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-09-09", "description": "The majority of favorable reviews here inspired and prompted me to check out this place sooner than later.\nJust as many of the reviews suggested, this place is trying (and succeeding)  to appeal to a certain crowd. Once the word spreads, it becomes a huge deal but popular doesn't always mean quality or better than some other establishments.\nFrankly, my experience was just okay.  When I arrived, it was prime lunch time and the line was nearly out the door. The good part was that it went by very quickly albeit a bit chaotic.\nThere were very few available seats/tables but I managed to grab one since I was alone.\nEssentially, you order at the counter, get a number and seat yourself--self service.\nThey seemed to have an extensive menu--lots of soup and dumplings. Even though I enjoy soup, it was way too hot to try it.\nI ordered the pork soup dumplings--that's it--as I was in a semi-rush. The cashier emphasized about 3 times that it would take 20 minutes to be ready. And 3 times, I assured her it was fine so I am not sure what the purpose of her comments  were considering that the dumplings were ready in less than 10 minutes!!!\nI sometimes wonder if going to a restaurant once or for the first time or ordering one/few items from the menu can result in a true review. I've given it some thought and the answer is yes! because great restaurants are usually very consistent and even a delicious appetizer should represent what  the rest of the menu has to offer.\nAnyway, when my order was ready, I was expecting to eat the best soup dumplings ever but for me, they weren't. I have had better elsewhere. The broth was extremely salty (I  don't use soy sauce) and the skin was slightly thicker than I hoped.\nThey were of course edible and good enough and I might return again to try other items on the menu.\nWith the hype that is being generated about this place along with the long lines/crowds that result, I'm just as happy, if not happier going to Mott Street in Chinatown and finding a truly authentic place to indulge in dumplings, soup, dim sum and the like.", "author": "Johanna B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-11-20", "description": "I never had soup dumplings so this place was awesome for the price! I tried the pork soup dumplings that were not spicy. I honestly loved it. I got a second order and it honestly filled me up. I give a four because my sister ordered chicken soup there and it didn't taste good to me. I love the setting and the soup dumplings were really good.", "author": "Jackie C."}], "servesCuisine": "Shanghainese", "priceRange": "$11-30", "name": "Yaso Tangbao", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "148 Lawrence St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/n8qkl-utd4uCMlOy46G05g/ls.jpg", "@type": "Restaurant", "telephone": "+19293377599"}