{"aggregateRating": {"reviewCount": 704, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-04-05", "description": "Stopped by when the restaurant first opened. On the positive side, dining area was clean, staff was courteous and there is a soda refill machine. On the negative side (and this is a big one for me), everything is expensive and overpriced. In addition portions are small. \n\nI did NOT get any of the dumplings which is what the place is known for.  I got the braised beef noodle soup. It was $11.50 before tax.  I got the order to stay. The noodle soup was generally OK - not the worst I ever had and definitely not the best. For 11.50 plus tax it was completely underwhelming. In addition, portion size was very small and was still hungry after. \n\nI would come back again to try the dumplings (which look expensive as well) but my first impression - expensive food (for what it is), average quality, clean space. Good luck to them.", "author": "Andrew C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-31", "description": "The XLB has definitely degraded. Skins were super thick like American dumplings. Barely any soup at all. No wonder why the price of the dumplings were $3.50. They used to be about $6.50. The crab dumplings had no crab flavor at all, just the extra price.", "author": "All R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-17", "description": "I really liked the soy rice w/ chicken fillet and dumplings. There are a lot of varieties to choose from. This place is famous for dumplings. Check it out if you're in the area", "author": "Abhichandra R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-02-26", "description": "WOW. \nThe food is quite terrible. \nIt is so bad that for the first time in using yelp for 5+ years I had to sign in to write a review.\n\nI've lived around the area for a while. The quality of the food here plummeted to an unimaginable depth since the remodeling. \n\n-- the soup dumplings were lukewarm, as if they came straight out of a microwave instead of being properly steamed. What happened to the piping hot fillings that burn your mouth??\n-- the rice entrees were SAD. Stale, dry rice, flavorless cold sauteed vegetables, and lukwarm meat. Any Asian mother makes better rice dishes then this. \n\nOverall- Pretty terrible experience I had to go get Shake shack afterwards. I don't think I will ever return despite it being a minute away from where I live.", "author": "Derek W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-06", "description": "Really inexpensive and delicious. Great option in the area. The xlb are particularly good. The vegetarian options stand out.", "author": "Edward J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-13", "description": "Soup dumpling was one of my favorite dishes back in China and I always struggle to find a decent one that could bring back my memory back at home. Joe's Shanghai is close, but the soup base was a bit too greasy. Therefore when my friend recommended Yaso Tangbao to me, I knew instantaneously I need to try it out. I'm so glad I did!\n\nEven Though Yaso does not carry a long menu, each single dish I tried was hearty. Besides my personal favorite blue crab with pork soup dumplings, which were flavorful yet not too greasy; the garden veggie dumpling was a sweet surprise, as the chopped carrot was able to absorb the meat juice completely. Without hesitation, we ordered the sweet pumpkin cake - I could literally feel the coconut sprinkle falling out of my mouth! I simply wish I could eat more!\n\nPhysically located in Brooklyn, Yaso can be reached by taking the subway conveniently. If you are a big fan of soup dumpling, Yaso hands down!", "author": "Elaine H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-07", "description": "The soup dumplings here are DELICIOUS! My wife and I have come here twice as we have not been disappointed! They are just the thing to warm you up!", "author": "Antonio W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-06", "description": "This is my first Yelp review. But this place and the owner totally deserve to be my first review. It is 9:35 pm and I'm waiting for my order right now.\n\nYaso is right next to my college so I usually come here for lunch. Tonight though I came with my friend for dinner, without checking when it closes. I saw a person ordering before me, and when he was done I stepped up to order. The cashier told me that they were closing, and apologized. \n\nI expressed disappointment and walked out of the place, because they accepted an order just 10 seconds before me. \n\nWe were discussing where to go when a guy came literally running behind us and asked us to come back to the restaurant. \n\nHe was the owner of the place, he apologized and even gave us a 10% discount. \n\nI love this place even more now. Keep up the good work!", "author": "Anurag G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-23", "description": "I used to come here all the time before the closure for the soup dumplings. Sadly after they reopened the quality has went w bit down hill. Half of the dumplings burst before being able to be picked up. I'm more just sad I can't get my local fix anymore. Please halp.", "author": "Andrew A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-01", "description": "Come eat the soup dumplings (Tangbao) here!  \n\nThe crab dumplings are the crabbiest I've had in all of Manhattan and Brooklyn (I have very little experience with XLB in Queens).  Most of the time, when you get the crab dumplings, the only thing that's different about them is that little yellow spot on top.  These babies...*muah!* CRAB EXPLOSION!\n\nOh, don't forget the ginger infused vinegar.  That stuff is tart but perfectly offsets the richness of the XLB.  I sort of love that you get it from a lemonade dispenser by the soda machine*.\n\nAside from the dumplings, they also sell rice and noodle dishes.  These are fine. I would give them 3 stars.  There's also a side of spareribs that are glistening with grease and deliciousness. \n\nSo come here, get the crab dumplings. Wave at the nice lady behind the glass making the dumplings. Get another order of crab dumplings (because you only get 4 per serving and you're gonna want more than 4).  Cry with joy.  :insert sob emoji:\n\n\n---------\n*the soda machine was on it's way out when I visited so sorry if the geography changes for your visit.", "author": "Margaret T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-07", "description": "It's a great day when soup dumplings are that much closer to me, thanks to the addition of this Downtown Brooklyn dumpling spot. It's also worth noting that they sell a pretty good variety of other dishes, in case you hate dumplings, although what kind of person hates dumplings? Psycho.\n\nWent here for a late lunch after a long morning of jury duty. Even at 2pm this place was pretty busy, but cleared out shortly after I was seated. I ordered 4 crab and pork dumplings, 4 pork dumplings, and a hot and sour soup. \n\nThe dumplings are definitely legit. They have that delicate, thin skin and the distinct shape (with that little twist at the top). Both types of dumplings were delicious, perfectly fragrant soup broth and just the right amount of tender, meaty filling. I found the crab and pork ones to be superior to the pork ones and would probably just go with those next time. The hot and sour soup had good ingredients, but the soup itself was too vinegary. Cut back on the vinegar and it's a perfectly decent soup.\n\nIt's definitely quite pricey, especially compared to any of the joints in Chinatown, but you pay a premium for a nicer, cleaner, more sanitary atmosphere, better service, and more white people eating in this one dumpling place than all Chinatown places combined on any given night.", "author": "Steph C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-17", "description": "The tang bao, what I know as xiao long bao, are authentically fantastic!  We decided to get takeout because it was late and the restaurant closes up slightly earlier than advertised  Though the signature dish was great, the noodle soup is not.  Interior is quite modern looking, and they sell their own merch.  Interesting place to try for dinner.", "author": "Emily Y."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-22", "description": "I had been to Yaso Tangbao on a few different occasions and came away vacillating between love and disappointment. Both times, I came for soup dumplings and ordered a few other things. On my first visit, I LOVED the soup dumplings but disliked the rubbery peanut noodles. On my second visit, I came just for the soup dumplings and was sorely disappointed. They were a bit dried out and the portions seemed to have shrunk.\n\nIt was on a night that I missed my subway stop and decided to make the most of it by picking up some takeout that Yaso Tangbao finally blew me away. I got the braised beef noodle soup, schlepped on home and didn't expect much from my bag of goodies, but when I finally dug in - WOW. The pickled vegetables, star anise-tinged broth, flavorful braised beef, perfectly chewy noodles and fresh bok choy came together for a complex, multilayered and absolutely delicious dish. Away from the allure of those soup dumplings, it seems I am finally starting to understand Yaso Tangbao's genius. Can't wait to try everything else on the menu!", "author": "Celine N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-02", "description": "I like the housemade ginger vinegar sauce they have here. Made the pork bao delicious. Not sure how it would be on its own", "author": "Elizabeth V."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-09-16", "description": "Tried this place over the weekend. Not high quality, but not low quality either. Pretty middle of the road\nThe cold sesame noodles had very little sauce if any so don't bother ordering. Soup dumplings (pork  and crab) were a bit oily and not great consistency. \nTry it if your in the mood for better than slightly average food", "author": "Ann C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-06", "description": "Great spot right off Fulton street. This place stands out amongst the dumpy other retail tenants on the street which makes me wonder why they chose this location, but regardless it's very good.\n\nThe soup dumplings came out piping hot delivered with a special soup dumpling spoon. Really would love to see this place in Manhattan as the choices are endless", "author": "Adam C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-20", "description": "Had 2 simple dishes, Garlic Soy Noodle and Pork Xiao Long Bao, and a Bruce Cost Ginger Ale with Blood Orange \u0026 Meyer Lemon. \n\nThe Garlic Soy Noodle came so quick, I barely had time grab utensils and a place to sit. It's served with peanuts and cilantro. Add a little vinegar \u0026 chili sauce and it's perfect. Hit the spot.\n\nThe Xiao Long Bao was great, perfect amount of soup inside each dumpling and the dipping sauce was just right. \n\nIt was just the right amount for 1 person too. Not stuffed but completely satisfied. \n\nIf I'm ever in the area again, I'll definitely come back.", "author": "Suzanne K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-19", "description": "I didn't get to try the pork buns, which is what I came here for, because the wait was said to be 15-20 min. It was during lunch rush on a Wednesday so that's understandable and I appreciate being told that upon ordering. \n\nIt's cool seeing them make the food. I ended up getting the sweet \u0026 sour pork ribs and a hot and sour soup. Both were delicious. The ribs really were extraordinary. \n\nI only wish the place was bigger.", "author": "Olivia G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-20", "description": "The taste of the food was spot on. The pork buns are my favorite thing they make, part soup dumpling but with a more filling fried bread. Speaking of filling meals, or lack there of, I really like the soup dumplings but the cost for 4 measle dumplings is.....tragic. They really should throw in 6 dumplings for the $6-7 price tag. I also tried the sweet and sour ribs and although the taste was good, I don't like the messy cartilage pieces. The ribs that were on the solid one bone were great. I'd pass on them in the future.\n\nAlthough I want to go here all the time for my soup dumpling fix, providing only 4 will likely cause me to go across the mighty East River to get a proper quantity for the price. Bummer.", "author": "Mike S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-09", "description": "Fool me once... sigh, you know how the rest goes. Two months ago I had a bad office lunch delivery experience. Yaso Tangbao made it right. I continued to patronize the restaurant but did eat in/pick up, not delivery. I even updated my rating to five stars. Tonight, I caved in to the laziness of rainy weather and the first week of no daylight savings: I ordered delivery to my home. I GOT BURNED AGAIN. \nAfter my second amended delivery time expired, I called Yaso to check on my food. The woman said it was ready to go out, they were waiting for one last item. No problem, these things happen, the food is worth the wait. I got a phone notification that my delivery time was amended again. \nAs my delivery time expired, I got a call from the delivery guy. He said he was in the lobby. (Hooray!) I asked him to come up to my apartment. Some other guy got on the phone and told me that the delivery guy was in one of the metro tech office buildings. (Boooo!) My food delivery is to a residential address; even my office building (bad delivery #1) is not at metro tech so why is he at an office building with my food? \nWhy is he deceiving me? If you're lost, call and say you're lost or at least pretend to confirm my address. Why tell me you are in the lobby? Yaso, how do I get my tip money back? It is such a shame that good food places are a let down with crappy delivery service. Rest assured I won't try delivery again in two months. Now that I am limited to eat in/pick up again, Yaso will barely be in the lunch/dinner rotation. Same review posted on seamless.", "author": "Jennifer C."}], "servesCuisine": "Shanghainese", "priceRange": "$11-30", "name": "Yaso Tangbao", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "148 Lawrence St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/n8qkl-utd4uCMlOy46G05g/ls.jpg", "@type": "Restaurant", "telephone": "+19293377599"}