{"aggregateRating": {"reviewCount": 704, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-04", "description": "Authentic shanghai foods with high quality. Materials are very fresh. trustworthy restaurant. Will certainly come back again!", "author": "Mutsuki J."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-06-07", "description": "I've eaten here twice and it's been okay both times. The chicken on my noodles was a bit rubbery but the vegetables were good.", "author": "Raa C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-14", "description": "Went here during the lunch rush hour. The line was through the door but the service was pretty quick; was able to order and get my food in 20 mins. It's a bit chaotic during lunch, so I wouldn't recommend eating inside. The decor is nice and the restaurant is very clean. The menu options are great and the service was excellent. I had the Braised beef noodle soup which was excellent. Noodles were perfect, beef was soft and moist, broth was flavorful yet refreshing. Will definitely be back to try more.", "author": "Rudi M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-16", "description": "Yum!  It's kinda pricey for \"street food,\" but it's good!", "author": "Jim K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-25", "description": "Exactly what I wanted. The pan-fried pork baos were greasy and delicious. The mapo tofu was  good cold (except for the egg, but cold egg is my own fault) when I ate it a couple hours later. I would have gotten soup dumplings, but I couldn't eat there, and I did not trust myself to get them home in one piece. Great street food. Crossing my fingers that they someday deliver to Park Slope, but I seriously doubt it.", "author": "Elanor S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-11", "description": "the chef is the executive chef from Joe Shanghai.\nno complains for the soup dumplings. (4 is a number that's very hard to order, frankly speaking)  \n\n\nrice sticks, traditional shanghai snacks, it's interesting to try, but 4 is too much since the dish is  mono, it starts to get boring after the 2nd one. \n\nskip the garlic cucumber, cucumber is not marinated long enough.\n\nIn general the ingredients quality is better than most of the Chinese places. I'd want to go back to try something else.", "author": "cy c."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-08", "description": "Great addition to the neighborhood! I've been there about 5 times since they've opened - in fact going back tonight. I love the soup dumplings - impossible to choose between  pork and crab so get both. Other favorites of mine are the braised pork meatballs noodle soup and the sweet and sour pork ribs. Plus the staff has always been very friendly and grateful to their customers. I hope they stick around for a long time.", "author": "David R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-05-25", "description": "soup dumplings - good, but discordant with setting.  I think of soup dumplings as being a little special, not something from a counter-service lunch place.  Flavor good, texture ok.\nmapo - good flavor, lean, not saucy or particularly wet, but good.\nfried chicken noodle soup - filling, but just ok.  thick cut veg, good texture but soup didn't have enough flavor to compliment the cut.  chicken suffered from breading getting soggy, some hold up better than others, this wasn't one of them..\n\nnice concept, satisfying portions, we went there late sunday afternoon.  not worth a special trip.  a great place for lunch if you are nearby, but probably not more than that.", "author": "tryptophan n."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-27", "description": "Thoroughly enjoyed this place, although it's pricier than Chinatown, nothing beats getting to stay in Brooklyn and enjoying one of my fave foods (soup dumplings). I just wish the portions were more generous (6 instead of 4). Spicy is the way to go...", "author": "Sonika H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-12-09", "description": "I wanted to like this place I really did, I just had a horrific disagreement with the staff. My chicken was completely undercooked and the staff decided to fight me on the issue. Undercooked chicken is a black and white issue. The staff refused to refund me for my meal and continued to labor that I could not tell the difference between cooked vs. undercooked chicken. \n\nFor the record, pink and chewy jelly-like texture chicken isn't \"moist\" it's undercooked.\n\nMy advice, skip the Curry Chicken Entree if you don't want salmonella. \n\nCustomer service, horrible. As someone from a family in the Chinese restaurant service industry--absolutely a disgrace.", "author": "Samantha C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-06-23", "description": "The dumplings are excellent!!!  The noodles was ok bt some of the appetizers are definitely worth a try", "author": "Linda M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-18", "description": "Pig ears are all the rage so I had to order them ; they were a bit chewy but the sauce was spicy and tasty, so I really enjoyed the dish. I also ordered a beef dish that had nuts and what looked like prunes. It was very good. The last dish was a cabbage salad which was good. The three dishes were $14.00 so they gave me the choice of a free cabbage salad or soup as part of a special deal. I forgot I had already ordered the cabbage salad so I took that as my freebie. It was great so a double serving was more than welcome. There are large tables and small water glasses so it's not a fancy place but the food is good and arrives quickly which is what matters to me when I am hungry and tired.", "author": "Abhi J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-18", "description": "The Spicy Diced Pork Noodle Soup was awesome, a very satisfying lunch.  Tons of flavor and the perfect amount of heat.  The place was crowded and lively on a weekday during lunch time, but the staff was friendly, I got my food quick, and was able to snag a seat to enjoy my delicious soup.  I'm really excited this place opened in Downtown Brooklyn -- it is now officially added to my lunchtime rotation.  I'll be back to try some soup dumplings!", "author": "Joe S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-07-16", "description": "So I went here because I was really excited that there was a coal long bao place in Brooklyn but this place was pretty lackluster. In my opinion if you're going to pay more than you do in Chinatown, you should at least not get paper and plastic cutlery with your food.", "author": "Sunny L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-13", "description": "Great Shanghai soup dumplings! The mapo tofu, however, came out a bit strange. It was served over rice and barely had any sauce. The sauce it did have was not spicy (having traveled through China, I like my mapo HOT). It came with a fried egg on top, which was a bit overdone. Overall, clean and friendly service / ambiance!", "author": "MtPleasantChica .."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-21", "description": "Awesome food for the price! Great low-key option in otherwise the sort of destitute food hole that is the Metrotech area. Very happy it's there!", "author": "Margo D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-07-01", "description": "Had the spicy pork soup dumplings and the Soy Garlic noodle. Both were good, but thought the noodle would have more quantity. I wasn't full after that , so bought the sticky rice dumplings. The whole thing costed me $20. So bit pricey for the quantity but good food if you want something light.", "author": "Susan G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-16", "description": "I had the soup dumplings a couple weeks ago and then today I tried the braised pork meatballs over rice with eggs. The soup dumplings were very good, although I do feel like an order is pretty expensive compared to other places I've been in Flushing and Manhattan. The meatballs over rice with eggs were very good, and I splurged and got some of the chili oil (which I don't actually think should be an upcharge item) and it was delicious, although it brought my lunch cost to $14. The pork meatballs were perfectly cooked and flavorful. The eggs were a little overdone, but nothing to freak out about. Overall, I will visit again, as everything on the menu looks amazing, but this spot is too expensive for more than once a week. Check it out, it has great food and is very approachable for anyone not familiar with Chinese food (not me, but most of my coworkers).", "author": "Cynthia V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-27", "description": "Loved this place. Went with a group and ordered practically everything on the menu--plus multiple courses of the soup dumplings. Everything was great and the staff was very friendly. Excited to have this place in the hood. Definitely a great spot for takeout!", "author": "Kristen H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-02", "description": "Very impressive. The service was fast, the food delicious. I had a vegetarian crispy noodles dish. It took me a while to figure out what to order because this is not a regular Chinese food. They do not have a lunch special so it may throw you off and its pretty pricey.  Definitely recommend it.", "author": "roman d."}], "servesCuisine": "Shanghainese", "priceRange": "$11-30", "name": "Yaso Tangbao", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "148 Lawrence St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/n8qkl-utd4uCMlOy46G05g/ls.jpg", "@type": "Restaurant", "telephone": "+19293377599"}