{"aggregateRating": {"reviewCount": 704, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-09-02", "description": "This low star review is not for the food. I actually thought the food was above average to exceptional. This is a review for their service.\n\nI'm not sure why I ended up being at fault of this, but I never got my order until one of the workers came up to me as I waited for my number to be called.\n\nApparently, my number was called. However, my number was never called. Maybe it was called softly but all night they have been shouting everyone's number except my number. They mistakenly called out a number and they quickly said \"wait, sorry, nevermind\". That probably was supposed to be mine. It just wasn't the right number.\n\nI applaud one of the workers for going out and asking a patron for his number to make sure. But that person already got their food. Why don't you ask someone like me who hadn't received their food yet about their number.\n\nThey finally came out to check on me when they saw a person who ordered long after me receive their order before me. He then said I've been calling and looking for your number. Obviously, they didn't call my number. Then proceed to blame me for it. Don't blame the customer. That's like a golden rule of restaurants. Especially, for a customer who has been waiting for their food.", "author": "Philip H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-04", "description": "Such an awesome dumpling place !! Can't wait to come back the interior was newly renovated and the price was definitely worth it \n\nWe got the blue crab and pork soup dumplings which were amazing. Although the crab taste was subtle the dumpling itself was still pretty good. \n\nWe both highly highly recommend the sweet and spicy dumpling if your the sauce loving type. It's smothered in homemade dumpling sauce with a lot of garlic. \n\nWe also got the beef noodle soup! And that was also a highly recommended item. The appearance may not be amazing but trust me the taste definitely made up for it. \n\nAnd as for the sticky rice dumpling. It was meh. I kinda expected it to taste mediocre since we aren't much of a stick rice type of people but if you are. This would be amazing to you!", "author": "Sally C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-03-07", "description": "So i discovered this place having worked downtown Brooklyn and figured i would give it a try.\nI ordered the sweet and sour pork ribs over rice w/ egg. The egg was delicious since it was marinated in some soy type sauce. the ribs were pretty tender although since im not skilled in the art of chopsticks i had to pick them up with my hands...lol\nBasically its a huge bowl of rice and broccoli with like 6  tiny rib pieces in it. Meh...ive had better", "author": "Pat W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-01-14", "description": "Honestly yikes - I was not please with the food at all. I ordered the \"signature\" pan fried bao with pork and braised beef noodle soup.\n\nThese four pan fried bao sat sadly deflated and absolutely greasy before me. They must have been cooked at a low heat while sitting in oil, which caused all that oil to be absorbed by the poor little baos. The grease coated my tongue, and what I could taste wasn't that great - the filling was not well seasoned, but the oiliness helped it slide down easier.\n\nThe noodles come in a disappointing \"broth\", with not that much meat, a single stalk of Chinese broccoli, a couple stems of Napa cabbage, but a decent amount of noodles to mask the fact there is nothing else in this bowl to be offered. Instant ramen would have been better than what I ate from that bowl!!\n\nIf you like this place, I would highly suggest you scope out a different place and be amazed by how actual Chinese food tastes. I hate to be that person saying \"this isn't how my mom would make this\", but this place is simply disastrous. \n\nI liked how order numbers were announced in english and Chinese from the kitchen. Stop by to learn numbers in Chinese but don't be tricked by their seemingly Chinese name, because\n\nthis\n\nfood\n\nf l o p p e d", "author": "Gina L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-10", "description": "Excellent Chinese beef noodle soup and dumplings in a  hip clean atmosphere. \n\nI've come back pretty regularly. For N1.   \n\nThe pork dumplings were good.  Served w a Sichuan chili oil and cilantro.  Very tasty, very strongly flavored. But don't eat before the noodle soup or you won't taste the noodle soup.  \n\n\nThe air conditioning needs to be stronger.  I'm sweating from the soup.", "author": "Abc M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-14", "description": "The cashier recommended the sweet and sour pork ribs over rice with egg which was a good choice. It came in a bowl filled almost halfway with white rice, about 7 pieces of short ribs and mixed vegetables (cabbage, broccoli, corn and squash)\n \nPros: the food came out really hot which worked out for my long commute. The meal was very filling mostly due to all the rice they put in the bowl. The short ribs were tender and came covered in a thick sweet not so much sour sauce.\n\nCons: the price was a tad bit high than I would've liked, a little over $13 with tax.\n\nI would've liked if they added the sauce from the short ribs to the rice.\n\nOverall I would definitely come back to try other things", "author": "Adriana B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-03-17", "description": "Came here for brunch and ordered R1 amd R2. But in R2, meatball was so dry and had no flavor. And in R1, there was a plastic string and almost chocked myself... I have been eating here since before it had a remodeling. Before, the foods were fresh and some of them where hand made but now? Its all old foods that are stored in the metal box...maybe they used all their money on remodeling their restaurant and got no time to spend money on their food lmao", "author": "Siwoon P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-02", "description": "Don't miss out on the soup dumplings here! They also have steps showing how to properly eat them. (Nice). But beware these can burn your mouth! Don't forget to get the dipping sauce.Also tried the spicy chicken noodles soup. The quantities are good for the price. The place is more of a quick bite. They have some Vegetarian options but it's mostly a place for meat eaters.", "author": "Shraddha R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-10-27", "description": "Food: 5/10\nService: 7/10\nAtmosphere: 6/10\n\nI really want to like Yaso Tangbao, because the menu looks great and I'm a big fan of soup dumplings.  Unfortunately, every time I've gotten the soup dumplings, they have been some combination of: skin too thick, aspic not melted completely, or over-seasoned.  In addition, there is supposed to be a charcoal (wonton skin) and chicken soup dumpling, but I have NEVER seen it be available over the past 8+ months, when this location re-opened after renovations.  \n\nThe dining room set-up is basically counter-serve with communal tables, so keep that in mind if you're thinking \"date night\" for a visit.  Beyond the soup dumplings, I've tried the sweet \u0026 sour pork ribs (tasty but cold) and the Jiaozi (luke warm and too much oil).  Overall, I wouldn't recommend anyone go out of their way to eat here, but I'll probably keep giving it chances because I don't always have time to go to Joe's Shanghai when my soup dumpling cravings hit.", "author": "Ryan S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-03-15", "description": "The food was too salty and not particularly tasty. This used to be a good restaurant but the quality has dropped.", "author": "Loukas P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-12-13", "description": "Knowing my mother would not step into any restaurant unless they serve up chinese food or anything close, we took a gamble and went with Yaso. Plus, she's a WeChat(asian Facebook) whore. I thought the idea of multicolored soup dumplings would be right up her alley. The experience was mediocre due to the dumplings being not hot enough. In fact, it was barely warm. And nothing impresses a chinese mother than lava hot soup dumplings. On the picture menus, the chicken dumpling skins were pitch black but what we got were anemic green tepid dumplings. We also tried the blue crab and pork and the temperature was the same. The pork ribs were good but the peanut noodles that came with the plate were just too slick and greasy. We also tried the pan fried curry chicken buns and the curry seasoning reminded us of \"singapore noodles\" found in most chinese menus. \n\nI haven't tried other Yaso, but if this is the quality of grub they serve up at other locations, I think I can skip.", "author": "Kenneth L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-04-02", "description": "Wonderful concept. Enjoyed the broth and my rice dish. However, the soup dumplings didn't have any soup inside....definitely a lack luster.", "author": "Paige W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-21", "description": "Yaso Tangbao is my group's favorite dumpling place.  They have soup, pan fried, steamed, and sticky rice dumplings!  All with multiple meat filled options.  The condiment table area is abundent with soy sauce, sirracha, chop sticks, and even a free tap water dispenser with unlimited plastic cups.  \nThe pork soup dumplings are very unique and would definitely recommend to dumplings fans everywhere.  There's actually soup in the dumpling!!!!", "author": "Joe G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-11-16", "description": "Food is good, but tangos location is staffed by teenagers who stand around chatting - maybe if more of them were working, it wouldn't take so long to get the food. Seriously, they've got to put people to actually cook food instead of chatting with one another.\n\nDon't order the dumplings unless you're prepared for a long wait: they seem to be the hardest thing for them to prepare, even though they are pre-made....", "author": "Grandmaster MC K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-12-05", "description": "Yaso tangbao is a fast casual restaurant in downtown Brooklyn. You order the food on an iPad screen and then they call you by number when it is ready. I went for lunch, and was disappointed that almost all of the food had meat (including the noodle soups which were all made with chicken broth). I ordered a mixed vegetable stir fry dish which was good, but I wish I could have tried more of the unique food options they had to offer.", "author": "Leah R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-03", "description": "We Yelped for a good place to have lunch in Brooklyn. Yaso Tangbao fit the bill.\n\nTraditional Shanghainese food served in a hip, clean setting.\n\nWe ordered using an iPad.  It was very convenient.\n\nWe wanted to try a variety of dishes.  My favorite was the braised Pork meatballs.  Super tasty with a slightly crusty shell and s very soft umami center.\n\nThe Braised Beef with Egg over Rice, Soy Garlic Noodle with Cilantro were good.\n\nAll the Soup Dumplings including the Pork, Spicy Pork and the Blue Crab and Pork were excellent.\n\nThe Shanghai Cold noodle was the only dish that was disappointing.\n\nService was fast and efficient.  The restaurant has a pick up your food at the counter then bus your dishes service model.", "author": "Kelvin Y."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-04-12", "description": "Used to like this place when there was old couple making fresh dumplings... but now I can taste that their food quality decreased...disappointed... food here almost made me to use my powerful and deadly infinity gauntlet... thank god that I didn't.", "author": "Thanos M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-04-09", "description": "Came here for lunch and ordered a few items off the menu. The diced chicken over rice was ok - hard boiled egg was way over cooked and the rice was too wet. \nUsually my favorite on menus - siu mai stuffed with chicken and sticky rice wasn't as flavorful as it is at other places. \n\nNot a great representation of Shanghainese food, but more interesting than a deli sandwich or a dollar slice, but only just.", "author": "Katie C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-05-22", "description": "This place has so much potential, but it's just not quite there yet. First, the service was great! The workers were extremely friendly but the food just did not meet my expectations.\n\nThe soup dumplings were slightly cold. The skin was also on the thicker end and I felt like didn't cook all the way through. The meat in it was good but the soup wasn't very flavorful. Overall the dumplings were okay. My boyfriend and I got the crab dumplings and the pork one. The crab one was definitely unique but not a MUST TRY.\n\nI also got the braised beef noodle soup and it was bland. Soup had no flavor and no spice. The meat was not tender and a bit chewy. My boyfriend got the rice bowl and it was just soooooo bland. It was just rice with a little bit of sauce and the beef. \n\nOverall, not happy with the result. Not a place I would come back again.", "author": "Frances T."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-03-18", "description": "I was excited to find a Bao place for lunch.  The prices are pretty high but if it was quality I wouldn't mind.  These were hardly cooked, mushy.  Very disappointed.  The place itself is nice but you should be good at what you specialize in.", "author": "Gina S."}], "servesCuisine": "Shanghainese", "priceRange": "$11-30", "name": "Yaso Tangbao", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "148 Lawrence St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/n8qkl-utd4uCMlOy46G05g/ls.jpg", "@type": "Restaurant", "telephone": "+19293377599"}