{"aggregateRating": {"reviewCount": 704, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-21", "description": "I wish this store was on every corner. The fried pork buns have a bit of soup in them. Soupy, soft, with a crunchy bottom. Flavorful and best of all, no signs of MSG! \n\nReal gingerale offering a nice touch.", "author": "Helen B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-12", "description": "Their dumplings are really good! The food is a little pricey but other than that this place is good.", "author": "J D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-07-03", "description": "The food was mediocre, the skin was too thick and the soup from the dumpling was average", "author": "Eric M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-16", "description": "This place is pretty good. Their menu is straight forward, and you can dine in or take out. The food was fresh and warm, even after we walked home. My only complaint was several people ordering after us but getting their food before us.", "author": "Kara N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-02", "description": "Great soup dumplings without having to go to either Chinatown.  Servings are large, food come up quickly.", "author": "Evan B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-26", "description": "Quick service and Delicious soup dumplings. Will return for sure.", "author": "Rosanna L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-26", "description": "As many have stated, they have great soup dumplings.", "author": "David J."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-04-21", "description": "I only had the checken noodle soup so far, the taste is ok. Nothing special about the flavoring, it was a light broth noodle soup. Price wise, it's pretty expensive. Considering that I can get the same noidle soup for $3 less elsewhere. They have no competition so they get to. Eveything is overpriced a bit.  I assume this is also due to the compostable bowl they use specifically, more expensive than the typical recyclable containers. Great for our environment though!  Kudos top them for that gesture. Now, the compostable bowls they use is not good with noodles being that they're starchy so the noodles were stuck to the paper bowl. Check photo. More of a niche for now for the American taste buds.", "author": "Pui C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-02", "description": "As a shanghainese, I have to say this is the best shanghainese food you can get on the east coast. Highly recommend!", "author": "Hansol J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-14", "description": "I'm used to spicy food not rly being that spicy but their Spicy dumplings were everything!!! Will definitely be ordering from here again!!", "author": "Milena A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-08-02", "description": "Ambience - 4 stars\nFood - 3 stars\nService - 2 stars\n\nRationale:\nWe were the first customers of the day and perhaps we were just a practice run, as our food was simply decent. I've had better XLB at dim sum restaurants (shout out to Hong Kong's City Hall dim sum resto). The beef noodles were okay; something was off about the flavor and the broth. My crispy veggie noodles were not crispy.\n\nThe cashier messed up our order in different ways  - wrong item; taken by a different customer who ordered the same dish.\n\nTLDR: Meh food, bad service, eat somewhere else.", "author": "Katsurina C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-02", "description": "This ain't ur normal \"general hsao's chicken place\", they offer the best Shanghainese dishes in town. Crab soup tangbao and the hot meat noodle are the must tries. Enough protein and enough taste. You won't regret. I wish they are franchising  around town soon so that I can grab it for lunch everyday!", "author": "Xiaokun F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-03", "description": "We've been coming back regularly bc the XLB are just irresistible. Also the owners are still tinkering with the menu and recipes; for example the cucumber has improved over time (originally the ratio was 50/50 garlic to cuke) and they've added other items. Also!! They got better spoons :)", "author": "Joan C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-24", "description": "Great place to have dinner with my best friend. I have been in New York for 6 years and I came from Shanghai. I feel Yaso Tangbao is the closest taste to my hometown. We ordered Yaso Pork Soup Dumplings, Pork And Bok Choy Wonton, Spicy Diced Pork Noodle , Chicken Curry Noodle Soup, Braised Pork Meatballs Over Rice With Eggs, Wine Chicken, Garlic Cucumber Salad and Spicy Cabbage Salad. They all taste so local and I love the environment very much. Strongly recommend!!!", "author": "Yusheng L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-04-16", "description": "I had such hopes for this place.  It took several weeks for us to get here as it opens at noon and is not open on Sundays.  Many times we're looking for a brunch/breakfast on Sunday so right off the bat, Yaso's hours are inconvenient.  We finally had cravings the same time they were open and found the place to be well designed with communal and smaller tables.  Its menu is appetizing and inviting touting Shanghainese street food.  We came for the soup dumplings, or as its name says \"tang bao\".  We got the crab and pork dumplings, braised beef noodles and cold noodles.  They were tasty but not extraordinary.  I didn't realize one order of dumplings was only 4 dumplings.  Most places have 6 or 8.  The prices are reasonable but the portions are small.  The cold noodles were hard and were obviously refrigerated.  The proper texture should be al dente but not hard from being in the fridge.  There was not much to the noodles, a few shreds of carrots, cucumber and a thin sesame sauce.  It hit the spot but nothing to write home about.  The beef noodle also lacked body.  The beef chunks were tasty and tender but the broth needed more substance and was more a consommé than a broth.  The dumplings were very good and without trying all the items, the tastiest and main attraction.  Not sure if it's worth all the trouble to find a parking space in the downtownBrooklyn area but it's a little pricey for only 4 pieces ($6.95). To be fair, we should try some other items before passing judgment.  If you're  expecting lunch or even dinner portions you'll be mildly disappointed. Think hip snack bar which are popular in Chinatown and a hangout for the after school crowd.  We went on a Saturday afternoon and the place was not busy at all.  It probably is a different scene on a weekday when the nearby schools, court and offices are abuzz.  Glad we got there to see what all the hype was after the NY Times article sang its praises but it's not that remarkable if you know the similar spots in Chinatown, Flushing or Sunset Park to get comparable quality and the portions would be larger and prices would be cheaper.", "author": "Wailana W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-01", "description": "Get the pan fried pork dumplings!!! Delicious! Also tried the steamed wasn't as good as the pan fried but still a good dumpling", "author": "Rusty R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-13", "description": "It's the best shanghai/chinese food I ever had in NYC. Really traditional Chinese good, I will recommend to anyone who wants to taste the real Shanghai cusine. Tangbao is a must try, and wine chicken tastes really good. Decorations are modern, it's one of the best soup dumpling restaruant I have ever visited. Although the price is a little bit higher than other chinese restaurant around, but it's still resonable, and you will defiantly get better service and food quality than normal Chinese restaruant for this price. Highly recommended!", "author": "Jerry H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-24", "description": "Really good soup dumplings. Roast pork dish is also excellent. A welcome addition to downtown Brooklyn!", "author": "Food Jerk X."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-12-12", "description": "A Vegetarian Review\n\nVegetable Dumplings - Too much dough. Filling is tasteless. Why is there green food dye in the dumpling? It is a dark ugly green. You never seen a vegetable this color. Not appetizing. \n\nCabbage - Well balanced flavor. Tasty\n\nCucumber - Very garlicky. That I like. The problem it has no sweetness. U need sugar to bring out the flavor. That's what Shanghainese food is known for. Sugar bringing out the flavors.  \n\nKao Fu (Wheat gluten) - Very enjoyable. A do-over. Lots of flavor.\n\nGarden Vegetable Crispy Noodle - I like it. Not the best I've had. Many better memories of this dish in some Cantonese restaurants.  but it is good enough to come back to Yaso  and order it again.\n\nJust want to mention that I believe these guys will improve there cooking. They listen to there customers tastes and keep trying to improve. It's a new restaurant and I got to give them a chance to get the kinks out. I'm glad to see the menu is vegetarian friendly. I will try all these dishes in the future and write a second review.", "author": "Jeffrey K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-06-12", "description": "The food is pretty tasty but priced just a tad high for what it is -- a riff on Shanghai street food.  The soup dumplings are delicious, especially the spicy pork version.  The fried buns were okay but a little too doughy.  I once ordered the crispy noodles with a curry sauce-- the had a nice taste but they hardly had any sauce which meant the noodles stayed rather crunchy. The service could use some improving-  I understand that everything is made to order, but during the lunch time rush, this could mean a long wait.  Overall, a great addition to the neighborhood, but they still need to improve a couple of things.", "author": "Sarah G."}], "servesCuisine": "Shanghainese", "priceRange": "$11-30", "name": "Yaso Tangbao", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "148 Lawrence St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/n8qkl-utd4uCMlOy46G05g/ls.jpg", "@type": "Restaurant", "telephone": "+19293377599"}