{"aggregateRating": {"reviewCount": 704, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-02-29", "description": "This place opened up not too long ago and since the soft opening, they've made a number of adjustments from different take-out utensils to new menu dishes. The place does have higher prices, which can be understandable given the area and that it is primarily for lunch. But in general, I think they still have more work to do.\n\nI ordered soup dumplings for take out, and after waiting 15 minutes (assuming they were being freshly made), they unfortunately turned out to be lukewarm and not hot, as expected (I work 5 mins from there). They're also a bit too liberal with their salt in their noodle dishes. \n\nIt's a great additional lunch option in downtown BK but given the higher prices, I hope it will continue to improve.", "author": "Jenn Y."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-05-14", "description": "Eh.\nI got the mapo tofu over rice which is tofu stir fried with  minced beef. Didn't find anything too special about it, I felt it was too salty and didn't have as much flavor as I would have liked. \n\nI will try the soup dumplings the next time I come here,so I'll update this review once I do", "author": "Esther C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-11", "description": "Not a lot of shanghainese restaurants in Brooklyn so this a welcome addition. I have to say that the food is phenomenal and decently authentic. We got it delivered from Caviar, and everything tasted exceptional. Keep up the good work guys!", "author": "Franco L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-10", "description": "Got the braised meatballs over rice with eggs. Great flavors, decent portion size, fair price. Left feeling satisfied and full. Dumpling looked nice as well but a bit expensive, so I opted to not get them.", "author": "Austin B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-11", "description": "Compared to Flushing, this place is NOT it. But we are not in Flushing, this is Downtown Brooklyn so I can't get picky!\n\nXLB (Soup Dumplings)  - Quite tasty. Solid skin. Lots of soup. I would say better than Joe's. But they are no Nan Xiang or Din Tai Fung. I appreciate that they have the vinegar with ginger slices as dipping sauce and they have soup spoons big enough to hold the dumplings now!\n\nPan Fried Pork Bao - Tasty bao. Crispy bottoms. VERY LITTLE meat.\n\nSweet Pumpkin Pancakes - These were chewy - kinda like sweet potato flavored mochi? And I guess I liked them because I ate the whole thing before I realized it. \n\nBeef Braised Noodle Soup - Noodles were soggy. Beef and pickled mustard greens on top were tasty. Soup has NO depth. It really needs chili oil but they don't have any! For $11.50, I would rather pay $3.50 more and go to Ganso Ramen down the street and get a super delicious bowl of noodles.\n\nCrispy Curry Noodle - Noodles are crispy like their title says... but it's very meh. I feel like they added this dish for the wai guo ren.\n\nMaPo Tofu with Rice and Fried Egg - Egg is not runny. The ma po flavor is not there at all. A LOT of rice. Don't let that menu photo fool you! \n\nSpicy Cabbage Salad - Not spicy at all, but quite tasty! Nice to have a little pickled veggies and only $3.50.\n\nGarlic Cucumber Salad - This dish is ok. Def NOT worth $5. Would rather make my own at home.\n\nHot Sauce - This place does not have chili oil.... only Sriracha which obvs is not Shanghainese. Sriracha goes surprisingly well with the pan fried pork baos tho!\n\nMy recommendation for first time people - order off the \"Signatures\" or \"Bites\" section. Avoid the noodles and rice dishes if you are used to real Chinese food - those sections are for the wai guo ren. \n\nThey are always playing LAME early-2000s Top 40... so I am very thankful that they do take out.", "author": "Jane P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-07-06", "description": "The pan fired Baos are close to those in SH. But the prices are too high for \"street foods\".", "author": "Jimmy K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-29", "description": "So good. Eat here. Or don't, and leave some space for me to sit lol.\n\nTypically I'll read or watch an episode while I eat, but I can't do that to the braised beef noodle from Yaso Tangbao. I respect it too much. The noodles and broth alone are amazing. As for the beef, it's like they served me every cut I typically have to brawl my family for at dinner. \n\nAlso, the soup dumplings are great, just prep for the 20 minute wait.", "author": "Jamy D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-05-28", "description": "Yaso Tangbao will satisfy a soup bun craving - they're nice here - but for the $$ it's a rip-off.\n\nMapo Tofu was just OK, lacking fire and flavor.", "author": "Jenna S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-27", "description": "I love this yaso tangbao soooo much!!!!!! People here are really nice and friendly. If you would like a take out, your food would be ready as soon as you sign your name!! The food is really delicious, their signature is a must try! Amazing restaurant! I will definitely recommend it to my friends!!!!", "author": "Emma H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-05-03", "description": "I don't think I ordered the right thing. I came in around 9pm and all dumplings were going to take 20 minutes so I got the salty soybean milk and wheat gluten salad. Both of these are really Chinese type dishes. The soybean milk was totally disappointing. The wheat gluten salad was good but could have used some hot oil.", "author": "Sonia W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-18", "description": "Love their dumplings and 醉雞! Best Chinese restaurant in DT Brooklyn.", "author": "PengYu C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-01-24", "description": "The place was bright, lots of room, clean, and a short walk from where I live. A good option for the neighborhood but a bit pricey for what it is. \n\nHere's what I had: \n\nMapo tofu - lots of rice, lots of tofu and ground pork. The first few bites were fine. I asked for the egg fully cooked since I'm prego...the whites were foamy/crunchy, you know how it gets when the heat is too high? I also wish the flakes of red pepper were a bit smaller rather than the size of paper shreds, or that you could actually taste the spice (I added a bunch of sriracha to it). \n\nPork soup dumplings - yummy. They come with the black vinegar and ginger which I put plenty of. The paper spoon it came with fit it just fine. But only 4 dumplings for like $5.95???? That's near highway robbery! There should be 6 at that price, sheesh!\n\nPork buns - also good, but a little too much bun and not enough meat for my taste. Again - I piled on the sriracha (maybe my taste-buds are shot?)\n\nChicken sauerkraut and rice - meh. It wasn't my favorite. \n\nI would go back to try other things. But I would DEFINITELY go back if their prices were a tad lower - at least for the dumplings!", "author": "Stacey P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-03", "description": "Nice fast food place, the dumplings are a hit here, they are great because the soup is inside instead of out, that makes the taste so much richer. Noodles were good, mostly because the pork was tasty. I'd stop by again.", "author": "Juan T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-28", "description": "Came here during lunch, the food was excellent. Had the braised beef noodle soup..mmmgood! Soup was delicious a lot better than Shanghai spots in Chinatown I must say. Didn't get the soup dumpling but will definitely be back to try that as it looked deeeelicious too.", "author": "Daniel M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-03", "description": "Thumbs up!!! I went with my parents, they also love it. One of the best place in downtown Brooklyn!", "author": "Meixian S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-12-01", "description": "I've eaten most of the items on the menu.  \n\nUnfortunately there are no other real Chinese food options in this neighborhood which is why they can charge highway robbery prices.  The food is okay compared to the Chinese-American places in the area.  However, they are overcharging for tiny portions.  \n\nThe good soup dumplings in Chinatown charge about $4.95 for 8 pieces.  Here they charge $5.35 for 4 pieces, more than double what you should pay!  I get that there are no other options but at least give 6 pieces just to be fair.\n\nCucumber salad @ $5, complete rip off! They give only a few pieces, less than half of a small cucumber cut up and it was very over salted.  \n\nWine chicken - again, the portion was tiny and over salted - steer clear from this.  \n\nSweet \u0026 sour pork ribs - came in a tiny order of 4-5 small pieces, basically 2 normal ribs cut into half.  \n\nNoodles - I've had the beef and braised meat ball for $12.  Again, in a normal Chinese noodle shop, this bowl of noodles would have been much larger and about half the price.  The noodles tasted okay but one bowl isn't enough for an adult.  If you are going to charge $12, at least let the customer walk out feeling slightly full!  Noodles don't cost that much so adding 15-20% would make a big impact on whether someone is going to return to the place. \n\nCurry Crispy Noodle - the taste was very average, would not recommend, and portion is too small for one adult.  \n\nMapo Tofu rice - the taste was okay, but again, for $10.00 I expected more food especially since it's mostly inexpensive tofu!  Definitely not enough to fill a person.  \n\nBasically between 3 adults, we had to spend $75 to feel full.  This seems like a rip off for a chipotle style chinese fast food place.  \n\nThe food tastes okay and is pretty authentic but be prepared to spend about $20 pp in order to feel satisfied.  \n\nI am very disappointed since this is one of the few more authentic offerings in this neighborhood but they are too cheap to give a little more in order for their customers to walk out satisfied.  A few extra noodles, tofu, cucumber, or rice would not even affect their bottom line much but they are overcharging purely because they feel they can get away with it!  \n\nI like the food here but will not be returning until they tweak the portions to match the price or unless they drop the price to match their portion size.", "author": "TIFFANY C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-04", "description": "All 3 of the soup dumplings are amazing! The dipping sauces go perfectly with them and you can add a dash of Sriracha for some spice. My favorite is the Spicy Pork Soup Dumplings, they are medium spicy and taste sooo good!", "author": "Phillip-Andrew P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-24", "description": "We visited this place today for lunch. It was very good and the food was very fresh. We had the Pan Fried Pork Baos,\nBraised Beef Noodle Soup, fried rice with grilled chicken.  It was a hit and our 12-year-old enjoyed it very much. we will return again.", "author": "Jay M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-03-27", "description": "Tastes like fast food... mediocre to subpar ingredients. Not worth the trip.\n\nSuper salty \u0026 greasy with some spice but no flavor. \n\n1 star for cleanliness \n1 star for service", "author": "Josephine B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-06-08", "description": "Ah man where's the soup in the soup dumpling?...back to Chinatown. Gave Brooklyn a chance Service was great though. So I have to add in all fairness that you have to take into consideration the fact that the dumpling absorbs the soup so eating right away is best", "author": "Y R."}], "servesCuisine": "Shanghainese", "priceRange": "$11-30", "name": "Yaso Tangbao", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "148 Lawrence St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/n8qkl-utd4uCMlOy46G05g/ls.jpg", "@type": "Restaurant", "telephone": "+19293377599"}