{"aggregateRating": {"reviewCount": 704, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-20", "description": "The spicy dumplings are amazing!  Fantastic noodles.  Quick and friendly service.  This place fills up quick at lunch!  Will definitely be back when I'm in Downtown Brooklyn!", "author": "Belinda B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-11", "description": "This is my first time eating xiao long bao in NY. They are a little bit bigger than the ones I've had elsewhere, but they are delicious. We also dried their spicy diced pork noodle soup, stir fried veggies, and drunken shrimp (their new special). They're all very good for the price. The XLB are my favorite amongst the dishes we ordered. \n\nOverall, the place is clean and spacious with friendly staff. It's a good place to grab a quick bite!", "author": "ChingWa C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-14", "description": "The food is excellent it is prepared exactly how you request and the service is courteous and very professional", "author": "Curtis J."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-04", "description": "Went here recently with a group of friends, because one of them wanted to try it out. I had eaten just a little earlier, so I just tried the pork soup dumplings and the crab and pork soup dumplings. The dumplings were ok - the skin wasn't too thick, the filling tasted fine, there was a decent amount of soup in the dumplings. But it's also a little hard to truly judge the dumplings, because they were served lukewarm. Eating soup dumplings is one of the greatest joys of life, but these were so tepid I almost shed a tear out of disappointment.", "author": "Michael K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-10-17", "description": "3.5 rounded down.\n\nTaste and execution were on point.  Service is friendly, but this is a \"fast food\" establishment.  It's loud at lunch time and we had to wait about 15 mins for our food, but everything came out made to order.  Prices could be lower.\n\nXLB (4 in an order) - skins didn't rip, soupy, tasty\nCrab XLB (4 in an order) - strong crab flavor (more than usual) - a bit taken back by this, but solid effort\nCold noodles - chewy (but maybe a tad too chew), flavorful sauce\nFried pork bao - greasy, chewy bao, filling could have had a bit more of a punch\nPumpkin cakes - like pumpkin mochi; great chew and flavor\n\nAll of this was $30+; money can get stretched a bit farther in Chinatown, but then again, it can be smelly, crowded, and dirty on Canal Street.\n\nWe will be back if in the area and need a fix!", "author": "Ignatius L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-13", "description": "I do like the curry and it does taste like what we have back in Shanghai. The soup is also good. Fast service as well.", "author": "菁菁"}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-26", "description": "Delicious soups, very fast soup dumplings, and highly dedicated employees! The chain on my purse recently got stuck in the very small crevice between the bar and the wall at this restaurant (entirely my fault, just didn't realize that it might fall in and get stuck). Several employees helped me for over 45 min to free my purse by unscrewing the bar, wrestling with the chain, etc. I was amazed by their helpfulness and dedication. They wouldn't rest until it was freed!", "author": "Carolina T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-23", "description": "Very nice Shanghainess food. Service is quick. Ordered a few item and taste is delicious", "author": "Harold Yingda Y."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-09-03", "description": "We came here for a quick dinner after checking into our hotel nearby. The self serve menu offered soup dumplings, a variety of noodles and other typical Shanghai style dishes. Food was served in paper ware. We could see soup dumplings being prepared through a glass partition a la Ding Tai Fung style. It felt \"precarious\" eating the larger soupy dumpling with a odd shape Chinese style paper spoon (deeper) or a shallow plastic spoon. Presentation of food was good with fresh vegetables. Sure enough our dining companion squirted the soup on her clothing. The cold noodle was quite nice. The braised beef noodle soup was rather flavorful albeit in lukewarm soup. However the garden vegetable \"crispy\" noodle turned out to be quite soggy with too much gravy and was unevenly seasoned/ salted.", "author": "Geri C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-01", "description": "The soup dumplings (xiao long bao) were great - this was my first time trying xiao long bao in the US and my shanghainese roots approved. As others have said, the dumplings are a bit larger than what I am used to. But, it did not break down (which is the biggest tragedy when it does.... watching that delicious soup seep out on the tray instead of my mouth) and the soup remained  contained even through my clumsy chopstick skills. I will definitely come here again and again to satisfy those xiao long bao cravings. \nWe ordered N1(braised beef noodle soup) and R5 (chicken curry over rice w egg) and they were satisfying as well. But, for the price, I'm likely to return to try the other dim sum items.\n\nA note on the tables - I hadn't read many yelp reviews before coming, but it was a different environment than what I'm used to. They have long communal wooden tables and benches - I thought it would be awkward to sit next to or across strangers, but I was proven wrong. Reminded me of my grade school cafeterias (haha). It was a nice change and quite a lovely experience.", "author": "Lucy M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-02-26", "description": "Disappointed. That is only word that comes to mind when I stopped in my lunch today. I tried this place when it first opened and actually really enjoyed the food. I had such a strong craving and happened to be in the area and decided to stop by for some fresh hot xlb. This would be my second visit to this restaurant. To my utter disappointment, the xlb that used to be made on premise fresh and served hot, now comes frozen and reheated! No wonder the xlb seemed dry and the dough was so thick... never mind the fact that my xlb order was cold or lukewarm at best. I feel so obligated to post this review so that others don't come in with high hopes like me, especially if you have been here during the early glory days. I am so disappointed.", "author": "Mary S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-06-29", "description": "I had the vegetarian dumplings and G2... can't remember what is was called but it was a mix of gluten, mushrooms and peanuts. I love dumplings and these were not the best by any measure. My vegetarian dumplings were a little dry and the dipping sauce made it too salty. The G2 dish was good but just a little bland. It was a whole lot of gluten and peanuts thrown together with a minute amount of mushrooms. \n\nA very clean, modern setting, quick service and ok food.", "author": "Sapna S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-23", "description": "Soup dumplings are definitely the highlight and the fried pork bao are a must.", "author": "Michael C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-03", "description": "good hidden find in the middle of brooklyn where you dont expect to find shanghai food.\nribs were tender\nsticky rice shui mai was savory. the rice wasnt mushy nor hard\nthe soup dumplings had a lot of soup in them but the skin didnt melt or stick to the steamer (not overcooked)\nthe buns of light, fluffy on top but grilled on the bottom.\n\nalso sells bruce cost ginger beer. local to brooklyn\n\n\nservice was pleasant for a fast casual place. clean and hipsterish vibe.", "author": "Jason C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-24", "description": "I've been here multiple times since I've found about this place. I think they have the best crab + pork soup dumpling in Brooklyn. The crab soup dumplings come in an order of 4 but they are bigger and more soupier than other restaurants that give you more soup dumplings. The soup dumplings are made to order and come out nice and hot and yummy. It really does have crab flavor and I love the savory soup that comes in when you bite into it.  I order this every time and have never been disappointed. I've tried their regular pork dumplings which are good but more bland to me then the crab ones. I've also tried the braised beef soup which was good to but a little pricey for what's it worth. As for the pan fried buns, they were disappointing. The meat on the inside was just slightly warm and the bottom of the bread which should have been nice and crispy was soggy. It might have been that one time I went but it prevented me from ordering it again. But see for yourself and def. get the crab pork soup dumplings.", "author": "Ann S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-21", "description": "Dude... soup dumplings are always best with friends. Yaso has got it going on, and I totally recommend visiting this place more than once. In fact, I'm considering visiting again this week.", "author": "Edin K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-09", "description": "Yo this is the best soup dumplings ever. So good not enough orderrrrrsssssssss. If you buy a shirt you get a free order of soup dumplings. Why do I know this? Because I bought a freaking shirt. Also, I've been here like 5 times now.", "author": "Sonia D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-09-05", "description": "For pointers, this place is self serve. You go up to order and then find a place to sit and grab your own utensils. They'll call your number when your order is ready. Not a sit down and order kind of place. \nWe ordered and bunch of things from the menu: pork/crab soup dumplings, pan friend baos, braised beef noodle soup, minced pork noodle soup, beef shoo mais, mapo tofu, and pigs feet. \nFood here was just okay. It felt like we were eating at the food court in flushing. Better soup dumplings can be found elsewhere. Nothing here was spectacular. All average. We walked out saying we could've just gone to our usual chinatown or flushing soup dumpling restaurant.", "author": "Ferdinand C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-25", "description": "Grabbed a quick dinner here last week and loved it! The space is pretty nice with lots of wood. We came on a week night and there was a short line that moved quickly. Placed our orders, got seats, and waited for about 10 minutes before our food was ready. The 2 of us shared the pork soup dumplings, the spicy pork soup dumplings, the sweet and sour ribs, and the braised pork meatballs over rice. Everything was delicious! The soup dumplings weren't the best I've ever had, but for a quick bite they were pretty darn good! I didn't find the skin too thick like some reviewers, and the filling was perfect. The ribs were really good! Very tender and the sweet and sour sauce is awesome. The meatballs over rice was also delicious. Meatballs were fluffy and not dense at all, great flavor. It came with some steamed veggies on the side which added some balance to the meal. I did wish the egg had a runny yolk though. Overall I was very happy with our meal and the price was just right. If there was a location near where I lived I would be there all the time.", "author": "Wendan L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-12-10", "description": "Facebook advertising sent me here... ever on the quest to find good soup dumplings, I had to check this place out. Yaso is a small eatery specialising in Shanghai cuisine.\n\nTldr: Be sure to ask for black vinegar and ginger when you order soup dumplings. Skip the hot and sour soup and kau fu. The food here is for a sweet palate.\n\nOn entering, it's not a regular service restaurant, rather a lunch-counter style order-then-self-serve, quick eats place. \n\nIf there's one word to describe the food, it's sweet. I understand that Shanghai cuisine is more sweet, using more sugar in its recipes, the food here is too much so. The cuisine is also known for heavy use of soy sauce, and my food was just too sweet.\n\nHot and sour soup is made with chicken broth, as is common from the region, but was neither sour enough nor spicy. I see they used chilis for the heat, which is far from the normal white pepper powder. It's a whole different experience. It was okay, at best, and as far as Hot and Sour soup goes, it was bad. Adding some of the house vinegar sauce helped.\n\nKau fu, marinated and fried wheat gluten is another classic shanghai dish. Again, it was far too sweet and the by the colour it was very clear that only a little soy sauce was used. I wouldnt order either the soup or kau fu again.\n\nThe dumplings were the main affair, I ordered the normal ones and also the crab ones. Each comes in a teamer with 4 dumplings. The skin was supple yet sturdy enough to withstand being picked up my chopsticks, and also were very juicy. The soupiest soup dumplings I've had. The meat in the plain pork ones seemed again to be lacking seasoning, but were otherwise okay. The crab dumplings were a hit for me. Definitely present was the crab flavour, which many places in chinatown skimp on. \n\nI was a little disappointed that they didnt have black vinegar and ginger strips, but it turns out you have to ask for it separately, according to a small text on the vinegar dispenser. The vinegar I used was sweetened lightly and was for dumplings. Oops. It was still alright though.\n\nOverall, it was an okay experience. I wouldnt go out if my way to come back, but it's a nice option when I'm in the area.", "author": "Kevin T."}], "servesCuisine": "Shanghainese", "priceRange": "$11-30", "name": "Yaso Tangbao", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "148 Lawrence St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/n8qkl-utd4uCMlOy46G05g/ls.jpg", "@type": "Restaurant", "telephone": "+19293377599"}