{"aggregateRating": {"reviewCount": 704, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-01-25", "description": "I first heard of Yaso Tangbao from the New York City Dumpling Festival back in September 2015 and when I heard they were opening up just 1/2 block from where I used to work, I was excited! \n\nYaso Tangbao isn't like other Shanghainese restaurants, but rather it is a counter-serve , fast-casual restaurant. An old colleague of mine tried it before I did because I decided to wait a week or so when it wasn't so crowded. I ended up coming here on a Friday afternoon for lunch with my boyfriend and boy was it crowded! There's a few communal tables along with beneches for you to sit and eat as well as smaller tables that are ideal for one person or two people and counters with seats. The service is pretty quick and the staff here are very friendly!\n\nWe tried the following -\n\nPork Xiao Long Bao ($8.50) - $8.50? That's quite expensive for the six golf ball sized dumplings we had, but at least the taste and quality was good. They were freshly made, each one squirting out a rich and savory broth with a chunky pork filling. It was absolutely delicious and went well with the soy and vinegar sauce. \n\nChicken Curry Pan-Fried Noodles - This wasn't what we really expected it to be. The noodles were on point and very crunchy! The sauce and chicken on the other hand wasn't on point. There wasn't much taste to it and the sauce was so watered down. I don't think I would order this again.\n\nAll in all, I am glad we tried Yaso Tangbao. The xiao long bao were phenomenal, but the chances of me returning here would be 50/50 only because the prices here are ridiculous and you don't really get a big portion out of the food you order. However, if your in the area this definitely a place worth checking out at least once or twice.", "author": "Jessica D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-03", "description": "Visited my friend in Brooklyn last year and she brought me here. The place itself is a bit tight and can get very packed during lunch time, but even then, service was relatively fast and my friend and I didn't have a problem snagging a space to eat at. Even though the soup dumplings are all the rage here, I opted for the sweet and sour ribs. OMG they are the best ones I've ever had! Super tender, juicy and so flavorful! Had them a year ago and I'm still wanting them! Can't wait to go back to NYC and have them again! But in the meantime, I hope they open a franchise in Boston!!!", "author": "Maria C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-04", "description": "Finally got to eat at Yaso Tangbao - thank you jury duty!  Overall a satisfactory experience but not 5 stars:\n\nThe good- service is pretty quick \u0026 friendly, \u0026 you can watch the dumplings being made up fresh. Good selection no matter what your dietary preferences. Pleasant surroundings. Recyclable containers. Bao were excellent. Soup dumplings were good, but not quite Flushing/Chinatown good. Prices were generally reasonable for the portion.  \n\nThe bad- it's super loud. You have to not mind rubbing elbows with strangers. The spicy cucumbers had no spice \u0026 were ridiculously over-priced @ $5.  I can make them far better myself for about .75.   \n\nI'll definitely come back though to try some of the soups.", "author": "Denise P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-11-24", "description": "So my daughter the foody finds this on Yelp and we all Uber from DUMBO to this place in a lower rent area of Brooklyn not yet gentrified. I wouldn't have bothered had I known the food. Only go if you're in the area but there are better options in me NYC. The skin on the dumplings are too thick and the noodles have an instant noodle like texture.", "author": "John L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-05-17", "description": "Ordered the garden vegetable with rice, not a big fan. It's only alright. But I guess it's pretty good for a fast food place. It's a quick and easy meal, but it's not as amazing as it looks in photos honestly. Quite disappointed. Not worth $10. You can pay cheaper for the similar or better food honestly.\n\n*Disappointed*", "author": "Suki W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-05", "description": "Authentic, clean and good value! I came to Yaso Tangbao (爷叔汤包) from searching on Yelp. I was firstly impressed by its 4-star review. When I came in, I found Old-Shanghai style wallpaper along the aisle. Then the menu, which was posted on Yelp, attracted my attention. Since they offer soybean milk and fried bread stick, which are my favorite in China, I ordered these items and a blue crab soup bun (Please see attached pictures). This dinner cost me approximately $13. The waiters are professional and nice to serve every customer. But it is a self-service restaurant so that you are expected to clean your leftovers and place plates in a designated area.\n\nAdditionally, I checked in on Yelp and got a FREE wood chopsticks as promised by this restaurant. There is Peking Opera paintings on my chopsticks as well. What a surprise!\n\nTherefore, I am leaving Yaso Tangbao a 5-star review because of authentic taste, good service and special souvenir. Definitely recommend this place to you! :)", "author": "Zheng H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-26", "description": "I went over the weekend around late afternoon and it was pretty empty. It's a self serve kind of place so don't expect to get seated by a host and have waitress/waiter bring you food. You order by the register, wait for your order and when it's ready, you picked up the tray of food and find a table to sit. \n\nMy friend and I ordered pork soup dumplings, crabmeat and pork soup dumplings, pork mapo tofu over rice and Shanghai cold noodle to share. Everything was pretty good although I wouldn't get the cold noodle again because the noodle was a bit hard. I like that the pork mapo tofu had a fried egg, which the traditional dish does not. It was a nice twist. For those who love spicy mapo tofu, sorry to disappoint but this dish is not spicy. Also the soup dumplings come in 4 so it's not the standard 6 you might be used to at other spots. \n\nOverall a good spot to try if you're around the area and craving Shanghai food. I wouldn't come back again because the food is a little pricey compared to what I can get in sunset park, Chinatown and Flushing which have better soup dumplings.", "author": "Julie C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-27", "description": "In a word... Excellent!  Visiting from CA and it's not far from our hotel.  Everything was delicious but the spicy pork dumplings were our favorite.   Had to order another round they were so good.  Staff was helpful and informative.   Place was clean and played upbeat music.", "author": "Mark N."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-11", "description": "Food is good but definitely not 4-5 stars.. Dim sums got cold in five seconds, but I guess what do you expect from a casual self service place. Anyway, I also ordered sweet and sour rib tips over rice. It came with steamed vegetables and a fried egg. The rib tips were good, but there was too much oil in the dish in general. I wanted steamy rice, but instead I got oily rice. The service was good though- people were friendly/cordial/respectful.", "author": "Michi R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-04-30", "description": "It was a rainy day and the warmth of soup dumplings beckoned. Tbh, empanadas by Atlantic terminal beckoned also, so we opted to only have am order of dumplings each. Pork and pork/crab. I didn't care for the taste of the crab dumplings but the pork dumplings were on point. I never knew that vinegar was an option for doing but we tried it and YUM. The menu itself wasn't overwhelming by any means, although the soups they offer seemed a trifle pricey. Picture a Panera Bread 'bowl' (with the noodles and kale and quinoa) a la millenial? Yeah that pricey and a bit more. \nOn the super plus side, any establishment that has multiple employees chowing down on their fare must be good right? Maybe it was for show bc they ask sat by the window with their screen printed tees.....", "author": "AnnMarie N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-03", "description": "Obsessed with this dumpling spot!! It's become my go to spot when I am shopping on Fulton street. \n\nIt's a decent size place with a cool and casual ambiance. I am obsessed with the soup dumplings .....I am getting hungry just thinking about them! They are reasonably priced for the size of the dumplings - and fresh. Wait time is not bad at all- I find the service to be quick.\n\nLove that this spot is close to several subway stations and to some main shops like Century 21 \u0026 Target.", "author": "Melissa F."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-07-03", "description": "The soup dumplings are really excellent and authentic. But most dishes on their menu are mediocre at best. My biggest complaint is their overuse of plastic even when you dine in. I feel guilty to eat there when everything is served in a plastic to-go container, even appetizers!", "author": "Katherine H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-12-21", "description": "I was back for the fried chicken noodle soup and their pork soup dumpling. The fried chicken noodle soup was horrible. Chicken tasted a day old and I felt like I was eating more dough than actual chicken. The noodle tasted below mediocre. The pork soup dumpling wasn't bad. Only comes with 4 pieces. Overall, my impression of Yaso Tangbao is that it's expensive for no reason and the taste doesn't deliver for the amount of money they are asking for.", "author": "Amy W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-11-29", "description": "I had really high hopes for this place, but it turned out to be less than expected. Maybe my standards are too high - I was born and raised in Shanghai. I came to this place craving for some authentic taste from my hometown. After trying a few items from their menu, the verdicts are as follows:\n\nThe good:\n1. Soup dumplings. Really good soup dumplings. If you're not a fan of super greasy broth, this is THE place. The crab ones were delightful and you can really taste the crab.\n2. The ambiance is trendy and casual. I also like the the fact they offer some cool craft drinks. Self-serve so no tip is required - always a plus.  \n\nThe So-So: \n1. Pork Shao Mai. Rice was mushy and the wrapping didn't have the chewy texture. I prefer the Shao Mai from Kungfu little steamed bun ramen a lot more. \n2. Chicken Sauerkraut Spring Rolls. Definitely not authentic as people don't put chicken or sauerkraut in Shanghainese spring roll; however, it is an interest combination. Tasted decent but I wish they were crispier. \n3. Beef noodle soup. Nothing exciting about this noodle soup. Noodles were soggy but the beef was tasty. \n\nThe Bad:\n1. Wonton Soup. Soup itself was okay - the wontons were just bad...there is no flavor, the skin is too thick and it doesn't have the right texture. There is way too much meat and not enough veggie in the dumpling. \n2. Pan Fried Pork Baos. Very very dry and the meat is not well seasoned. Not a fan.\n\nAs such, I think this place is a solid 3 star. I might come back for some soup dumplings if I am in the neighborhood.", "author": "Shirley Z."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-04", "description": "Worst chinese food I've ever eaten in my life. It's so bad, I made an account just to write a review and warn you. I am honestly shocked how this place has so many positive reviews. They tricked me into trying this place.\n\nI was under the impression this was an actual dim sum restaurant, especially since flipping through the photos, it shows the dumplings served in steamers, so I didn't realize that it was more of a fast food style restaurant. But that's not even the issue here!\n\nThe food here was AWFUL! The baos were mushy and tasteless, same with the xlb plus they had the thinnest, soggiest dough. The soups were bland and did not even resemble a Chinese style soup.\n\nImagine if airplane food served dumplings and noodle soup. That's what this pretty much tasted like.\n\nPlease, if you love dumplings, do not eat here. Just hop over to chinatown and even the worst restaurant there will be 100x better than this.", "author": "Merl W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-02", "description": "Soup dumplings have come to Downtown Brooklyn, and seeing as how I live a very short walk away, this is dangerous to my health. Because soup dumplings combine two of my favorite things in the world (soup and dumplings).\n\nAs far as I can tell, Yaso Tangbao is a godsend. The place is clean and comfortable, as well as one of few places in this part of the 'hood that I actually don't mind sitting and eating. The xiao long bao (soup dumplings to you whiteys*) are on point, the mapo doufu (tofu to you whiteys) is delicious, if a bit salty, and the counter service is pretty friendly.\n\nI have a few minor complaints, but they are nothing that can't be fixed or overlooked in the face of delicious soup dumplings:\n\n1. The soup spoons provided are disposable, flimsy things. If we're eating here, why not provide some real spoons, and reduce some of the waste?**\n\n2. The soup spoons are also too small. They can't properly hold an entire dumpling, which led to my dominant female overlord (wife to you whiteys) clumsily losing some deliciousness onto the nice wooden tables. This is unforgivable, and I have since begun divorce proceedings. \n\n3. The eggs on top of the mapo doufu were seriously overcooked. Keep the eggs runny, people. A runny egg makes everything better.\n\n4. There's no alcohol. There should always be alcohol. This includes the bar mitzvah I was forced to attend over the weekend. I don't care if they are still children in the eyes of the \"law,\" Judaism says that kid is a man now. At least let me drink to that, even if he isn't into whiskey just yet. \n___________\n\n*I know I may look like a whitey, but that just shows how much you know.\n**I spent my weekend hugging trees (against their will).", "author": "Peter D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-04-22", "description": "Service: \n(Friendly)\n\nFood: \n(Small portion and expensive, more importantly, didn't taste that good) \n\nWait time: \n(They get to u pretty fast) \n\nSeriously, I am not impressed with their dishes and portions with the price that they are charging.", "author": "Amelia Z."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-14", "description": "I keep bouncing around on the rating for various reasons, but I think four is fair.\n\nUpfront: it's not a 4 if you're traveling here to have it. It's a 4 if you're in the area and want actual Chinese food with authentic flavors.\n\nThere are times when I give it a five: when I'm having the Braised Pork Meatball Over Rice or the Sauerkraut Chicken Over Rice (it's a special). Because the flavors are spot on and I'm never thinking it's missing a certain flavor. But then there are times when I actually think about the price I'm paying for it, or I'm having the soup dumplings, where they named themselves after, and I'm thinking it's a three.\n\nOr when I asked if they have cold soy milk, and they said no, but they have ice. And then said they couldn't serve it to me in a drink cup because the boss gets upset about handing out a drink cup. Just think about that. I'm paying $20 bucks for my order, and if you're selling me a cold drink, which you didn't have to even do, (because if they said I couldn't get it cold, I would have not ordered it), and yet I can't get a drink cup that a drink would normally come in that would only cost them a few cents. I'm sure the owners have margins they care about, and the kid pointing out the ice in the ice machine didn't know about that crazy rule to begin with, but that stinginess is kind of extreme. I want to be understanding about it, but at the same time, it's just a cup, bro. Give me a cup.\n\nAnd then I watch the ladies stuffing the vegetable dumplings and putting a sizable amount of filling in there, or thank god I can walk over to get some comfort food and I think I want to give them a five.\n\nSo it's a four.", "author": "Melody C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-09", "description": "Once you learn how to eat soup dumplings properly, you'll appreciate this place a lot.", "author": "Jahan M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-02", "description": "gee!! A worker here named Nelson is so handsome like a Korean star!! \nAnd he is very nice and patient with all my questions.\nThe food he made looks very beautiful and fresh.\nLove the place and definitely would come here again!\nHope I could see him every time I come.", "author": "Jessica T."}], "servesCuisine": "Shanghainese", "priceRange": "$11-30", "name": "Yaso Tangbao", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "148 Lawrence St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/n8qkl-utd4uCMlOy46G05g/ls.jpg", "@type": "Restaurant", "telephone": "+19293377599"}