{"aggregateRating": {"reviewCount": 704, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-26", "description": "Went there the cold noodles were good and the dumplings were decent. There is a wait time of 20 minutes because it gets so busy.", "author": "Carol A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-09", "description": "Been here twice with a close friend from Shanghai. He loves it and highly recommended it. I don't have much experience with this type of food, so can't offer comparisons, but I loved everything I ate. Would definitely go back. I will say it's a very plain environment: don't go for a romantic dinner....", "author": "Nick A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-11-09", "description": "I happened by chance to walk past Yaso Tangbao and decided to eat dinner here. And then I've returned every time I'm in the area around dinner time. \n\nPrices are reasonable, but after eating the mapo tofu I ordered, I thought not the best deal in terms of value. It wasn't the best or worst mapo tofu I ever had, but it was still a little disappointing. I ended up adding a bit of vinegar and soy sauce to liven it up. I've also tried the meatballs over rice with eggs which was a good staple meal. \n\nI highly recommend the soup dumplings (I got spicy pork) which were great for a no wait, non-specialty spot. Each one had a good amount of soup, tasted porky, and was just overall comforting and delicious to eat. Ask for the vinegar with the ginger slices, since they don't offer it on the self service counter anymore. \n\nIt's clean, with helpful staff, and they sell really cute shirts with an old-man-dumpling character. Also you can sometimes spy on the grandma's pleating up dumplings in the kitchen (adorable). The chairs are kind of clunky and uncomfortable, but there's plenty of space and hardly ever crowded during dinner, so it's not as bad as it could be.", "author": "Sarah K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-01", "description": "First time here and the food was wonderful! The dumplings were good and the soups had a rich hearty flavor. I'd definitely go back when I return.", "author": "Leon T."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-11-03", "description": "Unorganized. Waiting time is too long. I ordered the soup dumping but have waited for Half hour and still not ready", "author": "Saikit C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-19", "description": "Fried Chicken Fillet Noodle soup is a must. Braised beef Noodle soup is awesome with a touch of soya. Tangbao s are really good. (Y2,Y3) A place with food for value.", "author": "Rourav B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-27", "description": "I was in the area for work and used Yelp to find a place for lunch. I was surprised to see a place like such come up in my search. \n\nI ordered the braised pork meatballs over rice with eggs. Delicious! The meatball had great flavor - tender and juicy. \n\nIt's quite pricey considering the dish consists of two meatballs, white rice, and a fried egg. The portion size is big so it (kind of) justifies the price.\n\nI will be back to try the other items on the menu.", "author": "Mimi T."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-11-04", "description": "I was very excited to make the pilgrimage to Brooklyn for this place after seeing it advertised on Facebook. Major disappointment.\n\nI ordered the regular pork soup dumplings, the spicy soup dumplings, sautéed Chinese broccoli, ma po tofu, and pork meatballs. Not a single dish was memorable, and the tofu, which is a traditionally heavily flavored dish, was so low in flavor that I didn't even wanna finish it. Everything tasted low on flavor. Worst of all, it all came out lukewarm. I'm so upset that I wasted my time and money for such a hugely disappointing place.", "author": "R L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-02", "description": "I'm predicting the soup dumpling revolution to start making its way into popular American diets in the near future and if you're looking for a place to invest Yaso Tangbao may be a good place to start. It was exciting to check these off my bucket list and the dumplings were all that I had dreamed of. Initially I expected a hole-in-the-wall joint but was surprised when the space had the feel of being well established or franchised and visited by a wide array of customers. Their operation here is streamlined and clearly efficient as you can even see their hand made assembly line through glass windows in the back. The delivery style is counter service and it works well for them. The dumplings come in the traditional bamboo basket and piping hot. After one bite the flavor explosion is almost overwhelming and immediately I became addicted. I'm obviously a huge advocate for these pillows of broth to start trending closer to my hometown and can only hope the quality is as high as Yaso Tanbao!", "author": "Ben T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-04", "description": "A little overpriced but totally worth it. One of my favorites is their fried rice and meatballs. It's more authentic then any of the other places in the area. I haven't tried their soup dumplings yet but they seem to be pretty popular among the crowd. I bet their awesome too!", "author": "Samantha L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-11-15", "description": "I don't get the high reviews. I think they're trying to be hip and trendy which i guess they were. But the prices are too high and minimal dishes for a soup dumpling place... what a fail. We went here after watching a friend in the NYC marathon and we all were disappointed. Got the mapo tofu rice everyone raved about. Eh. I've had better. Soup dumplings were the best out of all the dishes we got but again. I've had better. The expensive $1.50 fried egg? Not worth it. Fried gluten. Again i've had better. And the ribs were ok... i would rather not pay so much for ok food. \nService was fine. Food was super slow. Seemed to get a lot of delivery orders. They did apologize but took forever...", "author": "Brenda H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-11-15", "description": "I was frivolously scrolling through yelp looking for lunch when I saw Yaso. At that moment I knew I had to try it out.\nThe setup of the place is pretty similar to Xi'an Famous Foods, with self service, communal tables, and an ordering counter.\nI ordered the soup dumplings (Y1) and shao mai (s2). The soup dumplings were pretty good, juicy and fatty, but not super memorable. The shao mai was like little rice balls and a good filler.\nOverall, I wasn't super impressed, but it's definitely not a bad place to grab a quick bite.", "author": "Ivy C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-15", "description": "This place has great soup dumplings!! Really enjoyed dinner here. The atmosphere was nice and the food was fresh and had great flavors. Will definitely return", "author": "Jo M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-17", "description": "Not the most authentic, but definitely one of the best around the neighbor hood.\n\nThe beat noodle was ok, but the volume did not reflect the price.\n\nThe pork dumplings were really juicy, but was not hot enough and not as tasteful as I expected.\n\nOverall, super quick and convenient, and definitely gonna be on my dinner or lunch menu more often.\n\nBut it is definitely overpriced compare to the places around.", "author": "Weber K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-13", "description": "Vegetarian review~\n\nI've had this bookmarked for centuries and decided that tonight was the night to try it! Everything on the menu looked quite delicious, so I was excited. I ordered the You Tiao(fried dough), Sticky Rice sticks, and the Garden Vegetable over Rice. \n\nThe You Tiao was something I was especially looking forward to. Why? Because carbs. However, it was too crunchy and greasy for my liking. As it states, it is literally fried dough, no sweetness or savory was for it. On the other hand, The Sticky Rice Sticks were pretty tasty: think of mini sticky rice bars with a sweet/savory glaze onto of it. It was a bit oily, but good. \n\nMy favorite thing was the entree: the garden vegetable over rice. It was refreshing: the vegetables were fresh and complemented each other well in the dish. I'm not big on mushrooms, but i didn't mind them so much in the dish. I loved this because it had a steamed taste, and it wasn't greasy or oily. Also, very filling. The rice had a savory sauce that was really delicious. The egg on top hit the spot! I would come back for the garden vegetable and would love to try other vegetarian things on this menu, like the soy milk soup and vegetable dumplings! \n\nAlso, the cashier serving me was really nice!", "author": "Ani T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-07", "description": "Basic Shanghai street food, relatively cheap price for the area, fast service, clean seating area.", "author": "Evan H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-08-02", "description": "Nicely done Blue Crab and Pork dumplings, very tiny though, notice I didnt say small but \"tiny\"... so I then ordered Pork Shu Mai (sticky rice), I didnt read the sticky rice part, was truly not my cup of tea,  mushy and undetectable pork.... Larger portion than the dumplings though, go figure....also ordered the Sweet and Sour Pork Ribs since of course I was still starving from the tiny soup dumplings...my order myseriously disappeared....I will stick to Chinatown  for my dumplings!!", "author": "Patricia G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-02", "description": "Delicious and a TON of food in the noodle bowls. Some reviews have mentioned it being overpriced for what you get and quite frankly, where are you eating in Brooklyn??? Buns and dumplings at $5 and change which is completely reasonable. Noodle soups range around $10 which again is amazing given how much is actually in the soup. The veggie noddle soup is fantastic. I had more than enough to save a whole container of broth and veggies for the next day.", "author": "Erin M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-26", "description": "Quality!  The spicy XLB were particular good, as were the cold sesame noodles. The soy garlic noodles were a bit bland for my pallet, but my kids loved them.  Worth a subway ride for quick reasonably priced casual eats.", "author": "Michael D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-05", "description": "This place is the changing face of downtown Brooklyn and it is awesome. It's amazing that they decided open an independent authenticish Chinese fast food place in this neighborhood. Formerly dominated by really cheap American fast food chains and crappy pizza places, there was very little worth eating.\n\nI would say this place is similar to the Chipotle knockoffs in that it provides a fast casual dining experience with reasonable prices in a really pleasant atmosphere to sit down.\n\nYet it is not like any of those because it is truly authentic and doesn't try to copy a build it yourself style. It's actually completely one-of-a-kind in focusing on dumplings and noodles in the Shanghai style. You can see through the window where they hand make the dumplings fresh. \n\nSome people have complained about its authenticity, but at least to this westerner, it has none of the trappings of American Chinese and it looks as authentic as what I actually ate visiting China.\n\nIt's as good as any place in Chinatown or Flushing, that means it's better than any Brooklyn Chinese restaurant outside of Sunset Park. Ironically I couldn't even really find anything this good in Shanghai. \n\nMy only complaint, and truthfully one of the reasons I had trouble finding dumplings in Shanghai, is that I am a vegetarian, and their selection is limited. I love the dumplings but I tried the vegetable noodle dish they had and wasn't so much a fan. I wish they'd make some of those soups they have vegetarian.\n\nNevertheless, for a snack, quick lunch or even a casual dinner this place can't be beat. Wherever they open they will be successful and I would buy the stock.", "author": "Judd S."}], "servesCuisine": "Shanghainese", "priceRange": "$11-30", "name": "Yaso Tangbao", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "148 Lawrence St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/n8qkl-utd4uCMlOy46G05g/ls.jpg", "@type": "Restaurant", "telephone": "+19293377599"}