{"aggregateRating": {"reviewCount": 704, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-06", "description": "If you're looking to bite into a soft delicious XLB overflowing with soup you've come to the right place. My boyfriend and I came here on a rainy day looking for warm comfort food. We ordered two orders of the regular XLB, mapo tofu with rice and the N1 beef noodles. I also bought a ginger ale blood orange x Meyer lemon. I thoroughly enjoyed every single dish but my absolute favorite were the XLB. Ever since I learned how to take the subway on my own I would take the train to chinatown and eat XLB there, however after trying Yaso's I'm definitely hooked onto this place! My first bite into the soup dumpling released piping hot soup that was perfectly flavored, and abundant. Another thing to note is their custom vinegar, which wasn't as sour as other places but I love it because the workers made me ginger slices and I made my own vinegar ginger sauce! Finally, the mapo tofu can be improved with more mapo tofu sauce and the beef noodles was a tad expensive ($12.58). Overall, I will come back because the atmosphere was warm and welcoming, had plenty of seating, and workers were friendly (and bilingual!).", "author": "Michelle S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-01", "description": "Best Shanghainese food in town.\n\nSoup dumplings - aka xiaolongbao is the signature dish, freshly made behind glass window you can see how they are made from scratch, Juicy and tasty.\n\nAs for the ambiance, its both traditional and trendy - a mixture of old Shanghai posters in the 30s and Sia singing chandelier. Their spicy soup dumplings are also a novelty.\n\nWill go there again and try other stuff, like sweet and sour pork ribs. Yum!", "author": "York Y."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-25", "description": "I had heard about this place from a friend who said their XLB (soup dumplings) were really good. My friends and I were in Carroll Gardens and found ourselves really hungry, luckily I had bookmarked it when she had told me about it! The place is a medium sized restaurant, lots of places to sit. They have pictures on the wall as their menu. I ordered the soup dumplings (4 for $4.95), cold sesame noodles and beef noodle soup. My friend was right the soup dumplings are good. The broth tastes clean and has a tasty flavor. The cold sesame noodles were okay, the noodles were a little too hard \u0026 lacking in flavor. The beef noodle soup was surprisingly good especially since I was least excited about that one. The prices are pretty cheap.", "author": "Frances M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-16", "description": "Excellent solid reliable soup dumplings and assorted hip shanghai street eats.", "author": "Philly S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-02", "description": "It's really exciting to find a place to eat my hometown 's food. Really traditional Chinese Tangbao and every taste is delicious. Strongly recommend!", "author": "Jessie Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-25", "description": "Just like grandma's!\nSeriously, Yaso is a must-have for one living abroad in the United States. Best in NYC bar none.", "author": "Amy C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-04", "description": "Yumi Yumi！Healthy Shanghai style food. Pretty decent. I can eat it every day. Very good soy milk and meat ball. : )", "author": "Qee Z."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-09", "description": "I dont write reviews often, only when the food is really good or if the service is really bad.  Today, I want to praise how good the pork soup dumplings (Xiao Long Bao) are at Yaso Tangbao.  I only ordered the Xiao Long Bao and a spicy diced pork noodle soup.  Had the noodle first and thought nothing special about it, so I was thinking the dumplings are going to be so so too.  But the dumplings turned out to be amazing.  The outside breading was very thin which is usually difficult to prepare, but it was strong enough to be picked up by the chopsticks.  The minced pork inside was very tasty and cannot believe the ample amount of pork soup inside the dumplings.  \n\nI am surprised to find such high quality Xiao Long Bao in Brooklyn.  I only knew there was a famous one in Flushing back in the old days. Yaso's Xiao Long Bao is comparable to or even exceed the quality of Din Tai Fung.", "author": "Anton D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-07", "description": "The soup dumpling is probably the best thing I ever had in my life. Comfortable ambience, friendly staffs, delicious food. What else can you can ask for, I am in heaven. I am heading back again tomorrow", "author": "Huey Jeen N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-05", "description": "This restaurant is out of control delicious. I detest American Chinese food but love authentic Shanghainese cuisine so I was super happy to experience the genuine quality and dishes at Yaso Tangbao. \nThe co-owners are so eager to make guests comfortable, the ambiance is fun (you can see the dumplings being made) and pleasantly elegant given the casual nature of street food. \nWe tried nearly everything on the menu, it felt like! \nAll of the dumplings are the perfect texture, the flavor is fresh and refined, the soup rich in flavor but light in overall consistency. I preferred the vegetarian and crab dumplings most. The lion's head was totally a surprise. I don't eat a ton of meat so I was apprehensive about trying this giant meatball but I could have lived on these, they are super flavorful and the consistency is smooth and transcendent. \nI love Yaso Tangbao and cannot wait to go back!!", "author": "Kmd D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-07", "description": "Great veggie dumplings! I do like the thicker skin so that was great for me. Very disappointed with the crispy veggie noodles. The broth tasted like a seafood-esque broth..very fishy tasting. I was expecting something more neutral seeing as the dish was vegetarian. That was a waste in my opinion. Will have to come back to try the cold dishes.", "author": "Divya S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-18", "description": "I have lived/worked in Brooklyn forever. I always stay in Downtown Brooklyn when I come to visit. This delicious dumpling and noodle joint is only a stone's throw from my hotel and I only discovered it tonight. A good soup dumpling is hard to find and this place has nailed it. Highly recommend the blue crab/pork soup dumpling. So savory and the perfect chewy texture that makes getting to the meaty center that much more satisfying. Self serve counter. Friendly and efficient staff. Communal benches for seating. Only thing missing is the beer/wine and cocktails.", "author": "Jiffy I."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-12", "description": "Haven't had the XLBs (but the chef is from Joe Shanghai's in Chinatown), but the braised meatballs are the best thing here. I'd eat these things all the time. The meatballs are the Shanghainese Lion's Head Meatballs that you can have in a restaurant, but they serve it in noodle soup or over rice. They are moist, full of umami, and delicious.\n\nGreat addition to the neighborhood for fast casual Shanghainese food.", "author": "Charles L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-05-02", "description": "Expensive but solid chinese fried buns and sticky ribs. I wanted to give this place four stars, but I found the beef noodle soup to be underwhelming and a little flavorless. I'll have to return to try the dumplings! Otherwise generally good and quick service.", "author": "Stef S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-25", "description": "My boyfriend and I stopped in here today craving late lunch on Christmas and in true tradition the one Asian spot in our walk, this Shanghai food restaurant was open. I had the N5 spicy pork noodle soup and my boyfriend had the N4 chicken noodle. Both came out piping hot in minutes. We loved them both with preference going to the pork noodle. A word to the wise the spicy pork soup is delicious but very much Asian spicy not American \"spicy\". I could see this spot becoming a cold weather favorite for my boyfriend and I. \n\nThe clientele today I think really was primarily Jewish so I can't really speak to what the crowd normally is but we really enjoyed the casual vibe and delicious food here.\n\nWe will be back.", "author": "Rebecca A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-11", "description": "The best soup dumplings。\nLike, seriously the bomb。\nGet the wine chicken。\n\nOk but seriously. The best soup dumplings I've had in NY so far. Make your way down here. The dumpling skin isn't thick like the ones in Manhattan. Get the wine chicken too. Yes.", "author": "JJ L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-30", "description": "really nice and authentic place for shanghainese food. The environment is pretty good compare to most chinese restaurant in the US. The food is also good. Steam buns are fresh and delicious, always best paired with chinese vinegar. Soup is hot and tasty. Wish there be more branches in manhattan.", "author": "Summer X."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-04", "description": "Pricey xiao long bao (we had 12 and paid handsomely, especially compared to counterparts) and an excellent blood orange bruce cost ginger ale from the fridge.\n\nFYI http://www.nytimes.com/2016/03/09/dining/hungry-city-yaso-tangbao-brooklyn.html?partner=rss\u0026emc=rss", "author": "George C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-12-31", "description": "Soup dumplings fall into two camps for me - sweet or salty. These unfortunately were sweet and not what i'm used to / like. \n\nwe had two of the bowl - mapo tofu \u0026 the meatball. \nThe egg was solid, as in cardboard. Felt like it was cooked very early into the day and left to warm up when a customer ordered a bowl. For the price, would've expected them to cook the egg to order. \n\nwith no other chinese spot around the area, this place is a needed refreshing meal. but, travel a bit further and you get much better food for better pricing.", "author": "Joanie K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-30", "description": "Excellent food service was fast\nThe garden vegetable soup was amazing \nSoup pork dumpling was so good that my kids wanted an addition 2 orders", "author": "Talia R."}], "servesCuisine": "Shanghainese", "priceRange": "$11-30", "name": "Yaso Tangbao", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "148 Lawrence St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/n8qkl-utd4uCMlOy46G05g/ls.jpg", "@type": "Restaurant", "telephone": "+19293377599"}