{"aggregateRating": {"reviewCount": 704, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2019-04-27", "description": "If you wanna find a terrible Chinese food restaurant l, here is one of your options.  Their ordering system is a webpage on iPad. (Being cheap on labor) the food are mostly from the factory and can drinks. Save your money and go to any Chinese restaurant near by.", "author": "Danny C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-04-24", "description": "Concept is simple, walk in place your order \nAnd wait for the food ... food, of course Shanghai is know for soup dumplings which was really good \nBut the rest of dishes was simple and plan nothing really special.. bowl of rice, few pieces of beef and few pieces of vegetables !!! Very bland \nSome of the dumplings the dough is very thick \nBut their famous dumplings are something not be missed", "author": "Toey F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-18", "description": "I will always stop by here if I am in the area! Soup dumplings are tasty enough! I also love the sweet and sour pork ribs! Hits all the marks in terms of taste and affordability without having to trek to chinatown area. \n\nThe place uses an ipad ordering system and everything is speedy and clean. I usually don't have to wait more than 10-15 min.", "author": "Mai H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-22", "description": "Nice place. Looks clean and the food was great. I ordered the spicy pork dumplings and that was really good. I also ordered the pork ribs and that was good as well.", "author": "Ana L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-01-13", "description": "We've actually ordered delivery from here multiple times. What I'd say is it's not quite Chinese but it's still very good.\n\nOur \"go-to's\" here are the soup dumplings (spicy or not), the drunken chicken (cold dish, but very chicken-y and delicious), the sweet and sour pork ribs which are always tasty, and the braised pork meatballs (what I call the \"leftover special\" because we tend to eat it for the next day's lunch).\n\nWe switch it up whether we have these over noodles or rice. You really can't go wrong either way. The food is consistent and the quality quite high.\n\nLike having the food over rice or over noodles, you really can't go wrong eating here...", "author": "Art C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-28", "description": "I was in the mood for soup dumplings so I found the closest place and I was definitely not disappointed! This place has a very casual ambiance and the food is great! I hardly had to wait at all for my food and I ordered quite a lot. It was more than enough to split between my friend and me. $40 for 7 menu items- hell yeah! Everything here is very reasonably priced and the quality is excellent. \n\nWhat I ordered:\nPork fried baos\nYaso pork soup dumplings\nBlue crab and pork soup dumplings\nChicken curry steamed baos\nGarlic cucumber salad\nPork shao mai \n\nAll of the food was fantastic, but the Yaso pork soup dumplings were my absolute fave! I could eat them all the time. Somebody needs to bring these to Buffalo so I can!\n\nI was a little disappointed that I didn't get to try the chicken soup dumplings with the activated charcoal as they were sold out, but other than that everything was perfect. I would definitely come back here again if I'm ever in the area.", "author": "Candice P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-03-29", "description": "Reading my reviews you know I love soup dumplings and get them every chance I can. So I ordered some Xiao long bao and pork over rice. The soup dumplings where tiny and over priced and not that good at all. The pork over rice was 90% rice and just tasted like soy sauce on top and they forgot the meatball that I ordered extra to go with it. I don't see myself trying this place again anytime soon.", "author": "Nick C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-21", "description": "Yaso Tangbao is the place to go for shanghainese street food.  During our trip to NYC, we came here TWICE.  Once for lunch and once for brekkie!  The atmosphere is clean and modern.  There is a self-order counter which is nice because there are a lot of options on their menu and I didn't feel rushed to order!  There are also options to customize your dishes with like adding extra meat or extra rice or even choices between mixed veggies or chinese cabbage with rice/noodles. \n\nI would recommend getting their:\n-SOUP DUMPLING (aka xiaolongbao XLB) which are done very well.  Soup has good flavor and the dumpling wrapper has just the right chewiness and thickness.\n-PAN FRIED BUNS : we got the vegetable one (green in color) - flavor was on point as well and I loved the crispiness of the bottom of the bun but the soft breadiness of the bun. \n-FRIED CHICKEN FILLET over rice w/ egg + curry sauce - loved the combo of crispy fried chicken with a flavorful sauce. They give you A LOT of rice too! \n\nFor breakfast I would recommend their EGG SCALLION PANCAKE ROLL. We got the plain one and one with the pork floss. Both very delicious. I love the sauce they put in it! \n\nWe also got their sweet \u0026 sour pork ribs over rice w/ egg - the flavor of the pork was really good but the pork was a little dry, so this wouldn't be my first choice.", "author": "Candace H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-15", "description": "This place has pretty good dumplings for a cheap price. They aren't as soupy as i would like. We got the pork soup dumplings, pan fried dumplings, spicy dumplings, and soy garlic noodles. The noodles were a little salty for my taste. \n\nOverall, this place is really good for just popping in during lunch. It's fast casual, so you can definitely order, sit, and eat within an hour.", "author": "Claire Z."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-06-12", "description": "This is a very Americanized Shanghainese restaurant. The food is overpriced for the area for takeout style food. \n\nCame with a friend and we both got an entree and two different types of XLB to try. We paid about $18 each and the portions aren't even that big. We both shared the regular XLB and the spicy XLB. These were definitely premade and kept in a steamer to stay warm. Our XLB weren't hot at all. My friend had the sweet \u0026 sour ribs with dry noodle and loved it but it was very messy to eat. I had the braised beef over rice with egg and it was mediocre. It came with a side of cabbage or mixed veggies. I opted for the mixed veggies and it had no flavor whatsoever. My rice was completely hard except the parts where the beef sauce touched. For $12, it was definitely not worth it. The entrees aren't the typical shanghainese dishes you'll find at an authentic restaurant. \n\nIf I ever want Shanghai food this is definitely the last place I'll opt for. The employees were really nice though and the restaurant was fairly clean. Thumbs up for that.", "author": "Cristina C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-10", "description": "This is such a great place. The dumplings are almost as good as din tai fung. The service is fast. It's an easy atmosphere, you can order with a screen or with a human. The menu is a great size. The pork is all better than the chicken, but if you want soup dumplings-this is your place!\n\nSo so so good.", "author": "Lindsey C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-29", "description": "I tried this location in Manhattan and now I have eaten at the Brooklyn location. I had the chicken with rice noodles and curry sauce and crab dumplings. The food was great I really loved it", "author": "Jennifer N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-28", "description": "My friends were visiting NY and they showed me this place. Oh my. I'm in love. It's a quick stop and go place, or a chill place to take your time while eating with friends. When you come in, the menu options are on the wall and there's also a tablet you can place your order at. If technology isn't your thing, you can go on the counter and order too.\n\nWe ordered:\nSweet \u0026 sour pork ribs dry noodles\nSweet \u0026 spicy dumplings (fish+pork)\nBlue crab \u0026 pork soup dumplings\nChicken soup dumplings with activated charcoal\nChicken broth\n\nNothing fell short from absolutely delicious. The dry noodles remind me of the peanut noodles from fujiao Fuzhou cuisine in manhattan. The meat slid right off the bone for the ribs. Dumplings were great but I didn't really taste much different between fish and pork. Soup dumplings were delicious, my favorite out of the ones we tried goes to the blue crab!! \n\nI am DEFINITELY coming back FOR SURE. I just wish I lived nearby *sigh* I would be ordering takeout so frequently from here. \n\n*also they have ginger vinegar sauce on the right side of the wall with water provided!", "author": "Shirley G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-11-14", "description": "This is a great little hole in the wall in Brooklyn for some really fast dumplings or noodles. Yeah it's pretty pricey and the portions are really small, but I did enjoy everything that I ate. I don't think I'd come back here again just because I know there are better dumpling and noodle shops out there, but if you're starving and you don't want to go to the McDonalds near by, this can satisfy your hunger (only if you order a lot though!)", "author": "Elizabeth D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-11-13", "description": "I love Yaso Tangbao! I love love their soup dumplings. You know your soup dumplings are made fresh when it takes a bit to come out! Easy street parking. Order then grab seats. There's water on the side.", "author": "Anna Q."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-27", "description": "I like their food. It is tatsy and the restaurant is open seating and has a modern image.\n\nThe only problem for me is the price.\nOne or two dish doesn't satisfy my cravings so once you start ordering, you will be surprised with the final bill. \n\nIf it was more reasonable, I would like to go more often.", "author": "Ayumi N."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-10-22", "description": "The food here truly fell short of my expectations. I wanted a spot with quick hot dumplings. I got slow cold ones.\n\nWe ordered a lot of the menu so it probably just took a while to accumulate our order. But timing aside, each and every dish was cold (meant to be hot), and wasn't fresh. The skin of the dumplings felt old, the braised short ribs too tough. The noodles has no flavor, and felt thrown together, spilling off the side of the plastic container.\n\nIt didn't feel authentic, like a Chinatown hole in the wall, but rather felt like a chain posing as a delicious dumpling spot. \n\nI don't have pics cause I wanted to leave quickly. We didn't even eat everything. That is RARELY the case when it comes to me and my stomach.", "author": "Mary A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-05-05", "description": "Yummmmm, if you dont have time to wait in Chinatown, this place is deliscious amd does the trick", "author": "April H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-02-25", "description": "Sigh, I really wanted to love this place. I was so excited, and anxious, waiting for their new reopening... but my expectations were squashed.\n\nTried the beef noodle soup, pork soup dumpling, and the spicy dumplings.\n\nPork soup dumplings were quite meaty, but the skin was thick, and nearly all of my dumplings had popped before I could get them in my mouth. Spicy dumplings were so-so.. nothing was bad about them, but also nothing was amazing about them.\nThe beef noodle soup was a little too clear for me. Limited taste factor, but the noodles were well cooked.\n \nMeal cost me about 22$. Unfortunately, I think I'll just travel to Chinatown for my dumpling and noodle fix from now on..", "author": "Maggie C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-05", "description": "This place food is delicious and fresh. Would definitely be back. The dumpling soup is to die for. Fresh and clean inside a huge seating area. Very spacious.", "author": "Kisha V."}], "servesCuisine": "Shanghainese", "priceRange": "$11-30", "name": "Yaso Tangbao", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "148 Lawrence St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/n8qkl-utd4uCMlOy46G05g/ls.jpg", "@type": "Restaurant", "telephone": "+19293377599"}