{"aggregateRating": {"reviewCount": 704, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-03-17", "description": "The rice dish with chicken is ok but still pricey. You can get a pack of 4 buns at Trader Joe's for $3.50 and it tastes pretty much the same.  Lol.", "author": "Dominic M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-21", "description": "I ordered the spring rolls and pork soup dumplings. The service was pretty good, a bit of a wait because of dumplings but when I asked to check up for my order they got back to me immediately!", "author": "Adria L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-22", "description": "Welcome to the neighborhood!\n\nGlad to see this place open after passing it a few times. Definitely the best-presented thing on Lawrence.\n\nGot take-out today, spicy diced pork noodle soup, and it's very good. Service was fast, regardless of the long line.\n\nThey haven't gotten a chance to establish themselves as I'm sure they'd like to by now, but currently, this is probably the best asian spot in downtown Brooklyn. 4/5", "author": "Jared W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-14", "description": "The pork and crab dumplings came out later than the rest of our meal.  The dumplings were a good size, but we had filled up on our dishes first.  all in all a good lunch spot.", "author": "Jacquie Z."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-29", "description": "If you're in Brooklyn and you can't get to Chinatown (because the F train is down) this is the next best spot for soup dumplings. Pork Soup Dumpling is better than Spicy Pork Soup Dumpling, fo sho.", "author": "Nick M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-06", "description": "I read about this place from the NYT. it did not disappoint. food was very good just wish portions were a little bigger. The wonton soup was so good. Soup dumplings could have been hotter but yet they we're very delicious. plan to go again soon. I recommend it.", "author": "Edwin R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-04", "description": "Tasty/fresh Chinese food. \n\nSpicy pork Soup dumplings and pork buns were on point. \n\n4 stars", "author": "Andy S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-07", "description": "Amazing!\n\nUsually I give places a five star review if I've been here a lot. I'm only giving this place a four star review because I've only been here once. But MMMM!!! Is it good! Your food comes out very quick. FINALLY a good Chinese place around here! I went there for lunch, which seems the most fitting time of day to go there, and the food was like an explosion of deliciousness. I loved the dumplings with the sweet pork. You should come here, I 98% recommend it!", "author": "Jj T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-13", "description": "Great place and delicious dumpling, very clean, warm service. I went there with my girlfriend, and we order the Shanghai soup dumpling, and it's even better than the original Shanghai soup dumpling that I had in China!\n\nWhat's more, the Shaoxing drunken chicken is a must try!!!!!!", "author": "Juston J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-12", "description": "If you like authentic steam dumplings, this is where you need to be. The skin is thin, meat filling is juicy and with rich hot soup oozing into my mouth. Just like the way it is in Shanghai. Other street foods are great addition to the menu. The curry chicken is surprisingly tasty! Tender, juicy and flavorful. \nTravelled all the way from Manhattan over and worth it! Much better than joe's Shanghai.", "author": "Joseph B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-02-25", "description": "It does bring back some memory, but still not close to it. The diced pork noodle is not bad. The ribs were a little bit dry, disappoint on that.  Overall the place is nice, food is okay, will go back to try again. Hopefully will change my mind on the food.", "author": "Bridget M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-01-19", "description": "Came here the month it opened. Quite gimmicky and the flavors were pretty bland. The place seems to try to be hip and young, but ultimately, the food is subpar and there really isn't anything new or exciting about average soup dumplings.", "author": "Kimberly C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-22", "description": "Soup dumplings in a clean, modern looking fast food place is a nice change. The food is good, not overly expensive. I gobbled down a few pan fried pork buns which were really good and my hubby had the spicy pork soup. it all hit the spot and we watched the goings on of the street from our seats. I would go again and again.", "author": "Mimi W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-20", "description": "Going  out to Barclays wanted something different. Came across this restaurant. Service was great easy to order menu so you know what you are ordering if you are not familiar. Ordered to go ,smelled so good couldn't wait are it in the car. Meatballs were great moist flavorful. Sticky rice dumplings unbelievably good. Unfortunately only bad thing was trying to find parking space. Besides that ...GO NOW!!!!", "author": "Donna D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-11-28", "description": "This place has amazing soup dumplings BUT the sauce situation has recently changed for the worse. They used to provide little containers of the soy sauce vinegar mixture with slivers of ginger, but they have changed and now have a large vat of sauce and the ginger slices are too big and the sauce is watered down. Please change back!", "author": "Dez C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-05", "description": "The chicken curry rice was fantastic, mixed with potatoes, carrots, and onions. Resembles Japanese curry. The chicken was plentiful and soft and potatoes were well favored. The veggie dumplings looked very pretty with that glossy green. The soup dumplings skin are not as sticky/soggy as the usual like the ones at joe shanghai. The pan fried pork buns were crispy and savory.", "author": "Christina C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-10-23", "description": "Used to be my favorite restaurant. New menu has turned it into another Americanized Chinese fast food place. I will not be returning until they bring back the original menu.", "author": "W H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-19", "description": "Honestly, it's not the greatest spot for Shanghai food. It's not as cheap as more legit places and the front of house is run by high school kids, the old people there are more for decoration. But you know what?...it's alright. It's chain style fast food and that's totally ok. The flavors itch the spot. It's accessible and affordable. There's lots of variety. It's fun. As a whole, I find the place has a lot of value. Just think if every city or town had a place like this, people wouldn't have to wait to go to Ny or Sf or China etc to get an a nice little taste of Shanghai. I grew up in a small town and my folks long for this food. I live in ny for years and I subconsciously take it all for granted now. You can get behind that right?, that's why I give this place 5 stars.", "author": "Jazz P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-31", "description": "I got two kinds of soup dumplings, regular and crab meat. They are both tasty and juicy. I didn't find any ginger to add to the dipping sauce.", "author": "Wenhan A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-01-28", "description": "So the first time I came here, my first initial thoughts were probably another overpriced place in downtown Brooklyn. The noodles were okay and the soup dumplings were fresh and good but it's not that great tbh. You can probably take the train across the bridge into Chinatown and have better soup dumplings without spending so much money. Service was okay but it takes forever for them to make the food so you'll probably have to wait a while.", "author": "Kathy C."}], "servesCuisine": "Shanghainese", "priceRange": "$11-30", "name": "Yaso Tangbao", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "148 Lawrence St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/n8qkl-utd4uCMlOy46G05g/ls.jpg", "@type": "Restaurant", "telephone": "+19293377599"}