{"aggregateRating": {"reviewCount": 704, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-10-25", "description": "It's decent Chinese food. Chinese people are starting to catch on that decor matters at a restaurant, at this ' hip' exposed wood and brick interior, they are allow to charge $1.60 for white rice. Serving small dishes, noodle soups, easy for sharing and take-away. It is still fast food after all where they impatiently yell out order numbers across the restaurant. But with plenty of seating and bust your own tray when done, feel free to linger.\nNot a culinary break through, the hot \u0026 sour soup (酸辣湯) could use more ingredients. A reliable spot when you crave Chinese food in a setting where it isn't grimy florescent lighting with linoleum floors, much like the two asian places next doors.", "author": "Vada O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-01", "description": "Best in the town Shanghainess food with signature xiaolongbao. The noodles and rice dishes are also tasty. You definitely get your value in the food.\n\nRestaurant is also spacious and food is prepared fast and fresh. Many Subway lines lead you directly to the restaurant.\n\nStrongly recommended!", "author": "Jim C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-12-16", "description": "Aesthetics of this place is cute. Looks very neat and clean with an open kitchen to see the process of them making soup dumplings.\n\nOkay food. Not as good as I expected. I was looking forward to the soup dumplings as well as the pan fried pork buns. The soup dumplings were kind of cold when bitten into it, not sure how they're regulating the temperature for this. The pan fried pork buns were okay, although the presentation was nice and the skin was okay, there wasn't much flavoring in the pork. I ordered the fried chicken fillet noodle soup as well. Best component of this dish was probably the chicken fillet, that's it.\n\nThere are restaurants out there that serves better soup dumplings, in my opinion. This isn't the best.", "author": "Shi Lin W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-10", "description": "The dumplings at this joint are solid. Ordered the pan-seared pork Baos and the soup dumplings. The Baos were juicy and had a good proportion of bread to filling. The bread was just the right texture- soft but with a nice chew The soup dumplings were pretty good too. Portions were fantastic, a really good deal for a filling meal. I'd come back again", "author": "Nicole J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-03", "description": "Great tang tangbao. Worth the wait the veggie dumplings were very good. Soup dumplings and veggie dumplings togeather made for the perfect lunch. Take note though lines out the door.", "author": "Chris M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-21", "description": "For the longest time, I never got the appeal of XLB. I couldn't see how they were that different from regular dumplings because they were never soupy, and the skins were always kind of thick.\n\nTurns out I'd just never had good ones before. Then I went to Yaso Tangbao on a whim when I was running errands around Fulton one day. NOW I get XLB. I just hadn't had good ones! With delicate skins and plenty of soupy goodness (see: my shirt), this is what the big deal is all about. \n\nI ordered the tonkatsu soup as well, and it was fine, but the star were the XLB and that's what I'd go back for.", "author": "Jaye B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-06-04", "description": "Food is decent. Xiaolongbao skins are thick which I am not used to and the fried buns are more buns than meat and bit oily on outside. Though the restaurant is clean and very nicely kept. I like that they use all recycled cutlery.", "author": "Lisa Y."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-15", "description": "The food here was great! My friend ordered the Soy Fried Rice with Chicken Fillet, which he enjoyed though he did comment it was on the greasy side. I ordered the Chicken Curry Noodle Soup and Spicey Pork Soup Dumpling, and both of them tasted delicious! I favored the soup more then the dumpling, but I loved them both. The atmosphere was casual and the service was quick. I will definitely be returning here again.", "author": "Elizabeth R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-28", "description": "Fresh, authentic and flavorful - love the veggie noodle soup, veggie with crispy noodles, cucumber side and mushroom/tofu side. \n\nAll they need to do is add sour plum juice as a drink!", "author": "Ash C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-15", "description": "Two words: soup dumplings. \n\nBut you already knew that, right? I finally got to try this place while I was in the area. I ordered the pork soup dumplings, received the pork soup dumplings, and devoured the pork soup dumplings. Eating these were the highlight of my week and if you happen to be tired out from shopping all day and don't want Halal food or Burger King, this is a great pick-me-up coupled with some bubble tea from Kung Fu Tea in the area :-)", "author": "Jessica D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-11", "description": "Authentic xiaolongbao!!!\nWent there for lunch on Sunday and it was pretty crowded.\nThe crab and pork xiaolongbao are very very good but a bit pricey, 4 for $7.\nThe fried dumpling are delicious as well.", "author": "Edvige C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-03-02", "description": "Gross food. I couldn't finish my dumplings and my noodles tasted like plain noodles dumped in bunch of soy sauce - 1 can make 100 times better at home. I have no idea why it's always packed. Must be Bc of clean new design and quick ordering.", "author": "Chantille H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-04", "description": "One of the better places to get soup dumplings in Brooklyn!", "author": "James Z."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-27", "description": "This place has awesome food, decent pricing and everything is made fresh to order during rush hour food can take up to 20 min to make, but totally worth what you'll get. It's filling. And they have a window that you can see the cooks making dumplings. When near Fulton mall, come check this place out", "author": "Angela P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-01-27", "description": "I like their food a lot, but I'm taking two stars off because: \n\n1. Their youtiao bread sticks are way too hard. The first time I ordered them, the youtiao were hard as a rock and completely inedible, I'm not even exaggerating, because I really could not bite into the bread and the inside dough was just as hard. The second time I ordered, they were a little better, the outside was crunchy, but still hard and the inside was not soft either.\n2. Their noodles are very bland. \n\nOther than that, the rest of their food is pretty good. I like their rice dices and I LOVE their soup dumplings! The soup dumplings are the best.", "author": "Jules W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-11", "description": "really yummy!!! First time trying cold noodles of any kind and it was pretty refreshing and tasty. I've had pan fried buns in the past, but these were beyond comparison; perfectly crusted on the bottom but soft when you take that first bite. The soup dumplings are pretty good, but I wish they had more variety in general and not just pork everything.", "author": "Anisa S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-02", "description": "Yasssss! Finally a place in downtown Brooklyn that has real Chinese food. Soup dumplings- made fresh, onsite, to order. Skin is thin and delicious. Filling is perfect. As good as anything you can find in Chinatown and Flushing. Beef noodle soup is ok, but it's a really hard dish to get right anywhere. The soup had the right flavors, but was a bit watered down. The meat in it was well seasoned.\n\nThat's all I tried, but I'll be back for sure. Really excited about this place!", "author": "Lilly C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-29", "description": "Great place and I'm so happy that more cool restaurants are coming to this area. I love Shanghainese food but don't eat pork which eliminates most soup dumpling places for me. Luckily Yaso Tangbao is looking out for us vegetarians. There were plenty of menu options for me and I opted for the garden vegetable crispy noodle which came with this delicious empty dumpling thing. The fried sticky rice was also great. I loved how clean and welcoming the space is. You can see them making the soup dumplings behind a glass wall. Wish they served beer to go along with the meal. Will be back for more.", "author": "Lana V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-23", "description": "The soup buns here are legit good. Pricey, but good. I guess that's the way this neighborhood is going but if you're itching for soup buns then Yaso Tangbao is probably as good as any place you can find in NYC.\n\nThere's literally a small army of people visible when you walk into this place, working around the clock to make soup buns (I'm guessing). It's a pretty impressive operation and I'll have to come back and try the noodles and rice dishes. Check this place out!", "author": "Thomas M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-06-09", "description": "3.5 stars. A little pricy for soup dumplings, but the spicy soup dumplings were GREAT! Thin skins, great flavor. The regular pork soup dumplings are clean and tasty but not as flavorful as Joe's or the spots in Flushing. Definitely spring for the spicy. The garlic fried greens: really great -- not overcooked, simple -- and a nice serving size. The fried bao were ok.\n\nCould be improved in two significant ways:\n- The disposable spoons, while I appreciate that they seem to be biodegradable, are completely not up to the task of eating soup dumplings out of. They don't even really have rims; they are more like cardboard paddles. Please get reusable, regular spoons.\n\n- Chili oil: $1.00????? Give me a break! That hurt my feelings. Sriracha is a travesty for anyone who wants a little kick with their bao or regular soup dumplings.\n\nWill probably be back for the spicy soup dumplings and to split one of the enormous entrees with someone.", "author": "midge j."}], "servesCuisine": "Shanghainese", "priceRange": "$11-30", "name": "Yaso Tangbao", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "148 Lawrence St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/n8qkl-utd4uCMlOy46G05g/ls.jpg", "@type": "Restaurant", "telephone": "+19293377599"}