{"aggregateRating": {"reviewCount": 704, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-12", "description": "My husband and I had been eagerly awaiting the opening of this place and were not disappointed! \n\nI often miss the simple street foods of China which I've been lucky enough to experience in my travels for work. This place brought me right back there. The soup dumplings were wonderful as was the mapo tofu over rice, wine chicken and garlic cucumbers. These are definitely authentic dishes and many Americans will likely be put off by the texture of the steamed \"wine chicken\", served chilled but for anyone who knows what to expect, it's a very solid dish and is delicious!\n\nThe menu is temporary for their soft opening and I'm greatly looking forward to their more extensive menu, especially in the soup dumpling category!t", "author": "Lizz H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-30", "description": "Yay! We are finally here for soup dumplings. I totally recommend getting the soup dumplings and pork ribs, and noodles with beef but do not get the cold noodles with spicy pork. We got pork soup dumplings, spicy pork soup dumplings, and crab soup dumplings. The dumplings are so flavorful. Just thinking about them is making me drool again. Yum!", "author": "Jana M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-27", "description": "I had been here several times and also before they changed their menu. The dish I would recommend is the pork meatball noodle soup. The meatball tastes sooooo good and it is the best meatball I have ever had! I like the veggies in the dish and I think it's more flavorful than before. I love the soup as well (they make the soup with chicken bone, which makes it tasty and healthy!!)", "author": "Tifany C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-12", "description": "After walking by this multiple times hoping for it to open (there's a severe lack of good Asian food in our immediate area, and definitely no xiao long bao within a 3 mile radius), we finally got to try it!\n\nWe arrived a little after 7pm on a Monday night, and all the tables were full. We ordered the xiao long bao (soup dumplings), pork potstickers, the fried chicken fillet noodle soup and the pork mapo doufu. The cashiers were very friendly, and were taking orders on iPads - I really appreciate when establishments use modern technology. Service was quick, we barely had time to check out the very visible soup dumpling prep station of the kitchen and sit down, and they were calling our order number.\n\nNow for the food - being huge xiao long bao aficionados, we were impressed with Yaso Tangbao's version - very savory, fresh, and the wrapper wasn't too thick. We polished that off really quickly, and are thrilled that we don't need to make the trek to Chinatown anymore to get our fix! The pork mapo doufu with the two fried eggs on top was delicious and our next favorite. The fried chicken fillet noodle soup was a little weird but good. Unfortunately, we greatly disliked the pork potstickers - we could barely taste the pork, it tasted just like sticky rice. The xiao long bao and mapo doufu more than made up for it though!\n\nOverall, we are very impressed with the service, food, cleanliness, and will definitely be back. So happy to have this in our neighborhood!", "author": "Bettina B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-11-24", "description": "I have no idea why this place has so many people going there. There is usually a line and seats are most aggressive person gets to sit. The tables are stately wipes and you basically have to clean it yourself with water and paper towels at the self serve condiment station. The price is ridiculous, spent almost $50 for 2 ppl for noodles and soup dumplings. Food was also atrocious, spring rolls were burned outside and soggy on inside. Noodles w chicken were so oily i almost threw up. Only reason I'm giving 2 stars is the soup dumplings were decent, but for the price and so fee per order, they better be.", "author": "Alex L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-13", "description": "Comparable prices to Chinatown, definitely fills the hole of authentic chinese food in the area! Xiaolong bao are great, juicy, though just a little bit more skin at the top than I'm used to. Garlic cucumbers are nice, salty, and vinegary, (almost) just as good as the ones my shanghainese dad made at home!\n\nUpdate: just added the sweet and sour pork ribs and a bowl of rice to my lunch, ribs are great! Rice is, well, good ol' rice.", "author": "Angela W."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-11-10", "description": "Hated the bao and the braised pork noodles. The noodles were stiff and skin of bao too thick. Also waited for at least 20 mins for my order!! Wasted my time and money.", "author": "Huiquan L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-04-13", "description": "The decor here is nice, clean, and modern. They have free water here. The soup dumplings are ok. I ordered the one with the crab and pork and the regular one with only pork. It taste standard. I like the one from joe shanghai more and it cost around the same price but joe has dumplings. That's the only down fall. Nice spot- wish they included more for the price especially since most places have quantity of 8 like joe for similar prices.", "author": "Orange P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-11-16", "description": "I cannot express how disappointed I am. They opened up some new locations recently and are expanding to another location in Midtown East soon, so I had some high expectations. This location is spacious and seems like a popular spot for both lunch and dinner (no lunch specials though). I liked that they have a dispenser for soy sauce and their homemade vinegar sauce which you can place into little containers. As for the food, extremely disappointing and I would not consider it \"shanghainese food\". Waited about 20 minutes for all the food below and everything was cold! \n\n1. Yaso Pork Soup Dumplings (4) - Small portion and pricey in my opinion, but also the only dish I would recommend at this place. Dumplings taste decent - good flavor but lacks the soup!! \n2. Spicy Pork Soup Dumplings (4) - Still small portion and pricey but interesting spicy taste... just like spicy pork dipped in chili oil. I was okay with this and would probably order it again but definitely not to die for\n3. Spicy Diced Chicken Noodle Soup - So, so, so disappointed. This dish is literally the description - just chicken stock dumped into chicken and noodles that are sprinkled with their hot sauce and a few pieces of cabbage and carrots. Chicken was tasteless and dry - I picked out all the pieces and tossed them. If you want to pay around $11 for decent tasting noodles in chicken stock, go for it.\n4. Sweet \u0026 Sour Pork Ribs Dry Noodles - I think they should rename this to DRY sweet \u0026 sour pork ribs with noodles. Seasoned well but so DRY.\n\nOverall, come here if you are desperately craving Shanghai dumplings and are too lazy to take the train for 20 minutes to get into Chinatown.", "author": "Monica L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-11-15", "description": "This place is going down bro both service and quantity. I used to love the place. Now they look like bunch of people know nothing about restaurant", "author": "Wenbo W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-25", "description": "Yup. This happened. They were fantastic and I didn't even feel terrible afterwards. Besides juicing all over my $50 shirt, I don't regret one second of this soup dumpling. I only get soup dumplings like once a year max, and these hit the spot. Relatively inexpensive too.", "author": "Trevor L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-05", "description": "Wow. Perfect meal: portions were ample but not overfilling, there were tons of dish options, and the taste was perfect for soup dumplings, savory and filled with soup!\n\nThere was enough seating, and they had an awesome glass window in the back so you could see the chefs!", "author": "Michael W."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-12-17", "description": "Finally hit this place up. My expectations were very high since everyone's pictures looked SO delicious; pictures are deceiving. \n\nI liked 1 outta the 6 dishes we ordered. \n\nI generally do not like crab meat soup dumpling but these were omg delicious!!!!!! Their pork dumpling is mediocre \u0026 the spicy pork dumpling was blah.\n\nSticky rice dumpling was satisfying but nothing special.\n\nGarlic fried rice topped with fried chicken was horrible; there was zero garlic taste \u0026 the rice was extremely salty. It looked and taste liked it was doused in soy sauce and salt. The fried chicken tasted like it was fried in old oil and a bit sour.\n\nI wish I can say that the food was amazing but it really wasn't.", "author": "Quyen L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-19", "description": "I stumbled upon this place while working near here, and it was just in time to satisfy my soup dumpling craving. Later on, I saw it was Facebook featured! The place itself is clean, modern, and roomy. It's not so much a restaurant - more like a quick bite for lunch. \"Fast food\" if you will, but a lot healthier. They have a picture menu that you can order from. I obviously came for soup dumplings so I ordered crab and plain. They were alright - lacking a little seasoning but overall okay. I've had better soup dumplings so this wasn't a big hit on my list. It does present itself very nicely though. The second time around I ordered their pork ribs which was BOMB.COM! with a bowl of rice or something, this is definitely a great and hearty lunch! I also had the spicy beef noodles which was great for a cold day. Nothing special and doesn't compare to ramen, but do-able.\n\nOverall, a great quick lunch place if you're around the area. If you're dying to check it out, I would say go once and see how you feel but I wouldn't go OUT of my way. I came here a few times because I am around the area for work and for me it's a great place to eat and a different alternative than all the regular joe places out there that the city/Brooklyn has to offer. The atmosphere is laid-back with most people including myself just sit there enjoying their lunch breaks. Place is clean and neat and food comes out fast. Presentation of food was also a nice perk too and they have to-go containers for you to take if you don't finish your food.", "author": "Tran B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-03-25", "description": "Very good taste and nice staff. Expensive for the portion size, especially for dumplings. 4 for 6$\n\nupdate: wow. They've raised prices on noodle soups, not good enough for the price, sorry.", "author": "O V."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-03-08", "description": "Average authentic Chinese food.\n\nPros:\nNice selection\nSoups\nGreat for lunch\nGreat for groups\nAuthentic\n\nCons:\nPortions small\nOverhyped in reviews\nNoodles weren't fresh\nPremium steak (N1) not that premium or flavorful\n\n\nQ\u0026A: \nWould I come back? No. \nIs it worth checking out? Yes, only if you never had authentic Chinese.\n\nSummary: Place was cool and trendy. Attracts asians and clean cut people.  I've had way better Chinese food but what I think really hurts this place is the noodles. Almost tastes prepackaged.  Let down...", "author": "Amaury R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-18", "description": "While working in Downtown Brooklyn, you're surrounded by typical franchise eats and other goodies, but this is definitely my go-to spot for Asian food. I get the Mapo tofu rice while my friends get the pork katsu. Then we share the soup dumplings and become bao (not only is that the Chinese word for bun, but with a different tone, it means full). \n\nThank you for opening up and completing my life. \n\nPlease order in advance if you don't want to spend your lunch waiting on a long line.", "author": "Maria L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-23", "description": "I get takeout here quite a bit. The food is excellent, especially anything with noodles. It's always ready at the time promised which is nice too.", "author": "James D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-05-07", "description": "All the hype with this cool looking place had us coming over the bridge to try this but we're a bit disappointed...the crab meat pork shao long Bao was Bao and the pan fried Bao have the same type of tasteless mushy pork...pork Shu mai was ok...my son said the pork meatballs were too salty...I was surprised they served crawlfish and was not bad.", "author": "EH C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-06-20", "description": "Food is good, but this location is staffed by teenagers who stand around chatting - maybe if more of them were working, it wouldn't take so long to get the food. Seriously, there are 7 people back there and only two customers and it still takes 15 minutes steam 6 soup dumplings?", "author": "Le K."}], "servesCuisine": "Shanghainese", "priceRange": "$11-30", "name": "Yaso Tangbao", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "148 Lawrence St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/n8qkl-utd4uCMlOy46G05g/ls.jpg", "@type": "Restaurant", "telephone": "+19293377599"}