{"aggregateRating": {"reviewCount": 704, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-29", "description": "Oh man, finally a place that's close to work that's on par with Joe's Shang Hai that I'm willing to pay $3 extra for their soup dumplings.\n\nBeet noodles are wee bit disappointment, not the hand pull type.  Will try other dishes later this week", "author": "David W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-31", "description": "The atmosphere here is really amazing. The decoration and the display of the desks brings people back to old time in Shanghai. The food is good and the staffs are mostly young people and they are friendly. The boss here is a shanghai native so this is the place definitely worth going !", "author": "Penny S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-13", "description": "Great place for Shanghai food lovers! This place has the most authentic Shanghai food! . The price is reasonable And their service is pretty good. And I love this place, it's so clean and the atmosphere is relaxing and comfortable! I'll definitely come back with my bae for their TANGBAO and Shaoxing chicken!", "author": "Qianlan L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-25", "description": "Nice noodle shop in the cut in downtown Brooklyn. The fried chicken noodle bowl (weird at first but so yummy) and the soy garlic fried rice..... Sometimes the place looks empty, but as you wait for your order, the crowd starts to arrive in spurts. Average sized place, but the seating fills up pretty fast. The food is very good and worth the wait, if you have to wait for a seat.  My suggestion to the chef: you should add a chicken dumpling or two to the menu, rather than the 5-7 pork dumplings and the lonely veggie one.", "author": "Whitney C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-25", "description": "Very clean and tasty Chinese food! It comes very fast even in lunch time. \n\nOnly one thing... Their spoon is just so tiny and it was hard to eat. Can you change to the regular plastic spoon?!", "author": "Akane G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-25", "description": "Great new addition to the Jay St/Metrotech area. \n\nGreat garlic noodles w spicy pork. \n\nAlso love the curry chicken noodles. It's decently priced (for the area), quick and you def leave satisfied.", "author": "Jen V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-22", "description": "One of the best soup dumplings in NYC\n\nRecommended items: blue crab XLB and the spicy XLB", "author": "Jason F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-11-25", "description": "Went back again with a friend and very disappointed to discover that quality has plummeted. The soup dumpling has skin as thick as the Great Wall. And the cold noodle tastes nothing like the ones in Shanghai. The noodle is not right, neither is the peanut sauce. I will not go back.", "author": "Tina S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-15", "description": "this is a great place with really good authentic Shanghai cuisine - reminds me of the food I had when I was in Asia. -  great depth of flavors - also some unique combos like spring rolls with chicken and sauerkraut - You wouldn't think it but tasted great!.\n\nSweet and sour pork ribs are also not to be missed\n\nThe soup dumplings were good, but not as great as Joe's Shanghai in Chinatown", "author": "Mireille R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-09", "description": "This was a great little stop. Very quaint. I would definitely go back. Really cool neighborhood. Great service. Tasty bites. Great drinks. Great quick and easy place to get unique and legit Chinese food and buns. Not the best food but great value.", "author": "Burton M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-02-18", "description": "A resounding fair and unobjectionable.  Not bad, just not as good as it could be.  The maps pork tofu was bland, as were the other dishes my companions tried. But casual environment and good service.", "author": "Laika W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-12-09", "description": "I love this place but they need to sort their kitchen out. 20 minute wait for dumplings is not cool. I know they're working on a new commissary system as they expand but they're damaging their quality in the process", "author": "Alex F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-10-30", "description": "This place looks pretty promising and a great addition to the area that has some semi-legit Chinese/Shanghainese food. The price tag is a bit high and the quality is average to good but considering there's not many asian food selections, the high price is to be expected ($8.5 for 6 regular soup dumplings). Since it's still in its soft-opening phase, perhaps the menu will change slightly in time. They are also running a 10% off discount during this time. So on my first trip, I tried the chicken noodles with vegetables. It was okay as far as taste; used MSG, but passable to get some comforting Chinese food for lunch. In looking through the menu, I am looking forward to trying out more of the small plates.", "author": "Nilsa L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-05-12", "description": "Slow service, over priced food, no fork or spoon for take out, no napkins, rude staff.", "author": "Huang H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-05", "description": "Delicious dumpling and a homey atmosphere made for a great experience. I decided to head there since it was close to my hotel and I found delicious dumplings at a price much more reasonable than I was expecting.", "author": "Monica R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-11-30", "description": "I expected something that is really triditional and more from this so call Shanghai street food...\nI order the braised beef noodle soup and the beef is good as it suppose to taste. However...the noodle...like come on guys... spaghetti noodle???  That just made it really un-edible...you got a room full of workers... why not have hand pulled noodle? The soup...like really? It is just white radish and pork bone... where is all those other ingredients to boost up the flavor? Overall the price for this dish is to high. I guess this is one of those place that get the hype in the beginning and then it will soon vanish into thin air.", "author": "Leo Y."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-05", "description": "So happy to be able to get soup dumplings in downtown Brooklyn. This place was solid and the prices are reasonable. There is a bit of a wait for food though, so be warned. I would say it's about 10-15 minutes. I had the crab and pork soup dumplings and the spicy pork noodle soup. Delicious and authentic!", "author": "Sage L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-09", "description": "Ever since I learned about this new Shanghai dumpling house, I've been wanting to go. Went there to get lunch on a Saturday, and surprisingly the restaurant wasn't too crowded. For me and my cousin, we got 2 orders of soup dumplings and old fashioned tomato soup, one cucumber appetizer, one meatball noodle soup and the wine chicken. The soup dumplings were soo soooo good although honestly the highlight for me was the tomato soup and meatball noodle. The tomato soup has just enough sourness and sweetness and the meatballs were just over the top, so soft and juicy. Having tried couple other soup dumpling places in ny and Boston, i'd say Oh YEAH, this is prob one of my best experiences so far. If you'r ever craving for some yum Chinese quick bites, THIS is the place to go.", "author": "Qunnie W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-25", "description": "I've been here a couple of times and the food quality is pretty consistent. The noodles are good and perfect to have on a rainy day. However, the soup dumplings are just ok. \nPrice- and portion-wise, it's more expensive compared to Chinatown, but it's the best around the area.\n\nThis place is my go to restaurant if I'm craving hand-pulled noodles and am too lazy to go to Manhattan or Flushing.", "author": "Yen N."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-01-23", "description": "While this place does not rise to the level of Shanghai Cafe (100 Mott Street in Manhattan) I must say the buns were ethereally light and filled with lovely broth. Sadly, only 4 buns to a basket (much more expensive than SC) and the fillings for all three flavors were strangely sweet. Also the baskets have no bottom, so soup splattered all over the table and onto our legs. :( Definitely a good last resort if you're in BK and need a bao fix, but not one for the ages, dumpling-wise.", "author": "Vanessa M."}], "servesCuisine": "Shanghainese", "priceRange": "$11-30", "name": "Yaso Tangbao", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "148 Lawrence St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/n8qkl-utd4uCMlOy46G05g/ls.jpg", "@type": "Restaurant", "telephone": "+19293377599"}