{"aggregateRating": {"reviewCount": 41, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2019-05-25", "description": "Cute little corner store with a small but reasonable selection of food and drinks. The service here is exactly what you need for this type of business. Nothing over the top but very efficient. Eye contact, greetings and farewells give a personal touch.", "author": "ThreeSteps T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-04-02", "description": "Ordered lunch from here for the first time. Got a chicken cutlet sandwich with extra hot peppers. Delivery was quick and the sandwich was ok. Unfortunately, the cutlet was so fried (or old) that it had the texture of jerky, which was too bad because everything else was pretty decent.", "author": "Sarah G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-01", "description": "I had requested/created a sandwich today that I recommend you try.   They made it very well.   \n\nToasted Poppyseed Bagel With Butter, Warm Roast Beef, Pepper Jack Cheese, Hot  Sauce and a few light dabs of Ketchup.   No mayo, no lettuce, no tomato.  \n\nMy golly that was the best sandwich I've had in a while.  And it was just perfectly made.   \n\nThe man behind the counter was just the coolest guy.  he was the owner", "author": "Vinny S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-30", "description": "Great place for lunch came here once and I'm in Love , I work about 10 mins away walking and I would eat here everyday if I could . \nThere sandwiches are great , and they don't skimp on the meat . Would recommend this place if your in the area . Love the out side decor , feels like an old school corner store that nyc was built on . \nMust try !!!!", "author": "Greg K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-19", "description": "If I could give this place 0 stars I would. The owner is a complete imbecile. I ordered a monte Cristo when I went to pay,  he told me my money was fake. I gave him a 20 dollar bill that was a 1963 circulation,  legal tender and I just got it from an atm machine. He showed it to the other genius working there and he said it was fake too. I told him to keep his sandwich and ate at place down the street where they had no problem accepting my money.", "author": "Adventurous P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-22", "description": "Ok, the Prices are out of this world for what you get.  \nGuess what America You are in Brooklyn Heights, where a 1 bedroom apartments cost $4500 a month or 2 Million to purchase.  So its a neighborhood deli that the people who live in the neighborhood can afford to pay more.  \nAll I can say is the Fat Boy is incredible.  \nThe Staff is friendly (except the Bald Guy) You just need to get to know him.  The place is clean. \nwho ever had a bad experience might have a bad experience anywhere.", "author": "Patrick W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-11", "description": "Wonderful service. Delicious sandwiches. Beautiful old building. Great place to sit with your dog on the front patio and drink a coffee.", "author": "Abigail H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-10-30", "description": "This place has added $3-$5 tips onto my credit card receipt twice. I've called them out and they've played dumb. They're jerks and their sandwiches are way overpriced. The new deli one block away on Hicks and Atlantic is 10x better.", "author": "Paul H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-09", "description": "We order from here quiet frequently and occasionally go to pick up our order. It's our favorite go-to deli. We tend to stick to their sandwiches and haven't tried much of their menu. Their sandwiches are awesome - we usually order the turkey and the fat boy and both are great. The bread is fresh and there is the perfect bread/meat/cheese ratio.", "author": "Ann L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-03", "description": "Brooklyn Heights deli is different. At first glance, it looks like an out-of-place established deli in Brooklyn Heights minus the intimidating bodega cat you wanna pet and take pictures of. \n\nWhat kept me away for so long is the preconceived notion that they didn't accept credit/debit cards. Pretty ignorant of me, I must admit. \n\nAs you walk in, it looks a little confusing. There are two long aisles total. Don't be alarmed, though. There is a very big chance that they have exactly what you're looking for. One night, I was looking for a La Croix water (in tangerine) in a can and some Kettle Brand salt-n-vinegar chips to go with my sandwich and had no difficulty. The service I received was exceptional. \n\nThese guys know how to make a sandwich. The chicken cutlet with mozzarella, avocado, mayo, and onions became my go-to. If you live/work nearby and opt for delivery, you'll be greeted with a smile upon receiving your food like I have. Imagine that.", "author": "Adriane C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-10-16", "description": "Cute store that's obviously been there forever, but skimpy sandwiches and they overcharge you. Prices are clearly listed on the board:$4.35 for a sandwich on a roll, $0.50 for tomato, $0.35 for onion (don't get me started on charging for two little pieces of onion), should be $5.15 plus tax. How do you get to $6.85 total for the sandwich?? Are you charging for mustard now too?? And then when I open the sandwich up, it was the tiniest little bit of meat I've ever seen on a sandwich in this city. Insult to injury!!\n\nAnother disappointing deli that feels the need to nickle and dime their unsuspecting customers. \n Good for them, you got me for an extra buck but lost out on my repeat business. Just beware if you come here, they're gonna try and pull a fast one on you.", "author": "Bill B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-20", "description": "If this place is good enough for Sarah Jesica Parker, it's good enough for you. Awesome quintessential NY deli with amazing sandwiches. Good service, lots of selection. What really puts it over-the-top is the historic building, the tables and umbrellas you can sit out under on one of the beautiful corners of Brooklyn Heights.", "author": "David S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-07", "description": "I like going here when I go to New York. They prepare my order as I like and with a friendly expressions. People are friendly and willing to help. Thumbs up!", "author": "Sam N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-07", "description": "This is the sort of corner deli that makes NYC great. A decent selection of dry goods line the shelves, and you can get yourself some fruit, coffee, and a good bacon egg and cheese. The guys that run it will offer up jokes and a pickle to go along with your sandwich, and make you feel like a regular even if you aren't. \n\nWhile I appreciate the pickle gesture, I do wish they would wrap it better. It will soak your sandwich through in no time flat, and even your pants if you wait too long to eat. Then you smell like pickle the rest of the day, and nobody will love you. And thirty years later, you'll wonder if it was that one leaky pickle that doomed you to a life of loneliness, or if it was just your personality. \n\nI think it was the pickle.", "author": "Peter D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-13", "description": "Amazing God father sandwich (aka: Italian sandwich). Guys behind the counter are straight shooters and happy to see a smile:-) My partner and I come here every weekend so we can sit out front relaxing, eating our sandwiches and watching the neighborhood go by.", "author": "Rebs A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-09-12", "description": "Go to another deli if you can. The people here are annoying. The general customers are loud. The sandwich maker is stingy with the meats. Also the cashier will try to overcharge you. The sandwiches are okay, but they do induce bathroom trips a lot. The food did make my throat very dry.", "author": "James D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-21", "description": "Best deli in the area. The owner is very nice and has a great sense of humor! I'm a new daily customer for sure! Plus, they are open at 530am!", "author": "Darrin L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-26", "description": "I love to order from here! Their sandwiches are amazing and the delivery is always super fast. Everything I order comes as it should and I never have any complaints. I mostly enjoy the prices. You get a great deal with the prices of the sandwiches and you never feel like you are being ripped off. It's a good size sandwich for what you pay for.", "author": "Alyssa S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-10-31", "description": "Lousy sandwiches and lousy delivery times. It's hard to believe that a sandwich could be prepared this badly. I'll never order from here again.  Here's a tip. When preparing a hot sandwich you don't microwave the bread you microwave the insides, then put it on a toasted piece of bread. Otherwise you wind up with a soggy disgusting ball of dough. Delicious.", "author": "Adam S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-10-10", "description": "Sandwiches are pretty good, but the bald guy behind the counter is rude to me every time I stop in this store.  He's quite nice and accommodating to his women customers but seems to have a chip on his shoulder when it comes to men who aren't bald or taller than 5' 5\".", "author": "A C."}], "servesCuisine": "Delis", "priceRange": "$11-30", "name": "Brooklyn-Heights Deli", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "292 Henry St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/A2b816G8aHfyRTBRrf5v_g/ls.jpg", "@type": "Restaurant", "telephone": "+17186431361"}