{"aggregateRating": {"reviewCount": 41, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-11-22", "description": "Health department needs to teach little bald f**ker put his gloves on when preparing food.", "author": "Marius H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-24", "description": "One of favorite spots in the neighborhood. Amazing breakfast sandwiches, which are always delivered in a timely manner! \n\nMy boyfriend and I order from here every weekend! The Henry Street wrap is the best :)", "author": "olivia k."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-07-17", "description": "This place is your typical deli food. It's convenient for where I live so I go here sometimes to grab a sandwich or bagel and coffee. Employees were friendly enough. Overall nothing really blew me away, but no bad experiences.", "author": "Jamie P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-01-27", "description": "Ordered a grilled lemon chicken salad on Seamless that was supposed to come with tomatoes, cucumbers, and broccoli but all I got was browning iceberg lettuce and a few sad pieces of chicken that had nothing lemon about them. When I called, the guy told me it doesn't come with broccoli even though it's listed in the seamless description. He just kept saying \"we'll take care of you\" but didn't offer any actual solution. If I had enough time on my break I would have walked up there and given it back. $14 down the drain. So disappointed.", "author": "Y Y."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-17", "description": "Wish the bread was better but quick service and great variety. But can anyone tell me whether they are related somehow to Hamilton Deli up by Columbia U.? They have the EXACT same specialty sandwiches (e.g. The Big Bird, The Godfather, The Lewinsky.) That can't be a coincidence.", "author": "Ben A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-23", "description": "Great sandwich nice and fresh, For the area a drink muffin and sandwich for around 10.00 ..Not bad!\n\nI am coming back.", "author": "Scott M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-28", "description": "Always a solid sandwich, fresh ingredients. I order through seamless at least once a week, food always comes within 30 minutes and delivery guys are always super nice. My go to deli in cobble hill hands down.", "author": "Abnous V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-01", "description": "This is my favorite deli in Brooklyn Heights,really in New York. I'm not fancy, so I usually have the egg and cheese on a sesame bagel and a cup of coffee. The sandwich is always just the way that I like it . They also have great sandwiches. I like the chicken breast on rye with mayo and mustard. Their breads and deli meats are always fresh. The coffee is fresh and good. \n\nThis is a great neighborhood place. Whenever I walk in, everybody greets me. They are just great. The outdoor area is a very comfortable to enjoy a sandwich and coffee and talk to the neighbors. It is a small area, but always kept clean and neat. This little seating area is a place where young and old are welcome. \n\nThe guys that work there are very friendly and caring. They have gone out of their way to help some of the home-bound folks who order from the deli and have proven themselves to be considerate neighbors and supportive members of the Heights community.", "author": "Pat H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-10-13", "description": "While getting lost in Cobble Hill i stumbled upon this deli. I was in desperate need of something to drink and wandered in where i was greeted with a big hello and two smiles from the people behind the counter. As expected from any deli/convenience store the isles are small and tight in order to offer you the large array of items. The small deli counter contained what looked to me like very fresh and yummy deli meets and salads (though I did not order any food). Theres an atm here and the fee is super low, too (they only accept cash)\n\nupon purchasing my soda i asked for directions and not only was i happily given great directions but a nice conversation about the area as well. The staff were very nice, helpful and a pleasure to run into on my adventure.", "author": "samantha s."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-03", "description": "I love the bagels at this place. They are one of my favorite parts of the weekend. The sandwiches are pretty good too. This deli also offers many choices in beverages, chips, treats and groceries. The staff members, especially the owner, sometimes give you a hard time but just give it back and you'll be fine. It just feels like part of the charm.", "author": "Emily C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-13", "description": "This deli is our favorite!! We eat here every weekend! The sandwiches are consistently good!! The people are nice and the service is fast. The palone and the fat boy are amazing!", "author": "Jaime H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-19", "description": "Excellent turkey wrap. Service could be more knowledgeable but they are fast and affordable. I really love the outdoor seating on Henry.", "author": "Ryne W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-08-14", "description": "Too pricey and the food is ok. Nothing special here to justify the price. Order the godfather but the there was little meat and the bread was on the stale side.", "author": "L S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2009-10-09", "description": "Rude ass bastards. I was waiting patiently in front of the counter (only customer in store, thursday afternoon around 2:30pm) made eye contact, smiled, looked at paper menu- nodded- and folded it, eye contact again- and 3.5 minutes later two ladies off some tour bus come in the doors and talk to each other about tuna salad for a minute---- and the guy at the counter then turns to them and asks them what they want. He saw the look on my face, and continued grabbing rolls to make their sandwiches. A US Postal Service courier came in just after the two hags and witnessed this and was shocked to the point of her jaw dropping. But I was already on my way OUT the door.\n\nTotally horrible. I'm not used to bad service.  True, I'm basing this review angrily and on a one time experience-- but I'm never going back to revisit this shit. The guy was a douche bag. And shame on the two old hags who KNEW i was next and continued to order. I hope their tour sucked.", "author": "Phoebe J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-03", "description": "I am like other reviewers in that I always wanted My NYC deli. Being from Ohio I always saw this on tv and wanted it for myself. This is it!  The guys behind the counter know when I walk in that I want two sesame bagels with cream cheese. They are friendly talkative, they know what I do for a living and I know their children's names and how their baseball season is going. While there seems to be a discrepancy in how much cream cheese is actually spread on the bagel it is always great. I have not gotten a sandwich here that I did not enjoy, and while the other grocery items may be a bit over priced it is nice to know they are there if I need them. I can not imagine ever going to a different deli in the city.", "author": "Jason C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-28", "description": "My go to spot for sandwiches and egg and cheese on a roll.  No thrills place.  Staff is very friendly.", "author": "Jay B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-02-11", "description": "I've always wanted a deli to call my own. You know, the sort of place where you walk in, and the guy behind the counter waves and says, \"The usual, friend?\" and then passes you a toasted cinnamon raisin bagel with extra cream cheese on the side, all perfectly packaged in a nice little paper bag that's already been sealed up because said deli guy knew you'd be coming in at 7:24am. On the dot.\n\nDreaming big, you say? Never gonna happen, you smirk? \n\nI was skeptical, too, until I started frequenting the Brooklyn Heights Deli, where, when I walk in the door, I'm always greeted with beaming smiles. These guys love me.* I love them.\n\nThis is MY deli, and it's a good one. The food here is solid. There's a nice little outdoor seating area out front. During the holidays, there's a singing Santa outside that hypnotizes small children. It's a jolly place.\n\n*Sidenote: I've witnessed the same I've-never-been-happier-to-see-anyone-in-my-entire-life exchange with other customers. So I guess this isn't an exclusive affair. Sigh.", "author": "Krissy G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-19", "description": "Simply the best-have been going here regularly for over 20 years-a neighborhood staple-Frank and his staff are wonderful guys-friendly funny and make a great hero!!", "author": "Thomas A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2007-08-08", "description": "The shop is clean. It has a few tables outside and it makes a great sandwich. The best I have had in Brooklyn Heights. I finally tried this place after walking past all the time. The man made me a great sandwich. \n\nWe had a good discussion on not putting too much on the sandwich because if you do you simply lose the flavour. We both agreeded that  too many condiments are a bad thing. \n\nI have found my new sandwich shop. \n\nI will be back.", "author": "oWEN w."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-26", "description": "Great subs \u0026 free delivery in the neighborhood. I can always count on being extremely satisfied whenever I order a hero from them.", "author": "Chelsea m."}], "servesCuisine": "Delis", "priceRange": "$11-30", "name": "Brooklyn-Heights Deli", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "292 Henry St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/A2b816G8aHfyRTBRrf5v_g/ls.jpg", "@type": "Restaurant", "telephone": "+17186431361"}