{"aggregateRating": {"reviewCount": 396, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-14", "description": "I am going to start by saying I have never eaten at Joya or Song, so I feel as if I am able to review this a little more objectively than most. We went on a Friday evening and though it was completely packed we were seated within 5 minutes of being there. The service was a little spotty. Although they were very quick, they were not very attentive; but, as I said it was packed. \n\nWe had the thai mango salad and chicken satay to start, I had chicken with veggies in chili basil sauce (I will not try to spell the name from memory) and my boyfriend had grilled skirt steak over veggie fried rice. They all were really good. The portions were generous and the entire meal was under $35. To top it off, it's BYOB which is fantastic because I sell wine and always have a ton of it. Was it life-changing Thai food? No, but we both really enjoyed our meals and with those prices, its a no-brainer. We will definitely go at least once a month.\n\nPros: cheap, quick, yummy, large portions, cool atmosphere, BYOB\n\nCons: inattentive staff on busy nights", "author": "Brianna C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-01-12", "description": "I am a long time patron of both Joya (when lived in CG) and Song (when lived in CG and Fort Greene) before National opened. \n\nI want National to be exactly like Song and Joya are -- cheap, good and reliable.  The prices are the same but the food is just not on par with Song and Joya.  \n\nThe shrimp rolls are constantly undercooked, the curries and kaprow dishes are badly assembled. The spicy noodle dish is still good but can't help but feeling that everything else is not. \n\nThey really need the chef from Song or Joya to come and tighten up their kitchen. \n\nThe  dine in service staff are pretty bad, inattentive and slow.\n\nIf they cleaned up their act, I would eat from here 2x a month minimum.", "author": "Max R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-12", "description": "Great food, ambiance, and music! the price was right, I will be returning soon!", "author": "Liz C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-05-14", "description": "Let me be clear: I was a long-time, loyal customer of this place for a year. I thought the food was pretty good and the prices weren't bad.\n\nI order yellow curry every time- once I tried come seafood special and it wasn't very good, so I stuck with what I knew. \n\nI ordered yellow curry yesterday, picked it up, and went home to find that it was something entirely different. I called up the place to explain this mistake, only to get possibly the nastiest woman you could imagine! BOY was I thrown off. I couldn't believe it. When I asked to speak to the manager, she said she 'was in charge'. I said \"well, are you the manager?\" She said no, but again that she was in charge.\n\nI told her she had just lost a loyal and frequent customer, and probably gained a bad Yelp review. \n\nSo there you have it, decent (albeit inconsistently) Thai food- so long as you stick to the yellow curry, but terrible customer service, especially if you didn't get what you ordered.", "author": "Em .."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-08", "description": "A pretty nice little Thai spot in Ft. Greene. I came here when it first opened up this past summer, and the owner didn't yet have a liquor license. I was impressed with the food--which you can see being cooked over high flames in the back--and the simple but chic atmosphere. Did I mention it's pretty damn inexpensive? Been back more than a few times, and haven't had any complaints. My favorite dish is probably the Masaman curry chicken!  Oh yeah, and try the Thai authentic Chang beer.", "author": "Joey G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-11-16", "description": "This... is a slam dunk 5 star restaurant if I've ever seen one. Let me lay it out for you:\n\n- Excellent food. Like really, really good. On food alone it's a 4.5 out of 5. (Try the tempura string beans, green curry dishes, or spicy (drunken) noodles! AWESOME.)\n\n- Superb value. Almost all the entrees and curries are 7-8 bucks. Great portions, and if you get 1/2 an app and an entree, you can expect to have lunch the next day.\n\n- Great service. Attentive staff on a small floor that is always paying attention to you (partially because they try to turn over tables quickly - but never bothersome in that attempt ). \n\n- B.Y.O.B. (No corking fee.) As if you needed another reason to go.\n\n- If you care, it's a brand new place and looks pretty cool inside. Definitely a plus for ambiance. \n\n\nIt may be obvious by now... but I just really, really, like this place a lot - so solid all the way around. We live about a 10 minute walk away, and delivery gets here in about 15 minutes (never once over 20.) \n\nIf you're in the area, do yourself a favor and go to National.\n\n\n\nOther things to note (These could be perceived as negatives, but they kind of come with the territory, I guess, when everything is so cheap):\n\n- Cash Only\n- No Reservations\n- Smallish Place (30-40), so you may have a wait during normal busy hours\n- Can be cold by the door", "author": "James H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-06-11", "description": "The best thing I can say for this place is that it has a devoted following that seems to love it. I didn't enjoy my first visit here so I came back. I was hoping my first experience was a fluke, especially because I like Thai food and National is close to my place. But I visited for the second time tonight and I won't be back. \n\nFirst off, any Thai restaurant that warns you on the menu that a dish is spicy and then serves you food that is at best sweet but in actuality bland really needs to be shut down. I suppose that in the quest to find customers some chefs will do anything, but that does not mean you will be also turning people away. I also noticed that they offered me chopsticks without asking. It seems like they've just given up on trying to represent Thai cuisine. \n\nThe ambiance was not pleasant. Blaring alternative rock (U2), garish paintings, and an odor of dirty mops. I came in and the guy at the front didn't say hello back to me; turns out he's the busboy and it wasn't his duty to speak to me. That was weird but then the host didn't speak to me either. He just walked up to me and stared. I didn't know what he wanted and then he leaned over so he could hear me better. I finally realized he wanted me to tell him I wanted dinner. The waitress treated me perfunctorily until I only ate half of my salad. After that I seemed to gain her respect and was a little warmer. After she brought me the bill I put down my credit card and suddenly the busboy found his voice: \"We don't take credit cards. Cash only.\" All right then, I put down cash. I got my change and left. No one bothered to say goodnight, even the busyboy who was at the front. \n\nThe first time I was there, I tried a special grilled shell steak. It was tangy, I guess, but it was chewy and sopped in sauce. Not great to eat. Tonight I had a green curry which was good enough. In both cases the salads were boring. \n\nNevertheless, it seems as if a lot of people here, either to dine in or take out. Don't let me decide for you. I suppose if I were more patient I'd try out different dishes and find out what it is that they serve that keeps people coming back.", "author": "Chris C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-11-16", "description": "After ordering take-out, I will try to avoid National at all costs. I was extremely disappointed that my rice was overcooked and unediable. I was in total shock since i had plesant experiences at Joya and Song. I also dined at National a few weeks back.. my dish was not appetizing. I figured it was due to recently opening (still trying to figured it out perhaps).. \n\nOverall- I'm not impressed with National to say the least. I think they have a ways to go.", "author": "Jul B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-09-23", "description": "After obsessively checking every couple of days for the past few weeks, my husband and I were SO EXCITED when National finally opened. The menu is indeed identical to Joya (and I think to theother sister restaurant Song), and the maxim \"if it ain't broke, don't fix it\" ne'er rang truer to mine ears. National is cheap, the food is made with good ingredients (as opposed to normal takeout crap), it's much nicer inside than any place charging those prices has a right to be, and-- most importantly-- nearly everything I've had is DELICIOUS. \n\nThe service is definitely still working out its opening kinks, but I'm confident they'll become just as efficient as the other two restaurants. I swear by the green papaya salad, the mango salad, and the tofu pad khing-- and anything from the specials list is usually excellent.  GO THERE!", "author": "Kate B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-05-19", "description": "While National has a good location and great atmosphere, I found the food to be pretty bland. I ordered the Woon Sen with chicken and my friend ordered the vegetable fried rice and neither was spicy or savory in the least.   \nIf you're looking for a quick, filling meal the National is fine; if you want a unique experience or some rich Thai food you better skip this place.", "author": "Ben P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-27", "description": "The food here is so good and affordable.  I ordered chicken in coconut cury sauce with noodle and my friend had salmon with rice and brussel sprouts, both meals were so good . Also try the thai tea", "author": "Sabrina Diamond J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-12", "description": "I was pleasantly surprised. I attempetd to eat at this restaurant, but I didn't have cash on me at the time. That is the only negative I found(they only take cash, no credit). The service was fast, the waitress was attentive, the food was good and the prices are reasonable.", "author": "Nicole J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-19", "description": "Found it by accident...............loved the look of the place! Staff were really nice.........food was tasty,fairly priced and well presented! Only thing i strongly object to is cash only...........really !?!?", "author": "David H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-29", "description": "I have been here a couple of times and their chicken/shrimp pad thai has always been delicious. the calamari is also excellent - fresh and lightly fried. the food is definitely well proportioned and well-priced. service was pretty good. only downfall is it's cash only and it's not a large restaurant; fortunately I've been there when it hasn't been overcrowded, but would recommend calling in advance if coming with a large party (8+).", "author": "Jennifer Y."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-30", "description": "Grabbed a bite here yesterday with some friends after a mild shopping excursion at target.  Awesome! Great food, great prices, good portions, decent service, and realtively \"cool\" interior.\n\nSummer Roll was so-so\nBut the veggie spring roll was boss.\n\u0026Chicken Green Curry w/ brown rice was great!", "author": "Madison R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-23", "description": "This place was a great find.  After indecisively wandering around the neighborhood for a good 20 minutes, we found this place on Yelp (and promptly lost it again because seriously, do you know how common the word \"National\" is?).  It's far cheaper than the other restaurants in this neighborhood ( all entrees less than $10), but it is cash only.  It's also BYOB, and almost every table I saw walked in with one.  It was about half-crowded when we got there early on a Sunday, but it was completely filled by the time we left.  Plenty of delivery men and takeout kids were also seen.  Nobody I saw looked like they were over 35...\n\nThe space is kind of loud, maybe partially due to its BYOB nature, and you'll get constant drafts if you sit near the door.  Food service is fast, and everything was really, really surprisingly good.  I had pretty low standards for something so cheap, but trust me, they give you a lot of really good Thai food for the dollar.  Water glasses were refilled constantly, and the check was taken care of with no problem.  Go, but don't take my table!", "author": "Carol H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-06-01", "description": "This is a place to go for decent, reasonably priced food if you're in the neighborhood and have a craving for Thai. It has a great view of Fulton Street and the service was friendly and attentive.\n\nI got the summer rolls, the chicken satay, and the chicken krapow. I was  disappointed in the appetizers, especially the summer rolls. Aside from the rice paper, there wasn't anything Thai about them, and they tasted like I could have made them at home from leftover salad fixings. The satay was good, but there was extra coconut milk on top of the chicken. That said, the krapow was pretty good!", "author": "Mark S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-12-07", "description": "I've been to many Thai places in NY, this is by far the best. Not pretentious, not expensive and it's delicious. The quality of the ingredients is high and the cooks put a lot of care in the preparation. Don't waste your time or money or appetite on anything else in Brooklyn, this place is tops. Beats the pants off of Joya.", "author": "J K."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-09-24", "description": "I was excited to try this place being from LA and ehhhh? just was ok....much improvement needed in all areas!", "author": "ozzie m."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-10", "description": "I've never been to Song or Joya but I was eager to try the food at National. My friends and I were a bit disappointed to find it was BYOB, since one kept talking about the drinks at Song, but there is a well stocked liquor store down the block. I had the fried rice with shrimp and was shocked that getting shrimp was the same price at all the other options--definitely one reason for me to come back. The rice was light and full of flavor. A friend complained that her meal was too salty but I didn't taste it and I didn't share any of mine. It was a good sized portion and cost under $7. They are cash only but the deli around the corner has an ATM that gives out $10. Can't wait to go back for more.", "author": "Chey H."}], "servesCuisine": "Thai", "priceRange": "$11-30", "name": "National", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "723 Fulton St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/i2Va7tG05YlCvRCJ0x_kBQ/ls.jpg", "@type": "Restaurant", "telephone": "+17185223510"}