{"aggregateRating": {"reviewCount": 396, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-28", "description": "Great little restaurant, though it can be a bit hard to find. \n\nI ordered the spring rolls and the chicken pad thai while my cousin ordered the shrimp pad thai. \n\nThe spring rolls were good, not the best I've had better but definitely good. The pad thai was great! It was fresh, came with a large slice of lemon and there was lots of it. It didn't have as much of peanut sauce which was a pleasant surprise. \n\nThe decor was also nice and the prices very reasonable!", "author": "Ansar K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-11-27", "description": "Joya has come to Fort Greene, clearly a younger sister that is waiting to mature into an adult. \n\nYou will find a familiarity here if you have been to their sister restaurant Joya. \n\nClean, sleek, simple design. Similar offerings as Joya but with less options. No open view of the kitchen. Avoid sitting near the door as it can get drafty. Solid selections of classic Thai favorites including pad thai and pad see ew. \n\nEye-candy waitstaff are a bonus. \n\nCurrently, BYOB and cash only.", "author": "Vivian H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-05", "description": "My wife and I stumbled upon this place on a night out, and came back a second time not knowing that it's owned by the same people at Song in Park Slope.  We recognized the manager, Andrew, who was accommodating and extremely generous.  The original restaurant is Joya in Downtown Brooklyn, which we look forward to trying since our experiences at the other two have all been great.\n\nThe atmosphere is casual and upbeat, and the service is friendly and always receptive to questions and dietary concerns.  And the food, at this price, can't be beat.  Every dish we've had has been delicious and full of flavor.  We're both vegan and we've never had a problem, even though much of the menu would surely satisfy the most carnivorous.\n\nThe beer and wine choices are also nice yet affordable.  I would recommend this in a heartbeat to anyone looking for an ideal date, or just a night out with friends or family.", "author": "Kevin C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-01-11", "description": "I ate here before the Nets game, I have to say that it wasn't that bad of an experience at all. \n\nThe inside is very nicely decorated with a very modern style American look to it. And the demographic that comes in to eat (at least at the time that I went to eat) is very multicultural, which serves a nice spot in a Brooklyn neighborhood. \n\nWe ordered 3 dishes - pad thai (chicken), a thai curry with beef, and a small fried calamari.  First of all, we were surprised at the size of the portion of small fried calamari. It was very good plateful. We thoroughly enjoyed the calamari. The pad thai is similar to pad thai at other places. The thai curry (I love thai curry), was delicious, but the beef inside wasn't really what I was expecting. \n\nAnyways, if you are hungry before a Brooklyn Nets game and want to grab a bite at a thai restaurant, this is definitely a great place to go.", "author": "Zenas A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-19", "description": "Definitely a go-to spot especially considering the price!\nMake sure to bring cash! no plastic accepted...", "author": "Andres V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-28", "description": "TAKEOUT: I'm sick. My go-to remedy to \"expel the demons\" is the tom yum soup. I called for a pickup order: two tom yum soups, pineapple chicken fried rice and tofu green curry ($27). The soup was spot on and a two bowl serving on the one order! It was delicious, spicy, sour with fresh mushrooms and three pieces of shrimp. After that, I knew it would be a great indicator of the other dishes I ordered. The green curry was not watered down, spicy, plenty of veggies and nice big pieces of tofu. Delicious! As far as the fried rice, it wasn't oily, so that's a bonus, just wish they didn't put as much soy sauce and/or bumped up the fish sauce, there was plenty of chicken and pineapple to satisfy. I still have more than half of my order to last me while I nurse myself back to health. I was skeptical about this place, but I'm glad I finally tried it!", "author": "Joyce M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-22", "description": "I know a guy, who's having all of his first dates there (this place is so cheap haha).\nBut seriously - it isn't expensive at all and you're leaving stuffed. Ate at some other Thai restaurants (in Queens and Manhattan), and the National is definitely better.\nIf you like it spicy, get the chicken noodle and add red pepper's sauce. It rocks!\nYup, 5 stars just for their chicken noodle!", "author": "Michael W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-04-12", "description": "Very disappointed. When I ordered food from National the chicken fried rice was overcooked (too soft) and I tasted egg shells. The spicy noodles had a burnt taste to them, most likely from the bottom of the pan (the pans are stacked on top of one another before they start cooking) which ruined the taste. Won't be returning. You would be better off going to Lantern in downtown Brooklyn or Thai restaurants in Manhattan.", "author": "Lauren W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-07", "description": "I found this place through Yelp. My original mission was to take my hg to Juniors (she never had their cheesecake!) but then I thought let's get something to eat first before we indulge. I really enjoyed their curry puff, which is why it's really rated at a 4. That's the first time I've had curry puffs that were such a generous size and the filling wasn't minced. You got nice sized diced potatoes and chicken...we got two orders and split them between the 3 of us (2 to an order). \n\n2 of us had pad Thai and my other friend had the massaman curry. She loved her curry dish...I can't mess with that coconut milk. My pad Thai wasn't terrible BUT I felt it could have more of a peanutty taste. Portion size was huge I felt there was a bit of overkill on the bean sprouts though. \n\nEverything was priced well and if I were in the area I may stop by again. I just don't think I'd crave it to the point I feel I have to drive from Queens...remember my original mission was Juniors Strawberry Cheesecake! \n\nMy sister said she's been to Joya and loved it, I figured out they were owned by the same ppl when one of the hand written specials menu had \"Joya\" written across the top.  :/\n\nOverall a solid Thai spot. CASH ONLY.", "author": "B G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-03", "description": "Haven't been here in a while, so my review is based on my experience from three years ago up until the beginning of this year. I've tried so many pad see ew(yew?) in different Thai restaurants, literally across the country. This is on my top ten, if not five. Their menu is cheap, and their calamari is so yummy. Oh, and their ambiance is great!", "author": "Jd P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-06", "description": "I did indeed return and the National was quite good--almost 5 stars worthy (granted I was starving and it was a freezing snowy night so I was primed to enjoy warm food).  Unfortunately they are cash-only so no 5th star but still a good spot.", "author": "Maeve M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-02", "description": "Re-naming this place to \"National Treasure\". They could easily triple their prices and still have a packed house. The peanut masaman would be in the top 5 \"Meals I could eat daily\". Cheap beer, too. Just go.", "author": "Jared B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-08-11", "description": "This place used to be good when it grand open. I've been to this place many times. The food quality and service are going downhill. The appetizers are limited with lunch combo. They used to have more choice.  Now only soup, salad or spring roll. Their Pad Thai is so sour and spicy noodle is salty.  Service isn't friendly.  One time we have party of 10 and they couldn't give us a big table and separate us into two small table. They don't take reservation. The worst is they only accept cash.  It's very inconvenient.  I'll never go back.", "author": "Vienna C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-07", "description": "Really decent for the inexpensive price. We had two basics: chicken pad thai and some curry with beef, and both were delicious. Fast service, too.", "author": "Petunia S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-25", "description": "Wow, this place is hard to find. There is no sign anywhere, and so I must have walked right past it three times, staring confusingly at the little blue dot on my iPhone each time.\n\nInvest in a sign, National!\n\nAt any rate, if you can actually find the restaurant, then you'll find a charming neighborhood Thai restaurant that is quite trendy with an open kitchen, serving inexpensive Thai food.\n\nThe lunch specials run at $8.95 each and includes a salad and a main course. The food isn't anything out of the ordinary for a Thai place, so for a quick and convenient lunch, this restaurant sure delivered.", "author": "David Z."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-20", "description": "I loved the food here.  Now my noodle place in Brooklyn. The mango salad was excellent as others have suggested.  The Tiger shrimp rolls were very good.  I hesitated when the waitress recommend them as they were fried, but they were light and crispy, which hit the spot. I choose a noodle dish as well as my 2 companions and I found my self eating off everyone's plate (yeah, I am that girl) as well as my own.  Everything was really good. The waitress was very nice. \n\nI was seated without my entire being there although they arrived 5 mins after ( I think I looked hungry).  The only drawback is this place was very noisy. \n\nThe price was cheap (at least I thought). You judge -  3 appetizers, 3 entrees, 1 soda, 1 water, 1 wine $68 before tip.\n\nI will be going again... it's my noodle place.", "author": "Gigi B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-07-28", "description": "I'm reviewing National because it's where my wife and I went the day I got my iPhone, and we found it through the Yelp app, and, well, I'm sentimental that way.\n\nFirst of all, I understand why people have a hard time finding this place, given the lack of signage.  That said, there is a menu that says NATIONAL in the middle of the glass front door.  So yeah.  If you look, you'll see it. \n\nI had the Pad Thai with chicken because, well, that's like the litmus test for any Thai place.  You mess up the signature dish, there's probably not much else to recommend you.\n\nNational did not mess up the signature dish.  It wasn't too dry, too soft, or drowned in sauce.  This Pad Thai was cooked to the right temperature and consistency.  Nor did they mess up my wife's dish, the Pla Muk Kraprow, squid and veggies in a chili basil sauce.  Nor did they mess up the beer (Chang).  Though that's kinda hard to mess up.\n\nThe atmosphere is dark and moody, much like their sister restaurant Joya in the Slope.  We didn't splurge on apps or dessert, but I think we got a good sense of the place.  \n\nFor a quick, cheap, decent meal before or after your show/movie at BAM, National more than fits the bill.", "author": "Eric W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-14", "description": "Easily the best new age Thai spot in Brooklyn. Dishes are piping hot, portions can easily last you two meals, veggies kiss your soul with their freshness, and space is not cramped. Not the biggest fan of the service on my last visit... That's actually the only reason I'm not giving it 5 stars.\n\nTry the shrimp spring roll, it's a great starter :)", "author": "Andrew C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-11-20", "description": "I've been here several times in the past for take out never had an issue. Today is a different story- still cash only blah- server is rude and slow (blond hair Asian male) salmon took over thirty minutes to reach the table no update from server as others who came after received main dishes before I did -food finally arrived then server became more attentive I guess he remembered he needed to work for the tip. Good good bad service cash only equals one star on my book.", "author": "David M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-14", "description": "Great value. Delicious food. A good go-to joint in the neighborhood. I've only ever been at dinner time...it gets and stays pretty packed...but it's totally worth it. I've had the red curry...even if its the least spicy curry, it's spicy so know it now and they are great about toning it down or kicking it up so don't be afraid to ask. The Pad See Ew is absolutely one of my faves!", "author": "Karin R."}], "servesCuisine": "Thai", "priceRange": "$11-30", "name": "National", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "723 Fulton St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/i2Va7tG05YlCvRCJ0x_kBQ/ls.jpg", "@type": "Restaurant", "telephone": "+17185223510"}