{"aggregateRating": {"reviewCount": 396, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-08-04", "description": "This place seems to get by on foot traffic, being relatively inexpensive, and most of all, the real lack of other options for Thai in the neighborhood. I've been stupid enough to keep trying this place. I'm done. Anything with noodles is always a congealed, greasy mess. Little flavor in anything, and only the dishes with \"spicy\" in their names have anything resembling heat. It's more like average Chinese takeout than anything, and it's an insult to what Thai cooking should be. Depressing to toss half of it back in the bag after being repulsed by the grease and the general feeling that they don't care at all, they're just churning out this garbage because we idiots apparently don't know the difference and continue to pay for it. Too bad, could really use some good Thai around here. This most certainly is not it.", "author": "Paul R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-05-04", "description": "FAST food Thai. They are way more concerned about cooking the food fast than the taste. Everything I have ordered has come out overly sweet, soaked in oil and always slightly singed. Because it is so convenient and cheep I have given it multiple tries. I officially throw in the towel. I get why people go here but the food just isn't good. Sorry because the staff is really nice.", "author": "Rebecca G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-31", "description": "For what it is, a cheap Thai place, it is perfect. It's better than the grossly overpriced Thai places I've been to in Manhattan, where you are basically eating the same exact thing for twice the price and no flavor. It's a great local weekday place to stop in after work and have a quick, satisfying meal without breaking the bank.", "author": "Cheyenne M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2010-12-22", "description": "OK...So this is my third time eating there and it unfortunately seems to be getting worse not better. I've ordered the vegetable rolls, which are overtly and inexplicably greasy. I just ordered the pad thai which was bland, tasteless and dry...I would take it back if I weren't so busy. Worse Thai food I've ever eaten! I'd much rather schlep to Thai 101 on Myrtle and Washington that has a great lunch special, and tasty fare. Looking forward to a new, good, Thai restaurant coming to Fort Greene. Double yuk!", "author": "Kecia E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-02", "description": "Ok so I have been going to Joya in cobble hill and was happy when I saw national open its just closer. For me.so I enjoy their food I usually get the spicy noodles with shrimp and calamarie and my favorite tai tea.but I have had 2 bad experiences. In the restaurants the first at Joya on court st I got bad service wasn't me alone and the food came up less than 40 bucks so I gave$5 TIP the manager then proceeded to scream at me that I don't give tip and I always do this I frequent there more than once a week and that was the first time I saw him I dong play with tips cause its my food and I go there a lot and I know waiting tables is hard and I'm like dude u don't know me and not all black people look the same.I was woo upset I didn't go back for months then national open but a few days back my friend and I went and the service was poor they brought out burn food for us I'm like do they think black people don't have taste buds so they brought out fresh ones and then he brought out peanut sauce and he didn't clean off the container I like their food most times but their service sucks a lot of times", "author": "Kerdija H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-04-01", "description": "This place has amazing food and great prices.  A little small but they serve you fast and have a quick turn around on tables.  At the same time, they don't rush you out the door but if you're like me, you feel bad for the people who are waiting.  Well worth the wait - love this place  :)", "author": "Regina B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-05-18", "description": "slimy sauce, 'funny' tasting seafood, and terrible service! when you order a dish and something \"is not right\" about the way it tastes and you express that to a waitress politely - i mean really politely, i can count on one hand how many times in my life i have ever done such a thing -  there are certain things that should happen. it is basic restaurant etiquette. they should apologize. they should offer to take it off the tab. they should NOT just take the plate and leave the table and then proceed to charge you for said plate of food. INSANITY. \ni had ordered and liked another dish there, but i will not return because of the poor service and lack of basic civility to the patrons. i don't recommend it and they shouldn't be able to treat people like that.", "author": "L M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-01-06", "description": "National, I hope you are reading this because as of right now, I'm not feeling you and its making me very upset. Joya and Song are the best Thai restaurants in Brooklyn. When I lived in Carroll Gardens, I would order take-out from somewhere else but make a pit stop at Joya just for the irresistible Tiger Shrimp Rolls. I've rented a zip car just to trek over to Song for a Sunday hangover spicy curry cure. So when I spotted those recognizable blue lights late one night in my own neighborhood, I almost jumped out the taxi window in my excitement. \nI've now both ordered delivery and eaten in National and I am less than impressed. The food is not up to par, beef and basil was boring, green curry not as complex. And somethings just not right about those shrimp rolls. Tragedy. \nAs for the ambiance, when I took a friend to eat in the restaurant, we froze every time a customer walked in the front door - National, get one of those little vinyl vestibules stat! The people sitting next to us actually got up and walked out - its kind of difficult to use chopsticks when you've got your bubble goose on. And the service was totally inattentive. Considering there's a cinema/music hall/theater across the street, they're going to have to learn to spot the \"I've got a show to catch in 10 minutes\" look. Well, the waiters would have to actually *look* in your direction to catch that expression. I finally had to walk over to the kitchen to pay my bill. I mentioned to the cashier that the waiters need to be more attentive and she took it well so I am hoping they will take people's constructive criticism and work through these growing pains. \nNational, I judge you harshly because I know you can do better and I expect more from you. So please, step it up. We're all counting on you.", "author": "J R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-10-29", "description": "I went to this place with my friend today and  It was my first time eating Thai food. I was very much impressed. The atmosphere was mellow, food was flavorful, and prices were exceptionally reasonable. Very nice, + the waiter was super cute. But that's besides the point, I had a wonderful experience and hope to frequent this place in the future.", "author": "Iman M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-08-27", "description": "average thai food at best. staff aren't terribly friendly", "author": "Irene B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-11-10", "description": "Food is a 4 star, service is a 5. The decor is amazing and staff is on point. Love National for lunch and dinner!", "author": "lika l."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-09-13", "description": "Okay, I've been there a few times. And sometimes the food is pretty tasty, and last couple times it's been very bland. I DID get it to go last time, and I live around the corner, so it couldn't have been sitting that long. And I had to doctor my noodles up quite a bit. But I've given this two stars for one simple reason. They say they close at 11 pm. I called and called to place a to go order, and no one answered. I walked around the corner (God forbid I leave my apartment) and I arrived at 10:39 PM and they said they were closed (though their website says 11PM) I have worked in restaurants my whole life, and still do. And I did notice the waiter had JUST dropped off a giant plate of noodles to a girl, who hadn't yet dug her chopsticks into them yet. So I couldn't have gotten there THAT late. And, there were at least 12 people dining in the restaurant. Honestly, I get it if were January and a snowstorm and no one had walked in. But it's a Tuesday night in September and it's 76 degrees out side. I'll just wait for another thai restaurant to open up in the hood, won't be long.", "author": "Bretton S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-05-31", "description": "This has to be the stupidest restaurant in NYC.  I think mediocre Thai Food is pretty good, so I'm not that particular.  But the food is truly, truly awful.  Heaping masses of bland, undercooked celery.  If they just made the food ok, it would be a welcome addition to this side of Fort Greene.  Seriously, if you like music and skinny Asian boys wearing silly baseball caps and snorg tees and you don't care at all about what food tastes like, then you will find this restaurant acceptable.  Otherwise, go to one of the many mediocre Thai joints on Myrtle.", "author": "Leo G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-05-08", "description": "The absolute worst service EVER! My friends and I were finished dining (w/ one person ordering the most expensive thing on the menu) we were going to enjoy some after dinner drinks,  when we were asked to leave for incoming customers. We were all rather stunned (and said so to the very metrosexually dressed host), left, then went on to have drinks elsewhere. The food is pretty decent, customer service on the other hand is HOT GARBAGE.", "author": "Liz L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-02-20", "description": "just had the worst pad thai I have ever had in my life. washed out. over cooked tasted of vinegar and ketchup.  the soup smelled of a dumpster.\n\nthis was delivery. it cost us $25 and we threw the whole thing out. In all my years I have never done that with a delivery order.  \n\nThe only reason I didn't give it one star is because we had 'OK'  fried rice there the other day, they were busy and are new. \n\n- side note, the door does not close properly - if you eat here on a cold day, try to sit as far from the door as possible.", "author": "brooklyn b."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-01-28", "description": "I love Joya and also the few times I\"ve been to Song had a similarly good experience. Unfortunately in the several times I've had National, it's not quite up to the standards of the predecessors. It's the same menu, but somehow it's just not cooked as well - the mango salad (my favorite) has been watery with white flavorless mango and the roast chicken super dry. I keep trying because the food is cheap, hoping that it will turn around and be as good as the others because we desperately need some good cheap thai in the 'hood.", "author": "AUTUMN s."}], "servesCuisine": "Thai", "priceRange": "$11-30", "name": "National", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "723 Fulton St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/i2Va7tG05YlCvRCJ0x_kBQ/ls.jpg", "@type": "Restaurant", "telephone": "+17185223510"}