{"aggregateRating": {"reviewCount": 396, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-10-22", "description": "Only came here for happy hour.\nThe food smelt really good and the bartender was very friendly but as for the drinks, I'll pass!\nI ordered a margarita and it taste like straight lime juice (which was ok at first since I like limeade). The more I drank the stronger the lime taste got. I strongly believe that it's a sin to waste liquor but in this case whats a girl to do? I convinced myself that it was limeade so I wouldn't feel so bad wasting it and said a few Hail Mary's when I got home. All is forgiven! \n\nOverall: I want to come back just to try the food but some of the food reviews are deterring me. Not sure if I'll patronize this restaurant again.", "author": "Chantel H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-10", "description": "I've been here a couple of times over the years and it's always solid Thai food. Big portions with a lot of flavor. Last night I went with a friend and we each got tom ka gai soup to start. It came in medium sized bowls with lots of mushrooms and chicken. We also had veggie spring rolls to share. She got the pad thai and I got the massaman curry. The spring rolls were good with lots of clear noodles inside. Unfortunately, I was full by the time I started eating my curry, but it was delicious! Lots of yummy chicken and potatoes, and a big portion! I'm looking forward to lunch today!\n\nThe restaurant is small, with a lot of seating and a bit loud, but service was great and efficient. It's also super affordable! I think the most expensive entree was $9.50!", "author": "Elizabeth C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-04", "description": "National is one of the only restaurants that give you nice food at a decent price and with large portions. Their Thai ice tea tastes amazing for only 3$. I recommend the pad see yue. Overall it is worth the money you spend!", "author": "Mona L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-10-04", "description": "Zero stars. Chicken was uncooked. And when I told the waitress she argued saying \"it's impossible\". I had to beg for the food to be taken backs and recooked. When she brought it back she gave me attitude and threw the plate in front of me and said \"enjoy\". Made me feel she spat in it. It's also heavily sugared and salted. Avoid this place!", "author": "Shenaz T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-16", "description": "Overall experience was good. Ordered chili mussels because it was something I hadn't had before instead of calamari; liked it a lot. The vibe at this restaurant is romantic and intimate. Was upset because I was not able to charge my phone at the restaurant.", "author": "Ahanaf T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-21", "description": "My son goes to school nearby and has been telling me about Nationals for the past couple of years.  I am out to NY visiting him this weekend and we went for dinner my first night in Brooklyn.  What an amazing place!  The atmosphere was great - dim but very lively with a really cool vibe.  The food was amazing!   Best Thai food I have ever had, and that includes Southern California.", "author": "Steven R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-03-26", "description": "Delivery Only ---\n\nMy co-workers started ordering Thai food from this restaurant, so I decided to give it a shot on Friday. There were so many menu items to choose from that I didn't know what to choose. My co-worker told me to try the Pad Thai and so I did.\n\nThe restaurant had  limited choices in Pad Thai. They only had chicken, mixed vegetables, and shrimp. I decided to order the mixed vegetables Pad Thai. In addition, I ordered the Thai Iced Tea.  The order arrived within 20-25 minutes.\n\nThe Pad Thai was below standards, it wasn't tasty at all. The noodles weren't even cooked to the typical color of Pad Thai. Pad Thai is suppose to be a golden brown color, but this Pad Thai was whitish. The vegetables weren't that great either. The broccolli was an ugly green and it just wasn't appetizing at all.\n\nThe Thai Iced Tea tasted great and came in a medium size cup for $2.00, not bad.\n\nI don't think I will come to National to experience the restaurant and I'm not even sure if I want to order from here anymore, knowing the quality isn't great.", "author": "Jessica D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-08-10", "description": "By far, the rudest service I've ever experienced.  The waitress dropped the check without asking if we needed anything else.  We sat and had an enjoyable conversation while we finished our wine.  The waitress came over and demanded we pay the bill and left without letting us respond.  When she came back I asked if they were changing shifts.  She said no the bar needed us to pay.  I politely said it would have been helpful to know that and she got argumentative and then stormed back to the bar loudly complaining about us.  I was a waitress for a long time.  I consistently tip above 20%.  This is the first time I have left a crappy tip, but I will not be treated so rudely and pay for it.  I was going to give her the benefit of the doubt, everyone has a bad day, but then I read reviews of similar experiences.  Truly bad business behavior, especially considering the neighborhood competition.  There is much better Thai to be had from much kinder people.", "author": "Tamara S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-10-29", "description": "Bland. You could do about the same with frozen supermarket Thai. I've eaten here thrice, so it isn't an issue of a bad day. \n\nSadly, Thai food in New York is bad. Nothing like California. This might only get one star there.", "author": "Vas S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-19", "description": "I love this place. I've been here a few times now and I've never been disappointed. I would definitely recommend going during lunch hours, the lunch specials are good quantity/quality and cheap! 10/10!!\n\nCash only btw", "author": "Mouzam F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-11", "description": "Thai is my go to option before a big drinking affair. Fills you up but never leaves you feeling too full. \n\nNational isn't new but it is the newest of Thai restaurants from the owner of Song and Joya. National once again is identical in many ways. Great food, atmosphere, service and price. \n\nIf you come here on a Saturday night, they got the music pumping a bit loud and will be hard to hear anyone you are eating with. Come here at other times and they'll be playing some good tunes at a lower decibel level. \n\nWhat's different between this Song or Joya, just the location really. If you're chilling out in Fort Greene for the day and want some Thai, you are in luck. Swing through and enjoy awesome inexpensive grub.", "author": "Mitch E."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-05-03", "description": "It's rare that I write a bad review, as I'm pretty easy to please. HOWEVER, the service here was horrific. Half of the staff was visibly on their phone and when we waved someone down to ask to put in an order for soup, he patronizingly told us that he wasn't our server and then pointed to our server so we could try and get his attention. He then went to stand at the counter and continued to not do anything. \n\nOur food came out fast. The spicy noodles weren't anything to write home about. They weren't spicy at all, but it was ok. \n\nWe had to go through hell to get someone's attention again. The staff was clearly ignoring us. I saw the same dude that was standing at the corner glance at our table and quickly glance away when we tried I get his attention. We just wanted more water! \n\nOur server comes back, we ask for more water and I see him go to one of he girls (one of the girls on her phone during their rush) at the counter, and she immediately looks at our table and rolls her eyes making it clear that he was talking about us. \n\nAt the end of the meal, I advise him to talk sh-t about the customers where they can't see him and to tell his fellow coworker that I saw her roll her eyes at our table. We were NOT high maintenance. Attending to what we need if your effing job! \n\nAfter I called him out, he still didn't offer an apology or a discount or free dessert or anything of the sort. I will not be back here. There are so many other great (not that their food was great by any means) Thai restaurants in the city. Take your money elsewhere.", "author": "Jaymye T."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-03-01", "description": "My wife and I had dinner here last night with another couple before seeing a show at BAM. The food was excellent but our waitress was so clueless and seemingly disinterested in us that I had to write this review. We had hardly sat down when she came over to ask if we were ready to order - we were not but we did order beverages, two wines and a soda. We also asked a question about one of the apps. She continued to stand at our table waiting for a food order until my wife told her we needed more time to decide on our food. \n\nThe two wines were delivered along with, surprisingly, the app we had only asked a question about, not actually ordered. Since we had decided by then to order said app we didn't say anything but did remind her about the soda.\n\nWhen she came back with the soda we ordered the rest of our meal.\n\nWhen the entrees arrived the multiple members of the waitstaff seemed completely confused about what we had ordered, never mind who had ordered what. Only two of the four dishes they brought were correct and we stated so. They then came back with three more entrees, only one of which we had ordered, but given that we had a show to get too we just accepted a second entree.\n\nWe also ordered another glass of wine. However, that order took forever to be fulfilled. I had wanted to order a second glass of wine myself but the delay in the entrees and the first wine reorder made me skip the second glass.\n\nAs stated originally, the food was excellent but the waitress - a petite female who was either Asian or Hispanic - was awful. If you go here and get that waitress than either leave or ask for another server, although hopefully by the time you read this she has already been fired.", "author": "Rich M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-12-23", "description": "So I have been going to National for years and I have never been treated in such a manner like today. \n\nMy friend met me at the restaurant and got our table. I came in 5 minutes later. \n\nThe waiter came by and took our order for an appetizer. After we ate our appetizer, our waiter came back to take our order- a \"white\" man came up to us and told my friend and I that because we have been there for 2 hours he would not serve us because he needed the table. \n\nWe were so confused and dumbfounded. \n\nMy friend explained that we had not been there for 2 hours (actually 20 minutes). He (the white man) then said \"hunnie you have been here since I have been here at 12 pm- and she (looking at me) came in because you were waiting for her. I need this table because i have a party of 12 coming and we need this space.\" \n\nHe then looked at the waiter and said \"I need this table they need to move now!\"\n\n The waitress was mortified , my friend and  I were appalled. The waitress said that we could have another table. My friend asked \"who are you?!?\" He then stated \"I am one of the owners!\" I kindly excused myself and left. My friend was polite enough to pay. \n\nI have never been treated in such a way. We are regulars at this restaurant and apparently the \"regular\" crew was not present. I will definitely NOT be going back there- and all my friends that live and work in that area will NOT be patronizing a racist establishment where ALL African Americans look the same. \n\nApparently we looked just like the two Black women that were sitting and eating beside us. They had just left about 10 minutes after we got our appetizer. \n\nIt's okay- they just want get my coins....and the food was horrible today.   Such negativity going into the food is NEVER a good thing....Good night good folk. Eat well Live Long", "author": "Kenesia W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-28", "description": "mm wow! \ngreat vibe!\nyummy green curry!\nyummy curry puffs!\n\ni came here with my friend on the first night of what i am sure will be a VERY SUCCESSFUL BIRTHDAY WEEK. \nhad heard whispers that this was \"the best thai place in the area\"\nand you know what?\nmaybe it is?!?!!\n\nwill go again!", "author": "Jaime W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-12-22", "description": "Horrible service - food was decent also sanitary letter grade has been pending for more than a year.\n\nWent to dinner here last night and was immediately rushed to order by my waiter. As I looked around I noticed a lot of the dishes in the kitchen where they cooked food were on the floor - with food in them they were serving from as well as no \"employees must wash there hands \" sign  in the bathroom - LOCATED DIRECTLY IN THE KITCHEN !! We ordered and received Luke warm food. I asked the waiter for a An additional drink and the check. He brings the check and a pen I sign and tip him 20%. 5 minutes later he brings me another check for a coke which wasn't included in the original check. He made sure to do this after I signed the original check and tipped him. Annoyed - I hand him my card for him to close out this additional tab - he says we have a 10$ minimum on cards! \n\nLong story short I went to an ATM next door payed the ATM fee to get cash to pay for a measly 2$ a watered down coke that came from a fountain. I complained to the manager about this whole incident only to have the waiter come over and interject and tell me it is my fault.\n\nAwesome service guys - never coming back here again for the service or the ominous \"letter grade pending\" sign that seems to have been a staple of this restaurant for 1.5 years", "author": "Adrian S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-22", "description": "They finally got a full bar. The food is pretty good Thai food. I enjoy the pad Thai and the dragon wings. I've also have the Thai fried rice and it's tasty. The service is standard. I prefer the order delivery. The restaurant can be a little too loud for a date night.", "author": "Revee J."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-09-18", "description": "Decent Thai near BAM, good for before or after theater. The prices are reasonable and the food is good (excellent spicy noodles with salmon special, for instance). The night we went, however, the service was pretty slow and inattentive. Also, at the moment it's cash only, though they promise to begin accepting credit cards soon.", "author": "Massimo P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-24", "description": "So, I'm really picky about giving five stars, but I couldn't find anything to fault about this place. I came with two friends, and everyone ate and ate. The portion sizes are indeed huge. Pad see ew, delish, tom yum soup well balanced, and I got a vegetarian dish that made me not miss meat one bit. Thai iced tea is also really good. They now accept card, and it very much has the same vibe as Song. It has no name on the door/front, so you can feel especially cool bringing friends here.", "author": "Lauren R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-09-15", "description": "Very poor customer service.... good food but the attitude of the staff makes me never wanting to come back!!!!! They deserve a negative star.", "author": "Xion K."}], "servesCuisine": "Thai", "priceRange": "$11-30", "name": "National", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "723 Fulton St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/i2Va7tG05YlCvRCJ0x_kBQ/ls.jpg", "@type": "Restaurant", "telephone": "+17185223510"}