{"aggregateRating": {"reviewCount": 396, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-13", "description": "Came here on a Tuesday afternoon.\n\nLunch specials were written on a piece of paper which made it hard to understand. The prices were fairly decent for the portion sizes you get. \n\nThe food was good and tasty. We ordered the pork green curry, the pork fried rice, the chicken rolls and all of that was really good. \n\nThe service, was a bit bland. No interaction, no walkthrough of the menu, etc. \n\nCome here for the food and not the service.", "author": "Moses C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-01", "description": "Sister chain of Joya. \n\nFood is pretty decent for Thai food in Brooklyn. Probably the closest to real Thai food. This place is cash only. It's also pretty easy to miss as the restaurants name is not even on the restaurant!", "author": "Diana T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-27", "description": "This is likely my new favorite Thai spot. My second time here was nothing short of a great experience. Before we could even be seated, we were being served waters/menus. Our food came out fairly quickly  after we ordered + it was piping hot as I like it. The ambiance is really nice, the restaurant/bathroom is clean which is huge for me. I'm pretty sure I'm biased as a tall person but I really like the high sink as well. The service is very welcoming + prompt, the prices are very reasonable + the food is amazing. Would definitely recommend.", "author": "Jei M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-12-22", "description": "Disappointing. I LOVE Thai food. So much so, that I can eat it multiple times a week. I just started working in Fort Greene, so of course I had to come to National for lunch. Their lunch special is enticing and cheap, but the quality of the food leaves a lot to be desired. I had a summer roll, which was just ok, and chicken pad see ew. It was slimy, sweet, and the chicken had a texture I didn't care for.\n\nThe staff doesn't seem to care, and I had to stand up and find someone to get me the check. In reference to all the cash only reviews, they took my credit card, no problem, so maybe that's changed.\n\nI won't be back.", "author": "Meridith G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-02-13", "description": "The reason why I came back to the place it is because of the good food they offer...until the time when staff screamed at something and knowing that \"that something\" is a big RODENT- close to the size of a kitten - coming from the kitchen, going to the bar and down to their storage. Personally, I didn't know how to react. Even the staff didn't have the courtesy to say anything to me as a customer - it was just awkward. I will never return to this place. I'm not even sure what other risks it may pose to the public but HD should revisit and reassess VERMIN CONTROL; how they handle food, sanitize and clean the restaurant. Don't let the ambience deceive your judgement. Unequivocally detestable!!!", "author": "Eggie E."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-10-12", "description": "Written menus hard to understand.\nOrdered chicken fried rice and it looks barely cooked mushy rice and raw chicken. $10.83 for mush .unacceptable unfriendly hostess", "author": "Andrea J."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-16", "description": "For years, this place has felt pretentious and the service has been decidedly rude. Neither me nor my friends felt welcome here. As others wrote, tables are jammed too tightly into the space. \n\nReviewer \"Treatmelike A\" left out of his review that he threw his plate of food onto floor, smashing it and splashing food all over neighboring patrons, causing a crazy hostile scene. He won't return becuase the restaurant would never have him back.", "author": "High Standard S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-20", "description": "Cozy, tasteful, friendly, inexpensive, so many people. One of my favorite place in brooklyn. It should be bigger space so that more people can taste dishes. :)", "author": "C R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-14", "description": "As soon as I stepped foot into this restaurant, I knew that the food was going to be good. It just smelled so legit and of course I was right :D The shrimp and mango summer rolls was an excellent choice because it was very refreshing and tasty. As an avid spicy food eater (who had been deprived of hot sauce that day), I just had to order the beef pad thai extra extra spicy. The pad thai was everything it needed to be: flavorful, delicious, satisfying, and a good size. However, it was not as spicy as I expected. Then, the waitress brought me a spice rack that essentially changed my dining experience there. On the rack, there were 4 different types of peppers, one that was clearly housemade and it was PERFECT. I loved that they offer the spice rack as an option for people to customize their dish according to their tolerance. My boyfriend ordered the spicy noodle and he enjoyed it as well. The restaurant has outdoor seating, but we dined inside that day because it was raining. Amazing food and good service, so I'll definitely be visiting again!", "author": "Gina P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-02-15", "description": "This critique is solely on the Pad Thai. I'm just throwing this food out.  I order Pad Thai to go. It's a big bowl of pasta with absolutely no taste. It has no color and no taste. I said please make it spicy... barely any spicy. I thought that was a simple request. Now to the salad. Worst peanut sauce ever. Tofu was soggy. Just a lot of food but horrible taste.", "author": "Lizbeth V."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-09-09", "description": "My husband and I were strolling pass this restaurant and it smelled delicious. We ordered the summer rolls from the handwritten specials menu. Unfortunately it was the first Thai restaurant that I have ever been to that somehow messed up this simple dish. For dinner we had the Pan-gang curry and a spicy fried chicken salad. Curry was delicious but the ensemble of the salad was confusing and left much to be desired. The vibe inside was great and it was a great night, nice drinks. Likely won't visit again, but they did have great prices.", "author": "Kimberly E."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-10-14", "description": "Please be mindful of this establishment ! Very shocked and disappointed! \nBiggest issue and major concern is they are committing fraud with acceptance of card payments... on 2 separate occasions the food was paid for by card ..On the first visit a tip was left via the credit card and they changed the tip amount to a higher amount and submitted to the bank..on the second visit my niece and I split the bill via credit card and we left a generous cash tip and they inserted tip amounts on both cards after the fact and submitted to the bank !!!\nThis is illegal folks !!! Have already disputed with the bank and reported this business !\nAs for the food it isn't that good..and the service is less than stellar.. server rushes you to order and is very unfriendly and doesn't check on you to see if anything else is needed...I have eaten there several times in the past and paid cash.", "author": "Malika B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-01", "description": "Really good Thai restaurant! The prices are very low (10-12 dollars per dish) and the dishes are big and delicious! I loved the pad thai. The place is small and nice, with tables in the sidewalk too. They have the option to take away.", "author": "Julia S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-08", "description": "I've never actually dine in here, just did take out. The first time I came I had the spicy shrimp pad see eww. The taste wasn't bad, but for some reason it felt kind've heavy on the tongue and left a weird after taste. The second time I came I ordered the chicken pad Thai, which was really good. The food here isn't expensive and you get a lot, i wasn't able to finish both dishes. I'll come back since it's near my job, but isn't my first choice when I'm having a Thai food craving.", "author": "Sherika G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-12", "description": "Food is delicious. Chic design. Very affordable.\nThis restaurant is identical to JOYA which is a Thai restaurant on court street in Brooklyn. Same menu. Same decor. Same taste. Love it", "author": "Leslie W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-15", "description": "Great great place. We were looking for a Thai place to eat at and we found this nice place. The location is nice and cosy. Welcoming staff. The food was very good, tasty. I am glad I discovered this place. Would definitely recommend and go again to enjoy the delightful cuisine.", "author": "Ale S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-01-10", "description": "WOW! This used to be my FAVORITE place. We would go every Friday night for dinner and sometimes Wednesday nights as well, for about 18 months. I've never had a problem there and if we had any specifications on food, the waiters would normally do it and it would be delicious. We always generously tipped and left happy. Up until recently we met such a RUDE man, come to find out it's the \"Owner\", when he waited on us and was extremely bothered by our specifications. He was snippy, sarcastic, RUDE, and didn't fail to mention he's been the owner for 18 years. I was shocked. I never saw him before and his energy was so negative. We pay MONEY to go there frequently and he is willing to shake up a customer when he's never even THERE! We are part of the reason he makes his money. We always send people there and bring people! I continued to say that we ALWAYS come here and there's never an issue, for Christ sake, ALL THE STAFF knows us! He made a fuss about it but did do it. Now the second time we come in and see him Again I smiled at him and he did NOT smile. He seemed displeased that we were there. There was a table of 4 seats with a couple of 2 waiting in front of us. The couple asked if they can sit At the table of 4, (white couple) knowing we were waiting also, and there were no other tables available. Usually when there's 2 at a table of 4, the bus boys quickly ask them if they can use the table (as they've even done it to us before) for more guests coming is as it gets crowded. Completely understandable. There were a few tables available like that. The owner saw us and said to me ok there's some tables for 2. He walked away and didn't notify the bus boy to arrange the table. We waited and studied him for a few minutes. He acted like we weren't even THERE! And the white couple was happy to take over the table, also rude, as if we weren't there. The bus boys ignored us when they normally greet us. My friend went to ask the owner after a few min waiting if he is going to seat us. He started yelling at her saying he told me a few minutes. WOW! He didn't even tell me a few minutes, he mumbled and said there's some tables around and went back and didn't inform anyone to move anything. She just wanted to know the update, it was a simple question! We stood there - so humiliating. I felt like Rosa Parks. My friend hates to be mistreated and it's so sad that a man of that calibur runs the place. Such an unfortunate situation, I do not recommend as their service SUCKS!", "author": "Amanda Aurelia L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-05", "description": "Wish I could give negative stars!!! Worst Vegetable Pad Thai I ever had!! I found a dead fly in it!!! Never going here again!! Disgusting!!!", "author": "Uttam G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-08", "description": "I had the shrimp Pad Thai, my first time having it and probably my last. It was warm and interesting. Everything else here was just okay. I also had the the spring rolls as an appetizer, crunchy and flavorful.  It's a spacious restaurant, the wait staff was attentive other than that I would suggest you try it for yourself.", "author": "Shari J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-16", "description": "Wow! I came here with a group of friends for a hangout. This was my first time here, and I was pleasantly surprised. The ambience is great, felt very pleasant. The food was on another level! The portion sizes are decently big. The appetizers are great to share amongst a table. Personally I had to go with the vegetable pad Thai and wow it was absolutely amazing. Definitely would recommend it to anyone wanting some good Thai food in the area", "author": "Alex T."}], "servesCuisine": "Thai", "priceRange": "$11-30", "name": "National", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "723 Fulton St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/i2Va7tG05YlCvRCJ0x_kBQ/ls.jpg", "@type": "Restaurant", "telephone": "+17185223510"}