{"aggregateRating": {"reviewCount": 396, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-06-13", "description": "I've walked by here quite a few times since it originally opened and finally decided to stop in. The atmosphere is very relaxed and bright with lots of sun. I would have sat outdoors but its sort of close to the street. Hot car dirt blowing in my face, yuck.\n\nWe seemed a bit ignored when we first entered the restaurant which didn't seem that busy. The service in general lacked a bit. It wasn't bad but it was just enough to not complain. The server quickly placed the plates down and walked away, no enjoy your meal and didn't mention the drinks they had when asked. It seems snobbish to complain about little things but since most restaurants do this well the glaring difference cannot be ignored. \n\nThe food and prices were great though. We had a pad thai spring roll appetizer, pad thai entree and coconut curry with chicken and broccoli entree. The pad thai was the usual which is fine. I'm not expecting some genius remix, just well done favorites. The coconut curry was very good. Could have been a bit thicker but the light flavor matched it. Perhaps just a bowl vs. flat plate would have helped but the food was very good. \n\nThe prices are very reasonable so you could easily order a lot of small dishes if you cannot decide what to eat without breaking the bank. I will be back when I want Thai in Fort Greene area.", "author": "Michelle S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-25", "description": "I've been here twice and I really loved the food; prices are really good too but the service leaves a lot to be desired.\n4 stars!", "author": "Sergio T."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-06-21", "description": "I will no longer be going to or ordering from National. Sucks cause they're literally around the corner from my apt so it's quick and convenient though not the best thai (just regular) but after my last visit... I brought one of my friends there who had never had thai food. I ordered the salmon fillet with grilled veggies  over pad thai. When it came it had eggplant (which is a veggie that is usually specified in the menu because it's not a common veggie). I explained to the waitress that I am DEATHLY allergic (my throat closes up and I go into shock and may stop breathing and die type of allergic) to eggplant and asked her to please explain this to the chef so that I get one with absolutely no eggplant in it. \n\nShe comes back with my order 5 minutes later. This was not a regular pad thai and included grilled salmon so I highly doubted they could have cooked and plated another one so quickly. My friend thought the same so we called her back and I asked \"is this the same plate I gave you?\" She didn't respond. I re-asked the question and she goes \"oh, but I took off the eggplant\". I was floored and pretty pissed at this point but tried to remain calm because I didn't want to ruin the experience for my friends and other diners so I AGAIN explained to her that I cannot eat anything that eggplant has touched \"When I said deathly allergic I meant my lungs will stop working, ambulances will show up and your restaurant will most likely get sued.\" So she goes  \"oh!\" takes the plate and leaves. Didn't come back to give me options and NEVER APOLOGIZED. Being a good dinner companion, I actually went up to the counter and asked that they just change my order to a super fast shrimp pad thai (they always have some ready) so that my friend wouldn't have to wait for me. We ate, paid (no discount was suggested and I was so over it I didn't care) and left. My friend had his first (albeit hairy) thai experience and commended me for not just walking out after they tried to serve me the same plate. I told him I didn't want to ruin his meal, but trust that NATIONAL will NEVER see me again. Sucks for them because I live in the neighborhood and used to bring people there all the time as well as order for take-out and delivery.\n\nNOTE TO OWNER: When you have restaurants, you cannot take allergies lightly and try to trick your customers because you will harm them. Teach that to your employees and teach them proper customer service. I couldn't dismissed this as a random incident and still frequent your restaurant if 1. she had been apologetic 2. she didn't try to re-serve the same plate 3. she had offered an alternative and discount. If I could give you ZERO stars I would.", "author": "Sha M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-02-11", "description": "There is absolutely NO WARNING on the menus, the front door, or by the server that this is a CASH ONLY establishment. Don't get the spare ribs; unseasoned, par cooked and then deep fried and they come with a light vinaigrette. Very bland.", "author": "Catherine G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-02-05", "description": "National use to be amazing. I received great customer service and delicious food. Normally I will get the shrimp with garlic sauce and vegetables. (It has a different name but that's what the dish consists of.) My friend would get the chicken. Lately as in the last six months, my understanding due to this place becoming  popular, their customer service has taken a turn for the worst. They have attitudes suddenly and they don't care to come check up on you until you place money on the table. The asian server with the blond hair has to be the worst server in history. His service is piss poor however he frowns when he doesn't get a tip. Like its a shock. The manager (woman straight hair) condones this behavior, gets an attitude and never says anything. Don't give a bad tip to the blond server with the horrible service and come back hoping to get a new server. I did that and my gravy tasted like they poured the entire jar of pepper in my food.The chefs are definitely more miss than hit and now the meals are either bland in the dinner time ( as if they are trying to stretch the gravy until the end of the night) or overly spiced. I know the economy is bad now but get a grip. The calamari WAS amazing. They give a really big order for cheap but they changed the sauce flavoring. It's gross now. Please don't be fooled their sister company Joya operates with the same people. Same bland taste. Either risk getting takeout or make your own food. I gave up and it's not worth spending my hard earned money on this place. Learn how to treat people!", "author": "Nina V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-19", "description": "Same \nOwner\nAs Joya\nAnd same design\nBut quieter, fewer seats, smaller crowd.", "author": "Justin L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-08-29", "description": "Food was great but the management is terrible.  Our group of 8 was not allowed to sit outside, when asked why they got defensive. Stupid rules without any explanation is a great way to annoy customers. Also its cash only.", "author": "Richard C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-12-15", "description": "This place is deeply, deeply mediocre.  I live around the corner and, even after the first two profoundly underwhelming experiences here, I held out hope.  But it seems like they are trying to make the food as bland as possible.  The papaya salad appetizer was floating on a small puddle of water, undoubtedly from the iceberg lettuce at the bottom that hadn't been dried.  (Iceberg lettuce in Som Tum in and of itself should throw up huge warning flags.)  The tofu and vegetables was marginally better, but really just a sad effort.  What a bummer, since this is the only Thai spot in the neighborhood.", "author": "Michael H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-08", "description": "I love National.  I've been here several times with my boyfriend.  We usually get the broad noodles and then get another dish to share.  The noodles are definitely my favorite choice here, though I was disappointed to find the spicy basil noodles were not very spicy at all.  They were tasty, but not hot at all.  I remedied that with an array of chili sauces (you have to ask).  I also tried and really enjoyed the fried tofu with a delicious spicy tamarind sauce.  The fried calamari is also tasty, and the \"small\" portion is plentiful!  \n\nI highly recommend National as a local, cheap, tasty food option.  National is good for dates and friends alike, just make sure to bring your own bottle if you want a drink.", "author": "Maria M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-07", "description": "Unbelievable.  Two entrees and an appetizer for $23?  That's unheard of for me.  I started with a mango salad (for $4.95), and it was a very sizable appetizer with fresh mango, lettuce, and peanuts, with a tasty dressing drizzled over it.  It was aesthetically pleasing and a delicious first plate.  Then I had the beef in a red curry coconut broth ($8.95), while my friend had the same dish only with chicken ($7.95).  We could not believe how much food we received for such an inexpensive price, and we were even more pleased with the taste of the dishes.  This is some of the best Thai I've ever had.  I cannot wait to return.\n\nAlso, our server was very kind and the outdoor seating was a nice surprise on a beautiful evening in Brooklyn.", "author": "Kevin S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-05-03", "description": "We didn't even get to eat because the owner was so rude. When we walked in, there was no hostess.  We scanned the room and after a minute we wandered to the only a available 2 top. Some rude man (found out later he's the owner) yelled at us for sitting down. I told him we didn't have to eat there.  He said, no lie. You don't.  So we left. Rude rude rude and crowded for what?", "author": "veranda b."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-01-22", "description": "Lots good to say about this place, but the food for the most part was average and my only reason for trying it was attendance at a BAM show.  The interior was nice, the staff super-nice and attentive, but the food was no different than you could find in dozens of Thai places.  I liked that they made my Som Tum \"Thai\" spicy vs NYC spicy at my request, but Som Tum usually ground peanuts in it.  Mine didn't.  Fighting a cold, I had the chicken noodle soup.  Nothing really Thai about it, but it was OK.  My wife went with a Panang curry that was tasty but, again, pretty average within its genre.  I see this as more of a decent neighborhood place and not a destination restaurant.  Prices extremely reasonable and for that I'd give an extra 1/2 star if I could.\n.", "author": "Bruce N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-19", "description": "I love this place! I have eaten in the restaurant and ordered takeout. I gave them 4 stars because the restaurant is kinda cramped. But even though the place is always crowded on the weekend the food is always consistently delicious. I have eaten at other thai restaurants and they haven't met the standards of this place in my opinion.", "author": "Amanda N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-15", "description": "It's your typical Thai restaurant - great decor, ambiance, food, etc but what stands out most of all are their prices. $10 a meal WITH tax and tip included!\nThe service is super fast so don't expect to hang around too long.", "author": "lauren s."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-08-03", "description": "Tried this place a bunch of times because I was working on a construction site nearby. Seating was plentiful with a modern ambiance but I could never eat at the actual restaurant because I was usually covered in mud. The food on the menu did not lack flavor, perhaps a little too much flavor if there is such a thing. I couldn't bring my food in my construction trailer because the strong smells would overwhelm my coworkers. I enjoyed the spicy noodles the most, but most of the time I would feel groggy and parched after my meals. By the second or third time I had gotten food from national, I began to notice that my fried rice and noodles were pretty saturated with oil, and began to look elsewhere for food that wouldn't leave me incapacitate after the meals. Lunch specials are a good deal however, with fresh appetizers.", "author": "David P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-09-11", "description": "The food was pretty good but the staff's attitude was awful.  I was there with my not quite three-year-old son, who needed to use the bathroom.  The bathroom was being serviced, but the staff was unable to communicate this without being rude. They were totally insensitive to the needs of a newly potty-trained child, and made us wait forever, even though I had brought a portable potty and only needed the room for privacy.  I sort of wished he had peed on the floor to teach them a lesson.", "author": "Gem M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-13", "description": "Best thai in Fort Greene and you CANNOT beat their price or freshness.  I go nearly every week.  Pad See Ew, Skirt Steak over noodles--green curry, yellow curry, red curry, lions and tigers and bears oh my.   Mango salad.", "author": "Quinn J."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-06-06", "description": "Only 3 stars this time because they need to add drinks to the menu. I mean like, Thai Iced Tea and Thai Iced Coffee.\n\nIt's never on the menu, and it's just so good, they really need to make these. If they did, I would buy glass after glass after glass...", "author": "Angel H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-08-13", "description": "Came in for a quick bite. Ordered the spicy squid salad, the dressing was good, but the squid itself was not seasoned or marinated, so it was kinda of bland. Then I found a strand of hair in it.  I stopped eating but didn't say anything to the waitress since I was almost done with the dish anyway. \n\nI also ordered the Spicy Noodles with shrimp, good flavor, like a pad seew but a bit spicier. All was well until I found another strand of hair in my food. This time I notified the waitress, she asked if I wanted another order of the same. Sure... Hopefully this one come bald.\n\nWell second one didn't have hair, but it did have some burnt crispy flakes (I'm assuming it's from the wok).", "author": "Tammy T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-23", "description": "I'd like to give this place 4.25 stars. Perhaps when I've tried a few more dishes, I can bump it all the way to 5. It certainly deserves a better overall rating, but in the spirit of Yelp, I will rate it true to my experience, not to bump up its overall score. \n\nFirst, to address a couple previous comments that nearly dissuaded me from trying National: The Pad Thai is a little sweet, but I dig it. It is NOT greasy. That one must have been written by a competitor.\n\nI want to try the Chicken Panang Curry, but the Pad Thai was so good the first time, I just couldn't risk it. I promise to update it when I do. The chicken has that grilled flavor to it and was still good left over. And after paying only 7.95 for the meal, you will have plenty left over for lunch tomorrow. \n\nOh, and the peanut sauce is awesome- no minor detail.", "author": "Terry T."}], "servesCuisine": "Thai", "priceRange": "$11-30", "name": "National", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "723 Fulton St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/i2Va7tG05YlCvRCJ0x_kBQ/ls.jpg", "@type": "Restaurant", "telephone": "+17185223510"}