{"aggregateRating": {"reviewCount": 396, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-11-23", "description": "My friend was recently verbally accosted, threatened and fearful of her safety at the hands of the irrate and hateful owner of National yesterday for lunch. Women and monorities especially... take the time to read the below incident and question where to spend your hard earned money in your own backyard!\n\nNational\n723 Fulton St\nFort Greene\nBrooklyn, NY 11217\n(718) 522-3510\n\nhttps://www.yelp.com/biz/national-brooklyn-2?uid=KKsfh-y9xMhpsn2uRxnULA\u0026utm_source=ashare\u0026ref=yelp-android\n\nhttps://www.facebook.com/pages/National-Thai-Restaurant/159902934033359\nNational, National, National... and yes, they are connected with Joya-- so BOTH establishments are deserving of fire, brimstone and non-patronage if their despicable owner finds it apropos to speak to ANY customer, especially a female in such a threatening and caustic manner. In the wake of Trump's nomination, I feel like the closeted racists have all taken a sip from a cup of hate-- now drunk on power, privilege and presenting as if tolerance of others is now 'optional'. It surely is not! \n\nTo threaten to call the cops on you when said owner took your order, failed to inform you that food service was interrupted until dinner, refused to apologize for the inconvenience  (and remedy the matter by providing you with your food... which should have been comped for the \"hullabaloo\") and then had the UNIMITIGATED GALL to scream obscenities to you, eject you from the restaurant and threaten to call the police amidst his err of personal judgement is UNACCEPTABLE!\n\nAbsolutely despicable, revolting and beyond unacceptable! This is gentrification and white privilege at its absolute finest...\n\nTo be nestled in an iconic neighborhood that is notable for the great work of minority trailblazers (he is quite lucky Spike Lee didn't leave his production studio mere blocks away and witness this owner's visceral hatred)! To encounter this behavior from a commercial owner is a travesty... he who benefits from the diverse groups of supporters and conduits of the arts and athletic revenue (BAM, Barclays Center) on a day to day basis feels it is just to speak to a professional, astute, strong Black woman  as if she is not deserving of respect and/or courtesy for an order of gentrified Thai Noodles \u0026 Beef!?!?!?! \n\nNot on my watch. \n\nI have been patroning this establishment for over 5 years. I will never, ever step foot into it again! \n\nIt's time to respect ourselves and our hard-earned money. I'm never one to beg for someone else to be in my pockets while treating me less than!!!!!!!! Support Mike and his longstanding establishment if in the area instead: \nBrooklyn Moon Cafe\n745 Fulton St\nFort Greene\nBrooklyn, NY 11217\n(718) 855-7149\n\nhttps://www.yelp.com/biz/brooklyn-moon-cafe-brooklyn?uid=KKsfh-y9xMhpsn2uRxnULA\u0026utm_source=ashare\u0026ref=yelp-android\n\nAs for an ACTUAL authentic Thai recommendation (as I have spent time in Bangkok and have no time for #National's easy bake oven approach to culinary-- disrespectful green papaya salad... bland, uninspired and only served with unseasoned shrimp... no authentic salted crab available), that in my opinion, this is one of the best in alllllll of NY-- go to: \n\nAyada Thai\n7708 Woodside Ave\nElmhurst\nElmhurst, NY 11373\n(718) 424-0844\n\nhttps://www.yelp.com/biz/ayada-thai-elmhurst?uid=KKsfh-y9xMhpsn2uRxnULA\u0026utm_source=ashare\u0026ref=yelp-android\n\nTHIS is a family run establishment that will always treat you respectfully.... the owner remembers me to this day by name after 5+ years of patronage... and the food is worth every minute n' mile resevered to get to Queens! \n\nOrder the fried garlic basil whole snapper (a massive whole fish for sharing with 1-2 others), papaya salad with salted crab, Thai broccoli with crispy pork and a bottle of wine all for under $75!!!!!! #NewYorkTimes and #FoodNetwork and NYC major news channels rave about this gem. \n\nTo Hell with these paper gangster faux restaurants with their hateful owners and managers.  I'm so tired of hearing about continual adverse treatment of my brothers and sisters in our own neighborhoods' varied establishments where customer service should be paramount! \n\n#boycottNationalThaiResturant", "author": "Maria K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-21", "description": "My dish was very tasty. Had the Beef \u0026 Broccoli and Fried Tiger Shrimp Rolls. Great customer service. Will go back!", "author": "Benjamin B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-01-19", "description": "My daughter taught me about this place she brought home some food from here one night and it was so  yummy and fresh tonight as I sit in  Brooklyn hospital sick she went out and got both of us some shrimp woonsen noodles so delicious,I'm going inside one day sit down and dine ,I'm would definitely recommend this place", "author": "Monique B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-28", "description": "Going for Thai in NYC shouldn't be hard, so many choices, even though this place doesn't have the 4 star average I normally look for I just couldn't resist the interior and some of the items on the menu. Very creative and versatile. Thai meets Europe even in some dishes. \nOH My Heavenly goodness, this was Devine, for this price I have not eaten so well and so good. I had the Panang Curry chicken and it was very good, fresh and not at all greasy or not too strongly flavored. My new favorite NY Thai place. With also very friendly service. Way worth your visit. Great food, great price, great service. Damn...! ;)", "author": "Olivier D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-08-01", "description": "I live literally above Joya and know its spectacular, so when hubs and I were starving in Fort Greene we figured we would go with what we thought would be a tried and true Thai dining experience. \n\nThe service was not great... we had ordered an appetizer, and a noodle dish to have as an appetizer as well as entrees. Pretty sure they forgot our corn on the cob appetizer, and after almost half an hour of us staring hungrily at everyone else being served (people who had been seated after us), I saw our waiter peep over at our empty table and then run panicked into the kitchen... they forgot us. \n\nThey brought out our corn, but not our other appetizer dish.  It was a long amount of time in between as well until our entrees (and appetizer noodle dish) came out... One slip up I can absolutely forgive, however we had ordered a vegetarian noodle dish and found chicken at the bottom of the plate. Being a vegetarian- I was very upset that I had potentially been eating chicken remnants from someone else's meal that had been left in the skillet. They also forgot to bring brown rice as I had ordered it, and never even offered to refill our drinks. \n\nWhile the food was the great quality we expect from Joya, the service was so subpar, we will not be going back. Food is five star, but service is far from it.", "author": "Angelique L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-07-18", "description": "Attitude is fuck up here\nDon't understand their Thai English so I ask couple questions and she start to get annoy\nRemember I am the customer ok?", "author": "Mary J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-29", "description": "Absolute favorite Thai restaurant hands down. Ill keep coming here as long as I can. I haven't had one thing from the menu that I didn't like. The food is awesome. The price for the portion is very generous and they are pretty fast to serve once you order.", "author": "Michelle R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-27", "description": "Came here randomly because the atmosphere looked nice and the menu was cheap. We had the nuur kraprow and the spicy seafood fried rice. The portions are great for the price. You can even get an entree and it'll be good for two. The service was great. It's cash only.", "author": "Jerome N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-08", "description": "I love The National. They're a great Brooklyn band with a fresh sound and tight percussio--- oh wait, I'm not reviewing the band, am I?\n\nSo I'm reviewing National, the Fort Greene sister of Song and Joya. Let me just say that service here is quick. Almost too quick. They turn tables around like nobody's business (I guess it's their business), so don't be alarmed if there's a wait at the door (doubly so if you're a small party).\n\nFood is cheap cheap cheap, but also good good good. Noodle and rice dishes start around $8 and beers are $4 a bottle. Not bad at all, considering it's cash only.\n\nI had the seafood and mussels in red curry over noodles. It came with tail-on shrimp, calamari and some veggies. The red curry was surprisingly (and delightfully) spicy. It wasn't a particularly well-balanced meal, but I liked it nonetheless.\n\nKitchen service is super quick. We skipped appetizers because we were in a rush, and we were able to finish our meal in less than half an hour, which is amazing. We didn't even have to rush while eating because the food came so quickly. I liken Thai food to Mexican food in that most of the dishes are the same ingredients; you just have to know how to put them together. And National knows how to put them together!\n\nGive em a try sometime!", "author": "Kenny C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-22", "description": "Wow ! This spot has consistently .... over the years, displayed the absolutely worst service I have ever experienced at any restaurant.  I stopped going here 2 years ago because of the rude treatment / service. I recently started going back, because I wanted to see if there was a change in management and servers. Nope. Some of the same crappy staff ( some new staff members), and the same poor service. \n\nOverall, the food is pretty good, but I just can't get past the terrible service. I will continue to look elsewhere for a Thai restaurant in downtown Brooklyn.", "author": "Randy S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-28", "description": "Came here for lunch with a friend. The lunch special was abundant but I was only hungry for some Tom Kha soup and Thai Iced Tea. My friend got the Pad See Yue and Tom Kha with the lunch deal as well as a Thai Iced Tea. Service was prompt and friendly. We weren't rushed. Definitely a great experience and I will be back soon!", "author": "Amy S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-01", "description": "THE best Thai Food !!! I go at least once a week for the Veggie Pad Thai and chicken curry puffs", "author": "Shannon S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-08-07", "description": "Some hits, some misses.  The Pad See Ew was excellent.  Less so on GaiYang and Chicken w/ Ginger sauce.", "author": "Michael C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-29", "description": "National is fast, affordable, and consistently good. I like to get their food through delivery since the restaurant is usually busy and it's not a very relaxed place to have a meal, imho. As an added plus, they now take credit cards and are on Seamless. I think their tofu pad-thai is the best in the neighborhood!", "author": "Maria M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-05", "description": "I love this place. Food is what I am attracted to mostly but there delivery is super fast too.\nGreen curry, red curry, pad thai and pad see ew are few among my favs. Recently their ambience changed, hopefully the food remains same.\n\nUpdated review: Food still A+ and with nice seating its even more lucrative. Good job guys!", "author": "Chinmayee M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-13", "description": "One of the BEST Thai place in Brooklyn. Staffs are nice and food is amazing. They have the best Red curry in NYC. They are pretty reasonable when it comes to price", "author": "New Y."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-06-12", "description": "Cash only big no no....customer service was so bad\nThe food was delicious however but I would enjoy it more if the waitress wasn't so nasty.", "author": "Tajera M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-27", "description": "Really good food for the price.\nThere noodles and soups are very good and the scallion pancakes are delicious.\nIt's inexpensive \u0026 cash only.\nMinus one star for slow service and cash only.", "author": "Trevor L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-05", "description": "Beautiful space!  They're a popular choice with the lunch crowd in Fort Green, but food is served expeditiously. Menu items are diverse and affordable. I ordered the Gai Kratiam (sautéed sliced chicken with broccoli, cabbage, carrots, and onions in a fresh garlic sauce served with rice) for $8.50. I always view Thai cuisine as a healthier option and that is exactly how I would describe my meal. Next time, I'd like to try something with a bit more spice and flavor.", "author": "Kristia B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-06-02", "description": "Ok.  I know good Asian food, Thai food is one of my favorites  (close to Cambodian/Kymer food).  So I got the seafood noodle soup which was AMAZING the first time I went in.  So I went back yesterday right before the 2hr. Siesta/kitchen closing time at 3pm (ummm yeah, I didn't know about that either) and they were okay to take a to go order (there was someone there who had just got their food with a wild little kid).  Maybe it was the dry, nonchalant, pretentious attitude of the counter people when I approached with a smile and a question about lunch specials or the response when i took out my debit card.  Which ever it was, I'm not too sure but a star was lost.....  next, I'm told that they only take cash.  No options, I had to ask where the nearest atm was.  Next door and a pointing finger was the response.  So I went to a seedy freestanding machine that I'm afraid might have sold my info somewhere far far away.  I come back to pay, again still smiling because they are handling my food.  What did I get? Blank stare, my change on the counter, and a cool walk away from the counter. Not even a nudge of the bag towards me or a thank you.  Whatever,  I'm hungry, so I shake my head and walk down the block to work. \n I open the bag, noodles separate, check.  Soup broth smelling delicious, check.  Chopsticks and spoon, check.  Shrimp and calamari fresh and cooked proper, negative.  The seafood smelled super fishy and was like crustacean jerky!  Plus the shrimps are now like half the size than before.  That was the final straw.... i will not be returning, I was so irritated I forgot to get tea.  \nOh well, no more nouveau, millineal faux, Spice wannabes for me.  I found a real Thai place in Queens (Thailand Kitchen) who has gained a new customer with their polite demeanor and delicious Thai tea. Plus everyone was from Thailand, old school people who have manners.", "author": "Farrah B."}], "servesCuisine": "Thai", "priceRange": "$11-30", "name": "National", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "723 Fulton St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/i2Va7tG05YlCvRCJ0x_kBQ/ls.jpg", "@type": "Restaurant", "telephone": "+17185223510"}