{"aggregateRating": {"reviewCount": 396, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-15", "description": "This place was a welcome relief, after leaving the Ethiopian restaurant Bati because the service was slow and the air stuffy we found national which is a sister restaurant of Joya with a BYOB option, and no corkage fee! plus we got to sit outside!", "author": "Robert R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-19", "description": "I am super excited to find amazing and cheap Thai in Fort Greene.  The restaurant is super cute--I love the ambient lighting and open kitchen that pours smells of spice and herb your way as you wait for your food.  Luckily, that wait is pretty short and there is a complimentary glass of wine while you anticipate dinner.  We tried the vegetarian green curry and vegetarian noodle dish with flat noodles, tofu, egg, and chinese broccoli in brown sauce.  Both were fabulous.  The curry was a vision of health and fragrantly scented with basil, ginger, and lemongrass.  The noodles were a delicious indulgence as well. I'd like to see a bit more vegetarian options on the menu, including a vegetarian soup, but, all in all, this is a fabulous addition to the neighborhood.", "author": "Jennifer R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-02-16", "description": "Amazing. Dinner for five, including 3 apps: 60 bucks. All of it awesome. Esp the spicy noodles.", "author": "Vanessa H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-01-30", "description": "I work in the immediate area and when I heard there was a Thai place opening up I was extremely excited.  I must order from here at least once a week every week.  I have to say I'm only satisfied with a hand full of items on the menu.  The spring rolls are never crisp, the stir fried noodles are always soggy, oily and lack flavor. The good items are the soups, salads and curry.  And even the good items I've had better at other restaurants. So why do I keep coming back? Cause it's the only Thai restaurant in the area!", "author": "Louisa S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-17", "description": "Although small (read: hard to get a table), the food is outrageously good. Plus, until they get their liquor license, it's byob! Their curries are above par, and their serving sizes are never skimpy (literally a heap of calamari for the appetizer).", "author": "Steven J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-11-16", "description": "Yes yes yes!! \n\nIf you've been to Joya in Cobble Hill, you'll love National. Same cheap delicious food, but also BYOB.\n\nYou don't always have to wait for a table, but when you do it's worth it.", "author": "Kendall L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-08-11", "description": "Been there several times.  At times, much too noisy.  Could not hear without shouting.\n\nBeen to many Thai restaurants.\n\nMenu OK  not great.  Not as comprehensive as some.  Not much fish.\nFood OK - About average Thai food.  Pad Thai a little too sour and dry for me.  Gai yang mango salad was good.  Curries are good.  \n\nPrices great.", "author": "Clifford F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-30", "description": "Right near BAM, a solid pre-movie spot. Salads are fresh and I could eat the spicy noodles with tofu every single day. Thanks for the recommendation fellow-yelpers. Eating in is noisy but when you take out, you can sit at a small counter watching the action in the kitchen, fun!", "author": "Ellis S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-19", "description": "Tofu is nice and firm. Nothing's too greasy. Mmmm", "author": "Ernie H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-10-01", "description": "I have loved the original Joya for years, only lamenting it's distance from my home.  \nNow, they're blocks away!  \nJust had papaya salad and \"spicy noodles\": just as great as I remember!", "author": "bklyn b."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-03-29", "description": "rude staff. nasty dispositon. i asked for a receipt tonight. they acted like i asked them for their first born child ! i always experience such nasty service at this restaurant.", "author": "roni D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-04-20", "description": "I love thai food! I checked out this place few days ago. The food is slightly above average. The price is fantastic (almost every entree under $10) with large portion size. The place is small, but very cozy! \nAlso, I believe the place allows you to byob :)\n\nNegative:\nunisex bathroom :(\ncash only :(", "author": "zimadia i."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-27", "description": "We love this place..and love that it's BYOB.  We'll milk that until they get their liquor license.  The food is great and very affordable.  We probably go about once every week and bring friends to turn them onto it too.  The Pad Thai is the best we've ever had (including Seattle).   \n\nJoya is amazing.  I'm not sure about the comparisons that I'm reading in the other posts, but that won't stop us from our weekly outing.  Some of the things that J.R. mentioned in their review may be accurate like they really need a barrier between the door and the outside.  No one can sit in the tables by the window b/c it's so cold.  Also, I questioned the service when we first went, but I think it's better because we usually get our food very quickly.", "author": "hazy l."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-08", "description": "Great Pad Thai! Very noisy atmosphere. Be prepared to smell like the restaurant when you leave because it's poorly ventilated and a bit smokey since the kitchen and dining room are together.", "author": "Jameson B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-21", "description": "Love it. So happy to have good Thai in the neighborhood finally. I love the pad see ew and the mango salad. \n\nBUT - I walked by last night and it was dark and empty and now they aren't answering the phone. Anyone know what's going on??", "author": "Emily W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-12-10", "description": "Amazing fresh Thai. Best takeout in the neighborhood. Try the chicken soup and any of the curries. Actually everything I've had there is good. They don't have an online menu yet, which is a shame, they they are very nice and patient and if you describe what you are in the mood for, they'll name something wonderful or make it to order!", "author": "Kiryn H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-26", "description": "I enjoy their pad see ew with chicken or beef, the low prices and great-looking restaurant. Take-out is quick.  Friendly service. Note: cash only.", "author": "Alexis A."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-09-18", "description": "Eh. Ordered takeout pad Thai and was thoroughly unimpressed. I'll give them props for speedy delivery, $8 pad thai and large portion but it was definitely lacking in the usual delicious complex flavor.  Next time I will spring for the $12 Thai 101.", "author": "Anneka W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-31", "description": "5 stars for great prices and good food. 1 Star for TERRIBLE service.  4 overall", "author": "Mike M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-01-21", "description": "This being my fourth experience with National I'd hoped for them to win, however they fail in a MAJOR way!  I was treated so unkindly that I will NEVER support this business or their sister restaurants ever again.  My dish was overcooked and unappealing to say the least and so I requested another.  I was informed by our waiter who returned to the table with the same plate that the manager said that the dish is not overcooked and that for that reason she basically would not honor my request.  Sigh and shame.  When I addressed the manager directly she proceeded to not only retract and reconstruct statements but to also throw her coworker under the bus.  Having worked in the food and service industry for more than ten years I paid the check and tipped my usual minimum of 20%.  This experience made me feel angry, targeted, and left to wonder what if...what if I were among the newer faces of the neighborhood? Would I have been treated differently?  All in all hurt feelings and bad food, a royal thumbs down!", "author": "Jamila W."}], "servesCuisine": "Thai", "priceRange": "$11-30", "name": "National", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "723 Fulton St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/i2Va7tG05YlCvRCJ0x_kBQ/ls.jpg", "@type": "Restaurant", "telephone": "+17185223510"}