{"aggregateRating": {"reviewCount": 396, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-11-08", "description": "If there were an option for 3.5 stars, I'd give it that. There are surprisingly few Asian options in Ft. Greene and considering how terrible its competition is (I'm talking about you, Manee), this is by far the best option for Thai in the nabe.  The vegetables are always fresh and the curries are dependable. I don't usually venture beyond the curries -- and they all generally taste the same -- but when I do, the spicy noodles are pretty solid.\n\nThis is not a place for a relaxing, romantic dinner -- it's unbelievably loud and crowded -- but it feels clean, it's cheap and it's dependable when you don't feel like shelling out more than $10 for a quick, easy dinner. Pro-tip: it's nigh impossible to get through to them on the phone, their line is *always* busy -- easiest to order in person and wait at the bar for 10 minutes. The walk to and from home will also make you feel slightly less guilty about eating such an unhealthy dinner.", "author": "sara b."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-02", "description": "We got the (special) coconut curry with tofu and noodles, and the vegetarian spicy noodles, and both were great. The som tam (papaya salad) was decent, but had no spice, which was disappointing.", "author": "Ryan I."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-28", "description": "If you were looking for a cute place to get lunch or dinner that is quick, affordable and laid back I would go here.  I frequent this place often and there are plenty of dishes and specials to choose from.  I love to bring friends here to try them out.  I have never had any complaints but agree with some of the other reviews that they are fast, so don't go here for a fine dining experience and you will be okay.", "author": "Jazmine D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-19", "description": "Great food. Very authentic. It's so hard to find a place that has curry that is not too sweet.", "author": "Jeffrey T."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-05-01", "description": "The food was okay, not bad but not amazing. The service was terrible albiet fast. I'd try again for takeout, but for a dining experience look elsewhere.", "author": "Jennie M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-01-16", "description": "I took out an order of spicy noodle with tofu here the other night. The order was ready within minutes, and piping hot. There was an abundance of noodles, with a fair amount of larger tofu chunks about. The tofu had a tough outside, and a soft inside, with a good amount of soy fried in. The spice wasn't very hot, but it was tasty. Those who like it hot would do good to have a bottle of sri-acha around. The portion size was generous. As far as take out Thai goes, National lands on the better side, but it's not exactly a stand out.", "author": "Ian M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-04-09", "description": "This resturant is very deceiving. While the food is great, I know many people who have gotten sick as a result of eating here. Personally, I enjoy the food a lot, but I'm not a fan of the \"hit \u0026 miss\" when it comes to ordering out.", "author": "Alexis P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-10", "description": "Yummy noodles! I go back and forth between pad thai and pad see eu. They are both delicious. I have found the pad thai to be a bit more consistent. Sometimes the see eu is a little bit over-cooked. I wish they would add mock duck to their veggie options.\n\nThe waitstaff is nice, service is speedy. I dig the modern aesthetic and they always play good music. It's super cheap and the servings are huge. I order take-out sometimes and it's usually ready in 5-10 minutes. Not sure what everyone is complaining about.", "author": "M. M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-25", "description": "I must confess I eat from here at leats twice a week. love there house salad, fried calamori, the paw sawi and there tiger shrimp. I have my co- workers hooked we order in groups. i alsoo in to eat ass well they have great service and no matter what you order you are bound to be happy last visited 3/23/2012. one of the best new thai resterants in Brooklyn.", "author": "Tanya W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-11-04", "description": "I stopped going to Joya years ago because it's just too off the chain. I have always lamented the lack of fresh, flavorful Thai and wished we had something similar in Ft. Greene/CH (not a knock on the locals, they try very hard but it's just not the same zing).\n\nNow that National is open, I'm digging it. Have been 3x in as many weeks for dine-in and takeout. The BYOB is great for now and it's 1/10th as noisy and crowded as its flagship. Staff is sweet and it's a great spot, although tiny. Love the nightly seafood specials -- and if you tell them you're serious about spice, they'll listen!", "author": "kristy o."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-17", "description": "Great Thai food and very reasonable prices. A modern vibe, almost lounge-like.\nI had the Spring Rolls and the Tofu Pad Khing. Both dishes surpassed my expectations and left me satisfied. I'm looking forward to visit them again soon and to further explore their menu.\nRecommended.", "author": "Mauricio A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-15", "description": "I loved the food and atmosphere at National.  Most meals were under $10, came out quickly, and were delicious.  I tried the green curry, spicy noodles, and pad thai.  All were good but the spicy noodle dish was my favorite.  The happy hour is also great- $5 heavy pour of wine.  It's also just up the street from BAMCafe for free jazz.", "author": "Anne K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-26", "description": "I really liked this place. Walked in on a weekday night, was seated right away. This place is small, and I liked the ambiance. The decor is welcoming, but well put together with a bit of an upscale lounge type vibe. The crowd is your typical fort green crowd, diverse Brooklynites in their 20s/30s/early 40s... They played this instrumental jazzy, bluesy type of music in the background which I also enjoyed. The place seemed pretty authentic, with a thai cooks and waitstaff.Got the calamari appetizer, which was good.  I had salmon on special which was really good. My husband had a shrimp w/broccoli meal which he said was good but salty. Service was attentive. I will go back and would recommend it.", "author": "Phoebe C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-10-12", "description": "the food was BLAND at best there was no real flavor to the food....... but the horrible service is unforgivable!\n\nour waiter didn't bother to be courteous or remotely friendly. our food and drinks were practically thrown at us, when we asked for a container to store our left over, we were worried that the container were also going to be thrown at us......\n\nwe decided not to leave a tip, so we just paid for the dinner. When we stood outside to commiserate on the horrible service, our waiter comes out and proceeded to scream that tip isn't included in the charge...... my friend wrote on the ticket \"SERVICE SUCKS\"  and pointed out to the waitress.... she felt embarrassed and finally went back into the restaurant.\n\nYEAH, I WOULD DEFINITELY NOT SET FOOT IN NATIONAL..... THERE ARE WAAAYYY BETTER RESTAURANTS IN FORT GREENE AND WAAAYY BETTER THAI RESTAURANTS IN BROOKLYN OVERALL.", "author": "Nayka A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-25", "description": "always trustworthy always decent. its our go to when hunger kicks in. eggplant w garlic sauce is good also great green and red curry.", "author": "Vlada J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-11", "description": "Came here on a whim, and was pleasantly surprised with the attentive service and prompt delivery. The food was delicious and well priced. Like, surprisingly cheap from the look of the place. There was a cop taking his take out and chatting with the host, seemed like a regular. Chili basil beef was excellent. Skip the summer rolls though.", "author": "Jude D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-08", "description": "Food was good, quick and cheap [$7.50 for my entree.] Location is convenient to BAM and the Fulton G stop. Not that being convenient to the G train will get you somewhere in life. Curry was on the mild side. When I left, my coat smelled like the open-air kitchen. Oh well. I'd still go back.", "author": "Stephanie S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-03-28", "description": "I've gotten food from National many times, both dine in and take out (more so the latter). I've had a couple of really good experiences here where I thought the food and service was fantastic, but lately I've been enjoying it less and less. I usually get the fried noodle dishes and it can be greasy with no flavour/taste that is quite discernable other than the noodles, vegetables and meat being fried together. But with a little bit of hot sauce mixed into it, its pretty good. Putting the food aside, the service can be friendly depending on who's on shift, there are a couple people who particularly don't care about providing good customer service at all, time and time again. The proximity of the restaurant to my apartment is probably what keeps me coming back to this place.", "author": "Pam H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-19", "description": "Stopped in for an early dinner with my mom before a show at BAM. Proximity to the theater is fantastic. I was really craving some thai food so I was sold before we walked in. The place smelled like bleach, which is not an aroma to get the appetite going, but at lest we knew the joint was clean. (and like I said, I really wanted thai food, so I didn't care!)   I ordered the Tofu Pad Khing: sauteed tofu with mushrooms, peppers, cabbage, carrots and onion in a fresh ginger sauce. The dish was delivered hot and fresh, the veggies and tofu were cooked just right. I really enjoyed the ginger sauce, I wasn't expecting the size and amount of actual ginger strips to appear in the dish, but as a ginger lover, I really liked it. Would get it again. My mom ordred the Kang Gai: sliced chicken with eggplant, bamboo shoots, peppers and carrots in a red coconut curry sauce. She found it delicious but increasingly spicy. She ate as much as she could until her mouth was too hot to eat more, she said she didn't get too full because the heat stopped her from having more. We were told the green curry is even spicier, so if  you are looking for a hot \u0026 spicy dish National Thai can hook you up. \nTo top off the experience, the prices were great we paid under $17 for the two of us! Just be careful they don't accept credit cards.", "author": "Abbey R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-02-20", "description": "You'll get a lot of bang for your buck here.  Plenty of food at a frugal price.  I would have given this place 4 stars if the staff and service wasn't so mediocre.  Another thing that might help is a sign on the door.  This place tries to be as incognito as possible.  I would understand if it was a speak easy during prohibition, but why make new patrons work so hard to find this establishment?", "author": "Cosme H."}], "servesCuisine": "Thai", "priceRange": "$11-30", "name": "National", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "723 Fulton St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/i2Va7tG05YlCvRCJ0x_kBQ/ls.jpg", "@type": "Restaurant", "telephone": "+17185223510"}