{"aggregateRating": {"reviewCount": 396, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-12", "description": "Best Thai in Brooklyn (and their sister restaurants in park slope and boreum/cobble). Affordable and super delicious. All curries and noodles are fantastic. Chili basil ANYTHING is amazing.", "author": "Maura T."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-11-23", "description": "the owner is a first class bum/racist - would never support this establishment -", "author": "Vanessa T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-04-04", "description": "My friend recommended that I try this place out and since I love Thai food, I gave it a try. I had a Thai tea, chicken and broccoli (cabbage, onions and carrots) in garlic sauce with brown rice. It was delicious I ate every morsel. However, our waiter (guy with a high ponytail and shaved sides) was not very attentive nor was he nice. I asked if I could substitute the rice for vegetable rice and he responded as if I were from another planet. He also never came by our table to ask us how the meal was, which for me is standard in any restaurant. We showed him our gratitude with a minimal tip. If you want a good tip you need to provide good service.", "author": "Ro-Ro J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-25", "description": "This place never disappoints. Wish I lived closer. I would order from here once a week. The sauces they give you on the side are to die for. Can't wait for my next visit. Staff is friendly and food is great.", "author": "Xenia Z."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-09-21", "description": "See my review for JOYA restaurant. Same owners, same menu.", "author": "Tanya R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-05-30", "description": "Disappointing food and rude service staff. I've gone there before and the food was great -- comparable to Joya on Court street. Went there with a friend and I ordered the Pad Si Yue with beef and the Tom Yung Gung. The soup was excellent as usual. However, when dinner arrived the tall blond guy brought over several dishes, one of which was not mine. As we tried to sort out which dish was whose, he got impatient and dropped all dishes on the table and walked away!!\n\nOur waiter came over and I reminded him of my dish and he picked up the incorrect dish (no apologies) and went back to the kitchen. I waited another 10 minutes without seeing our waiter to ask the ETA of my dish. He only showed up with the dish after this time passed and placed it in front of me. No apologies or explanations. \n\nThe noodles were great with flavor but beef was overcooked and chewy. Could not eat the beef and had to eat around it.\n\nDisappointing overall!! I will stick with Joya.", "author": "Nadine R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-23", "description": "Great place to chill in down town bk\n\nGood servers and waiters\n\nDecently priced", "author": "Dann'e M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-11-19", "description": "While I enjoyed the cuisine of national in the past it's the standoffish demeanor they pride themselves in as customers service I can do without. A mechanical error was done on the part of a staff member who was sorry, which was OK. It wasn't until this particular man (another server)  decided to intervene instead of diffusing he antagonized by brushing it off as a flippant matter followed by condescending rebuttals. BETTER MANAGEMENT at national, people skills, charisma and customer service is what they lack. I WILL NOT BE RETURNING TO NATIONAL while the customer is not always right it is not the place of a server to be unprofessional at any time.", "author": "Asia P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-04-25", "description": "I feel like the service here is slowly deteriorating. The pad thai is still not that great.. and the texture of the tofu tod is just too dry. But, I still love the kang gai.", "author": "Tina W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-14", "description": "The food here is really good. The pad thais are amazing and its the only place where I'm willing to eat pad thai. However, the portions are getting smaller and I don't like that. Their fried calamari is also amazing and very crispy and crunchy. Curry puffs are also on point. This is my go-to Thai restaurant. But again, portions are getting smaller and smaller and it's pretty sad", "author": "Danny L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-10-14", "description": "Things I loved here:\n- HUGE portions. enough to feed you and the homeless person you'll give your leftovers to \n- Well priced \n\nThe spicy noodles were not very spicy but still good. I also ordered the sticky rice + chicken to start (in my head, I thought it was a starter but really it was a full on meal). We also ordered a curry dish which was very flavorful.\n\nThings I hated:\n- Indoors, the restaurant is SO loud to the point where you can't focus on the conversation you're having.\n- Outdoors, on the sidewalk about a ft from where people are walking... causing distractions. \n\nGood food, but not a relaxing meal by any means", "author": "Joanie K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-11-23", "description": "The ambiance is pretty cool.  I love the decor--it's sleek, modern, and minimal.  The food is fresh, colorful and appetizing.  The Thai ribs -- succulent.  The spicy seafood rice -- savory.  Our Thai ice tea and lychee drinks were refreshing, aromatic and flavorful.  You can pretty much sit anywhere as the vibe appears to be laid back.  My first impression of this place is a good one, so I'll be making another visit here soon.", "author": "J M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-27", "description": "Guys and Gals: \n\nSpicy noodles with chicken (or steak, or tofu, or veggies, etc.) It's phenomenal. Flavorful, filling, inexpensive, FAST. \n\nWhen I've worked late, this is the perfect dish, prepared quickly and masterfully. \n\nI usually take out and eat like it's either the last hour on Earth or I'm a lone cave man trying to figure out the benefit of chop sticks. It ain't pretty, but it IS delish. \n\nIf you know sign language or went to mime school, dine in, but this small place gets mucho busy and noisy, espesh on the weekends.", "author": "Scott R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-01-26", "description": "Meh. \n\nIt's okay.  The entrees reasonably priced, and they're okay.  I've had several dishes here, the drunken noodles, the shrimp in chili basil sauce, and a green curry.  I think the curries are the best of the menu. \n\nThe atmosphere is really what sets this place apart.  It's a great place to enjoy a meal, but the meal itself is just aight.", "author": "Justin C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-09-11", "description": "A frien was taking me to lunch and so, I ate here again, and this time -- it was better. \n\nMaybe they needed to get their ball rolling or maybe this time the staff was in a better mood, more experienced, or.. something.", "author": "Tamara C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-02-18", "description": "You will not be disappointed with your meal at National. However, you won't be wowed either. This is very safe and very consistent Thai food. In my book consistently good beats sometimes great/ sometimes awful. National is perfect for those times you want a quick, convenient fix. I've never had to wait for a seat and they deliver as well. I do wish they'd start accepting credit cards. Who can remember to keep cash on hand all the time?", "author": "Carey H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-30", "description": "I often go there with my boyfriend. It's reasonable price and good quality of foods. Waiters are friendly. My favorites are green curry and papaya salad:)", "author": "Saya N."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-08-25", "description": "Actually a decent Thai joint. I had the curry puffs and the spicy pad kee Mao noodles. The puffs were good and the noodles not too bad, just missing that little bit extra. Service was okay too. Just remember - cash only.", "author": "Campbell H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-07", "description": "First time here on a Saturday evening!  had 7:30 theater tickets and we got in a little before 6:30pm.  We let our waiter know we were in a bit of a time crunch and he said don't worry we'll get you out in time.  We ordered the special of the evening - Shrimp/Broccoli Pad Thai. The meal arrived shortly after.  The shrimp was an impressive size and the broccoli was cooked but crunchy, like I love.  We were out the door and in our theater seats by curtain call.  Cash only, rather small venue but the food was really good.  I would definitely go back.  My only gripe, it's a bit too dark, I needed to use my cell flashlight to view the menu.  They just need to bring up the lighting a notch.", "author": "Yvette M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-02-20", "description": "Not that great a selection. Not that flavorful. Not that spicy. Not that pricey.  Not that bad.", "author": "Jeff L."}], "servesCuisine": "Thai", "priceRange": "$11-30", "name": "National", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "723 Fulton St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/i2Va7tG05YlCvRCJ0x_kBQ/ls.jpg", "@type": "Restaurant", "telephone": "+17185223510"}