{"aggregateRating": {"reviewCount": 396, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-12-02", "description": "I went there for a friend's Birthday. I called a few days ago and asked if I could bring a Birthday cake. They said sure. We went there with a baby and a little kid + 5 adults, and stayed there from 3-5pm Sat afternoon. I told a lady (probably a manager) that I brought a Birthday cake and she took it. The waitress was really unfriendly and rude. After the meal, I asked the waitress to bring the cake, then she told me customers can't eat outside food. I told her that I had confirmed it by phone. She checked with the manager, then she brought the cake and said nothing. Instead, she brought the check and automatically added 25% tip: $68 + tax + $16 ＝ $93 total. I asked her for an explanation and she said she added a 20% tip because we brought the cake, but she was being dishonest: she had actually added 25%.  They said nothing about that when I called. I'm very dissapointed about how they do the business. I'll never go back there again. If you want to enjoy your meal in a friendly atomosphere, don't go there, expecially if you have kids. They are NOT a kids-friendly restaurant.", "author": "Atsuko T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-03", "description": "Great Thai food, super cheap, not byob they have a full bar. Service could have been a little better but the food came super fast.", "author": "Maggie R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-13", "description": "National is a great Thai restaurant in the middle of Fort Greene. The menu is super affordable and you can be sure that whatever you order will be tasty.\n\nI ordered their version of Pad See Ew and it was pretty good. I also had a taste of the spring rolls which were actually really delicious.\n\nThe place isn't huge so I wouldn't suggest the largest groups, but a group of 6 could definitely be fine here. The atmosphere isn't something to brag about but it looked pretty nice in there.\n\nI'm not sure if it was just the time I went in there but one of our waiters (the guy who started us off) was kind of bad. He ignored my water request and that irritated me. But the main guy who was assigned to our table was attentive. Overall, great cheap experience and it's cash only... Heads up!", "author": "Melissa T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-28", "description": "I really wanted to give this place five stars, but the service was abysmal. Fortunately, their food more than made up for the lackluster service. I ordered the pad thai with shrimp... i know it's pretty basic, but I know what I like. The pad thai was fresh, the right amount of spice, and came out very quickly. The food is priced well and the inside of the restaurant is very chic and cozy. \n\nI would definitely come back and check this place out again next time I'm in Brooklyn.", "author": "Brynt L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-06", "description": "I never had an opinion on thai food until I moved to this neighborhood.\n\nIt is always so fresh and amazing that I now refuse to go anywhere else.  \n\nDownsides: cash only and atmosphere (loud music + tile floor + no wall hangings = loud).", "author": "Becky B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-03", "description": "Mad disappointed!!! I've eaten here in numerous occasions and never had an issue with them until today! Call in today and got a disrespectful ass woman on the phone! I placed a simple order for spring rolls. Before I could even finish speaking, she hung up the fucking phone on me! So I called back and told her I was not done speaking! She didn't issue a time frame of when they were going to be done or even say \"Is there anything else I can help you with?!\" She then stated there was a silence on the phone that's why she hung up! Really bitch?! You couldn't have said \"Hello, are you still there?\" So I hung up the phone. Then she calls me back to ARGUE with me over it!!! Saying that there's something wrong with the phone lines!!! You just admitted the previous call that you hung up the fucking phone!!! Now it's the phones fault?! Who calls a customer back to disrespect them after coming in regularly to eat there?!?! Who the fuck does that??? The one thing that pisses me off after spending my money at an establishment is to be fucking disrespected!", "author": "Tony W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-10-11", "description": "This is the second time I've ordered from National Thai where the woman accepting calls on the telephone has been extremely rude. The first time, they made an error on my delivery order. The gentleman making the delivery had already left my building. So when I  called to inquire and clarify what was missing in my order, the woman was flippant and said, \"We don't have it.\" I was not noticed beforehand, nor called up after placing the order, and the delivery person did not informed me that there was an item missing. I do not  feel that she did a good job of communicating this to me and the charge. \n\nDuring the second time placing a delivery order, I received the same woman on the telephone. After I placed my order I kindly ask her if she could repeat or read back to confirm. She was flippant on the phone and then when I started to repeat back my own order to verify, she shouted,\"I GOT it!\" \n\nNational has relatively good food, but I would rather not have to encounter someone who has poor customer service skills like this. Next time, I will order from Mallee Thai.", "author": "Lebleena L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-06-11", "description": "Showy, very open kitchen with large flames and pans clanking.  Very noisy Fort. Greene Thai with cool name.\n\nCheap eats make this spot packed pre-BAM as it is soooo close.\n\nMost entrees are $9 or less.....\n\nAte:\nFresh salmon summer rolls- $4.95\nVeggies with red curry with coconut- $6.95\n\nDishes were fresh served with slightly gruff un-Brooklyn 'tude.   Dishes tasted fine, but nothing rocked the palate.  OK, if you are close-by and craving Thai.", "author": "Franny A."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-11-09", "description": "I had such high hopes of this place, given the reviews! Alas, we were disappointed with our takeout. Why is it so hard to find a half-way decent Thai in this area?!\n\nAlthough the food was edible,  it was bland at best, and downright unpleasant at worst. It felt sloppy and rushed. Where's the love, guys?\n\nFor specifics - the beef in my husband's grilled beef salad was chewy and none too fresh - slightly funky aftertaste. Also the Thai vinaigrette was overly-sweet. A good Thai salad lives and dies by the freshness and liveliness of its ingredients, and sadly the beef let this one down big time.\n\nMy \"Fresh Thai Summer Roll\" actually was pretty fresh, and nicely-made - but pretty bland. It was crying out for some tangy sweet chili sauce to bring it to life! Instead I got a dollop of weird mustard. Nope, wasn't working! Then for an entree I had the Koong Pad Khing  (sauteed shrimp). Although the ginger sauce was OK, the shrimp were way overcooked, like little bullets, and there was the strangest taste to the broccoli... like liver or something! How on earth do you make broccoli in ginger sauce taste like offal?! Amazing!\n\nHusband had the beef panang curry. \"Mediocre\" was his verdict.\n\nSo yeah, won't be trying that one again I'm afraid. No love, no return business!", "author": "Katherine C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-08-26", "description": "I've been eating here for the past 3 years. I had a terrible experience during my last visit and will not be going back. The fact that they don't accept debit/credit cards is a total inconvenience. I ordered a meal that was served with pad thai noodles, however when I received the food the noodles didn't appear to be pad thai noodles so I sent it back. The server took the meal back and still put it on my bill. When I paid for my food the server did not return my change. After requesting my change I decided not to leave a tip because the server tried to withhold his tip without asking if I actually wanted my change back or not.  Also as I mentioned I was already charged for food I  didn't eat. The server followed me to the exit and said \"no tip?\" I replied no, I was charged for food I did not eat and I'm not satisfied with your service. The server then says \"Don't $\u0026?ing come back\". I hope he reads this review because sir, I will for sure not be back. That is no way to treat anyone and I've been a server before so I know he should know better. Unacceptable!", "author": "DeLynn S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-25", "description": "I love this place and have come here for years.\nThe food is good and fresh and relatively authentic (I believe).\nThe staff are largely Thai, and always friendly and helpful.\nMy favorite is the Pad See Yu.\nThey only take cash.", "author": "sophie d."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-07-11", "description": "Typical American \"Thai\" food. Prompt delivery and affordable.", "author": "Jen B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-08-05", "description": "I did not know this place was/is a sister restaurant to Joya.  I've always wanted to try Joya(the one time I was supposed to have dinner with friends, I ended up overnapping and missed dinner...oops!).  \n\nI met up with a friend and she picked this place for lunch.  I never knew this place existed.   We both ended up getting the lunch deal.  For under $10, you can order one appetizer and one entree, although selections were limited.  Luckily what I wanted was on the lunch menu, spring rolls and pad Thai.\n\nThe spring rolls were okay but I didn't enjoy the pad Thai as much as I thought I would.   I think the sweetness of the sauce was overpowering and there was no other flavor.  \n\nI returned a next time for dinner and ordered the Pad see ew.   I enjoyed that dish very much.  Much more flavorful than the pad Thai.   I guess the next time I return, I'll be sticking to that dish.  (Yea, I tend to stick with what I know...-___-)", "author": "Ming T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-29", "description": "Authentic Thai food. My parents are from Thailand but I was born and raised and the states. It's nice to go in there and speak Thai with the waitresses and owners. This place is legit and the prices are cheap. Portions are big. I don't suggest ordering any food to go because the portions are much smaller. You're better off ordering there and then asking for a to-go box.\n\nCash only", "author": "Rose K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-07-31", "description": "So where to begin. People flock to this place because of their lunch special. That's cool. But if it takes ten hours to beat how special is that ?\nLast I was here, I seated myself, no greeter no organization. \nIn their defense, they also do takeout delivery so it can get pretty busy. \nThat's personal, hire more staff. \nMy food tasted good hence three stars. \nAlso the manager/ owner lady did try to make up for it by being super nice. \nHowever I had to chase them down in order to get check to pay.......\nA lesser or smarter person would have just left. Note to business owners.... Don't make me beg to pay you.", "author": "Anna K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-27", "description": "Consistently fast service and delicious pad thai. What more can you ask for?", "author": "Kyle H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-23", "description": "Best Thai in a 10 block radius! Food is always tasty, freshly made and good service. They deliver as well. Don't be afraid to try the specials. Thumbs up!\n\nNote: Cash only.", "author": "Juan S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-24", "description": "I used to work right by here and would come here after work for a yummy, quick, and fresh meal. The place is very clean and sheek, service was friendly and timely, and the food was on point. I especially like their papaya mango salad with steamed tofu, summer roll, green curry and pad see ew.", "author": "Amanda K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-18", "description": "This place was very crowed at 8:30pm on a Wed. night. We had to wait about 5 minutes for a table but it was worth it. I had the chicken in garlic sauce with vegetables and it was delicious. My other two dinner companions also enjoyed their meals.\nThe only negative was that they dont accept credit cards so make sure to bring cash with you.", "author": "Isabel J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-19", "description": "Damn good Thai food which is extremely affordable. Down side, it's cash only. Must try the Woon Sen noodles!", "author": "Sara I."}], "servesCuisine": "Thai", "priceRange": "$11-30", "name": "National", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "723 Fulton St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/i2Va7tG05YlCvRCJ0x_kBQ/ls.jpg", "@type": "Restaurant", "telephone": "+17185223510"}