{"aggregateRating": {"reviewCount": 396, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-03-04", "description": "So, I've been back a few times now.  Though the last pasta dish I ordered was on point, I don't like how the rice is consistently overcooked.  Is that their style?  Maybe, but it's not my own.  The other thing is that they REALLY didn't think about how the wind kicks down Fulton St. when they decided on the location. Man, there's a lot of traffic coming in and out of their and that cold hits ya' hard if you're sitting anywhere near the door - and honestly, even if you're not too near the door.  They've got to get it together on that front. I'm sure the summertime will make this better, but still.  Yeah, I'll probably be back, but my star is reduced for all the above.", "author": "Curtis J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-07", "description": "Improved over time so the food quality and service gets a 5. They also deliver now. The disappearance of the lunch special gets a 1!", "author": "A Brit In Brookly N."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-02-05", "description": "I can't weigh in on the debate about whether this has the same owners as Joya on Court Street. In any case, like Joy it does have good drinks, cheap wine, and nice lighting. I'm happy to overlook haphazard service. Just can't overlook essentially inedible food.\n\nThe satay is like shoe leather. The squares of pork are undistinguishable from the beef satay. The black bass special was a firm white fish, but amazingly small for a black bass -- small enough and characterless enough for us to doubt whether it was in fact black bass. Looked over the reviews now, and can only feel fortunate that at least we didn't try the Pad That.", "author": "Mark G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-27", "description": "We stopped here before a concert at The Barclays Center. It was a little hard find b we couldn't spot the sign.  was surprised bc they sat us right away. Place was packed. Food was really cheap and huge portions. We had two apps off the special and pad Thai and drunken noodles for an entree. Two beers and the tip and the whole meal cost us 45. We are planning on going back to the area and trying it again.", "author": "Gina N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-29", "description": "Portions are enormous, food is delicious, service was a tad slow (but we were super hungry). Spicy noodles: amazing. Papaya salad, had to take done home. Green beans with red curry out of this world!\n\nSame restaurant at Joya on Court Street. Both outstanding.", "author": "Nadja J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-07", "description": "I love National! The food is bomb and super inexpensive. They give you huge portions too. The waitstaff sux but whatever, food is good and it's BYOB.", "author": "Marly P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-07-31", "description": "Both the pad see yue and the pad thai were very tasty and good portions for the price (a bit under 10 dollars I think). The fresh spring roll was a disappointment, falling apart and with an oddly citrus flavor that didn't go well with the other ingredients. The takeout is extremely fast.", "author": "Alex M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-07-12", "description": "Thumbs up for National. Very tasty dishes. Waiters are friendly and the prices are reasonably.", "author": "Lex G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-02-04", "description": "Yes.  I went from a 5 to a 1 star rating.  Well you see, it's a sorta hairy situation.  I've eaten here 3 times so far.  The first review was based on my first experience which went without a hitch around the time they first opened.  The second time we came here famished and unfortunately found a hair in our calamari.  We put on our go-go gadget hats to investigate whether it was one of ours but it definitely wasn't.  They were great about it and didn't charge us for the hairy seafood.  Yesterday, against my better judgement I returned and in the middle of the meal, my friend, who had never been here before, stopped eating and showed me the hair in his pad see EWE!!!!! Seriously two out of three?  When I went to use the bathroom later on I saw that the main chef did not have anything covering his hair. Nada.  Seriously can he get a lil' hat, du-rag, bandana, shower cap?  Fool me once shame on you.  Fool me twice, no more beef and broccoli!", "author": "Donna A."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-04-05", "description": "This is my second visit here and I will not go back. The place is cool enough, decor-wise and the food is good, not great. But the reason I won't return is the very rude and very attitudinal host. He was borderline nasty to my party. As we were waiting to be complete so as to be seated last Friday, I asked him if he had any idea when he thought we might be seated. \"I have no idea\", he snapped, \"just wait outside\".  Hmmmm. Now, I've worked as a restaurant hostess and I must say, there aren't that many skills to master. One is to be pleasant to the clientele (he failed) and another is to be able to gauge table turnover times (double fail). My friend suggested that maybe he was just harried because the restaurant was busy, but, dude, if you get harried in busy restaurants on Friday nights, don't be a host!\nIt boggles my mind when restaurants act like there aren't 50,000 other restaurants in NYC to go to. And that return customers are crucial. And that restaurants don't go out of business. And that Yelp reviews exist. Perhaps this will serve as a reminder.", "author": "Karen M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-24", "description": "Who knew? I could tell as soon as I walked in that it is the same owner of Song.  What can I say?  This place is great.  Nice atmosphere, and most things are under $10.  Oh - and I enjoy the food here. I really do.  I bet they get rushes though - after movies end at BAM (which is when we went) but we still got a table.  The only criticism is the setup is really weird - you have to wait by the bar by the kitchen because if you wait by the front, you are literally just hovering over the other tables.", "author": "Vanessa O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-09-15", "description": "Joya, but in Fort Greene.  Yes!!!!\n\nThe menu is actually exactly the same as Joya.  Good thai at a good price - which is a 1000% improvement on what the neighborhood had before....nothing", "author": "Michael B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-01", "description": "A solid cousin of Song in Park Slope, National will do just fine with there quality selection, quantities, and low prices. Is it a trend with Thai restaurants to paint a layer of swank over their ambiance?  \n\nA recent returnee from traveling in the native land has left me with the urge to speak the language once again which the staff accommodated. So that was pleasing on a personal level. Spicy noodles with vegetables mixed broccoli, red and green peppers, carrots, and basil nicely.\n\n\nAdd all this to the great atmosphere of Ft. Greene and this makes for the start of a pleasurable evening. One tip, don't sit by the door in the winter as it doesn't close right away. Sahwahdee Kop!", "author": "Joseph D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-08-31", "description": "White, gay male owner accused me of not paying the bill.  My friend paid AGAIN to avoid drama.  The owner grabbed me by my arm, threatened to punch me in my face and continued to scream \"cunt\" and \"dyke.\" He randomly mentioned his Black lover and daughter, as if to erase his racist, homophobic, or sexist comments and actions. Tons of witnesses. Waiting for police report. NEVER eat here again!", "author": "L J."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-12-02", "description": "Love song and joya, and national isn't too far behind them. Prices are low (less than $10 to feed two easily), but for some dishes you definitely get what you pay for!\n\nMaybe my problem is that I order dinner on the late side so the kitchen is ready to close up and doesn't care anymore... Beef salad was practically inedible bc the meat was incredibly tough and overcooked and had that old bloody smell. Tonight I had the special duck pad se yu; noodles were tasty but lots were clumped together and some of my duck was fried beyond recognition -- I thought it was pork! \n\nDespite those misses, I'll continue to eat there bc it satisfies my thai cravings, is conveniently located, delivery is lightning fast (30min from phone call to door!), and as i said before, dirt cheap.", "author": "Jacquelyn S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-08-14", "description": "The absolute WORST experience ever!!!!\n\nMy friend and I go in to eat. Our waiter was pretty quiet - not sure if he was shy but didn't really care. We order and get ready to pay and another waitress comes over to say \"No cards.\" My friend and I asked \"well how come our waiter didn't say this before\" and she points to the tiny print at the bottom of the menu. \n\nOh it gets better.\n\nAfter we were followed to a nearby grocery store by our waiter to get cash from the ATM, we go back in the restaurant to complain to the manager who clearly did not care about what we had to say. Then a bartender jumps in to ridicule and mock us in a racist manner when we were not even speaking to him. My friend and that bartender just started arguing while all the employees watched, including the manager who only cared about counting cash. Not only were these employees rude they clearly do not value the opinion of the customer. \n\nThis place is definitely on my **it list. Giving them one star was painful enough because they do not deserve it. \n\nMy friend and I are from this neighborhood and will be sure that no one we know goes this restaurant.", "author": "Cherri S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-01", "description": "Great food for a fantastic price. Portions are more than enough. Some favorites are : Thai Mussels, Wings with tamarind BBQ sauce, Pad See Yoo, and the Skirt Steak in garlic sauce. Friendly service and an unpretentious- welcome atmosphere. You can't lose at National. Absolutely best Pad Thai I've had in NYC.", "author": "Douglas H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-14", "description": "Thai food here is legit.  For us it's close, local, fast service, reasonable prices and generous portions.  So far, we've only tried a few dishes, papaya salad, chicken noodle soup and the beef pad see yue, all which were great.  Just be prepared that they only accept cash.  We look forward to trying other dishes in the future when we're craving Thai next.", "author": "Joseph D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-08", "description": "I used to Live in the Area, and this Thai place is awesome, I've had their Pad Thai (chicken, \u0026 shrimp) which is always cooked to perfection, I tried their Pad See Yu-- it's pretty good but to some can be alil' salty,, the fried calamari is good however I wasn't a fan of the tangy dipping sauce--- but I gotta remember it's thai not italian, their mango salad is good too!!! i their Thai-Iced Tea is addicting and the food always comes out pretty fast. Two-Thumbs up ya'll.", "author": "Kristal A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-02", "description": "I've already been to this place about six times and each time the food has been consistently good and the service consistently fast. The prices can't be beat and unlike Song in Park Slope (their other restaurant) you can actually hear yourself speak.\n\nIt's a Ft. Greene must!", "author": "Star P."}], "servesCuisine": "Thai", "priceRange": "$11-30", "name": "National", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "723 Fulton St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/i2Va7tG05YlCvRCJ0x_kBQ/ls.jpg", "@type": "Restaurant", "telephone": "+17185223510"}