{"aggregateRating": {"reviewCount": 396, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-01-29", "description": "Ambiance: Very modern interior with comfortable seats but this place simply feels crowded and it can be pretty noisy depending on who your neighbors are. The service was decent with only a pass or two of the waiter before waters were filled.\n\nFood: Really unimpressed here but it wasn't bad. The panang curry was sweet but not spicy as all. Simply chicken, which was admittedly tender and moist like it should be, served with bell peppers which weren't too soggy at all.\n\nReally not much to say about this place, it was utterly forgettable.", "author": "Binnan O."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-09-05", "description": "Um, this place isn't good either. Not sure if they have any seasonings in the back. Really. Don't get anything but Calamari or the Pad Se Yu. \n\nOther things on the menu I've tried have just tasted really nasty. I'll have to agree with another yelper by saying that there aren't many options for Thai in the neighborhood and it gets by on foot traffic.\n\nIt's the second Joya, the menu is the same and the food is pretty bland.", "author": "Alicia G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-27", "description": "The food is amazing, I really enjoyed National. Please be aware that it's cash only! Don't forget it's cash only!", "author": "Arielle D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-01", "description": "I just can say I love this restaurant. Great taste, great service, very clean, and very good price. I wish the place was little bigger and that they accept cards, but I can deal with that. Still my favorite Thai restaurant in that neighborhood.", "author": "Donna M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-15", "description": "The food here is excellent! The Pad See Ew with beef is delicious, especially with a liberal amount of chile sauce on top. I highly recommend it!", "author": "Arthur B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-26", "description": "Dope Thai spot in Brooklyn overall. A good friend put me on to this little hole in the wall spot that anyone would just walk past without looking at twice. But between the quality of food, the prices, and the atmosphere you can't go wrong.\n\nHad a really cool waiter who was extremely helpful. Im not very familiar with Thai dishes and reading the menu was like translating ancient scripture. But he was able to explain everything to me in detail, no problem.\n\nMy friend and I had 2 appetizers 2 entrees and she had a soda while I had a water. Keep in mind, these aren't small portions... Im 6'5 220, but I couldn't finish my Drunken Noodles. What was the damage? 22 BUCKS! Cant beat that, especially in downtown Brooklyn where you have to put chicken wings on a lay away plan.\n\nAfterwards my friend and I just relaxed right in the restaurant and had a conversation for almost 2 hours. No hassle from anyone either, in fact the waiter kept filling my glass with water way after the check was paid. The ambiance is pretty nice though. The restaurant has a bit of a lounge feel to it with the dim lighting and you can easily find yourself getting a little too comfortable.\n\nThe food did take a bit longer than i'd like, and I was really frustrated because I didn't know what I was getting into. But once it came and everything else went smooth it was all good. This is like a spontaneous \"hey, you wanna grab something to eat\" type spot. If you're celebrating an anniversary with a significant other, expect no buns that night. Im a fan though. I'll be visiting again", "author": "Donovan F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-15", "description": "My favorite thai food place. We love the chicken pad thai with tom ka (coconut and tofu) soup with mango salad! yum!!!'", "author": "Niloo Z."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-11-18", "description": "RUDE!...horrible service. Mediocre pad Thai. Bland fried calamari very tasteless. Just go elsewhere. Also stopped us on the way out to let us know not to come back because we didn't tip their horrible service. Little did they know we already decided that and their farewell comment confirmed it! I will DEFINITELY go elsewhere for better food and service .", "author": "Tiffany H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-10-30", "description": "It's about as close to authenticate Thai food as you are going to find in Brooklyn and the prices are not unreasonable.  I didn't love the dish I ordered but I would go again.", "author": "Jo J."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-01-18", "description": "Pad Thai With a Side of  \"Jim Crow\"\n\n\nA couple of weeks ago I decided to order lunch for myself and my girlfriend. I called National for a pick up around  2:30pm (on a Tuesday). Because of the severe cold I decided to wait for the C train instead of walking. It took me about twenty five minutes to get to the restaurant.\n\nWhen I did get there, I smiled at the woman standing at the register. What I received in return was something closer to \"the finger\". This young woman shot me a dirty look, then turned to her male coworker to say something in what was possibly Thai.\n\nShe was clearly annoyed with me. Obviously I have no idea what she was saying about me, but she was clearly talking about me. Alright, your customer takes a little longer than you expect to pick up their food.. Is this the first time this has happened?? And your reaction is to stare daggers at them and talk crap about them in your language? I ordered this lunch for me and my girlfriend who was home sick, so I did not walk out as I should have. \n\nWhen I handed her the money, she snatched it and then shoved my change back into my hand. The smug look of satisfaction on her face made it crystal clear this was about more  than me taking too long. I understand that people who get their kicks out of treating people this way usually feel quite small themselves. Still, that's no real consolation.\n\nAfter taking the food to my girlfriend, I came back to speak to a manager. I explained to this woman that her treatment was ridiculous. She couldn't have cared less. The same arrogant attitude she showed me earlier, was the same one she had when I came back to complain. She didn't care that I wanted to talk to the manger, because she is the manger. I was also told by her co-workers that they all own and run National together. It would make sense that it's a family run establishment.\n\nI have supported \"Joya\"in Cobble Hill for years, but may not anymore due to it's connection to \"National\". Business proprietors who don't see their customers as human beings, should see less of those human beings in their establishments.\n\nOh, and on top of all of that, the food is just fair.", "author": "Malek A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-21", "description": "Had lunch on a Saturday. \nGreat food. Great design of the place. Even the dishes look great. \nIt's cheap - but they only take CASH!!\nWe had the Gai Pad Khing and the Kang Gai, both were really really delicious. \nEverything came out in minutes, super fresh and tasty. \nThe waitress was super nice too.", "author": "Or L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-03", "description": "I've been to this restaurant twice recently and have been extremely happy with the food and service. I've been to Joya several times and National has the same great menu and amazing prices. I've had the Pak Kratiam, Pak Woon Sen, and Spicy Noodles. All were delicious and ready in about 5 minutes. \nThe amazing thing is I accidentally left my laptop behind and the staff not only kept it safe, but had it delivered to me! 5 stars for sure!", "author": "Grace J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-17", "description": "AWESOME place. \n\nQuick service.\nGreat food.\nCheap price.\n\nThis is by far the best Thai food I've had outside of Thailand :)", "author": "Kuldip K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-12", "description": "This was a good night for music in Fort Greene. To my surprise, National was playing \"Fix You\" by Coldplay and other artifacts from my high school nostalgia, which is only a bonus when you're there for the food. \n\nI was looking for something lighter (blame my diet deviation earlier in the day, nobody's perfect!), and National delivered.  I got Chicken Noodle soup (no soda on the side), and it was a super flavorful, light broth with hints of lemongrass, perfectly cooked noodles and chicken. I also got a shrimp salad, and although I wish the shrimp was a little warmer, it was tasty nonetheless. But the soup was the winner for me, and it was so big that I couldn't finish it. When I woke up this morning paying for last night's debauchery, all I could think about was that Chicken Noodle soup and how I wished I had taken the rest home. Come back to me! *Janet Jackson voice*\n\nMy friend, who usually doesn't like Pad Thai, loves it here, so I know I'll definitely be back and I'll probably try that next!", "author": "Shana B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-02-12", "description": "The food was Okay, I enjoyed the service at Joya's better(Nationals sister restaurant)\nThe prices are fair. The Mango Salad was awesome. I've eaten there twice already and would not be opposed to going back a 3rd time.", "author": "Justine A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-06", "description": "Gem in Brooklyn. Very affordable, cash only Thai place that is probably best I've ever had. Great drinks and the menu changes often. Spring rolls are amazing. Had the skirt steak noodles 2-3 times until they unfortunately took it off the menu, but replaced it with equally, if not better pepper steak.. Full bar, great drinks, had the lychee martini..delicious.. We come back on the regular.", "author": "Goran T."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-10-25", "description": "I have been a huge fan of National and it's predecessors: Joya and Song. And I'm sorry that I've never written a praising review in the past. This review was, unfortunately, prompted by a disappointing experience. \n\nOn this past Wednesday, October 22nd, 2014, which was a rainy day I should note, I travelled from my Ocean Hill neighborhood to National for the purpose of comforting myself with National's Red Curry with chicken along with an order of Chicken Noodle Soup. The soup was yummy as always. HOWEVER, the usually cozy red curry was anything but! The heat (spice) of the red curry was ABSENT as was the usually creamy texture. Not only was the spice missing the curry sauce was WATERY!!\n\nWhen I entered the restaurant I saw that their grade was pending! It couldn't be; the standards at National subpar!? \n\nI should have heeded the sign. \n\nI will, of course, give my beloved National a chance to redeem themselves. The chance could have been today, but it was just too soon. My feelings were still too hurt and so I opted for another neighborhood restaurant. \n\nI really need National to get back on top of their game. Seriously. Life without National would be dismal, but I won't pay for dismal food...that's for certain.", "author": "Pamela M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-10-11", "description": "Fine noodles and a quick and easy option pre- BAM\nnothing special and much better options in Brooklyn", "author": "Alice E."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-09-19", "description": "Was very disappointed in my dinner tonight. The food was without any flavor at all. Summer rolls had very little sauce, papaya salad didn't have any taste, and the chicken with basil dish was very bland. The chicken and Chinese broccoli fried rice was the only dish I would consider up to par. \n\nFrom the menus it looked like National was in the Joya/Song family of restaurants, but the food was nowhere near as good as either of  those restaurants, which I've been to many times over the years and always enjoy. Too bad as I had hoped to have found a new place before shows at BAM!", "author": "Robert K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-08-19", "description": "The food is pretty good and they have awesome lunch specials. Nice and spicy like I like. But I haven't been back because of their attitudes. If I am spending money and ask for some suggestions I expect that person to have some patience and oblige my request. Don't be a bitch,,, that's all I ask", "author": "Crystal G."}], "servesCuisine": "Thai", "priceRange": "$11-30", "name": "National", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "723 Fulton St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/i2Va7tG05YlCvRCJ0x_kBQ/ls.jpg", "@type": "Restaurant", "telephone": "+17185223510"}