{"aggregateRating": {"reviewCount": 396, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-10-04", "description": "UNBELIEVABLE. HORRIBLE SERVICE.  My boyfriend and I come here all the time, and today we came in with our baby in the stroller, he was sleeping, and they basically just couldn't accommodate us with our stroller. The hostesses actually asked if we could use a high chair to sit our sleeping baby! There was plenty of space, it wasn't full at all, they could've easily shifted a chair to make it happen, but they just did not try to accommodate us at all and were unapologetic.  Our business is obviously not important, so we won't be going back there!", "author": "Luz H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-28", "description": "Consistent and quick, I've been going to their other locations for years and have added National to  the mix as soon as they came to the neighborhood. They use to be BYOB! \nIt may not be the best Thai food but I will say that they're very consistent and better than other Thai spots near by, all the dishes are flavorful. \nI've had several dishes and usually fall back on the papaya salad, fried calamari and  glass noodles, very tasty! I also like their red coconut curry with veggies. A great thing about them is that they are very flexible if you want to sub things out (ex: get noodles instead of rice). They're also very quick! Food comes out piping hot and fresh within minutes and the prices are very reasonable. Service isn't the friendliest but they're efficient. \n\nThis location doesn't seem to get as crowded as Song or Joya but there can be a wait during the weekend. The ambiance is very simple, modern while their other locations are a little more trendy looking.", "author": "Emelyn O."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-05", "description": "Good thai, great lunch specials. Lunch specials are huge-dinner sized portions and come with an appetizer. I ordered pad thai and spring rolls and both were delicious. At some places the pad thai is too sweet for me, not here though. Service was good. I'll definitely be back.", "author": "Jennifer M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-27", "description": "I love this place. I've been here several times and they're always consistent. The pad thai is great and simple. I've had plenty of other things from their menu. Their calamari is cooked perfectly and not fishy or rubbery. Over all the prices are great and so is the food.", "author": "Ladybug X."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-26", "description": "Nice modern atmosphere/decor in the heart of Fort Greene. Looks new, recently opened perhaps? Like any Thai restaurant, we always order the same thing: Pad se ew, Panang curry, and curry puffs, cant go wrong! Always hits the spot. This time we also ordered mango salad, did not disappoint. What we like best are the prices! We left spending under $40 that included a thai iced tea. Blown away, found a new spot for those lazy to cook nights. Don't forget, CASH ONLY.", "author": "Janine D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-12-06", "description": "Oh my dear Yelpers...\n\nI only checked this place out because all your rave reviews... You guys need to chip in for my meal to reimburse me.... at least cover my tip.....\n\nNow the food itself was not terrible. I have had worse Thai food than this for sure. However my Pad See Ew was very mealy and very high in sodium. \n\nBlack people are known for having hypertension (high blood pressure)so I had to think were the Thai-landers slowly trying to kill me???\n\nThe spring rolls were pretty decent,  well for the price, I think spring rolls are like 3 bucks for two medium sized one's... The thai iced tea, which to I am purely addicted was so creamy and 100% perfect. \n\nHowever not only did I think I left with high blood pressure, I might have caught emphysema too!! The kitchen in this place is not closed off, the place is pretty cozy..so I was inhaling all of the smoke from the stir fry wok... The entire place was smoky!! Nothing is worse than a woman's hair smelling like food! \n\nI cannot go back to this place, I am out out healthcare insurance at the moment and I cannot afford to dine at a restaurant that is a liability..", "author": "Kentara J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-06", "description": "National is everything I expect in a great restaurant. Excellent service without needing to ask, chic and chill atmosphere, delicious food and varied menu, large portions and low-prices comparatively. Everything is excellent from their spring rolls to special mussel appetizer, they're spicy noodles entree and the 1/2 chicken + mango salad are amazing! I've come to this place a few times now, and each time I've had a wonderful experience with attentive and pleasant service. This is definitely one of my favorite spots in the neighborhood that I will continue to frequent!", "author": "Adriana S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-01-21", "description": "We've only ordered delivery from here, ever since Joya stopped delivering to our neighborhood.  The quality of the food isn't quite as mesmerizing as I remember Joya being.  \n\nSpicy fried rice was bland and not spicy at all.\nFried shrimp rolls seemed to still have shells on under the fried-ness.\nChicken was all very tough.\n\n...from previous orders, I remember the pad thai being decent, so I won't go so low as two stars, but this left something to be desired.", "author": "Jimmy O."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-05-02", "description": "My friend and I arrived early for a show at BAM and decided to walk around to find a place to get a quick bite.  National lacks any signage, but there seemed to be a good number of people inside, so we went in!\n\nMy friend got some sort of chicken curry, and I got tofu with chinese broccoli in oyster sauce.  Both dishes were solid, and portions were great for the price!", "author": "Helen L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-01", "description": "In my opinion this is by far the best thai food in Fort Greene / Clinton Hill. Not the most authentic (but what thai restaurant in NY is..), but everything is fresh and all the classics are really done well (pad thai, fried rice etc'). \nA great place to order delivery from as well. Food comes fast and is packed well in very nice portions. The only thing is that they have no computer so you have to give your address and phone number every time. BTW, they're cash only.", "author": "Yoni H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-24", "description": "I love this place. Their foods always good and the portions are huge. I would definitely recommend going here for lunch. For $8.95 you get an appetizer (a real appetizer, not just a piece of lettuce) and an entree (almost the same size as their dinner portion. Best part is you can pick pretty much any item on their menu as your lunch entree.", "author": "Amal S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-12-20", "description": "The space is very small and if it's crowded it's very noisy. The food however was amazing. It did make up for the lack luster attitude of our waitress who seemed to be having a bad day. This place deserves another shot so I will return to see if it is more than just good food.", "author": "Tamara W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-25", "description": "The food was great I had gotten curry puffs as my appetizer it was delightful it wasn't too much all the spices was lovely. For the entrée I chose the spicy noodles with chicken very tasty I get it all the time it definitely my go to when I go there. As for my drink I had a mojito very good also one of my go to. The setting is calm, intimate and very cozy. I love it there I recommend it to anyone that loves Thai food or want to try something different and new", "author": "Cassie Y."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-02-13", "description": "Very poor. Chicken was cooked, frozen and then barely defrosted.", "author": "Alex H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-18", "description": "First review in MY GOD AGES. But this little gem, just had to break the curse. \n\nCrowded to the max when we arrived around 9PM on a Thursday night, with all seats taken, but we didn't wait long for a 2-seater to open up.\n\nIt's loud and you're likely to hear the conversations to your left \u0026 your right, along with some not-so-bad music, but service is SUPER FAST (even with all tables full) - we literally got our meals 4 minutes after ordering, servers friendly and the food is outstanding.\n\nFive stars for the chicken coconut curry dish for $7.50, which by the way, also fed me for the following day's lunch. \n\nWhy only the four stars? I'm a wine snob, and the list just didn't cut it. But I hear they just got their liquor license so maybe they'll start to beef up their very mediocre pinot grigios and other non-descript wines on the list. Sales men ~ go get 'em!\n\nCash only.", "author": "Megan T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-15", "description": "I went looking for a new place to try out. I'm glad I chose National. The food was delicious, the salmon with galic sauce, broc and rice. My companion ordered a chicken soup dish with carrots. Yum! Small and gets packed quickly. Service was good.", "author": "Sade B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-12-19", "description": "Sorry to say, but Joya does not = National, even if the specials menu says JOYA!\n\nAnyways, this is the cleanest and tastiest Thai place in Ft. Greene in my opinion, but it had a few draw backs. \n\n1) Everything had a little too much sauce. \n2) No need for a sugar overload in green papaya salad or pad thai. Both dishes were served in very large quantity. Joya and Song have both mastered the art of a drier dish that allows the ingredients and freshness to shine.\n\nThese two negatives quickly disappear when you get a bottle of wine and 3 dishes for a grand total of $42. Awesome. Truly awesome.\n\nI think that National can really be a 4 or 5 star Thai spot. I look forward to returning and seeing how they mature as time goes on.\n\nOverall, I am thrilled that this family of restaurants has taken a chance in our hood.", "author": "Pamela S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-19", "description": "Went there a few weeks ago. Food came quickly and was hot. Waitress was pleasant. It's not the best Thai I've ever had, but it certainly hits the spot and the price is right. I'll be back.", "author": "James D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-06", "description": "I live close by so I go here often. I always eat in. The staff are excellent in my opinion... they get you what you need and they leave you alone to stuff your face, AND manage to refill your water without you even noticing. Magic! Fried calamari... order it. Don't ask questions, just do it. Make sure to squeeze a little lemon juice on them. My bf hates that for my entree I only order chicken pad thai, but I just love it so much. Why mess up a good thing, right? But from the looks of the different dishes he orders, and the happy looks on customers at surrounding tables, it's safe to say you can order just about anything here. The chefs are pretty cool too. My bf often sparks a convo with them. I'm too busy eating to talk. So there's that. Anyway, do yourself a favor and try this place!", "author": "Terkeisha Renee G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-08-23", "description": "So cheap, but delish. I mean, pad thai for $9? That's crazy cheap. Calamari portion was also generous with some delicious (store-bought) Asian sauce. The place has the faux-reclaimed wood/old-style bulb theme going on that was fine (but seriously so over-done and bores me to tears, really). \n\nThe main gripe was really with the curt staff - not sure if it's b/c of the second language issue or over-worked or personality issues (or combo of all). The staff was getting testy that we spent a good chunk of time (during a goodbye dinner for all!) though the place was less than %30 full on a Wed evening. \n\nI forgave them for all their downfalls, 'cause it resolved my pad-thai crave. If I lived in the neighborhood, I'd get the take-out all the time.", "author": "Ms S."}], "servesCuisine": "Thai", "priceRange": "$11-30", "name": "National", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "723 Fulton St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/i2Va7tG05YlCvRCJ0x_kBQ/ls.jpg", "@type": "Restaurant", "telephone": "+17185223510"}