{"aggregateRating": {"reviewCount": 396, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-07", "description": "National is my go-to especially when it's lunchtime. It's so close to my work which makes it really convenient for take out or if I wanna go with friends during my break or after hours. The space is relatively small yet welcoming. They have some pretty non-traditional decor which makes the atmosphere unique and modern looking. \n\nI know it's posted everywhere, but cash only people. (I believe there is an ATM right next door FYI.) Their lunch specials are good so if you're looking for a quick bite, get there early to avoid the crowds. Lunch special $10 includes an app + an entree from their regular menu. I love that! There's not as many restrictions unlike other restaurants that essentially only have pad thai, pad see yu, lad nar and green curry for offerings. I mean don't get me wrong, they're all stellar choices but sometimes I need more options. \n\nTheir Thai Peanut Salad is HUGE. They give you a nice serving of mixed greens, shredded carrots, grilled tofu and delicious thick peanut dressing. I could have this as a meal alone. I also ordered the Spicy Noodle (extra spicy) which was great. Thick broad noodles with egg, peppers, onions and tons of spice. Yum. Again, the portions are really big so unless you're starving... expect to take some of it home. \n\nI've had quite a bit from their menu. From the pad thai to their Gai Kraprow, I've never been disappointed.", "author": "Katie H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-02-01", "description": "I have had some pretty good Thai food in my day and last night I decided to try some local Thai food at National. It was the biggest mistake I have made in some time. First, I called to place an order and after being place on hold for 10 minutes, they hung up the phone. I called back and it took another several minutes for them to pick up. ( this should have been a sign for me). Finally, I got to place my order of Pad Thai noodles with shrimps and fired rice with chicken, an easy order, you would think. This was the most disgusting food I have ever had period! The noodles and the shrimp were tasteless and the rice instead of being fired was so gummy, gummy, gummy that it seemed like it was glued together. It was a very disappointing meal so disappointing in fact that I am going back to National today to return the food and hope I get a refund. It was really that bad. National Thai food not so good. I would give them a lower grade, if I could.", "author": "Oswaldo C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-25", "description": "LOVE THE CURRY from this place.\nPrices are good! the only thing I don't like is that is cash only", "author": "Ana L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-01-22", "description": "Ambiance is fine and so is the service, but the pad thai is goopy and sour and the chicken within is filled with oddly shaped pieces containing cartilage or something, ugh!", "author": "Gabriella K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-02", "description": "Same food as Joya and Song, but in a smaller venue. Food is great, and the space is nice, albeit small. \n\nLove the pad thai and curry puff balls!\n\nCash only!", "author": "Nick B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-07-14", "description": "I can't tell from my first visit if this is a great little restaurant with beautiful ambiance and uneven service and food or a bad restaurant with great ambiance.\n\nOn a hot day in Fort Greene, we headed out to another place and the lines were too long. There are four outside seats that were all taken and we sat inside and the AIR WAS OFF. OK it's a small soon to be sweltering restaurant.  We ordered snapper, which was fried well and had a mango salad on top. However, it is as if the two meals were done separately. The mango salad had a pickled taste to it -- which was tasty -- but it was not related at all to the fish. The fish also had not been fileted, so it was filled with bones -- which were hidden by the fried outside. Again, it was not terrible, just not well executed. (Snapper can be fileted easy enough.)\n\nThe Tom Kha Gai was very good. I'd recommend that by itself. Also, it's BYOB, and has a very small wine and beer menu as a result.\n\nThis isn't the best thai food I've had -- Sripraphai in Woodside still holds the crown and this isn't close -- but I am holding out hope that this restaurant was having a bad day. It's got a great space, even if everything else is still being worked out. \n\nAs for the service, it was decent -- but a heads up on the air would have been appreciated.", "author": "Robert B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-11-08", "description": "Just remembered why I stopped coming here. The people are rude and gruff. No thanks. Find me at Lantern.", "author": "Faye B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-30", "description": "So far stepping in the restaurant the food smells great, the service is good. They Took our order right away when we were seated. I got the curry puff it was delicious, we also ordered shrimp rolls which were in the shape of a shrimp. My meal was the pad thai meal.", "author": "Kashiro W."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-01-08", "description": "Given the restaurant was packed with people who appeared to be enjoying their meals we had high hopes that unfortunately were dashed.  We ordered chicken fried rice, calamari and spring rolls. The fried rice was bland and soggy although the sautéed cabbage in the rice was a nice touch.  Our calamari order was a generous but tasted bland. Most disappointing were the spring rolls.  They were very greasy and 99.9% filled with glass noodles-- no cabbage no shredded shiitake mushroom or bean sprouts just glass noodles and the dipping sauce was straight from a bottle.  We ended up just tossing them.  Prices are reasonable but I would prefer to pay more for better quality food.", "author": "Paula S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-05-06", "description": "Service is already wired when I step in.  Seats are so narrow that the lady sitting back to back with me is bouncing onto my chair for all the time. When I asked for hot water, they refused to serve hot water and took away my glass. Now I am really looking forward to the food m.", "author": "Jasmine L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-10-29", "description": "National food used to be AMAZING! I'm not sure where they went wrong but their food and service isn't great anymore. The Siamese fried rice used to be good now it's dry and taste weird.", "author": "Cashmere C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-09-22", "description": "Cheap and bland.  I would stay away from the curries and stick with the stir fried noodles or rice.  The curry was very soupy without much flavor.  \n\nService is good and quick.", "author": "Jon L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-26", "description": "Very good Thai food at reasonable prices.\n\nHad a lazy, late Saturday lunch here. Ordered the shrimp with chili thai basil sauce \u0026 mango salad (1/2) portion. Plenty of veggies come with the shrimp of course. You can order brown rice here, too. \n\nService was quick and friendly. Menu was standard--nothing mind-blowingly. Not overly large. Very simple and not overwhelming. Comfortably filling meal at great prices. Would definitely eat here for lunch or an early dinner. You'll be in and out quickly.", "author": "Ruwan J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-22", "description": "Popped in after a double feature at Bam. Very happy we did! This place is a-ok! Nothing particularly stunning or striking but the food was delicious, super reasonable prices ($8.95 for our entrees) and cute decor. Food came out quick, service was ok. Cash only but atm next door so have no fear! Would totally come back post-future Bam visits!", "author": "Elizabeth H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-05-20", "description": "The food is good, but the place is usually very crowded and your personal space is limited. They cram way too many tables in a small space. Check your receipt because they overcharged me on Mother's Day of all days.", "author": "Vanika M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-09-20", "description": "One of the most awful meals I've had in NYC. I had the green curry pad thai special. The 'pad thai noodles' were overcooked, soggy deadringers for the Cup of Noodle packages you get in bodegas. The curry was so liquid it was pouring out of the sides of the plate. The scallops tasted defrosted. Had a papaya salad as an appetizer that was soggy as well, and far too sweet. My dining companion had the spicy noodles, which were better. \n\nThe one star is for quick and efficient service. But maybe how quickly they bring the food out is part of the problem?", "author": "Sameer K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-09-06", "description": "Good ace in the hole Thai spot. Service is fast and the specials are always changing. Drinks are ok, and the cash only thing is bothersome (not sure if they changed that policy recently). Not one of primary Thai food spots, but for the proximity and prime location is a good bet for after work or Pre BAM meal", "author": "Andres D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-03", "description": "I visited this place on 12/1/16 for the first time. I ordered Tom ka with chicken...delicious; best Tom ka I've had in a long time. I had fried tiger shrimp rolls...excellent; crispy and cooked perfectly. For entree I had their spicy noodles with chicken (aka drunken noodles). It was the best I had in New York...almost as good as I've had in San Diego.  The atmosphere here is friendly and welcoming. They have good music playing. It is not a quiet place; its full of customer chatter. I am back for my second visit as I am writing this review. Give it a try!", "author": "John S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-29", "description": "Really solid food. The shrimp rolls, while tasty, are just shrimp (nothing added).  Pad see ew with chicken was very good and had a nice grilled flavor.  The pad thai with shrimp was also excellent, not too sweet. They give plenty of food so there was no room for dessert. Also, most comment on the thai iced tea- it was excellent! I will definitely come again next time I'm at BAM.", "author": "Reesie R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-27", "description": "Really enjoyed the food and the spring rolls! For great prices. The service was a little slow and we were constantly waiting for our server. However I am excited to go back and try more of the menu", "author": "Amanda M."}], "servesCuisine": "Thai", "priceRange": "$11-30", "name": "National", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "723 Fulton St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/i2Va7tG05YlCvRCJ0x_kBQ/ls.jpg", "@type": "Restaurant", "telephone": "+17185223510"}