{"aggregateRating": {"reviewCount": 396, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-08-09", "description": "Another Americanized Thai restaurant. Mediocre and cheap food. Calamari, not fresh, needed more salt, very bland with a hint of fishy flavor. Vegetables in the curry are all cut by medallion, thin and tasteless. If your ideal chinese dish is general tso chicken, this will be your dream place.", "author": "Caitlin R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-05-29", "description": "Very weird Thai food that did not resemble in any way Thai food that I've eaten anywhere else. Summer rolls with Dijon mustard, rather than peanut sauce and Pad Thai with this strange sweet flavor. Just bad.", "author": "Rosanne M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-26", "description": "Love love this place! Awesome fried squid and masmam curry! Only down fall they Dnt accept cards and have a limited bar. But if your looking for some awesome Thai food that's not that expensive, awesome atmosphere and cool wait staff, take a trip to national!", "author": "Innocence D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-11-13", "description": "I don't understand how this restaurant received so many stars.  The food is just plain awful.  \n\nI don't care how cheap the food is, it's was the worst Thai food I have ever tasted!", "author": "Vee B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-04-13", "description": "One word: greasy. \n\nMake that two words: HELLA greasy. \n\nService was polite, but the food was disgusting. Save your appetite for somewhere else.", "author": "Emma C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-03-04", "description": "National is one of the newest Thai restaurants in Fort Greene and situated just steps away from the G train subway stop. It is a good dining option near the BAM.  The style of the restaurant is modern minimalist.  It was crowded \u0026 noisy on a late Wednesday evening.  For my first time there, I picked an entrée off of the special lists which was Salmon \u0026 Chinese broccoli with 4 Chili-basil sauce ($13).  I enjoyed my meal very much and will be updating this review the next time I go there.", "author": "Kevin G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-06-16", "description": "The best Take Out Thai in Fort Greene and I've tried them all.  There are other places that have good Pad Thai than crummy other stuff or great curry and bland noodle dishes, etc.  National is pretty consisently good across the menu.  The Pad Thai is really good if you like yours on the sweet side more than hot.  The curries are really good and the apps are top notch (Sate, Spring Rolls, etc).\n\nPrices are cheap at about $7 bucks a dish.  Delivery is quick.  I've never eaten in the restaurant so I can't comment on that.\n\nI give it 5 stars relative for a Take Out joint.  It's not on par with the nicer sit down Thai restaurants though.", "author": "Franco G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-03-02", "description": "Went here on a Saturday afternoon to grab some lunch. I opted to do carry out and waited at the bar for my order. Pretty fast service which was a plus. I got home and proceeded to eat my meal. The brown rice was not cooked thoroughly at all and was inedible. My chicken and shrimp accompaniment was swimming in a thin, watery sauce. It didn't taste that great either. It wasn't packed with any delicious flavor that I'm used to from Thai food. It seemed as if the chefs just added chicken and shrimp to a ready made broth. I've had better Thai food at Sea and Thai 101. I won't be returning again.", "author": "Nifkaa S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-02-27", "description": "This is a great place to go if you are looking for a inexpensive meal before watching a show at BAM. Avoid ordering the seafood noodle soup unless you are looking to drink some diluted brown sauce with noodles. Also, the shrimp and avocado rolls are not to die for since the dipping sauce is just regular mustard and the shrimp was not existent. However, the Pad Thai was not bad. The texture of the noodles was acceptable and it had just he right amount of tang along with peanut taste.", "author": "Mai L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-10", "description": "This is by far the best Thai food I have ever eaten, in fact it is the best Asian food I have ever eaten. It is not too pricey and they have vegetarian options to die for. Absolutely everything is fresh and the place is very clean and tidy. The staff is pleasant and our food came out of the kitchen pretty quickly. The vegetable spring rolls with sauce are amazing and the peanut sauce with vegetables over rice (I ordered it sans chicken) is perhaps the best thing I have ever eaten. Suggestions for how to make the place a bit more enjoyable: Larger chairs would be helpful as I saw a handful of larger guests struggling with them, the restaurant was not open early on Sunday and I would love to have lunch here instead of dinner. We were parched and starving and had to wait to eat on Sunday, but I must mention it is always worth the wait. I have only been here twice, but this is my new favorite restaurant in Brooklyn hands down! I plan to bring clients and prospective candidates here to discuss business so that I can come back as often as possible with my extremely busy schedule.", "author": "Abigail M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-02-09", "description": "When it comes to take out, this has to be one of the worse places I have ever ordered from. While the food is great, the people serving are rude. They messed up my order on two different occasions and you would have thought that it was my fault. No apology, No concession, No nothing. Hello? I order by phone because I only get a half hour lunch, the least you could do is have it ready when I get there.", "author": "Paulette C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-02", "description": "I have never stepped foot inside of The National but I just came from an event where the food was catered by them and my goodness gracious the food was delightful and yummy!\n\nThe extent of my Asian cuisine and dining is late night/ fast food orders of Chinese and maybe once a year sushi.  I had Thai maybe once or twice in my life but nothing so great to remember but this I will always remember.\n\n The rice was perfect and a treat with every bite.  The seasoning and spices were just right.  I never had sauteed glass noodles and I am so glad I tried it!  Usually I do not like shrimp, but there were none left on my plate.  I am glad to have been introduced to The National.  \n\nEveryone who was present was given a menu and just by looking at the variety, prices and the fact that they have a number of alternative vegetarian choices, turned me into a future visitor.\n\nOnly sad thing is I was told they do NOT take PLASTIC!  Just CASH!", "author": "Toni T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-09", "description": "Had a great chicken green curry for takeout. Fast, delicious, affordable.", "author": "Universal R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-08", "description": "This is a great neighborhood thai joint and is a slight improvement on your standard thai fare. That said, I recommend going for the daily specials over the regular menu, which tends to be less flavorful (though still good). In particular, the chive pancake special, the noodle salad with steak, and the pan-fried whole fish were all great. \n\nThe restaurant is medium-sized and could accommodate a group if you called ahead, though beware that it is noisy. The price is pretty moderate. Note that they do take-out but do not deliver.", "author": "Chelsea R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-02", "description": "The Pad See Yue is amazing. I haven't had sit down service, I've either called in an order or sat at the bar, but never disappointed. The bar, though small, isn't bad at all. The bartenders are generous. The food on a whole is great though. Haven't had the entire menu, but all their noodles are delicious. Their fried rice is quite good too. Their sauce for the spring rolls, I have no idea what it is, but that things is gorgeous!", "author": "Aaron H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-10-08", "description": "Bland.\n\nIt's a shame - I love Thai food and Fort Greene could use a good option at this price, but everything I tried was incredibly bland. Spring rolls, noodles, curries -  all almost tasteless.", "author": "Miriam G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-25", "description": "I love National. The food is non-inventive, but it's consistently good (and sometimes even arranged very attractively!). It's also cheap and BYO. I don't know what else I could want in a restaurant.", "author": "Kathleen B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-01", "description": "While staying in town, I actually ate here twice. I thought the chicken pad thai was great! It wasn't soaked in an oily sauce and had wonderful flavor. The Basil fried rice also had a really nice kick to it ( the plain veggie rice was a little boring). All in all I had a great experience here, and it was quick!", "author": "kealy o."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-23", "description": "their mango salad is by far their best salad - which is not on the take out menu fyi - but you can still order it. an entire mango (maybe more) peanuts \u0026 red onions with a sweet however light dressing over romaine. \ni then always default to their spicy noodles with shrimp OR if i am feeling a curry - their spicy green curry with eggplant and bamboo shoots. \nps- im from CG but have had national on several occasions for take out and it tastes the same as joya/song to me...hooray that FG finally has a decent thai place!", "author": "Maia D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-01-02", "description": "Want some good, cheap, tasty Thai food? Well good old National does the job and does it well. Now the service is pretty standard here, but there's a ton of different options to keep you interested and willing to come back. It's always a good look ordering from here and honestly I've never had a bad meal. The portions are way bigger when you dine in as they seem to be really stingy on the take out. The pad that to me is a never fail.", "author": "Sonny A."}], "servesCuisine": "Thai", "priceRange": "$11-30", "name": "National", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "723 Fulton St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/i2Va7tG05YlCvRCJ0x_kBQ/ls.jpg", "@type": "Restaurant", "telephone": "+17185223510"}