{"aggregateRating": {"reviewCount": 396, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2019-01-20", "description": "National is my favorite Thai restaurant to come to when in Brooklyn. It's small and intimate which makes for a great date night spot or a place just to come for a girls night. \n\nWhenever I come, I make sure to order the calamari (it's a must) as my appetizer. I also always get their pad Thai as my entree. I either get it with shrimp or chicken and shrimp, I have them add some spice to it as well. \n\n\nThe service is always great when I come and the food never takes too long to come out.", "author": "Brittany F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-05-23", "description": "In the grand scheme of things, National is not a bad Thai restaurant. Their curries are average and their noodle dishes are okay, but there's not a lot from the menu or service that particularly stands out to me. I did feel their food was a little under-seasoned, despite the freshness of the ingredients. \n\nThe few times I have come here after school, the restaurant was pretty quiet.", "author": "Michelle C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-02-04", "description": "National is one of the many Thai restaurants that delivers to my neighborhood in Downtown Brooklyn. I wouldn't say I have any particular loyalty to National, but it's been a reliable option I've ordered from quite a few times.\n\nTypically, it's decent food but nothing radically special. However, the last time I ordered... was not their best day. The Pad Thai was almost white with barely any sauce. The curry was bland and tasteless, and the white rice was a ball of mush. \n\nIt pains me to say but after that experience, I don't think I'll be ordering from National again.", "author": "Katey G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-05-31", "description": "The food here is pretty good but the service is brusque at best and the environment is LOUD. I just measured it at 80db average peaking at 95.", "author": "Doug H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-01-11", "description": "I've been going to National for 12 years now, from the days I went to high school, college, and had a job nearby there. It's my comfort Thai spot. I'd say in all of downtown Brooklyn, National and Joya are the two best Thai spots, more so because they're sister restaurants so taste is consistent.\n\nIt is a low frills restaurant with simplistic decor, white tables and benches with candles lit all around. They've got a lunch special for $12 (app + entree) or entrees during dinner for $11+. I love the stir fry entrees and the curry. Generous portions and they modify based on how spicy you want it.\n\nIt's silly, but my favorite thing is the spice basket with the 4 spices. I don't think I'd come here if it weren't for the spices! They've got pickled jalapeños, ghost pepper, etc. Adds a lot of flavor to my dish! Ask for it if you ever stop by. (: \n\nMy only negative criticism would be that the service often lags. Time and again, I've had to sit around for 15+ minutes for the bill. The servers are neutral, not friendly or rude so it leaves for little interaction.", "author": "Ruby S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-12-21", "description": "Fresh food alert! This is my favorite place to get Thai food in Brooklyn! I've been going here for years and I have never been let down. It's great for delivery and for a cute night out.", "author": "Marley M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-08", "description": "The Thai people are known for seasoning some food but this place must have lost the memo. There is no honor in serving the tofu eaters a dish like the one pictured here. \nThey did absolutely nothing to make this taste good. It's almost like the scarecrow of dishes at this place; saying \"don't come any closer you vegans\". \nWhy do they think they can serve this and get away with it?\nThey took a block of tofu, cut it up, and deep fried it (probably in pork oil). No seasonings whatsoever. \nThe name should have warned me Tofu Tod. What is that? The nickname for some kid in Thailand that was bullied because he liked Tofu? Ugh!!\nDon't get it and be wary of other dishes containing unseasoned flavorless tofu. \nBye.", "author": "Kateria N."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-05-19", "description": "I used to adore this place. Had previously given it a five star review, but I am so sad to have to change that after months of disappointing food. I don't know what happened but all of a sudden a few months ago the quality of their food completely changed and the drunken noodles and pad Thai, both of which were previously go to orders for me, became borderline inedible. Bland and tasteless. The only reason I have given two stars instead of one is because the service is always excellent and take out is always prompt, but sadly that doesn't mean much when the food is terrible.", "author": "Lauren S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-07", "description": "I can't be the first person to stare blankly at the unbranded pane glass front window. However, once I decided to just walk into this sign-less establishment, things went up from there. :)\n\nI got the Pad See Yue and it was delicious. The noodles and Chinese broccoli were very fresh and the sauce was clean.\n\nThe music was a bit too loud, but besides that, I enjoyed my lunch here.\n\nAlso, they do take credit cards now.", "author": "Matt H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-20", "description": "Came on a quiet Saturday. Ordered the Kang Nuur(beef in red curry) and the mango salad.\n\nMango salad? Legit.\nKang Nuur? Legit.\n\nDefinitely give it a shot. Good portions and fairly priced. \n\nI attached two beautiful photos of the dishes. Enjoy.", "author": "Simon Q."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-27", "description": "The shrimp and garlic sauce dinner is delicious! As well as the atmosphere very clam feels more like a comfort setting. Eating their at night is definitely a must in order to feel a vibe because the candles are lit and lights are dimmed. Over all the prices are reasonable \u0026 restaurants staff was extremely friendly.", "author": "May'Ling G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-08", "description": "Without a doubt the food here is delicious with a nice ambience to boot. I would recommend the fried calamari and the tiger shrimp rolls. Oh so goooddd!", "author": "Dae D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-05-10", "description": "Good news they are accepting credit cards! This is maybe my third time here sit in \u0026 take out combined. We ordered the Shrimp Pad Thai, Tiger Shrimp Rolls(app), \u0026 the BBQ Wings(special app). The food is ok. But if was tying to introduce someone to Thai Food I would not take them here. They are just a little low on seasoning across the board. On this last visit the restaurant was slammed. So now I had satisfactory food combined with rushed, distracted service. It was not a good combination. All that said nothing wrong with this restaurant just not anything particularly great. Except maybe if you want to sit down and have a fast and reasonably priced meal before your show at BAM then this is the place for you. Close by. Pretty fast and good prices when you consider the neighborhood. I will may go back if I need to, but I have to agree with Kateria N. their vegetarian fare is especially weak.", "author": "Me 2."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-28", "description": "Great food! Pleasant service \nHad a big group and they seated us and all food was excellent\nHad the half chicken salad with mango and sticky rice soo good.\n\nChicken curry puffs were yummy.\n\nTried the mussels and will go back for that\nFried ice cream is  a plus", "author": "Kimp P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-28", "description": "This place is super laid back. The menu is extensive. There are actually multiple menus and so much to choose from. Everything tastes delicious and flavorful. \n\nThey have so many options that everyone can find something they like. The staff was good enough and got the job done. \n\nThe prices are resonable. If you like Thai food this place is a must try.", "author": "Kimberly G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-12-22", "description": "I'm not a huge fan of Thai food but I came here the other day with my sister and we thought it was great. \n\nIt's kind of a hidden gem and you will pass it if you don't look up! But it has a very calm ambiance and the waiter had a lot of recommendations for us to try which is great since it was our first time. We got fried shrimp rolls and a salad with peanut sauce. The shrimp rolls were cooked perfectly, and the peanut sauce went perfectly with the salad. \n\nFor dinner I got chicken fried rice; which is a huge plate with tons of rice chicken eggs and veggies! VERY GOOD! and I had a ton left over to take home and ate some the next day by throwing it on a pan! My sister got the shrimp plate with white rice; she was starving and finished the plate, the sauce was an actual sauce we could eat with rice and the shrimp which was perfectly cooked!\n\nWhen the check came it was only 30$! Great price for some really good food. \n\nThe only complaint I would have is the space is a bit small so you can clearly hear conversation from others around you. Maybe the couple to the left of us was just really loud! \n\nDefinitely would recommend for a small date night, or out with some girls!", "author": "Tekisha H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-04-13", "description": "This places food is alright. But the woman behind the counter is incredibly RUDE. Constantly too. I work nearby and this is not the first time I've been to this restaurant. She's so rude and has an attitude for no apparent reason every time I visit. My mother had noticed it as well as she has been to this restaurant multiple times and has had similar encounters with this woman. She gave off a disgusting snooty attitude when I ordered my food today. I asked for a empty rice container and she looked up from her phone at me and said \"no\" with an attitude when I know for a fact that they do have them on site. That turned me off to this place other than the fact that they don't take the time to clean their small shrimp. On top of that she got my order wrong and tried to act like it was my fault. I asked for rice noodles clearly the first time I ordered, and then I said it once more before she swiped my card. I said \"with a side of rice noodles right?\" And she looked at me and replied \"yes\". Once I got my order it can't with rice, which was obviously not what I wanted or ordered. When I went back she gave me an attitude and and said \"you said you wanted rice\" to which I replied \"no I didn't which is why I asked you twice if you put in rice noodles\". If you like kind and correct service I wouldn't recommend this place. If it's not fixed by the next time I visit best believe I'm speaking to the manager. In my work I encounter a lot of people who ask me where they should go for lunch. I'll gladly let them know where NOT to visit that's for sure.", "author": "Ja'Nice G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-05-02", "description": "I had a few really good experiences so I'm giving 3 but our last order came almost an hour late and cold.  We tried to cancel earlier but they insisted it was coming within moments and they were very dismissive and rude. I'm kind of sad because I really liked the first few orders But I will never order again..", "author": "Marci D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-01", "description": "I had the red curry and it was sooo good! They deliver here but they don't open until 5. Once 5:00 came around delivery was quick. I also tried the chicken puffs and they tasted soooo good. The ribs are dry rub but they were good. I would highly recommend the red curry, not too spicy", "author": "Amy B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-21", "description": "We dined here before the show at BAM and were surprised by the quality of food. We ordered spare ribs (A), shrimp scallop mussel pad Thai (A) and spicy seafood fried rice (B-)", "author": "Grace Y."}], "servesCuisine": "Thai", "priceRange": "$11-30", "name": "National", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "723 Fulton St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/i2Va7tG05YlCvRCJ0x_kBQ/ls.jpg", "@type": "Restaurant", "telephone": "+17185223510"}