{"aggregateRating": {"reviewCount": 396, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-04-18", "description": "From the moment we walked in we didn't feel welcome at all, staff were rude as the host and waitress rushed us from the sit down to leaving the restaurant. I ordered the Tom yum which lacked flavour while the salmon and avocado summer roll was bitter. Combining that and the terrible service I won't be back here again.", "author": "Šerenä F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-14", "description": "Disco Thai!\n\nLove the dark, clubby atmosphere and mid-2000s soundtrack.  \n\nThe menu is priced better than most take-out restaurants in the neighborhood and the food is much better.  A good deal of guests were coming by to pick up their take-out from the kitchen counter.\n\nHad a huge, gorgeous plate of mussels with chunks of crisp-tender aromatic veggies in a green coconut curry broth ($8.95!?!?!?!?), fried spring rolls, tofu with chinese broccoli and pad thai with shrimp.  \n\nEach dish was thoughtfully plated, served with well-seasoned sauces and/or condiments.  Overall this place is a great value with most dishes under $10.  There is a lot of redundancy/overlap in ingredients on the somewhat difficult to read menu.  Pretty much pick a protein and a type of curry and you're 90% there.\n\nNotes: 1) Cash only. 2) They have a bar!", "author": "Michael L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-04-04", "description": "For a hasty bite of something before a show at Barclays this will do as an efficient before-show meal because it is not crowded and the food is served pretty fast.   I would do it again in that context only.  But if dinner is the main event of your evening and you are looking for quality beyond halfway decent then this is just not going to cut it.    \n\nMaybe we just ordered the wrong things but it was all just kind of wrong tasting.  contrary to the other reviewers accounts I didnt bump into anything that tasted fresh.   I ordered the soup that one reviewer praised but the broth tasted like your typical campbells type salty chicken broth without veggies in it.  The noodles in it were typical american soupy drowned pieces of wheat noodles.  nothing about the soup said it came from a thai restaurant.   My dining companion ordered the half chicken with sticky rice and mango salad.  and summer rolls.   \n\nThe chicken had a rather musty flavor and was dry.  The slab of sticky rice it came with was too firm and had a very chewy outer layer with hard corners (suggesting it had been prepared several days ago and molded into slabs that were then kept in the refrigerator and rewarmed for use.)  the summer rolls were \"off\" somehow that I cannot quite put my finger on, maybe these were old too.   In any case neither of us hungry people were interested in eating more after tasting the first slice.  \n\nI'm the kind of person who will eat compulsively while talking and not even notice that I have cleaned every plate on the table of any leftover tidbits.  Really I can plow through anything even remotely tasty,  not just when I am hungry but even way beyond my fullness point (such a bad habit)  so it really says a lot that my hands quit reaching for this food after a few bites.  It just didnt taste very good.   If i wind up back here I will certainly not order any of these things again.  \n\nI will say that the staff was nice and they plugged in my my phone to charge for me. Also I liked that this seems like the kind of place you can comfortably eat alone with earphones on like the guy at the table next to us.", "author": "Jessica D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-09-09", "description": "YIkes!\n\nI had vegetable spring rolls which actually had not vegetables (not even cabbage) and was so greasy everyone in my party could see my fingers glistening from across the table, it was pretty disgusting.\n\nI also had spicy noodles with shrimp, which did not have even a hint of spice. I was very disspointed in the entire experience. \n\nThe women I dined with also got things they ordered regularly and complained of the food not being up to par", "author": "Simone M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-04", "description": "Friendly and attentive service.  For being only a block away from my apartment the Spicy Noodles (although not very spicy) were very good.  And it was big enough where I could take home the other half and have dinner for tomorrow night!  (most likely will turn into Saturday lunch.  \n\nSo... $11 got me two meals and a nice atmosphere nearby to have some nice Thai.  I will definitely be back multiple times to try out more from the menu.", "author": "Jason C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-08-15", "description": "Passed by this place every day on my way to the G train and never really knew what it was. When I found out it was a Thai place, my friends and I decided to try it out. It was a hot day and it was rather hot inside too, not sure if it's a daily thing (no AC?). \n\nThe food was okay. General tasting, nothing outstanding. \n\nThe service was pretty crappy, our water wasn't refilled and we had to work to get the attention of our waitress so we could get our check. \n\nOne thing that REALLY bothered me was the smell. Again, I don't know if it's a daily thing but when I was there, there was this strange smell that I can't even explain. But it was really bad and made eating unpleasant. There was barely anyone else in the restaurant so I don't think it was an an outside source.", "author": "N A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-10", "description": "My boyfriend and I went to grab dinner for an early Valentine's day celebration! He got the pineapple fried rice with chicken and I got the spicy noodles with chicken (it wasn't that spicy but I added the pepper flakes they had for an extra kick). I'm happy we decided to go there. Next time, I'm getting the pineapple fried rice. I took a bite out of my boyfriend's and it was so good! Their prices are fairly reasonable and they give a good portion. Definitely recommend, with or without a date!", "author": "Arifa A."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-09-25", "description": "I walked in yesterday and did a take out order.\n\nas i lingered around the back of the restaurant, i saw the cooks prepare food. was not impressed with their sense of hygiene. My dish was served as a dine-in so they flipped it into a container as i was looking on. I noticed the lady poked the lemon slice out of the plate with her bare finger onto the silver dish shelf and then placed it right back into the container with the food. Im not overly picky about these things but definitely not something i appreciate seeing being done to my food.\n\nthe food itself was mediocre at best.\nI had their shrimp dumplings which were all broken when i took them out of the container to eat. all the filling were outside of the dumpling.\ni also ordered the spicy noodle dish with shrimp. it wasnt spicy and there were barely any shrimp in it. \n\nI would not go back to this place.", "author": "Mohammad A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-25", "description": "Best dine-in Thai spot in the area. We go to National on a monthly basis, if not more, and have never had a bad experience! They have a well decorated indoor dining area, as well as a handful of sidewalk tables during the warmer months. The staff is efficient and friendly and are happy to allow you a relaxing meal, or to move you along quick if you're in a rush. The lunch specials are a great bargain and the dinner prices are still reasonably priced. We typically go for the pad see ew or the spicy noodles and they're consistently delicious. The drink selection is varied as well and there's a small bar to perch at if you're just interested in an appetizer and drink. I believe they are cash only but there's an ATM in the bodega next store if you forget!", "author": "Amanda B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-03-04", "description": "I ordered the pad Thai with noodles and I simply asked if the kitchen would sub the regular noodles with the flat noodles. 3 minutes later my food is on the table but my boyfriend's food was not. I was surprised until I took a bite and realized that the noodles were old. I kindly send back and the guy yelled at me", "author": "Mikko J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-15", "description": "If you like Joya, then you will like this place. I believe the owners are the same. Service is good, the servings are large and the price is right. The location is on point as well if you hang or live in the Fort Greene/ downtown Brooklyn area.  We ordered the calamari, seafood fried rice, the pork salad and a noodle medley (I forget the name).\n\nWhen I went it was an early afternoon on a Sunday and the crowd was light as expected. It  was cold out and I kept being distracted by the dog owners who tied their dog up right outside the door and sadly tried  to enter the establishment several times even being hit by the door by accident by a patron entering the restaurant. Even a worker felt bad for the dog and offered a bowl of water, which the owners declines as they sat leisurely eating lunch. A las this is not a review of mean owners, but of a tasty meal with good friends. \n\nStop in, you won't regret it.", "author": "Nyota W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-14", "description": "This is what pad Thai is supposed to taste like. It was delicious. I world definitely return and try their other offerings...", "author": "Genevieve P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-21", "description": "This is one of my favorite places for Thai Food in Brooklyn (sister restaurants included; Joya). The food takes traditional thai and adds in really great produce. The prices are great and service is knowledgeable.", "author": "Anisa H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-11-05", "description": "Shittiest pork fried rice I've ever had. Thought the Thais were experts at cooking their meat? The pork were awkwardly huge for a fried rice.. I'm amazed I didn't lose my teeth digging into the meat, yes, it was that tough! The meat felt like a piece of leather. And absolutely no flavor.. Had to ask for hot sauce and even then it was lack luster. Complained to the wait staff about it \u0026 they asked if they could change it for me half way through the meal. Thought they would at least reduce the charge of the rice to half? But nothing.. Charged us full price. That's pretty sad service for a new restaurant that's pending grading!", "author": "Archana R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-25", "description": "Ok, after the tenth time of frequenting this restaurant, I felt I had to write a review. This is probably my favorite thai place near downtown Brooklyn. The prices are very reasonable (though, cash only!) and the food is very very high quality. Since this is my go-to, comfort-food Thai place, the variety of the stuff I've ordered is probably limited...but I have an n=9 of some of the dishes, so I can definitely comment on the consistency (heyy...that's something!).\n\nMy favorite dish is the tofu pad siew--the noodles are wonderfully chewy and the tofu is light and perfectly fried. The sauce is not too sweet or salty, and they give a fairly generous portion of broccoli. My partner has ordered the different curries with beef, eggplant and chicken, and they've all been excellent. Another favorite is the Tom Yum soup, which has been something I've looked forward to on many a polar vortex day.", "author": "Rachel T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-03", "description": "Had catered lunch from here today it was wonderful. I had the Pad Thai with shrimp plate. The moment I began to eat the food smelled wonderful, the pieces of peanuts were not too big or too small and the dish was very flavorful. Of course, there weren't that many shrimp but it was still awesome everyone enjoyed it.", "author": "Sheira C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-21", "description": "Delicious cash only spot, great green curry. Good prices, decent staff. I'm a fan.", "author": "Alice C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-29", "description": "I came here post movies for dinner. We were promptly seated right and given menus. For a cheap Thai place, I was surprised by how sleek it looked inside. They also had tables outside for seating however they were all taken. \n\nWe came in with the intention of just ordering something to share but it was all so cheap that we decided to just get our own entrees. I ended up order the pad see ew which is just broccoli, large flat noodles and beef. My boyfriend got the Kang Panang Gai with chicken, peppers in a coconut curry sauce. I liked it and he loved it. I just can't handle spicy. There was so much food so we took it to go. \n\nWell the next day at work, they mixed up our orders. We never bothered to check the packages we got (we asked for 2 bags) and instead of eating my pad see ew which I LOVED, I got the spicy chicken instead...I was so sad. Oh well.", "author": "Jane R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-18", "description": "Had been looking for a cheap great Thai place for a while and this place really hits the spot!\n\nThai is my favorite cuisine and I was totally impressed with this place; the authentic choice of food and drink, the surroundings, the staff and of course the prices.\n\nMy only but - there is no sign outside so this place could be anything! No wonder it took so long for me to find it!!", "author": "L J."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-02-09", "description": "I want to like this place, especially since it's conveniently located for me, but the food is fairly average and the service is especially mediocre and inconsistent.  Even for something simple like calling in an order for pick-up, the staff are often unprofessional and inattentive, sometimes bordering on rude.\n\nI think the mediocrity and complacency results from them being in a good location and the food/service is good enough to people people coming back.\n\nOther dings: one time I showed up in person to place an order to-go 20 minutes before they closed and they turned me away.  Also they're cash only.\n\nHopefully I'll find another place to get my Thai food that gives more of a shit.", "author": "Florecita M."}], "servesCuisine": "Thai", "priceRange": "$11-30", "name": "National", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "723 Fulton St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/i2Va7tG05YlCvRCJ0x_kBQ/ls.jpg", "@type": "Restaurant", "telephone": "+17185223510"}