{"aggregateRating": {"reviewCount": 396, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-27", "description": "One of my favorite Thai spots in the downtown Brooklyn area. The food is exceptional in taste and presentation;I enjoy having lunch there for this purpose beautiful plates great tasting food and here is the best part the prices are even better.", "author": "Ces A."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-07-05", "description": "My first Yelp obituary:\n\nMy past 4 trips to National have become increasingly more disheartening upon each bite. I am sad to let it go. \n\nTheir quality and flavor has exponentially decreased (read: jumbo shrimp has been replaced with minute shrimp that can barely be seen). The food is rarely spicy even if you ask for it spicy. They skimp on vegetables and protein and overdo the noodles, rice, green peppers, and especially onions. \n\nThey were amazing when they opened a few years ago. I added a star for nostalgia. I will have pings of memories of their yesteryear when I find my new local Thai spot.", "author": "Fazeela S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-08-03", "description": "As it's more conveniently located to my residence than Joya is, I've been coming to National for years. It's a straight shot to Atlantic and then a two blocks away. Never had a bad time here until yesterday....\n\nThis place used to be better. It is a great spot for a quick date night, as the food is delicious (per Joya standard), but the service last night was where i deducted stars. We were seated, put in our drink orders and had to wait about 10-15 mins for them to come to come to the table. It's like we were forgotten. The place wasn't that busy, so it's not like there was a reason for this. Joya is bigger and was busier on the Friday night that i went, and the service was still better.\n\nThe food was great as always, but i can't stand unnecessarily slow service. I'll probably stick to takeout since this is one of the better Thai options near me.", "author": "Karsten V."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-11-08", "description": "Stopped by for lunch for 3 on a weekday\nNo reservations and we're seated immediately \nPretty empty by 2pm \nI was starving and excited for some Thai food.\nThe lady who served us is Thai (from her accent) but unfortunately the food was not authentic. At all.\n\nI ordered a lunch set that came with:\n\n- starter - choose between a few options (house salad, mango salad, soup) and I chose the tom yum soup\n- main - vegetarian pad see eow\n\nThe tom yum was sad. A sight of onion slices and mushrooms swimming in oil speckled broth.\nNon spicy, unsavory broth that was bland and unappetizing. No zing of lime, no lemon grass flavor. Mushrooms in the soup were undercooked.. \nperhaps this was toned down for the American palate, I thought. \n\nThe pad see eow was a monumental fail.\nNothing reminiscent of those in Thailand or even rest of NYC! It was more like thick rice noodles fried with Asian black sweet sauce. Zero flavor, super oily. \n\nThe upsides (thus 2 stars) were that my noodles had quite a lot of tofu pieces and the price was pretty reasonable for a starter and main for lunch. \nService was also prompt and nice but... \nOtherwise, never again ):", "author": "Jolene H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-28", "description": "National is one my favorite Thai restaurants. If you walk too fast down the street, you might miss it and it's easily a hidden gem. Every meal I've had here has been great and they always have plenty of options and specials to choose from. I normally skip out on dessert here but I recently tried the fried ice cream and it was a hit with my friends. Their spicy chicken basil dish is my fave with the right amount of heat, vegetable and enough rice to go around.", "author": "Casandra R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-05", "description": "Always busy! At Lunch and dinner, rarely see that in NY. \nGood Thai food I have had better red curry else where so need to try something else because they are always busy. \nQuick take out, well packaged. Friendly though they did laugh at my fiancé when he mispronounced something", "author": "Carsen B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-12", "description": "After gathering books/CDs from Housing Works street fair in Manhattan on Sunday, we needed lunch so we drove to National in Brooklyn (owned by the  Jaya people which I never tried.)\n\nSmall and relaxed as most people were probably at the beach.. Had the vegetable Pad Thai . Friends had the chicken and mango salad.. Both were fresh and delicious  (Yes we sample each dish) Prices were very reasonable", "author": "Esme J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-09", "description": "This salad was one of the best ever. It was so flavorful. The chicken was delicious and tender. I can't recommend this place more. It was very clean and the service was great. I will definitely be back and tell others in person because it was just so good. Also the price for this was great. It might be because it's around lunch.", "author": "Alissa S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-02", "description": "Curries and fries rice are delicious. Great lychee martini. Love this place it's our go to Thai spot :)", "author": "Reuben O."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-02-17", "description": "I just can't seem to get a good meal at this restaurant. I've been here a few times, and have never been satisfied. The service is good and the ambiance is nice. But the food is always too salty and just not tasty. Last night I ordered beef with broccoli but had to send it back because the meat was over cooked and as tough as shoe leather. My friend had the Pad Thai and it came out burnt! The spare ribs  we had for our appetizer only came to life once we doused them in peanut sauce. One thing I did thoroughly enjoy was my cocktail. I ordered a cosmo and it was delectable,  citrusy  and strong. I had two. They were the best part of the meal. I think that they're always so busy 'cuz the location is fantastic and I am unaware of another Thai restaurant in the area. I would definitely go back for drinks, and maybe an appetizer if I was starving, but not for a meal.", "author": "Arlene J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-06", "description": "National is one of those places that I can always rely on for a solid meal. As other reviewers have mentioned, the quality of the food has dwindled just a bit in the last year, but the portions you get can't be beat for the price you pay. I love their curry puffs, tom ka gai (coconut soup w/ chicken \u0026 mushrooms), and pad see ew. \n\nThe staff there is also a huge reason why I keep coming back. They've always been very friendly and efficient. Many of the wait staff recognize the regulars. \n\nIt seems to be a pretty popular dinner date spot. The space isn't the biggest, so expect a short wait on weekend (and some weekday) evenings. It's also cash only so be prepared!", "author": "Jocelyn M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-02-27", "description": "I wasn't really impress with the food it was decent i've had better thai food. i ordered he basil sauce not knowing it was going to come with small shrimps and the peppers and stuff was just excessively cut too big and wasn't sautéed enough to my preference", "author": "Temitope S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-17", "description": "THE BEST Thai food I've ever had and I'm from France. \n\nSeriously come here every time I'm in New York. Get the pad Thai or the pad see yoo.", "author": "Charles-Edouard D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-13", "description": "This place reestablished my love for Thai cuisine. They make these chicken curry puffs (think Thai empanadas), that I had to re-order at the end of my meal. Yes, to take home, after I had eaten one whole puff and a full meal. I ate them later. Don't judge me till you've tried it.\n\nOf course we had other items from the menu... Green coconut curry with chicken and vegetables... glass noodles with veg. All were really great and came out quickly.  It's no wonder the place was packed the whole time we were there.", "author": "Mike M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-02-18", "description": "Service was fine; food was like if your college roommate wanted to try cooking Thai food for the first time. I've worked in a few Thai restaurants before and eat Thai food very often and the pad see ew was just not good, though I ordered it thinking \"hard to mess this one up\" after reading some sub-par reviews. It inexplicably came with a lemon (which is the first time I've ever seen it served that way--soy sauce and lemon don't really mix) and it was over-seasoned with garlic yet under-seasoned with soy sauce, which might explain why other people complain about the bland taste. The lighting in there erred on the side of being too dark to read the menu and the bad ventilation in there means you're smothered by the smell of smoky stir fry. Would recommend trying Nourish in Prospect Heights or Born on Flatbush over this any day.", "author": "Lori K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-05-26", "description": "I had ordered from this restaurant in the past and the quality has definitely deteriorated. \nI order the fresh thai rolls and kaang nuur, sliced beef with eggplant, zucchini, bamboo shoots, peppers \u0026 carrots in a red coconut curry sauce.\n\nThai rolls were bland and not fresh. Its clear these are prepared earlier then just sit there until someone orders them. \n\nThe beef was very tough and there were fewer than 5-6 small pieces of beef in the entire curry.\n\nWhen I called I told the lady that I had been pleased with the quality before. She said that the beef should be tough and overcooked. That's the way its prepared. I have been to Thailand and have eaten at many Thai restaurants in the city.  This dish is not prepared this way and the quality of the beed is inferior. \n\nI would avoid this restaurant.", "author": "Michael S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-10-21", "description": "Food is delicious nut the service staff is rude and they charge you owe refill of soda. Meanwhile they give it to you out of the gun and the cup is loaded with ice. $2 per soda for a small glass loaded with ice is a joke. Hope management reads this and rethinks their policy on this as the food is on point.", "author": "Robert G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-06", "description": "Yay! We've been looking for a good Thai restaurant near us for a while. I ordered spicy noodles and pad see yue (both with chicken) to go. The prices have gone up than what you see online ($9.95), but we had no complaints because the portions were sizeable and made with good quality ingredients. We scarfed down our food. \n\nThe pad see yue is one of the better ones that I've  had. I like that the greens they used were Chinese broccoli. The spicy noodles were not spicy at all, but they were delicious. \n\nThere's no lunch special and they now accept credit cards.", "author": "Elle P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-18", "description": "The food is very mediocre but because it is close to BAM and the staff is nice I gave it 3 stars.   The summer rolls had a tough wrapper, and its contents was uninspiring.  The Pad Thai was overly sweet with a thick sauce.  The rib appetizer was dry.  The stir fry was bland.", "author": "Brooklyn S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-28", "description": "Wanted Pad See Yew but without chicken or beef. Checked the Vegetables section to see if they offered tofu in any of the dishes and then BAM*...the exact dish I pictured in my Meatless Monday mind: \n\nTOFU PAD SEE YEW with Chinese Broccoli!! ($8.95) ::angels singing::\nOrdered this to go, service for take-out was prompt \u0026 friendly.\n\n*BAM (Brooklyn Academy of Music) is located very close by.\nTasty dish. Will return!", "author": "Grace P."}], "servesCuisine": "Thai", "priceRange": "$11-30", "name": "National", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "723 Fulton St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/i2Va7tG05YlCvRCJ0x_kBQ/ls.jpg", "@type": "Restaurant", "telephone": "+17185223510"}