{"aggregateRating": {"reviewCount": 5, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-09-11", "description": "Great Lunch Deal!\n\nWe had a Bento Box Office Bash today and the sheer amount of food you get for $9 is a refreshing change from the underwhelming overpriced sandwiches found elsewhere in the neighborhood. \n\nThe Mango Chicken is delightful and the rest of the food tasted reasonably fresh.", "author": "Maury P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-24", "description": "Scandalous!  Grimaldi's was closed on the day that we went due to electrical problems....NOoooooooooo......so what do you do when you're hungry?  Go somewhere nearby....with Grand Opening banners hanging all over the front of this historical building that a new asian fusion restaurant has opened...we decided the next best thing to pizza would be asian food??? No but i was hungry so it'll have to do.\n\nGreat decor and nice place though it was quite empty.\n\nLunch special is either two rolls for 10 dollar or three rolls for 12 dollars or the bento box special for 9 dollars.\n\nA NINE DOLLAR LUNCH BENTO BOX SPECIAL -craziness!!!\n\nI ordered the sashimi bento box -started with the tom yum soup -a generous portion and the bento box had 3 pieces of salmon -two tuna slices and 3 'whitefish' slices.  2 goyza dumplings, a salad, rice and three Californian rolls.  I was full after that!\n\nThe fish was extremely tender and of good quality -surprisingly one of the best deals for japanese I've had in nyc.\n\nMy friend ordered the roll special -they were actually quite small and not that impressive -so the bento boxes are definitely the way to go.\n\nSo -help a nice place out!  Cheap good eats!", "author": "Grace H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2010-03-27", "description": "I went to Grimaldi's for the first time and realized it was cash only. So I stopped next door, only to be shocked that Toro's was robbing me to use their ATM! $4.50 for their transaction fee!? Shame on Toro! Don't go near this place or you'll be robbed blind!", "author": "Jamie C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2007-08-05", "description": "With a friend in the 'nabe for lunch, and a long and arduous line in front of Grimaldi's, we decide to try out Toro - a corner bistro in an interesting space. The decor is nice, it has a long \u0026 winding bar that is the centerpeice of the front area. Although I didn't go up there, it also seemed that there was upstairs seating, in these rooms that almost float above the rest of the space. We sat outside, where there were three tables (with umbrellas) situated in the parking lot between it and aforementioned pizza place. I ordered the steak, which was well done in spite of being ordered medium, but besides that was flavorful. The service was slow (but it is a lazy Sunday, afterall) but the prices reasonable.\n\nEdit - their bathroom (which is a one seater) doesnt have a lock, but a nice little sign that says \"please knock as the bathroom may be occupied\", but who really reads the sign when one is ready to break the seal? Fine for the urinals, but if you need to do the 2, bring a lookout.", "author": "Paul W."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2009-09-29", "description": "My husband and I ate here for lunch. We were at a local festival and we were hungry and did not want to wait for Grimaldi's next door. We were seated promptly though space was tight and hard to walk in and out of without asking other patrons to move from their seats. They had seated a party in a table too small and one of their party had to sit in the aisle. The menu was very limited in options, though it may have been due to a lunch menu. I had the Brooklyn Classic burger with sweet potato fries and my husband had the BLT sliders. Our waitress took our order but different people brought our food, cleared our table and refilled our drinks. After she took our order we did not see our waitress again until we were completely finished with our meal She did not even come to check that we were satisfied with our food and when she came at the end of the meal we told her we did not want anything else and that we were finished. You would think that she would promptly bring our check so we could leave and free up a table, but no, we then waited a good 20-30 minutes for our check. We wanted to check out but we could not find her for our check and ended up asking the hostess and waiting some more. Once we received the check and I handed our waitress my card it was another good 20 minutes before she brought my credit card back, and this was after asking twice for it. They made no apology for our wait and actually the waitress seemed upset that we requested for her to return my credit card, though after the 45 minute wait I admit that I did snap at her at little. This made me nervous about why it was taking so long, and what they were doing with my card. The service was not good. The sweet potato fries were yummy, but the rest of the meal was forgettable. It made no impression. I will not return to this restaurant.\nAlso it looked like the restaurant was Asian inspired but I did not find anything Asian on the menu so I am not sure about the Bento box that everyone is talking about as it seemed to be mostly salads, burgers, and steaks and chicken to me, pretty much American Fair.", "author": "Heather D."}], "servesCuisine": "Japanese", "priceRange": null, "name": "Toro", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": null, "@type": "Restaurant", "telephone": "+17182460088"}