{"aggregateRating": {"reviewCount": 8, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-03", "description": "I'm a green juice and smoothie fanatic so after visiting the typical nearby tourist attractions, my friend brought me to Juice Press so I could recharge, re-hydrate, and get something delicious and nutritious!\n\nAt first I was a little hesitant and confused - like excuse me, is my friend trying to trick me and trying to get me to sign up for an Equinox membership?! With whose money?! Umm, like no! Haha - All jokes aside, this juice spot is nestled within the gym and it's open to the public! You don't even need to enter the actual gym to go this juice shop.\n\nDrinks are pretty pricey! They around $10 a pop, but they sure do pack a punch and are filling and can jump start your day or afternoon. They are made to order and are made quickly. If I needed a juice/smoothie fix I would definitely visit again, but I wouldn't go out of my way to come here as it doesn't fit my daily budget. I wish you were more in tune with my budget so I could give you more love, *internally crying.*\n\ntldr; Drinks are good. Service is quick. Not the most budget-friendly, but high quality. More of a treat than a part of your daily grind kind of juice shop (unless it is part of your daily grind than more power to you, I want to be like you).", "author": "Janelle V."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-12-03", "description": "The customer service here is bizarre.  The people at the counter don't speak.  For some reason they are too shy to say \"Hi\", \"Hello\", or even \"Thank You\" after a purchase.  Even when its time to pay, they say the price under their breath, as if they are too shy to speak up, their heads looking down.  Then after a purchase they turn or walk away without a word.  Ahhh, may I have a bag please?  If it were 1-2 people on their staff who were socially awkward, I wouldn't have thought twice about it, but it's EVERYBODY on their staff behaves like this.  I'm wondering if management is beating them, or are they drugged or both?  It's weird and a little disturbing.", "author": "Joseph M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-12", "description": "Delicious drinks, very healthy options, but very pricey! All their drinks are $10\nand are only 16 oz.\n\nI had the almond butter mood and it was bomb!!! Loved every sip of it. It had almond butter, banana, cacao, cinnamon, agave, and almond milk", "author": "Joshua C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-24", "description": "Tucked inside an Equinox, yet surprisingly empty during lunchtime. Don't blow my spot, you guys. I'll throw a kettlebell at you.\n\nSame quality as other locations, although the staff seemed mad at me about not knowing the # of toppings that come by default in the acai bowls. Kind of like when you're at Subway and the person in front of you doesn't know how to order at Subway, I suppose ¯\\_(ツ)_/¯", "author": "Katrina S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-11-17", "description": "Not thrilled. My smoothie tasted great but $10 is just too much. I am not sure what Equinox put this here. I think it's part of their whole gig.\nThis place is totally over priced. End of story. Go next door to Foragers.", "author": "Julianne B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-11-11", "description": "Friendly service, and definitely a welcome addition to the neighborhood! Unfortunately the one smoothie that I love, which is normally prepared with PB, is made with Almond Butter here. Not the same taste and it was so thick that it wouldn't come through the straw.\n\nI will say though, the protein salad was QUITE delicious. Too bad it cost $20 for both. But I guess it's right on-par with the nabe.", "author": "Shu Jin S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-25", "description": "Great spot. The store in inside of an equinox, but it is open to the public!", "author": "Kyle A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-02-24", "description": "Rude, Slow, Overpriced, Unsanitary. Staff is incredibly rude and slow. Girl at the cash register is taking multiple customers right over my shoulder before I'm even down with my own order and trying to pay. Then made me wait for two other customers after me before being she could be bothered to give me a copy of my receipt. Then the girl supposed to me making the smoothies is yelling at a friend on her cell phone while trying make a stack of orders with one hand.", "author": "Erik V."}], "servesCuisine": "Vegan", "priceRange": null, "name": "Juice Press", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "117 Front St\nEquinox Dumbo", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/0-H5PnLrQ4J6U_fPH6bFQw/ls.jpg", "@type": "Restaurant", "telephone": "+12127770034"}