{"aggregateRating": {"reviewCount": 83, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-05-12", "description": "I just left this place on my second visit. The first time they screwed up my order. This time I walk up to the counter and the girl looks at me like I'm a space alien and doesn't greet me at all. I'm confused because it doesn't seem like she even works there. Then I ask if she works there and she talks to me like I'm bothering her. She takes my order and I wait. I watch her bag my burrito but I wasn't sure it was mine because she says nothing to me. Waited ten minutes until I realized it was mine but she didn't want to be bothered with giving it to me. Why is this so hard!!?!? If you hate your job don't do it!!!\n\nUpdate: \n\nJust got back home, this isn't even the right burrito. Since when do burritos have a giant potato in them?!?! Who would order this?!?! Wow this place is awful. I'm too annoyed to even walk back #millenialssuck", "author": "David E."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-01-22", "description": "Food was good, but the large, central shared table with the stools is kind of uncomfortable to sit at. Liked the carnitas, but was disappointed by the shrimp - had a stronger flavor possibly because it wasn't deveined.", "author": "Tiffany L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-09-21", "description": "Very disappointed with both the food and the service. We ordered delivery from here about two months ago. The tacos were greasy, salty and arrived cold. Not appetizing at all! We live only three blocks away, but the delivery took over 1.5 hours. When I called to check on the order, I received an incredibly rude response. Tonight, I decided to give them a second chance and had the exact same experience. Cold, salty, greasy tacos, which took a total of 97 minutes to deliver. Never again...", "author": "Deniz O."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-04-11", "description": "Boo. Intended to eat at the Mexican deli across the street but it was unexpectedly closed, and with my craving in tow, I settled for Oaxaca. Chorizo was way too salty, enchilada sauce not at all flavorful, and the shredded chicken was the kind that somewhat tasted like fish and had me somewhat nauseated by the end. As far as chains go, Dos Toros is far better and while I'm not a Chipotle fan, even that tastes fresher than this. \n\nBut very nice atmosphere w/ open window and bar and all that and I'm sure it's lovely for a drink and some chips.", "author": "Stephanie G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-06-13", "description": "solid good food, Mexican soda and beer\nsomething different and good", "author": "Sarah F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-16", "description": "I am obsessed with Mexican food. When my friend suggested this place, I had to try it right away. The ambiance is great, I really like the decor. Its this hidden little gem. The staff are really welcoming. The tacos are finger licking good! I really liked their twist on tacos with fruit. I can't remember the names, but I had 3 different tacos: a pork one, chorizo, chicken. One of the 3 had mango ( which i thought was different) but it tasted so good!!!!! I will definitely return. The price is also right. #ilovetacos", "author": "Kathy D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-02-04", "description": "The food was ok. The service was rough. \n\nI ordered a quesadilla that was supposed to come with pics de Gallo, pickled onion and a side of cream. I also got a side of guacamole. The quesadilla arrived with sour cream and guacamole. No pico, no onions. It tasted ok but for $8, where are the advertised accompaniments?\n\nThe guy who took my order didn't even look at me during our interaction.\n\nOverall this place is ok but it needs some help.", "author": "Cassy J."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-06-15", "description": "Opening a chain taco joint directly across the street from a legit Mexican taco stand takes balls. They're not as good, they charge more, they don't sell horchata, and they don't do breakfast. \n\nIf you ask \"no onions\", they say \"ok\" and then put onions in it anyway.\n\nAllergies are real. Great tacos are available *directly across the street*. Don't bother.", "author": "Kaja G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-06-15", "description": "I am in a good mood today, which is why I'm probably going easy on this place and giving them two stars but there are two main reasons why I hated my food and one reason why I didn't. They are as follows:\n\nThe bad: \n\n1. The odd and overpowering vinegar flavor that's doused on each taco made it soggy as hell and the flavor a tad offensive. Each bite came with a burst of that vinegary flavor making it very hard to distinguish which taco was what. (I ordered a carnitas, Barbacoa, and pollo guisado tacos)\n\n2. The special I ordered included a small portion of rice and beans that consisted of (what I thought to be) old yellow rice and beans that were drier than dirt. There was no flavorful, savory sauce that brings beans together. \n\nThe good: \n\n1. The prompt delivery and friendly delivery man.\n\nI was pretty pissed off that I shelled out over $14 and couldn't even finish half of what I ordered, but I guess that's what I get for being daring. NEXT!", "author": "Adriane C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-19", "description": "I love this place. It is one of my regular lunch spots. The food is always fresh, hot and tasty. Delivery is fast and if they are out of something they call and offer several alternatives to your original choice. I recommend the chicken quesadilla, the mole enchiladas and of course the chips and guacamole. My only critique is that sometimes you get a bad batch of chips and they are stale or have no dusting of salt.", "author": "L. Joy W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-19", "description": "Great food - Definitely recommend their chicken and barbacoa taco or burritos! Also their casual \u0026 relaxed atmosphere makes for a good time", "author": "David S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-28", "description": "Pretty good fast Mexican. Has a restroom and good service. Chicken is really good and ingredients are fresh", "author": "Andres U."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-04-08", "description": "This place is perfectly average. With Fast \u0026 Fresh right across the street (best homemade Mexican food in the area), Oaxaca loses on price, selection, quality, and personal service. They win on ambiance and late night hours (open til midnight), but that isn't enough for me to go there instead of Fast \u0026 Fresh during hours in which they are simultaneously open. \n\nI think it's strange that they opened, quite literally, across the street from an established neighborhood Mexican food place that serves everything Oaxaca does and more.", "author": "Zane B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-01-28", "description": "Food is 100% 5 star but don't go there looking for great service. The employees barely speak to you outside of what do you want and will only motion when asked a question. However you get past the shitty service once you bite into the carnita quesadilla or the beef brisket tacos. While in New York my boyfriend and I went back twice, once leaving the airport and once going to the airport. It's quick tasty and affordable.", "author": "Bella M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-10", "description": "I was in the mood for a late night snack and came around 11:30. The space is bright and colorful. Very cool taco joint that opens until 1 am on the weekend. \n\nOverall the tacos are were pretty good and decent portion sizes. I tried several different kinds and my favs were the fish ceviche taco which had a generous amount of cabbage slaw as well as the potato \u0026 poblano w/ added chorizo. The potato and poblano also came with a generous amount of slices pickled onions (added a nice crunch \u0026 acidity) For 10.95 you can get 3 tacos plus rice \u0026 beans. I found this to be pretty filling. \n\nThey don't serve alcohol but you can BYOB (beer not wine). \nMy one recommendation to the restaurant is that they need to cut the lime pieces into slightly larger pieces. They were too tiny to excrete the juice. \n\n\nOtherwise everything was great and looking forward to returning.", "author": "TIFFANY C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-27", "description": "Great tacos. Recommend the chorizo taco. Good size portions. Would be better spot if they served Mexican beers. No alcohol at this location. \n\nShrimp burrito is a pass for next time. It wasn't good. \n\nOaxaca salad was great with a lot of gauc.", "author": "R J."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-05-29", "description": "Enjoyed their tacos the other night with one of my friends. We came during happy hour and got half priced tacos. I got two chicken and one potato, loved the chicken not so much the potato. I also got a brownie while inside the store it was good... had a cinnamon taste to it.", "author": "Diondra H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-03-30", "description": "I'm always in search of the perfect Mexican restaurant within close proximity of my apartment and was pretty happy to see Oaxaca opening its new location a mere two blocks away. Came here for lunch on a weekday and was the only one there. The space is bright and clean and the service was fast and efficient. My fish (cevice) tacos were good and reasonably priced but didn't blow me away. The rice and beans were delicious. The guacamole used some kind of herb I didn't love but was fresh. Overall, a good joint but I guess what I'm looking for is something a little more formal than Mexican street food.", "author": "Lana V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-16", "description": "I've always had a good experience from this chain.  Food is consistently delicious.  I'm happy this location is much closer to my apartment since the one on smith closed a while back. \nThe enchiladas and tacos are fabulous - really any of the fillings are good.  You must get the corn elote when in season otherwise the corn esquite.   Other musts: Barbacoa Quesadilla \u0026 Mexican Coke.", "author": "Lauren L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-14", "description": "This place is dangerously too close to us. From the burritos, to the tacos, to the huge portions of fresh guacamole, this place is the bomb. The decor is trendy and cozy. The barbacoa and carnitas tacos are delish. Made the mistake of getting the potato and poblano taco and it was a total flop. The potato was mushy and flavorless and I ended up throwing it away. For about $5 you get a huge tub of guacamole which is great for sharing and quite frankly a deal compared to the prices at other restaurants and grocery stores. Besides the bad potato taco my other complaint is the service. There was one interaction where the guy at the register didn't even say one word to me. It would have been nice if he acknowledged me and my order. I have eaten both in the restaurant and for take out both yielded the same quality. This is already a regular for us.", "author": "Jennifer H."}], "servesCuisine": "Mexican", "priceRange": "Under $10", "name": "Oaxaca Taqueria", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "75 Hoyt St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/xMXdNVU_qO47PVKYvWGPMw/ls.jpg", "@type": "Restaurant", "telephone": "+17188555530"}