{"aggregateRating": {"reviewCount": 83, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-31", "description": "This is my second time here. I just started working in the area two weeks ago and there aren't many food options around. I accidentally came across this place as I was On my way to buy some coffee near by... I checked out the menu and decided to give them a try. The first time I had a shrimp burrito, I enjoyed it. And today I'm having the papas and rajas tacos, it's also really good. On days I don't bring my own lunch I'll definitely come by. Plus the guy behind the counter is always super sweet. Very genuine.", "author": "Kristine A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-05-30", "description": "Please be careful when ordering from this establishment.  I had placed an order today which came out to $27.00, I gave the delivery man $40.00. He gave me back $7.00, and then was walking away quickly. I yelled out to him, I gave you $40.00 to which he replied yes I know. I then showed him the 5 dollar bill and 2 singles that he gave back to me. He said yes, that's your change. I told him that I had given him $40 and he needed to give me back $13. He then gave me a 5 dollar bill and said ok that's your change. I replied that he owed me a dollar, but he then showed me the receipt which said the order was $27.06. So I said you owe me 94 cents.  He told me he didn't have it, so I told him to keep it. Lord only knows how many people he has taken advantage of. I'm just glad I counted my change right away in front of him. Will not be ordering from them again and will continue to warn others about my experience.", "author": "Ilene W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-18", "description": "Ordered the barbacoa quesadilla and was NOT disappointed. it was absolutely delicious!  Only complaint was a little onion heavy, but I'm biased since I'm not crazy about red onions to begin with. Portion size was good, also ordered a small side of guac and chips. wow not small! Huge bag of chips. The salsa that came with my order was delish as well. All in all quite pleased with the quality of the food, great price especially for location! I'll definitely order again. Delivery was super prompt too.", "author": "Melissa W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-03-25", "description": "I should really give this 0 stars. Be wary if you want something delivered. Called them when my order was 30 minutes late. \"Yes, it's on it's way. Have a good night\". 2 hours later with my head down working I remembered that I ordered some food. Just called it in and cancelled the stinkin' the order. This customer service and the delivery experience (or lack thereof) is absolutely abyssmal.", "author": "Jase P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-14", "description": "This place does not disappoint. It's not fancy or fussy. It's not really a sitdown type of restaurant for a decadent night out on the town. But it's a solid spot to go when you want some fresh food and a happy ambience. I've been really pleased with the freshness of the food here and the flavors that are in the mix.", "author": "Roxanne K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-07-16", "description": "This place is very inconsistent. When the food is right, it's great. But, I order the same burrito every time, and more than half the time I get something bad. Just got one with no meat and no sauce. It's the last time I'll go to this place. Like I said, if you're lucky, you'll get good food, but most of the time, for whatever reason, the food is missing parts or not well put together. Frustrating.", "author": "Matthew K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-22", "description": "Finally some good taco action near my work.  Fresh ingredients, good flavors, broad selection of hot sauces, and (contrary to another review) horchata.  It's good!", "author": "Jim K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-21", "description": "Surprisingly great! I got a burrito, it was well-priced, filling, and a manageable size. Plus the decor is perfect.", "author": "Laura W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-22", "description": "Food is always delicious, and when we order in, it arrives as predicted or sooner! I highly recommend the chicken plate and also the papas y rajas tacos.", "author": "Marissa G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-18", "description": "The chicken quesadilla with salad lunch combo comes with sour cream and is super filing. I was expecting a smaller salad when the host/cashier described it a small house made salad.", "author": "Joyce M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-04-06", "description": "The food was great. It's hard to find good and cheap mole around and this place had some of the best mole I've ever had. The chorizo and potato enchilada stood out for me,  I also had the pollo guizada and camarones.  My only problem with this place is its location. It's right across the street from Fast and Fresh deli which is some of the best homemade Mexican food in the area. I guess fast and fresh have their own clientele and will be just fine. But this was a bit upsetting to me.", "author": "Janice P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-02", "description": "Delicious quesadillas, fast service, limited seating, good downtempo electronic music atmosphere, fresh ingredients. Would eat again!", "author": "Drake H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-30", "description": "This is my go-to, Mexican food delivery choice. The prices are amazing, food is really fresh and tasty, and the delivery times are super quick. I'm all about the chorizo tacos!", "author": "Hannah S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-22", "description": "This is the best fast casual Mexican place in Brooklyn. Love this location, great service, really fresh local ingredients and well priced for the serving sizes. Specifically the carnitas tacos with guacamole. Highly recommend.", "author": "Celina R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-05-19", "description": "HORRIBLE SERVICE. Our delivery was an hour late (on top of the hour we waited for it) the restaurant was incredibly rude when we called and told us it was our problem to deal with, they were too busy to locate the driver. DO NOT ORDER FROM THIS PLACE. We are avid seamless/Yelp people and should have realized this place is awful. Poor service to the extreme", "author": "Sana R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-23", "description": "Great spot for picking up some tasty tacos on the way home from A/C train in the late evening.  Welcome to the neighborhood!", "author": "Teresa B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-04-16", "description": "If you want mediocre yet passable tacos, go here. If you want authentic Mexican, go directly across the street to Fast and Fresh deli.", "author": "Stewey D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-10-26", "description": "Worst delivery in the 5 boroughs. Food is okay, but not worth the delivery experience. On one occasion our order was not only late being delivered, but was wrong. On another (and last) occasion our order was never made. When we called to follow up on it we were told  it was already sent out, it never showed up, so called back and we were then told there was a mistake and it was never prepared. Will never order from here again", "author": "Rob M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-07-16", "description": "This place is a joke. When it opened we were looking forward to some good Mexican food. I've gone there 4 times. 3 of those times they got the order wrong. Once while eating there, I went back to the counter to point out the order was incorrect. All I got was a shrug, and 'too bad' expression from the counter man. No apology. No attempt to fix the order or give me a refund. Another time, I dropped in on the way home, placed an order and asked it be delivered. The order came wrong, and there were no chips, with the Guacamole and 'Chips'. Again getting them to fix it was impossible. I asked for a refund,( I'd paid with a debt card ) and they didn't seem to know how to do this. it took several calls and visits to get my money back. There never is a manager or someone with authority in the place to make sure customers are happy.\n\nThe food when they did get it right was so-so. Nothing special. And they do have a lot of nerve opening directly across the street from a real Mexican take out- Fast and Fresh. No bells and whistles or fancy decor- But Fast and Fresh is the real deal. Oaxaca is trying to pass it self off as a Hipster pop-up business, but seeing that there poping up everywhere, it has corporate backing written all over it. That and the employees just don't seem to care. It's sloppy and insulting. Even the phone number for their Hoyt St. location on their menu is wrong. No one ever picks up- What else can I say, I wanted to like the place. Stick with Fast and Fresh directly across the street.", "author": "Steve R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-06-30", "description": "Got a burrito, ask for no beans. See guy put something black on the burrito. Ask cashier, is there beans in this. She says, \"no.\" Of course there's beans in it. Never again.", "author": "Al J."}], "servesCuisine": "Mexican", "priceRange": "Under $10", "name": "Oaxaca Taqueria", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "75 Hoyt St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/xMXdNVU_qO47PVKYvWGPMw/ls.jpg", "@type": "Restaurant", "telephone": "+17188555530"}