{"aggregateRating": {"reviewCount": 83, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2019-05-02", "description": "I love this place for delivery! They are so quick and the guys are so nice. I always get the three taco combo and Esquites. I am in love with their corn! It's so spicy and creamy. \nI've disappointed by the chorizo and shrimp taco options, but every other one is great! I like the Barbacoa and Pollo in particular. \nAlso, they will deliver Tecate to you - wild!!", "author": "Julia P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-04-09", "description": "I went here on a Monday early evening to meet up with a friend. I got there about 5:15pm and the place was desolate. I was able to get the table of my choice and peruse the menu as I waited for my friend. I am glad the place was empty because my friend got lost and didn't arrive for until close to 6pm. The guys that work there were friendly and didn't give me a hard time about loitering. Once my friend arrived I asked a few questions about the menu options and decided to get the three tacos with rice and beans. \nFood: The food was a let down! I was so excited to try this lace after my co worker raved about it. I was most excited about the chorizo which was very dry and not as flavorful as I had hoped for. Actuallly it tasted like a dry unseasoned meatball to be honest. The others were also \"nice try\" and I know I will never come back here for food. My friend had the salad and she said it was good. It didn't seem to have much of the lettuce selection they said it had. It looked more like iceberg lettuce. The rice and beans was okay- it was not memorable in a good or bad way. \nInterior: not too big of a place but it did not seem to ever get too crowded to worry about that being an issue. I did see more than a few ants crawling about but I guess now that Spring is here I shouldn't freak out about that right? !\nOverall: The food comes out in a timely fashion. The servers are nice enough. The food is blah... I've had a better meal at Yummy Taco (and its much cheaper).", "author": "Kia A."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-01-08", "description": "I've had better...\n\nI ordered the three taco special ($12) which comes with a choice of three tacos plus rice and beans. I then proceeded to get really excited because who doesn't love cheap tacos. I ordered the shrimp (which was chilled), the al pastor and the chicken all of which were double tortilla-ed. The shrimp was absolutely the only edible one out of the bunch. It was cold shrimp which was not expected and I don't know that I would order it again but it was OK other ones. \n\nThey al pastor were SO incredibly greasy that all three tacos were soaked in a bright orange oil seeping out the bottom. It ruined my tacos and got all over my hands. Eating tacos is never glamorous but this was next level. \n\nIf you can cut down the grease, your tacos would be MUCH better!", "author": "Naomi Z."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-12-02", "description": "Pretty good tacos, especially the speciality Korean taco.  The chorizo wasn't that great , so that's why Im giving this place 3 stars instead of 4.  The side of rice and beans was pretty good as well.   The staff was friendly and service was fast .  I'll definitely try out some of the other items on the menu the next time I'm in the area .", "author": "George B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-13", "description": "I can only write as a mealpal review but I am a fan and will be a customer off mealpal. The items ordered look like the normal portions you'd get so everytime my meal has been generous in size. I've had a vege burrito with potato and the salsa inside was delicious and zingy. Quesadillas ordered have been the beef and chicken, equally delicious and a chicken burrito. Have had two beef tacos which were tasty, but I prefer the burritos for a more filling meal.\nService is quick and seating is available to eat there. The burritos here remind me of my time in the west coast so I'm glad I can reminisce my fond memories of it here.\nGlad that they do delivery too!", "author": "D M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-01", "description": "I've been going here for a while, and I've always loved the food.  But guess what food lovers!?!?!\n\nTHEY ADDED A WHOLE VEGAN MENU!!\n\nThat's right, not just a side note, or 1 or 2 items, but a whole separate f-n menu!  I'm gonna be here everyday!\n\nHeheh... yeah say what you want, but I love me my veggies.  \n\nMy usual routine was getting side of guac \u0026 chips, plus a papa y rajas taco, sans cheese.  Ok sometimes I get the cheese, but it's damn good without it!  And the guac is super homemade.  Ain't no chipotle wanna-bes here!\n\nAnyway, today I saw this new VEGAN MENU, and I ordered the carne asada.  The un-beef is ground vegetable protein.  And the sauce is mmmm good.  \n\nI guess I'm gonna have to go down the menu and update this review daily.  LOL", "author": "Sean S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-03-13", "description": "We ordered for delivery on Seamless and it was about 15 Minutes late so I called the restaurant. I was out on hold for 5 minutes so I called back. The woman on the phone offered no apology for the food being late or the fact I was left on hold for 5 minutes. Her only comment was \"Sorry, we're very busy\". Sorry, that's not my problem. Probably won't order fro them again. Too bad as their food is good albeit over priced.", "author": "Dean B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-11-24", "description": "Nice little Spanish spot, I got the 10 inch chicken burrito with chips and the burrito was stuffed. It was really good, the reason why I gave it a 4 stars is because it is pretty pricey. I also admire the art work within the restaurant, they put effort in designing the restaurant.", "author": "Duvesh N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-09", "description": "Made a quick lunch stop here and the food was excellent! I got the 3 tacos special and they were great portions. The staff was friendly \u0026 the restaurant was very clean!", "author": "William D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-02", "description": "All I can say is wow!!! Their Vegan menu is huge. Today was my first time ordering from this restaurant. The food was AMAZING! The tacos were clearly marked vegan so there was no confusion on which tacos had the vegan meat. My coworkers who had tacos with regular meat also said their food was really good.", "author": "Michelle L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-10-07", "description": "Guy at the register was rude despite us being nice. Food was mediocre and overpriced. I ordered 3 tacos and was pretty disappointed. I'm probably never coming back.", "author": "Andres M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-04", "description": "Go here ONLY if you crave throat-burning, spicy, habanero flamed Mexican food! The caldo de pollo is bright fiery red in color, matching its burn as it moves down your throat. \nThe horchata has dairy milk in it, not just rice milk, otherwise the food is mostly authentic. If you don't eat jalapeños everyday, however, be forewarned. I eat Mexican food weekly, have lived in Mexico and for many years in south Texas. I cannot eat here.", "author": "Sandy M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-01", "description": "We've ordered from here a few times. Everything we've gotten is always delicious and comes way before the expected delivery time.", "author": "Aleisha D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-07", "description": "This is a solid place to grab some street tacos and a beer.\nI had the chicken, al pastor and beef mole tacos in the 3-taco combo, which comes with rice and beans. I cost around $12 and was well worth it. There was definitely too much food for this one person to finish.\nMy daughter had the ceviche and liked it, a lot.\nThe al pastor definitely wasn't traditional (spit carved), but it had good flavor and lots of meat. The mole wasn't great, but was good enough. I'd recommend sticking with the pollo. Their guacamole is fantastic!\nThe service was fast and friendly. I asked if they serve wine, and the guy said, \"no, but you can bring your own.\" So, I walked around the corner and grabbed a bottle; returning just in time for the arrival of the food. Score!\nThe place is cool and comfortable. Seems MUCH NICER than some of the other Mexi joints in this neighborhood.\nI'll definitely hit this place up, again, next time I'm in the area.", "author": "Charles S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-12-30", "description": "\"So there's this local hole in the wall taco spot that everyone loves. You know what would be good? If we opened up right across the street.\" -whoever decided to open this Oaxaca location, probably\n\nThat said, I wanted to give Oaxaca a fair shake, because those are the responsibilities of an Elite Yelper after all. It's a tough life.\n\nAnyway, it was a slow Sunday and it looked like they were just mostly doing deliveries and nobody was eating in the restaurant. So I guess that's why the staff seemed super disengaged when we walked in.\n\nWent with their three taco combo, which is $11 and includes rice and beans. I went with the barbacoa, pollo guisado (chicken) and the al pastor. Can't really say any of them were great, but they got the job done. The tortillas were kind of stale. The barbacoa beef was tough. The al pastor was probably the best one. Makes sense that they charge an extra $0.75 to add it to the combo.\n\nIt's a relatively convenient spot with tons of seating and cool decor. But if you want tacos, Fast n Fresh is across the street and does em better, without all the frills. Just like true Mexican food should be.", "author": "Kenny C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-11", "description": "Good authentic food! The guac and chips are soooo good and really fresh. My new go to place for lunch.", "author": "Xiomara T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-10", "description": "Looking for a light bite, I ordered two tacos, a Al Pastor and a Barbacoa. The price seemed a tad high but still reasonable, and the tacos were quite nice. They both had just the right amount of filling on high quality tortillas. Both the fillings had good flavor (the al pastor was a good rendition; don't know Barbacoa enough to truly evaluate), and the ambience was perfect.  All told, what I was looking for.", "author": "Clark Q."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-21", "description": "Oaxaca Taqueria is a horrible representation of Mexican food.  I've never seen pickled onions put into Tacos and trust me its horrible.  They have a seemingly good lunch special but then when you realize everything you would get for free (salsa, pico, utensils, etc) they charge you for.  They even threw a mystery  \"cream\" into my rice and beans and it sure didn't taste like the sour cream I though it was. \nSo in essence its badly made tacos with mystery ingredients you are not charged for.  The extra you are used to getting for free they charge you for.  The extra charges made this three taco order more expensive than if I got a large platter at Sophies.  \nOne and I'm done with this company.  I'm never gonna be a customer of their's again.", "author": "Pookie C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-27", "description": "I prefer to judge restaurants on their own merits, regardless of how they stack up to the competition. But when you are a taco place that opens up directly across the street from another taco place (Fast \u0026 Fresh, that has been feeding me delicious Mexican for years), it invites direct comparison.\n\nWell, I like Oaxaca. I do. They make a good taco. I've enjoyed the barbacoa, the al pastor, and even the chicken. The flavors are consistent, and perhaps a bit more refined than their counterpart across the way. \n\nTheir lunch special of two tacos and rice and beans for $7.95 isn't bad at all, until you consider that they charge extra for the al pastor (the only taco I'll get every time), and that they believe in \"laws\" and expect me to pay tax...which adds up to over $10 every time. \n\nWhereas across the street, I can get myself three tacos for $6, no tax, no upcharge, no hassle. Or a burrito that will feed a family of four for about $7. All while not feeling guilty for cheating on an old friend with a newer, sexier model.\n\nSo when I leave my apartment in search of some Mexican, and I head across the street...it's not you, Oaxaca, it's the long-standing relationship that Fast \u0026 Fresh and I have built.* I can't just throw that away for the promise of some juicy barbacoa. Well, I can sometimes, but not on a consistent basis. \n\nSo I'll see you...sometimes. \n_____________\n\n*One I will maintain until the rising tide of gentrification inevitably pushes this wonderful anachronism out of our overpriced neighborhood.", "author": "Peter D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-11-15", "description": "I've had tacos, burritos, and quesadillas at Oaxaca. They serve decent food, no-frills, nothing unique or fancy. Oaxaca is not my favorite Mexican spot, but they're a good go-to as I know they're consistent and they have good hours. Serving size is filling - I cannot finish a quesadilla on my own and a burrito is two meals for me.", "author": "Lauren W."}], "servesCuisine": "Mexican", "priceRange": "Under $10", "name": "Oaxaca Taqueria", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "75 Hoyt St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/xMXdNVU_qO47PVKYvWGPMw/ls.jpg", "@type": "Restaurant", "telephone": "+17188555530"}