{"aggregateRating": {"reviewCount": 83, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-31", "description": "I have been watching the construction for a couple weeks now and finally noticed it was open last week. I am always looking for new places to eat close to work. Today was the day I finally made the trek with a cool gang of co workers. It was a great place for groups. You order at the register, pay and then they bring your food to the table. This helps avoid the splitting of the bill. \n\nI was hungry so I quickly noticed the burritos are under ten bucks and that even included the shrimp burrito. I added some avocado for a buck more. The burrito had some shrimp but not too many, black beans, pico de gallo, a on of pickled onions, cheese and salsa verde. I was absolutely stuffed. I also enjoyed that there is a variety of hot sauces on the table. I especially liked that they had my fave, Cholula. \n\nI think next time I will try the lunch special, it's like $7.95 for enchiladas or tacos and come with rice and beans. \n\nI also liked the chair covers in what looked coffee bean burlap bags.  Very cute and affordable spot for lunch.", "author": "Carolina S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-17", "description": "Always love the food at Oaxaca but really appreciated the service today!! I placed a Grubhub order and accidentally selected the wrong location for pickup. I told the cashier what happened and without any hesitation, he called the other location, had them cancel my order and made me my burrito right away without charging me again. Thank you!", "author": "Deepa P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-14", "description": "My friend and I went into the restaurant around 11 pm on a Thursday. The atmosphere is casual and super relaxed. They employees were starting to close for the evening but were still bumpin hip hop music. I got the Oaxaca salad with chicken. It was so delicious. Portion sizes are on point, the salad was very filling. My friend ordered the chicken burrito. The employee notified us that they were basically out of rice since it was the end of the night and it had been slow earlier due to sidewalk construction. He was very helpful and offered to make something else or to just use whatever little bit of rice was left. My friend decided to get the burrito after all, and the employee threw in guacamole and a bag of chips for free! \n\nTL;DR - delicious food, reasonably priced, outstanding customer service!\n\nTHANK YOU!", "author": "Alexandra M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-08", "description": "The hipster version of chipotle also tastes better. I only had their enchilada, but I was also quite impressed with it.", "author": "Dominik D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-01-08", "description": "I got seamless for Oaxaca Taqueria, hoping to get some comfort food in a snow day. The food came really quickly (that's why I gave three stars - thanks to the delivery guy who traversed the snowstorm; otherwise the food is only 2 stars) however the quality is really disappointing.\n\nI got a taco plate with three tacos (carnita, pollo, some type of pulled beef) and my friend got an al pastor plate. In both dishes, the meat was horrible. The al pastor was way too hard and salty to be consumed, not too mention the excessive sodium amount along with it. The carnita and pollo were either tasteless or bizarrely seasoned. Only the pulled beef was alright. Along the plato comes with rice, bean, some pineapple, three tortillas and a small side salad (the salad was also only for one bite). The serving was big, although both of us lost appetite halfway.\n\nThis might be that the food was consumed via delivery so if this is different from the quality of food of dining in, I do apologize.", "author": "Shen Q."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-05-04", "description": "The food here is definitely tasty! But it's not a clean establishment. I'm sitting at their counter watching the cooks. One guy licked his fingers while wearing a glove and continues to prepare food; the grill guy wears only one glove but decided it's okay to use both hands to handle food. I mean why even wear the one glove?", "author": "Neil A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-22", "description": "The tacos were cold and tortillas so soggy they completely fell apart as soon as you picked them up. A mess.", "author": "A N."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-09-16", "description": "Two of three tacos were cold and generally gross. A piece of dirty (covered in hair and dust) rice was in the rice and beans. Avoid.", "author": "Benjamin L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-24", "description": "A great place to have a taco in Brooklyn. My favorite is the chicken burrito. They have the original Mexican cola with natural sugar. \nThe place is clean and relaxing.", "author": "Bolivar A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-01-08", "description": "Oaxaca does a pretty good job of mimicking SoCal burritos and their al pastor is on point! Their tacos are excellent, while their black beans and rice need some seasoning. \n\nA decent delivery option if you're in the mood for something other than Chinese or pizza.\n\nAffordable!", "author": "Scott G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-25", "description": "Grabbed lunch here....twice  Had the three taco combos. Loved the Mole sauce and guacamole was very good. Prices were good and really enjoyed.", "author": "D D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-30", "description": "Food is good with large portions. The flavors can be a little tame but I add hot sauce! Ingredients seem fresh. And my touchy stomach never has a problem here", "author": "Paul L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-11", "description": "Tried to find a Mexican place and this place was on the list so we went and it was really good. There are choices to choose from, the food comes out fast, and it's not expensive. Will definitely be back. :)", "author": "Xristina S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-09-01", "description": "When ordering a quesadilla, the Menu states \"pico de gallo, pickled red onion and jack cheese on a flour tortilla.\" However i just received cheese in a tortilla. When I brought this to the worker's attention he told me \"that stuff costs extra on a cheese quesadilla\"....???", "author": "Farrah P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-04-16", "description": "All I tasted was salt.  The beans tasted of salt.  The beef tasted of salt.  They might have just as well sent mea big bag of sodium.", "author": "Daniel H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-26", "description": "Probably the best and most authentic tacos I've ever had! I love the they have weird and different tacos too, like a Korean taco with kimchi. Ever since I've been there, they haunt my mind... \"Come back Sophia, yiu know you want more.\" If I didn't have food ADD I would have been back already. Every te I'm in Brooklyn something shiny and new catches my eye. But I will have you again and like Arnold, \"I'll be back.\"", "author": "Sophia D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-10", "description": "I agree that it's a bit odd that they opened across the street from Fast/Fresh which for the most part has been making the best tortas and tacos in the area. As much as I love F/F, they close early. The Oaxaca empire grows.\nIt's a very nice space - lots of wood and well lit. There is a bar where you can sit if you like as well. We had drinks and oysters at Grand Army and then retired to Oaxaca for an evening nightcap of tacos. The al pastor was pretty tasty.", "author": "Rich B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-09-02", "description": "This place really sucks. Just got an order and it's terrible. The al pastor taco is greasy to the point of inedible. The beans are extremely salty. The shrimp tacos have cabbage on them when it's not listed on the seamless menu and there is no avocado in the avocado lime salsa. Oh and I asked for no cilantro on any of them and sure enough they are all covered in cilantro. \n\nCalexico is far better..", "author": "B B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-08-27", "description": "They were very nice to us, allowing us to use a coupon which made the meal worth it, but the meal itself was a bit overbearing on my taste buds. I heard a lot about the shrimp taco, but the shrimps themselves were cold and had no taste. For some reason, every taco was sour. Still a pretty good meal given the price after coupon.", "author": "Carrie B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-01-07", "description": "A really bad experience. Came in on December 27th for some tacos with my hubby. When we got there, we noticed a really drunk guy at the counter, but figured hey who doesn't need a post bar taco or two?\nAfter we ordered he came stumbling back in with an employee who seemed to be in charge and just as wasted. Again, I thought \"oh holidays are stressful...it's a Sunday\" and just tried to focus on my tacos that then arrived from the drunken employee.\nBoth guys made anyone who came in feel uncomfortable and things only got worse when Guy #1 pulled a bottle of tequila out of a bag and poured shots in condiment cups. (See attached photo.)\nThe employee was loud and getting more alpha with every shot he took. We ate faster. \nGuy #1 tried to go to the bathroom but couldn't open the door and proceeded to knock over the garbage can. After that, he stood by the counter until he fell backwards into the table. We packed it up. The tacos were decent but the drunken antics left a bad taste in my mouth.", "author": "Daniela L."}], "servesCuisine": "Mexican", "priceRange": "Under $10", "name": "Oaxaca Taqueria", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "75 Hoyt St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/xMXdNVU_qO47PVKYvWGPMw/ls.jpg", "@type": "Restaurant", "telephone": "+17188555530"}