{"aggregateRating": {"reviewCount": 9, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-27", "description": "5 stars for dependability and delivery times. Two times I've ordered their salmon poke bowl with a boba drink and each time it arrives fine, correct and yummy. It's great to have a poke/boba option in the Clinton Hill/fort greene area. I hope they stay open! The boba is not THE best but great for what it is!", "author": "Rachel T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-01-08", "description": "At E-bite, they serve poke, and they serve wokey. I don't like raw fish so the wokey is where it's at! I ordered the Mala Fly Wokey with beef, octopus shaped sausage (interesting touch), jalapeno, onion, cucumber, cilantro with white rice. This dish was $12.99, and it came with a kick. I also ordered a medium milk bubble tea for a little over $4.50. For both dishes, I would have preferred more meat and more bubbles. However, I was impressed by the flavor and service here. E-bite with its bright eat in dining area is a much needed addition to Myrtle Ave.", "author": "Julia W."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-05-08", "description": "It would be nice if it was wheelchair accessible and I was able to go inside. Given that we're in 2019, i don't understand why it's so hard to add a simple ramp and make restaurants inclusive to everyone in the community.", "author": "Jessica P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-18", "description": "This is the best bowl I ever had.I will bring all my friends to here . The decor of the store is also my favorite style.  Yummy", "author": "Summer Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-22", "description": "Yum!! I'm equally excited and upset this amazing little restaurant is so close to me. There boba teas are exceptionally delicious - no more water downed flavor. I'm currently obsessed with the sake salmon poke bowl. The sauce is a bit too spicy for me, but they will do it lightly and then it's a perfect assemblage of salmon, tamago (sweet!), avocado and other delicious veggies. Next time will try beef with noodles and jiang jiang sauce. \nTherein lies the reason for being upset - too much eating out and far too many bobas!!", "author": "Emily F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-19", "description": "This has become my go-to delivery spot for poke and boba. The food is fresh, the portions are generous, and the attention to detail is much-appreciated (they pay attention to requested modifications and thoughtfully package orders).", "author": "Anna S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-05-04", "description": "We had a really good meal here and I hope it stays open because it doesn't seem particularly busy (possibly a result of the odd name and the choice of paint color). The bang bang shrimp were very tasty and not too heavy. The sake salmon pokey bowl was perfect. We liked the tuna pokey bowl but the sauce was a bit too sweet and overpowering for the fish. We'll definitely eat there again and want to check out the ramen.", "author": "Eli M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-27", "description": "I LOVE this place. Everything I've had here is fresh and so delicious. Plus their bubble tea is one of the best I've ever had, and I used to live in Asia! So excited about this new place in the neighborhood!", "author": "Daniel S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-06", "description": "Finally a good place with good Poke! I love Clinton Hill but the Poke options have all been mediocre at best... until now! This place is right on my daily commute path and I find myself wanting to drop in every single day.", "author": "Jion F."}], "servesCuisine": "Cafes", "priceRange": null, "name": "E-bite", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "336 Myrtle Ave", "postalCode": "11205", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/kX5CQMxEF1DOSzyEjGkxqA/ls.jpg", "@type": "Restaurant", "telephone": "+19293376038"}