{"aggregateRating": {"reviewCount": 98, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-03", "description": "Been going to Fatoosh for years. Every single item is delicious. Yes, I have ordered them all. I often bring friends and all have adopted it as their own. Perfect location for grabbing food before heading to Brooklyn Bridge Park. Recommended bites: chicken platter, shish kabob sandwich, assorted salad platter (they have the best grape leaves!), and the spinach pitza.", "author": "Ian J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-16", "description": "I love love love this place. I've been ordering from here for years and it has been consistently delicious and fresh - it's my take-out and delivery go-to. Service is always quick and very friendly. If you're looking for cheap and tasty middle eastern, this is the place.", "author": "Martha M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-26", "description": "Yummy falafel and yummy grilled chicken. Pair them with a refreshing tabbouleh salad and some fresh baked pita bread and you certainly have yourself a nice and healthy meal.\n\nThey are very prompt with their delivery and very friendly when I come I to the store. \n\nI just wish they were open later!", "author": "Tara S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-18", "description": "For takeout, Fatoosh will give you the best bang for your buck in a typically pricey neighborhood. The falafels, shawarmas, and chicken sandwiches are all flavorful and hearty enough for a full meal on their own. Quick delivery and friendly counter service complete the package.", "author": "Jim C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-17", "description": "This place is consistently great. ONLY chicken shawarma wrap I will eat. The pita is always fresh and not store bought. great sauce and fresh. The combination platter is also good and a great value.  Cheap and fast delivery", "author": "Ann C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-06", "description": "My friend and I got take out from here last week, it was amazing and I'm going back tonight!! We got the grilled chicken platter which came with grilled veggies, hummus, another delicious dip (sorry not sure the name) and pita...we split it and there was more then enough! The guys there were friendly and the wait for our food wasn't very long, def will be back again!!", "author": "Brittany J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-05", "description": "Although they do have some tables, Fatoosh is more of a take-out/delivery business. I've ordered from them several times and find the prices and service to be good. While the falafel here was dry, under-seasoned, and not that crispy, it's their pizzas (or \"pitza\") that has kept me coming back. I like their Lahmbajin Pitza (12\" is about $10). It's a pizza topped with a ground beef, tomato, spice mixture. It's a tasty middle eastern take on pizza and I like that it comes without the cheese and grease that a normal pizza would have. The crust has a nice chew to it, not too thick but not too thin either. I've gotten the same pizza from the well reviewed Zaytoons down the street and it's not nearly as good.", "author": "Matt E."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-02-25", "description": "Working in Brooklyn Heights, I have a good selection of what to order when hunger strikes. Fatoosh Pizza takes care of my Middle-Eastern fare cravings.\n\nA chicken shwarma platter will get you a generous portion of tasty chicken, hummus, a spicy red pepper dip (at least that what I think it is), grilled vegetables and pita. All for about $12. Not bad. I always finish it feeling very full and satisfied so no complaints.", "author": "Julia B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-20", "description": "Quite simply the best falafel I have ever had... bread rolled out \u0026 baked while you wait... Fantastic", "author": "Alex P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-24", "description": "Grape leaves are outstanding here. One of the best I ever had. I ordered shish kebab platter which came out a bit overdone but still plenty flavorful. Not to forget the muhammara which was delicious, adding an extra kick to the dish. The only complain if any, hummus is a little water down here. Otherwise, great value for the price you pay.", "author": "Janusz F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-18", "description": "I always order from this place, each time they never disappoint. The gyro platter is very good. When I call, the staff is very friendly and they always follow my directions (extra sauce, pita in a separate container). If you want a reliable place to order from, definitely order from Fatoosh.", "author": "Christi C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-27", "description": "Although I've never eaten the pizza, the chicken and beef platters are amazing. The meat itself seems to be of high quality and although I wouldn't say the platters are inexpensive, they are certainly a good value and not over priced. \n\nThe sides I've had were all fresh and I especially liked the cucumber and yogurt. I've honestly never eaten anything I didn't like here and they deliver very quickly on seamless.", "author": "Emry D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-19", "description": "Our go to spot for fresh and fast Mediterranean food. We've had the crazy fatoosh sandwich, fish sandwich, muhamarra dip and falafel - all delicious! The prices can't be beat and the guys at the shop are friendly. Fast delivery too. Would highly recommend.", "author": "Melissa T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-27", "description": "Best falafel in the 'hood.  The muhammara is super yummy!  I lived off the platters for weeks when I moved into BK Heights.  The guys that work there are great, too.  There are some tables to eat in, but I usually just get take out.", "author": "Stiph N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-07", "description": "What everyone says about the falafel is true: best I ever had. Crispy on outside, soft inside. Tabouleh, and salads are good. Hummos is a little off but overall great, fresh food for the\n$$", "author": "Chelsea M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-05-15", "description": "Fatoosh is good for take-out, but it's name is a little misleading.  First of all, I've never eaten pizza there.  I'm a fan of their middle eastern dishes and falafel.  It's located in Brooklyn Heights (close to Atlantic Ave.) and was around the corner from my old apartment.  \n\nLike I said, very good take-out if you're in the neighborhood.  However, I don't know what the deal is with their pizza.", "author": "John F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-05", "description": "I'm no falafal expert, but this is the best I've had.  Really crispy and delicious with a wonderfully cooked pita bread that I believe they make on the premises.  I'm madly addicted to the spinache pie, which, being a pizza place, is more like a calzone than traditional spinach pie, and that's a-ok with me.  The falafal platter is a very generous helping of falafal, hummus, some spicy sauce, tahini and a salad, all or not much cash.  Same with the outstanding Schwarma platter.\n\nI almost always do delivery through seamless, and the delivery is very quick and the food always fresh.  \n\nI'll definitely try some more menu options (like the pizza, which I hear is great) in the near future.", "author": "Maurice H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-14", "description": "Fatoosh is one of my favorite places lunch places. The name is very misleading. It's not really a pizza place. It's a PITza place (pita pizza). They've got the best pitas I've ever had. They make them fresh here. And the lentil soup is a favorite! I also really like the assorted salad platter which has tabouleh, hummus, baba, foole, and the mashed red salad (the name escapes me right now). I also really enjoy their lahmajun! Their shawarmas, however, are a bit disappointing. There are a ton of great places for that in the area.", "author": "Janice P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-17", "description": "True story: I just ate a falafel sandwich at a fancy restaurant week restaurant, and the first thing I thought of was \"hrm, Fatoosh is much better.\"\n\n$5 for a falafel sandwich that is as big as my face!  The food cart across from the hospital a block away much charge the same for a much smaller portion.  Fresh pita bread, salad, and delicious falafel.  I was stuffed for hours, but it was a good kind of full.  And the staff was really friendly.  I will definitely be returning, and at this point they're going to be the standard I compare most other falafel to.  Yum!", "author": "Cynthia C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-03-07", "description": "LOVE this place. Got hooked while renovating our kitchen and ate there every night for about a month!!! Alex is a great guy and he always makes your order very personal. He doesn't mind special requests too. \n\nIf you are hungry for Middle Eastern yum--go here. IF you happen to work at LICH you are JUST ACROSS THE STREET... GO!!!", "author": "Datan B."}], "servesCuisine": "Pizza", "priceRange": "Under $10", "name": "Fatoosh Pizza \u0026 BBQ", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "330 Hicks St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/E8tBAyaQ0TCAJRij2NJXAw/ls.jpg", "@type": "Restaurant", "telephone": "+17182430500"}