{"aggregateRating": {"reviewCount": 98, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-25", "description": "So far the best Falafel I've had in Brooklyn. The ingredients are fresh and they give you a large pita portion.", "author": "Daniel C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-28", "description": "I had the grill chicken Caesar Salad and Falafel Sandwich, absolutely yumers!! I ordered it through Seamless and was totally satisfied.", "author": "Fantastic F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-06", "description": "Awesome. I've been here over 5 times (with delivery) and consistently great food. I dont give fives often.", "author": "Dan R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-09", "description": "I've only been to this place once, but I can't wait to go back!\n\nI got the Crazy Fatoosh sandwich - three salads of your choice in pita with lettuce, tomatoes and tahini sauce. I don't even remember which salads I picked, but both mine and my aunt's (different combos) tasted great. And each sandwich was HUGE, and only $5.75.", "author": "Hayley D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-04", "description": "Great food   We live in the neighborhood and eat here once a week   The babaganoush and hummus are excellent and the kids love the pizza   And the staff is friendly and efficient", "author": "anthony v."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-02-17", "description": "I wanted to like this place, I really did. It's the only Mediterranean restaurant in that area and my hopes were high after reading reviews on here. I ordered (delivery) the falafel platter. The falafel was ok. I've had worse but I've also had better. It wasn't deep fried, which is a plus, but it reminded me of Morningstar Farms frozen falafel. The hummus was ok but tasted like they didn't put any garlic in it. The \"vegetables\" were a bed of lettuce and tomato slices. The other side was some type of pureed, spicy red pepper and was quite good. Next time I need take out in this neighborhood, I'll do Court Street's Nature's Grill or Chipolte", "author": "Laura S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-16", "description": "Great place for take out Middle Eastern food.  Everything was fresh, large portions and very fast delivery.", "author": "Anna K."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-11-22", "description": "While this place is a good deal for most of their items, I would have to say the food is not very good. The platters and sandwiches here are standard middle eastern fare that do fill me up due to their size, but I never think \"wow cant wait to have this again!\" I work across the street at the hospital so I get it now and then due to convenience/cost but definitely dont look forwards to it. I've had food cart sandwiches that are better!", "author": "Saad M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-04", "description": "We are regular (almost weekly) delivery customers. Delivery is fast, food comes hot, and everything we've ever tried is delicious. The people who work there remember us and say hi to our little kids. So we like Fatoosh.", "author": "K. H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-10", "description": "In a neighborhood full of Middle Eastern restaurants, this is my favorite. Everyone I have introduced to the grilled vegetable sandwich is mad for it. Geared more toward taking out than eating in but the tiny space is pleasant and the cooks will bring the food to your table. Tip: promised you'd pick up hummus at Sahadi's and forgot they're closed Sundays? Fatoosh hummus compares.", "author": "Rita B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-12", "description": "wow a really good falafel sandwich, lite simple and fresh just the way a falafel sandwich should be. \n\nAlso there delivery service is great, i always get my food in less than 30min.", "author": "Justin Z."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-15", "description": "Delicious. Definitely best for delivery. Yummy. Fresh. Clean etc. etc. Big fan.", "author": "ClassPasser P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-02", "description": "Huge portions, delicious food (particularly the sides--hummus and m'hamara) and friendly service.  One of the best spots in the Heights", "author": "Tomas R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-31", "description": "The food was pretty good and serving size was decently large. We ordered a combination platter with two salads/meats for 12 dollars along with a meat pie, which was 6.50. That definitely fills up two guys with larger appetites. \n\nThere isn't a lot of seating room (half dozen tables or so), but we were the only guys in the place at 7pm on a Friday evening, so we can't complain, since the staff were all friendly! My only gripe would be that they have a 10 dollar minimum for credit card purchases, so if you only order a meat pie (or something under 10 bucks, which is a lot of the items), be prepared to whip out some cash. I only mention this because I rarely, if ever, use cash.", "author": "Andrew T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-08", "description": "Tried and liked: hummus, muhammara, grape leaves, lamb sausage, chicken shawarma. All tasted great, but their pita was the best I ever had. They roll the pita and bake it before your eyes, and I like and appreciate the fact that they don't hide in a kitchen when they cook your meal. Guys that work there are kind as well. Next to try is their kebabs.", "author": "Bee G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-06-11", "description": "Fresh pita bread, freshly fried falafel and muhamara = a great sandwich experience. I've only ever gotten the falafel sandwich at lunch - I really need to branch out - but it has never failed me. Definitely the best falafel option around and it's never too busy.\n\nThey always ask me before slathering any of the spicy on ... and I always ask for extra. I recommend you do the same.", "author": "Andrew B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-29", "description": "Yummy!!!\n\nIf we had only gotten the falafel I would have given them five stars. It was amazing! fresh pita, yummy spicy sauce (muhammara), and the falafel itself was fresh crispy, and flavorful. \nAs a couple of other people mentioned, they did get the order a little wrong.\nThe Za'atar bread wasn't great- kind of dry. The Leek pizza was decent- but was just sauteed leek- didn't have the promised fenugreek flavoring. \n\nWill stick with pizza, and be very happy.", "author": "Julia F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-29", "description": "I've been here twenty or thirty times. Normally I get the falafel sandwich, which is pretty good and too big to finish, but sometimes in the evenings I might get one of the meat platters, which are simple but delicious and also very generous in size. The chickpea salad is decent too. And the guys behind the counter are always friendly.", "author": "Ned B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-08-31", "description": "i wanted to love my pitza.  i really did.  but it was just so so.  too much cheese, not enough...something else.  i don't know.  the flavor was a little flat on the leek one, and i'm a leek fanatic. \n\nmy friend got the sun dried tomatoe (sic) and his was pretty good.  what was really good was when we swapped a slice each and i put the tomato with the leek.  \n\nbut even tho the pitza wasn't the most spectacular thing in the world, the guys there were super nice to us.  the price was spot on ($8), and i had enough left-over for lunch the next day.  plus, floyd is just around the corner, so there's that.", "author": "Rachel H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-02-06", "description": "So, here's the deal. If you, like me, are a fan of delivery, then you'll, like me, be a fan of Fatoosh. You just have to know what to order. \n\nThe chicken pitza? Not a good idea, unless you like an alfredo sauce'd pie that's much more cheese than chicken (it sounds better than it actually is -- trust me). The falafel? Great. The kebabs? Very good. The spinach pie? Yum.\n\nPersonally, I'm not a fan of the mahammarah sauce, and Fatoosh slaps it on everything, so if you're not into it, speak up. The hummus is a tad bit on the salty side, but it's still tasty, and, hey -- Who am I to complain? It's a solid place.", "author": "Krissy G."}], "servesCuisine": "Pizza", "priceRange": "Under $10", "name": "Fatoosh Pizza \u0026 BBQ", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "330 Hicks St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/E8tBAyaQ0TCAJRij2NJXAw/ls.jpg", "@type": "Restaurant", "telephone": "+17182430500"}