{"aggregateRating": {"reviewCount": 98, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-05-12", "description": "This place is a solid joint for dinner. I've never had the pizza and didn't realize that Pizza was in the name until now.. I always go for something a little more middle eastern and am always satisfied. The gyro platter is solid and will fill you up for $10 - probably enough for 2 meals, actually. \n\nI've always taken my food to-go but the place looks clean and like a good place to take a seat and enjoy your meal.", "author": "Chris P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-08-18", "description": "the falafel sandwich is good. the falafel and tahini are good, and the bread is really good. \n\nthe hummus, fatoosh, and zaatar, though, are bad - the hummus it's thick with a bad texture; it tasted store bought. the fatoosh looked and tasted like an iceberg salad served as a side at a pizza place. it had green peppers and canned black olives. the pita chips were just ok. the dressing wasn't authentic; it was just italian dressing, and drowned in it. the zaatar was really crispy and completely dry; it didn't taste fresh and wasn't warm. friends i ate with also said the lamb sausages were dry.\ni'd eat the falafel sandwich again but i'm sure there are better places in the area. i'd be reluctant to return because i'm not optimistic about their other mezzes.", "author": "Kaelen H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-30", "description": "It has a healthy feel/taste to whatever I'm munching on, usually the kebab with a lot of humus. Very reasonably priced.", "author": "Ralph L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2007-08-02", "description": "It's true, perhaps the best falafel around.  I mean, it's on the spicey side, especially with the mahammarah sauce (a red pepper spread of some sort), but wow, what flavor and texture.  I wish I had a camera, I'd put a picture of it here.  At any rate, they make their own pitas on site, so you get a hot fluffy pita with most every meal.  They have all the basics, without much flair, but its got this homestyle goodness.  The couscous salad is pretty simple, but the subtle spices they use bring out something beyond the traditional halal-cart fare.  It's worth a shot, but I'll bet you'll be back.  2nd only to Damascas Bakery in my opinion.", "author": "Rhett H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-02-28", "description": "Had dinner here the other night, my lady and I had a 5 salad platter and a falafel platter.  Everything was fresh and tasty.  The home made pita is enough to annihilate the surrounding competition.  The kicker is that this place is totally affordable.  We spent about $22 and that was with a tip for the boys behind the counter.  I can't believe I have not eaten here more....", "author": "David C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2006-09-19", "description": "Best Falafel in NYC hands down. Forget Mahmouns and everything else people say. Not overcooked, always friendly, and they deliver if you're in the area. If you like is spicy, make sure you get it with the muhamara sauce.", "author": "Shaun A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2008-10-19", "description": "This place is fine. It is quick and the service is good. The food wasn't exceptional, but it is a solid \"Go To\" place.", "author": "Sachin P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-02-02", "description": "MY favorite thing from this place is the fatoosh salad.  Very fresh tasting and yummy.  Other stuff  is pretty good too, but the salad with the pita chips is my favorite. mm.", "author": "M F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-09", "description": "https://www.facebook.com/fatooshfood", "author": "Nor D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-11-30", "description": "This place is plentiful, delicious and incredibly cheap.  Hot fresh pitas, delicious hummus, etc.  Only thing preventing 5 stars is that they horribly overcook the meat unless you beg them not to.  Order once a week and highly recommend.", "author": "Dan B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-06-19", "description": "I love this place. I used to live nearby, and had Fatoosh once a week. Fresh, reasonably healthy, delicious.\n\nMy favorites: vegetable platter, pitzas, falafel sandwich, any of the dips (e.g., hummus).\n\nNice people, reasonably priced, and fast.", "author": "H. S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2009-08-18", "description": "This place is very very average.  The best thing about my dining experience was the Clementine sparkling water that came from a bottle.  I thought the food was very overpriced and not all that good.  I don't think I'll be coming back.", "author": "Leigh M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-05", "description": "Oh, man, do I miss this place since I moved out of Brooklyn Heights.  Somewhat limited menu, but what they do they do amazingly well--super-flavorful Middle Eastern food at decent prices.  The platters are immense.  David, who runs the place, is about the nicest guy in the neighborhood.  Highly recommended--definitely the best spot in its corner of Brooklyn Heights.", "author": "Jack F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-13", "description": "Great food, pleasant staff. Try the spinach pie!", "author": "M R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-09-09", "description": "I'm a big fan of Middle Eastern food and I especially love it when it's served quickly. I definitely like this place as I've already eaten here twice within the last week. I enjoy the falafel and the kafta kebab platters. I'm not too much a fan of the sandwiches, but that may be because I got it delivered and the hummus made it kinda soggy...still tasty though to say the least. Nice people working there, definitely would recommend the place if you're in the area.", "author": "geraldine mae c."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2007-06-27", "description": "I've got a serious middle eastern cuisine love. This is essentially fast food but you'll be hard pressed to find any better. They make a pizza style here that is like a pita pizza which is quite tasty but I usually stick to sandwiches or platters. My favorite is the Kafta kebab in both departments. the platter comes with a large heaping of rice and barbecued veggies, a tasty, creamy hummus, and that red spice stuff I always forget by name. And a freshly baked giant pita. I usually make a few sandwiches out of all the components but the sandwich is also awesome. The grape leaves are so minty and delicious that I have them put on a sandwich with hummus and it's such a refreshing taste explosion. The spinach pie is huge and so tasty.This place has a lot of competition and I always end up coming back loving it more. And the prices aren't out of control like other places. I'm looking at you Waterfall Cafe and Zaytoons. There's some haters out there but their palate just might not understand. There's something here for everyone. Perfect for delivery or take-out. If you're not pressed for time or the convenience of home there's a couple of tables but not much more.", "author": "carl g."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-01-28", "description": "superb food for a superb price.  i never knew spinach pie could be so good.  i recommend getting it if you go there.  the pizza is impressively good.  i've only had delivery there, so i'm not sure what the place actually looks like.", "author": "cary s."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2007-12-27", "description": "it's all about the fish kebab. that is all i ever get here.....\n\nnot saying other stuff isn't good but it pales in comparison to the fish kebab.\n\nVERY SLOW THOUGH. and small space to eat. but freshly made.", "author": "Mo C."}], "servesCuisine": "Pizza", "priceRange": "Under $10", "name": "Fatoosh Pizza \u0026 BBQ", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "330 Hicks St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/E8tBAyaQ0TCAJRij2NJXAw/ls.jpg", "@type": "Restaurant", "telephone": "+17182430500"}