{"aggregateRating": {"reviewCount": 98, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-26", "description": "Food is delicious. That being said, the delivery could have been a little bit quicker (I don't want to have to wait an hour for my food) and gyros could have been packed separately- this kind of irked me when I had to share the same tray as my boss. I'll probably be back though maybe for a pickup instead. Chicken gyro was just so darn tasty!", "author": "Elle L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-25", "description": "I'm a big meat eater but believe it or not, when I come here I usually get a lentil soup and the selection of dips (combination salad platter) - I love the muhammara - I could eat that stuff by the bucket.  Since I no longer work in the area , I have't been there in a while but I really much go back.", "author": "Joe B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-01-25", "description": "A decent lady finger, but it's also a by pricey. Service could have been faster, but the guys were rather pleasant.", "author": "Dominik D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-24", "description": "I love this place - the food is always so fresh!  Their portions are very generous too - I'd recommend the grilled chicken platter, chicken/eggplant sandwich, and lamb sausage platter. The employees are really chill and friendly so make sure you leave a tip for them especially if you sit down and order table service. I give this spot a thumbs up since they load the platters with grilled veggies (definitely a healthy option). I've tried the chicken pitza once and it was overly-salty so never ventured into their pizza menu again. Finally, the prices are fair, it's certainly not cheap.  GO VISIT!", "author": "Marc L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-26", "description": "Neighborhood gem.\n\nVaried menu. Fresh ingredients. Fast delivery. Friendly service for dine in.\n\nBig fan of their sandwich wraps and they even have whole wheat options. \n\nI've tried many things on the menu from the middle eastern pizzas to Kababs and they are all good. Their Fatoosh salad is fresh, simple and yet somehow addicting.", "author": "David S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-04-03", "description": "Decent food.  Fresh pita and grilled meats.  \n\nSadly, it's highly disorganized and they too frequently screw up phone orders, such as by forgetting that you ordered.  You'll end up waiting about 15 minutes for an order so plan ahead.   They won't offer you any discount or food while you wait, even though their error caused the delay.", "author": "Hey A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-16", "description": "Delicious little spot for some good middle eastern food. I had the grilled chicken wrap and it was everything you'd want in a wrap! Freshly grilled chicken with the perfect char, lettuce, tomato, and a yummy creamy garlic sauce. My friends tried their platters and really liked them as well. The food is made to order so it took a little while to get our orders to go after we came in and placed the order. But not really complaining since they were being made fresh. I'd call in the order if you're in a rush.\n\nDefinitely a great take out spot; they do have seating inside but I knocked a star off because its a little dark and not so inviting inside. The guy taking your order is super friendly and he threw in a bunch of extra garlic sauce for us as well. Give them a try if you're in the area.", "author": "Renu A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-05", "description": "Great place -- don't let the name fool you, they do Mediterranean very well! Nice people and highly reliable wraps.", "author": "Evan F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-15", "description": "Always delicious! Ask for a pot of their hot sauce too. So good", "author": "Imogen A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-28", "description": "Best Baba Ganoush! Been going here since 1995", "author": "Rob S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-18", "description": "Came by to pick up lunch today and I grabbed a fish kebab sandwich.  Man, it was really good.  The pita was warm and soft.  The fish was seasoned \u0026 grilled to perfection and they really pack it in the sandwich.  Can't wait to try more items on the menu.", "author": "Blesson S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-17", "description": "One of the most delicious meals i had whole visiting New York. I ordered the chicken shawarma wrap and it was so good. The chicken was soft and so flavorful. \nI would recommend getting a side garlic sauce (though don't get too close to anyone after because your breath will be stinky, but its so worth it). Everything is really fresh and it was perfect for the rainy day in new york. The people working were also incredibly nice and were quick to take our orders and make the food.", "author": "Prianka K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-11", "description": "I've been here a couple times, and is my favorite place to stop by before or after my Zogsports league on the pier. I've only had the chicken shawarma. The service is like a local shop, friendly in a more personal way. What I like about this place is that it is just around the busy street, so it is a little quieter. The foot traffic is decent but not annoyingly busy. I feel perfectly normal eating there by myself or a small party.", "author": "John F."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-05-20", "description": "Latino middle Eastern food... No good, not sure where they get people get the love for this place. With all the middle eastern places in Atlantic, why would you come here? Sorry.. Not a fan", "author": "Paloma D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-14", "description": "Soooooo much better than I thought it'd be... Had grilled chicken platter and 5 salad platter. So fresh... So tasty. Will for sure get this again.", "author": "Optimist O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-24", "description": "Went to Fatoosh...and fell in love. They make their own pitas here and that's the main point. They have a nice menu and tout their pita pizzas they call pitzas. We didn't try them, but the platters were amazing.  Comes with hummus, rice, side salad or muhhammara. Yum! The pitas were fluffy and rolled right in front of you, served to you hot off the grill. Nothing compares! We ordered a side of babaganoush as well. The platters were huge and flavorful. Very good. I got the lamb shish kabob, hubs got the meat combo which consisted of two meats--lamb sausage and kefta. It was excellent. Prices were extremely reasonable. They have free delivery. A must stop.", "author": "Cassidy L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-02-08", "description": "We were walking around the neighborhood and found this place by accident. We got salads and kebab. Prices are not bad and portions are medium sized. Not sure that I would go back especially for the food here, but it's a good place to drop by if you are looking for something decent at a reasonable price.", "author": "Rosa L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-26", "description": "I grew up eating authentic middle eastern food and this place doesn't disappoint. Don't pay any attention to the name, which initially caught me off guard as well. Fatoosh is a delivery and takeout spot, however the food is always fresh and delicious.", "author": "Laura P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-12-09", "description": "Stopped in one night and had the falafel platter. First off, they have spots to dine, but it is not really a dine in restaurant. I was the only one there on a Saturday night! Most of their business is delivery/takeout. It was freezing inside! I had to keep my coat on. \n\nThe hummus and muhammra were ok. The latter was actually pretty good, but a bit liquidy compared to others I've had. Then falafel, that was where I was sad. It was not fresh! It came out of a mix! I have had some great falafel, but this was not it. It was very dense, almost gummy when chewed, and very uniform in texture. No fresh parsley or anything. I paid 7 bucks which is a nice deal but overall, not what I was expecting given the reviews.  \n\nMaybe I should have gotten meat or something, since that is what most people seem to be getting here, but falafel is such a middle eastern standard I was sad it just fell flat. I might come here again if I was in the area, but definitely not worth any particular effort to go to.", "author": "Dominick B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-13", "description": "Easily one of the best places to eat in the area. The food is delicious, there isn't an item on the menu that wouldn't like. My personal favorite is the lamb sausage, you can't go wrong with anything else on the menu such as the chicken shawarma.", "author": "Waleed K."}], "servesCuisine": "Pizza", "priceRange": "Under $10", "name": "Fatoosh Pizza \u0026 BBQ", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "330 Hicks St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/E8tBAyaQ0TCAJRij2NJXAw/ls.jpg", "@type": "Restaurant", "telephone": "+17182430500"}