{"aggregateRating": {"reviewCount": 98, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-23", "description": "Great food. Definitely recommend the chicken / mixed grill platter. Lentil soup, platters and bread are my favorite things from the menu. Recommend 100%", "author": "Basil A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-03-01", "description": "There's no bathroom here, just throwing that out there. \n\nBut apart from that, I had a meat platter with chicken shawarma and shish kebab, with rice, baba ganoush and hummus. Everything was perfect, except for the shish kebab which was extremely tough but well-seasoned. The chicken was tender and juicy and bursting with flavor. The hummus and baba ganoush felt fresh. The rice too was delicious, which was surprising considering it's just rice. Maybe I was just really hungry.", "author": "Myles C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-11-30", "description": "Interesting (mostly takeout) place at the edge of Brooklyn Heights. We ordered there mostly because we were staying just around the corner with friends for 3 weeks - we liked it enough to order takeout three times.\n\nBasically an eclectic combination of cultural dishes, we really liked the baba g'noush, and the greek \"like\" dishes were also tasty. We tend toward gluten free and such, which confused them, but they tried to comply with what we wanted.\n\nOverall, very nice place. They do have a place or so to sit, but it's for order and go.", "author": "Dan D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-11-28", "description": "I don't know what's happened in the past years, but it's become a great deal of disappointment. Overcharging and not completing phone orders, being told not to call during \"busy hours\". \n\n\nWhat is happening with having manners, professionalism, integrity, hospitality? Fatoosh take notes when you started losing customers you should've questioned yourself, not be disrespectful to your loyal customers.\n\n\nYou see \"We The People\" pay you for service and food, not the other way around........ try Karam in Bay Ridge! It's worth the travel!!", "author": "Honest T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-06-13", "description": "So welcome one and all to the head end of Atlantic Avenue,  close to the former working waterfront.  Back in the old days it was an immigrant area with a population of Syrian Coptic Christians.  Nowadays it retains some middle eastern flavors, but the small ethnic enclave have seen a bit of a decline.  The small Yemeni population moved down to the northern fringes of Bay Ridge, and as the former freight terminal (Piers 1 to 7) was replaced by Brooklyn Bridge park, the local real estate got even more valuable.  There are effectively 2 \"bookend areas\" to the park.  On the Cobble Hill/Pier 6 end you got the Middle Eastern cuisine on Atlantic Avenue.  On the DUMBO/Pier 1 end it's Juliana's/Lomboardis/River Cafe and the neo-yupster renaissance.  This bookend effect is more pronounced when you consider that there are 2 restaurants serving similar wares on the same street, but yet, they are very different, both in terms of style and quality.  I speak of Tutt Cafe on Hicks \u0026 Middaugh, and Fatoosh Pizza, which is on the other end of side of Hicks on State Street.\n\nTutt Cafe is a bigger sit-in establishment with a dignified exterior and a quiet, dark and cozy interior.  Fatoosh is a small take-out counter with small amount of bright functional seating.  You can, if you want, spend an afternoon sipping Arab coffee and read your papers (provided that the place does not get busy), while Fatoosh is implicitly \"eat and get the hell out\".  Both places are slightly off a busy intersection near the BQE, and both are technically within Brooklyn Heights.  However, their signature fares are very different.  Take, for example, the pitza, which is basically a variant of the typical middle eastern flatbread that is either oven cooked, or on top of a saj (dome-like griddle).  If you had the Tutt Cafe version of their chicken pitza, it's crispy and light with marinated chicken thighs and the intense flavors of red peppers and green onions.  The Fatoosh version feels heavy and dense, with pre-cooked chicken breasts and plenty of cheese.  However, it felt...dull, since they used zucchini and onions, which weeps out as it cooks - their version is neither fish nor fowl - it's not thin and crispy with minimal cheese, nor was it hearty with tomato sauce like an actual pizza (if I want that, I'll hit Table 87 down the block anyways).  While I can sit at Brooklyn bridge park with the missus we will finish a Tutt Cafe pitza, after the 3rd slice or so of the Fatoosh version we were ready to give up.  \n\nNow, is it reflective of their other wares?  Well, I didn't have a chance to try their kebabs, and as for the salad platter, they were pretty good.  I am pretty sure that they are fine, and based on observations of their constant food delivery traffic, the locals think well of them (although judging by the boxes, the locals seem to only order salad platters or kebabs.  However, unlike the Tutt cafe they don't have specialty beverages like, say, the Loumi (a tisane made with sundried lemons) or khakharday (hibiscus tea).  The entire place felt like a normal local Vinnie pizza/gyro joint in Brooklyn, which they might as well be.  Perhaps come for the barbecue, but certainly not for the pitzas.  Leave that one to the place on the other end of the street.", "author": "Kevin K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-25", "description": "seemed like it has potential to be the go-to delivery spot for middle eastern food in the area. However, the food missed the mark. \n\nI tried the fish platter with hummus, veggies, and some sort of spicy red sauce. The fish was ok but did not smell great. The hummus was smoother than I am accustomed to. The red sauce had good flavor and added some much needed heat to the dish.\n\nOverall, not my favorite spot but may try something else next time.", "author": "Nicholas G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-09", "description": "There are about a dozen middle eastern places in the are and this is probably the best.everything is spiced well, even the grilled vegetables are great.", "author": "greg j."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-10", "description": "Yes... Just Yes... You should eat here. Everything was good. The staff is flexible and light-hearted.", "author": "Mark R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-05", "description": "The pizza dough was uncooked and tasted horrible. All the parts fall apart from raw dough", "author": "Armen B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-18", "description": "This is the best middle eastern food I ever had. The mix grill platter is delicious. The muhamara \u0026 hummus that comes with plate is tasty especially when mixed in with the meat on their fresh hot pita bread. Also the fish was very tasty. If you are vegan then this place is also for you.", "author": "Safet F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-03", "description": "I love this place. I always make it a point to come here at least once whenever I'm in New York. The shish kebabs are marinated and grilled to perfection. They have this char to them that keeps you wanting more and more. I go for the platters because I want it all. Plus you can build your own little bite-sized sandwiches with the delicious pita bread they have. Add a little lettuce, maybe some couscous, and a dash of their muhammara and you're in for a little bite of heaven. I with I could find somewhere as delicious and authentic as this place in Chicago!", "author": "Tha S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-25", "description": "Wow the Fish Kebab Sandwich/Wrap is a must try. Ok they have your usual Chicken, Lamb, Veggie Kebabs buy the Fish is a HIT! Of course you actually have to like fish. They grill the fish so it has this crunchy grill flavor. The sandwich has the usual of lettuce, tomato, and the tzatziki sauce. Its filing but not overwhelming. If you're going to pick up order ahead of time so you give them time to make it. Its fresh!", "author": "Veronica R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-03", "description": "New resident to the area and have been ordering from Fatoosh since moving. I've been pleased with my orders every time. The gyro sandwich is my favorite, but all the sandwiches have been great. I would suggest adding french fries to the menu to go along with those delicious sandwiches! Overall very good staff, very good food.", "author": "Aga N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-29", "description": "We've been enjoying delicious food from Fatoosh for many years. Everything is always so fresh. One favorite is the Chicken Shawarma wrap, which as others here have mentioned have some sort of pickle in it that really enhances the sandwich. And I don't even like pickles! Also the delicious Spinach pie, which I usually order with less cheese, but I'm just trying to cut down on cheese. You'll probably want all that delicious melted cheese, and I can't blame you! The fish platter is great too, and the falafel is good.\n\nThe guys who took it over a few years ago have managed to keep it just as good as it ever was, which is an accomplishment in itself, and everybody there is always really nice.\n\nTheir deliveries are reliable and the food always arrives hot. But lately I've been walking down to pick it up, as I need the exercise!", "author": "Rick E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-12", "description": "I've been here a couple times, and is my favorite place to stop by before or after my Zogsports league on the pier. I've only had the gyro wrap. The service is like a local shop, friendly in a more personal way.\n\nWhat I like about this place is that it is just around the busy street, so it is a little quieter. The foot traffic is decent but not annoyingly busy. I feel perfectly normal eating there by myself or a small party.", "author": "Douglas L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-14", "description": "Their gyro wrap is like no other. I can simply just eat the wrap with butter and be content. Being just content is not the american way though so I ordered their NEW bbq chicken gyro and it was almost perfect. The chicken and the bbq sauce were perfect I just wanted more veggies in the gyro. Their combination platter is also good but you can get your food with varying heat levels as a result so ask them to handle that if you like your entire plate hot. \n\nThe gentleman that served us was very very outgoing and presumptuous but in a good way. it added to a very positive experience. Will be trying their middle eastern pizza next .", "author": "Kern C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-06", "description": "I originally came to this place wanting a classic gyro. I realized quite quickly that this is not the place to get such. As long as you go to this place knowing it is not your typical Mediterranean eatery, you WILL fall in love with their food. Once I discovered the chicken shawarma pita, I fell in love....HARD. The flavors are so unique! It has an amazing sauce and a sliver of delicious pickle(I didn't think that sounded good either, but trust me). I've eaten that schawarma twice in 4 days. \n\nYes. My name is Mike. And I am a shwarma addict.", "author": "Mike S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-05", "description": "This place is great.  You alread know that.  Here are some important tips:\n\n-It is a store front more than a restaurant...no waiter service, though there are tables\n-everything is so good, and there are so many options, combos are the way to go\n-the pizza is very good, and even better cold and soggy the next day--I'm serious!\n-mouhamara is very good but a little spicy\n-portions are generous, so value is good", "author": "Craig Z."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-09", "description": "Pizza? BBQ? Nope. \n\nDon't be fooled by the name of this place -- Fatoosh serves up the best falafel, gyro, and all those delicious Middle Eastern dishes that I can't pronounce, in the city! Great option for delivery, too! \n\nThe falafel plate is a bargain and comes with a bunch of different sides that'll make you feel good!", "author": "Scott G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-14", "description": "Grateful that I found this place. Quick delivery by a Seamless guy who bared the rigid cold on his bike. Delicious food and fair prices. Great stop for lunch or an easy dinner.", "author": "Sophea R."}], "servesCuisine": "Pizza", "priceRange": "Under $10", "name": "Fatoosh Pizza \u0026 BBQ", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "330 Hicks St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/E8tBAyaQ0TCAJRij2NJXAw/ls.jpg", "@type": "Restaurant", "telephone": "+17182430500"}