{"aggregateRating": {"reviewCount": 439, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-29", "description": "We had the \"welcome dinner\" for our wedding at Bacchus in late May and were extremely happy with it. We had about 65 people in the outdoor garden. \n\nCompared to other restaurants in the area, it's extremely reasonable price-wise. There were no other venues that had a lovely garden that could seat such a large group of people. \n\nThey do a lot of events and run them like clockwork. Unfortunately, the night of our event it torrentially rained. When we arrived, the outdoor garden was completely covered and still looked beautiful, despite the horrible weather. The dinner was seamless in terms of everyone ordering, the food arriving on-time and accurately, wine service, everything. \n\nThey give you a pretty vast choice in terms of what you can put on the menu, so I would recommend eating here a few times to try the different options out. We chose the branzino, gnocchi and half-chicken and everyone was raving about the food. The food was way better than the food at our actual wedding, which wasn't bad. \n\nIf we didn't want to have a band and 100+ people at our wedding, I honestly would have considered having our actual wedding at Bacchus. When we were trying out the food, we were there one night when one was going on and it looked lovely!", "author": "Rachel E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-15", "description": "Let me tell you about some unlimited mussels. \n\nNO, not my unlimited amount of muscle! I wrote MUSSELS! \n\nBacchus is a fantastic French restaurant on Atlantic Avenue. They serve fine French cuisine and are stocked with some amazing wines. \n\nThe big draws here though, is their unlimited mussels deal and the beautiful outdoor seating they have available in the back. \n\nEvery Tuesday you can get unlimited mussels for $15. And you don't have to stick with one flavor. You can get whichever ones you're in the mood for.   \n\nThe back is great when it's nice out. It's absolutely gorgeous. Lots of room too, so unless you're a huge group, you should be able to snag a table. \n\nMost recently a couple of friends of mine decided to have their wedding here after some unfortunate circumstances. It turned out to be a wonderful time. It went without a hitch and the breathtaking backyard made it even better on a beautiful spring night. Bacchus really came through in the clutch. \n\nWhether you want to take advantage of some mussels, tasty wine, throw an event or just enjoy a delicious meal, Bacchus has you covered.", "author": "Mitch E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-22", "description": "Came to this restaurant for a Valentine's Day dinner. There was an excellent prix fixe selection for a very reasonable price.\n\nThe dining room was very quiet and quaint. Really excellent ambiance. It was nice and warm too which was nice considering how cold it was outside. Our table was very close to a swinging door to the kitchen, which the servers also seemed to think was too cramped. That is a very minor complaint though, the restaurant wasn't super busy, so waitstaff only walked by once or twice.\n\nI would recommend asking to sit in the main room instead of the back.\n\nThe prix fixe menu had a big selection. I ordered the beef which was excellent. The foie gras was nutty and of excellent quality, but was maybe a bit under salted. The desert was really great, a raspberry macron with vanilla bean filling. There was champagne included with the prix fixe that was very good (I am not a wine or champagne drinker so I am not sure if that is accurate to a more seasoned palate).\n\nI would be happy to come again.", "author": "Joseph N."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-06-18", "description": "This was a pretty nice with good food and good service.   The hiccup we experienced was that an are was reserved and the restaurant had bumped us.   I don't know if this is a pattern, but it does not look good.  Hopefully it wasn't.", "author": "Wil C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-30", "description": "I came here for a wonderfully sweet baby shower. The venue itself has a nice vibe. It accomodated us well, + the space was just right for our party. \n\nSo, here's what I can tell you about the food I had while I was there:\n\nApp: crab cake, very good. The sauce + everything with it was yummy. It had a mix of different flavors, salty, sweet, + a little kick to it.\n\nEntree: mushroom ravioli. Just an fyi, I loveeee salty food, + the cream that went along with the ravioli was salty alright. But to a point where you would need a drink to swallow it all down. This dish had flavor, but the sauce was quiet heavy on salt. \n\nDessert: tiramisu. The tiramisu looked pretty when it came, but after tackling about 1/4 of it, it became too heavy for me. \n\nOverall I enjoyed the place + the food was presented nicely. : )", "author": "Cassie L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-14", "description": "They organized a great meal for a private party of 25, delicious, reasonably priced, and fantastic service. They allowed us to move from the patio inside because it was super hot, and they only charged us for 24 since 24 showed up. And the food was all fantastique!!!", "author": "Adam K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-21", "description": "Bacchus was amazing. Period. My wife and I got married her almost a year ago, and it was an unforgettable night. Meryl was extremely helpful, kind and professional.  She even helped us with the layout and organization. The outdoor space was perfect for our small and intimate wedding. There were patrons in the restaurant at the time of the wedding, but it was completely separate. We also got congrats from the patrons and staff and every one was polite as can be. I would definitely consider renting the space again for another event. 5 stars all the way around.", "author": "Jesus S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-04", "description": "Came here for lunch and am a fan of the interior. Old ceilings, rustic feel; smooth French environment (but the music wasn't all French, drats).\nI ordered a frisse salad with pork belly and two poached eggs ($13.95). Plenty of pork belly pieces throughout the the dish, and boy it was pleasant! So tasty and ample amount of fat to meat ratio too. The poached eggs were slightly over done, the yolks weren't runny. A wonderful plate overall.\nI noticed the salmon dishes were very well plated. The Madame sandwich with an egg was small, but it came with a bucket of fries instead of roasted potatoes.\nService was slow, but there was only one person (boss maybe?). But all the entrees come out together. An enjoyable experience and looking forward to my next visit.", "author": "Kenny L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-15", "description": "Amazing food. The ambiance was very cozy, intimate and trendy all at the same time. French everything, the style, the food, the people, the atmosphere. \n\nI ended up just ordering something light with coffee.\nSOUPE A L'OIGNON GRATINEE\nNAPOLÉON DE CRABE\nFOIE GRAS MAISON\n\nAll very spectacular!", "author": "Harry T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-10", "description": "Came to try their bottomless Mussles. It is a very nice restaurant, with great decor and ambiance. Excellent for a romantic evening! \n\nMussels provencale were on point BOTTOMLESS :) ; we also tried their L'onglet, they cooked the steak to perfection. \n\nService was excellent!", "author": "Gigi R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-08-12", "description": "The food was  so so that's all I have to say \nThey were hosting a private party in the garden and we were eating outside it was terrible because of the noise \nThe service was good but the food was ok", "author": "Myrisse D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-04", "description": "I had my 50th birthday brunch at Bacchus in December 2017 based solely on a friend's experience there and they did not disappoint. First, Meryl and Alvaro made the planning effortless and catered to my every need. The day of the brunch everything went brilliantly. Service was lovely and friendly (I was greeted warmly by Alvaro, who was overseeing the party). The food was delicious! My guests raved about the wonderful flavors and attention to presentation. My menu was hearty and rustic, which was a delight to my out of town guests who were famished! My friends are STILL raving about what a lovely affair it was...Merci beaucoup, to the staff at Bacchaus.", "author": "Joanne A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-19", "description": "Amazing. I had the Escargot and the CASSOLETTES DE MOULES(mussels and French fries!)and a Muscadet which is a dry white. Don't miss this if you like French cafes.", "author": "D C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-03", "description": "Before 7:30 or 8PM this place can be quiet and great for a nice intimate dinner. However after that time, you will expect big parties and loud folks making this a family place. \n\nThere are around seat for 20 to 30 people and it's fully packaged on a Saturday night after 8. If you come before, you can expect seats. The ambiance might be different on a weekday but I will definitely come back.\n\nPrice is very reasonable including drinks, app, entree and dessert can set you back $80 to $90 which you can easily spend 2 hours. Expect cheaper option too of course. The portion is no joke. They are HUGE so please keep it that way. The wine isn't generous thou :(\n\nTaste is definitely great and flavorful for the steak and mussel ordered. The steak is tender as expected and fresh coming with fries and salad well seasoned. I love the mushroom sauce that comes with it as well. The mussel is  great but they are so small :( \n\nGreat deal and I hope to be seated in the outdoor next time.", "author": "Kevin Z."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-16", "description": "I needed to take my staff to celebrate the end of a difficult period, got a table for 10 at lunch time right away. While the exterior looked demure and subdued, what a surprise awaited in the backyard. Lovely, lovely setting. The food was out of this world. I was quite rude and tried everyone's dish: started with an avocado gaspacho...yum, yum; then tried the quiches, authentic and delicious, the potatoe wedges reminded us a a jenga game, the moules frites was great, the salmon heavenly. We were getting overwhelmed, they they brought the desserts! Oh My! Chocolate thingies all over the place, tried the mousse au chocolat, the tarte tatin (upside down apple tart, nothing to do with American apple tart), molten lava cake. Anyway, want to know how impressed I was? I went back the next day for diner. The prices are decent, the staff very professional! Some loud and yapping French expat at the bar but that was for a very short time. Go hungry! Bring your romance on as the place is conducive to amorous thing, sitting there will accomplish the charming session you were about to put on.", "author": "Tata R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-03", "description": "Absolutely must try.  The food is delicious.  We have really enjoyed the duck.  The mussels are great too. The atmosphere is really wonderful and they have outdoor seating in the back.  The staff is attentive and super accommodating.  I feel lucky to live close to this great place and it is our go-to for a great dinner with out of town family and friends.", "author": "Marjorie W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-27", "description": "My wife took me here for dinner and it was excellent! First I'd like to commend them on amazing service. There was a wedding reception in the back, and they still managed to provide timely, attentive, and kind service. Every time our water bottle was empty, bam there was a new one. And just like in France, they don't make you feel rushed to leave.\n\nThe food was great as well. My wife had a hanger steak with a delicious mushroom sauce. I had the mussels in a Dijon, white wine and thyme sauce.  My wife said the chocolate molten cake was delicious.", "author": "Andrew W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-25", "description": "One of my favorite restaurant and terrific for date night. We used to live quite close and this was our go-to for a weeknight date or simply just a nice dinner with wine appetizer and dessert. Their specials are amazing and every version of the mussels are terrific. Their dinner deal is really great especially if you ask them to recommend a wine. In the spring and summer you can sit outside and listen to lovely music, having really fine French food great wine and the nicest servers. Service can be slow but I think that's just a part of eating at a French restaurant and I don't find it particularly irritating. The duck entree is amazing and I'm incredibly sad we don't live so close and can't go as often.", "author": "Christina W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-05-06", "description": "Great outdoor space and the French onion soup was amazing! Other food was good but not mouthwatering and the service was a bit slow", "author": "Jennifer W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-29", "description": "My husband and I got married here on Sunday, September 24, 2017. When we first started searching online for inexpensive venues, Bacchus was one of the few places to come up that didn't look like we were on a budget. Once we visited the restaurant, we completely fell in love with how beautiful it was. It's large backyard space which includes a tree that creates a gorgeous canopy was exactly what we were looking for. From that day on, Meryl took such great care of us. She answered all of our never ending questions and even provided wonderful recommendations for the florist, cake and photographer. During our visits, we met several couples who were celebrating their anniversary. They told us how perfect their Bacchus wedding was. They were sure ours would be just as special and they were right. We arrived at Bacchus the day before our wedding with all of the decor and provided instructions on how we wanted everything to be set up. When we arrived the following day, every looked exactly as we envisioned it. Meryl and her team did a fantastic job! The food was absolutely amazing and our guests kept commenting on how great the service was. Even though we had record breaking heat and Brooklyn's largest street fair was going on right outside the venue, everything was perfect. Bacchus is not your typical cookie-cutter wedding venue. It's special and intimate and we couldn't be happier with our choice to celebrate there.", "author": "Carmen D."}], "servesCuisine": "French", "priceRange": "$11-30", "name": "Bacchus Bistro \u0026 Wine Bar", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "409-411 Atlantic Ave", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/oriVKWBIxKF0EQiVu8iVqg/ls.jpg", "@type": "Restaurant", "telephone": "+17188521572"}