{"aggregateRating": {"reviewCount": 439, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-29", "description": "My husband and I got married at Bacchus in May 2017. Prior to planning our wedding, we had been to Bacchus for dinner and brunch, always having a wonderful experience. After beginning our wedding planning, Bacchus was an easy choice for our wedding venue.  We loved that Bacchus was able to accommodate a smaller wedding (we had around 60 guests), we were also excited about the ability to have our ceremony and dinner reception in the back garden.\n\nThroughout the year before our wedding, we were in constant contact with Meryl, an incredible person and resource, who really helped bring all of the details of our wedding together.  We had a wonderful food tasting followed by an equally wonderful wine tasting a couple months before our wedding. Meryl stayed in constant contact with us throughout these months, ensuring that everything was coming together smoothly.  As our wedding date approached and we had our last meeting at Bacchus we knew without a doubt that we were in incredibly great hands.\n\nOur wedding day was beautiful and came together perfectly. This was largely due to Meryl and the incredible team at Bacchus.  We received constant compliments throughout the evening on pretty much everything Bacchus had to offer including the passed hors d'oeuvre, entrees, wine and dessert. My husband created dinner and after dinner playlists and we were able to easily connect to the sound system at Bacchus, and the music during dinner sounded great. The garden is beautiful, so we did not really add much as far as decor, just simple centerpieces that we dropped off the night before and Meryl's team set up for us. At around 10 pm, our party transitioned inside to the wine bar where we were able to continue having a great time. The Bacchus team even brought in the remaining cupcakes on the cupcake tower for our guests to enjoy.\n\nWedding planning and staying on budget, especially in a place like NYC can be incredibly stressful.  We are so glad we went with Bacchus as so much of that stress was alleviated.  Their prices are more than fair considering the quality of food and elegance of the garden. \n\nWe continue to return to Bacchus for dinner and brunch, and can't wait to celebrate our 1st anniversary there.", "author": "Erica T."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-07-15", "description": "Food ok not much, service really bad.\nNo one to take care  our table for one hour and half \nThey charged us automatic 20 percent gratuity as we were a group of 6 people, explaining probably why they didn't give any attention.", "author": "Jérôme A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-07", "description": "Got married here in late August and I couldn't have asked for a better venue for an intimate wedding. From the super nice staff to the food, ambience and every little detail, Bacchus could not be beat. Alvaro had everything everything under control that night and leading up to the wedding Meryl helped finalize all the little details with me. I didn't get to eat much on the night of the wedding but had tried every single item we chose for the menu during the tasting. I was blown away and knew I was making the right decision.", "author": "Lydia K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-10", "description": "The food here was great.  I had the goat cheese pastry as an appetizer which was really good for dinner I had the Mai Mai which was just as good and for dessert I had this apple pie situation . My friends that were with me all enjoyed their meal as well.  Edwin our waiter was very attentive even on such a busy night.  Would definitely recommend this place to anyone who wants to have a really good meal over a conversation.", "author": "Madd M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-19", "description": "Went here for a bridal shower and the place was beautiful! The decorations were lovely and they have a gorgeous outdoor seating area. It's a great place to take a calm break from the busy city around you. for an appetizer we had a puff pastry stuffed with pear and goat cheese with a fig glaze. It was amazing I would go back just for that!  The quiche Lorraine was also very good. Overall this place was a good experience", "author": "Christina L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-23", "description": "This is my favorite french restaurant in Brooklyn!\nWine selection is out of this world \nMy favorite dish is their  parppadelle with porcini mushrooms ragout: so flavorful!!!\nDon't forget to try their chocolate fondant paired with the best vanilla gelato I ever had.", "author": "Francois V."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-08-14", "description": "I had this place bookmarked for some time  and a friend of mine had her wedding shower here. So, i kind of got to experience the place. When walking in there is a rustic look to the place. Our event was on the right side. On arrival the seating arrangements included a menu. The menu included a choice of a bellini or mimosa.  I had a mimosa and it was ok. We were given a salad, per the menu, that included greens with a toasted sliced baguette accompanied with goat cheese. The salad was great so i couldnt wait for the entrees. The entrees include half a chicken, mushroom ravioli, and steak. I ordered the chicken. Unfortunately, i didnt enjoy or finish it. The chicken was huge and smothered in a mushroom sauce. Anyone who knows me, knows  that i dont like food smothered in anything. I feel like its the chefs way of hiding all the foods imperfections.  Needless to say, it wasn't my cup of tea. I did hear that the mushroom raviolis were very good. What i will say is the staff was very attentive and quick on their feet. They were very polite. We had a great time here but i would come back for my own experience at the restaurant to try the food again.", "author": "Nadia M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-17", "description": "Horrible service, okay food that sums up this place. \n\nNever ever do an event here whether it's a pharmaceutical event or a baby shower or a bridal shower.", "author": "Mike Z."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-08-15", "description": "Came here for a bridal shower event and was honestly excited abt this place since i read good reviews and friend said it was nice.\n\nHowever, idk if its the room they put us in but the AC (2) were BARELY working and the 2 fans by the window/door panel didnt help since seats werent even there..\n\nThe whole party was complainin abt how hot it was, and asked to turn up the AC. U would think the mgmt team would either 1) turn up the AC or 2) provide lots of ice and cold cold water but they did neither!\n\nOur hostess was physically there but she was not involved. She never introduced herself and disappeared most of the time. My gf got so fedup she had to go behind the bar table to fill us up with cold water SEVERAL times. Ive thrown a shower myself for my gf and they always had a hostess and someone at the bar to attend to the party. This place did not! Nobody was in the room w us until it was either time to order food, serve food and clean up.\n\nThe only good part was she kept refilling us with brunch mimosas/bellinis but who needs to drink anymore alcohol when its SO goddamn hot?! To get dehydrated?? Wish she did that w ice and water instead..\n\nAs for the food, im not sure if it was busy that day or the atmosphere was way too hot that none of us can enjoy our dishes.. but it was the prolly one of the worst plate of eggs Benedict ive ever had. The muffin was hard and cant even be cut thru until the yolk of the poached egg literally sit and drench the muffin.. And the ham was the saltiest and most greasiest ham ive seen slapped onto eggs benedict dish.\n\nI only gave 2 stars cos of the decor of the restaurant. But other than that--many of us were not happy with the HOT space, service and food.", "author": "Linh L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-12", "description": "Bacchus is a very cute and quaint bistro in the heart of Brooklyn. It's the perfect spot for small to medium size events (bridal showers, baby showers, birthdays, you name it). My cousin had her bridal shower here last August, and everything went swimmingly. There is a great private area out back to host around 15 -30 people comfortably. On a hot summer day, the outdoor area was kept cool with shade, fans, and aesthetically pleasing fabric hanging from the ceilings. \n\nThe service was great - the staff was constantly checking up on the guests and refilling wine glasses (maybe that's why everyone had a good time?). From what I recall, the food was pretty good too. I enjoyed the steak, particularly the sauce that it was cooked in.", "author": "Karen R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-26", "description": "Came here before a show at Barclay Center and we did inform our server that we are in a bit of a rush and yet the service was a bit slow. The ambience is extremely cute and cozy and we were facing the gorgeous backyard which you face in the back room and it's made into a focal point by their giant French doors. We ordered a frises salad, a French onion soup, and a charcuterie plate to share as well as their Branzino main course. \n\nOne of my main pet peeves with servers is that they are somewhat cavalier in taking orders and NEVER write it down.  Indeed our waitress did not write the order down and I was right that she forgot our side order of mashed potatoes. Hey, your job is to take an order correctly and enter it into your computer. If you can't remember all the items that we order how about writing down?! \n\nThe food was really good, the French Onion soup (if a French restaurant has a good Onion soup- they pass in my book) was quite tasty, the Duck Frisee salad was good, the Charcuterie plate was quite skimpy and for the price is was very small, the Branzino (a fillet, not a whole fish) was very good. \n\nAll in all, a solid place - just make sure you get your server to WRITE your order down and don't order the Charcuterie plate because it's not worth the price for 2 teensy slices of Prosciutto and Cheese.", "author": "nina s."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-27", "description": "Delicious French food with a romantic atmosphere . great service and delicious wine--what more can a girl ask for? \n\nThey were able to fit us in a last minute reservation- the wines were delicious and reasonably priced (several bottles were $35). \nFor appetizer, the crab cakes and the brie puff pastry were good.\nThe standouts of the meal were the beef bourignon stew and the mussels.\nThe desserts were tasty as well-especially the profiteroles and the chocolate hazelnut cake.\n\nWe will definitely be back!!", "author": "Gina M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-28", "description": "This place is super cute with so much character. Back patio is key and the food tops it off. The server spoke to us in French at every occasion possible which was a nice touch and how I imagine he makes his tips. Wine came with a generous pour.", "author": "Ciara S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-10-06", "description": "The food is C-  at best.  The service is good as well as the ambience,  but if you're looking for a good French food  look somewhere else.", "author": "Edward V."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-07", "description": "I miss the old menu. No steak frites (hanger steak); just a bigger steak that is MP. And no more il flotantte or domes for dessert.", "author": "Ruth P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-11-26", "description": "The food was good, but not worth the price. The ravioli was literally 1 ravioli for 12 dollars. It doesn't make sense at all. It tasted good, but not that good. Worth visiting once, but not likely to visit again just because it wasn't noteworthy. The mussels were not as flavorful as I've have at other Brooklyn restaurants, and the truffle mashed potatoes didn't really have that signature truffle flavor there. The menu changes, but we didn't get lucky.", "author": "James C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-07-09", "description": "I came here with a big group for lunch on a weekday. When all the party arrived, we got seated promptly. Before coming to the restauant, we all had received a prixfix menu, but we were told that the prixfix option was no longer available. All of us ended up ordering individual dishes, which wasn't big of a problem.\n\nThe restaurant gave two complimentary dishes to share about 20 minutes after all of us had placed our orders. The escargot was okay. I've had better. I liked the pastry dish with goat cheese and creme de fraiche(?).\n\nIt took more than an hour older all of our entrees to come out. I understand it was a group of 20+, but it still was a ridiculous amount of waiting time.\n\nI had the salmon burger. Meh. The burger and thick potato fries were cold. The buns were dry and the salmon patty was just too bland and tasteless. Skipping breakfast and being served our food at 2 p.m., I ate the burger because I was starving. Would not order this again. \n\nOverall, I don't think I'll ever return. There are better options in Brooklyn.", "author": "Rachel L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-06-16", "description": "Alert: Brunch review only. \n\nBacchus falls into the group of Brooklyn restaurants that may have outstanding dinner (have never dined here), but simply want to be included in the Brunch Game (i.e. Olea, Madiba...) and it is *clear* that they don't do it well. \n\nThe food at their Brunch simply does not deliver. But the backyard patio is lovely.\n\nFirst, the bread. Totally stale. \n\nNext, the coffee. They might as well have poured me some Maxwell House or Folgers. It was bad... \n\nFinally, the Crab Benedict (Benedicte au Crabe): Potatoes were overcooked - stale and completely starchy. The bread was too hard and definitely not fresh. The sauce was pretty thick, lacked nuance and covered up the taste of eggs and crab cake. I couldn't even tell you what the crab tasted like. Does not hold a candle to the Benedict you can get at Joseph Leonard in the W. Village. \n\nI appreciate that they only serve wine and beer during brunch - another clue that brunch is not their forte, but a mere accommodation to us Brooklyn-ites. \n\nWill I go back? Sure.... Their wine menu looked great and I could see myself trying out their dinner.  Until then, their brunch food deserves 2 stars max. The extra star is for the great backyard patio since the ambiance during brunch is really important.", "author": "Fazeela S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-07-06", "description": "7/3/15\nFRIDAY LUNCH \n\nPROS:\n- Hamburger $13 Black Angus burger in brioche bun Served with French fries \u0026 salad. Burger was very good but fries were a no no.\n\n- Saumon Sauce Safran $18 - Pan serard salmon filet over vegetable Juliene \u0026 Saffron sauce. Salmon was delicious as well however it wasn't that filling. \n\n- Le Sandwich de Poulet $11.95 (Chicken, lettuce, tomato, avocado \u0026 aioli on ciabata bread) I love the avocado and they were very generous with it in this sandwich. The chicken was alright. thankfully it wasn't dry and it's pretty moist. The aioli really made the sandwich.\n\nCONS:\n\n- Fries were SOGGY, BURNT, \u0026 RE-FRIED.\n\n- ate out in the backyard and there's lots of FLIES/BUGS flying around. In addition to that you have a carpenter HAMMERING about on the roof making NOISES while we ate. It was very disturbing. Couldn't they have found a better time to fix the roof - e.g. before the restaurant opens for the day? We asked to go back inside to eat due to all the disturbances outside and we had a guy testing the speakers/mics while we were eating and almost asked us to move from our table again. His testing of the speakers/mics were annoying as well as a HIGH PITCHED NOISE WAS EMITTED and the speakers were right above our heads. Overall environment was not Good.", "author": "Teresa C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-27", "description": "My husband and I got married at Bacchus in June of this year and we're so happy that we celebrated there.  We wanted to find a venue that was simple, had great food, and a bar; Bacchus had all three. Some of the many wonderful things about having our ceremony and reception there included the garden/patio area in which we got married, the covered roof in the outdoor dining area that is retractable when there isn't rain, the ease of planning and dealing with Meryl - the GM, and many more.  The food was delicious, the drinks were great, we were able to bring our own dj who hooked right up to the house sound system, overall it was just such a great time. Also, we fit about 75 people in the patio dining area comfortably. \n\nIn a nutshell here's how our day went:\n-Guests arrived with the option to grab a drink or go sit down in the garden area where the ceremony was about to take place\n-Ceremony, short and sweet, outdoors on a beautiful Summer afternoon\n-Cocktail hour in the same area, chairs were removed quickly and painlessly so (plenty!!) passed hors d'oeuvres could be served\n-Guests moved to the dining area under beautiful draped fabrics, lights, and covered in plants\n-After dinner, the celebration moved into the wine room for drinks and dancing. The room was solely for our use as the restaurant can be bought out completely for the night (we didn't meet the minimum person requirement for this)\n\nI'd strongly suggest checking out Bacchus if you're looking for a nice low key wedding/celebration. The staff were all amazing and everything went perfectly.", "author": "S D."}], "servesCuisine": "French", "priceRange": "$11-30", "name": "Bacchus Bistro \u0026 Wine Bar", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "409-411 Atlantic Ave", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/oriVKWBIxKF0EQiVu8iVqg/ls.jpg", "@type": "Restaurant", "telephone": "+17188521572"}