{"aggregateRating": {"reviewCount": 439, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-06", "description": "I stumbled upon Bacchus on a Saturday night after a nearby restaurant told me the wait was 1.5 hours. At Bacchus we were seated immediately in the outdoor patio with string lights and potted plants making the back space truly magical. The music was a eclectic blend of Spanish, Jazz and American classics. Likewise, it played at the perfect tone so I could fully  engage in conversation while still fully enjoying the music. \n\nOur server, Alvaro was a gem. Kind, helpful, and attentive but not overbearing. We ordered the Bacchus salad which was DIVINE, the homemade gnocchi was equally yummy and the pêche melba was a little too ice-creamy for my taste but a refreshing topper nonetheless. \n\nWhat I found most delightful was whereas most restaurants give you the check the second you finish your meal in an effort to shuffle you out for the next party, we were left alone for perhaps 30 minutes to enjoy the atmosphere and evening. Naturally we could've asked for the check earlier, but we were too busy basking up the loveliness.", "author": "Rhianna J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-27", "description": "Just finished a delicious dinner at Bacchus.  For $100 (ish) we were able to eat a lot of food, and it was all very very good.\n\nWe shared:\n\n* The pork belly - crispy and delish, very flavorful\n* The goat cheese pastry - melt in your mouth, with nice chunks of pears inside\n\nMy husband had the hanger steak and it was gigantic.  Lots of flavor and it came with plenty of fries and salad as a side.  \n\nI had the mushroom ravioli, I opted for the small portion because I wanted to make sure I had room for dessert.  There were three giant raviolis in a creamy and rich parmesan sauce.  \n\nWe each had a glass of the Pinot Noir, and coffee.\n\nBob enjoyed the creme brulee, no extra frills but it was very tasty.  The thin crsip crust across the top of the dessert was perfect.\n\nI ordered the apple tart, and It was perfect.  Not too sweet, with an ample amount of whipped cream to top it off.\n\nSo 2 appetizers, 2 entrees, 2 desserts, 2 glasses of wine and 2 cups of coffee for $100 w/ tip, not too shabby.\n\nThe place was really cute too, with great mood lighting.  I recommend the place for a nice date night.", "author": "Margaret I."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-23", "description": "My wife and I have been there on at least five occasions going back over the past three years.  We have had great meals and wonderful time each time we have there.  It has become our \"go to\" place when we are in the neighborhood.  That is saying a lot as the neighborhood has a lot of tempting offerings.\n\nFor those who are red meat eaters and tend to be less adventurous I recommend the Hanger Steak.   It was done to perfection and the shallot sauce was delicious.  The selection of wines by the glass have never disappointed.", "author": "Bob K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-02", "description": "Bacchus Bistro has become our favorite all around restaurant in Brooklyn. They serve consistently delicious and reasonably priced French comfort food. The L'Onglet is my go to selection but you can't go wrong with the Raviolis aux Champignons either. Meryl and the rest of the staff are always friendly and courteous. The wine selection is excellent and also reasonably priced. (I personally recommend the Cotes du Rhone) The interior has a rustic, old world charm to it that makes it perfect for dates or special occasions. During warmer months, there is seating in the huge outdoor space. My wife and I love this place so much, we decided to have our wedding here!", "author": "James B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-11-12", "description": "I am in love with Bacchus.  I dined there during a quiet evening to seek out good food and wine, and I found both.  \n\nEvery single dish I had was perfect or very close to perfect.  My carrot and apple soup was good, but it could have used a touch more seasoning because it was very mild.  The gnocchi was heavenly and the pillowy goodness just melts in your mouth.  I love the goat cheese and the grilled veggies that accompanied the plate because it you take a bite with it together, it goes so well together.  The snail app was excellent as well along with the artisan bread I used to sop up the escargot juices. However, I loved my mushroom ravioli with parmesan cream sauce, but I wished the portion size was bigger.  My bf also had a perfectly cooked hanger steak.  \n\nI think the highlight of my meal was definitely the dessert.  I got a traditional creme brulee and it was decent.  However, the chocolate mousse gave me an amazing sugar rush.  \n\nThe service was excellent and very friendly.  The lovely french music added a nice touch too.  Bacchus, you have won my heart.", "author": "Kiki R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-08", "description": "I am a regular at Bacchus.\nThe place is great, specially when you can have your diner outside.\nFood is good, service is very friendly and professional.\nVery laid back french bistro.\nWould def recommend for a date or late diner alone.", "author": "Pierre M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-24", "description": "Love this spot on Atlantic. Great comfortable back patio outdoor seating. Fantastic music playing...\"Althea\" came on while we ate, you know that's always a good sign for me when the Grateful Dead comes on.  Food was fantastic and service was friendly and attentive. 5 stars!", "author": "Monica H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-30", "description": "I really recommend this place. I've been here several times and it's worth the trip just for the goat cheese beggar's purse, ravioli, and gnocchi. Their escargot and foie gras are also delicious. The mussels and the beef cheeks are superb as well. I love the decor and the outdoor area in the back is certainly a plus. Service is great and we've always been lucky to find parking nearby.", "author": "Ilona K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-06-14", "description": "Truly disappointed by the service. And no, we didn't even get to eat here, which is unfortunate. On a night when the restaurant was not even remotely busy, it took almost 15 minutes for someone to finally respond to our request for a table. We were shown to a table that was jammed into a corner next to a loud, drunk couple. Given the approx 10 empty tables around us, we asked if we could move and were brushed off with \"No, we can't give you another table, try the hostess on the other side of the restaurant.\" We figured it was worth the old college try and the hostess next door promptly showed us to the table we had just left. Before we could explain that we would like a different table, the woman who had refused to move us came over and started shouting \"They don't want to sit there. I gave them that table. They don't want to sit there. We can't give them another table.\" Umm, ok. At that point we realized it would be futile to explain the situation, particularly with the snotty look we got from the second hostess. Too bad there was no adult supervision at this place.", "author": "Shalini R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-18", "description": "Absolutely amazing from start to finish.....\nFirst, the service and the staff were top notch. Very friendly and attentive.\nThe appetizers were absolutely delicious....we had their special which was scallops over polenta with a drizzle of truffle oil, we had the Brie, also had the pork belly, and we had mussels in a tomato sauce....all delicious and so simple.\nDinner assays amazing, I had the skate fish with a lemon and caper sauce, my family members had the ravioli in a cream sauce, rib eye steak, and the short rib stew.....I know I'm repeating myself but everything tasted amazing, even the french fries were so good we actually ordered an extra side dish of them.\nDessert was stunning and delicious and we enjoyed 2 bottles of cuvée. And for 4 people and all this food and 2 bottles is was only $270.....absolutely amazing...I would give this place 6 stars if i can....great for a date, the outdoor seating area is very cozy and romantic, and indoors very rustic and euro style which I love.....highly recommend this place! Great great great food service and ambiance", "author": "Sandra J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-30", "description": "Great Neighborhood location.  Great wine and great people.  A fun time.  Sometimes a bit busy but definitely a great neighborhood location and a good value for the money.", "author": "Erich B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-15", "description": "If you've ever worked in a restaurant, you always hate to be \"that guy.\" \n\nYou know that guy -- the one who shows up about ten minutes before the restaurant closes and tries to order food. Who sees the kitchen staff eating dinner and thinks, sure, of course, now's definitely a good time to come in and eat and not expect them to spit in my food.\n\nBut Nancy the hostess with one of the most gorgeous speaking-English-with-a-French-accent voices I've ever heard insisted that we still had ten minutes to order before the kitchen closed*, and the place looked so warm and inviting, and we'd been meaning to try it forever ... well, ok, I was about to be that guy.\n\nTurns out that they really didn't mind, or at least I couldn't taste the spit in my ravioli over the taste of all the cheese packed into them. I found the asparagus on top to be a little weird, but there's a LOT of cheese in those ravioli, so I'm sure they needed something to cut the overt cheesiness of it all just a bit. The french onion soup** was also really good, if not a bit salty. I like salty, so naturally this was fine with me but if you or people you're with don't like salty, might want to keep that in mind.\n\nIt's a French place through and through, so in addition to French-infused foods, it's definitely rocking the small French bistro vibe, dark and candlelit and very appropriate for cold winter nights. In addition, there's a large, apparently beautiful backyard space that I want to make use of when the weather's a little warmer.\n\nThere's also an unlimited drunk (mimosas, bellinis and bloodies) brunch for $24.95 from 11-4 on Saturday and Sunday.\n\n* - When I worked in a restaurant, the kitchen closed thirty minutes before the kitchen closed.\n\n** - Of course, since Bacchus is French, French Onion soup is really just listed as onion soup there.", "author": "Danny P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-06-04", "description": "The atmosphere is nice, but the food is poor quality. I'd say it's middle-of-the road diner quality. Considering that every entree is at least $20, I recommend skipping this place unless you're just getting drinks.", "author": "Georgia R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-05", "description": "I lived in Paris for 4 years... So this is as close to a bistrot (that isn't pretentious) that you can get in boerum hill. Food is good, folks nice, and it's unlimited mimosa on Saturdays !", "author": "Sousan H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-26", "description": "Really great French-style bistro. Have been here mostly for brunch, and one lunch. Everything on the menu is great, and the service is \"polite.\" Overall, quite good.", "author": "David P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-21", "description": "I came here over the weekend as my friend had her wedding reception brunch here. I have to say that the staff were very professional, patient, and friendly toward the 45 guests in attendance. Now for the food, we had an artichoke salad and it was delicious. I had never tried artichokes before and didn't think i would like it but I did. For my entree I had the steak in cream pepper sauce with home fries and I must admit that it was absolutely delicious and cooked to perfection. Lastly, we had a chocolate molten cake for dessert and it was scrumptious. All in all, I really loved this place.", "author": "Ebony J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-12", "description": "This was a wonderful place for our group dinner- the atmosphere was warm and inviting- great music choices (not French but a nice selection of American  music that added to the atmosphere).  We had a group of 10, we were not rushed, we sat for a number of hours enjoying our meal without being intruded on, then the meal was excellent - I recommend the tagliatelle with seafood- absolutely perfect- also the goat cheese gnocchi, mussels and the beef cheeks (very rich though so you have to be in the mood)- mmmm- we shared two bottles of the cote du Rhone which were tasty and the mousse was over the top rich so it was a few bites and done for us. The only downside was I had requested separate checks within the group and was told yes, but then, we got one check all together so if you want separate checks, make sure you ask a few times- other than that our service and meal were exceptional.  Reading other reviews, it sounds as though some folks had issues with their frites but ours were crispy and delicious. Caution if you order the broccoli as a side - there was a touch too much butter on ours. I would absolutely come back again, the meal, the service, the atmosphere was perfect for us to catch up over food and wine.", "author": "Fiona G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-12-01", "description": "I think 3.5 stars would be more accurate.  I will definitely return when the opportunity arises, for the relaxed ambiance and comfort food.\n\nHad dinner for 4 on a rainy Monday night.  Solid French fare, and not *too* salty, which is a big plus for such places in NYC.  Very enjoyable meal, very relaxed, but the place was almost empty so that is not surprising.  The service disappeared after we got our mains, but we did not mind -- I eventually walked to the bar to request the check.\n\nI had the skate wing, which was pretty good but a little rubbery, and lacking the caramelized wingtips I usually enjoy when I cook this at home.  To start we shared the escargots (very good), duck rillettes (could not be bad, served here with a fruit relish that was well-matched), and the pork belly which was quite good also.  The portions of the mains were rather too big: HUGE piece of skate wing, and my wife had a HUGE piece of trout.  Don't know what the kitchen is thinking, it's just a waste of food.  Prices were very fair, however -- $20 for the mains.\n\nEnjoyed the wines by the glass, but did not scrutinize them.", "author": "George S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-16", "description": "We absolutely LOVE this place. It's our go-to, pre-theater (BAM) spot for an intimate dinner. Truly authentic -- from the cuisine to the staff -- it doesn't get much more French than this in NYC. C'est si bon!!!!!", "author": "Meaghan M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-10-19", "description": "I've been here a couple times for brunch and dinner. While their food is good - I've enjoyed their crepes, omelettes, steak, salads, etc - the service is so-so.", "author": "Michelle R."}], "servesCuisine": "French", "priceRange": "$11-30", "name": "Bacchus Bistro \u0026 Wine Bar", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "409-411 Atlantic Ave", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/oriVKWBIxKF0EQiVu8iVqg/ls.jpg", "@type": "Restaurant", "telephone": "+17188521572"}