{"aggregateRating": {"reviewCount": 439, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-16", "description": "We made an 8 pm reservation for Saturday night.  The place was very busy.  We arrived 10 minutes late and waited about 15 minutes to be seated - not a problem for us.  We ordered the crab cake appetizer which was possibly one of the THE best crab cakes I've ever had.  It was smooth in texture but not too smooth and very very fresh crab meat.  It also was paired with perfect citrus and pepper sauces.   My fiance got the filet mignon - amazing.  It was a large cut of meat that just had great flavor and texture.  Although he ordered it medium it came out a true medium rare but honestly it was probably better that way anyway.  I had the chilean seabass.  It had a nice sear/hard outer layer covering delicious tender fish.  All in all we were really amazed by the quality of food!", "author": "Florrie W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-28", "description": "A great place!  Been meaning to stop in for sometime and wish I had sooner.  Great food, friendly patrons, friendly staff.  They definitely abide!", "author": "Michael L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-12-25", "description": "What an awful experience! Is there such thing as negative 5 stars? This place is an absolute disaster and the food is even worse. Something tells me that some of the dumpsters on Atlantic Avenue were pillaged tonight, so that the chef could fill the void in his prix fix meal. I am seriously about to puke as I write this. We arrived to discover a prix fixe menu only. The amuse-bouche never arrived, although every other table received theirs at random intervals. When we pointed this out to the manager, we were basically ignored, until it arrived sometime right before our entrees (and after our first course). That really wasn't the bizarre part. I could have lived with that. This is where it gets totally weird. The prix fix menu listed filet mignon as a main, which makes sense- french restaurant, I get that. The waiter advised us that they were out of filet mignon, but had hanger steak instead. Fine, bring on the hanger steak. I notice everyone around me is eating that so I figure it's probably good. Well, here is the strange part...they are out of the filet, yet somehow it arrives on my plate ice cold and slathered with dijon mustard. I look around, no one else seems to have received this entree. After that, everything went totally downhill. My husband and I both sent our entrees back on account of them being cold. When they came back out again, they were still cold and I had received a different cut of meat which I couldn't even eat. I am sick to my stomach still thinking about what kind of meat it could have possibly been. It was neither hanger steak or filet. It was the texture of leather and covered with gristle and mustard. Chipmunk maybe? We were then informed that they were out of the dessert on the prix fixe menu and received 3 desserts, each one of which was worse than the next (the chocolate mousse was the consistency of tar and when I put my spoon in it, the entire glass of mousse came up with the spoon )and some cheap champagne to accompany them. During this whole ordeal, we heard from the manager not even once and even the woman who had only worked there for a month and half felt the need to come over and apologize. Bottom line, even if there are no other restaurants open in Brooklyn, don't come here. Take the subway, get out of dodge, just get farthest the f#$k way from this restaurant that you can, or buy your worst enemy a gift card for here.. BLEHHHHHHHHHHHHHHH", "author": "Amanda S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-06-01", "description": "Very nice for the price. Good option for a casual dinner. Friendly, attentive staff. Solid food. Have a nice size outdoor patio in the back for summer", "author": "Will S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-10-01", "description": "Nice atmosphere and people, but horrible service and mediocre food. They let me down.", "author": "Niko L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-10", "description": "I've been here twice within the last month, and am very happy every time I leave.  The muscles are fresh, mushroom ravioli is delicious.  As far as appetizers I recommend the escargot, puff pastry and brie tartines.\n\nThe service isn't the most attentive, but with excellent food and gorgeous outdoor space, I'll be back!", "author": "Becca G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-13", "description": "Pretty much a perfect neighborhood boîte. Some dishes stick with you for years and that's how I feel about their pork au pruneaux, my mouth waters just thinking about it. Impeccable wine list, cozy atmosphere and luxurious service. Never a wait and always a good time.", "author": "LL L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-16", "description": "We love it - a favorite family and friend gathering place - all around just terrific.  The food is excellent, the garden in back is cozy and inviting. And the best selection of music you will hear anywhere - classic jazz, afropop, latin, motown, zouk, classic rock, world, R\u0026B, and lots more.  It is worth going just to listen to the music.", "author": "Susan W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-08-27", "description": "I think it's a decent bistrot, nothing spectacular though...the brunch was ok. My pouched eggs with salmon were ok, french toast was fine...I had better though. it's not expensive, so I'm not complaining, but there are better options in the neighborhood...at least for me. The waitress was very nice \u0026 the place is absolutely beautiful! I guess it gets really crowded at night", "author": "Maria F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-29", "description": "I came to this little French bistro last week prompted by \"Dine In Brooklyn\" (the Brooklyn version of Restaurant Week)\n   \nThe ambiance was very nice-slightly rustic and inviting with french doors looking out to the charming backyard that I will definitely be coming back to enjoy in warmer months.  \n\nWe arrived about 7 on a Monday night so it wasn't very crowded, and as it get's to the 8-8:30 hour, they really dim the lights and light candles--a very romantic place for a date.. unfortunately this was a date with my dad lol.\n\nThe waitress, who was actually French, was very nice and remembered our order without having to jot it down.\nWe ordered from the prixe fix 'Dine In' menu.. my dad got:\nEscargot with an anise pesto oil\nSteak Frties w/salad\nMolten chocolate cake\n\nI got:\nPhyllo dough stuffed with pear and goat cheese\nMussels in a white wine broth w/frites\nTart Tatin (apple tart)\n\nEverything was was very good..I didn't try the steak as I am a vegetarian but he cleaned his plate (and it was big!)  My mussels, the fries and the tart were delicious!\n\nOverall a delicious restaurant with a nice atmosphere and great, friendly service.", "author": "Jessica F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-29", "description": "Ate at this place on a Monday night on a recommendation, and Im glad we did. The place is warm and friendly. I'm not the biggest fan of French dishes, but I found the food to be delicious. Add to that they had a very diverse menu. I was surprised to find that with such a small space it felt roomy. Staff was helpful, kind, and didn't feel rushed. I will be returning when it gets warm, so I cam enjoy their outdoor space", "author": "Andrew P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-05-12", "description": "I was excited to go to Bacchus as I love french food and the pics on the website for the garden setting looked amazing. I booked a reservation for my family and i for mothers day and requested to be seated in the garden. My aunt, grandma and cousin got there before me, my sisters and I got there 15 after, we were confuse as to what entrance to use as there is two. There was no one to greet us, we walk staright to the back to find our family. We were sitting there for 10 min before anyone came to us, the setting was very uncomfortable so I requested to be moved. They moved us and we sat again for another 10 min before attended to. We ordered and half the food came out and half later. They only had 2 servers and 3 buss boys on a busy day like that. My sister ordered a wine 3 times which she never got and I ordered a dessert that didnt come out either. To sum this up it was the worst service I ever had in my life and I have been a server as well as a hostess at several restaurant. I would not recommend not even my cat to dine there.", "author": "Jotasha T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-04-26", "description": "Finally 80 degrees and a good excuse to drink wine in the back garden. It seemed like everyone in Brooklyn who didn't have a backyard was doing the same thing last night. \n\nWe ordered a bottle of Pinot Blanc from Alsace. It's a citrusy wine with a mineral edge to it. I would have enjoyed it more if our server kept the bottle cool in an ice bucket. The warm weather took the chill out of it very quickly.\n\nI had the duck foie gras terrine served with toast points and marmalade on the side. I loved the presentation of this dish, but felt the foie gras lacked seasoning and taste.  Solid and compact, it didn't quite melt on the tongue as I had hoped.  (Granted this isn't Daniel).\n\nMy dinner buddy had the skate in lemon and caper sauce, sauteed spinach, and mashed potatoes. It had a decent sauteed \"crisp\" around the edges, but was unfortunately overwhelmed by a way too acidic lemon and caper sauce.  Mashed potato and sauteed spinach accompaniments were pretty bland and forgettable, though you can't really expect any fireworks from bistro sides (although the frites that went to our neighbor looked fantastic).    \n\nGreat ambience, but we weren't totally impressed with our dinner. However, it's still a great place for wine, cheese, and charcuterie on a summer night.", "author": "Wendy C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2007-03-15", "description": "I've never written a review, but having read the preceeding one, I felt the need to rush to Bacchus's defense:\n\nI'm totally biased:\nWe live around the corner and come once or twice a month, my wife had her 30th bday party here, and the restaurant is such a fun part of the neighborhood, and I'm sure I'm swayed as much by the fact that the entire restaurant is always smiling, laughing (I mean, these people are French - and they smile! and are friendly).\n\nWith that disclaimer out of the way:\n- Great french bistro grub. roast chicken, steak frites (uber-yummy pepper sauce), etc\n- umm duck proscutto salad\n- the kind of salads that actaully make you like salad\n- brunch has a great croque madame\n- my wine snob friend Thayer thought the wine list was a hidden gem for this price range. It was like he found an autistic child who could complete the perfect ncaa bracket.\n- you can skip dessert and walk down to Downtown Atlantic to get cupcakes\n- Wednesday night is two for 1 entree night, Monday and Tuesday is like four people get 1 bottle of wine free night, something like that\n\nI'm sure Michael J's review is accurate for what he experienced, but it sounds like the boys were just having a rough morning. early evening.  They were probaly hung over earlier in the day and need some time to ramp up. It's hard work being that french and that joyeux all the time.  I've eaten here maybe 50 times and never had a bad meal.\n---------------------------------------------------------------------------\nAddendum: I wrote the above about a year ago. (It's now 2008). They've raised the prices, abolished 2 for 1 Wednesdays, and added live jazz (shudder) at brunch.  They're still a great spot for a gd value french meal, and I'll come back, but we find ourselves walking the extra 5 minutes over to Bar Tabac a lot more than we used to. I'll still always have a place in my heart for Bacchus, it's just that we just need some time apart.\n-----------------------------------------------------------------------------\nOkay, now it's 2009, the economy is uh rough, and Bacchus gets it.  The prices have, like my retirement account, decreased. They added more comfort food (sadly getting rid of some great salads), they're changing it seasonally, and they're still just as warm and welcoming.", "author": "andrew G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-07-19", "description": "Had a great dinner here with my girlfriend last month. The food was fantastic and the service was really nice and attentive. I'll definitely return.", "author": "K R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-11-11", "description": "Bacchus is great. The prix fixe menu is excellent value, food is great and staff are friendly. A very solid place.", "author": "Charles R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-07-25", "description": "Great neighbourhood bistro. Best staff especially Meryl !", "author": "Cuan H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-14", "description": "This is what a French bistro should be. Great ambience. Foods not going to blow your mind... but you are at a bistro. Be sure to get a side of the potato gratin.", "author": "Tabby M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2007-10-09", "description": "I ate here a while ago, and don't remember much about the food, so I think it's safe to say the food was unremarkable.  The main thing that I do recall is the terrible service, which seems to be a theme in the reviews for this place.  I don't think I've ever had to wait that long or work that hard to get a waiter's attention.  I'm giving it two stars mainly because of the pretty backyard patio - although, I did keep getting hit in the face by a stray branch that stuck out over our table and probably could have been trimmed or something.  Anyway, the crappy service ruined what would have otherwise been a beautiful summer day sitting outside drinking wine.", "author": "Colleen K."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-10-18", "description": "hmmm.  where to begin with this place.\n\nif you're looking for a truly french experience, then you may have found it at Bacchus.  That's not necessarily a great thing.\n\nWhile the staff was friendly, they were a little clueless.  First, when we walked in the door with reservations for two, we had to wait (via opentable).  No biggie.  happens all the time.  we sit at the small bar at the entrance.  the hostess goes behind the bar and gets me the mineral water i order.  she starts to walk away before asking my boyfriend if he wants anything - aka, a glass of wine.   as we are chatting and waiting, we notice the hostess comes back behind the bar.  we think she's going to refill my boyfriend's glass of wine.  nope.  walks right past us to the computer on the counter to log into her facebook page.  again, no biggie.  but, you know, ask about the drinks.\n\nfinally another woman comes forward and escorts us to the back table for two by the outside garden.  things are going well, except we have that rather absent (aka french) service.  we place our order and about 5 minutes later, they are rushing a woman out the garden door (directly behind my boyfriend and directly in view of me) who proceeds to projectile vomit out the door.  It's splatters all over the back garden (THE GARDEN WAS CLOSED, I should mention).  Hey, it happens... but, they keep the door ajar so they can go back out.  \n\n1.  it's f-ing freezing.  close the garden door\n\n2.  that was PUKE and it tends to stink.  close the garden door.\n\nmy boyfriend gets up to get me his jacket.  yes, he's a gentleman.  I'm holding it closed while there is a freezing breeze.  we ask the server to PLEASE clean up the puke.  She says that they are on it.  ...and they are.  The woman who puked is sitting outside with a napkin over her head and they proceed to dump a punch of pine sol to clean up the puke.  Word to the wise, puke and pine sol do not mix and both are hideous to smell while waiting for food.  \n\nWhile this is happening, the couple who had been seated next to us get up and leave.  \n\nThe server comes back and sees I'm freezing and asks if we want to move across the room.  That would be a YES!  \n\nOk - now onto the food.\n\nMy BF orders the tuna steak with cajun spices and i order the skate.  I also had the french onion soup to start When we do get the food (still waiting with little to no sign of service - again, tres francias), the skate is extremely salty.   Soup is basic and pretty good. My BF likes that so we switch plates.  The tuna is pretty good, the spices are ok.  I eat about 3/4 or it and I'm done.  Even after witnessing flying vomit earlier.  Conclusion:  food is nothing special and certainly not worth returning.\n\nDessert:  flourless chocolate cake a la mode.  This was pretty good.  Good, not great.\n\nAs I sit there ready to get out of there, my boyfriend and I think that it would have been more than fair for them to have offered to take the dessert or part of the meal off of our tab.  I mean, what is worse than seeing someone toss their cookies just before a meal.  I was two seconds away from getting the hell out of there.  I just didn't know where else to go on that block at that time.  If I had, I would not have stayed.\n\nIf you're in the neighborhood and want french food, go ahead. just don't expect terrific service, above average food - or keep your appetite.", "author": "nycsep n."}], "servesCuisine": "French", "priceRange": "$11-30", "name": "Bacchus Bistro \u0026 Wine Bar", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "409-411 Atlantic Ave", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/oriVKWBIxKF0EQiVu8iVqg/ls.jpg", "@type": "Restaurant", "telephone": "+17188521572"}