{"aggregateRating": {"reviewCount": 439, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-29", "description": "Craving a croque madame? This place is great! We arrived shortly after 11:30 on a Sunday afternoon to a sparsely filled bistro on a chilly winters day.  With only one thing on our mind we ordered two croque madame.  Two giant sandwiches arrived roughly 10 minutes later, served on slate boards with fries or pommes de terre à la sarladaise, (home fries in duck fat).  The thick cut country bread was more than a mouthful requiring a fork and knife, with a modest amount ham, gruyere, and bechemel, topped with a runny fried egg. The fries were above par, while the home fires were good, but nothing special.  We both cleaned our plates faster than we expected.  \n\nService was quaint and friendly, and within the hour we were on our way.   I cant wait to try their duck cassoulet or bouillabaisse. \n\nTotal before tip: $32.00", "author": "Kelly P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-11-21", "description": "It's official.  Hubby is never allowed to play unsupervised again.\n\nTo back up for a second, we were out with another couple, ISO someplace low key to grab some dinner.  My hubby and other hubby got to chatting and walked on ahead.  Way ahead.  Somehow or another, they wound up here, got a table and were situated without bothering to consult their better halves until it was a done deal.   \n\nTo back up even more, we used to eat here once in awhile, way back before Atlantic Ave.'s recent evolution into an extension of Manhattan.  I recall liking the food well enough, but being much more charmed, ultimately, by the outdoor patio.  This was not someplace I had any real desire to return to, but leave hubby on his own for too long and that is exactly what happened:\n\nSo yeah...  Nothing really leaped out at me from the menu.  In fact, while it seems this spot has expanded into a second space since we were last here, the food selections don't appear to have caught up.  I found them pretty, dare I say, basic, to be honest.  So I went with a Burger and while it tasted fine and was cooked to my requested medium rare, it wasn't $18 worth of fine.  Hubby's Mussels were not the plump and meaty specimens he was hoping for.  He said they were way too small.  Our friends were similarly disenchanted with their picks, which included Green Salad, Butternut Squash Soup, Salmon, and another Burger.\n\nService was friendly and attentive and the big 'ole bottle of Rose we'd ordered helped us drown our sorrows regarding the ho hum food.  But in the end, while I am impressed by the longevity of this place, and clearly, there are lots of folks who are more than happy to support it, I know there's more satisfying French cuisine to be had elsewhere.", "author": "Yael D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-08", "description": "I had my rehearsal dinner at Bacchus Bistro and the experience was incredible. Wonderful staff, very attentive, extremely friendly and helpful, especially dealing with my large party of 50+. The food was amazing, I loved the Mac n Cheese especially and the place was cute, cozy and quaint. I really enjoyed this place and the price was very good for such a large party. I would definitely recommend and I will also revisit.", "author": "Danielle J."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-06-21", "description": "I'm not sure what happened.  Maybe its new staff but something is definitely off.  This use to be my go to spot with it being a neighborhood gem.  Now I feel like an outsider.  We even speak French in the restaurant and are treated very very rudely.  Simple requests for seating are not granted, service is alot worse.  Food is somewhat ok.  The vibe is off.  Not sure what happened but please bring the good vibes back.  This is like the 3rd time this has happened in the last few months.", "author": "David C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-18", "description": "Talk about a wine list - there was a Chateaux Margaux that lists for US$3,000. Maybe if I win the Powerball. I pretended it was the $9 Pino Noir that I was drinking.\n\nVery pretty little bistro a few blocks away from the Barclays where we were invited by dear friends to see The 1975. We had the escargot, pan fried foie gras and goat cheese, all were perfect. The butter on the snails were esp good. I would've eaten a whole baguette with that.\n\nMain course was the Braised Lamb Shank for the girls and Mahi-Mahi for the Dads. The lamb was perfection in a red wine mushroom truffle potato sauce. Mahi-Mahi was good, not great, but presentation was so beautiful I forgot to consume the edible flower.\n\nService was attentive, prices are reasonable and the espresso was strong. Will definitely be back when in the area.", "author": "Alex C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-09-02", "description": "Crab sandwich was very good\nChicken sandwich was terrible, very tough \u0026 no flavor \nLoud, repetitious music\nUnfriendly woman greeted us when we first walked in which as you know, first impressions and all", "author": "Julie D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-12-28", "description": "Came here in a group of 6 and sat outside the patio on a nice summer night.  Ambiance was relaxing and great.  Service was a bit slow.  They seemed to be understaffed.  Food was good but not great.\n\nReason and warning from my review is please review your credit card charge at this place.  They overcharged me by $10.  It could be a fat finger but do review your credit card statement.", "author": "Nas L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-04", "description": "Came here last night for a friend's birthday dinner. After walking past it, I finally found it nestled in between Nevins and Bond :).\n\nBacchus Bistro is a warm, inviting and beautiful modestly-sized French restaurant with a fantastic rustic feel due to the vintage wood details, decor and ubiquitous candle-lights everywhere. It's very reminiscent of the bistros of Paris and being that I'm not often in this part of Brooklyn, I was excited to check it out.\n\nOur group was given complimentary bread which I do wish would have been warm (I was a tad late, so perhaps earlier loaves were warm, but new servings given to us after my arrival weren't warm either). It was sourdough and despite it being cold, it was delicious with a little butter.\n\nAs an appetizer, I ordered the Escargots au Beurre d'Ail Anisé ($9) which were snails in garlic and anise star butter. I love, love, love escargot and while these were delicious, they weren't the best I've ever had. I slopped up some of the butter with their sourdough table bread...good stuff.\n\nAnother appetizer I got to try were their pan seared scallops on a nacho-like chip with lobster salad. It was delicious. \n\nAs an entree, I went with Le Hamburger Bacchus ($17). This was a Black Angus Burger with French fries \u0026 Pickles Caramelized Onions, Bacon \u0026 Cheese (Swiss and Cheddar were my options and I wend with Cheddar). I ordered my burger medium-rare and it came out well done. I didn't want to send it back even though they prepared by burger incorrectly, but I did ask our waitress for a side of mayo, hoping that it would help make the beef juicy - but I never received it. \n\nThis was one of many instances with our waitress where customer service could have been better. So poorly prepared burger (the meat was tasty, but it was dry) and no side that I asked 2 different people for. Mmmkay, thank goodness for the crispy bacon. The fries that came with my meal were delicious, but nothing special or pomme frites-like.\n\n_______________________________________________\n\n\nA few other dishes I got to sample were:\n\n+  Joue de Boeuf Façon Bourguignone - Beef cheeks \"Bourguignon\" braised in red wine with potatoes, bacon, mushrooms \u0026 cippolini onions - the broth for this was divine and the beef tips were super tender. Very flavorful. \n\n+ Dorade \u0026 Ragout Automnale - Pan seared Mahi-Mahi filet over sweet-potato hash brown Crab meat, scallions \u0026 lobster sauce. This was a dish where I really only tried the broth/lobster \u0026 crab sauce. It was delish. \n\n+ Mussels Marinière: Garlic, shallot, white wine sauce. The Mussels were delish and the broth here was also fantastic. They have a $15 All-you-can-eat Mussels special here on Tuesdays that I am ABSOLUTELY coming back for. I can eat Mussels all day, err' day!\n\n+  Tagliatelles Fraiches de la Mer: This was the dish I was in-between ordering but I ended up going with beef because I felt that I could use the iron and it had been a really long time since I had last had a burger, lol. This dish consisted of homemade tagliatelle pasta with sea scallops, calamari, clams, shrimps, mussels \u0026 Marinara sauce. This was easily the star of the show and probably the best thing at our table. It was freakin' ridiculous. If I ever come back here again for dinner, this is easily what I'm ordering. \n\n_______________________________________________\n\n\nFor dessert (after we asked for the dessert menu at least 3 times...) we ordered the birthday girl an order of Creme Brulee (apparently, this is both of our favorite desserts) and my best friend and I shared an order of them molten lava chocolate cake with vanilla ice cream. Both desserts were fantastic. \n\nOverall, I really liked this place. Service is definitely an area of improvement and I'll never order a burger here again because I hate my burgers well-done - but I would definitely return here again, hopefully for their Mussels night!", "author": "Stephanie P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-25", "description": "A friend and I were staying in the area and decided to check this place out because Google recommended it. It did not disappoint!\n\nThe ambiance is trendy yet casual. They have a lovely looking patio that seems like an oasis in the chaos of the city. The fixtures and wall hangings give you a lot to look at. \n\nThe food was fantastic! I tried the BLT. Pork belly AND bacon!?! How can you say no to that!? My friend tried the chicken sandwich. She was also pleased! The side of potatoes were like these seasoned sticks of goodness. So much flavor. With a side of mayo...do it!\n\nOur server, Sofia, was fantastic. He was attentive without being pushy.", "author": "Mandy J."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-12-20", "description": "I came here for brunch on a Sunday morning. When I got there, it was still fairly empty. The restaurant is cozy and has outdoor seating, which isn't available in the cold. The problem was that they sat us all the way in the back and only occasionally remembered us; service ended up being slow. The staff was friendly though. Our food also took a long time to come out, but maybe we ordered the more labor intensive items from the menu. \n\nTheir porcini ragu might have been good, but the truffle mushroom sauce was much too salty to enjoy. The red wine lamb stew strangely went the opposite direction and was bland. What's worse is the waitress brought us the dish with seriously burnt toast. Was she just not paying attention or did she think we'd be ok with that? Same goes for the chefs who burned the damn toast in the first place. French onion soup was pretty good though.\n\nThe food isn't bad, it's just not that good either. The dinner menu looks more appetizing, but there are a lot of good restaurants in the area I'd dine at before coming back here for a second chance.", "author": "Jack L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-06", "description": "I came here for a bridal shower and it was so nice that there was a private space for the party. It was a big spacious room with great lighting and a long bar that the bridal party used to set up some decorations. The food was ok - I preferred the crab cakes to the steak and eggs. I'd definitely recommend this place for any private party needs.", "author": "Brietta Y."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-12-18", "description": "We have just moved to BK from Manhattan and a couple of friends recommended this place. It has been years since they've been but despite the negative reviews, we decided to check it out.\n\nUnfortunately the other reviewers were correct. The food wasn't BAD but it wasn't great either. The endive salad should've been good bc how do you mess up an endive salad but the citrus flavor of the dressing just did not compliment the ingredients in the salad.\n\nThe French soup was okay and so were the lamb shank and beef cheeks. They were good enough to eat but very forgettable.\n\nThe meringue float was a solid fail as the meringue was quite flavorless aside from the sugar crust. \n\nThe worst part of the experience though was the service or lack of. The waiter barely tended to us and was gone after we placed the order.\n\nWe had also told him that we'd like mussels to go and to put that in when we get the bill, but of course that went over his head.\n\nWe had to say \"excuse me\" a few times to flag down a waitress or anyone to try and get the bill. They weren't even looking around to see how people were doing but looked as if they just wanted the night to end and for the patrons to leave them alone. \n\nOne person did ask early on to see how everything was after we had our appetizers. Should've told him them what we thought but we were still optimistic then.\n \nAll in all it wasn't a HORRIBLE experience but I would take my money elsewhere. I also doubt this place will last long. It was mostly empty on a Saturday night and I can't imagine a lot of people or anyone returning for a sub par fare.", "author": "Cher A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-16", "description": "This is a review for the prix-fixe group dining experience.\n\nI threw a surprise birthday dinner for my SO with 22 total guests. Chose the prix-fixe 4-course dinner with 3-hour open bar (wine/beer/champagne) and it was great. The food was excellent and everything ran smoothly. Service was great and kept the wine flowing.\n\nMy only complaint (that others had here) was that it was hard to get in contact with the staff ahead of the event. Don't let that discourage you, they were very accommodating in the end and everything went well.\n\nThere was a wedding happening at the same time (in the backyard space), so we had the bar area. I was worried that it would be too busy with the wedding, but it ended up being a plus since we got free music.\n\nDefinitely recommend for a group party!", "author": "Aimee O."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-05", "description": "I realized that this place has been on my list for several years, and so I finally made it out here. The place feels disjointed as it consists of three areas. The right and left side of the restaurant looks like two different restaurants, and the back is the patio. When we came in at 6 pm, we were told that we can only sit in a certain area due to a wedding taking place in the patio.  I found it strange because when I peeked in I saw that the room was not occupied by the wedding guests,  and the area was occupied by a man sitting at the bar and two people enjoying their dinner at the table. All of the wedding guests were at the patio. When we left these same people where still there. The reason I am noting this is because we were squished between two tables of strangers and felt out of place. We ordered the white wine mussels which came in a pot. Escargot had a good presentation being served in the original shells, but there is no way to hold the shells without burning the skin off of your fingers. So, unless you like cold snails, I don't know how you will eat this this. My hubby ordered salmon which was tinny, and he didn't feel that it was flavour enough. I ordered the beef cheeks, which were some of the best I ever had. They gave a huge portion, and the meat was melting in my mouth. I would go back just for that. Would I come back? Absolutely! However, I would steer away from the escargot and the seating on top of another parties.", "author": "Donna P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-02", "description": "I had my wedding ceremony and reception at Bacchus--gorgeous! Thank you immensely to Meryl, Alvaro, Bruno and the rest of the Bacchus team for making such a special day easy and fun. Meryl especially is easy-going and extremely helpful and attentive. Bacchus has become our second home. And, as for the food--Our guests raved about the food! I recommend this place for brunch, dinner, wine and weddings. Merc", "author": "Cassandra R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-30", "description": "This is my favorite French restaurant in the city. The food is excellent. Staff friendly and welcoming, attentive. Sitting outside is relaxing. I highly recommend this place.", "author": "Pat A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-27", "description": "This place is lovely. I made a reservation on OpenTable for 7:30 PM on a Friday night and it took a few minutes to get a table ready but otherwise the process was seamless.\n\nWe ordered a great bottle of wine and four main courses. I had the salmon over seasonable vegetables. I ordered the fish medium, and it came more like medium rare but was fabulous regardless. I also tried the chicken (juicy, delicious) with the mashed potatoes and mushroom (flavorful, creamy), and the hanger steak. I would highly recommend the hanger steak with mushrooms--a fantastic dish--although all the dishes I sampled were delicious, I would say it was the best.\n\nThe restaurant was dimly lit and had a nice, casual vibe. I enjoyed the space although it was loud for some of my dinner companions. It's a popular spot on weekend nights and I would recommend getting a reservation.\n\nThe outdoor space looked wonderful. I will hopefully be back to check it out.", "author": "Maria W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-05-13", "description": "Good meal. \n\nGreat bread. \n\nFrench accents!\n\nEggs Benedict done well.\n\nPleasant staff. \n\nNice presentation.\n\nInteresting menu and good atmosphere.", "author": "Karen M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-22", "description": "We had our wedding rehearsal dinner at Bacchus in the outdoor garden area.  We had 50 of our closest friends and family and it was such a beautiful evening.  The food was delicious and all our guests enjoyed the selections from a prefixed menu my husband and I chose before hand.  The wine and beer were plentiful and always flowing :)\nMeryl and Alvaro were super helpful throughout all the planning for our event.  The outdoor lighting and awning they had set up as well as a typed up menu specific for our event made the night even more special.  They set up about 5 rectangular tables to make a more intimate atmosphere for us.  We would recommend this space for a special event or just for a romantic date night, my husband and I have a new go to spot added to our list!", "author": "Jillian D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-08", "description": "**Event Review**\n\nI was looking for a place to host my engagement dinner with family and friends. BACCHUS fills very quickly so we were left with October but luckily the weather was perfect for the evening in the second garden. Meryl and Alvaro were excellent in helping my vision come true. It was absolutely beautiful. I can't thank them enough. \n\nWe booked the second garden for four hours and chose the 4 course menu with open bar. The event was from 7-11pm. I was able to drop off decor in the morning (balloons, hanging voltive candles, placecards, photo booth props, party favors, etc..). They were amazing and had it all perfectly set up when I arrived at 6:30pm. \n\nSince we had a few people show up a bit late they were very flexible with the time they started taking orders. Alvaro began taking orders around 8:15pm. It worked out perfectly fine bc we were mingling with family and friends anyway. I must say the food took a bit long to come out but they had 2 events going on so it's understandable. My event was supposed to end at 10pm but my fiancé and I ended up extending the open bar an extra hour since we were having such a great time. I highly recommend the second garden for an event (furthest one in the back). Weather was perfect that evening and the place is decorated beautifully, the pictures don't do it any justice. I would strongly consider BACCHUS again for future events. Food is amazing too!", "author": "Yanill P."}], "servesCuisine": "French", "priceRange": "$11-30", "name": "Bacchus Bistro \u0026 Wine Bar", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "409-411 Atlantic Ave", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/oriVKWBIxKF0EQiVu8iVqg/ls.jpg", "@type": "Restaurant", "telephone": "+17188521572"}