{"aggregateRating": {"reviewCount": 439, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-12-21", "description": "Was really looking forward to this one - we live in the area and the menu looked right up our alley. Unfortunately, our 8:30 pm reservation didn't go quite as planned. \n\nWe showed up a few minutes early and were told that a table wasn't ready. Not a big deal so we hung out at the bar area for a bit. Around 8:45, we again asked how long it would be before we were seated and were told, \"A couple just got the dessert menu so it should be about 10 minutes.\" (Really? 10 minutes to order dessert, eat, have coffee, pay, and clean the table for the next turn? Not likely). \n\nAt 9:00 pm, we again asked if a table was ready. The waiter simply rolled his eyes and said, \"why don't you guys just drink at the bar.\" Not the response we expected. In any event, the two-man crew had no idea what they were doing - the entire bar area was in disarray as more and more people (some walk-ins, some people with reservations like us) waited for an open table. \n\nAt 9:15 pm, we left and went to French Louie's. Got a table in 5 minutes and had an unbelievably great meal.\n\nLook, I get it. Saturday nights are busy. That's why we made a reservation instead of assuming we would be seated with a walk-in for four. But 45 minutes for a table is not \"just a little busy\" - it means you didn't even register the reservation. In the immortal words of Seinfeld:\n\n\"You see, you know how to *take* the reservation, you just don't know how to *hold* the reservation. And that's really the most important part of the reservation: the holding. Anybody can just take them.\"\n\nNeedless to say, we will not be coming back.", "author": "Michael M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-17", "description": "Went to this sweet spot for brunch with good friends. The back yard/ outdoor seating was closed for a party, but we were able to be seated at a sidewalk table on one of the most beautiful Spring days offered up to us in May. I had the poached Eggs Florentine, and I must say....it was so good that I still think about it, and can't wait to go back for more! It is a perfect spot for a date or with friends at any time. Afterwards, we went up Atlantic to The Hollow Nickel. Another great experience there as well!", "author": "Jennifer G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-07", "description": "We held our wedding reception here and it couldn't have been more delightful.  Getting married in Brooklyn can be a pricey venture.  One of the things that brought us to this place was the fact that they offered their beautiful covered outdoor back garden without a room fee.  It it the only place that we can across where that was the case. We had fifty guests and we were able to have a gorgeous, affordable wedding there.  We felt so fortunate to find them.\n\n I give most all of the credit for our wedding's success to Meryl, the events organizer.  Over the past year we have worked with her to tailor our ideal reception.  She was patient, attentive and incredibly helpful throughout.  We feel like we developed a relationship with both her and the restaurant.  \n\n Meryl answered a ton of questions.  She told us where we could obtain drapery for the walls and candle holders.  And she was incredibly accommodating when we asked for a little extra room in the back for our guests to sit during cocktail or dancing.  She also worked with us when it rained during our after-ceremony walk and had to rush into the restaurant half an hour early with 50 guests in quick succession.  And she was already prepared for rain by closing the tarp over the outdoor room.  She was always flexible and ready with ideas about how to make things work.  Resourceful and kind. \n Dinner was perfectly timed with no awkward waiting between courses and Meryl even helped bring out the dishes, pour wine and take orders from guests.  It was a nice comfort to have her present and easily available during the dinner.  I made a couple of requests (opening the curtains since it had stopped raining to air out the room) and she made it happen right away.  \n\n When we settled up, Meryl removed from the bill of two of our guests that couldn't make it. And as mentioned, the price tag was way below any other for a reception at a venue in Brooklyn.  \n\n The staff was amazing, helpful and polite.  While our party commenced, they were taking care of other patrons in the front of the restaurant for what made up for a very family-oriented feel.   It was very cozy.  We can't wait to go back.", "author": "Joshua L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-20", "description": "Great atmosphere with excellent food and service. The wait staff seemed small but they were fast and efficient. The food had exceeded my expectations. I would highly recommend the crab cake to start!", "author": "Kevin S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-11-30", "description": "Awful service/ decent food. The beauty of living in NYC you don't have to settle for subpar service at average prices... I'd rather go next door to Bedouin Tent for delicious middle eastern food in a family run business that is not pretentious.", "author": "Dulce I."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-25", "description": "Great place! Typical french kitchen with good a selection of wine and friendly, attentive staff. Seems well run. Had a tapas plate with a red wine and was not disappointed. The atmosphere is also very good; and perfect for a date or romantic encounter. The only thing that could be better would be a greater selection of tapas and older music. New, up-beat music doesn't really match such a classic concept.", "author": "Erling L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-09-10", "description": "Not the best, but I like it a lot! I've come here for lunch with my girlfriends several times and it's a really nice place to catch up, chit chat and have filling food. I usually get this great chicken with avocado sandwich. It comes with french fries and a salad with like a raspberry dressing. A nice combo! The restaurant is also very pretty, they have a nice outdoor seating area.\n\nJust a warning though, if you go right around the time they open (11:00-11:30 ish), you might be told that your food will take a little bit longer because of \"problems in the kitchen.\" I've had this happen twice - I'm pretty sure there's no actual problem in the kitchen, it's just that they haven't fired up the grill yet for food or something. Not really a big deal, it takes like 10 minutes longer, but just an FYI for anyone going here.\n\nAlso, whenever this happens the waiter offers us free macaroons. Awesome! :)", "author": "Emily S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-05-25", "description": "We got there and thought \"this is such a cute place\"! We asked to sit outside and they obliged. It toon forever to get our order and while we were sitting outside one of the waitresses came up to our table and grabbed the candle from the middle of our table and used it to light get cigarette. Alex and I were beyond confused. We thought the pork belly was good and reasonable priced and although  the mussels err meaty we thought they lacked a little bit of flavor. \n\nOverall we gave the food a 3.5 and the service a 1.75. Again too many great places to eat in NYC to come back. Too bad we love French food!", "author": "Jenna S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-15", "description": "First off, I've been at Bacchus many times over the last two years and I'm in love with this place. This is the kind of restaurant I'd like to own.\n\nDon't expect frivolous service. Every meal and drinks I've been served came with efficient, relatively quick service. That being said I've never tested them with a large group so your mileage may vary.\n\nThe food is great. Nothing fancy but just a good, well executed menu that makes me want to go back every week and never fails to make my guests happy. \n\nMaybe it's just me, but I love the fact that at this French restaurant I always hear french people chatting at the bar and French music playing. It's a refreshing change from all those other masquerades that have nothing in common with the real thing (I could name a few but I'll stop here).", "author": "High L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-06-23", "description": "This is one of those places that when you walk in you WANT it to be great, you really do. The ambiance of the backyard on a summer night is perfect and the flickering edison bulbs in mismatched light fixtures fit right in.\n\nThat being said, they need a little more organization with their servers - for example it took us 20 minutes to get our check after dessert.... which seems pretty excessive considering we HAD DESSERT. Isn't that code for we're done now?\n\nThe mushroom ravioli and french onion soup were very good. I wouldn't recommend the chicken dish (chicken was dry) or escargot (not enough flavor).", "author": "Allison R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-10", "description": "Casual but lovely ambiance. Everything was delicious and the servers were friendly and attentive. Wine and beer only but the wine selection was truly outstanding. I can't wait to return.", "author": "Sabine M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-09", "description": "There isn't too much to complain about Bacchus. My husband and I came here on a Saturday night after a movie at BAM and it was the perfect location and late-night dinner option. \n\nWe got a bottle of Bordeaux (decent, but not excellent), and started with the bacon-wrapped prunes (yum) and the beggar's purse filled with goat cheese and pear jam. Both apps were very good. For dinner, I got the hangar steak frites and Joe got the roasted chicken. Both our entrees were good and satisfying, but nothing exceptional. \n\nThe service was a little hectic, and the tables were cramped. I was wedged beneath a large potted plant and kept kicking my husband under the table (unintentionally). It was also boiling hot. \n\nAll in all, this place is pretty good, but it's nothing special, and I can't say I would give it a hearty recommendation or make a special trip to eat here.", "author": "Jill D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-19", "description": "We hosted our son's wedding rehearsal dinner here. We could not have asked for a better venue!! The service was impeccable, the food was excellent and the garden room was absolutely beautiful!\n\nThe coordinator of events, Meryl, was spectacular. Anytime I had a question or desired a change, she was always available. Thank you Meryl for all that you did. The night was perfect!", "author": "Barbara R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-19", "description": "This place deserves the basic 3 stars for the price / quality of food ratio. For the area I'd expected entrees to be a few dollars lower, especially given how standard (for French cuisine) they were. However, the ingredients seemed high quality across the board and the cooking was done very well (though not expertly). The fish in parchment I had came out a little bland - both fish and squash came out sapped of flavor and tasting mostly of under ripe lemon which is not wholly unpleasant but a little disappointing.  However, the other dishes - mussels in a thai style sauce, beef cheeks with red wine sauce, and peche melba all were rather well done.\n\nHowever, I give them an extra star for Nancy, our extremely nice hostess. She was excellent with the wine recommendations, attentive, and seemed like she actually cared if we liked the meal. Plus, she let one of my dinner companions speak to her in very poor French, and she remained smiling - a feat!", "author": "Steven J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-04-30", "description": "AMAZING!  We booked our wedding here.. Meryl and her staff were incredible!\nThe entire team at Bacchus was FANTASTIC.  Meryl (manager) kept in constant contact with fiancé and I from the beginning until the end.  Delicious food, wonderful staff- very flexible team to help us with our special day.  The restaurant itself is a bit small, so we decided to invite our guests to join us in the two beautiful gardens in the back.. April showers bring May flowers... It was an April Monsoon Wedding and it was wonderful!  The staff sealed off the back garden roof and installed heat lamps.  The back was filled with candles and wonderful drapery.  The wedding was simple and superb.  The staff was extraordinarily accommodating and professional.  The food and wine were great- our friends continue to comment how lovely the wedding was!  Lucky us!  Thank you Meryl and everyone at Bacchus!", "author": "Victoria C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-22", "description": "I love this place... Food is great I'll be coming here very often, the employees are very nice and helpful, I haven't seat in their courtyard yet but I'm looking forward to it and I know I will love it ;)", "author": "Paola M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-11", "description": "Oh My Gosh where to start the ambiance was great the ladies that was running the place are educated about their menu and choices, wine selection was great not bottom barrel lover priced wine but good wine our server was great she knew all the combos and selections, our table was small and close to people but we loved it, oh and let's not for get the foooooooooood Oh My Gosh lovely fooooood, she had the salmon and I had lamb, Oh My Gosh to die for. I highly recommend this place however please save us a seat.", "author": "Sebastiane G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-01-24", "description": "It was a snowy morning and Bacchus wasn't even half full yet the wrong type of tea was brought over twice before getting some regular green tea, my husbands steak was very over cooked on his steak and eggs, and my pouched eggs were watery and overdone. The atmosphere was nice, but the service and food was subpar. For all the brunch options I'd choose somewhere else over here.", "author": "Sheila S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-03-28", "description": "When you walk in the ambiance speaks of a nice bistro, however you have to go over to the counter to order and pay up front.\n\nI ordered a coffee and an omelet. They bring you your coffee and water promptly and even give you water for the table in a nice re-purposed wine bottle.\n\nThe coffee is good (nothing to write home about), however the omelet was sub par. It was slightly browned on the outside and still quite runny on the outside. Id have returned it, unfortunately after I was served that was the last I had seen of the staff. \n\nCoffee gets 3 stars\nAmbiance gets 4 stars\nService gets 2 stars\nFood gets 0 stars", "author": "Brant L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-08", "description": "I had my rehearsal dinner here and have eaten here for brunch, so I will review each separately.\n\nEvent planning: Meryl is a goddess. Truly. We had a place booked for our rehearsal dinner that fell through a month before the date. I panicked, frantically Googled for alternatives in the general area, and found Bacchus. I spoke with Meryl and found out they were available on the evening we needed and came in the next day for brunch to work out the details. Meryl was a dream. Working with vendors while planning a wedding is a lesson in patience, navigating incompetence, and tolerating people treating you like crap while paying obscene gobs of money. Meryl did not require me to do any of those things. She was attentive, easy to work with, and got the job done perfectly. Planning everything was a piece of cake, and the per person cost was far below several other quotes I got from other places. Meryl had everything handled. On the day-of, everything was as promised: lovely minimalist décor in their beautiful garden, to-die-for food, superb service, happy guests, no one rushing us. Honestly, working with Meryl at Bacchus was the easiest part of the entire wedding planning process. Looking back on it, I really wish I had planned to have my wedding there. It would have made everything so much easier.\n\nBrunch: When they say unlimited mimosas or bellinis, they mean it. You really can't get a better deal around. I've had several of their brunch entrée choices and have never been disappointed. Service can be a wee bit slow when they're slammed, but hello, it's brunch time in Brooklyn. If you're in a hurry, you're being unreasonable. Their garden area is beautiful in good weather, and indoors the ambiance is classic and chic. \n\nHonestly, you can't beat Bacchus. I will forever bow to their awesomeness. And though I'm not a mussel gal, I have heard amazing things about their Tuesday unlimited mussels option for those inclined. Go. DO IT.", "author": "Pearl B."}], "servesCuisine": "French", "priceRange": "$11-30", "name": "Bacchus Bistro \u0026 Wine Bar", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "409-411 Atlantic Ave", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/oriVKWBIxKF0EQiVu8iVqg/ls.jpg", "@type": "Restaurant", "telephone": "+17188521572"}