{"aggregateRating": {"reviewCount": 439, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-13", "description": "Delicious brunch. Outdoor seating is amazing. Feels very European. Good service. Just right.", "author": "Benjamin T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-17", "description": "I really like this restaurant, beautiful patio in back. I ordered the hanger steak with mushroom sauce, delicious. Service was fine, nothing special.", "author": "Jennifer A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-11", "description": "The service was quick and friendly, as soon as we needed something we were served. The food was amazing. The beggars purse is always my favorite. I had the skate fish which never disappoints and my friend had the chicken which was really juicy and tasty. She had the Bacchus salad as well and it was utterly refreshing. However the deserts were the best. Their creme bruelee wasn't overly eggy and had a superb crunchy crust.", "author": "Charles K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-17", "description": "This was my third time here and once again, Bacchus did not fail to deliver. I always go on Tuesdays for the unlimited mussels (4 amazing flavors to choose from) but I've also had their burger (YUM!) and the skate fish entree (delectable!) The outdoor dining is PERFECT and extremely romantic as is the entire ambiance of the restaurant. I've seen families dine there but the children are never obnoxious and actually blend in with the older patrons, lol. The entire waitstaff is so friendly and attentive (loooove them!) and there's always one authentic French person on staff (the accent just makes you want to ask them endless questions). Also, great music and I've never had an issue with parking either. All in all, Bacchus is a win!", "author": "Kay C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-04-21", "description": "Sweet, quaint and tres French. The gnocchi was spot on-did not want it to end. Will definitely come back when it is slightly warmer so to take advantage of the romantic outdoor seating area.", "author": "Amy S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-16", "description": "first off, this place make the best Crème brûlée i have ever had. came here with a girlfriend the first time and loved the atmosphere, french waiters small but quaint. the food was so delicious and the selection of wine is awesome. i had not been here for a while and wanted to make sure my taste buds were correct, came here for dinner and def indulged a lil too much, the Foie gras was perfect, i ordered the fish wrap baked with veggies and seasoning, loved and wished i didnt overdo on the app so i can fully indulge. The BF had the beef cheeks - had to try and was not disappointed, melts in your mouth good, so soft and flavorful. i cant wait to go back in the summer to enjoy their outdoor space. def recommend  for a small party dinner since the place really is not that big.", "author": "Alina P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-07-18", "description": "torn between 3 and 4 stars.\n\nthe food was quite tasty and the prices are quite reasonable -- most entrees are in the upper teens and the prix fixe menu is definitely a good value if you plan on ordering both an entree and an appetizer.  since my husband and i always share an app and any dessert, he ordered prix fixe while i ordered only an entree and we shared everything.  we also shared a bottle of wine that was just over $30 (also pretty good for restaurant pricing.)\n\nwe ate the duck rillettes appetizer; for entrees we had the goat cheese gnocchi and the pork belly; and for dessert we had the molten chocolate cake.  the duck rillettes was very good, the goat cheese gnocchi was excellent, the pork belly was decent (my husband liked it more than i did, but i have to admit, i was a little underwhelmed -- and normally i love pork belly), and the chocolate cake was pretty good.  all in all it was a very tasty meal, though the standouts for me were the duck and the gnocchi.\n\nso why am i giving it only 3 stars?  service.  for most of our meal, i'd say the service was decent -- not great, but not awful -- but then we were waiting more than half an hour to get our dessert course.  and actually, the table next to us ordered their chocolate cake a good 20 minutes after we ordered ours, and they received theirs at the same time.  so it's definitely not normal for it to take that long, but that just makes it that much more frustrating -- to know that something went amiss with your order (were they grinding the cocoa beans back there?  did our original dessert fall on the floor and they had to make a new one?) and see the people next to you wait significantly less time than you had to wait, to see them get their dessert at the exact same time as you after you've been waiting for so long -- it's annoying.  if i had to wait that long, i want everyone to have to wait that long.  i'm a nice person like that.\n\nbut, of course, the flipside is that it means it probably isn't typical for it to take that long, and thus my complaint about the service should, theoretically, be an anomaly.  given that, and given that the food was both tasty and reasonably priced, and given the proximity of this restaurant to where i live, i will probably be back to give them a chance at redemption.", "author": "Lily T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-28", "description": "I'm really glad I took a chance to try this place. Venturing north of Atlantic Ave. is something I don't normally do. And by north, I mean crossing the street. Anyway, they had really friendly service to start off with. We had a party of three, and they gave us a pretty big table right up in the front, and as the restaurant filled up, we never felt rushed to leave to give up the table for other people waiting.\n\nOn to the food and wine: both were very good, but the food came in smaller portions than hoped for. We got the brie tartines and serrano ham plate to share. Melted brie on baguette slices... my cat could wake up from a nap and make these and they'd still be delicious. You just can't go wrong. Ham was okay, nothing special. But both plates were a little too small. I wish we got one or two more pieces of everything. \n\nEntrees: I got the gnocchi, the other two people got the hanger steak. It was all quite amazing, but my gnocchi portion was very small. When it was delivered to me, I asked if it was the entree size because it looked really small (you can order either an appetizer size or an entree size). The waitress quickly apologized and said she would have the chef make more for me (apparently it was the entree size). I then felt like a boorish pig and said it wouldn't be necessary. But then I took a bite.... holy crap. Yes, I did want another plate of them. I wanted about 6 other plates of them. They were incredible and I didn't care if I felt like a bossy pig. As long as the staff were happy to bring out more, I was happy to eat more. They get major points for A.) the sheer deliciousness of the gnocchi and B.) the fact that they were eager enough to please a customer that they brought out an additional plate of them.\n\nAs for the hanger steaks, yes, I nibbled on those as well. (I'm training for  a marathon and like to use that as an excuse to eat 35,639,204 calories a day). Now those looked to be hearty portions, and as it turned out, pretty goddam delicious as well. Get the creamed mushroom sauce and you will know redemption.\n\nDessert: unfortunately I have to say meh. Meh. There, I said it. We got the apple tarte tatin, which tasted as if the apples were cut on the same surface as onions or garlic. It was good enough to keep eating, but I've eaten jelly beans out of a trash can before so I shouldn't be one to judge.\n\nAll in all, a great experience. I will definitely be coming back, to try other things, and possibly get the gnocchi again as long as they promise to bring me out three plates this time.", "author": "Graceann D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-05-26", "description": "Wow, was very disappointed by my second visit. I ordered the same app and main as before, but did not get the same quality preparation. The garden was full of patrons, but the restaurant itself was nearly empty, so that's no excuse for the extensive waits we had in between waiter visits. You would think the wait staff would have noticed three skeletons propped up in seats in the corner amassing cobwebs, but they didn't pay us much mind at all.", "author": "Colleen K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-10", "description": "shrimp had a great taste but nothing that amazed me. still, the customer service was great and i loved the atmosphere. it's great for a cozy romantic summer evening", "author": "Luna L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-05", "description": "A+ Don't miss this place! A few steps from Smith Street and so much better than anything you could find there. Great value for your $$. Fantastic and imaginative menu makes this much more than your average french bistro. Even the salads are unusual...Lovely garden setting with charming touches in the interior. High quality food that is clearly being made with love. Great service. Try the skate fish or fish of the day en papilotte...Peach Melba desert was just average, but will definitely be back to try the entire selection. Feels like France!", "author": "Nancy D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-07", "description": "We went after a BAM show and had a perfect experience.  We were seated immediately and our 2 waiters were extremely friendly and attentive.   The service was very quick, but we didn't feel rushed.  The food was spot-on (had the salmon/lentils \u0026 carrot/ginger soup) and the wine was a really great deal for the price.  It was lovely all around \u0026 we'll definitely be back.", "author": "drea b."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-08-25", "description": "I see this place as a piece of France transplanted in Brooklyn.  The food and preparation were for less of a better word perfect and I loved the service (The Croque Monsieur was the best I ever had).  \n\nUnlike it's typically done in this country where \"you're done eating - here's the check - next customer,\" here it's like \"take your time and relax.\"\nAll the better to the relaxing service is a beautiful outside eating area with trees and vines where passing time and talking could not be better.", "author": "Bobby B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-05-24", "description": "An early Brunch at 10am or 11 am sometimes facilitates the need for a a later Brunch at 3 or so. These were the circumstances when I found myself at Bacchus.\n\nI had  the crab sandwich which was so delightfully portioned and yummy-it was just the right size YUM.", "author": "Eve S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-02-15", "description": "Went for valentines day, maybe that was the issue.  Food was not what I expected. However, I will try their wed burger nights and sat/sun brunch before I'm totally down on it.  I blame valentines day.", "author": "Dan R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-27", "description": "I was happy to stumble upon Bacchus last night. It took a bit of time for the food to come out, but it was delicious. They have a great selection of wines, and the creme brulee was heavenly.", "author": "Alisa P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-09-09", "description": "I appreciate this beautiful space and the great menu that the provide for brunch. The prices are great, and for $24 you can get an entree and all you can drink mimosas. Sweet deal! But where this place falls short are in two things most valuable to me as a consumer with an appetite like a horse; service and food. It was a muggy Saturday, and our group of 6 had reservations. We were seated early in the back of the restaurant with great views of the garden. It was HOTTER THEN HADES inside with no AC or any air flow, which made several in our party uncomfortable. And since it was hot we needed H2O which was very slow to come, as was the service at placing drink orders all together. Half of the party was thrilled with their food (eggs benedict and steak sandwich), a quarter believed their food was spoiled (crab benedict) and the last quarter of us were OKAY but unimpressed. The portions were very generous, though, and the fries were fantastic. SO the take home- be patient, go in cooler weather, eat eggs benedict. Boom.", "author": "Katy D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-04-24", "description": "I really, really wanted to love this place, because I am a big fan of French food and upon entering the restaurant it looked really cozy, inviting and with just the right amount of lighting.  Unfortunately, that was pretty much the only good thing about it.  The waiter was attentive but not very knowledgeable about the menu or the wine.  When we asked for a recommendation he looked frazzled and confused.   We decided to get the appetizer sampler which had 5 of their appetizers in mini portions.  You would think that out of 5 at least one would be decent, but nope.  They were all pretty flavorless and bland, except for the shrimp which was one of the saltiest things I've ever had my whole life.  I couldn't even finish it.  Disappointed at the appetizers we still had somewhat high hopes for the mains, but again we were faced with bland , bland, bland food.  I had the fish baked in a papillote parchment paper and it had barely any seasoning.  My husband had the steak which wasn't very good either.  Sad because the place itself is really cute and has a really adorable garden.", "author": "Anna K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-10-11", "description": "Charming restaurant that fits well with the neighborhood.\n\nScallops appetizer stood out, other dishes (lamb shank, sea bass) were good too.\n\nService was good, laid back \u0026 they made a great dessert recommendation.", "author": "N T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-02-21", "description": "My boyfriend and I went here for a romantic dinner prior to going to see an opera at BAM.  Because the show started at 7:30 and I tend to get really anxious when I feel the meal might not wrap up in time, we made a reservation for 5:30, which I felt would give us more than enough wiggle room to eat and get to the show.\n\nThe restaurant's ambiance was fantastic and the staff was very friendly.  Although the restaurant was not crowded at 5:30, it did start to fill-up pretty quickly thereafter so I was happy we'd gone with the early start.  We ordered the prix fixe menu at $25, which was a good price for appetizer, entree, and dessert, plus wine.  The goat cheese appetizer was delicious, although my duck rillette felt dry and could have used more flavor.  My boyfriend thoroughly enjoyed his salmon entree, and the pork belly I ordered was fairly good.  \n\nThe desserts (chocolate mousse and tarte tatin) were the perfect conclusion to the meal.  I would have given the restaurant 4 stars, but unfortunately, we couldn't really enjoy our dessert because the service was so incredibly slow that by the time we got them it was already 6:58.  Even though the desserts were ready, it took my boyfriend flagging down the waitress to actually get them delivered to the table.  We had to rush through dessert while paying the bill at the same time so we could leave and head to the show.  People who had come in after us got their food, paid, and left before we even got dessert.  Not a great conclusion to an otherwise good meal.", "author": "Beth P."}], "servesCuisine": "French", "priceRange": "$11-30", "name": "Bacchus Bistro \u0026 Wine Bar", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "409-411 Atlantic Ave", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/oriVKWBIxKF0EQiVu8iVqg/ls.jpg", "@type": "Restaurant", "telephone": "+17188521572"}