{"aggregateRating": {"reviewCount": 439, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-19", "description": "Yum!! French food, sooo much better than Bar Tabac. Loved the frisée salad and goat cheese pouch. great outdoor space, too!", "author": "Virginia H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-15", "description": "I am basing this review on our New Year's Eve dinner we had at Bacchus. Every single bite was delicious -- I had the endive salad for a starter, the fish with purple mashed potatoes (my favorite part) and since I'm off sugar I gave away my dessert, but my partner and friend devoured their chocolate molten cakes and my espresso ice cream. Also, the service was fantastic and it's the restaurant itself has a real rustic feel to it.", "author": "Rosie D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-04-12", "description": "Bacchus? Hardly... even... know us! Har... har... err... har??\n\nNow that we've had a chance to dispense with the requisite humor consignments, let's move on to what we came here for: the food and wine. Witness the April 2009 monthly dinner group installment, the \"unkosher for Passover\" edition. I ate my fill of matzoh and drank my four cups of wine the night before, so I figure my work here for Passover 2009 is done. I did momentarily consider taking some lambs blood with me to mark the doorposts of the restaurant with, but I'm not the first born anyway, so I figured I was safe. I also had a sneaking suspicion the proprietors wouldn't enjoy that so much. No, not so much.\n\nAfter a few wrong turns I arrived at a mostly-empty restaurant (no doubt because it was Passover and Spring Break was in full-gear). I sat at the bar drinking a lovely glass of Broully and chatting with our soon-to-be waitress, with whom I discussed the vagaries of the economic situation and other relevant subjects, while awaiting the arrival of my dinner companions.\n\nThe restaurant has a homey, rustic feel which I favor. There was even a young lady who arrived by herself in the interim and sat eating dinner and reading a book, which, given the atmosphere, was more than appropriate.\n\nThere were far too many mouth-watering options to choose from on the menu, so we decided to share a few appetizers to start off with. All of us wanted French Onion Soup. Simple, easy. One complaint, too much salt, not enough sherry, but it was piping hot and otherwise tasty, and loaded up with Gruyere. YUM.\n\nThe three of us split the \"Crispy Goat Cheese and Pear Beggar's Purse with Fig Relish,\" which was snarfled (yes, SNARFLED, ok?) with RELISH, if you get what I'm sayin'. I think you get what I'm sayin'.\n\nNext up was the \"Duck Foie Gras Terrine Served with Toast Points\". I often wonder why they call them toast \"points.\" Yes, yes, they're pointed, and they're toasted, but they consist of more than just a toasted point of toast. It's basically a whole little piece of toast without the crust, no? A triangular little piece of toast, even. Is that the point of toast points? I have no clue, but however, this reminds me of a song:\n\nMy hat it has three corners,\nThree corners has my hat,\nAnd if it had not three corners,\nIt would not be my hat.\n\nAh yes, Kindergarten. But I digress, back to the foie gras: it was absolutely delicious, creamy, rich and delicately flavored. It's one of the those dishes that when you eat it (if it's good foie gras, anyway), you start off bold and eat big, whopping chunks of it and spread it wild and wooly with reckless abandon on your toast \"points\" (and there are really never enough those, either). But as the supply of foie gras dwindles, you start using it more sparingly, and when the toast points run out you start looking for other things to spread it on, i.e., the bread served on the table, napkins, knuckles, fingers, car keys, whatever you can find. There comes a certain melancholy with the ensuing paucity of foie gras. Then you pop your Lexapro and everything is cool. On to the main course!\n\nMy one companion and I opted for the \"Boeuf Bourguignon,\" which comes served in a black pot, swimming in winy gravy. It also comes with a tasty if not remarkable mac 'n' cheese, which I proceeded to dump hunks of into Le Boeuf pot, soaking up some of that deelish gravy in the process. Heavenly.\n\nMy other companion opted for the Hanger Steak, which I did not sample but he indicated was quite good. \n\nAs augmentation to all these sumptuous victuals, we ordered a lovely Bordeaux, the 2002 Chateau Cantmerle, which I'd had before and was perfectly drinkable and reasonably priced at about $50 for the bottle.\n\nWe finished off with some desserts and coffee, and I have to say my latte had the stiffest most silky foam I have ever experienced. We split two desserts, a creme brulee, and another called \"Island\" of something or other, which consisted of an egg custard swimming in syrup with a crust not unlike that of creme brulee (created with a blow torch which caramelizes the sugar). The crust was the best part as the custard was a tad on the egg-whitey side.\n\nAll in all, a very satisfying meal in a nice, chill atmosphere. I would recommend Bacchus highly. I think the bill came to around $60 or so per person before tip, and this includes the bottle of wine and another glass that was consumed beforehand. Not bad for a meal of this quality.\n\nTake your friends, your best girl, your mom, or even your manicurist's dog polisher there. They'll be sure to love it.", "author": "Michael F."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2008-11-11", "description": "First off, the problem is not the food.  The problem is the service.  It is unfortunate, really.  A delicious croque-monsieur topped with a fried egg was almost ruined by a waitress so inept that her saving grace was the peels of laughter she elicited by frenetically flailing away at the few tasks her job required.\n\nI was warned that Bacchus had some problems, but I was not prepared for them.\n\nFirst off, it took two or three requests for us to procure water, some bread and olive oil or both; nevertheless, we were made to feel as if we were being rushed through a Sunday afternoon that saw our unfortunate waitress' station totaling fewer than ten guests at 3 tables.  Furthermore, the best she could do to explain a dish was hold us in contempt for not speaking fluent French while simultaneously failing to speak passable English.\n\nFeelings of frustration were mounting when I noticed a lipstick stain on my glass of Cote de Rhone.  But the tension was cut with wily absurdity when my waitress assured me that the stain was not lipstick.  \"It's soap, she told me.  I could bring you any other glass and you would see that stain on them all.\" (That is not verbatim, but efficient paraphrase.)\n\nOh!  I thought.  She went on to explain how they do not polish their wine glasses at night but let them sit and air dry leaving these stains.\n\nWell then, by all means do not go through the trouble of washing, drying or providing a clean glass upon request.  Why should wine glasses matter at a place called Bacchus anyway?\n\nMeanwhile, the place next door had a 30 minute wait.  At Bacchus, the glasses fro Saturday night are still unused as the dinner hour approaches.\n\nAgain, the food is not the problem.", "author": "Kevin K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-03-23", "description": "Came here on a recent Tuesday and the place was for the most part empty. We were seated at arguably the best table in the house...right by the front window. The service was great and very attentive without being annoying, so that was pleasant. I really enjoyed the decor. The restaurant was very warm and inviting - a perfect spot for a romantic night out.\n\nThe appetizers were phenomenal. We shared the escargot and tuna ceviche. However, our entrees were less than impressive. He had a salmon dish and I had the tuna special. The crème brûlée made up for the entrees by being so delicious. \n\nOverall I enjoyed our meal. Would I necessarily eat there again? Maybe to have a bottle of wine, appetizers, and to split a dessert...but not for dinner.", "author": "Heather S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-09-27", "description": "I recently had my wedding reception at Bacchus.  It was FABULOUS.  Buffet style food was delicious - I expected it to be good, but this was great.  Many of our guests commented on how this was the best food they'd had at a wedding, and I'd agree!  Very fair price to have a large party here and rent out the restaurant and many food options (complete with amuse bouche and appetizers).  Bruno, the owner, was a delight to deal with and the staff was all smiles even when my family was being a little demanding.  We let Bruno pick out the wines and they were perfect (try the organic wines).   If you are considering having your reception or a party here give Bruno your budget and he will work wonders!  We were delighted at the food, atmosphere and drinks we could get with ours.  \n\nWe had dinner at Bacchus a few times before picking it for our reception and the service was always good and food was excellent (my favorite is the puff pastry with goat cheese, pear and fig jam appetizer.)", "author": "Danielle M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-22", "description": "A great find. My boyfriend and I wanted to do a dinner out for just the two of us on New Year's Day while we were in NYC visiting some friends, and we randomly chose this place because it was close to our hotel in Brooklyn. And we are both so happy we found it!\n\nFirst of all, the ambiance was very romantic -- soft lighting without being do drab, a cozy feel in the dining room without feeling too close to other diners. (Later in the evening around 9, however, a large group did come in and it got significantly noisier -- not sure if that is a regular occurrence or a fluke).\n\nSecondly, the food was wonderful!! We split the duck rillettes and the goat cheese with pears as our appetizer, and then he got the beef bourguignon and I got the gnocchi with vegetables and goat cheese. We loved everything, especially the two goat cheese dishes. As a dessert, we got the chocolate molten lava cake --- we probably didn't need it, but we couldn't resist! I also felt like it was reasonably priced for the nice quality of the food we got. \n\nOverall, a really nice date place with yummy food!", "author": "Mary D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-23", "description": "Another wonderful meal with great service on a rainy night!  Their fries are great and the portions for the Brooklyn Dine-In special were huge!\n\nI sat in the back this time - this place has so much quaint charm!", "author": "Sarah G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-29", "description": "Drove up from Baltimore and needed a quick lunch/early dinner near our hotel before heading across the bridge for a work event. Ordered off of the lunch menu. Waitress was attentive and extremely friendly. The mussels in the white wine sauce were to die for!!!  Perfectly cooked and seasoned. Boyfriend had the burger (excellent) and we shared a bottle of the Malbec and the molten chocolate cake. Anytime we are back in NYC, will make sure to head back  to try the dinner menu!", "author": "S W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-17", "description": "Great food at a great price $25 for prix fixe dinner. Highly recommend the escargot, duck rillettes, crispy goat cheese croustillant and the salmon.", "author": "Matt C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-26", "description": "Excellent restaurant, excellent service. \n\nMy husband and I went to Bacchus for Restaurant Week in Brooklyn. We didn't have a reservation but the restaurant made room. I've been to Bacchus before, but it has been at least two years and my experience at the time was so so. This time around, though, I was pleasantly surprised. \n\nThe restaurant has a french bistro/neighborhood feel to it. I wish it were closer to my home, b/c I would probably go more often. My husband and I both had the three-course prefix menu, which had interesting choices, such as escargot. Although outside of his comfort zone, my husband ordered it for his appetizer and he truly enjoyed it. The seasoning (garlic and pepper, primarily), were an excellent compliment to the meat. Our entrees -- skate fish for me, steak for my hubby -- were also really good. The desserts -- creme brulee and chocolate mousse -- were okay. Nothing to write home about. But $25 for the three courses made it worth our while. \n\nWith a romantic atmosphere and friendly service, I would definitely check this place out again.", "author": "Camille E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-01", "description": "Big fan of Bacchus.  We live in the area and go often.  Place gets crowded so be prepared to wait or go a bit earlier.  French Onion Soup is delicious - and I like to think I've tried them all!  Sometimes staff gets the meat-order incorrect (i.e. ask for it well-done and get rare...) but food is consistently good.  Service is fine.", "author": "Krista C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-06-26", "description": "What can i say about this place? How can I capture the thoughts trapped in the prison of my mind? My love affair with Bacchus is long and sordid, and always an exciting. \n\nBruno has updated the menu again and the food is fantastic. The live music they have is great; small ensemble players in the storefront window are quiet and thoughtful, and make the zinc a nice place to have glass or two or . . . of wine. \n\nIn the Summer, the patio is great and good for large parties. And the ping-pong table keeps a smile on my face whenever I'm there. \n\nBruno is great, and he and his wife and two children live upstairs. So it has a very nice family oriented vibe and stands out in the neighborhood on personality, quality food, and a fantastic wine list of affordable, and very good, French gems.", "author": "Peter N."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-03-25", "description": "Finally got to try the menu here during Dine In Brooklyn week 2010. Had a 6:30 reservation with a girlfriend and ended up departing at 9! Quite a nice place to linger at, until it becomes packed and very loud.\n\nThe pre fixe menu was pretty nice. Started with the warm goat cheese ball salad thing. Then I had the skate fish, which was melt-in-your-mouth delicious. Sides were A-OK, too. Bottle of Bordeaux for $33 wasn't too bad, either. I indulged in the Floating Island dessert, too. It was just fine meringue with hardened caramel on top.\n\nNot sure I'll go back to Bacchus until they open the backyard patio, which I feel will add much needed space and quiet.", "author": "Emily D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-10-15", "description": "SUPERB.  Other than one observation I had, this place is heavenly.\n\nThe one caveat:  the beer is consistently not cold enough - for instance, in the summer, beers should be cold ... I want my beer cold in all weather, to be honest.\n\nAnd the beers are priced as if they were a pint, but they are just a glass.  \n\nOkay, other than that, I love the place.\n\nLOVE IT!!!", "author": "sally m."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-09-06", "description": "yes, the french infest this fine city of ours not unlike bedbugs do, but in this case I was transported to Eze on the French Riviera .... i was literally drowning in the gems of french culture - french wine, french women, and french local cuisine. the well-nicotined, disheveled owners that lounged around were french too (sorry gents, but the women were exceedingly enchanting).\n\nFood-wise...\nwe commenced with an utterly intriguing goat cheese \u0026 pear tart. let's just say the plates looked shiny like they had come out of the dishwasher by the time everyone was finished. \n\nthe gnocchi was ...like all undeniable gnocchi are - slightly fried on one side, just one. so one row of teeth sinks into the pillowy, al-dente flesh on one side and the other row breaks into the toasted, buttery crackle on the other. it's playing both sides.\n\nand for the win... an apple tart irretrievably macerated in some type of alcohol, cinnamon elixir. my god. consuming it slice-by-decadent-slice was like sunbathing in the sand with tanned goddess after goddess.\n\nambience-wise.. t'would be unfair for me to elaborate as I was there for a rehearsal dinner and the back garden had been set up like a MidSummer Night's dream. i might have glimpsed an elf or hummingbirds or moonbutterflies, but details schmetails.\n\ni almost don't want to go back to preserve the memory of this single-night dine. but i'm not above overindulgence. never was, never will.", "author": "Catherine L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-29", "description": "Beef bourguignon was super salty and I've had this favorite dish homemade style many times so it's difficult to measure up. Thus, I won't be too harsh. Especially because the service was so friendly and the ambiance was lovely - very French, very romantic. Had a frisee salad w goat cheese and salmon, which was divine. My bf had escargot as an appetizer and, although, they weren't great, the white wine sauce was, esp as a dip for our bread. Bourdeaux wine was excellent, as was the Flottante dessert. My bf had the pork belly for dinner but thought that it was too much as a main course - better as an appetizer. He did love the carmelized onion sauce it was cooked in.", "author": "Genoveve R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-12", "description": "great eggs benedict. unlimited mimosas on sundays. waiter was extremely attentive and friendly.", "author": "Danica J."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2008-12-12", "description": "I went here last night for a Christmas party hosted by the company where my husband has been freelancing. The food was good! The whole \"vegetarian\" thing has effectively stricken most French places from my list of favorite places, but the goat cheese croustillant here made me feel less like an afterthought. The owner appeared a few times throughout the night and seemed like a nice guy, he even popped in to the raucous Christmas party to thank us for coming to his joint.\n\nThis is a small restaurant. I'm going to guess there were 30 people at this party, and the back room was absolutely filled to capacity. I think this is where the problem came from: the servers were totally overwhelmed. Since this was a company party, everyone had pre-ordered a 3 course meal, so the servers went through the room and asked everyone to confirm their choices. And then they came through and asked again. And then they came through and asked AGAIN. And then they pretty much delivered all the appetizers haphazardly, completely disregarding the information they had procured from everyone three times. The entree delivery system was even funnier, the servers walked past the tables and barked out the name of an entree and handed it to the person who responded first.\n\nOne thing the servers did impeccably was fill the wine glasses. I was able to drink about 2 sips before the wine fairy reappeared. So there's that.\n\nI'd come back here if I was into (meat) French food and had less than 29 people with me.", "author": "G Q."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-06-28", "description": "Mediocre at best.  More attention paid to bridal party reception than guests. Mussels dijoinasie (sp?) Tasted more like watered down yellow mustard.pork belly tasted like bland cardboard.  Crabcake tasted like bland tuna. Would not recommend this to any friend.", "author": "Harshpal S."}], "servesCuisine": "French", "priceRange": "$11-30", "name": "Bacchus Bistro \u0026 Wine Bar", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "409-411 Atlantic Ave", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/oriVKWBIxKF0EQiVu8iVqg/ls.jpg", "@type": "Restaurant", "telephone": "+17188521572"}