{"aggregateRating": {"reviewCount": 439, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-20", "description": "I was there with my bf on sunny Sunday for brunch. It was plenty of tables available outside the street and also next to the window, where we were happy to sit. The service was good and relaxing. Nobody pushed us and we were able to enjoy Brooklyn vibes and absolutely delicious food! I got salmon burger that came with one of the best fries I've ever had, and my boyfriend got eggs florentine. Both dishes were very fresh, tasty, plus generous portions. And one more thing - the prices are good too. Highly recommend this place. We'd definitely return!", "author": "Alena B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-23", "description": "This place is the best! \nThe entire restaurant has a great vibe making the space welcoming and cozy. The outdoor area is my favorite patio to brunch upon. \nThe veggie quiche is my favorite breakfast and a go to weekend indulgence. It pairs perfectly with the Rosè (which as you can tell by the theme of this post) is also my favorite.\nStop in for a late brunch/early lunch or when ever. Definitely try it out this summer.", "author": "Megan R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-01", "description": "Cozy place!!\nGood ambiance with outdoor seating.\nWe tried hanger steak and pot of mussels\nBoth are delicious and fresh!\n\nPrice range is 13-20$ in lunch time\nPrice is reasonable too!\n\nThey have only one server during lunch time\nSo service was kinda slow.\n\nBut, Overall its nice place. Definitely will come back!", "author": "Haegee C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-14", "description": "Bacchus is truly a magical, hidden gem. I hosted my sister's bridal shower there this past weekend and everyone who attended raved about the fantastic service, food and atmosphere. Literally everything was perfect and I have Meryl and Alpie to thank. Their prices are SO reasonable too. They really took such great care of us!", "author": "Elyse P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-03", "description": "It's so rare that I rate a restaurant but I love this place. Have been for brunch, lunch, and dinner. For starters the quality of the food is nothing short of amazing. Everything I have had is delicious. Also what you get for the price is amazing. I've been to many other places that would upcharge you so much for what they include. What really sealed the deal for me was when we went on a Tuesday for all you can eat mussels. I tried all 3 sauces. Each came in its own steamer pot and included what must have been 1.5-2 dozen mussels. When I asked if I would be judged for ordering a third serving, I was told \"absolutely not, the record is 11\". Amazing service. Amazing food. Just amazing.", "author": "Jennifer N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-17", "description": "Met the girls for lunch our bimonthly update on our lives meal..Had the Croque Madame..Perfect texture, eggs soft and the bread was outstanding..Béchamel sauce was light on the tongue Oh and shall I talk about the mimosas..Two to be exact...Maybe it was my  outstanding personality, attentive service..to our needs.(mimosas for the most part) A giggly lunch with the girls..", "author": "Esme J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-05", "description": "AMAZING!! My husband I went there for Brunch and the food was fantastic! Really good french food is hard to come by and so this place is legit. I cant wait to try their dinner menu.", "author": "Harrison V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-02", "description": "Attended a wedding here yesterday and it was lovely.  The garden was airy and private, the food FANTASTIC and the service excellent.  It was a lovely place for a wedding.", "author": "Pam S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-01", "description": "Great French- American Food. Escargot was good, Ribeye was nice and tended, mussels were ok. My personal taste is it could of used more seasoning.Even better wine selection ! Ambiance is nice. Attentiveness could of been better, We had to flag down our server amd staff for dessert and the check. But overall a good dining experience !", "author": "Saul G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-29", "description": "Like this place so much! My husband and I came here for a casual birthday dinner as it's during the week. The food was exceeding my expectation given the price, and the waiter especially the girl is very welcoming. Also, love the garden with beautiful lightings giving us a romantic atmosphere. Lovely place!!", "author": "Wei T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-24", "description": "Came here with a friend to get drinks and a snack. I ordered the tuna tartare and the duck confit salad. I've never had duck confit with frise lettuce. It was a great choice and well done. I also thought the tuna tartare was light and easy and felt like a healthy choice. I also like that it's a little bit of a quieter restaurant and bar so you can actually have a conversation with the person you're with. They have a beautiful outdoor patio that I look forward to coming back and trying out.", "author": "Rachel F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-18", "description": "Amazing!!! I went for a bridal shower so I can only review this type of scene...\nFood was great\nService on point!!! \nPlace was so charming... I will definitely go back to check it out for dinner...\n\nOh and the bathroom was CLEAN!", "author": "Izzy I."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-11", "description": "This review is long overdue. My husband and I were married at Bacchus in September 2017 and I couldn't say nicer things about the staff who helped bring it together. We viewed A LOT of venues and they were by far the most accommodating. Don't get spooked if they're slow to respond to emails at first. When it came down to it, Meryl, Alvaro, and the rest of staff were totally on their game. I made changes to the menu and they made it work within my budget. They handled all of the set up and breakdown. They answered every one of my many questions. And the venue itself was absolutely for perfect for our wedding. We held the ceremony beneath the big tree in the yard, enjoyed the cocktail hour in the wine bar, and moved outside again for dinner and dancing. Our guests raved about the ambience, food, and wine. Dinner took longer to serve than expected (we did have 100 ppl) so our Spotify playlists ran out near the end. But that was an easy fix. Everything else moved seamlessly. The staff even put food aside for me at the end of the night as I was too busy dancing and mingling to eat. I'd highly recommend to anyone looking for a beautiful, laid-back space.", "author": "Ashley R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-29", "description": "This was our first time trying Bacchus but we gave it a go based on reviews! The entire menu is drool worthy- we had a difficult time choosing! I tried the BLT and my boyfriend tried the Salmon sandwich. We topped it off with dessert that did not disappoint. Will come again!", "author": "Maranda T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-15", "description": "Bacchus is a lovely little French bistro in Boreum Hill. The space is light, airy and warm, and there is an awesome backyard space that I can't wait to visit in the summer months. \n\nThe brunch menu is quite large, with egg, crepe, quiche, salad, and sandwich options. The food is all very good, though the crispy bacon could be just a tad crispier. And it should be noted that the bar serves only wine and beer.", "author": "Krista J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-28", "description": "This is a great place! The barman looked after us and made recommendations when we couldn't decide what to have. Food was delicious and atmosphere was good.\n\nA place I would visit again.", "author": "Hitz M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-04", "description": "Bacchus is the perfect place to enjoy a summer evening drinking wine, eating delicious food and soaking in a cozy and rustic atmosphere. I went for a friend's graduation party and we had the entire back courtyard section to ourselves.  The bamboo wall coverings, palm trees, white drapery from the uncovered lattice overhead and surrounding floor lights made for the most perfect dinner setting.\n\nThe food was literally some of the best food I've had in Brooklyn.  For starters we had a fresh salad with strawberries, pecans, avocado, feta cheese and then came this OUTSTANDING pear and goat cheese filled filo dough pastry that was decorated with a dark blue flower, greens and a bright red strawberry.  For the main course we had to choose from salmon, baked chicken and steak.  I ordered the chicken, which came with mashed potatoes and gravy, and carrot \u0026 zucchini sticks.  The portion was so large (which I love because I hate going to restaurants that don't give you enough food) and it was sooooooo good.  I was stuffed by the time dessert came, but I ate that warm apple with vanilla bean ice cream anyway! \n\nThe Pinot Noir I had was really good (wish I remembered the name but I got too drunk), and everyone at the table seemed to love the rosé selection. \n\nYou can't go wrong with this place, it's perfect for a date night, hanging with friends or even larger celebratory occasions!  I'll definitely be back and am already recommending it to friends :)", "author": "Christian L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-25", "description": "My friend hosted a private event (engagement dinner) on a Friday night. First of all, what a beautiful establishment! The bride to be was extremely content with the service provided leading up to the event and during the dinner. As a guest, the service was impeccable, I was able to just enjoy the entire event. They also had decorated everything beautifully! \n\nThe food was delicious! Never have I experienced such a delightful 3 course meal. Everything was seasoned to perfection and portions were the appropriate size.  It is a far commute for a fellow Bronx resident but the food totally makes it worth the trip. \n\nLook forward to dining here in the future.", "author": "Jess G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-29", "description": "Delicious!!\nPlates are gorgeous!\nExcellent!\nGreat ambiet, great wines, good price!\nMuch better than Balthazar!", "author": "Rafael J."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-06-05", "description": "Food was good and so was the service but they charge $14 bucks for a ravioli appetizer that only has two raviolis....seriously 7 bucks a ravioli is ridiculous", "author": "Vee S."}], "servesCuisine": "French", "priceRange": "$11-30", "name": "Bacchus Bistro \u0026 Wine Bar", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "409-411 Atlantic Ave", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/oriVKWBIxKF0EQiVu8iVqg/ls.jpg", "@type": "Restaurant", "telephone": "+17188521572"}