{"aggregateRating": {"reviewCount": 439, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-05-07", "description": "Paris in Brooklyn.  The food is excellent.  This is baltazar but in brooklyn.  I come here on the weekend for breakfast.", "author": "Alexander P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-04", "description": "Ridiculously adorable, and delicious to boot. Jeff M. and I had gone on a half-hearted appointment to look at some apartments on the edge of Fort Greene, and decided to make the trip worthwhile by sticking around for dinner. We stumbled on Bacchus and are glad we did. Everyone who works there seems to be actually French, the back garden is lovely and the weather was great, and the moule frites with sancerre was a perfect dinner. I'd love to return.", "author": "Sarah C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-29", "description": "Wife and I had dinner here last week. The staff were friendly and attentive on our arrival. The pork belly appetizer and braised beef cheeks were cooked well and were delicious. I had a glass of the house Cote d Rhone which was fantastic. The service attention dropped off a little towards the end of the meal, which would be OK in the lovely backyard if my wine glass were not empty. The creme brulee was quite good.\n\nThe backyard atmosphere is quiet and very nice. We'll definitely be back.", "author": "Jeff R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-05", "description": "My husband and I had our wedding reception at Bacchus Bistro on July 11. It was wonderful! The outdoor space was really pretty. We brought the table runners and the flowers and staff set up everything perfectly. Meryl was very considerate of our budget. All the answers to our questions, for the most part, were \"no problem.\" My husband wanted to make our wedding cake and they had no problem with that. At the beginning of the party we were extra hot and staff quickly pulled the covering over the sitting area to give us much needed relief from the sun. I'm so happy to have had my summer wedding here!", "author": "Josey B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-28", "description": "Great french cuisine :)\n\nI (unfortunately) didn't come with much of an appetite so I got the french onion soup, which was so rich and amazing. I also got the appetizer serving of goat cheese gnocchi, with very well seasoned zucchini and squash with a sage butter that was fragrant but not overpowering AND the vegetables were tender but had a slight bite (how I like them). Only downside is though it was an appetizer size, there were only 6 1.5 in. gnocchi. There were definitely more veggies than gnocchi...but besides that, so good.\n\nMy room mate got unlimited mussels (Tuesday night special) which were to die for. You have an option of 5(?) or so sauces...so you will definitely get what you want. Also the fries it comes with (with some skin on and definitely look hand cut) are pretty delicious...I took bites from both. She also got a salad with fried artichokes, which we thought was dressed too heavily. So that was the only downer. \n\nThere is a bunch of wine and even decently priced bottles for some thrifty but love a good bottle epicureans out there. I'd go back :)\n\nWe had our reservation at 8pm on a Tuesday night, pretty light crowd...however the lights dim real romantically around 9:30 or so...so if you want to set the \"mood\" make later dinner reservations for that special someone or a girl's night to drink wine and eat good food//relax!", "author": "Gabby S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-31", "description": "Our wedding was in June 2017 at Bacchus. We had 105 people, and everyone was able to have a seat at the ceremony. The staff was flexible with last minute cancellations and seating changes, and we appreciated that very much. We were looking for something intimate with great food and that would allow for good conversation. It was exactly what we wanted. The decor in the backyard was charming in itself, so we did not have to bring much. Meryl and Alvaro were very responsive to our questions in the weeks that led up to our wedding. We met with them several times a couple weeks out from the wedding to go over the menu and logistics, and they met with our DJ as well. The staff were attentive to our needs and requests. They put us at ease. My husband and I created our itinerary, and it was fine with them. As the night went on, Meryl and Alvaro were able to transition things flawlessly from one part of the night to the other. My family told me later that they staff were very friendly to them. The food was a hit and everyone raved about it. My only helpful critique would be that although we bought out the restaurant and backyard, we would have liked to have the adjoining bar room to ourselves, as soon as we arrived.", "author": "Jackie W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-10", "description": "Seriously, I can't even express how grateful we were to have found Bacchus for our wedding reception this past May. From the moment we met Meryl, we knew that it would be a stress-free and amazing event. Besides the fact that the decor and ambiance are to die for (i mean, you literally feel like you're sitting in a bistro in Provence, France), their food is AMAZING, their wine selection is superb, each and every one of their staff members are beyond friendly (with their beautiful french accents and all) and the total cost is very budget-friendly compared to most NY wedding venues. My hubby and I knew that we wanted a very unique, relaxed and non-traditional feel for our wedding. Bacchus achieved that and so much more. Meryl \u0026 staff were super accommodating and attentive to our guests' needs. I would definitely recommend Bacchus for a wedding, rehearsal dinner, special event or even a night on the town. Oh!! And how could I forget the garden area!! Absolutely beautiful!! This is definitely a hidden gem of Brooklyn :)", "author": "Nicole J."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-09-10", "description": "This place definitely is pretty. The outdoor back area is a great place to eat. I came here for brunch last weekend with my friends and was so disappointed. \n\nEverything on the menu sounded amazing. It took me forever to finally decide. I finally went with the chicken sandwich with lettuce, tomato, aioli, and avocado. It was served with fries and a mixed salad. The fries and salad were good. My real complaint was with that sandwich. I bet when you read the ingredients above you thought, \"oh, that sounds yummy!\" Yea, well, so did I! It was one of the most disappointing sandwiches I have ever had. If someone lists a chicken sandwich on their menu one would assume it's a grilled chicken sandwich unless otherwise noted. What they served me was basically a chicken burger. I HATE chicken burgers with a passion! I really tried to eat it but it was pretty gross. Note to the owners: next time specific that it's going to be a ground chicken on the sandwich!\n\nAlso, when the waiter brought me my sandwich it did not have the avocado on it. He came back about 5 minutes later with sliced avocados on a plate. Apparently, this was a build your own sandwich type of thing. The bill only came out to $17 each, which isn't so bad. But since I took about two bites of my sandwich, I spent $17 for some fries and a small salad.", "author": "Elizabeth T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-08", "description": "What a great Atlantic Ave establishment. Wide wine selection and a rather reasonable prix fix menu. Had the pleasure of having their escargot that was seasoned just right, steak that I wanted to both rapidly devour and savor so slowly piece by piece at the same time, and some molten lava cake so potent in flavor. Service was very attentive and definitely a go to date spot. Look forward to having some romantic evenings in their courtyard too!", "author": "Marianne D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-27", "description": "Had brunch yesterday with my son, daughter-in-law and my grand fetus. This was one of many meals here, and it was as sublime and as perfect as always.", "author": "M B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-15", "description": "The restaurant was charming. We chose the garden.  Five of us for dinner. Excellent Choices! Two of us opted for the prefixe dinner Everything we ordered including escargot and hanger steak was great.The steak was nicely cooked and flavorful, juicy meat on the inside. Very enjoyable entrees. Desserts were tasty without being too sweet.  No complaints against this great restaurant.", "author": "Louis G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-27", "description": "I'm pregnant and was craving for eggs florentine. I've explained my situation and asked Albano if I could have a hard boiled instead of the pouched and he said \"we can make a super well done pouched if you want\". I felt very happy and welcomed \n\nEverything my husband and I ordered was delicious and the place is super cute! I definitely recommend it.", "author": "Adriana P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-04-15", "description": "Lovely outdoor patio.  (indoor seating is super spacious too though!)\n\n$25 AYCD brunch. they actually put a whole carafe of mimosas on your table! AND they ain't skimpy on the champagne portion of it either!\n\nCrab cakes a little too much breading for me.  My friend's thoroughly enjoyed their entrees of hanger steak and half roasted chicken.  \n\nthe wait staff was great! super attentive and friendly.  \n\nall in all, a fantastic brunching experience.  definitely adding to my list of drunch in brooklyn!", "author": "Hannah M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-09", "description": "Wonderful experience from beginning to end! Lovely little place - I could almost forget the construction noise next door. Every single thing was delicious- crusty bread, good-value Riesling, outstanding beef cheeks bourguignon, succulent burgers, truffle Mac \u0026 cheese, and 2 lip-smacking chocolate desserts. Also friendly, attentive service with absolutely no pressure to hurry up and leave. 4 people , $200 tip included--exceptional value. Wish I could find this combination in Washington, D.C. Area.", "author": "Mo O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-16", "description": "We had the cheese board and a french onion soup for appetizers and the beef bourguignon for entree and all were outstanding. The prices were reasonable and the service was great. Would definitely go back.", "author": "Nolan P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-30", "description": "We all know Brooklyn has become the newest hotspot for all things food and Bacchus will be no exception.  I know this because I am down with the people -\n\nLocated on Atlantic Avenue, location is decent with adequate street parking available (at least on weeknight).  And neighborhood looks safe enough where I won't get mugged or shot walking down the street.\n\nMet with a couple of friends for dinner here.  The wine list is adequate (no Whiskey, perhaps cause they're French) - we drank 3 bottles of the Malbec which was very good wine.  \n\nOverall, food was good and fresh.  The mussels appetizer was probably the best dish if the night, hands down.  The hangar steak skewers were also well seasoned and the meat tore off the skewer nicely.  We got the pork belly combination platter as well - a little too fatty for my taste or for anyone looking to become a lean machine- so I actually ordered the salad with the pears (forgot name) - good salad, a little oily on the lips cause of the dressing \n\nI decided to go with the hamburger for dinner - well seasoned and cooked.  The bad: the bun was soggy and the burger as a whole was way too wide to fit in my mouth, so I was gnawing on it like a beaver building a dam.  Fries are mediocre at best, and I know French fries (they were not epic by any means)\n\nDecaf for coffee along with molten cake and another desert with fruit in it (forgot name).  They were all good but nothing earth shattering that you also couldn't find elsewhere.\n\nFood overall was good - deserves 4 out of 5 stars.  Problem is service - wait staff polite, but they forget orders (I had to order my diet coke twice), and the ticket time for food to come out I would say is at least 1/2 hr, a little on the long side for sure (I don't think Robert Irvine would approve). \n\nBut I guess I'm pretty cool for coming here along with the other cool local hipsters- check it out if you want to be cool", "author": "Albert Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-15", "description": "I gave this place 5 stars because of their service from the host and waitstaff. The atmosphere was great...not too nosy not too quiet...it was just right...and for Valentine's Day dinner the price was decent and affordable.\nFood was delicious...I would have gave it 4 stars but the small mishap was taken care immediately. Everything was delicious \u0026 wonderful...\nI would definitely go back \u0026 check out their lunch \u0026 the brunch menus... :)", "author": "May Y."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-09-29", "description": "Love their outdoor garden overlooking the church next door. It felt intimate and cozy. \nTheir food was decent, but nothing amazing. Their French onion soup was too strong and heavy on the wine flavor. I really liked their artichoke salad. Artichoke heart was warm and crisp, and the frisée complemented the artichoke well. \nOverall, it's a decent local spot but not worth going out of your way to try.", "author": "Nancy Z."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-07-18", "description": "Came here for my bfs bday dinner. It was ok. I got the Poitrine de Porc \"Confite \u0026 Poêlée.\" Felt like it had a little too much fat on it. But my bf enjoyed his meal. This also seems like a good place to take families. Lot of family gatherings here.", "author": "Lisa T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-11-21", "description": "Bacchus is definitely a trek for me, but it is hands down one of the best experiences I've had in NYC and well worth it! \n\nThey have an amazing prix fixe meal and 3 of us sat outside in the garden in the fall. The server was an amazingly sweet woman who was helpful in her recommendations. I had the escargot to start and a salmon entree, finishing with the ile flotante (floating island dessert). If you've never had it, it's seriously one of the most rich, expensive tasting desserts - soft poached meringue over custard. The meringue is has a caramelized brulee top and served with fruit - I still think about this dessert sometimes!\n\nWe finished the dessert and topped it off with coffee and tea. When they brought the hot water out piping hot and the coffee bold, I was SOLD! \n\nGreat service, beautiful place, fantastic food. We will definitely be back.", "author": "Lily L."}], "servesCuisine": "French", "priceRange": "$11-30", "name": "Bacchus Bistro \u0026 Wine Bar", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "409-411 Atlantic Ave", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/oriVKWBIxKF0EQiVu8iVqg/ls.jpg", "@type": "Restaurant", "telephone": "+17188521572"}