{"aggregateRating": {"reviewCount": 439, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-04-30", "description": "I came here with my hubby in search of moules a gogo (all you can eat mussels) on a Tuesday night.  We were led to the back of the restaurant to an outdoor garden seating in the back with dim lighting.  All of the mussels were cooked well and the portions were huge.  We had a hard time finishing two plates of mussels.  \n\nThere are four different broths to choose from: au richard, mariniere, provencale, and moutarde.  I tried the mariniere and the provencale which was my favorite of the two.  It was light and fragrant, however, it was not the best that I've ever had.\n\nFor $15pp, it is a decent deal.  We will probably go back again and try other things on their menu.", "author": "Anne E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-14", "description": "Had a prix fixe dinner with friends at Bacchus before walking over a few short blocks to BAM for the Dr. John  N'Awlins music extravaganza.  Nice selection of hors d'oeuvres, tasty entrees, and heavenly desserts.  We started with the Crispy goat cheese with fig relish which was oddly reminiscent of an Izzy's cherry cheese Knish from my childhood days on the boardwalk in Long Beach (rich but yummy) and the duck rillettes with apple and onion chutney on Toasted country bread, an unusual sweet and savory combination that was very tasty indeed.  \n\nFor entrees we tried the requisite mussels Mariniere and fries, with garlic, shallots and white wine - plenty of sweet, tender (not chewy) mussels and I found myself picking up a spoon to finish off the delicious broth.  We also had the fresh mushroom ravioli in a light cream sauce - the pasta tasted homemade and was cooked to perfection (al dente) and the crusty sour dough bread came in handy to mop up any remaining sauce on the plate. \n\nFor dessert, the molten double chocolate cake a la mode sealed the deal...it takes an extra 15 min. to prepare, but was worth waiting for.\n\nThe setting is very pleasant although a bit noisy, with a nice view of the outdoor garden in the rear - which looked really appealing if it had been 10 degrees warmer! There were some hearty souls who chose the garden and the one annoying part of the evening was that the door to the garden did not close automatically and the wait staff didn't close it behind them when serving the outdoor patrons... When the door was open we were quite chilled and periodically had to request they close it which was a titch annoying.\n\nThe other prix fixe offerings looked equally interesting as did many of the items on the a la carte menu, so Bacchus is definitely on our list for a return visit.", "author": "Paul K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-03-13", "description": "My boyfriend and I have date night every Sunday night. We decided to check out Bacchus after finding it on yelp. I have to admit, this place is amazing. We arrived at 6:45, with only one other couple there. The waiter was very sweet and brought us sparkling water. He even gave us 2 glasses of wine on the house! My boyfriend and I had the prix fixe which was only $25. This is quite the deal. My boyfriend had the soup and I had the escargot. His soup was so creamy and delicious. The escargot was very plain but came in the cutest dish. The main course was amazing. We both ordered the l'onglet. The steak came with a salad and fries. All of it was amazing and delicious! Afterwards we had dessert which is was okay; wasn't amazing. \n\nThis place is definitely amazing. The ambiance was beautiful. We were seated next to the garden. As the sun set, the garden looked beautiful. I hope to return to this restaurant in the summer to sit outside in the garden.", "author": "Allie Y."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-08-18", "description": "They did not honor the free glass of wine if you mention Yelp promotion. The waitress didn't know about it and the manager wasn't there. She promised to get in touch with manager by the end of the night, but never did. When we showed the actual yelp site with the promotion listed, she said, \"Wow that would be 4 glasses of wine for free - that's a whole bottle!\"\nThe food was OK. The steak was a little chewy but the snails were very flavorful.", "author": "Ivan S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-03-03", "description": "I came here with a friend on his recommendation, without a reservation. The hostess/waitress told us to wait 15 minute -  we waited a bit longer than that and had some drinks at the bar.\n\nThe bar is situated right at the entrance to the restaurant and there was very little room to stand. The place felt cramped even though there was less than a dozen people drinking and waiting to be served.\n\nWhen we were sat, we ordered soups. I had the french onion soup - it definitely hit the spot. Unfortunately, there were some large dried bay leaves at the bottom of the bowl which I had to spit onto the napkin. That was an oversight on the cook's part.\n\nI then shared the warmed brie appetiser with my friend. I thought it was a bit flat and lacked much flavour. It could have easily been another soft cheese because it lacked the distinct aftertaste of brie.\n\nThe main was the most disappointing order. I had the burger, which came with fries and a roquefort (and bacon) sauce. The sauce had bits of fatty bacon so large it felt unappetising and inappropriate for a sauce. The burger meat itself was above average, though it fell apart. There was a 1/2 inch slice of onion included, not the sweet kind, which completely overpowered the taste of the burger and destroyed it completely. The fries were honestly one of the worst I've ever had. I remember fries in high school lunches that had less salt. They were so dry I thought I would crack a tooth eating them. The salad, drenched in balsamic, was simply a sad afterthought.\n\nThe only way I'd come back is if my friend underwrites the next check. A less than stellar first impression from Bacchus.", "author": "G K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-12-19", "description": "Great little French restaurant, run by French people (pretty rare right?). It is not located on smith street, so it's a little bit less crowded but much better! \nThe food is amazing, and it is the only place where I order chicken (tender and perfectly cooked) with potato gratin. YUM!\nAnd the wine list is very complete and totally reasonable. Follow the advises of your waitress. \nIt has a nice atmosphere and lovely service, and it is good for brunch and dinner alike.\nWe are French, and that is THE place which makes us feel like home!", "author": "Nif R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-06-04", "description": "Experimentation was the choice of the day - for lunch ;) I was in the 'hood and stopped by this place. The price was right and menu was quite appealing. I ordered the mussels in tomato herb sauce..yumm First off this place is spacious inside and in the backyard. The staff were cool beans - very knowledgeable of the menu, best wine to accompany each dish perfectly and soooo naturally friendly. I will return back to try the salads, etc. Wished I had room for dessert...maybe next time!", "author": "Chante R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-12-10", "description": "Celebrated a birthday dinner here with the bf. Service was excellent and the atmosphere was dimly lit and romantic. Unfortunately we went on an evening when there was a very large group of ladies having dinner in the same room as us that didn't know how to use their \"inside\" voices. Started with the escargot. It wasn't the best that I've had, but it wasn't the worst - just okay. Also had the pork belly which was not good at all. It lacked flavor, flavor, flavor... and was highly disappointing. Bf had the beef cheeks \"Bourguignon\" and it was delicious - tender and flavorful without being too robust, perfection!  I was hating just a little bit inside that I didn't order that! I opted for the mushroom ravioli with creamy asparagus and parmesan sauce, which was absolutely delicious! I just wish that the serving size was bigger. I went for the pre fixe menu so I'm sure that explains the serving size. For dessert we both had the chocolate molten cake and it was delightful! It was definitely MOLTEN inside. We'll go back again - just not for the pork belly.", "author": "Lenny P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-01-25", "description": "Just mediocre food, service and ambiance.  The beef bourgonion was superb, but the snails were just bizarre.  Wasn't overly disappointed, but wouldn't return.", "author": "ilan r."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-04", "description": "First, let me just say that I have been going to Bacchus for years and I really should have written this a long, long time ago.\n\nBacchus has become our neighborhood go-to.  I'm sure that if I didn't love to cook, we would be there pretty much on a weekly basis.  The food is fresh and very well made, the staff warm and inviting, and the wine list speaks for itself.   Whether brunch or dinner, you seriously can't go wrong here.\n\nThe main reason that prompted me to write this review was my recent baby shower in their garden.  It was perfect.  The ambiance, food, and décor was exactly what I wanted - to spend a beautiful fall afternoon outside surrounded by friends and family, eating really good food. \n\nI look forward to all of the family meals at Bacchus in our future.", "author": "Andrea S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-01", "description": "Our dinner at Bacchus last night almost didn't happen ... I had accidentally made the reservations on Open Table for Bacchus in Buffalo. Luckily, I was able to correct the problem in enough time to enjoy the last night of Dine In Brooklyn at Bacchus.\n\nI picked Bacchus off the Dine In Brooklyn list sort of at random, and I was really pleased with it. The restaurant itself is kind of dark and cozy, and the servers were friendly and helpful.\n\nSince it was (as I've mentioned) Dine In Brooklyn, we had the prix fixe: we started with escargot and duck rillettes, had salmon and steak for our entrees, and finished with molten chocolate cake and an apple tart. It was all really, really good, and I thought the salmon in particular was delicious. It was steamed with some vegetables inside some leek, which was a presentation that I had never seen. (The salmon also came with plantains. I can never say no to plantains.)\n\nOh, and I almost forgot the bread! The bread they serve is like a sourdough with herbs or something, and it's phenomenal.", "author": "Kathleen B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-06-11", "description": "everything was good - EXCEPT THE 78degree TEMPERATURES INDOORS!  i don' t know if the A/C was busted or what, but we sweated thru our entire meal, and it only got hotter over time - I even looked at the thermostat on the wall in the back and it appeared to be OFF.\n\nc'mon, restaurant 101, keep your guests at room temp, its not a sauna steam room...", "author": "Clavius L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-13", "description": "This review is for the Cafe/Bistro that is next to the restaurant. \n\nWalking on Atlantic blvd on a beautiful June summer day in Brooklyn, I get lunch and a soy latte at a new local French bistro. Bacchus has a new cafe, they make their own pastries and ice cream. I haven't tried it but I will go back and try it. I always order a soy latte, either iced or hot. I just love the flavor of espresso and coffee somehow is just too strong for me. Soy milk is a great alternative to dairy, since I think I became lactose over time in my early to late twenties. But from what I understand, humans aren't meant to drink it anyway. I took one sip of the ice soy latte that I closely watched the barista make. I was a bit skeptical however of that taste of this drink; the reason for this is because the soy lattes I always get at Starbucks are made with a specially formulated soy milk made specifically for Starbucks drinks.  Other places usually have that burnt or bitter taste, either because they left the shot for too long or their soy milk is just not bold enough for it. As I keep this in my mind, sipped, then i actually said under my breathe with  a subconscious critic, \"that's Devine!\"  Now, for someone who refrains from using pretentious words and prides myself in this refrain, it really was! They also carry simple syrup that you can pour yourself on the counter. \nThere were absolutely no burnt qualities, the soy was thick and full bodied, not watery. These flavors blended perfectly together like harmony and melody come together to make a symphony.", "author": "Wendy L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-20", "description": "came here for brunch. was pleasantly surprised by the food. \n\nI've walked by this restaurant over a hundred times and have been meaning to try it for a while. It looks like a quaint little restaurant inside. It would've been perfect with some french music or something along those lines...but they were playing hip hop. Hip hop in a club, sure. Hip hop with breakfast, maybe not. It definitely doesn't fit in with the look and feel of the place. \n\nThe service was okay. Not super friendly, not exactly unfriendly. A little slow...but they get the job done. They also let us linger around for a good hour, so we appreciated that.\n\nThe food was good. I ordered the poached eggs with salmon. It came with potatoes and salad.  Unlike most French restaurants I've been, the hollandaise sauce was actually not as buttery as I expected it to be and the salmon wasn't too salty. It was  tasty! My boyfriend's steak and eggs were also really delicious. It was flavorful and not too heavy. This was a great meal.\n\nI would come back for brunch again and I'd love to try the dinner some time.", "author": "Elaine C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-22", "description": "love this place.  The ladies are chic and friendly with the refills. The omelets are the best and the sandwhiches are on par. Love the music and the champagne refill.  yes i am that brunch person and yes they understand that saturday n sunday brunch should be filled with dance music, deliciousness and bubbles!!!! Lovely", "author": "Toni B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-14", "description": "Love coming here on Tuesdays for unlimited mussels. Their flavors are amazing, portion sizes are just right, service is wonderful, and the atmosphere is calming and relaxing. Whether you're sitting inside in dimmer lighting or outside in their gorgeous outdoor patio, this is a great place to sit down and enjoy a great meal with family or friends.", "author": "Dianne R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-10-08", "description": "We got the fixed price menu, appetizer, entree and dessert for $25!  Highly recommend the escargot, goat cheese and pear pocket and both our entrees, the salmon and the mussels w Simon sauce were so fresh and perfectly prepared. Finally, our desserts: the creme brulee was some of the best I've had and I can't stop thinking about the lava cake.\n\nOn top of that, our service was impeccable. The waitress and the rest of the staff were attentive, but not overly so, and so friendly! \n\nYou should definitely go!", "author": "Kate E."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-09-06", "description": "The ambiance at Bacchus is lovely--the garden is enormous and romantic and perfect for a date.  The food is unremarkable--I had the escargots and sirloin au poivre, they were both totally fine but not unbelievable. The desserts were fantastic. \n\nAll in all, a three-star meal.  I'd return for the ambiance, but probably have the burger.", "author": "Sarah M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-06", "description": "I really loved this restaurant. Everything was super delicious, and the ambiance is incredible. The decor is super cute and it was reasonably priced. Fantastic selection of wines. I am definitely coming back here!", "author": "Mila L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-24", "description": "Had dinner here last night with two friends and it really was a treat.\n\nFirst off, free glass of wine for mentioning Yelp is a phenomenal bonus. The glass of rose was delicious.\n\nI had the escargot and hanger steak. Both were very well done. The hanger steak was perfectly cooked and the portion incredibly generous. Plus, the fries were crispy and salty perfection. \n\nThe kicker was when my server told me that the escargot and steak were actually options on the $25 prix fix, which saved me 2 dollars and suddenly included my choice of dessert. It's always nice to have your server point out a way you can save money. \n\nDessert was only so-so. The chocolate cake was a little overdone. the creme brulee was nothing to get worked up over, but still tasty. \n\nWe will definitely be heading back.", "author": "Michael T."}], "servesCuisine": "French", "priceRange": "$11-30", "name": "Bacchus Bistro \u0026 Wine Bar", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "409-411 Atlantic Ave", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/oriVKWBIxKF0EQiVu8iVqg/ls.jpg", "@type": "Restaurant", "telephone": "+17188521572"}