{"aggregateRating": {"reviewCount": 439, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-10", "description": "I'm from CT and loved my experience at Bacchus Bistrot a Vins. The price was right and getting reservations was super fast and easy. We went for a quick dinner. Parking was a breeze.  We ordered off the Prix Fixe menu and everything was totally worth it. You can't go wrong for $26 a person.  We went with duck rillettes and snails. The mushroom ravioli was to die for. I don't usually eat creamy things but enjoyed the ravioli. The twice cooked pork belly was ok, I don't think I'll be adding that to the rotation. \n\nWe sat indoors because I can't stand mosquitoes.  \n\nOne compliant- the place WAS SOO HOT!!", "author": "Sanh A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-12", "description": "I came here after a very intense interview. It was the first restaurant on my way, and I was so mentally exhausted that I didn't check on Yelp 1st (come on, you do that too).\n\nBut my review is not going to be on the food (which was great, as other reviews already stated comprehensively). I want to compliment the service.\n\nPicture this girl (me), devastated, sitting by herself and talking on the phone, attempting not to cry while she speaks.\n\nSo this waiter was so sweet, that he not only engaged me in a conversation with him and cheered me up, but also brought me a free - and delicious - dessert to comfort me!\n\nHow lovely is that? \n\nWhenever I'm in the neighborhood again, I will try to stop by, mainly for this very kind gesture!\n\nPlaces like this and people like that deserve all the praise they can get!", "author": "Laura O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-19", "description": "Pretty much my favorite restaurant thus far in Brooklyn. The service is excellent and the food is absolutely delicious. My husband and I went here for dinner on a Tuesday night and had the unlimited mussels. They give you a huge portion of mussels for every order you ask and they come in three different sauces. I got them with garlic and white wine and my husband got them in a dijon sauce. They were both delicious. I absoultely recommend this place, and sit in the patio area which is nicely lit up and very cute.", "author": "Julie J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-01", "description": "I was summoned to Bacchus by the SO's crew. An excuse to come dine in Brooklyn is always good. Bacchus is the product of a very charming French expat who made sure we got the personal touch throughout the night.\n\nThe food was quite good. While several members of our party went for mussels, which are reputed to be outstanding here, I dove into a prix fixe (a dinner steal at $26 for 3 courses). This entitled me to a duck terrine appetizer, which was a cross between tartare and pate--very tasty; also, pork belly (I can't say no); and an explosively delicious slice of chocolate lava cake that erupted on the plate.\n\nThe wine is very reasonably prices (several glasses can be had for under $10), and you will want to order it, because the beer pickings are slim. But you're in a French bistro, so what are you doing asking for beer, anyway?", "author": "Yan T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-01-16", "description": "Go here for the atmosphere, not the food. The vibe is fun, so would probably be ideal for a group brunch. I went with my boyfriend and got the salmon burger, he had the crab benedict. We split French onion soup which was delicious. I'd compare it to a mediocre fratty brunch in the east village.", "author": "Ashley S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-18", "description": "Came here after an event at BAM (only a 10-minute walk from the Peter Jay Sharp building). Super intimate atmosphere and definitely a good date spot (candles everywhere!). Wine selection is good, but be prepared to be familiar with French wines (I was not, unfortunately, and stuck to a wine I recognized). The pork chop was fantastic (with a pineapple and mushroom glaze), though could have done with less fat. My boyfriend had the goat cheese gnocchi, which he thought was pretty good. We also shared a side of mac and cheese, which I thought was a bit too creamy. Desserts looked delicious, but we were too stuffed to try any. Would come back for brunch or dinner if I'm ever in the area again.", "author": "Jenny L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-06-05", "description": "My daughter and I had made reservations here for a casual dinner.  While the menu provided some nice choices, we never had the opportunity to try any of them.  We were seated inside, in a moderately long but narrow area, across from a group of 10-12.  Whenever there was conversation and laughter within that group, the sound reverberated within this area, making it impossible for the two of us to hear one another.  We asked to be relocated and, despite the fact the restaurant was basically empty, we were told that was not possible.  Since it was impossible for us to enjoy our dining experience, we left.  Both my daughter and I found their lack of concern and  lack of customer service exceptional. It was made very clear that our patronage was not needed or appreciated.  We will not return.", "author": "Jo B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-01", "description": "Amazing mussels. Need to go back for the all you can eat on Tuesdays. Their chocolate cake, although I am not a sweet lover - was all my boyfriend could talk about for days. Really great wine choices as well. If you order gluttonously it can be an expensive meal but really delicious! The garden is super cute (although I got a ton of bug bites the night I went..)", "author": "Alyssa C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-10-14", "description": "Let me begin by saying that the service here is slow on a Saturday night - I mean really slow. My family and I came in for dinner on a Saturday night on October. We had previously come to the restaurant on Thanksgiving since my parents don't cook and our meal was very good. However, when we came back, the food was good but the service was terrible. I've never been to a restaurant where they brought only a single person's entree out and waited 30 minutes later to bring out everyone else's. Also, don't order the hanger steak here - it was almost impossible to chew.\n\nPros:\nDecent Food\nAmbiance\nWine\n\nCons:\nThe Service\nHanger Steak\nWaiting for Food", "author": "Sean C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-01", "description": "My friends and I came here for brunch right before the Atlantic Avenue Wedding Extravaganza. Love that they have a garden in the back for outdoor seating. It was probably one of the more relaxing restaurants with a garden i have ever been to. Very cute and Frenchy as well. You would probably expect portions from a French restaurant to be really un petit but their portions were actually huge and at a great price. For $8.95, I ordered eggs benedict with bacon which came in two along with potatoes and salad. I normally would be able to finish eggs benedict but this time, my stomach was calling quits when I was moving on to the second set of poached eggs. Not that they were bad.  But with the combination of the heat wave, my appetite simply shrunk.  I would definitely come back again...probably not during a heat wave though.\n\nNote: They have a cafe next door that sells their baked goods. Major plus!", "author": "Rowena Y."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-16", "description": "Sweet little bistro with an excellent wine selection and solid food. We sat out front, as the back patio was packed on a balmy evening, and that was fine. Service was friendly and efficient, the food arrived promptly, and it was all very tasty. \n\nI had the \"all you can eat\" mussels (it being Unlimited Mussels on Tuesdays), along with shrimp a la plancha as an appetizer. My husband had goat's cheese dishes - both appetizer and entree. He likes goat's cheese, you see. \n\nWhile we weren't blown away, the dishes were nicely cooked and the flavors were good all round. The shrimp were large, meaty and tender, and the mussels were very fresh and came in a lovely rich tomato and herb broth, with big tangy chunks of tomato swimming around in it. When mopped up with the fresh bread, it made for a wonderfully satisfying meal - I was too full to go for the refill on the mussels, somewhat to my regret! I'll have to go back again on a Tuesday and skip the appetizer this time...!\n\nPrice-wise, it was all pretty reasonable. Not cheap, but not overpriced for the area. Our wine was delicious, and we left with happy tummies. Nothing not to like!", "author": "Katherine C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-25", "description": "Had a small wedding dinner of 30 people in the newly renovated private room (WITH A BAR!). Staff friendliness, attentiveness and professionalism exceeded expectations. They let us come early to decorate and also helped with the process. It's very difficult to accommodate a party of 30 and our waiter was extremely understanding and patient. Food was great, dessert was ok. But we brought our own dessert so it wasn't a big deal. Will definitely be back for brunch, dinner, and/or future events!", "author": "Windy W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-02-25", "description": "After a failed attempt to go to another restaurant in the neighborhood because we couldn't find parking, we stumbled upon Bacchus. We were very skeptical but were hungry and grouchy so we settled. Upon seated, our waitress quickly came over to tell us the specials for the night. In the midst of that, a couple was on their way out and told our waitress that they thought the music was loud, food was ok and service wasn't great. That should've been a red flag!\n\nBacchus offer an extensive menu and it's reasonably priced. We all decided to order from the Prix fixe which was $25 for 3 courses. We each had a different appetizer - chicken soup (tasted like can soup), escargot (the worst we ever had),  goat cheese with fig relish and duck rilettes on toasted bread (decent). For entrees I had the pan seared salmon which was average at best, my friend had mussels which was pretty good and the 2 guys had pork belly which they were utterly disappointed. The restaurant was pretty empty on a Sunday night, it was the 4 of us and a large party of 10-12 for a birthday celebration. \n\nIf I have to break down the ratings I'd say 4 stars for the ambiance and service, 3 stars for value and taste of the food.", "author": "Pamela L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-10-06", "description": "Went for Sunday Brunch as part of a large group.\nPros: ambiance - nice romantic dimly lit place for dates. Beautiful backyard - simple but classy.\n\nCons: service not too great that day. Had 1 waitress serving all the tables in the backyard, making service not too great. By the time she made appearances, to order drinks you could have walked to the bar 4 times yourself. Food was okay - ordered salmon burger \u0026 it was a little too loose \u0026 the bread was a bit too dry. \n\nI've heard good things from other people, but they didnt go for Brunch. I'll give it another shot with a small party of 2-4 max.", "author": "Simone W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-20", "description": "Life doesn't get any better than \"all you can eat\" moules y pommes frites.  Oh, unless it's also accompanied by a delightful bottle of Sancerre to accompany the yummy meal.  We ate so many moules that we couldn't even think about dessert, although apparently Bacchus is known for them.", "author": "Newcomer T."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-04-29", "description": "Crab Benedict tasted spoiled, and the eggs were not runny. We also sat there for 20-30 minutes before we even got water. The restaurant was half empty. Maybe they need more staff.\n\nWe went over to Palo Santol Yummers! Awesome brunch with $1 drinks (I think it might be after you order the prix fixe or after you order 1 at regular price. I forget).", "author": "Katherine R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-19", "description": "Such a nice place. Great food great atmosphere at a great price. I wasn't sure I had the energy to go out anywhere but was so happy that I did come here.  Highly recommend it.", "author": "Heather Z."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-15", "description": "So brunch in Brooklyn turned out to be a fantastic way to spend a Saturday. The French onion soup, BLT sandwich and quiches were fantastic as was the service.", "author": "Michael B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-07", "description": "What an absolute gem of a place! \n\nCame here before seeing a show at BAM and was very impressed!\n\nFirst off, the prices are great for what you get.\n\nI had the Mussels and Frites with the Moustarde sauce, although there are several sauces to choose from.\n\nMy mom loved her mushroom ravioli (which I tasted and it was divine) and my dad got the Roast chicken, which he says was cooked perfectly.\n\nGood wine selection and just all in all, a most pleasant dining experience.\n\nWould absolutely return here in the future!", "author": "Shannon B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-26", "description": "This place was absolutely outstanding! It's located in the cluster of French places near Carroll Gardens Brooklyn. Everything we had was amazing! The escargot, the duck, the pork belly, and the onion soup were incredible! And the prices weren't too bad, especially for french food. Authentic food and romantic atmosphere.  I highly recommend this place!", "author": "Peter K."}], "servesCuisine": "French", "priceRange": "$11-30", "name": "Bacchus Bistro \u0026 Wine Bar", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "409-411 Atlantic Ave", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/oriVKWBIxKF0EQiVu8iVqg/ls.jpg", "@type": "Restaurant", "telephone": "+17188521572"}