{"aggregateRating": {"reviewCount": 439, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-07-18", "description": "Love the atmosphere.  \nArtichoke salad was great. \nStaff was great.  \nMy roasted chicken was awful, not fresh whatsoever...was so very dry and dark meat was beginning to turn an unpleasant color. I should have sent it back but didn't.  \nThe mesclun salad that came with the chicken was sad - limp, old and cooked from the hot food put on it.  \nFries were okay, but were room temp. not hot.\n\nOverheard the couple next to us telling their waitress the fish cooked in Parchment had way too much wine.", "author": "Bonnie S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-02-19", "description": "I hear dinner is solid but skip the overpriced and overcooked brunch.", "author": "F D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-28", "description": "Amazing wine. Escargot was wonderful. Warm brie was good.\n\nSteak with the mushroom and gravy sauce is amaaaazing. peppercorn cause is good as well.\n\nGet the chocolate hazelnut cake with ice cream for dessert, you won't regret it.", "author": "Chris C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-10-04", "description": "The thing about music in restaurants is that it shouldn't be so loud you have to almost shout so you can be heard. If you want that, a nightclub is where you should go.\nEven our waiter had a hard time hearing what our orders were.\nThe food is French, good value for what you pay. But not great French.\nProbably better as a lunch restaurant than dinner.", "author": "Terry K."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-05-22", "description": "After coming here for years and always enjoying dependable bistro fare, our latest visit was a big disappointment. Every single dish we ordered was bland and one appetizer was practically inedible. What happened, Bacchus? Instead of feeling happy and full, we left in a sour mood and still hungry. I'm really not sure if I will go back....very sad.", "author": "Mo Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-10", "description": "I love this little french place! The mussels are good (all 4 varieties), in fact, the hardest part is deciding which flavor to get, which is why it's best to go on Moules-a-Gogo night so you can try all of them! It's all you can eat mussels, in smaller portions so you can switch between flavors each round. I love the au Ricard even though I was nervous about the anis. But it was fabulous.", "author": "Amanda F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-17", "description": "Holy fuggin' shizz.\n\nA reasonably priced, delicious, intimate date spot on Atlantic Ave??  \n\nProps to my fellow yelpers for alerting me to the amazingness of Bacchus.  Seriously, I couldn't have asked for a better spot for my boyfriend and I to have a nice dinner in an attempt to relax during law school finals.  \n\nWe sat in the back corner and got a nice view of the invitingly lit patio, and ordered two glasses of wine while we perused the menu. \n\nHe got the prix fixe menu--a wonderful value at $28!--and I got the hangar steak. He chose the duck rillettes to start, and these were great.  While the room temperature duck was a little much on its own, with the accompanying apples and balsamic reduction, it was the perfect bite. For his entree, the bf got the mushroom ravioli. Although a bit small, he agreed that the flavor was really good and the mushrooms were nice and meaty.  We split the coffee dessert, which had a cool French name that I can't remember, but it is a MUST. Coffee flavored cake with an inner dome of mousse and a delicious dollop of  ice cream on the side. Every bite was amazing and it made me so happy. That's normal, right?  \n\nI think one person getting the prix fixe and one person getting just an entree is the way to try a bunch of things and not be overly stuffed, but if you're both starving, by all means, go for the prix fixe.", "author": "Maeve C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-04", "description": "Amazing food, wonderful and friendly staff, great ambiance... can't say enough about Bacchus! I threw my husband a surprise 40th birthday in the gorgeous garden, and everything went flawlessly and our guests couldn't stop complementing the food, and what a wonderful time they were having. Meryl is a great organizer, very responsive and accommodating.... if you're looking for great ambiance and great food, Bacchus is the place...", "author": "Arminé G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-11-10", "description": "Visited Bacchus Bistrot a Vins last night with 6 friends for a birthday celebration. \n\nFirst impressions: The place is small and our table was part of the bar area and not the main seating area. One of the walls had exposed  brick, but part of that wall looked to be concrete in disrepair so, that diminished from the ambiance of the space, which was otherwise warm but very, very dimly lit (Which made it hard to read the menu.) Seemed they could have utilized the outdoor patio by having heaters out there.  It was green and had strings of lights which could be seen through the floor-to-ceiling window, which was nice.\n\nWe arrived on time for our 7:15 reservation. I saw there was another large table in the main seating area and I requested that.  The hostess seemed very annoyed that I requested that table, which she said was already reserved. Never the less, we were promptly seated at our table in the bar area, which was not bad, except for the condition of part of the wall as described above. Later, toward the end of the meal, the place was packed by this time since people were also waiting for tables, it got very hot inside.  There were a couple ceiling fans going in the main seating area and I noticed one in the bar area near our table that was not running so I asked for it to be turned on.  They did and it helped, but again, they seemed annoyed that I asked.  \n\nThe Food and Service: There were two French female servers for the whole space and a couple of bus boys. There were probably 30 people in the dinning area, including us, and the bar area of had about 20 more people in it and I think they were waiting on a couple tables there, too. The servers seemed very stressed out and less than friendly. They actually seemed annoyed with us the whole time, especially when we asked a couple questions about the menu items. Both the servers served us at various times.  \n\nWe ordered a bottle of wine, a glass of wine, a cheese tray and two of the Bacchus salads which were promptly delivered, as were our most of our entrees. The Bacchus salads were good but not as big as I expected for the $9.50 price.  I had read in another review that the portions were big.  The items we ordered did not seem to be that big. \n\nWe all ordered the Mushroom Ravioli or the Gnocchi. We asked what the portion size difference was between the small and the large Ravioli.  The server showed us that each ravioli was about the size of a flat tennis ball, and said that there were 3 in the small order and \"twice as much\" in the large, which we took to mean as 6.  The large orders actually had 5 and not 6 ravioli on the plate, but they were pretty big and thick. The taste, though good, did not have as much \"mushroomie\" taste as I expected. The asparagus on top was perfectly cooked and the sauce was good.  I would say overall the dish was good, but not great. \n\nThey did not get all our orders or the bill right. Two of the people in our party ordered a large Ravioli to split, again thinking there would be 6 on the plate.  Anyway, they brought the Gnocchi for them by mistake so they had to wait about 10-12 more minutes for their food.  There was not an apology for the mix-up.  Instead the server just seemed annoyed. Everything else came very promptly.\n\nThe other problem was one of the people in our party ordered a small Gnocchi and one ordered a large. They both looked to be the same size, both looked small.  I think they brought two smalls, but they charged us for two larges. When we pointed this out on the bill the server got mad and said we got two large Gnocchi.  If those were large I can not imagine what a small would be!  Anyway, I asked that she not charge us for the large since one of the guests distinctly ordered a small and the portions were both very small. She angrily changed one of the items on the bill to a small, complaining to her co-worker in our hearing. There was never any mention of the delay in the other meal, and nothing offered to make it up to us. I was told by the people in our party that the Gnocchi was very good. We did notice some of the other entrees on other tables seemed to be of a decent size. \n\nSeveral of us ordered the Creme Brulee. It was OK. It had a nice sugar crust on the top, but there was only a thin layer of the Creme Brulee in the shallow ramekin and seemed to be nearly an equal layer of custard and caramelized sugar top, so it made the dessert too sweet. The other dessert that was ordered was the Fondant au Chocolate. It was nicely presented and the person who ordered it said it was good, but it was kind of small. The coffee I ordered with dessert came in a nice big coffee bowl and had good favor, but was barely warm when I added the milk. (We were served milk and not half and half).  But I did not ask for it to be heated, mainly  because of the attitude our server had previously displayed, so I drank it luke warm.\n\nSo there you have it. Overall, not the best dinning experience, but we had fun anyway.", "author": "Jacqui O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-30", "description": "I love Bacchus! I had my birthday party here and couldn't have been more delighted.\n\nI started the search for a venue late and was panicked that all the bars in the neighborhood with back rooms were booked. Clover Club, Union Hall, etc etc. So I decided to just do a group dinner instead, and remembered loving the food at Bacchus. \n\nJust my luck- I made a res and then the day before the party stopped by to confirm. They totally renovated the place since I'd last been and added a cute little cafe next door that's connected! Meryl and Nancy were SO kind and helpful. They gave me the whole cafe for my party- dinner and more people stopped by for drinks afterward. I had about 20 people but I think they said it can hold 45. I think we stayed till 1ish but can't remember!\n\nThe best part was that they let me play my playlist for the whole restaurant! THAT was fun.  \n\nThe food was delicious, we had our own waiter who kept the booze flowing, and everything was just chill and perfect. What a wonderful place for a party! I would give them 10 stars if I could :)", "author": "J B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-25", "description": "Perfect combo of French and Brooklyn feel. Lovely back garden. I had the grilled salmon, which was surprisingly good. Good, extremely friendly service and food came out very quickly (though I was an early bird).", "author": "Josh L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-05-24", "description": "Amazing space and an exciting menu. Ate here twice while staying at a nearby hotel. Wasn't pleased with either meal. Over cooked pork belly. Burger was mediocre at best. Mussels had lots of grit. Service was a one star.", "author": "Nick B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-01", "description": "Alvaro is the man! Had a great time getting work done and enjoying the Sunday evening.", "author": "Marvin M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-09-06", "description": "Bacchus is a cute little restaurant with a backyard garden, which has one single huge tree that makes the entire yard that much more charming. On a nice evening, my cousin and I were the only people who elected to sit inside since we're introverts. The hostess with a thick french accent came to tell us the specials of the evening. \n\nThe menu was meaty. We made the mistake of ordering too much meat (yes there is such a thing as too much meat).\n\nAppetizers/Tapas\n\ncrispy porkbelly (6) - 4 pieces of extremely tender and delishy pork covered by a subtle layer of burnt surface that gives it a nice crisp. Recommended.\n\nmarinated king prawns (8) - 3 pieces of king prawns. It tasted a little dry and being the American tool I am, I was hoping for dip to moisturize these suckers with. Otherwise okay.\n\nBefore I write about the main course, can you promise not to judge me for choosing so much meat? Oh you won't? That's okay.\n\ntwice cooked pork belly (18) - This was unfortunately a star bringer downer. The pork belly was simply too fat and the dish lacked sides to help digest the fat. A good 90% of the pork was just pure fat. Attempt to clean off my plate actually made me sick afterwards. \n\nbeef cheeks braised in red wine (19) - Too saucy. The beef itself is nice and tender but everything on the plate was drowned in sauce that all the ingredients started to just taste like the sauce. I would have preferred to have my vegetables untampered to down this dish easier.\n\nThe service, atmosphere, and value could have easily carried this restaurant to a four stars. Unfortunately, both entrees were just not up to my personal taste. \n\nDon't worry Brooklyn, I'll be in this neighborhood quite often now so I'll give you guys another shot.", "author": "Qian W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-03-31", "description": "I had been looking forward to dining at Bacchus ever since I passed it when I moved to the neighborhood. Delicious scents waft onto the street from inside, promising a meal just as savory. Slightly disappointing. I dropped in for a late brunch and was seated right away. There seemed to be a lack of communication between the two working servers. They both asked me how many were in my party while I waiting to be seated, and they even both brought me a basket of bread and butter after I sat down! I was happy to have the extra bread but it struck me as odd. \n\nI ordered a vegetable sandwich with pesto on a ciabatta roll and it came with fries and a limp side salad. The sandwich was certainly okay, heavy on the pesto and made with a great deal of garlic. At no point did either of the servers ask me how my food was, and were generally not friendly. Even getting my check was a bit challenging I tried signaling but got flat out ignored a couple of times. And I was in the very small back part of the restaurant (not the patio) so there was no real obvious excuse for their inattentiveness. I wouldn't be in a rush to return.", "author": "Sarah F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-24", "description": "We had a great dinner here. \n\nWe both opted for the $28 prix fixe. I got escargots and l'onglet; tarte tatin for dessert; my partner got the beggar's purse and mussels; profiteroles for dessert.\n\nOther than my apple tart being unremarkable, it was a delicious meal.\n\nThe wine was nicely priced and very good as well.\n\nWe sat in the less crowded, much quieter half of the restaurant, not the bistrot, which was darker and buzzier. We were happy with our choice.\n\nWe're putting this place on the list for a repeat visit.", "author": "Trina H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-02", "description": "Lovely place! Definitely recommend it. The food is delicious, the wine is great and the garden is charming.", "author": "Al N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-26", "description": "Simple casual decor, really good food. I very much enjoyed the French Onion Soup. Looking for a lighter meal, I had their mushroom ravioli with asparagus and it was very tasty. House wine was good, too.\n\nIt is quiet enough to talk without any problem, and would be a comfortable place to dine with friends. I am sure the patio out back is really nice is good weather.", "author": "Willard K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-22", "description": "What a fantastic place. I came here for a wedding and had a lovely time. The bride and groom held their wedding ceremony and party at Bacchus. They had another venue set up but the place went bankrupt THREE DAYS BEFORE THE WEDDING. Luckily, Bacchus Bistrot a Vins was available for the designated wedding day. The decorations were nice and simple, candles and lights hanging around. \n\nThey catered and every single dish was fantastic and delicious. Everything from the starter meal to the dessert. It's a little Paris in Brooklyn. Come and enjoy.\nI'm definitely coming to dine one day.", "author": "Birdy L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-05-20", "description": "This restaurant was a disaster. The food was disgusting, they even managed to ruin a simple salad. The service was horrendous, I had to chase after the waitress twice for service. Do not waste your money at this. Good for drinking only!", "author": "annie n."}], "servesCuisine": "French", "priceRange": "$11-30", "name": "Bacchus Bistro \u0026 Wine Bar", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "409-411 Atlantic Ave", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/oriVKWBIxKF0EQiVu8iVqg/ls.jpg", "@type": "Restaurant", "telephone": "+17188521572"}