{"aggregateRating": {"reviewCount": 439, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-12-26", "description": "I had the Christmas Day prix fixe (menu available on their website; everything seems to be off the normal menu, just fewer options). This was one of the best meals I have had in a long time. I occasionally find French food a little boring or off-putting (here's a piece of meat with some sauce on it and something next to it!), but when it's done well, it's sublime. I started with the warm salad of (deep fried!) artichoke and frisee. Frankly, if they upsized that a smidge, it would be a delightful main course, certainly for lunch. It was so tasty and perfectly dressed that I honestly couldn't imagine something besting it (isn't it so often the case that the appetizer is the part of the meal you remember most fondly?)... until my sea bass arrived. So delicious, so flavorful, so perfectly seasoned. Salty without being SALTY, everything perfectly balanced. Asparagus perfectly cooked. I savored every morsel on my plate (a very generous portion), which I almost never do. They had run out of the raspberry crème brûlée (it must have been that good), but the little molten chocolate cake was more inspired than I tend to expect from that tired warhorse of a dessert. Their offering NY-style cheesecake seemed an odd and lazy gesture at being a NY restaurant; I would much rather have had a European-style dry cheesecake if they were going to offer it. Lovely, informal atmosphere (a real bistro, not a chi-chi place calling itself a bistro), and fun, friendly service. I couldn't afford to eat there all the time, but I certainly didn't feel ripped off, and I will absolutely return in the future.", "author": "Christopher C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-17", "description": "The food and wine are simply delicious.  Everyone we've encountered on the staff has been friendly and personable; they remember us and greet us with kisses on the cheek, despite the fact that we've only been there three times in total (and one of those was just for a drink).  The service is attentive, but laid back at the same time.  They've gotten the ambiance and music just right.  You get the feeling that the people who work there enjoy being there, and enjoy being around one another.  The kitchen takes a bit longer than I'd like to get the main course out, but it's truly been worth the wait.  Highly recommend it, but definitely order an appetizer to hold you over!", "author": "Eileen M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-12-11", "description": "A nice, intimate French bistro that I would undoubtedly visit again.  The space and lighting are very nice (I prefer darker lighting).  The service is relaxed, to say the least (OK...slow, but it would not have been an issue were we not cutting it so close for a performance at BAM), as the staff seems overworked, but is also friendly and inviting.  The food is good, although the preparation lacks a little polish (a duck breast didn't have the fat sufficiently rendered and the delicious sauce that the mussels came in was a touch salty).  The wine list is excellent.", "author": "Warren L. H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-06-30", "description": "Very good bistro food at an affordable price. Food and service were both quite good. Bacchus is a much better option then other French Bistros in the area.", "author": "Jeffrey S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-03-21", "description": "This place is great! Small space is perfect for a small intimate dinner or glass of wine. Feels like a local hang out - every one who came through the door new the serving staff. I only stopped in for a few drinks at the bar, but everything coming out of the kitchen looked wonderful. Will be back.", "author": "Lindsey S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-18", "description": "Love this place. Delicious food. Affordable wine list. Really reasonable prices. Will be my new neighborhood go-to.", "author": "Julie E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-19", "description": "Suggest --especially if you like mussels --to go there on Tuesday eve--all you could eat mussels for $14.95---Very well attended.", "author": "Ed P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-25", "description": "I love this place. Charming ambiance, very attentive wait staff and delicious food. The goat cheese and pear pastry was great, my steak was cooked perfectly and was huge, especially for a pre fix menu, and the peach melba was a perfect way to end the meal. The kitchen is a little slow on busy nights, but the friendly waiters and overall ambiance make up for the wait.", "author": "Annie F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-08-09", "description": "Great food, but the service is \"European\" and the ambience on the patio is hit-or-miss. \n\nwe went for dinner on a sat night and sat in the garden patio area.\n\n(1) service - true to its french roots, the staff are very friendly and helpful when they get to you, but will completely leave you alone if you don't flag anyone down. more than 30 minutes passed after our food was served before anyone came by to check on us. at another table, the staff seemed to know the guest well, brought them candles and stopped by their table about every 5 minutes. meanwhile, our wine glasses were empty and our romantic eve would have been lovely with a candle on our table as well. culturally different, we had to get up and walk to the bar to ask our server to stop by our table. \n\n(2) ambience - the patio has a ping-pong table. yes, a ping-pong table. not exactly a lovely complement to a romantic evening when people are playing ping-pong while you try to enjoy a glass of wine and conversation. once the ping-pong players left, my headache went away and was able to enjoy the meal.\n\notherwise, the food was spectacular and the prices reasonable.", "author": "josh s."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-02-25", "description": "Food is speaking for itself. The wine list is great with a good bottle at every price. Went there a couple of time and have always feel welcome by the staff and had a great service. I just had the most relaxing time with a few of my friends.", "author": "Benoit R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-05-09", "description": "SO disappointing: food was terrible (fish rubbery, beef bourguignon watery and flavor-less) and service even worse. We had been here twice before, and liked it, so double disappointing.", "author": "Laurie I."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-05-23", "description": "atmosphere is the best thing this place has going (including asking permission to smoke outstide after hours).  The salmon entree was okay, the chicken my friend had looked better and the sparkling french white wine saved the meal.  would come back again, especially on a hot night in the summer.... to enjoy the outdoor seating and refreshing alcoholic beverages.", "author": "Rhonda W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-01-24", "description": "I have to agree with Andrew G. on this. I also frequent Bacchus as I live in the neighborhood and I've never had a bad meal. The service can be slow when they are packed, but what do you expect? everyone is always super sweet and the food is great. Brunch, lunch or dinner, I always feel satisfied with my meal.", "author": "Neenz R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-02-21", "description": "Been there a few times.  The food is ok, but the nothing special, nothing really distinctive.  I would have thought the wine selection was great but sub par in my books.  The atmosphere is nice, during the summer when the garden is open, a nice glass of red and a few appetizers help make the chaos of Atlantic avenue go away.  Prices are ok.", "author": "Sang H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-02-19", "description": "Found Bacchus on Yelp (\u0026 it's also in NYC's Zagat 2010 book)... made a reservation on-line (through Open Table). Mentioned finding them on Yelp and got free wine- what's not to love about FREE WINE!!! Two of us got the  $25 prix-fixe. One prix-fixe included ceviche, salmon \u0026 creme brulee. The other prix-fixe was a pastry with goat cheese and pear (LOVED IT!!!), roasted pork loin \u0026 chocolate mousse. Third meal was with the skate fish (LOVED IT), and the final meal was a lamb shank. I tried all the food and liked it all, but my personal favorites were the the pastry (Croustillant de Chêvreet de Poire), the skate fish (Raie à la Grenobloise) and the FREE WINE!!! Delicious and affordable. We all enjoyed our evening at Bacchus.", "author": "Katrina C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-12-18", "description": "I recently attended a private event at Bacchus and it was the perfect place to spend a cold, rainy December evening with friends. The food was very nice, the wine well chosen and in ample supply, and the owner could not have been more accommodating. Our group was a little large for the space and we tended to play musical chairs, but the servers did their best to tend to everyone. Overall it was a great evening, and I would recommend the restaurant to anyone seeking a lovely meal in a charming and cozy space.", "author": "Karen H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-11", "description": "I went to Bacchus last week Tuesday, It was a refreshing experience from the average Bklyn retro decorated French bistros. I found the menu simple but with something for my entire party. The Duck rolls were delicious, as was the rack of Lamb. The wine list had great values, not just wines listed by grapes,like all the other dingy old French bistros,  which leads me to think in my experience, you are just getting what ever may taste like the grape you think it is \u0026 what the restaurant wants to pass along to you. Will definitely go back to try the brunch, when the have a great band playing cool tunes.", "author": "gd h."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2007-07-24", "description": "So disappointed in this place. Here it is, right around the corner from where I live and it has a nice garden. It has steadily declined over the last couple of years. Service is horrendous, even when it's not busy. Cheese plate was dried out one time. Next time the front of the place smelled like dirty refrigerator when I walked in. The next time I never got my entree. It had been delivered to a near by table. Because it was my entree, the other entree for the other person at that table was not ready.   They gave him a free glass of wine. 45 mins. after I ordered, someone came to ask if I wanted anything else. I said, yes, my entree. I was told the computer didn't take the order and therefore I would have to wait 20 mins for the chicken. No offer of free wine for me. I asked for the check. I had ordered the $20, 2 courses and a glass of wine special. Got the appetizer and the wine. The waiter proceeds to charge me $12 for the wine and $8.50 for the appetizer. I told him I did not want to be charged for the wine, since the table that got my chicken, got free wine. He then charged me $8.50 for the appetizer and told me that I cost him $12 for that glass of wine, which would come out of his own pocket, as he was not the owner. I left feeling that they really couldn't have cared less about me as a customerand that I was somehow in the wrong. I will never go back. I bumped into a neighbor on the way home and mentioned what had happened. He said he used to go there a couple of times per week and now the service is so bad, he has stopped going. Plus now you can listen to someone playing pingpong on the extended patio...how lovely to listen to the ball going back and forth through a meal.  What a drag.", "author": "Jane R."}], "servesCuisine": "French", "priceRange": "$11-30", "name": "Bacchus Bistro \u0026 Wine Bar", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "409-411 Atlantic Ave", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/oriVKWBIxKF0EQiVu8iVqg/ls.jpg", "@type": "Restaurant", "telephone": "+17188521572"}