{"aggregateRating": {"reviewCount": 439, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2019-05-14", "description": "The ambience and service here are unbelievable. One of the best date-night spots in Brooklyn for couples (or to impress on a third date).  Very French staff serving very French food in a warm, dimly-lit space with a pretty little backyard.\n\nFood is good, and some dishes are very good, but I save my five-star reviews for the best.  It's more classic French dishes done well than a place to be served anything unexpected.  You won't go wrong with french onion soup, steak frites, and a glass of hearty red.", "author": "Michael S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-09", "description": "5 Stars for a dimly-lit, romantic French restaurant that serves up quality dishes and makes you want to throw a beautiful party out back.\n\nDamn. This place is romantic! I had the chance to stop by recently (thanks to the stellar reviews) and we were sat very quickly near the back glass doors. It was chilly out, but warm and romantically-lit inside. \n\nThe atmosphere inside is top notch, but while we were there we caught glimpses of the outside back area and could just imagine how magical it would be in the right weather. \n\nBeyond atmosphere, the food and drinks were on-point. I ordered a red wine and described my preferences to the knowledgeable server who made a selection for me that didn't disappoint. \n\nThe bread they bring is warm and addictive, but save it for the mussels!\n\nWe ordered the following:\nRoot Vegetables Salad- roasts beets, turnips, pistachios, goat cheese, frisée salad, mustard dressing, and balsamic glaze. This was a fresh, light entry into our main dishes.\n\nMussel and French Fries- holy white wine broth, Batman! I was thankful I'd held on to some of that bread to soak up that sauce. This was a lot less expensive than it could have been. And at $19, it's worth it even as a starter.\n\nHomemade Purple Potato Gnocchi- light as a feather! Gosh, I hate dense gnocchi, but this was made with love. \n\nOverall, a solid date night spot to which I would absolutely return!", "author": "Andi P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-01-19", "description": "Been here twice, once for a small intimate wedding and the second time for my mother's birthday. The courses at the wedding were delicious so we decided to give the restaurant another try for a special occasion. Overall, we enjoyed the food although there were some misses. Service was friendly and attentive. \n\nWe tried the Foie Gras Torchon, Snails, and Salmon \u0026 Avocado Tartar for appetizers. We also ordered the Mussels in Mariniere (white wine, shallots and garlic broth) \u0026 French Fries to share. Appetizers were excellent and we enjoyed them more than our entrees.\n\nFor entrees, I ordered the Short Ribs Pot-au-Feu, but didn't really enjoy the meat; it was too chewy and fatty for me. I ended up eating the vegetables and sharing the meat with everyone else. My husband had the White Wine Veal Osso-Bucco, which he hated; the meat was dry and tasteless. My brother had the Red Wine Braised Lamb Shank, which he said was decent. His girlfriend had the Roasted 1/2 Chicken. My mother enjoyed the Black Angus Hanger Steak. My father had the 14oz Black Angus Rib Eye Steak, which we agreed was the best entree of our table; it was perfectly cooked and tender. \n\nFor dessert, we ordered the molten lava cake, the chocolate mousse cake, and the creme brulee to share. They added a birthday candle to the cake for my mother and kindly gave us a slice of pumpkin pie on the house. While some of the entrees were disappointing, the appetizers and dessert were great. Atmosphere was cozy and inviting on our rainy evening.", "author": "Helen H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-06-01", "description": "I had come here for brunch with my fiance and his parents and they had the great (and generous) idea to host our engagement party here. We had the party in one of the private rooms and it was such a great night. We were able to pick from an extensive list to build our menu and give our guests plenty of delicious choices of appetizers, entrees and desserts. They had a good selection of wines on the bar that they kept flowing. It was such a cozy little space and I had such a good time celebrating with friends and family. Everyone, myself included, thought the food was amazing. What a great night I would recommend this place for hosting a party or just going to the restaurant for a meal!", "author": "Kayla J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-27", "description": "Amazing place to have lunch amazing place to have dinner overall a really quality place great food great wine food is amazing great for private events highly recommend we making this a regular spot for myself and my friends we want to go to dining have a very classy experience have a great outdoor area as well and great service", "author": "D Y."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-31", "description": "I came in here late on a Sunday night. It was actually pretty dead but got busier as the night went by. Seems like a great late night spot. \nThe standout from my experience was the great service. I would say at least 5 different people who worked in the restaurant came by to check in on us while we were dining. \nThey actually ended up making a mistake with our order (we waited over an hour for our food to arrive) and the staff was gracious and apologetic when we pointed it out. \nI would definitely recommend the grilled calamari salad. I got the bouillabaisse which while definitely filled with seafood wasn't that impressive for a French restaurant.", "author": "Lalita D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-28", "description": "We arrived at Bacchus on a very bustling busy Saturday night. We had made a reservation and were greeted and seated immediately after arriving. \n\nOur server was both friendly and on top of everything all night. Inside Bacchus you'll find a truly intimate, French, romantic vibe. \n\nTo start, we ordered the snails (Garlic and anise star butter). These were both beautifully presented and as delicious as they were to look at. \n\nFor entrees we ordered the Mussels and fries Mariniere and the Atlantic Salmon. As we awaited our dinner, the waiter acknowledged after awhile that our dishes were delayed and refilled our white wine on the house due to the delay. We thought that was an awesome, caring gesture. \nOnce our dished were delivered they wee worth the wait. The mussels dish was overflowing and each mussel was bursting with juice and flavor.  The fries were equally as delicious. The salmon dish was also very good, but just a touch on the dry side. \n\nAs I ventured to the bathroom before leaving I noticed that the venue had a really great looking event room with a large event happening in the back which probably explained the slight delays. Overall we would absolutely come back for this mouth watering French food.", "author": "Renée G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-24", "description": "Upon entering , I was welcomed by one of the nicest staff I've across in a while. Both Sophia and Fausto were really amazing - suggested a few dishes and were very informative with the menu.Fausto poured a very tasteful glass of wine and I thoroughly enjoyed everything. Started wth French onion soup and finished with the chicken breast with mashed potatoes and asparagus.\n\nWill definitely be returning and would love to bring the rest of the nypd crew with me sometime soon for dinner . Thank you", "author": "Wesleyan T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-27", "description": "Bacchus checks off all boxes -- ambiance, food and service.\n\nAmbiance: The private backyard event space at Bacchus is so dreamy and is the perfect location for a summer dinner party! Think lots of hanging string lights, greenery and lose drapes hanging from the ceiling. The ceiling is also shuttered which makes this a very versatile space. There were around 50-60 people in the group and the private event space held everyone very comfortably.\n\nFood: Everything that I ate was damn delicious. To start, I had butternut squash ravioli. This was sweet, savory and just downright amazing. For my main I went with the half roasted chicken served with mashed potatoes and veggies. I asked for the truffle mushroom sauce on the side and am glad I did. Delicious but a little too rich for my blood. The chicken was perfectly crispy on the outside and juicy on the inside. Others at the table had salmon and beef and really enjoyed. Dessert was the only course that was not my favorite. I had the creme brûlée and it was a little bit overheated and watery. But... to make up for that I ate my friend's chocolate molten cake and this was insanely good. \n\nService: Handled the large dinner party like pros. We were joking about how no one had less than a half a glass of wine the entire night. Any time a glass looked empty the servers came around and filled the wine up to the top. \n\nParts of the restaurant are cozy and intimate while the backyard is great for a large party, which makes Bacchus the perfect pick for a date night or an event.", "author": "Sara B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-15", "description": "Was able to book a two-person reservation here last minute on a Tuesday evening. Intimate atmosphere with dim lighting and cozy seating.\n\nMenu is on the expensive end since it's more of a romantic dinner spot. Despite that, many of the entrees were enticing enough to order. Settled on the Atlantic Salmon ($22) and a glass of Bordeaux ($9). While waiting, got served free bread and butter to start. Bread was decent, a little tough on the outside - fine with the butter (and wine). Main course was smaller than expected; a large plate with a petite filet covering the lentils/veggies underneath. Fish is cooked well, and the horseradish sauce really brings out the flavor of the meal. Ate it all pretty fast, though wasn't stuffed afterwards.\n\nService here is good considering a couple large groups who took most of the attention. Like the ambiance here for dinner, though prices are considerably cheaper for lunch and brunch.", "author": "Shaji K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-24", "description": "I booked Bacchus for a Bridal Shower in the summer and it was beautiful. I wanted to go for a \"Mid Summer's Dream\" theme and the staff on hand were so helpful. They brought out ladders and helped me hang every decor I had. They have a beautiful spacious outdoor area for events with an overhead in case it rains. We had about 25 guests and even then we still had enough space to spare.\n\nMeryl was my point of contact in arranging menu and scheduling. She was so helpful and vocal throughout the entire process. She was accommodating if I had any concerns and changes. \n\nThe food portions were huge. Seriously. I was afraid since it was for a large group of people the food would be on the smaller scale. That was not the case, each dish that came out were about regular standard individual plate. Most of us had to ask for take out boxes, because we couldn't finish everything.\nThe food was delicious. We had a variety of steak, crab cakes and chicken. Everything was delicious and moist! They didn't skimp out on quality.\n\nI would highly recommend Bacchus. When I was shopping around venues for our Bridal party, Bacchus was the only place that had competitive pricing. Everywhere else was asking for an absurd price. I'm glad I chose Bacchus, because it checked off everything: Food, Atmosphere, Pricing and Customer Service.", "author": "Gina W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-12-28", "description": "I have been there twice and my second time has been the WORST EXPERIENCE OF MY LIFE! DO NOT GO HERE. I came to the restaurant on December 24th around 8pm with one of my friends for a nice celebration dinner for her engagement. We were expecting a third person to come in, but there was a change of plans and the dinner ended up being with only 2 of us. I told the woman that afterwards and she said if a bigger party came, she would be needing us to move to another table. We were fine with that. The blonde waitress COMPLETELY ignored us. We understand that it was Christmas Eve, but a 4 person table that came in half an hour after us was given BETTER customer service than we were. We were seated right next to them and they were given wine suggestions by the sommelier. It took us 15-20 minutes for us to get the attention of the waitress. \n\nGetting the check was a hassle as well! No one offered us anything to drink, deserts or anything. She simply wanted us to pay the check. No one checked to see if our food was good or cooked well. We had to ask for our plates to get taken away. THIS IS NOT HOW YOU HANDLE A TRANSACTION OF CUSTOMER SERVICE WITH PAYING CUSTOMERS. \n\nI emailed them to complain and the woman blatantly lied and said that we never told her that the 3rd person was not coming when WE DID. SHE ALSO SAID THAT SHE WAS SURPRISED AT OUR TIPS BECAUSE SHE GOT MORE FROM OTHER PEOPLE. OF COURSE SHE WOULD CUS SHE ATTENDED TO THEM!! We were offered no drink, not customer service or human contact.\n\nIf you enjoy an experience like that then by all means go here, but if you DON'T, FIND ANOTHER FRENCH RESTAURANT BECAUSE THAT WOMAN IS HORRIBLE!\n\nIt is a shame that the food was remarkable but delivered by such a rude waitress.", "author": "Melendy F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-23", "description": "Yelp says 'not good for kids' but I heartily disagree. We had a 5pm dinner and were immediately brought a high chair, given water with a lid and straw, and saw that our toddler's butter knife and breakable bread plate were removed- all pro moves by people who know kids. This probably isn't a great spot for a team of rowdy youngsters at 8pm but it's fine for an early meal with a cool kid. \n\nAlso, it's delicious, the ambience is great, and the waitstaff are terrific. We had a lovely dinner.", "author": "Megan H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-31", "description": "Came for brunch, and we ordered the burger, crepe, croque madame, and chicken sandwich.  It's a seasonal menu that changes by the chef, so the crab cake Benedict and bacchus BLT weren't on the menu unfortunately.  We also ordered the French toast to share for the table.  Everything was very good, solid brunch spot in the neighboring.", "author": "Sarah K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-22", "description": "I have been to Bacchus a few times now, and always find it a delight to sit in their outdoor garden and enjoy a glass of wine on a nice day. \nWe came as a party of two earlyish on a Thursday night, around 5:30, and were seated immediately. \nThe outdoor garden wasn't busy yet at this time, and it was pleasant to sit outdoors. \nWe ordered two appetizers, and two mains. The appetizers were served not long after we'd ordered. Both the lobster bisque, and the four cheese ravioli were presented excellently, like in a high end restaurant, but servings were on the smaller side. The lobster bisque was creamy, with a subtle lobster flavor. My boyfriend raved on about how about how good it was. \nThe four cheese ravioli I was also very happy with. The ravioli was delicious, with a good cheesy flavor, but at the same time, not too heavy. \nOur main dishes came out shortly after we'd finished our appetizers. I really enjoyed both of them. The veal was tender, in a hearty sauce, with rice to scoop up the sauce with. \nThe bouillabaisse, with a thin tomato broth, accentuated with saffron was the lighter of the two dishes, containing freshly cooked seafood, that didn't at all have a rubbery texture. \nBy the time we left at 7ish, the garden had filled up. \nWe were taken care of by the same waiter (who is possibly also the owner) who was very kind to us all evening. \nHighly recommend for authentic French food and delicious wines in a beautiful environment.", "author": "Su L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-30", "description": "Caught up with one of my childhood friends here. The ambiance is great. There's outdoor seating. The food was good and reasonably priced.", "author": "Margaret R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-12-28", "description": "We shared salmon tartar and it's a great starter. \n\nI had hanger steak and it's really good! One thing that I'm not completely happy with is that the waitress didn't tell us that sauce is an additional $2 when she offered us sauces to choose from. \n\nMy friend had purple potato gnocchi. He liked it but also found it too cheesy and heavy.\n\nThe table next to us got cheeseburgers. They're huge and looked really good.", "author": "Jasmine C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-03", "description": "Waitress was very attentive. Friendly staffs. Great food, great environment. It was a bit empty (I enjoyed the peacefulness) since we came at 5PM but overall, I had a wonderful experience and would definitely come back. I had the mushroom sauce steak. The potatoes were on point and the steak cooked in perfection. It was pretty amazing!", "author": "Joey R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-17", "description": "Me and my girlfriend came to visit this wonderful place by chance but thank god we did it. Although it was late, we were greeted very warmly by Kaza, who was very friendly and kind to us all night. We ordered salmon and avocado for an appetizer and it was stupendous. It was one of the best that I have ever eaten in my life. The white wine was also very good. I would definitely come to this place again and thanks to Kaza, who made us feel home with his very friendly service.", "author": "Gordon X."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-25", "description": "We LOVE Bacchus! If we could give them more stars we would! We found Bacchus a little over a year ago when we were looking for a wedding venue. We looked at a lot of places but when we walked in I knew this was the one. We got married there September 2018.\n\nAfter deciding on Bacchus for our wedding we went there a lot over the next year--dinner, drinks, meeting our wedding vendors. The staff was always so lovely, warm, and accommodating. The food always so yummy.\n \nMeryl is the best! She, Alvaro, and team are really on top of their game. You get early on that they are there to make your wedding day the wedding day you imagined.  They are professional, flexible, and warm. We really felt they cared about us and what they were doing.\n\nThe space is beautiful. The tree in the garden with twinkle lights--stunning! The food--let's just say Yum!\n\nOur guests raved about the space, the service, and the food. The trifecta!\n\nMeryl, thank you for helping to make our day perfect---because it was! We are so full of gratitude!", "author": "Madison C."}], "servesCuisine": "French", "priceRange": "$11-30", "name": "Bacchus Bistro \u0026 Wine Bar", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "409-411 Atlantic Ave", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/oriVKWBIxKF0EQiVu8iVqg/ls.jpg", "@type": "Restaurant", "telephone": "+17188521572"}