{"aggregateRating": {"reviewCount": 439, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-03-30", "description": "Stopped by for brunch and the place didn't really make an impression.  My friend and I split a quiche and an omelet, both of which were decent but service was slow-- had to flag down the waiter to take our order, twice to get bread, to get a water refill, and to get the check even though the place wasn't too busy.  \n\nI'll give this place another try, though, to actually try their french cuisine and mussels.  Until then... 3.5 stars.", "author": "LJ H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-08-17", "description": "Fairly mediocre dinner here the other night. It was a balmy evening so we ate in the back garden, which was very pleasant. We were seated at a high table with canvas director-chairs-on-stilts, which were not very comfortable.\n\nI started with the escargots, which were woefully overcooked -- they were like wizened pencil erasers floating in little pools of underseasoned butter (was there even garlic in it?). For my main I had moules frites. The fries were decent but the mussels were also overcooked, though not as grievously as the snails. The broth was also underseasoned, and had numerous woody thyme stalks strewn about from which the leaves should have been stripped.\n\nDessert was a very good molten chocolate cake, served with roasted cashew vanilla ice cream (that tasted mostly like store-bought vanilla).\n\nI had this as a prix-fixe, which at $26 would have been a good deal had the food been better.\n\nService was friendly... almost overly so. But the cooking was a definite let-down.", "author": "J. P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-16", "description": "lovely little romantic spot. really enjoyed the ambiance and nice wine list. was a perfect fit, not too fussy for my beau and I to enjoy some french food for valentine's day. we would def go back for another occasion or for their brunch. I had the hanger steak- beautifully cooked; he had the seafood pasta and was incredibly happy with it. desserts were so decadent and lovely. I had the creme brulee which came with a gorgeous sugar sculpture on top. very attentive and kind waitstaff too.", "author": "Nora C. E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-17", "description": "I just went to Bacchus last night for the first time (had a date with myself :) and stumbled upon it by accident.  Fantastic place!  Very cozy and simple romance.  They have a garden in the back too which will be nice when it warms up.  The service was excellent.  Everyone was so nice and gracious.  I was craving a burger so that's what I went with although the chef special was salmon stuffed with crab which my mouth started to salavate over.  To my luck, on Wednesdays only, all burgers come with a free beer! :)  So, I got the burger with Roguefort cheese and it came with a healthy portion of salad and fries.  I cleaned my plate.  It was SOOOOO yummy!  Kudos to the chef.  I know it's just a burger but it wasn't just a burger.  You can tell the way it was cooked and prepared that it was done right and with care.  \n\nWill definitely be back.  Hopefully with a cute boy.  It was so romantic, I wanted to share it with someone else too.", "author": "Kristin L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-30", "description": "Cozy Atmosphere and one of the best burgers in Brooklyn.  Everything we have had there has been very delicious.  The staff is nice and service is good.  They have a beautiful back yarn with lights.  I wish it was enclosed so we could enjoy in the winter.  Would love it if they had a full bar but glad they have a nice wine selection by glass and bottles.  Would recommend making a reservation.", "author": "Pina R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-16", "description": "I went with two friends a few months ago. The back area is a nice place to sit and get some fresh air. The wait staff was helpful and funny, and their experience with items on the menu helped us make a few of our choices (not all restaurants can claim the same).\n\nThe pork belly was amazing, and I tried escargot for the first time here. The peche melba was an excellent dessert, especially considering I'm not always impressed by peaches.\n\nWe all loved every item. Next time I'll write the review sooner so I can comment on each item specifically.", "author": "Steven B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-08", "description": "My boyfriend and I came her for brunch over Labor Day weekend.  We've always wanted to check it out since visiting the attached wine bar for drinks one night.  We saw all the food leaving the kitchen to the restaurant and it looked so appetizing that we knew we had to come back for a taste.  \nWe were greeted by a welcoming host and we asked to be seated in their beautiful garden in the back where most of the patrons were sitting.  We were quickly given our menus and happily surprised by how inexpensive they were.  They had many options to choose from but I decided to go with the Bénédicte au Crabe and my bf the Bacchus B.L.T.  We were given some rustic crusty bread and butter but oddly enough no side plate to use.  Although, we noticed none of the tables had any small plates.  Just seemed odd that you had to just hold the bread and eat.  \nOur entrees came quickly and both came with a version of fries and a light salad.  We found them delicious and filling.  I'd like to return for dinner and try out some other options and well as come back for drinks and have a chartuterie and cheese plate.", "author": "Lauren L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-08-10", "description": "Cute, reasonably priced french restaurant around the corner from my apartment - oui monsieur! The food is decent, albeit not mind-blowing, and they have a great prix fixe for about $25. I've been here a bunch of times and hesitated between 3 and 4 stars, but I gotta give 3 for my last dining experience here. \n\nOn the plus side, 4 of us sat out in the cozy garden on a balmy Sunday eve after a day at the beach - perfect summer setting. Also, I see they have done some renovations here since my last visit, opening up a front bar area that used to be uber cramped. Nice job.\n\nNegatives - once seated, we waited forever for our server to come back and take our order, despite the fact that it was early and not particularly busy yet. We split the pork belly app, which I normally like here, but on this occasion it was weirdly dry and tasteless. (But I did have a summery salad with avocado and pear that was simple and scrumptious.) Once our mains arrived, 2 of us that had dishes with fries were given a plate of steamed buttery chopped potato instead. Umm, can't dip that into my mussels! We were at that point told (by a busser, not our server) that they had a problem with the fryer. Fine, but the server could have mentioned that when we were ordering... I certainly would have ordered something different.", "author": "Laura Z."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-04-20", "description": "I wanted to love this place because it's really pretty and while waiting the food smelled incredible. We had reservations for 8:30 they kept moving us closer \u0026 closer to the main dining room but never sat us until 9. The staff was running around like chickens without a head. I felt bad for all of them, I think they either weren't expecting a full house or they were short staffed. We finally sat (thank god, because at that point I had already downed 2 Merlots) and food came out fairly fast maybe too fast. My foie gras was FROZEN. I tried cutting it and chunks went flying off the plate \u0026 table. The salad with goat cheese and onion soup were delicious. We also had hangar steak \u0026 frites and beef cheeks (don't know what that is) that was also really good. Skip desert, we had 3 different kinds and none of them are worth mentioning. Sit in the backyard so pretty out there. The staff work really hard and are really nice BUT they need like 5 more waitstaff.", "author": "ExPark S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-10-08", "description": "I went with a large party to Bacchus, thought it sounded nice and fellow yelp-ers gave it a good review.\n\nBUT, while it's a charming establishment the service is appallingly BAD...we were a large party, and I recognize large groups can be a bit of a hassle, we actually waited AFTER being seated, over 1.5 hours, let me say that again 1.5 HOURS before they came to us to put in an order, or bring us bread, it was unreasonably bad...the waitress was then blatantly rude to my friends as if it is their fault she ignored us for over an hour, again unreasonable!\n\nI will say the food is merely okay, most of the dishes were good, especially the Fig/Pear/Goat Cheese starter (unreal DELCIOUS!) but for a French restaurant DON\"T order desserts, they were TERRIBLE! How can a french place have such bad quality and poorly flavored desserts, they were atrocious and I would never subject anyone to another one of those!\n\nAll in all an awful experience, with a high price tag, save your money and your taste buds, go to COLONIE on Atlantic Ave, it's far far far far better.", "author": "C G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-07", "description": "We are pleased to write a glowing review of Bacchus following our July 2014 wedding! First, Meryl, the restaurant events manager who handled our wedding, was excellent. She was very nice, professional and responsive, ensuring that our wedding plans ran smoothly. We selected the buffet option, which included four courses, including an amuse bouche, appetizers, main course, and dessert. Our tasting was absolutely amazing, including a delectable selection of traditional and modern French foods and wines. We honestly struggled to decide from which delicious options to choose (a good problem to have, in our opinion)! Meryl, however, provided excellent recommendations without pressuring us at all. And lest we forget, the dessert options were decadent and delicious.\n \nThe location was perfect for our Brooklyn wedding ceremony and reception. We had about 65 people at our July wedding, but there was adequate room for at least another 25 or so, depending on the set up. The restaurant interior is quaint and rustic with a warm bar and dining area for guests to enjoy privately before and immediately after the ceremony. With the exception of the cocktail hour, our wedding ceremony and reception was outside on the rear patio. And the patio was absolutely gorgeous, especially with the tree in full bloom and its branches extending overhead, serving as a shade from both sun and a very brief rain shower just before our ceremony began. A tastefully decorated open-air roof covered the other side of the patio where our guests were seated for the reception.\n \nFollowing our ceremony, the staff graciously eased our guests from the patio back into the restaurant where guests were able to enjoy an excellent assortment of amuse bouche accompanied by American and French craft beers and French wines (of course!) while the tables were organized for dining. Did we mention the food is amazing? Our guests certainly raved about it afterwards!\n \nAnd last, but most importantly, we were very satisfied with the cost. As budget-minded consumers somehow managing to live in Brooklyn, we were looking for a quaint, non-pretentious venue that provided excellent food and wine near our home. And we found exactly what we wanted in Bacchus. Compared to some of the other options we explored in the neighborhood of similar size and amenities, we felt that Bacchus offered an excellent moderate option for our Brooklyn wedding. This was especially so, given the delicious food, terrific staff, and the unique ambiance Bacchus offers. We strongly recommend giving Bacchus a look if you're in the market for a Brooklyn venue.", "author": "Sara H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-21", "description": "This place is great... It's a bit crowded but that ensures you that it's worth the visit. Food is really good... From the brunch menu (steak and eggs!!!!) to the diner menu (steak and fries). Burgers are also good. The dessert menu is also great! This place could've gotten 5 stars it's just that they kind of forget about you...", "author": "Jay V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-11-02", "description": "Yummy yummy French food! Amazing service, not just the server, but two French speaking women who I believe may run the place, were great! I got skirt steak with the peppercorn sauce, a glass of pinot and a glass of malbec. After a long day of traveling (we had to venture into Manhattan from Brooklyn after Hurricane Sandy, brutal) finding this place on the walk back from the ferry was heaven. \n\nlove.", "author": "Aaron T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-24", "description": "My first visit to this place and I was impressed. Nice atmosphere, ask for Ralf he was awesome. A+++", "author": "Denisse A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-03-14", "description": "I have never had to give a 1-star review until now.  I came to Bacchus with my mother and a friend on Saturday, March 14, 2015 at approximately 7:20 p.m. and was told it would be a five minute wait for our party of three.  After we were ignored for almost half an hour, I decided to ask how much longer the wait might be.  I was told that it would be another fifteen minutes for a table.  We resigned to sitting at the bar even though the bar stools are backless and my mother has back issues because we were too hungry to wait any longer and because the staff was not giving honest wait estimates.  Had they been honest from the onset, we could have gone to an altogether different restaurant much earlier.  We ordered escargot in garlic and star anise butter (fine), a warm frisee salad with fried artichoke and tomatoes and lemon dressing (also fine), squash and asparagus stuffed daurade cooked in parchment paper special (completely unseasoned and terrible), and half roasted chicken with french fries and greens (dishonesty must be their policy because we received something that was a less than a QUARTER of a roasted chicken and, again, very bland and uninspired).  The wait staff was cold, curt, and brusque, perhaps because it was a busy evening.  I didn't mind that no one bothered to check in with us during our meal to see how everything was, but I did mind that when I asked a waiter for water, he seemed annoyed, as if I were a being a nuisance.  The staff was just trying to churn out tables as quickly as possible.  Moreover, for the price, I expected more and better food.  Terrible service + dishonesty = HORRIBLE restaurant.  Eat at Minetta Tavern instead if you want great French food, or, if you must eat in this neighborhood, walk a few blocks over to Mile End Delicatessen, which has much better food AND service.", "author": "Debora C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-31", "description": "Escargot first; all you can eat Mussels second.\n\nThe experience of Bacchus on a warm May evening for dinner out on the back patio was great!  The service was attentive and so nice!\n\nThe wine was a good selection and everything fairly priced!  I just wished I had MORE room in my stomach to try more dishes!", "author": "Robert L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-11-18", "description": "Service was pretty bad.  Think it was a new waitress.  Food to me was underwhelming.  Some enjoyed there dishes, some didn't.  Someone got cold coffee 2x and gave up. 2 of us got cold fries.", "author": "Marc O."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-15", "description": "Wednesday was awesome. Best omelet ever. Not so much today. Was a real let down. It was 5 stars for sure. Had to take it down a notch because of forgotten avocado and caramelized onions. Will come back but not on Thursdays I guess.", "author": "John C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-10-04", "description": "I visited this place last year and it was amazing but I recently went like yesterday and everything was horrible , my food was cold the Mac and cheese was very watery and uncooked the bread was extremely hard I was so unsatisfied with everything ,", "author": "Hillary B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-28", "description": "This place helped me discover mussels. I mean I knew what they were and I've seen them on menus, but I was convinced the texture was rubber. Then I came to Bacchus Bistro a Vins and had a mussel revelation! They were tender and light, not chewy, with a fresh taste that was vaguely oceany. It was so good I didn't want to stop eating even though I was so full from the huge portion. \nThey pack you in pretty tight in the dining room but hey that's pretty standard. The service is very good as well. I've been twice already and it's now on my go-to list if I want a relaxed date dinner or one-one friend dinner....no groups.", "author": "Dina V."}], "servesCuisine": "French", "priceRange": "$11-30", "name": "Bacchus Bistro \u0026 Wine Bar", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "409-411 Atlantic Ave", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/oriVKWBIxKF0EQiVu8iVqg/ls.jpg", "@type": "Restaurant", "telephone": "+17188521572"}