{"aggregateRating": {"reviewCount": 439, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-02", "description": "My favorite French place in the area. Romantic, casual, laid-back atmosphere and I crave the mussels. I have also had great specials like duck confit and beef cheeks! Staff is friendly, and atmosphere is sweet and fun.", "author": "Hana G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-12-13", "description": "Had a reservation for 8:30, and showed up right on time. 40 minutes later, still standing at the bar waiting for a table (and it felt like we were being purposely avoided by the staff).  No one came up to us and asked us if we were okay (we weren't -- it was packed, we were right by the door, and we had been standing for 40 minutes).  The few times I managed to catch the eye of a staff member, I was given a weak assurance that it wouldn't be long.  Maybe it's too much to expect a complimentary drink, but I don't think it's too much to expect an apology. \n\nWe left and were immediately seated at the lovely French Louie. Won't return to Bacchus on principle.", "author": "Laura M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-20", "description": "Tried Bacchus for Dine-In Brooklyn and will absolutely be a regular.\n\nSetting: Cozy, inviting bistro atmosphere. The outdoor patio was open and it was a fantastic setting to dine in. The tables were spaced out and their patio is bordered by a mix of other restaurants and apartment buildigns- hearing the light rumble of cars passing by and the sight of a cat climbing a fire escape encapsulated quintessential Brooklyn outdoor dining charm.\n\nNow on to the food:\n\nAppetizer: Watercress salad with goat cheese and mango with balsamic reduction. The salad was well-dressed- flavorful but not sopping wet or greasy. The watercress was crisp and fresh and the mango perfectly ripe. The goat cheese was smooth and creamy and had just the right bite to it.\n\nEntree: Beef Cheeck Boeuf Bourgignon. FORK TENDER! The Boeuf Bourgignon was addictive. The Beef Cheeks were melt in your mouth soft and the sauce was hearty and flavorful- the velvety taste of red wine was there but the alcohol was properly burnt off (this matters- a French stew where the alcohol is not cooked out is nasty). The potatoes, carrots, mushrooms and cippolini onions in there were also tender but not mush- perfectly cooked! \n\nDessert: Tarte Tatin. WOAH WOAH WOAH MAGNIFIQUE OM NOM NOM- THIS. WAS. GOOD. REALLY. REALLY. SUBLIMELY. INSANELY. GOOD. I never understood what the point of tarte tatin was until I had it here. The apples caramelized in butter and sugar were transformed  into rich albeit light, appley insanity. The tarte crust was flakey and the perfect complement.\n\nTo top of it off, the staff were inviting and friendly!", "author": "Steve B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-05", "description": "Above average french food at reasonable prices. \n\nFood:\ncrispy goat cheese \u0026 pear with fig relish - awesome\nduck rillettes - really tender and juicy\nmushroom ravioli  with asparagus- very good\npork belly - i didn't try but my sis said it was really good\n\nIt was a little cold to eat outside, but the garden looked beautiful.\n\nAlso, excellent service by an absolutely lovely waitress.  Frequently filled water and wine glasses, friendly but not intrusive, and no getting rushed out the door after you are finished eating...just like in France.", "author": "Rob G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-09", "description": "I was walking with friends, and they pointed me to this place for lunch.  So, I took their word, and I am so glad I did.  This place is now in my top 5 for best places that I've eaten at while in New York.\n\nFirst, I was happy to see that the hint on Yelp was true.  You do get a free glass of wine if you say you've seen then on Yelp.  I had red, and it was really good.\n\nLunch was their hanger steak with fries and a side salad with Normande sauce.  The portion was huge, but it disappeared quickly.  The sauce was on the side, and was a great addition to the steak. \n\nThe service was polite, friendly, and attentive.  The atmosphere of the place included a old wooden floor .... nice garden area in the back ... very cozy and warm.\n\nOverall, I loved it, and will be back with friends.", "author": "D A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-03-20", "description": "I was in the area and stopped in for lunch because of all the great reviews this place had.  The place is a very cool spot.  The reclaimed wood floors and the place is quaint and chic at the same time.  I was trying to be healthy and order a salad but the waiter convinced me to get the burger.\n\nI have to say that the burger lacked seasoning.  It was fairly bland but it was cooked to my desired temperature of medium rare.  For a $17 Burger, I expect more.  The atmosphere is great and it must be incredible on a spring night.  But, for that one burger that I had that day left a lot to be desired.  But for the decor, this would be two-star.", "author": "Albert C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-06-06", "description": "Ugh no just no. Ive been to this place a couple of times before for brunch and it was always descent but today that came to an end. They have a cute outdoor area which is why we decided to go there but we were seated under a tree where a bunch of leaves and other tree crap just kept falling on our heads.  The food is abysmal. My husband had the lamb sausage and fries....the sausage was ok but quite greasy but the fries were terrible, hard, greasy and just bleh. The waitress wasnt on her game at all, when i placed my order i asked for steak n eggs - steak medium eggs over easy, she repeated the order back to me and say medium-rare? I corrected her and she went on her way. Well i got eggs sunny side up and steak mostly rare...i sent it back to have the eggs cooked properly but the damage was done. Anyway i will not be coming back here. Oh and they throw lots of parties on their patio area and its very pretty for like baby and bridal showers but beware of the dishwasher cooking your food that can a party quick (and i say the dishwasher because no chef in their right mind would present what we ate today as food). This place is a dud, on to the next!", "author": "Liz L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-20", "description": "Had brunch here on Sunday afternoon with my parents. Sat outside and it was really nice. A hidden gem in Brooklyn the outside atmosphere is fantastic and the food is great along with the wine choice. I would definitely recommend coming here for a romantic dinner or a engagement party. The only bad part was the service was a little slow but not terrible. We'll definitely be back.", "author": "Alexander K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-09-24", "description": "Being a savvy menu hunter, my girlfriend and I made a reservation for a Tuesday night in hopes of taking advantage of the \"Endless Muscles and Fries\" offering for $16.95. Upon our arrival, we were greeted by our soon to be waitress who promptly sat us outside upon our request. This like many Brooklyn restaurants Bacchus has a fantastic outdoor space - perfect for hosting a medium size gathering (30 - 40 people).  Back to our experience...upon taking our seats we quickly saw our waitress who informed us of the menus specials. After that we didn't see her for approx. 15 minutes. We ordered a bottle of wine and our main course (Endless Muscles \u0026 Fries). Understanding our waitress likely was also doubling as hostess we patiently waited 20 mins for our wine and close to 45 minutes for our Muscles \u0026 Fries to arrive. We had our muscles which were top notch, but when offered to order another round we passed since almost 2 hours had passed since we had originally sat down. I know guys, this is unlike me to buy into a \"Endless\" meal and only have one helping BUT being what we like to call a school night I couldn't subject myself to another hour wait for a simple bowl of steamed mussels and sauce. I highly recommend the food \u0026 ambiance, but question Bacchus service model.\n\n-Boots", "author": "Will M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-01", "description": "My husband and I were getting married in the area on September 19, and needed a place nearby to host our rehearsal dinner.  Lucky for us, we found Bacchus Bistro (thanks to yelp)!  The event manager quickly responded to my inquiry with lots of information including clear pricing, possible food menus, and photos of past events they have hosted.  \n\nTo be honest the first thing that drew me in was the pricing.  It was one of the most reasonable prices per head I had seen when doing my research, and was exactly within our budget.  There were two different prices per head, based on whether you wanted 3 or 4 courses.  There was also an option to add a 3 hour wine/beer open bar.  For each course you get to select 3 items for your guests to choose from.  \n\nThe next thing I loved was the fact that the restaurant has an outdoor private event space.  The back area of their patio is sort of its own little area so they let you have that entire space to set up as you choose.  The really great thing is that it can be covered and shielded from wind/rain if need be, and there are heaters in case it's chilly.  \n\nThe event manager invited us to come in for a tasting, and the first thing we noticed was the atmosphere of the restaurant, it's so cozy and cute!  We had chosen a bunch of different things to sample for the tasting, and they did NOT skimp on the amount of food they gave us!  The food was great! They also let us try all of their wines by the glass, a surprise that we were not expecting!  The whole thing was complementary, which was really above and beyond compared to some of the other places we had looked into.\n\nThe night of our rehearsal, the manager, Alvaro and his team really took care of us.  The back patio area was draped in lovely white cloth and had very nice white ambient lighting.  The staff was even ready and able to accommodate us when we showed up a little bit earlier than expected.  The tables were set up nicely with candles and printed menus with our food options.  The back patio had a separate sound system that we could have used if we wanted to bring our own music, but we were totally fine with the music the restaurant was already playing.  The night was so much fun, everyone really enjoyed the food and the wine.  They even let us hang around a bit past our 3 hour mark.  If you are looking for a space to host a private event, look no further, go to Bacchus!  A big thanks to Meryl and Alvaro and team for making our event so special!", "author": "Jessica F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-02-20", "description": "I would give 4 stars if it hadn't taken over half an hour for us to get our salad after we finished our soup and if our coffee hadn't been burned from sitting so long.  This restaurant offers traditional french fare and tapas as well. \nWe had the carrot-apple soup and it was fantastic. Our crispy artichoke salad was good and the penne with vegetables was a wonderfully tasty dish. \nThey didn't have quiche and I'm not sure you can be a French restaurant without quiche; especially if it's a regular part of your menu.", "author": "Melody M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-24", "description": "I came here with my boyfriend last night because the wait at Kaz An Nou was ridiculous. Bacchus Bistrot a Vins was not disappointing- the menu is extensive, friendly staff, awesome music playing in the background (The Beatles, Ben King) and a very romantic ambience. We ordered the pork belly tapas, warm brie tartines, green salad w/goat cheese, escargot and beef cheeks braised in red wine w/carrots, onions, bacon and potatoes. Pork belly was not that great- it was on the dry side and I've had better. Warm brie tartines were delicious- however, I felt like I could've made it myself. Both tapas appetizers were mediocre but I liked the generous serving of green salad that came with them. Green salad with goat cheese tasted great- I loved that the salad was not drowning in balsamic dressing and the goat cheese was warm and I could taste the fig relish inside the goat cheese. The escargots were a bit small but I liked that Braised beef cheeks was the best part of dinner because the beef was extremely tender and melt in your mouth. My boyfriend and I both thoroughly enjoyed our dinner and were pleasantly surprised at how inexpensive our dinner was. The bill came out to sixty something dollars for five dishes with generous portions. We were both really full and happy because we were initially reluctant to try this place since we didn't do any thorough yelp research. Minus 1 star because it was pretty generic French fare and nothing creative or original to make it uniquely \"Bacchus\"... I could probably find very similar French food in Manhattan.", "author": "Valerie L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-01", "description": "A true French restaurant.  When we walked in, we were greeted warmly by whom I'm assuming was the manager or owner.  He himself previously was relaxing and conversing with a friend or a patron.  Very laid back and inviting atmosphere, like you're family.\n\nThe interior dining area is dim and romantic and great during the colder months, but I preferred the outdoor seats.  The area was dimly lit as well but the pleasure of eating with the cool breeze blowing and the open space is beyond measure. \n\nThe wait staff was laid back herself, in a good way.  There was no rushed behavior or frustration of too many orders.  Just friendly and relaxed.  \n\nWe had the foie gras and the mussels a gogo.  The foie gras was tasty and paired with the sweet apple chutney, added an extra depth of flavor.  For the mussels, there are four choices of sauces which accompany them.  We started with the provencale.  The mussels themselves were large, unlike most restaurants that offer mussels a gogo.  Also they were in large quantity as well, again unlike most restaurants.  The sauce was very herby and slightly salty but overall very good. The same can be said for the mariniere and the moutarde.  \n\nI will definitely return to taste more of their fare.", "author": "Donald E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-10", "description": "Delicious food, really cute space. Plus a couple was having their wedding reception there so that made for great people watching. \n\nI'm a vegetarian and don't always find food I can eat at French restaurants, but this place had several tasty options. I'm obsessed with the artichoke salad (fried artichokes, amazing!) and the gnocchi was great too.", "author": "Nancy R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-08-03", "description": "Everything was just okay. I ordered a croque Madame and it was served on bread that tasted similar to Italian bread.  In my opinion a croque Madame should always be made on brioche bread.  The coffee was just okay.  Basically, It isn't that bad and it isn't that good.  The interior was very nice and the staff was friendly.", "author": "Mike C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-08-18", "description": "I'd like to give Bacchus a higher rating.  The decor is pleasant, the food is always great (I recommend the hanger steak) and the prix fixe is a fantastic bargain.\n\nHowever, I've been here about a dozen times and the service is consistently bad. The wait staff is very nice, but they're always understaffed and it frequently takes a half hour to get the check or an hour to get the entree.  I've had a few dinners here that lasted two and a half hours because we were waiting around for dessert or the bill.\n\nIf the service was a little faster I'd give this place four and a half stars.", "author": "Tony D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-09-28", "description": "The worst service I've had in years. Food was extremely slow to come out, with a French waitress who managed to be both rude and  incompetent . No stars.", "author": "Afdhel A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-03-22", "description": "Came here for dinner w a friend and was impressed with the ambiance. We both loved the garden and made plans to come back when it was warmer \n\nThe waitress was adorable, i think due to her French accent \n\nI ordered the Prix Fixe:\nAppetizer (Goat cheese w/ fig jam): Croustillant De Chêvre Et De Poire\nEntree (Porkchop): Rôti De Porc Aux Pruneaux Avec Farro Aux Poivrons Et Asperges\nDessert: Mousse Au Chocolat \n\nOverall, dinner was satisfying and delicious.  But, I had actually mistaken this restaurant for the nearby Rothschild and was very confused why this place didn't serve beignet. Cajun.. French... all the same? nope not at all", "author": "Joanie K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-05-03", "description": "I had the escargot and chicken liver salad. The escargot is pretty good, very flavorful. I loved soaking my bread in the green sauce.\n\nHowever the chicken liver salad was not as wonderful. I'm a big liver fan but this salad was sadly to say it  too livery. I expected the chicken liver to be marinated or seasoned more. But pretty much it was what the menu described, a chicken liver salad. I had a total of 4 big pieces of liver (probably from 4 chickens), which is too much when it tastes bland and under seasoned. \n\nThis place has a private outdoor space that opens up when weather is good. Like the french, its slow service. They don't rush you to order or to leave. I found the hostess's french accent to be very strong, kinda wondering if she's faking it to create the ambience. Either way, she was pleasant and attentive.\n\nOverall it was a decent meal. I will return to try something else other than chicken liver salad. My meal - escargot, salad and glass of wine with tip was $25.", "author": "Katy H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-26", "description": "We really enjoyed this meal. The food was great, a good price, well portioned, and the service was perfectly attentive. \n\nWe made a reservation for 5:30 and had no problems. Although we were the first there, it immediately started to fill up on Saturday at 5:45, so reservations are probably needed.\n\nI had the Beef cheeks $20 \"Bourguignon\" and my date had the $25 prefix with duck rillettes, pork belly, and Crème Brûlée. We both loved everything. \n\nWine bottles were also $28-infinity. \n\nAlso, the staff was all French, if you're into that.\n\nI'd definitely go back.", "author": "Chris H."}], "servesCuisine": "French", "priceRange": "$11-30", "name": "Bacchus Bistro \u0026 Wine Bar", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "409-411 Atlantic Ave", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/oriVKWBIxKF0EQiVu8iVqg/ls.jpg", "@type": "Restaurant", "telephone": "+17188521572"}