{"aggregateRating": {"reviewCount": 439, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-14", "description": "Stopped in here for a late meal around 10:30pm on a Thursday.  The woman in charge of the dining area was very friendly and helpful, even though the kitchen was about 10 mins from closing.  The food was hearty, full of flavor, and generously sized.  Ambiance was nice and relaxed, and they have a small garden in the back.  Must come and try this place for brunch!", "author": "Jonathan M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-25", "description": "The ambiance of this place is really nice it's like a coffee shop vibe to it with I believe gelato. But after going to the bathroom I see they have a whole other side with a bar, I definitely feel like I will be back here. The vibe is real relaxed have a nice music selection real melo. My food was good it was a chicken sandwich with some sort of mayo and avocado. The bread you could tell was quality and fresh, not that much chicken. But this is definitely a quality spot!!", "author": "Ali J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-06", "description": "This is my favorite little restaurant in Brooklyn. The staff is extremely friendly, the space is cozy with a beautiful outdoor space AND the food is delicious and fresh.\n\nWhen in doubt, this is by far my go to spot for an enjoyable night out.", "author": "Rob V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-25", "description": "Amazing events service. We had our rehearsal dinner here in late 12'. In the lovely canopy covered garden. It showered towards the end of the eve and they very promptly let down the tent curtains all at once. Everyone cheered brilliant! The food was yummy and amazing portion sizes. Good wine service. They played our song playlist. They had a large selection of meal choices and great package rate! We had some picky people in from out of town and everyone was thrilled. Meryl was so accommodating and made the entire process seam effortless. Even if your trying to do a small to moderate sized wedding ceremony in BK check them out! Hidden gem!", "author": "Alexis M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-26", "description": "When it is sunny and about the time you would be eating brunch during a dry pleasant summer weekend - i recommend this place during that precise situation. You'll feel how good that would be in the backyard among the trees and simple but well done food with a Belgian ale and the afternoon ahead of you at either Salvation Army or Steven Allen depending on your price range but either way this food is inexpensive and fresh.", "author": "Victor L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-11-12", "description": "Went to this place with family before going to a show at the new Barclay Center - its fairly close to the center and was very convenient.  Everyone liked it, a few of us had the prix fix menu, which was a good deal for $25.  Had the beggars purse, which was good, and the duck terrine (which was just ok).  The mussells were tasty, although the fries left something to be desired.  Fish of the day was trout and was excellent.  My brother got the hangar steak and said it was good.  Desserts - always a fan of creme brulee, and the mousse was good, the molten chocolate cake was just ok.  I would definitely go back to this place if I was in the neighborhood, the food was good, but for the price its great.", "author": "Rakesh M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-07-20", "description": "Ambience beautiful, food pretty good, service sucks\n\nAte here Saturday late evening (10pm reservation) and immediately fell in love with the decor and general feel of the restaurant.  We were seated out back in their garden which is just lovely and I was really looking forward to the experience - very romantic date spot.\n\nOur food was also pretty good - I won't say it was outstanding because it wasn't but there was nothing wrong with it aside from maybe the snails should have been served in an escargot dish instead of just laying on a cold plate since they lost their temperature very fast... of course that could have been because our appetizers were probably brought out 15mins after they were ready to be served, but I will get to that in a bit.  I had two Leffe Blondes, the escargot as an appetizer, the skate fish as an entree and the floating island for dessert (from their $25 prix fixe - not bad).  My boyfriend had two glasses of Cote du Rhone, the roasted veggies and goat cheese for an appetizer and the mussels/fries for an entree.  I wasn't very impressed with the escargot, but I ate it.  The skate fish was great - came with mashed potatoes and spinach which is predictable but whatever... they could have maybe used a little less butter in the sauce but this is a french restaurant, right?  My boyfriend's vegetable and goat cheese appetizer was okay and his mussels and fries were perfect - they come with a choice of 3 broths and I highly recommend the dijon one.  The best was the floating island for dessert - it happens to be my favorite dessert ever and it was done so well, it was really a great end to the meal.\n\nOn to the service - let's just say, S L O W... We got there at 10pm and weren't served our appetizers until almost 11pm after we had completely finished our drinks... my appetizer was cold so it was probably sitting around for a while.  the entrees were served probably between 11:30 and 11:45pm and the waitress apologized for the wait (she must have been busy smoking cigarettes in the back of the garden with her friends)... in between the appetizer and entree I actually had to pull another waitress aside to ask for another round of drinks because our waitress was nowhere to be found.  After the entree, our dessert came out quickly so that was okay, but you should know that we arrived at 10pm and left close to 12:30am!!  I'm all for leisurely meals and everything, but when you're sitting in a restaurant starving watching other tables get served three courses in the time you get served your first, something isn't right.\n\nMaybe it was just an off night for our server, which is fine, but it did leave an impression.  Besides that little fact, the restaurant is worth a visit to check it out for yourself - could be hit or miss though.", "author": "Rachelle R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-18", "description": "Had dinner on 2/15 here and had a good time with the GF. \n\nAtmosphere:  nice and laid back, we definitely were over dressed. Tables are close to each other but the surrounding conversations could barely be heard. \n\nService: The waitress was very nice and explained the specials. She was able to round by all the tables every 10 or so minutes and asked if everything was good. The staff kept our wine glasses full as well and food came out quickly.\n\nFood:  We got a bottle of Chardonnay and it was brought out fairly quickly along with some bread/butter right after we ordered. Appetizers also came out fast and my GF had a beet/feta cheese/walnut salad with a champagne dressing that was really good. I had the clam chowder and it was also okay (but not mind blowing). Entrees followed right after we finished the appetizers. I couldn't eat meat so I had the fish special which was essentially flounder (?) steamed in a bag with zuchinni, spinach, rosemary/herb and other vegetables. The presentation was nice and when I opened the bag it looked like it was going to be really great. Unfortunately it had tasted so bland. Neither did the vegetables nor the fish have any sort of seasoning on it. There was maybe a bit of butter sauce on the bottom of the bag that came from the steam. If you are going to bag steam your food, seasoning is essential. I just sucked it up and added a bit of salt and didn't bother asking to take it back. My GF had a duck special and she said it tasted pretty good. Lastly for dessert we had a great lava chocolate cake with vanilla ice cream. The cake was cooked perfectly and the chocolate fudge came pouring out nicely. The ice cream also tasted good. We finished everything off with a couple cappuccinos that was done perfectly.\n\nOverall: Great staff/service, food was also good and reasonable prices. Will give this place another shot and would have gotten 5/5 had my dinner been seasoned appropriately.", "author": "Diego R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-17", "description": "We were two couples, and our experience was wonderful. The ambiance is charming, the service was attentive, and the food was delicious! Great value too, as we ordered off the prix fix menu. A real find!", "author": "Alan T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-09", "description": "The food was great and reasonably priced, the atmosphere relaxed but festive.  A good wine list too.  It's not and in and out place - the pace is, as mentioned, relaxed, so if you have dinner before your movie schedule plenty of time and make sure you tell your server.  The lady who served us was very charming.", "author": "Jessica B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-01", "description": "This was a great random find! Very authentic French food, and a very classy, yet comfortable, ambiance. The food was stellar, the gnocchi was the best I've ever had. It is pricey, so be prepared for that with somewhat small portions, but if you're looking for quality, you'll find it here. The only food that was dissapointing was the peach dessert, it tasted kind of like canned peaches with vanilla ice cream and whipped cream.", "author": "Val W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-07-06", "description": "I've eaten here for years and while the service is always terrible I've thought the charm and food worth it.  While dining there last night, however, we saw a rat in the kitchen and the staff seemed virtually unfazed.  Never again!", "author": "Aaron L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-15", "description": "The past weekend was the second time I ate at Bacchus, and it was just as enjoyable as the first!  Starting with the service, the host and hostess were extremely personable and accommodating....the guy behind the bar was chatty and friendly which was really nice. The food I would not rate too high, eg. the burger was amazing but my tilapia was a bit on the salty side. But I think if you are looking for great service, nice ambience (they have a backyard, to boot) this is your place!", "author": "A M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-05", "description": "An easy 10-minute walk from BAM, we found this place thanks to Yelp!, which--simply by mentioning it--also entitled us both to a free glass of decent Cotes du Rhone.\n\nI'd like to sit at the sprawling table in the window sometime, but being two, we were squeezed into a narrow table in the back between an empty one and other diners. Even though they were busy, our waitress allowed us to put the 2 tables together so we could sit next to each other, backs to the wall, as we prefer. This made it possible to talk without shouting; the acoustics aren't great and there was a very loud table on the other side.\n\nA friendly, French staff attended well to our needs. \n\nWe ordered the Hanger steak, and got a huge plate of food: tender, cooked as requested, with great crispy \"frites\"; and the salmon, which was also cooked well. \n\nMy favorite was an appetizer: crispy goat cheese with pear and fig. The combination was outstanding. \n\nFor Yelpers on a budget, the $25 Prix Fixe menu and free glass of wine make this place a choice indulgence.", "author": "Mark M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-09", "description": "Shared a delicious dinner with a friend at this cute little restaurant with a beautiful outdoor patio. My fish and my friend's steak were cooked perfectly. We didn't order an appetizer, but because our main dishes were going to take a while the chef sent out potato leek soup on the house and it was divine! Our waitress was not only gorgeous but very sweet too. Highly recommend and I can't wait to go back!", "author": "Melissa M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-19", "description": "$28 prefixe dinner was a winner. The escargot appetizer, pork belly and salmon entrees, and hazelnut layer cake dessert all got top marks.", "author": "Henry C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-18", "description": "i've been here twice. first time i had the $25 prix fixe dinner. starter- duck rillet, entree- pork belly. dessert- peach and ice cream. Pork belly was more decadent than the dessert. also ordered a bottle of wine ($25). The food was delicious and service was excellent. i think it's one of the best french restaurants in brooklyn.\n\nthe second time i went i ordered way too much. 3 starters - bacon wrapped prunes (bacon does make everything better), goat cheese and peach beggars purse (starting to love goat cheese now), and warm brie tartines (delicious!). ordered the special of the day- 14 oz ribeye (it looked more like a 32 oz). obviously couldn't finish but they make great steak and eggs the next day. my gf ordered the prix fixe again (can't beat 3 course for $25). we ordered a bottle of wine and the bill was around $120 with tax and tip. \n\nWe've always had a nice time here. We will definitely be back for a 3rd time.", "author": "Cat N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-11-07", "description": "This place has a great balance of personality and ambiance.  The food is amazing.  I've been there for brunch and dinner and found both experiences fondly memorable.  So much so, we've even decided to throw our wedding there which turned out to be the best decision we could make.  \n\nBacchus provided the exact setting and mood we were looking for and everyone we talked to, after the fact, raved about the food and service without prompting.  Bruno and staff have always been friendly and very accommodating.", "author": "Dave L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-02-20", "description": "I had to argue with the reservationist and speak to a manager  , in order to not get charged for canceling a reservation due to a death in the family.\n\nUPDATE ... \nThe restaurant owner took the initiative to apologize and remedy the situation. This restaurant obvious takes their service seriously and I would give it another chance.", "author": "Jake C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-20", "description": "Very nice, cozy and Romantic.  Absolutely loved the decor, the food and the ambiance.  This place has the potential to become my go-to neighborhood french establishment.", "author": "Arkady S."}], "servesCuisine": "French", "priceRange": "$11-30", "name": "Bacchus Bistro \u0026 Wine Bar", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "409-411 Atlantic Ave", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/oriVKWBIxKF0EQiVu8iVqg/ls.jpg", "@type": "Restaurant", "telephone": "+17188521572"}