{"aggregateRating": {"reviewCount": 439, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-10", "description": "Authentic, tasty and a great wine list to boot. Great little lunch menu that isn't super $$$$.", "author": "Scott L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-05", "description": "Bacchus is absolutely lovely. Charming décor, excellent service, and AYCE moules on Tuesdays for $16.95. (Notice that this IS pricier than what is noted on the menu; the menu says $14.95). I may have to revise my review once I go to other AYCE moules frites and realize that this may actually be the best deal. For now, this should be considered a 4.5! \n\nIn order of preference (yes, I did try all of them ...): \n\n1) marinères - butter, white wine, garlic \u0026 rosemary treatment. I just cannot resist this amazing, perfect-as-is, classic way of moules preparations. Dipping the toasted bread in this broth is heavenly, and I reluctantly had to make myself stop gorging myself on the bread so that I could eat more moules. \n\n2) provençal - tomato sauce \u0026 herbs! This savory combination complemented the mussels well, and the broth is very potable. The flavor isn't too strong - very French, but could be considered bland by American standards. \n\n3) au Ricard - never heard of this before, but there are star anises in it! It's a very curious combination and the broth is spiced in an intriguing way. I would've preferred a smaller bowl for a sample, but I did enjoy this and I kept eating it until I was totally stuffed. The broth is reminiscent of a chai. \n\n4) moutarde - granted, I was never a huge fan of mustard, and they're right - it's not a spicy, strong mustard taste. However, it is distinctively mustardy, and I'm not sure what I expected. I guess I thought the combination of moutarde \u0026 moules (isn't that a nice ring?) would transcend the individual components, but it did not. I don't recommend this unless you are very fond of mustard. \n\nOverall, the mussels were plump and perfectly-cooked. I hate overcooked mussels, and these were perfect. They were very generous with the mussels - so I feel that even on a regular night, you'd be full off of a bowl. Strangely enough, the mussels are unlimited, but the fries are not. o_o Bizarre. I did like the fries a lot though - I think they were seasoned with rosemary. \n\nThe service was endearing and attentive; they came and told us \"Bon appetit\" and called us mademoiselles in such a charming way. I didn't feel like they were over-the-top at all with the French. (I think I'm actually oversensitive to that). I'd definitely come back for an upscale romantic date. As it was, I was just looking for unlimited mussels with a good friend, so it was a bit fancy for the two of us that night.", "author": "Liana L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-25", "description": "The place has very nice outside yard seating. The restaurant is very cozy and had old style design. Service is a bit slow. I had to walk around to find a host to get seated. I can tell the same about waiters. Food was pretty good and courses were pretty big too.", "author": "Levan G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-12", "description": "Came here for dinner from a friends recommendation. \nEnjoyed the Prefixed 3-course menu for $25. \nThe food was amazing!! =) \nThey have a little outdoor seating in the back... but its not open yet so that was a bummer. \nThe steak that my table and I ordered was cooked to perfection! The meat was really good (tender) and cooked JUST right. It comes with a sauce. There was Mushroom (creamy but very bland... no taste), Shallots (good medium consistancy... but SUPER salty so dont use the entire cup), there was one more sauce but im totally blanking on it.\nall in all, i would DEF come back here again!\n\nps:dessert... creme brule... yummy! the flan part is kind of soft and runnier than others ive had but the taste it good... sweet.", "author": "Sydney W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-12", "description": "This place is delicious \u0026 incredibly reasonable. \n\nMy friend and I frequently go for the French small plates. Some of my favorites are the french onion soup, mussels \u0026 fries, \u0026 the goat cheese \u0026 pear tart. I also love that they have smaller portions for their entreés-- the goat cheese gnocchi is delicious! \n\nThe service can be a bit unpredictable. We've had great service and bad service on both busy and slow nights.", "author": "Megan E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-11", "description": "Such a nice dining space. Their brunch menu is a bit smaller than I'd like (being a vegetarian) but it's still good nonetheless. They hold events here - smaller weddings, anniversary parties, etc, and when it's nice, they open up their backdoor patio. Come here on a rainy day and request to be seated by the windows in the back - it's absolutely romantically perfect.", "author": "Priti R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-20", "description": "Pros: Lovely garden ambiance. Above-average eats for below-average prices. Nice pacing of dishes, so you're neither rushed nor starving. A friendly staff (they were happy to chat with my wife, who's taking French lessons) that is also savvy about the wine list and able to recommend some impressive glasses. \n\nCons: Really only minor issues, like the bread used for rillettes and cheese being a little dry, and the crispy artichoke salad needing a little more acid and a few more veggies to liven up things. Food isn't quite mind-blowing, but it's undeniably solid.\n\nVerdict: A nice low-key bistro that's worth visiting.", "author": "Jeff O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-07", "description": "Sometimes when you live in NYC you feel like you've tried it all. I mean, what can be so surprising? But here it is. No matter how spoiled you are with good food, Bacchus is definitely worth checking out. Let's start with a tastefully worn out interior. At other places that bothers me sometimes, but here it comes absolutely organic, feels like this is the only way. So the correct way to put it is \"vintage looking\" place. \nThen comes notable wine menu, with a great selection from small chateaus to well known brands (though, definitely try wines from the smaller winery, they really try harder, and it does show).\nAnd, of course food. Other places will serve you onion soup, of course. But here this dish is done so right- it will take your taste buds on a trip to Paris.\nMy main course was mahi-mahi, and though it sounds fairly simple- it is anything BUT simple. The chef plays oh so beautifully with a combination of pan frying and baking, and adds some delightful bed with a mix of sweet potatoes and lump crab meat- sounds overly sophisticated maybe, but it this mixed, layered flavor makes me want to come back to Bacchus again and again.", "author": "George T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-08", "description": "Thankfully, Bacchus had exactly what I felt like eating on their menu.  A tasty steak with homemade fries and a big salad.\n\nAdded to that, the mushroom sauce was divine and washed down with a red wine - perfect meal!\n\nHusband loved his beef cheeks and  we also ordered a tasty Mac and cheese for the little one.\n\nRestaurant had very pretty interiors, ambient lighting, music and a nice romantic vibe (even though we had a child in tow, it was still pleasant).  Friendly service too.", "author": "Elizabeth S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-01", "description": "Waivered on 3 or 4 stars here but settled on 4. This place is inviting and the outdoor seating area is shady and charming. I had the quinoa salad which was EXCELLENT. My wife had the grilled chicken sandwich which seriously lacked flavor but the fries were hella good and it came with a nice salad. This place might not be a place I race back to but if I'm in the neighborhood, I'd definitely eat here again.", "author": "Harvey K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-01", "description": "Trying to cure a craving for a croque madame, I came to Bacchus and it's become my go-to brunch spot. \n\nIts laid back atmosphere and backyard patio make it so nice to just sit and enjoy your cup of coffee or mimosa. I haven't found something on the brunch menu that I don't like yet. My favorite might still be the croque madame, but the sweet options are good also.", "author": "Michiko F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-23", "description": "J'aime J'aime Bacchus...et les gents la.  I was there last night, I arrived early and my date was gonna join me later.  The guys were amazing, so nice and attentive.  The food is really good and you cannot beat the wine list.  I asked my waiter for a wine to taste and he brought me the glass full, but the wine was great and went perfect with my salmon.  My second time here and will definitely be back.", "author": "MP D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-03", "description": "This place is PERFECT for any intimate, special occasion.  This past weekend we hosted a baby shower in the back garden.  From the delicious food to the great and reasonably priced wine selection to the beautiful rustic decor, I would highly recommend this place.  They have heating lamps and a retractable roof, which was an added bonus.\n\nMeryl (the coordinator) is the best.  She was understanding, reasonable, accommodative, and professional.  Her staff was on point and our day couldn't have been better.  THANK YOU Bacchus, Meryl, and staff.  I will be back.", "author": "Lily T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-04-15", "description": "Only because I love this place and I want it to thrive am I breaking this sad news. My husband and I went for dinner before a movie at BAM, and the service and kitchen were off. It was early in the evening, too, so they were not slammed busy.\n\nFirst, we sat at the bar area tables to the front. The host was so slow to greet diners that they would just walk up to our table while we were eating and stare at us with confusion. They must have thought we were employees in the absence of real staff.\n\nWhen we first sat, nobody brought us menus. I was looking under the table for a hook to hang my bag and coat on. The server kept yelling down at me do I want tap, sparkling or still water. Unless I specify, tap is fine. \n\nI won't even rehash the whole thing, just the usual, taking plates before people are finished eating then taking your sweet time bringing the check. All that good stuff.\n\nThe real crime was the food. Risotto with shrimp was the special. The risotto was inferior quality rice, probably meant to cook faster. It was not cooked with good stock, and it skimped on cheese. Worst of all, the shrimp was not fresh.\n\nMy grilled salmon was flat, salty and crispy on the edges. The julienned vegetables beneath it were limp and oily. All the while, the price made me expect better.\n\nIn the end, we skipped the movie and went to Brooklyn Tavern where we drank enough vodka to kill any food-borne bacteria and bleach the memory of that meal. I slept through my alarm the next morning and missed my flight.\n\nMy previous experience here was so good. I was shocked by the about face. Let's hope Bacchus gets it together.", "author": "Ginger P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-07", "description": "I'm so surprised I haven't rated Bacchus until now - probably because I don't want the rest of the Brooklyn to discover this gem.\n\nBacchus is always a wonderful experience. The $28 three course prix fixe menu is great (and includes a steak!), although I would suggest exploring the regular menu options and the specials. Everything is very reasonably priced and delicious.  The wine list offers some great options at a variety of price points.  The service is impeccable - prompt, friendly, and sincere.  There is a beautiful backyard, perfect for al fresco summer dining.\n\nI've attended and hosted a number of parties at Bacchus in the garden. They offer great party menu options, suitable for a variety of budgets and tastes, and also will reserve an indoor space as a 'rain back up.'\n\nDefinitely give Bacchus a try! It is likely to become your favorite neighborhood restaurant as well.", "author": "Jennifer N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-08", "description": "The sizzzz-ack!  Great food, good service and nice environment.  Keep up the good work and try to get more selection for Vegetarians..  That would be good, but all is good.", "author": "Marquis W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-28", "description": "Came here for a group dinner of 15. The space was a little tight but the food and service made up for it. They have a 30 dollar 3 course pre fixe which is a pretty good deal. For apps we ordered an artichoke salad (good)!and escargot (avg). For mains I ordered a beef tenderloin with mushroom sauce and my husband ordered a pork belly. Both were very good. Order the pork belly if you have no concerns about cholesterol! I wouldn't consider it authentic French , but dishes were Americanized in a good way. \nEvery single guest at our table was happy with their meal. The portions are pretty big and prices very reasonable. Desserts were good and well portioned. The female server was extremely efficient and seemed to be the only waitress in the entire restaurant. However she still kept up while there was another party of 15 there also. \n\nThis is definitely a neighborhood gem. Their adjacent cafe is really cute for brunch/coffee but it seems like it's closed for renovation. Overall good experience and ambience is typical of a cozy brooklyn restaurant. Would be a good date place too.", "author": "TIFFANY C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-24", "description": "Superb!  \nI am so thrilled to have found this restaurant after frantically searching for one in Brooklyn with a lunch menu that was special enough to celebrate Christmas with family at noon on Christmas Eve.  \nThe mussels, hanger steak, burger and lamb were all deliciously rich. And, as expected, the bread was terrific. \nAfter reading other reviews, I would avoid times when the restaurant was busy, but I suspect some were written by people who just want to keep this gem to themselves. \nWe found the service attentive and the ambience relaxed. The staff and decor were charming and the wine list was excellent. \nI look forward to sampling more of the menu with leisurely lunches in the future and we definitely intend to make Bacchus part of our Christmas tradition again next year.", "author": "Sammi V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-29", "description": "Excellent service and food and a good deal to boot. The hazelnut chocolate cake was to die for. Nice wine list but no liquor.", "author": "Lewis D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-04", "description": "Came here for an organized baby shower and on a really rainy day, they did a great job accommodating everything. The food was great and I'd definitely come back to try brunch and dinner.", "author": "Tony T."}], "servesCuisine": "French", "priceRange": "$11-30", "name": "Bacchus Bistro \u0026 Wine Bar", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "409-411 Atlantic Ave", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/oriVKWBIxKF0EQiVu8iVqg/ls.jpg", "@type": "Restaurant", "telephone": "+17188521572"}