{"aggregateRating": {"reviewCount": 439, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-28", "description": "Fancy air with some hard rock tunes. They have French beer on tap and they serve their water from a nice but nondescript bottle.", "author": "Dominik D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-03", "description": "Wether it be for diner of for brunch, bacchus is a nice place to go! They have a great wine selection and their dishes are always  well prepared.", "author": "Yann B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-28", "description": "The food, service, and ambiance are all incredible!!! I have season tickets to the Islanders, so Steven and I sometimes go to dinner before a game. We've exhausted the restaurants nearby the center, so I decided to branch out and boy, were we glad! First of all, the staff were all incredibly hospitable and kind. The food was immaculate as well; we started with the mussels and subbed the french fries for spinach. I had the branzino and Steven had a steak dish, can't remember exactly. We were SO happy with this place and will definitely return, especially in the summer when their back porches are open :)", "author": "Paige H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-23", "description": "I came here with my brother, and holy crap this place blew my expectations out of the water. We started off with the most delicious escargot that was tossed in a light pesto aioli, then I had the night's special: leg of lamb in a redwine reduction with mashed potatoes and pan-fried string beans. My brother got the hanger steak with sautéed mushrooms and crispy roasted potatoes. Of course, whats his is mine and whats mine was mine, so i endulged in both dishes. Although the meats couldve been cooked to a better temperature one was too rare and the other was a bit overcooked than preferred, the dishes were anything but disappointing. highly recommend the escargot.", "author": "Seung S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-12", "description": "I came to Bacchus with a group for my birthday, and was not disappointed. The food is decadent and fresh, and the service also great. We sat outside in the string-light-lit courtyard garden which changes from peaceful to lively when the sun goes down. It felt like we were just off a rue in France, not Atlantic Avenue.\n\nWe started with charcuterie \"Assiette de Charcuterie\", an assortment of meats and cheese (3 for $16) and chose from the daily selection: Serrano ham, a Camembert, and a Comté.\n\nWe also got the crab cake \"Gateaux de Crabe\" $12.50, which was perfectly crispy on the outside and crab-alicious and tender on the inside. The sauces on the plate were a fiesta of spice and flavor.\n\nFor my main course, I got the self-pronounced \"summer vegetable gnocchi\": Gnocchi Au Fromage de Chevre et son Beurre de Sauge, $16.95. Literally so delicious with homemade potato morsel goodness and a rich sauce over fresh soft veggies and goat cheese.\n\nI would highly recommend Bacchus to anyone looking to celebrate or impress a date in the Boerum Hill area. If you've got a pretty penny to spend, it is absolutely worth the price.", "author": "Kaitlyn R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-22", "description": "My wife and I have been coming here for years. Great little neighborhood gem. Any season. Any occasion. Authentic french cuisine. Great food. Great people. Lunch in the summer on the patio is wonderful. Cozy little bar for drinks. Romantic dinners. Private events. We've done it all and have always been treated like family.", "author": "Carl G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-17", "description": "Awesome customer service. The food was great as well. We had a nice cozy birthday dinner as a family.  The outside ambiance was beautiful matched with wonderful spring/summer weather.", "author": "Stacy R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-10-03", "description": "Just wanted to grab wine with friends, but suddenly couldn't talk above a whisper because there was a sudden... WEDDING there in the yard. Next to our table! Um? \n\nNo one at the restaurant gave us service for over 30 minutes, because they didn't want to disrupt the ceremony. No signs, and no one told us as we were being seated. \n\nAwkward for all involved.", "author": "Sam H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-13", "description": "Held a co-ed baby shower here for approx. 50 guests in their outdoor patio area. We had an amazing time and our baby shower turned out better than expected!\n\n- Meryl (event coordinator) was a pleasure to work with and was very responsive via email.  The entire staff at Bacchus was very accommodating in helping us set up the baby shower decor on the day of the event. \n\n- We opted for the food to be served buffet style as we wanted a more casual atmosphere for our guests to be able to mingle. A lot of our guests raved about the food! Bacchus also offers a variety of food and drink packages at affordable prices.\n\n- Their outdoor patio area already comes decorated with string lights along the walls and white drapes across the ceiling.  The area also has a tarp and there are heat lamps available for cooler weather. We're so glad the tarp was available as it had started to rain midway through our baby shower, but the staff at Bacchus were able to have the tarp set up very quickly and efficiently.\n\n- We comfortably fit 50 guests in the patio area, with half the guests standing and some were seated at small bistro tables (6 tables with 4 chairs set up around the perimeter of the area).  Although Bacchus did mention that they are able to seat up to 80 guests if you want a more formal seated lunch/dinner.\n\nIf you're looking to plan an intimate private event, we would definitely recommend Bacchus!", "author": "Florence K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-14", "description": "DO NOT DO ANY EVENTS HERE\n\nThe first time I was here I almost wanted to leave a 1 star review because of really bad service and okay food. \n\nThe second time I came back and boy it was the same thing.\n\nFirst time I came for a private event where we booked a side of the restaurant for a private event for work and the second time it was for a private event with family and potential inlaws.\n\nBoth times the service was especially horrible. The food was okay, but lets just say I asked for mayo with my entree. 20 minutes into eating my entree I finally get mayo. Bad service definitely not returning to do any events.", "author": "Jin C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-10-08", "description": "Stumbled upon this place while strolling through Brooklyn.  We didn't have reservations, but they kindly seated us next to their patio seating, which was nice.  The weather was beautiful, so I definitely didn't mind at all.  The place is dimly lit and very cozy and romantic.\n\nService was great during my visit.  Our waiter was very attentive and very cheerful.  The establishment was clean.  \n\nAs for the food: we opted to have some wine and appetizers.  Didn't order any entrees.  The wine was good.  The food was decent.  Obviously it wasn't memorable, otherwise I'd be able to give you a play-by-play on the food that I had ordered.  Good, but not great - as far as their appetizers being served while I was visiting.\n\nI wouldn't go out of my way to visit this place the next time I'm in Brooklyn, but if I'm in the area, why not.\n\nEnjoy.", "author": "Diana L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-28", "description": "Amazing food and experience. I sat outside and loved the outdoor interiors and vibes. The food and service were also amazing. I ordered the truffle soup which was incredible and also the smoked salmon sandwich may have been the best sandwich I've ever ate.", "author": "Amanda P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-30", "description": "I love this place amazing food, staff and a great venue for my friends Bridal Shower Brunch. The patio area was adorable and it felt as we were in a real little garden. Great job!!. Planning to visit again soon!", "author": "Anais G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-09-10", "description": "Dead cockroach (looked squished) on the floor next to my table. No one bothered to clean it up until I asked a busboy to do so. Food was par, but cleanliness should be a restaurant's #1 priority.", "author": "Amy Z."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-12", "description": "Bacchus is a really charming spot to grab brunch. It has enough indoor and outdoor space for a group and but still has an intimate feel for any one on one occasion. I went with a group for brunch and opted for the unlimited mimosa brunch special which included any item on the menu for $30. Split between the steak \u0026 eggs and crab cake benedict, I decided on the latter and was not disappointed. While the English muffin does dwarf the size of the crab cakes, flavors were spot on and I was big fan of the hollandaise and side of potatoes. Worth the trek from Manhattan, this place is sure to impress any date or friends who do not venture to the area often.", "author": "Stephanie S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-01-29", "description": "I went here a few weeks ago for dinner and found the food was fine, but not exceptional. Given the prices and decor, that was a bit of a let down. I ordered a lamb entree (pictured), and the lamb was bit tough. The carrots were not 100% cooked through, so the potato/carrot mash had a bit of a texture that I did not love. The chocolate lava cake was great, though it did not blow my mind.\n\nCertainly if I lived in the area I would be back, but I don't think this place is worth traveling to from other locations. It's a decent/serviceable establishment. The wait staff is fantastic. And maybe the issue was really with what I ordered. But overall I had a good time, but didn't leave feeling I loved the meal.", "author": "Racquel R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-10-29", "description": "Really disappointing brunch. Had a smoked salmon benedict and the English muffin was soggy and the smoked salmon had a tangy vinegary taste. Hash browns weren't that great, either. I was really hoping  to like this place since it's close to my home and seems like a good space but wasn't happy with my meal and my friends weren't either.", "author": "Carol L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-16", "description": "Great neighborhood French bistro. Great food and great atmosphere, with reasonable, bistro appropriate prices.", "author": "Natasha N."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-02-03", "description": "I recently had dinner at Bacchus.  I went  specifically to  have the cassoulet because I am a big fan.  When the cassoulet came out the duck confit was still cold so I sent it back , when it returned  the duck confit was lukewarm and the beans to hot to eat.  It also turned out to be over salted.  Two members of the wait staff noticed I was not eating it and asked if everything was OK.  I said no, it is over salted.  One said they would tell the chef, the other said they would tell the manager.  I did not hear anything from either one of them.  Neither server offered another dish or to take it off the bill.  I will not be back.", "author": "John S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-13", "description": "We were looking for a brunch place to go to, but since it was last minute (as in, a Wednesday and we wanted to go to brunch on a sunday), most of the restaurants were already booked. Thankfully Bacchus was able to accommodate our party of four. \n\nI had a Bellini and crab cakes Benedict. The Bellini was not anything to write home about. The crab cakes were really delicious though- keep in mind that it was my first time ordering the dish, but I was pleasantly surprised. All in all, I would recommend this place, but maybe don't take advantage of the", "author": "Roksolana K."}], "servesCuisine": "French", "priceRange": "$11-30", "name": "Bacchus Bistro \u0026 Wine Bar", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "409-411 Atlantic Ave", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/oriVKWBIxKF0EQiVu8iVqg/ls.jpg", "@type": "Restaurant", "telephone": "+17188521572"}