{"aggregateRating": {"reviewCount": 439, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-01-26", "description": "I had high expectations after seeing the wonderful Yelp reviews and took my family here for dinner. My party of 8 arrived at 7:30pm and was seated promptly. The service is wonderful and quick but I came here for the food and that was lacking. \n\nWe started off with two orders of mussels and fries and seafood ravioli. The mussels are under the entree section but we order it as appetizers to share. They were good although the white wine broth was a little bland compared to the tomato herb one. The seafood ravioli was nothing special and overpriced for the portion. Here are the entrees we ordered for the night:\n\nHomemade pappardelle - pasta is fresh but sauce was lacking\nRoasted 1/2 chicken - good flavor but a bit dry\nHanger steak - steak cooked perfectly with mushrooms and roasted potatoes\nlamb - my least favorite dish for the night\n\nEven though food was a bit disappointing, service was great and I commend them on that. It's not easy to please every customer's palate but an attempt was made to ensure our satisfaction was important to the establishment. I would like to try this spot again in case they were having an off night the day I went.", "author": "Julie C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-03-09", "description": "I gave this place 3 stars because the food can be ok..depends on the day..\nThe service is atrocious and the attitude worse.\nThis is Brooklyn not Paris..", "author": "Sonja G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-11", "description": "A five star review and I didn't even have any wine at this wine bistro! \n\nI was recommended here by a friend who is a brunch enthusiast. \n\nAt first glance, the menu was disappointing because I didn't see the crab cake Benedict that was mentioned on some yelp reviews. The hostess explained to me that the menu items are rotated every few months :0 \n\nThe menu may not have many options but the food and presentation were amazing. For $11, I got an impressive French toast dish called PAIN PERDU CROUSTILLANT, which is described as a Corn flakes crusted French toast with Grand Marnier Sabayon. It was huge! The bread was a soft baguette, unlike the usually thick sliced bread most places use. The sauce is a very sweet, thick custard flavored with vanilla, Marsala wine and Grand Marnier. \n\nThe waiters were very attentive and the restaurant has great ambience as well. The noise level is perfect for carrying on a conversation.", "author": "Wendy Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-10", "description": "Excellent choice for those going to or coming from BAM or that love traditional good quality French restaurant experience. The staff was warm and accommodating. We let them know we had 1 hr only to dine and it was no problem for them at all to seat us and serve wine and two courses. The Beef Bourgogne and steak (hanger) were perfectly cooked and delicious. \nWe will def be back and recommend to friends. Thank you for being so accommodating, especially because it was secretly my birthday too!!:)", "author": "Sadie W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-26", "description": "Five years later, having been to Paris and back to Bacchus many more times, and it turns out I can confirm that I was right the first time around. Bacchus is Brooklyn's perfectly imperfect incarnation of what I found France to be like.\n\nBy this I mean that their atmosphere is still essentially perfect. I continue to spend warm evenings in their beautiful back garden which, when the sun goes down, is illuminated by lights strung in and around the central tree. More often than not, the air is filled with old men yelling in French, and everyone you encounter has a lilting accent. \n\nWhile the food is still occasionally inconsistent, their average has crept up over the years. On a good night, the lamb shank special will be truly special, the burger is a perfect medium rare, the steak frites with the peppercorn sauce are everything I ever wanted, the seared branzino piccata is tart and beautiful, and the mushroom ravioli rivals the best I've ever had. \n\n(My girlfriend of 2012 is now my wife, and these days she looks at me with a level of disgust usually reserved for homeless men that poop themselves in the subway whether or not I've dropped a ravioli on the ground.)\n\nAnd on a bad night, Bacchus is still quite tasty.\n\nThe Beef Cheek Bourguignon is a rich, fatty and ultimately satisfying peasant meal that deserves to be sopped up with bread, and the half-chicken is quite good if you're feeling a bit boring. Starting with the pear and goat cheese stuffed beggar's purse is never a bad decision, and the small plates (crab cakes, the tuna tartare, and the foie gras are nice) are another route if you're not interested in a full meal. If you are hungry, the AYCE mussels on Tuesday nights are well worth it.\n\nWhen you need a sweet finish, I'd roll with the excellent creme brûlée or the tarte tatin, although I'm told the profiteroles and the chocolate mousse are quite good as well.\n\nAs we encountered in Paris, the service can sometimes be perfunctory. While most of the staff is friendly and genuinely welcoming, they are more than willing to leave you alone all evening, which is entirely European of them. The space is too beautiful, and life is too good to worry about it though. Just relax, enjoy your meal and a bit of conversation, and smile at the little French kids playing in the street as you leave.", "author": "Peter D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-08-13", "description": "I was pretty disappointed by the food at Bacchus. I ordered the cassoulet. The chicken tasted reheated and stringy. The sausage was kind of bland, and the skin on the beans was too tough. The bouillabasse was also bland.\n\nSerivce was spotty. Wine was pretty good.", "author": "Adam R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-11-02", "description": "I'm always looking for a reason to celebrate but didn't have to look any further when my baby achieved the top score in his class on his very first, in life, math assessment. I chose Bacchus for this special occasion because it's French, I'd been there for lunch and wanted to try selections from the dinner menu. Also, I liked the ambience and attentive service during lunch and the wine was great too.\n\nThe food--especially the salmon--hit it off with us tremendously. My son devoured his salmon entree. Looked so good and included lots of veggies which he picked at for more tiny bits of salmon--just like his mama: loves fish! But the macaroni and cheese, he left for me. He said it was \"too French.\" And that's exactly why I love it. Lots of gruyere, I think. It was flavorful and beautiful with oozing, melted cheese of course. \n\nI had the crab cake and a glass of good Sauvignon Blanc, instead of the duck confit salad --which I really wanted. I wasn't convinced that the crab was fresh as the texture inside was mushy, not flaky, as if the crab meat had the cardio work out that I need in my life or came from a can. It tasted as if the crab was mixed with too many ingredients and mixed with a heavy hand. \n\nThe service started off well. I saw my friend from the lunch I'd had there before. Very sweet, very hardworking, always willing to please, bonafide French gentleman bartender. Unfortunately he didn't serve us and we instead had to share service (snooty) with the swanky private event that was happening in the gorgeous outdoor space. \n\nI can't front. I was jealous! How could I not be, especially when, at one point, every one that worked at the resto was brought over to cater to the private event's guests, even though us regular patrons were still eating at several tables. The manager was nice enough to check on us at that point. \n\nBut we heard nothing from our waitress since we ordered our food and drinks. Not even a how is everything?! After we ate and asked for the mac-n-cheese to go, we asked for the check from the bus staff, waited to no avail for twenty minutes, and headed to the bathroom. We took a bit longer than usual (about 7 mins) and when we got back to our table everything had been cleared away and was ready for a new party of two.  \n\nI'm still unsure of how I feel about that. \n\nThen I asked again for the check and the stuff we asked to be wrapped. We walked to basically the front of the resto and sat at a high bar table to wait yet again for the check. \n\nI was all ready to give this place 4 stars but the way the experience ended soured my overall perspective of Bacchus. \n\nI'll be back to try the duck confit though...", "author": "Michelle W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-11-27", "description": "Went here for brunch. It was okay but not a place I would go back to again...at least not for brunch. Firstly, if you just want the usual brunch foods this isn't the place to go. They have things like quiches, stews and croques on their menu but they also have a couple plain brunch items.\n\nI got a burger and my boyfriend got an omelet. The burger was okay but nothing to call home about. I was the most excited for the giant slabs of potatoes that came on the side but they were so over-soaked in oil that I didn't really want to eat many of them. Omelet was also okay. \n\nServer was friendly but not the most attentive. I've definitely had better brunches for less money elsewhere. Maybe their dinner menu is better.", "author": "Carley P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-27", "description": "Visiting from Los Angeles to see family and they brought me to their favorite neighborhood French restaurant.  We ate early Wednesday at 5:30 PM for the 3 year old and 2 month old children and the management were helpful to seat our party of 5 in a roomy booth near front entrance.\n\nWe all thoroughly enjoyed New England clam chowder - fresh, fragrant, full of fresh vegetables; fried artichoke salad - crisp greens, crunchy artichokes; escargot - bathed in fragrant garlic and star anise butter; duck confit cassoulet - succulent marriage of meat and beans; lamb shanks - wine braised, tender, flavorful; Angus hanger steak - tender, beefy with mushrooms, potatoes and wine sauce.  \n\nStaff were friendly, attentive, kept glasses filled and table cleared, appreciative of our business.  Best meal of my visit and will be back every visit.", "author": "Ham S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-04-04", "description": "Over hyped, over priced restaurant with mediocre quality food. And the worst service you can ever get at a restaurant. Stay far away from this place unless you want to wait on yourself. Over an hour and a half waiting for food waiter disappeared.", "author": "Steve M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-11-05", "description": "Of course food quality is important but what irritates me the most is the lack of common sense and hospitality of employees.  We came in as a small party of 2.  We were told that there was a wedding in the adjacent room and that the outdoor patio was not available.  Our only option was sitting in the main room so we agreed.  There were several empty tables of 4 available but we were told that we cannot sit there since we were only 2.  Fine, we agreed.  I'm not a small guy so the table made me feel like I was sitting at a desk in 1st grade.  The wait staff saw that I was uncomfortable but conveniently did not attempt to remedy the situation.  While going to the bathroom, I noticed that the adjacent room did not have a wedding and there were actually 2 guys having dinner.  That room was about 90% empty so we could have certainly been seated there.  The outdoor patio was also empty with just 2 or 3 occupied tables.  What makes this situation even worse is that while we were eating, the available tables around us remained empty and were even empty when we left.  Lying to customers about closed off sections of the restaurant when they are actually available, and refusing to allow a larger table because a bigger party \"might\" come in doesn't seem to portray the kind of hospitality that restaurants strive to achieve.\n\nIn terms of food, it was very much below par.  I ended up with a poached salmon.  It was extremely small and had absolutely no flavor.\n\nWe avoided sticking around for dessert.", "author": "Leonard G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-06-24", "description": "I was at Bacchus last night for a wedding. From the outside, it doesn't look like much. But looks are deceiving. The outdoor eating area is surprisingly large and the menu has enough of a variety to please most, if not all of those who walk through the door. On the same thought, the bar serves a nice variety of alcoholic beverages. \n\nI recommend it.", "author": "Adina B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-02-15", "description": "Went here yesterday for Valentine's Day. The service was subpar. When we came in , the guy behind the bar just stared at us and didn't ask if we were being g helped.  On top of that One of the staff visited the other tables in our section with white patrons but he didn't bother to acknowledge us. My boyfriend and I were the ONLY Black People in the area and I felt discriminated against. In BROOKLYN of all places. The food was also subpar. I've had way better duck at other places. It was bland and the sauce it was paired with didn't work well at all. The salad my boyfriend had was good. The lobster bisque was ok. But the overall experience left me not wanting to return. This is not the way to treat people.  You come to our neighborhoods and think you can treat us as if we no longer belong there is not going to fly. Your business will suffer if you think White People are the only ones who deserve good service. I'm very disappointed in this establishment and will be taking this up with my credit card company.", "author": "BC D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-18", "description": "After moving to NYC, my mom stumbled upon this quaint but sophisticated restaurant by word of mouth. I have eaten many places but was blown away by this. Fantastic selection of wine, French onion soup was used with sweet onions but so delicious, and I had the chicken with asparagus and potatoes. I have never had more moist chicken in my life. I talked about it all night. The CUTEST little back garden/hangout/patio where I got to watch a small wedding from my seat. I will be back many many more times.", "author": "Madison S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-09-09", "description": "Okay food, but the service is off. No water refill, nobody asked us if everything is fine or we need anything. We felt like we were ignored for the entire time.", "author": "Jingqiao H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-03", "description": "Bacchus is located on Atlantic Ave. in Brooklyn.   There is street parking (pay until 7pm)  in front of the  restaurant.  As you enter, there is a bar followed by interior seating and outside is the garden seating.  The lighting is dim which makes reading the menu a challenge.  The service was great from the welcome as we entered and throughout the meal.  The waitress was very helpful to us in choosing a wine and providing information about the food.  We decided to start with the special appetizer that was scallops with pistachio and a sauce.  It was delicious.  All three of us had the lobster bisque.  It was very rich and tasty.  For the entrée, I had the special which was branzino in an orange sauce.  It came with the skin on and there were 2 nice pieces of fish.  The fish was on top of sliced vegetables-due to the dim lighting not sure of all of them but some squash and possibly mushrooms or eggplant.  The taste was nice and I enjoyed it.", "author": "Betsy B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-30", "description": "I had my bridal shower yesterday at Bacchus in the private indoor room. It was a great setting for a bridal shower, the staff was really friendly. Also, the food was amazing. \n\nThe only thing I would say is if you are having a private event ask the staff in advance to print out a \"Private Event\" sign to paste on the door because depending on the direction you are coming from it may be the closer entrance.\n\n But the room was very nice and it had a sliding door to separate it from the other room and it had its own bathroom. I had 29 people and we set very comfortably in that room. Another perk was the arrangement did not restrict anyone who needed to get up and move around. \n\nFOOD - The smoked salmon sandwich and crab cake were delicious. The smoked salmon and goat cheese combo I would have never thought of but I'm so glad I had that. My mouth is watering just writing this review.", "author": "Tanya G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-04", "description": "Delightful cozy and delicious.  Lamb shank was wonderful and the mussels sweet and tender", "author": "Michael G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-24", "description": "Bacchus, meaning God of Wine, is certainly well equipped in the wine department. A romantic vibe, with lots of candles and dim lighting and friendly staff. Although we did not eat, the menu did look appetizing and we noticed they have a special mussel night on Tuesday's that I would love to try out sometime. The wine by glass is around $10-12 which I would say is fairly average for NY and the knowledgeable staff make it all the more worthwhile.", "author": "Matthew B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-28", "description": "We got married at Bacchus and all thanks to Meryl it was a phenomenal experience from start to finish!\n\nThe restaurant is charming and beautiful, the food is amazing, and the outdoor patio fit our 110 guests with plenty of room to spare.\n\nThe planning process was exceptionally easy. We were trying to plan our wedding from across the country, and we were able to do so because it was very easy to be in touch with Meryl by email. \n\nAll of our guests raved about the food and enjoyed the open bar. The service was phenomenal -- I don't know how they were able to feed 110 people at the same time without requiring pre-orders, but they made it look effortless.\n\nIf you're looking for a place to eat or a place to get married you should definitely visit Bacchus. Meryl made our wedding amazing and we are so grateful!", "author": "Justin G."}], "servesCuisine": "French", "priceRange": "$11-30", "name": "Bacchus Bistro \u0026 Wine Bar", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "409-411 Atlantic Ave", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/oriVKWBIxKF0EQiVu8iVqg/ls.jpg", "@type": "Restaurant", "telephone": "+17188521572"}