{"aggregateRating": {"reviewCount": 439, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-08", "description": "I read a lot of reviews on this restaurant and we decided to go there for dinner. \nWe were seated inside but I wish the girl would have mentioned their garden. I completely forgot about it. But at 630 on a Tuesday evening, Loved having almost the entire place to ourselves.\nMy husband and I started off with the Salade Bacchus.  It was good but didn't have enough dressing, was super dry at first. We asked for more dressing and it made a huge difference. We also decided to try the Escargots dish for the first time ever!!! Literally our first experience eating escargots.  All reviews were saying how amazing the dish was. After being grossed out, I gave it a try. The only thing I will say is anything tastes better in butter/with butter. I wouldn't order it again. It's an acquired taste for sure. We ordered their bottle of Pinot noir. Ahmazing! \nFor our main entree, my husband had the gnocchi dish.  Best Gnocchi we have ever had!!!!\nI went with the hanger steak - L'Onglet.  Phenomenal dish! Hands down one of the best steak dishes.  Highly recommend.  Based on the deliciousness of our main dishes, this place deserves 5 stars. I can't wait to go back and try other dishes. I have to say this is our 3rd or 4th French restaurant that we've been to in the area and Bacchus takes the 1st place!", "author": "Nika V."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-09-20", "description": "Great ambience with dim lighting and main dining area that opens to a cute backyard. We went on a Tuesday night and got the following:\n\nAppetizer: salad with duck confit - salad was okay.  Some pieces of the duck were a bit overcooked so we left those pieces alone. \n\nEntrees: my friend and I got the all you can eat mussels (Tuesday nights). The mariniere broth was tasty and plentiful and most of the mussels were moist. There was an ample enough amount that we didnt need to order more than the first pot. However, the mussels were small and shrunk considerably. I wonder if the mussels on a non buffet night would have been bigger. \n\nDessert: chocolate hazelnut cake with hazelnut ice cream - the ice cream tasted like it had ice particles, the cake was dull. The thick chocolate layer on top had a nice dense and chewy consistency, though lacked a hard, bitter bite that comes with a good dark chocolate. \n\nThe people sitting next to us had the beef bourguignon which looked hearty.  It's a great date place--I would go back to try some of the other dishes and something from their extensive French wine collection.", "author": "Kay T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-27", "description": "I was married in September 2017 at Bacchus and it was the most incredible evening!! The ceremony and dinner took place in the backyard which was like a beautiful secret garden and perfectly cozy. Afterwards, the party moved indoors for dancing. The food was incredibly plentiful and unbelievably delicious and they kept the wine flowing - multiple people told us the food was far and away was the best they'd had at a wedding. The evening went so smoothly thanks to Meryl and her staff, who seamlessly transitioned everything from ceremony, to cocktail hour, to dinner and finally dancing. Working with Meryl was a pleasure throughout the planning process, she was extremely accommodating and helpful. We couldn't be more thrilled with the wonderful evening, or the staff. And to top it all off, everything was extremely reasonably priced. Thank you Bacchus for an unforgettable night!", "author": "Alla B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-27", "description": "We had an intimate backyard wedding here in August, and it was absolutely magical. When I was first looking at venues, I thought this place was too good to be true- a Brooklyn restaurant that has no food/drink minimum, no time limit on the event, and no venue fee?!?  The entire experience, from our tasting and crafting of the menu, to planning the day of details, and finally to the big day went so smoothly and was even more than we could have imagined. Meryl, Alvaro, and the rest of the staff were so friendly and helpful, they took care of everything, including set up of all the beautiful decorations (that come included with the venue), the tent when it rained (the tent is also included), the music (we created a Spotify playlist and Meryl handled everything else). With their help, we were able to focus on what was important to us that day- a meaningful ceremony, great food and drink, and celebrating with our 70 guests in a gorgeous venue!!!", "author": "Sarah M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-02", "description": "We love this place, and we wonder why we haven't found it earlier.  Though it is a relatively small restaurant, the layout was charming and there is potential for outdoor seating in the coming warm months.  We came for dinner and after several rounds at the menu, we opted for the pre fixe options.\n\nEverything we ordered: duck rilettes, escargot, hanger steak, twice cooked pork belly, apple tart, and cappuccino ice cream.  \n\nThe apps came in the forms of escargot and duck rilettes.  We weren't too sure what rilettes were, but decided on it anyway, adventurous!  We're so glad we did.  The rilettes were shredded duck in a sweet sauce served with bread.  Layer it on sliced bread, and it was perfect.  The escargot was oily but it wasn't smelly, which was hard to do, so we appreciate it much.\n\nThen came the entrees of hanger steak and twice cooked pork belly.  The steak was perfectly cooked and flavorful.  Nice crust on the outside, juicy meat on the inside.  The pork belly was exactly what pork belly should be, half meat, half fat in a wonderfully refreshing sauce.  Nonetheless, the fat did get to us after a while so we had to scrape it off and finish the meat with the sauces.  Very, very enjoyable entrees.\n\nDesserts were tasty without being too sweet, we couldn't ask for better pre fixe options.  The meal was reasonably priced and abundantly filling.  No complaints against this great restaurant.  It's definitely a good idea to get a reservation ahead of time.", "author": "Leila L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-01", "description": "I must say that this restaurant is great ! The staff is completely French which made the experience even more unique/amazing. There's a really mellow vibe to the restaurant . The waiters and waitresses are all very polite . The food left me feeling full, but healthy . The dessert that I chose was very delicious . All of the flavors blended really well , and I was extremely satisfied with my meal. Seating arrangements in the restaurant are spacious and very comfortable. This restaurant is definitely worth another visit .", "author": "Cherishe C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-23", "description": "Dinner at Bacchus was much more authentic than I expected! The staff was French, the ambiance was romantic and dimly lit, and the food was phenomenal. By far the thing you should absolutely not miss on the menu is the beef cheeks in red wine sauce. The meat melts in your mouth and the sauce is hearty and rich, with carrots and other vegetables mixed in. Absolutely five stars!\n\nThe mussels were good too but not as wonderful as the beef. I tried the mussels au ricard - which was a creamy sauce made with large amounts of star anise. It was delicious and tasted of licorice. The mussels themselves, though, were on the small side and some were slightly dry. I have definitely had larger, juicier mussels in my life but perhaps it's just what is available and in season?\n\nFor appetizers, both the escargot and the prunes wrapped in bacon were lovely, too. Overall this is definitely a 4.5 star restaurant. We really enjoyed it and will return!", "author": "Sol C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-28", "description": "Lovely brunch spot particularly if you can sit in the garden, it feels as though you are a world away from Atlantic Ave!\n\nWe also had a party there recently on a Friday night and they couldn't have been more accommodating; setting up a table for 18 and dealing with us both patiently and a smile!\n\nA good wine list and consistently good food mean I keep coming back. The menu is French Bistro style so it's rustic but delicious in it's simplicity! Some highlights have been Beef Bourguignon, Cassoulet with Duck Confit, and roasted bone marrow. Apparently they do dessert as well, but I've always been too content by then......", "author": "Gavin P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-11", "description": "I'm a sucker for French cuisine, with that said, Bacchus offers the best in Brooklyn. \n\nThere is plenty of wine, but you already knew that. Let's talk food. It's good, really good. The pork belly is nice and crispy, the escargot is good to go. If they're offering clam chowder. Get it.  Goat cheese gnocchi, whoa, I could eat that everyday. I could go on, but you should go try Bacchus.", "author": "Mitch K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-02", "description": "The food was served in a timely manner and the food was delicious.... the service was great ... wine selection was also amazing ....", "author": "Donna D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-13", "description": "Spot on.\n\nI came to Bacchus for a private event this morning for brunch. This was an engagement party and a section of the restaurant (including the outside patio) was exclusive to the event.\n\nAll the guests, including myself, were treated so nicely from the moment we arrived. The staff was phenomenal: they were super friendly and anything that was needed was taken care of right away.\n\nThe food was outstanding. From simple salads to egg and cheese quiches, everything was delicious. On another note, I really don't like mushrooms at all but they served a mushroom filled ravioli in a cream sauce that I could not have enough of.\n\nI only hope that the quality of service for a private event carries over to regular dining (which I don't doubt). This is a great restaurant for a date and I wouldn't hesitate coming back with my wife to try their dinner menu.", "author": "Justin S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-30", "description": "The best French onion soup I have ever had.  The service was excellent, overall the food was amazing, and the atmosphere was very nice and quiet - not loud like some NY restaurants.\n\nWe had a Cote de Rhone and the house bottle was 35 and very good.\n\nOverall the value for the dollar was excellent and I will be back again.", "author": "Brian G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-12", "description": "came here for my friend's baby shower event. this place was quite lovely. She booked for an outdoor event but it turned out to be cold and rainy that day. Luckily, when we entered the restaurant they were prepared for the bad weather. They had a tent with portable heat stands and hanging heaters set up for the guests. the service was a bit slow. some of us didn't even get a drink and or water refilled. We didn't mind it that much since we were all preoccupied with the event. One good thing was that there was a never ending supply of bread (thank you to the mom to be who loves bread!). For the app, we all had some sort of duck pate on top of bread. I ordered what looked like an open face ham sandwich w an perfectly cooked egg on top (it came with steak fries). the main course portions were huge! I had the tiramisu for dessert. My friend had the apple tart which wasn't as tasty as the tiramisu. \n\nOverall, this place was adorable and served good food. I'd probably want to come back here for brunch and even dinner.", "author": "Ruby L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-11", "description": "Provided our group of 6 with a quiet table in otherwise happily bustling bistro. My snails appetizer and cassoulet main were superb, with cassoulet a real standout among many ordered at NYC restaurants. Knowledgeable, welcoming, and responsive staff rounded out a memorable 3 hour meal at reasonable prices.", "author": "David B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-05", "description": "Bacchus Bistro is a charming neighborhood staple for brunch, complete with a backyard outdoor patio. I haven't been here for dinner yet, but I imagine its just as good. Bacchus Cafe or Bistro would also be great for ladies lunch, a first date, or small meetings. The cafe is next door: http://www.yelp.com/biz/bacchus-cafe-brooklyn\n\nMost of the staff are legitimately French - and I absolutely thinks its charming and they're lovely people. They're always friendly, good with the menu, and happy to help/ That said, the service is casual and they're not the type to rush. Come here to savor a moment, not for a quick meal.\n\nI usually order one of the quiches, but they also have benedicts, croque monsieurs/madames, salads, a burger, and larger plates. Almost everything comes with a small mixed greens salad with balsamic vinaigrette. I have liked everything I've eaten here. They also have a long wine list and solid coffee.\n\nThe space, however, is more memorable than the food. Bacchus is well located on Atlantic Ave and in the summer, doubles its seating by expanding into the backyard patio. I've seen birthdays, bridal showers, and family dinners happen in the back, where they can section off some of the space for large or private parties. The patio is beautiful, and has lovely trees and just the right ratio of sun to shade. \n\nPrices are fair for a Brooklyn brunch in a great location. All things considered, I'm here about once a month - Bacchus is my go to spot.", "author": "Suanne L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-16", "description": "Came here for a friends wedding shower. The service was incredible. And food was delicious! Highly suggest the fruit tart for desert.  I'll be dreaming of that...", "author": "Amanda B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-02-18", "description": "My girlfriend and I were extremely disappointed in the quality of the food and service on Valentine's Day. They served a special 4 course Prix Fixe menu, which was both underwhelming and overpriced. Lobster bisque was too rich and served cold in a glass. The foie gras appetizer was horrible - its consistency was like biting into a cold stick of butter. The filet mignon and my girlfriend's pork chop were bland and dry. On top of the poor quality of food, the service was unattentive and slow. We left unhappy and would never come back to dine here again.", "author": "Tom M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-18", "description": "***UPDATE*** \nMeryl and the entire staff at Bacchus is wonderful. Meryl and Alvaro made my friend's bridal shower on 6/11 a dream come true. There was a little bit of miscommunication in the very beginning, but that was all taken care of \u0026 everything went smoothly. I would definitely return to Bacchus for another event. The service, decor and food was excellent and if you drive parking isn't bad at all on a Sunday. Thank you Bruno, Meryl and Alvaro!\n \n\n\nI contacted Bacchus for bridal shower/private party info requesting a Saturday or Sunday for the month of June. I was told on March 19th Meryl, their event coordinator, would reach out and she did with pictures \u0026 menu options. We discussed dates, emailed back and forth on which days in June would work. I tried calling Meryl a few times as well since things can get lost in translation via email, but that was unsuccessful (she never answered my calls). Fast forward to the week of April 3rd, Meryl said we could move forward with the date requested and she would send us a contract. Contract was sent and I sent it back with my signature. I also went to visit Bacchus to get a feel for the space and put in the deposit. \nI was told Alvaro (Meryl's assistant) takes the deposits and would be in the next day. Of course, when I called Alvaro he said he didn't have my contract and would reach out to Meryl \u0026 call me back. Unfortunately, the last I heard from Meryl was April 6th. \n\nWe were so excited to have the bridal shower here and was considering this place for future events as well. Not sure what went wrong, but this experience was a big disappointment and totally unprofessional.", "author": "Amissa E. P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-03-22", "description": "I would love to start this review with how much I enjoyed the food and what a great party I had, BUT I can't because their customer service and event scheduling is the worst I have ever seen. It's like this establishment has so much business they do not care about mine. I tried to book a birthday party here for about 20 people. I contacted them via their website 5 days later no response. I called them the person told me sorry we do not take reservations the person that takes reservations she has some other job she is sometimes here wait for an email response. After no response I called again they told me call Saturday or Sunday after 5. I did that still nothing. Finally someone got back too me with a sheet of options they offer I emailed back immediately with a few questions as I was eager to order and understood that this person taking reservation has other jobs or whatever. No response 2 days later still nothing. Really unacceptable. What a great way to treat prospect clients. I believe in fair reviews and if someone treats me right I will rave about it but this is just upsetting. I guess I will have to look for a place that actually cares about my business.", "author": "Inna S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-11-05", "description": "This place was an absolute joke. The only thing giving them 1 star in my book is the ambiance other than that this place was completely no frills. My fiancé and I with another couple visited this restaurant for dinner prior to going to a concert at the Barclays Center. The whole experience took almost 2 and a half hours and we nearly missed the band playing at the venue. The restaurant was not busy, we were one of maybe 3 tables seated. 2 of the things that we ordered were \"out\" which is crazy to me considering it was nearly the beginning of a dinner service. We waited almost 20 minutes for the appetizer to arrive which was crazy considering we ordered soup and foie gras. In between the appetizer and main course we waited an HOUR! We were even making jokes that they must've been attempting to cook our food In the moonlight! No one came over to refill drinks or water or to ask how we were doing...nothing! My fiancé and I ordered the hanger steak which was measly and came with potatoes I could get at a brunch buffet. The other couple ordered a leg of lamb special....it wasn't special at all the meat looked gray and overcooked. They even commented that the mashed potatoes it was served with was nothing but potato, no salt, no butter, no nothing. By the end of the meal we were just waiting to get the check and get the heck out of there. It took them forever to drop the check but then hey never even came back to collect the payment. We actually ended up getting up and going to the bar to pay our check. At the end of it all we got mediocre food and unacceptable service. You could get better at your local McDonald's. Not worth the money by a long shot!", "author": "Alexandra S."}], "servesCuisine": "French", "priceRange": "$11-30", "name": "Bacchus Bistro \u0026 Wine Bar", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "409-411 Atlantic Ave", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/oriVKWBIxKF0EQiVu8iVqg/ls.jpg", "@type": "Restaurant", "telephone": "+17188521572"}