{"aggregateRating": {"reviewCount": 80, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-10", "description": "Decided to order from this restaurant for a last minute dinner that I was hosting at my house. I was put in touch with Dan who was very helpful in helping me to come up with a small catering platter. \n\nDecided to go with Chicken Kebab / Shawarma, grape leaves, sultan dip and falafels for about 15 people. The food got there just on time \u0026 was fantastic. \n\nHighly recommend this place. Amazing food for a reasonable price \u0026 great service. Definitely returning.", "author": "Mike L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-11", "description": "So glad to have discovered this hidden gem. The food tastes fresh and was incredibly delicious! The place is BYOB and has a very cozy backyard. We ordered 3 appetizers- greek salad, spinach pie and moussaka. For entree we shared a seafood dish with couscous. Everything tasted freshly prepared and perfectly seasoned. The only thing that needs improvement is the dessert. They didn't have most of the items on the dessert menu so we ended up ordering baklava, which we could have definitely skipped as it just was okay and too dry for my taste.", "author": "Tai M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-20", "description": "Awesome takeout tonight.  Got the mixed grill and mixed appetizer plate for 2 for $27 today. So much food, enough for 3 or 4.", "author": "Jing K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-07", "description": "Really glad I found this place! I had a really lovely dinner with my partner! We ordered the sultan meze which included the best falafels ever,  delicious cauliflower, really smooth and tasty hummus as well as the eggplant dip which was really delicious! I really enjoyed the tahini dip and the warm pita that they provided! As for entrees, my partner had the chicken kebab platter which looked sooo good!! I however had the chicken tagine and found it average. I thought it would have included more flavor\nand more vegetables rather than just potatoes. I was also looking forward to trying out couscous..Anyways, we both really enjoyed everything about the restaurant and will definitely come back once again soon! Also do try the mint tea!", "author": "Miriam W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-31", "description": "This is my go to for delivery but I thought I would pay them a visit for a change. They have some tasty falafel that is crispy on the outside and soft on the inside. My only complaint; the grape leaves tasted like they came straight out of a can. Tasteless and soggy. The pita could also use some help too. \n\nThe service is always warm and inviting but I think I will continue to make this a delivery only meal.", "author": "Thomas M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-16", "description": "Very good Brooklyn Heights restaurant with typical Middle Eastern and Moroccan dishes.  Started with appetizer of five nice sized falafel balls which were delicious but served with a too bitter tahini sauce on top.  The meat pie was filled with delicious seasoned meat and onions but, again, that bitter tahini on top kind of ruined it.  Ordered the Moroccan meatball tagine with a side of couscous which was very good and served with warm pita.  The lamb tagine was equally good.  Service was helpful and friendly if a tad slow.  Prices are reasonable as well.  Would come back and recommended.", "author": "Anthony G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-08-26", "description": "Food was not good at all. The couscous was not original, extremely thick semoule. Service was not good as well, extremely slow, only one waitress was taking care of the entire restaurant. If you want a real couscous you should go to café mogador in Williamsburg.", "author": "Alexandre G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-25", "description": "The falafels were moist, and the hummus was plentiful.  Overall, this was pretty standard Mediterranean fare.  Nothing stood out as a show stopper, but if I was in the mood for this type of food--I would go back.", "author": "Kacy G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-02-08", "description": "Nice ambience, friendly staff, good food. The only waitress attending the restaurant was new and served me the wrong chicken dish. I accepted it and enjoyed it thoroughly, and she charged me for the cheaper dish I had ordered, acknowledging her mistake. I look forward to returning.", "author": "Josh S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-24", "description": "I got the Stuffed Grape Leaves ($4 for 6) from the Atlantic Antic today. It was stuffed with veggies. It tasted very vinegary but it was still so good. I do like the meaty version better though.", "author": "Fateha A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-22", "description": "Pretty good service and food came out quick. We came on a Thursday evening and the restaurant was completely empty. I Iiked my falalfel entree even though the rice had a flavor I couldn't detect what it was. My friend's shawarma had nice smoky taste.", "author": "Fenn N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-02", "description": "One of the best Middle Eastern restaurants I have ever been to...and I have been to a lot. We ordered mint tea, lentil soup, mezze platter, and babaganouj. They started us off with warm pita with a side of hot sauce and tahini. We ended up with a complimentary dessert. My tummy has never been happier. I cannot wait to return to try more of their veg offerings.", "author": "Anya N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-16", "description": "This place was really great. The food was excellent, the ambience was comfortable and relaxed, the prices are reasonable/low, and the service was attentive. I was surprised at first that this place is BYOB but it is actually great because they encourage you to walk next door to get a six pack. \n\nGet the mezze platter to start!", "author": "Stewart W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-05", "description": "This is probably my best lunch+dinner. The food is great and feels natural without extra oil or to much salt. Definitely will order again!", "author": "Valerie K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-01", "description": "Rockin' service and huge portions. The menu has tons of customizable options. The falafel is just hearty enough to satisfy your cravings, yet isn't greasy. Lots of greens on the side too =)\n\nGood all-purpose spot. I'm a disgusting human and came in sweaty post-workout clothes, but I'd totally shower sometime and maybe bring a date here too. Bring your mom! Her mom too! Your cat! Your cat definitely wants to bat some falafel around on the floor.", "author": "Katrina S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-06", "description": "We love it here. The food is fabulous and fresh, the prices are great, the portions are amazing ... and the owner and staff are like family to us. Plus it's the only BYOB middle eastern restaurant in the best middle eastern neighborhood in NY!!", "author": "Nick R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-06-08", "description": "Very long wait time. The food was alright didn't have white sauce or lemon iced tea. Need more waitresses there.", "author": "Fariha H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-10", "description": "I went to this place with 3 other people and ate vegetarian, the food was very good lots of combo plates in a traditional middle eastern style, the portions were huge and the service was great, I will definitely be going back also very reasonably priced.", "author": "Huw P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-09-01", "description": "This place is seriously grungy and dirty, but the food is tasty and almost completely makes up for it. I just wish they would just wash everything or the place - and cut down the stupid crabapple tree in the backyard (almost got nailed in the head or on my plate).\n\nIt grosses me out thinking about what's crawling around in the kitchen or whatever sticky substance I'm touching when eating here. Everything is sticky. EVERYTHING!\n\nBut again, the food is good, so maybe I'll flip a coin next time.", "author": "Ian J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-09", "description": "Overall I really liked the place, \nThe service is very good,  I really enjoyed of the falafel only $3.5 for 5 pcs comes with a plate of Pittas, the falafel was fresh, \nI also got Mint tea only $2.5 \n The fresh juices also great only only $4.5\n Hookah was  smooth and  long. \nThe Food Amazing, \nOne of the best hookah.\n\nBut.....\n\n Now few thinges I didn't like  : \n1) regular Hookah os $12,  I ask if I going to mix two flowers is it still will be $12, she said yes/// I got charge  $14 0_o...? \n2)the backyard very cozy however I got mosquito bites twise  for the first hour Still eaching.\n3)  and the last its look like the bill add by human and not by computer, I would double check it before I'll pay. \n( my bill was off only by $0.15 )\nbut if it is off on a small bill Im a fried to know what happens to big bills.\n\n I would live 4 stars I would like to give this place a second chance", "author": "Ro A."}], "servesCuisine": "Middle Eastern", "priceRange": "$11-30", "name": "Sultan Restaurant \u0026 Cafe Lounge", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "144 Atlantic Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/izknsmBq4lUxYqj8Itq5Kg/ls.jpg", "@type": "Restaurant", "telephone": "+17184888886"}