{"aggregateRating": {"reviewCount": 80, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-20", "description": "We were craving something middle eastern after shopping at Sahadi's on Atlantic Ave and thanks to other Yelp reviews we decided to try for this place lunch. The host was very gracious and very flattered when we said that the felafel sandwich was one of the best we've ever had. The small plates of grape leaves and Foul were also very tasty. Will be back for sure! Bring cash", "author": "Andrea M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-09-08", "description": "The food is typical middle eastern  Nothing special  Nothing different\nThe decor is tacky like really tacky  everything is red  faux velvet?  \nThere are 3 televisions in a very small space  Why??", "author": "Susan C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-30", "description": "Went here with some girlfriends for snacks and shisha. Lentil soup and hummus both delicious. The shisha was quality and lasted several hours. The owner was friendly and attentive,  and clearly has a lot of pride in his restaurant. Great find!", "author": "Amanda R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-05", "description": "While wandering this area looking for food on my lunch break, I stumbled upon this place. With slight hesitation I decided to give thier chicken shawarma a try. It turned out to be superb, especially at that price. Definitely coming back to try other items.", "author": "A Dot K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-12", "description": "Excellent food. The Bronzino is the best around and a great value at $17 for the complete dinner. Falafal sandwich also really good. Very pleasant atmosphere with good service.", "author": "Robert V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-07", "description": "Stopped in on a whim.  Very fresh tasting falafel and flavorful hummus (nice touch with the olive oil).  Owner was very friendly.  The price was right too!", "author": "David A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-23", "description": "Grabbed a drink with a vegan friend nearby, and afterwards we happened to both be hungry and happened to stumble upon Sultan (one of many Mediterranean places in a sort-of-middle-eastern neighborhood). Really great find! We split a large, and very affordable, falafel plate. The falafel was tasty---crispy, like I like it---and all the vegetables were fresh and well-arranged. Also they weren't skimpy with the hummus, like some places are with their platters. The atmosphere was great (at least for this genre) too---upholstered seats and a TV showing French chanson karaoke (random, but cool)---the backyard is cute too. We'll be coming back.", "author": "Kyle G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-01-17", "description": "Ordered from here last night, I am very confused by all the glowing reviews. I ordered the chicken shawarma.  The chicken was rubbery and didn't taste like real chicken. The pita was not fresh and definitely store bought. The hummus was way too salty. I didn't even bother to eat my delivery. Needless to say I will not order from here again. Better off going to Fatoosh much better quality and cheaper.", "author": "Ann C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-31", "description": "Such delicious, unpretentious food! The service is great, and the prices are reasonable. It is clear that the owners here care about their food and about their customers.", "author": "Matt A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-01", "description": "Great new addition to the neighborhood. Excellent prices and very very nice service. We tried the moussaka, lentils soup ( amazing) and shish kebab. We also tried the baklava, we are definitely going back. Only down side the bread, not home made.", "author": "Paloma D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-08", "description": "The best arabic food I have tasted in a while. Being from the middle east I usually go to new jersey to eat but I am very pleased with this place. The food is good and the owner is very nice. Definitely will be back!", "author": "Jennifer R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-05", "description": "I devoured the lamb kebab and falafel sandwich!  It is refreshing to see a restaurant that has high quality fresh products at a reasonable price. The lamb and falafel were seasoned and cooked to perfection. They were complimented very well by the fresh tomatoes lettuce and cucumbers with a splash of white sauce.  The first bite was only topped by the flavors of the last. I will definitely be returning soon.", "author": "Dave C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-01", "description": "Just ate here for the first time and it was terrific. Food is incredibly fresh and well-seasoned, the owner is super-friendly, and the decor is perfect. I'll definitely be coming again and again. Such a boon to the neighborhood!", "author": "alice g."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-20", "description": "This place is a hidden gem right on Atlantic Avenue between Brooklyn Heights and Cobble Hill. In fact, I almost hesitate to write this review, because I am worried that if New Yorkers discover this amazing restaurant, it will soon be overrun and there won't be any tables available! The prices are really reasonable, for New York City extraordinarily so. I have eaten here probably eleven different times, both for lunch and dinner, and each and every time the service is attentive and delightful, and above all the food is absoultely wonderful. Every single dish is fresh and lovingly prepared and presented without even a drop of pretention. I often eat Middle Eastern food--it's my go-to cuisine-- and I can say without hesitation that the falafel here is the best I have ever had. This restaurant also has delicious, fresh Mediterranean fish like orata, grilled to perfection. Whether you are an avid meat-eater, a fish lover, or a vegetarian, you will leave Sultan after your meal with a huge smile on your face.", "author": "Amy C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-26", "description": "The food was amazing, the ambiance was very oriental. I loved the kebbah from the appetizers and the whole bronzini fish :) I will definitely come back with more friends..", "author": "Menna A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-07-16", "description": "It was acceptable middle eastern food but nothing out of the ordinary. Nice staff.  Platters were large. Syrian style shawarma (not cooked on a rotating base but on the stove). Babaganouj was very tasty but hummus was just ok.", "author": "Merrie S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-22", "description": "Ordered on seamless.com and was very pleased. Food was delivered on time but best of all the food was great. The best Middle Eastern food in the neighborhood. The grilled lamb chops were flavorful and juicy. The salad, grape leaves, moussaka and hummus was very fresh and tasty. Next time, I will have to try the restaurant as the delivery menu was limited.", "author": "S Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-09", "description": "I love Middle Eastern food, but I was disappointed with 2 of 6 items which was ordered for delivery, once they found out about my dissatisfaction they called me back and made it up! That was nice .", "author": "Sam M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-01", "description": "We stumbled in for lunch and found the staff to be very friendly and food to be delicious!  The Kafta Kebab was very good and all the sides were delicious ... hummus (among the best I've tasted), babghanouj, kebbah.  My gf loved the falafel which she said was perfectly crunchy on outside and tender on inside!", "author": "Tommy B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-10-17", "description": "Wanted to try this new spot in the neighborhood.  We both ordered lentil soup which was tasty but watery.  Shared the eggplant which was quite good.  The mint tea was mediocre and $3 a glass.  In general, a little pricey.  Not rushing back, especially in this neighborhood which has excellent restaurants everywhere.", "author": "Lynne W."}], "servesCuisine": "Middle Eastern", "priceRange": "$11-30", "name": "Sultan Restaurant \u0026 Cafe Lounge", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "144 Atlantic Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/izknsmBq4lUxYqj8Itq5Kg/ls.jpg", "@type": "Restaurant", "telephone": "+17184888886"}