{"aggregateRating": {"reviewCount": 80, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-07", "description": "I stumbled in here randomly on my lunch break. Ordered the shrimp kebab wrap and hummus. I was a bit impatient because I came in ravenous. Oh my freakin goodness it was amazing!! Service was great. This may be my new favorite and I can't wait to try more items.", "author": "Jennifer O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-30", "description": "I think the owners miss the mark by making the interior look too much like a Hookah bar. I was hesitant to try this place for a while because of the curb appeal. I am so glad I did because of the amazing food and price. I felt the service was genuinely friendly and very attentive. I had the grilled Branzino which comes with fries for dinner service. The fish was super fresh and for $13 only!! WHAT!? I had the hot mint tea to start, it was very refreshing and enjoyed that they use real mint leaves. Will be back!", "author": "S.H. L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-13", "description": "Amazing food. Good prices and a nice host. Had the chicken kebab twice and it was amazing!!\n\nA new gem, unfortunately not well known yet as its so new. Spread the word.\n\nBtw they start shisha after 9pm so if that bothers you come before :)", "author": "Farshid R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-29", "description": "Amazing food, freshly squeezed juices, and hookah. The service was wonderful and the owner is very nice and humble. If you want amazing food and great hookah you should come here. I had the shrimp platter with french fries and baba ghannoush. My friend had the chicken shaworma platter with french fries salad and hummus. My mother had the mixed meat platter with fries and hummus. The meat was delicious, fresh,  and juicy. If you want amazing middle eastern food and hookah come here!", "author": "Sandra D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-01", "description": "The first thing you notice about Sultan is its beautiful red decor -- it has the best signage on Atlantic Ave, and the interior matches it in style and atmosphere. Initially I thought it was mainly a hookah bar, but it turns out the hookah only comes out after 9pm, which is great if you're mostly interested in dinner, like me. Speaking of dinner, the food here was excellent. My wife and I ordered the combination meat platter, which comes with perfect hummus and saffron rice. The meats in the platter were all different and satisfying -- my favorite was the lamb chop, which I will order as an entree next time I go. \n\nIn a neighborhood with lots of excellent Middle Eastern options, this place stands out -- give it a whirl!", "author": "L. N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-16", "description": "So impressed with this restaurant, had to write something. I am literally yelping as I am eating! Couldn't wait. The restaurant is long and narrow with an extremely red decor. I mean red everywhere:). But it's nice. It's not gaudy. It will eventually become gaudy if not kept up with. But right now it's nice. Music is nice in the background- super middle eastern. The whole place is middle eastern. They have Turkish coffe and chicken shawarma. (Cheap too). A whole platter for 11$. Their teas are very good. They have hookah too but they are not obnoxious about it. Very good food. Best Tahini I've ever had. Every platter comes with pita and sauces on the side. A platter comes with rice, meat of choice, salad and humus. Owners are super nice and accommodating. I don't come  to this area often but I will definitely  come back for this restaurant !!!", "author": "Daniela T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-04", "description": "Sultan recently hosted us for a birthday celebration (13 guests) and we couldn't have been happier. The communication to set everything up was super easy, and the service the day of the dinner was solid. The team there went out of their way to make sure we had everything we needed. They were very accommodating and so nice. The food itself was amazing. Best hummus in the neighborhood! Since we were a large group, we ordered family style appetizers and entrees. So delicious! Do yourself a favor and head over to Sultan's. You won't regret it!", "author": "Aileen A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-05", "description": "We tried this place for the first time on a Saturday night. We sat in their very pleasant outdoor space in the back. Service was a bit slow because there was only one server on duty, but we didn't mind. We weren't in a hurry and she was personable and helpful. The place filled up outside and pretty soon folks were sitting inside as well, so obviously Sultan Restaurant has a good reputation.\n\nMy companion had chicken tagine and I had lamb tagine. Both were excellent. The menu is very varied. Looking around at other diners' meals, I saw a wide range of colorful, plentiful dishes being enjoyed.  The prices are extremely reasonable -- for the two of us the total, including tax and tip, was $42.  Since they don't have a liquor license, that brings the price down considerably, and you can BYOB with no corkage fee. \n\nSince then I've been back a few more times and in particular recommend their grilled lamb merguez (spicy sausage) dinner plate. The owner is very proud of his merguez because it's made for them by a guy originally from Tunisia who seasons it the old-fashioned way. Check it out.", "author": "Pandora B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-18", "description": "Chicken gyro or chicken shwarma?? Decisions decisions, which is my favorite... BOTH!  And the spinach pie rules.  Oopsie, last time I said the meat pie was super, but can't I have two favorites?  Seriously, Sultan lives up to it's name.  The owner is part hawk, part mother hen meaning everything is done just right.  And if it isn't, you forgive because it's all done with heart.  BYOB means dinner won't empty your wallet.", "author": "Undercova A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-12-02", "description": "We ordered takeout from here. The estimated time given was 45 - 60 min. They then gave a specific estimated delivery time of 45 minutes. The food didn't arrive for TWO HOURS. When I tried to call (a few times) to find out what was going on they refused to pick up the phone. We had no idea what was going on and no way to find out. This is horrible customer service and we will certainly never order from - or bring our business - there again.", "author": "Sonya P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-06", "description": "I have found my new favorite place to eat! My meat combination platter and mint tea was delicious, their hummus and pita bread was better than anyone place else that I have tried as well. The owner of the place served us as well and was very nice and attentive! I will be back soon.", "author": "Pierce H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-14", "description": "Really charming place with great service and wonderful food. Try the spicy Sultan Dip; it and EVERYTHING else was delicious. Apricot pudding and mint tea for dessert!", "author": "Timothy M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-08-23", "description": "Relief from days of muggy heat on a brilliant but not-so-hot day inspired me to look for a local place to enjoy a late-afternoon supper in the nearest thing to a garden I could find. I selected Sultan based on enthusiastic reviews on Yelp, and a photograph of the restaurant's patio, surrounded by small trees.  \n\nOur server was friendly and efficient, but neither the store-bought pita, dry merguez sausages, reheated rice or wilted salad, nor my companion's beef shawarma merited the praise heaped on Sultan in other reviews.  The rice pudding was studded with gluey lumps.  \n\nBut what really ruined what should have been a pleasant-enough supper, in spite of the mediocre food, was the flood of mosquitoes that assaulted me halfway through the meal.  Apparently the manager is not only indifferent to his patron's comfort and enjoyment, but ignorant of warnings of mosquito-transmitted Zika virus, even in New York City, or steps to eradicate mosquitoes from the restaurant's patio (doors and windows of Sultan were open, unprotected by screens, on this pleasant afternoon).", "author": "amanda S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-29", "description": "Tried delivery from Sultan for the first time this past weekend.  The driver brought everything in an insulated bag and the food was still hot to the touch!  We ordered the chicken shawerma plate and the falafel plate.  Both were tasty and pretty huge portions.  Definitely good bang for the buck.  Would like to try this place in person as I hear they have a backyard patio and hookahs. I'm a fan of Sultan!", "author": "Rick S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-06", "description": "My husband and I enjoyed a delicious lunch at the wonderful little place.  Having grown up in this neighborhood, I have eaten at every middle eastern restaurant in and around Atlantic Avenue for decades.  Sultan is as good as it gets.  We had the amazingly fresh and well prepared branzino and the lamb chops.  Both came with choice of fries or rice, and also of hummus and baba ganoush.  We chose rice and baba.  Out came huge plates filled with rice, salad and baba g.  Everything was super fresh, well seasoned and tasty.  We could not finish everything - as the portions were so generous.\n\nWe also enjoyed a lovely, fresh-made lemonade.  The hosts are friendly. Dan the owner came by our table to make sure all was ok.  We told him we loved the food. The prices were reasonable.\n\nSadly they were out of the much celebrated spanakopita, Next time....and there will be a next time for sure.", "author": "MIranda M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-06", "description": "Literally the best falafel I have ever had. And I am a Lebanese woman who has had my fair share of falafel:)\n\nThe owner of the restaraunt is very kind and welcoming. He wants you to feel comfortable and at home, which is one of my favorite things about middle eastern restaurants in general. \n\nThe meat skewers (both lamb and chicken) are delicious and prepared with other grilled vegetables. It's  better than others that I've had anywhere in NYC.\n\nI'm also thrilled that this restaurant opened up, because many of the other restaurants on Atlantic ave have closed in the last 12 years and have been replaced by coffee shops, etc. \n\n5 stars, all the way around.", "author": "Jay G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-11", "description": "all i would say is ill come here again and again.. taste and feel like home. order chicken kabob and youll enjoy.", "author": "Kaveh E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-28", "description": "After window-shopping Atlantic Ave antique stores, my husband and I wandered into this fabulous restaurant for a late Sunday lunch. The reasonable prices along with a nice bottle of red from a nearby wine shop made it a BYOB bargain feast. The waitress was friendly and patient when we couldn't make up our minds on all the menu choices. To start, the fava bean salad was served warm with pita; the falafel was especially light and tender--- a fresh herby mixture on the inside, delicately crunchy outside, with extra hot sauce and tahini on the side. We shared the Meat Combination platter (more than enough for two): grilled lamb chops, marinated chicken kebab, kafta kebab over yellow rice pilaf, mixed chopped salad with pickles, and hummus. The charming chef came out to see how we were doing, which was a nice touch. We'll definitely be back with a group to try out the rest of the menu.", "author": "Florence B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-27", "description": "Got the chicken kabab platter, which was very good. The hostess was super nice and the prices were spot on. All in all a good place to have lunch or dinner.", "author": "Soupmaster Z."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-31", "description": "Great food. Great host. Great prices. Great atmosphere. What more could you ask for? Came in for lunch on a Saturday afternoon with my husband and son and we were glad we did. The falafel was the best we've ever had, there was a spicy dip that was amazing and the bread was piping hot. The server saw that my son ate the falafel and brought him a few more pieces on the house. This is a great addition to the area and very family friendly. I'm happy that they don't start the hookah until after 9pm, smart decision in a family filled neighborhood.", "author": "Melissa T."}], "servesCuisine": "Middle Eastern", "priceRange": "$11-30", "name": "Sultan Restaurant \u0026 Cafe Lounge", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "144 Atlantic Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/izknsmBq4lUxYqj8Itq5Kg/ls.jpg", "@type": "Restaurant", "telephone": "+17184888886"}