{"aggregateRating": {"reviewCount": 80, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-10", "description": "I love this place! A hidden gem. It's always very empty, but the food is spectacular and reasonably priced. I got the Chicken Kebab and eggplant dish and loved my meal.", "author": "Eloise L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-06", "description": "Sultan is absolutely the best bang for your buck in Cobble Hill/Brooklyn Heights. The food is fresh and delicious and the portions are very generous. \n\nThe falafel combo is my favorite but everything I've had here is great. They're fast, which makes them great for take out or delivery. I had them cater a party of 15 and every single one of the guests raved about the food. I can't stress enough how great this place is.", "author": "Jennimaria P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-10-21", "description": "Had diner there with some friends who really wanted to eat some couscous. As she came to take our order the waitress told us that there was no couscous that night. \nFinally after some negotiations with the kitchen we were told that the couscous would be ready in 1/2 hour. Perfect we replied in the mean time we can order some appetizers. The waitress was not as glad as us it seemed by her attitude. \nWe got some wine from the store across the street and ask her for wine glasses. She came back with warm and wet glasses, sat them at one end of the table and walked away. Really!\nShe rushed us to finished our appetizers, I guess the couscous could not wait any longer! \nSomeone ordered lamb chops medium rare with grilled vegetables.\nThey were way over cooked and tuff and came with a salad and humus, instead of grilled veggies. We work in the industry. The food was very disappointing and service rushed by an unhappy waitress.", "author": "Jade T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-29", "description": "Yeesh, the full 5 star rating! Totally worth it.\n\nLocated in a sea of great Middle Eastern restaurants and shops on Atlantic Avenue, Sultan is pretty goddamn fantastic. Bedouin Tent has been my go-to for a while, but it may have just been supplanted.\n\nWent with a bunch of coworkers and split the chicken schwarma platter and sultan dip with one of them. The sultan dip--a combination of hummus, babaghannouj, and harissa--was outstanding. Really delicious, and our basket of pita kept getting refilled!\n\nThe schwarma was great, too, and came with a Middle Eastern salad, sauteed vegetables, babaghannouj, and rice. The rice was delicious, the chicken perfectly-cooked and marinaded, and the babaghannouj was the bomb.\n\nOur waitress was also insanely nice and accomodating, and brought out homemade hot sauce, tahini, AND harissa (which was great).\n\nThe one platter and dip more than filled us up. My other coworkers loved their dishes (lamb, merguiz, chicken kebab) as well. Definitely returning.", "author": "Dylan K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-28", "description": "Wanted to try this place after seeing the good reviews and being close by. I found the dining room clean with a nice atmosphere. The waitress was efficient and pleasant. I got the Falafel (5 pieces) appetizer for $3.50-a steal. They were some of the best I have had in NYC. I also got the grape leaves salad, which was actually 6 dolmas for $4. They too were great.  Finally, I got the shish kebab platter for $13.  This one was a bit of a disappointment.  Although the rice, and hummus were great, the salad was bleh and the lamb was overcooked and dry - so I downgraded it a point. There were plenty of leftovers and the tab came to less than $27 with t/t.  A good value.  I will give them one more try - maybe next time getting the lamb chops.", "author": "Darryl R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-25", "description": "Great service and the best couscous in NYC. The salads are great too, and we had a great experience.", "author": "Jonathan P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-23", "description": "I had the falafel platter here, and it was just outstanding. The presentation was stunning, and the food was perfect. Platter included falafel, hummus, babaganoush, rice, tabbouleh (without much scallion, thankfully), and beautiful, colorful salad. Pita bread with spicy sauce and with tahini accompanied the meal. The service was gracious, speedy, accommodating. The ambiance is modest and refreshingly unpretentious. BYOB. They provided wine glasses. No blasting music, no screaming. Ahhhhh. Perfect dinner. Go there!", "author": "Michele B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-08", "description": "Ordered delivery from this place tonight. Yelp reviews guided my decision and didn't disappoint (I have found that ordering anything for delivery can be hit or miss). The prices are very good for the amount of food you get. The delivery was VERY quick too, which I was surprised about given that I ordered during prime dinner time. It was also packed very nicely into a little plastic bento-type box, which will make leftovers for lunch tomorrow super easy! \nI ordered the chicken shawarma platter, which came with chicken, basmati rice, pickled veggies, and hummus with kalamata olives. I also got two warm pitas which was a pleasant surprise (I literally wrote in the delivery notes \"please include a pita if you have some!\"). The basmati was a little bland, but the included tahini and sour sauce was a welcomed flavor boost. The hummus was also fabulous and the pickled veggies were a nice palate cleanser. The chicken was tender and tasty.\nI'll definitely order from here in the future when I have another weeknight craving for mediterranean food! Looking forward to my leftovers tomorrow.", "author": "Hayley T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-17", "description": "A terrific restaurant! From the baba ganoush to the tajine, everything was delicious. Delighted they're in the neighborhood and will definitely return.", "author": "Steven P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-26", "description": "Fresh, quick and absolutely delicious. Less than 30 mins delivery time in the Friday night. The best delivery food ever in NYC. Especially meats are super fresh. Will order again.", "author": "Kristine S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-16", "description": "Update: 2/15/17 - Can't stress how good value for money this place is. Fantastic place and great owner. \n\n----------------------------------------\n\nHad a really amazing dinner there - annoyed that I forgot to take pictures but was so tasty I dove right in.\n\nStarted with the Mezze Platter for 2 and then had the meat platter.... Yum!\n\nAnd it's BYOB!\n\nI'll be going back soon.", "author": "Pete B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-05", "description": "This is my favorite restaurant in Brooklyn Heights!\n\n The grilled Branzino is the freshest I've found in NY and their combination meat platter (lamb chops, chicken, beef kefta) was beyond tender and perfectly spiced. I don't get to eat much Middle Eastern cuisine, working in Manhattan where there aren't so many good places and living in Greenpoint where Middle Eastern places are hard to find, but my friend brought me here once and I'm forever grateful.", "author": "Ellzey D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-21", "description": "Great AUTHENTIC recipe food.  Good service.  And a very happy tummy to go home with.  What more can you ask for?  I highly recommend Sultan to anyone looking for great Middle Eastern cuisine!", "author": "Terence H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-29", "description": "Classic middle eastern food with relaxing atmosphere. Sat in the backyard space during summertime and enjoyed.", "author": "Alex R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-04-30", "description": "The service was quite luke warm, matching the temperature of the food. We were the only guests, but they still managed to mess up one of our orders, and the fourth arrived almost after the rest were finished eating. \n\nLarge portions, but a little bit bland. Good hummus.", "author": "Christel J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-30", "description": "After a long day walking around with my cousins on Memorial Day weekend, we'd built up a good appetite in the sunshine and decided to get a bite. I fondly remembered the old Waterfalls Cafe in this neighborhood, so we set off to find it. I was shocked to see it'd closed -- but psyched that there was another middle eastern restaurant in its space. We decided to give it a go. \n\nGood idea! This was really, really good food. I'm still thinking about it a day later. My cousin and I both got the chicken shawarma platter and it was fantastic, the more chunky, well-cooked kind as opposed to the shredded type; while my other cousin got the mousaka which was also delicious. Seriously great seasoning, delicious. The pita bread was hot, toasty, and on-point. The hummus and our side dish of cucumber yogurt were also fantastic, drizzled in olive oil, and filling in the best way.\n\nService was great. We were here before hookah hour so it may be a different vibe later on, but for a 5pm or so meal it was everything we could've asked for!", "author": "Dave M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-06", "description": "The food was amazing and tasted fresh. There was not a long wait and the waitress was really attentive and sweet. The portion sizes were great and prices were very reasonable. The only thing I recommend is to have a side sauce for the rice because my friend and I felt like the rice was a little dry/plain. Other than that it was delicious", "author": "Samira A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-19", "description": "Great food! Warm and friendly atmosphere! Grilled Bronzini is superb; shish kebab is so so tasty! I first visited Sultan last week for dinner. I have been there 3 times since. It has become my place for great food and to relax for a moment. Service with a smile everytime. Oh the lentil soup is very good too.", "author": "John S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-08", "description": "Best lamb chops in NYC that I had have so far! Make sure you try Moussaka which tasted super good. Great food with great services. Another happy customer.", "author": "Reaz P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-09-08", "description": "Very disappointed in this place lemonade tasted like it had dishwasher soap inside there. It was disgusting literally taste like dish washer soap and just to make sure I wasn't losing my mind going crazy I spilled some in another cup of water and watch the bubble up with foam it was gross. The chicken wasn't to my liking it was hard dry no taste and the hummus had texture like liquid like it was diluted with water or something . Definitely never coming back here again.", "author": "Allen G."}], "servesCuisine": "Middle Eastern", "priceRange": "$11-30", "name": "Sultan Restaurant \u0026 Cafe Lounge", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "144 Atlantic Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/izknsmBq4lUxYqj8Itq5Kg/ls.jpg", "@type": "Restaurant", "telephone": "+17184888886"}