{"aggregateRating": {"reviewCount": 27, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-27", "description": "We had 2 pizzas (arugula/burrata, and the n'djua hot honey), both of which were just lick-the-box, eat alla da crust delicious. Sad for waiting to give FRIED PIZZA a shot until now- I never want to go back to traditional pizza.", "author": "Bex A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-18", "description": "Loved the nduja pizza!! So delicious! Every bite was incredible and I usually don't eat crust but this was good crust! The staff was very nice. Will be back to try more pizza. Their location is a little hidden compared to the other spots but worth seeking out!", "author": "Lexi L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-25", "description": "Perfect pizza. Definitely not the largest pie, but solid for an individual serving. Of the 40 places in DeKalb Market, this is one NOT to miss. I've had ~10 of the places so far (I live in the neighborhood...), and this is the first one I've bothered to spend time writing a review on. \n\nOnly thing I'd say was disappointing was the $2.50 can of Coke. Still wasn't enough to sway my 5 stars though.", "author": "Jay L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-17", "description": "Saying this as a Long Island and Brooklyn resident: TOP 3 PIZZA I'VE EVER EATEN! I got the arugula and burrata pizza and added a bit of the truffle oil on top and OH MYYYY IT WAS DELICIOUS! Their crust is unique and an experience of its own. Will definitely be going back! If they weren't snuck behind the back corner, they'd definitely be seeing more foot traffic!", "author": "David K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-27", "description": "\"Fried Pizza?\" you may ask. I wasn't so sure what to expect myself but was pleasantly surprised! Personal-size pizzas with fresh ingredients on a dough that is of a lighter, Naan-type quality. It is soooo tasty! I had the arugula and prosciutto and also tried my husband's Hawaiian slice. Both were deemed delicious. This will definitely be a go-to spot when on the food hunt at Dekalb Food Court!", "author": "Katie C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-04-28", "description": "It literally took almost two hours to get me food. And the food wasn't even worth it and cold. The delivery boy basically threw the pizza at me. A waste of $32", "author": "Danaysia B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-02", "description": "Best pizza in Brooklyn. I love fried pizza since last time I been in Napoli and I love truffle pizza here much more than anywhere else", "author": "Mark M."}], "servesCuisine": "Pizza", "priceRange": null, "name": "Forcella Fried Pizza", "address": {"addressLocality": "New York", "addressRegion": "NY", "streetAddress": "445 Albee square W", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/lidP3aAP8hTJOVayz94nAw/ls.jpg", "@type": "Restaurant", "telephone": "+19293794085"}