{"aggregateRating": {"reviewCount": 27, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-27", "description": "Hey yo. \n\nHere's the buzz -\n\nIf you haven't been to Dekalb Market Hall before, I'd suggest making a trip there in the near future. Within the market, there are a bunch of food vendors - none more inconspicuous and underrated than Forcella Fried Pizza.\n\nChomped:\n\n1. The 'Nduja\n\nThe pizza, named after a yummy spreadable pork salumi, is accompanied by jalapeños and (#todiedfor) Mike's Hot Honey. After taking a large chomp, I thought the pizza was mediocre until the hot honey notes hit my taste buds. It was at this point that I realized that I made the right choice. Who knew honey and pizza went well together? UNBEELIEVABLE!\n\nFried pizza is on a whole 'nother level than your standard New York Slice. Firstly, I'm not sure how you can fry pizza dough and it not turn into a crispy mess. The 'Nduja was no crispy mess. Don't get me wrong - it was crispy, but also soft and chewy at the same time. The pie is good enough to chomp by yourself or share with another person. \n\nI last had fried pizza at Don Antonio's in the city and I feel the two pizzas are comparable. When I feel like misbeehaving and eating like a fat boy, I'll stop by Forcella to try some of their other options.", "author": "Jerry T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-06", "description": "Update: THEY NO LONGER DELIVER THROUGH CAVIAR!?!? WHYYYY??  I didn't mind the crazy fees through caviar so that I could get it delivered to my part of BK. Now nothing...uggghh\n\n\nI love their pizza! It's some of the best in NYC. Every time I'm in city point I get some. They also deliver through caviar", "author": "lillian p."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-16", "description": "Without a doubt, Forcella is an innovative way  to eat pizza. The fried dough takes me back to memory lane with flavorful experiences I had with things made of fried dough. \n\nThe guys behind the counter are super nice and attentive. They offer a way variety of pizza toppings and recipes. Right after your pizza comes out from the oven they will prepare it for you with amazing spices and authentic truffle oil (completely optional).\n\nThis pizza place is the best in downtown Brooklyn and I won't stop talking about it. I have been a customer of Forcella since the first week they opened in Dekalb Market Hall and you will think that their food will deteriorate with time, but it's the opposite. It gets better and better. They keep perfecting their recipes and ingredients to give us the best. \n\n5 Stars, always coming back. #ForcellaLover", "author": "Wendrich J. M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-25", "description": "This is a skilled pizza maker who opened a shop in the DeKalb Market and not some fly by night concept. The owner of Focella, Giulio Adriani is a famous Italian pizza maker. He has a restaurant in Brooklyn, the Lower East Side location closed.\n\nDon't dismiss this specialty pizza. Forcella isn't making pizza rolls, they're taking the pizza dough to the deep fryer for about 30 seconds, then baked for 30 seconds in a smokey oven. The end result is another dimension of pizza, topped with freshly made cheese and sauce, its very good and not at all greasy. \n\nIf you're in the market, you have to try this pizza. Split it with your crew but make sure you get a taste. You'll be quite surprised.\n\nMolto Benne!", "author": "Bill S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-15", "description": "Just admit it, u like greasy food. Cuz we all do.\n\nDeep fried dough for pizza is the best. It's crispy and more flavorful than oven pizza for real. I got a pepperoni pie for $11 at 4pm in the afternoon cuz I was starving for snacks, and then snacks turns into a real meal. The staff is super friendly and gave me coupons for next pizza and one of the other dessert place also located in DeKalb market hall.\n\nTaste: 5 stars for sure. Just need some kombucha afterwards for cleansing.", "author": "Andrea L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-12-08", "description": "I couldn't resist stopping after seeing the sign that said fried pizza .\n\nThe menu is simple especially when your not a meat lover , you tend to stick with the basic vegetables and cheese. \n\nOrdered the vegetable pizza for myself and the spinach and chicken for hubby. The young lady who took order was pleasant. \n\nThe crust of the pizza was Crunchy and the veggies added so much flavor to the pizza, added some parm cheese and black pepper and it was excellent ! \n\nIt was so delicious I visited the next day to try the mushroom. Service is great and really good fried pizza . Definitely worth trying", "author": "Demora F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-12", "description": "I got this pizza for my cousin who was from out of town. She complained she hadn't found real NY pizza while she was in NYC on vacay. I found that unbelievable so we went here so she could get some good pizza. She got the Hawaiian with pepperoni which cost $14.47 with tax. I would say that getting pizza here is not cheap! The pizza is good  but this is NY you can find great pizza almost everywhere, contrary to what my cousin said. My cousin found this pizza acceptable and she enjoyed it. The size they sell is supposed to be a personal pizza, but I think you could totally share with others... 1 person if you're only eating pizza. Maybe 2 people if you have something else to accompany the pizza.", "author": "Kia A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-21", "description": "Great pizza. The dough ia flashed fried for a couple minutes and then topped with your ingredients. Its then finished off in the oven for about a minute. Total time is about 5 minutes. Great pizza. Great crust.", "author": "david l."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-01-08", "description": "The concept of fried pizza seems really decadent, and like it'll undo a week's worth of time at the gym.  Perhaps it does - but the enjoyment you'll experience while eating this pizza will take your mind off of all of that noise.  Forcella is quick, yummy, and will leave you satisfied. The pie is the perfect size for sharing (if you're not too hungry), but it's also small enough to fill your hankering for a solo nosh sesh if you're starving.  The ingredients are fresh and you can watch the pizza being made in the wood fired oven.  It's not greasy at all - but perfectly satisfying.  Just don't look at the calorie counts.", "author": "Katie G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-04", "description": "This is the first time I have ever had fried pizza. The pizza maker deep-fried the dough for30 seconds before putting in assortment of fresh toppings on it. My pizza had pepperoni, Nduja salami(sorta spicy), fresh baby arugula, and fresh mango slices. I have never had fruit on a pizza before, but I said what the hell im on vacation lol.\n\nThe pizza crust is what really stood out for me. The pizza crust was light, airy, and had a buttery taste to it. The crust by itself is good enough to serve. Every time I go to NYC, I will definitely make a stop at the Dekalb Market in Brooklyn.", "author": "Sean W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-17", "description": "So glad I found this gem nestled in the back of DeKalb Market. The service was great and extremely patient as we really couldn't decide what pie we wanted to get, so of course my friend had to ask the employee 21 questions.  He was very helpful and gave recommendations.  Went with the 'NDUJA which comes with mozzarella, spicy 'nduja salami, jalapenos, and mikes hot honey.  What a pleasant surprise this pie was.  The only thing I would have enjoyed more, was that it was a bit spicier, but I really enjoy spicy food.  My friend thought the pizza was just right and spicy enough for her.  The hot honey gave it a nice kick and it was interesting to try 'nduja salami which comes as a jam.  The pizza was created quickly and with some such precision.  It was enjoyable watching them make this delicious creation and I'm excited to come back to try some of their other pies.", "author": "Rob A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-15", "description": "I didn't even really know what I was getting myself into. I wandered around DeKalb Market for 10min before I forced myself to make a decision and ordered an 'nduja pizza. I watched them make it, and all the sudden the dough was in the deep fryer. \n\nI got mine to go since I live close by, and when I got home and tried, it was delish. It definitely could've used 1-2min longer in their oven. Not a problem, I popped it in for 10min ....omg. It was AMAZING. It was crispy, chewy, and tasted like fried dough covered in 'njuja, cheese, and spicy honey.\n\nWe all know this is a very unhealthy option, so be strong and move past it. It's unbelievably good and will be burned into your memory. My close proximity to Forcella is a dangerous thing. I may have to leave the neighborhood.", "author": "Katey G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-12-14", "description": "My wife and I had this and we couldn't even finish our two pizzas. for us at least it was a waste of money and time. I understand what they're doing but it wasn't for us. It's like eating pizza on a donut. Just isn't for us.", "author": "Jay L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-11-15", "description": "I told myself I must have some NY pizza before leaving Brooklyn, NY.  I ordered the pancetta fried pizza.  The crust was absolutely delicious.  It was light and lightly crispy but did not take away from the pizza as a whole.  It could have used a tad bit more sauce but it is still definitely a must try if you are on the area.", "author": "Karla L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-01", "description": "Delicious pizza spot in the DeKalb market. Highlights include fresh made as you order, including the drying of the dough. Nice options including things like prosciutto and hot honey. Affordable in my opinion. One pizza is enough for a meal. Not big enough for gorging like we all like to do on pizza sometimes. We did the pepperoni which was a classic great. The dough being fried makes it light and fluffy and then the through it in the brick oven which crisps it all up and melts the cheese. The prosciutto was nice. Not to hard to check through like prosciutto can sometimes be. A little light on the balsamic for me so ask for extra if you like balsamic. The croquettes were large and the filling flavorful. I would hit them with some salt right as you get them. Overall a solid option in the middle of a ton of options. They're kind of hidden. I think maybe a fried breadstick sample would solidify people's choice to eat here as the fried pizza sign draws them in.", "author": "Scott B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-30", "description": "Overall this pizza was OK - flavorful, but the pizza was greasy (the frying oil probably was a little colder than it should have been) and everything a bit salty.", "author": "Susan O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-01", "description": "I get pizza from this place once in a while and it is definitely delicious. Fried pizza, say no more!!! Nice staff and great prices!!", "author": "Giovanni M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-02", "description": "Simply amazing. The perfect pizza. Great taste, perfectly cooked, amazing crust, it doesn't get any better then this. The price point is perfect, probably one of the best values in the Dekalb market hall. I'd recommend forgoing the extra seasonings they offer; this pizza doesn't need anything. It's perfect. On a not so busy day you can also grab a drink at wine cellar and run into Trader Joe's next door real quick while you wait.", "author": "Charles A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-29", "description": "This place was a pleasant surprise nestled in the basement of DeKalb Mall. Such a convenient location for a tourist like me, fast, and delicious. They took such care in preparing, cooking, and even cutting the pizza. My travel group and I returned the second night to try the calzone and it was amazing. There was mozzarella and ricotta, but just the right amount.", "author": "D L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-09", "description": "Came here with my friends for the first time and we all got different pies. We LOVED the pizza. The crust was so so so good, it was crispy but airy at the same time. The toppings were fresh and delicious. A very cute place with a very friendly staff. I definitely will be coming back.", "author": "Gulnoza S."}], "servesCuisine": "Pizza", "priceRange": null, "name": "Forcella Fried Pizza", "address": {"addressLocality": "New York", "addressRegion": "NY", "streetAddress": "445 Albee square W", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/lidP3aAP8hTJOVayz94nAw/ls.jpg", "@type": "Restaurant", "telephone": "+19293794085"}