{"aggregateRating": {"reviewCount": 100, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2019-01-04", "description": "Not as good as the original barely get any pickles sandwich meat was not as tender n fresh  the hotdogs aren't as crisp as nyc either fries are good but they charge a lot for extra here also they don't give u the same service as katz in nyc that I been going to since the 80s but it's closer for someone looking to get a sandwich but doesn't wanna take a hike to the city this will work n they don't give u free water like nyc or let u try with ur purchase the sliced meat  nyc still the best this like a tease service wise from nyc I get less for ur money for sure \n\nIt's definitely just a taste of katz 4 stars only because it's a second location n more accessible then going to the les to grab one", "author": "B L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-14", "description": "It was, for me super hard to find them in a basement.. when I finally found that super cool food court I was happy!\nI was surprised that it was no line there. I ordered their famous pastrami sandwich and bottle of water (I want to mention water because they charging for it $2.75 that is super ripoff, and if you go to the next to them spot, you can grab it only for $1). While i was waiting for my sandwich, the guy who was making it, gives me super small piece of meat to \"try\".. like normally in their original place, I was receiving good amount all the time. And I don't know why, but meat wasn't that delicious, like in their original spot. I can't say, that he put small amount of it on my sandwich, but either not big too.   Like in Manhattan you can't even finish their sandwich and here it wasn't like that. But still it's cool that they opened this baby spot, and I will give them second chance. What I like the most - the tourists will never come there;))))", "author": "Shev O."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-09-01", "description": "I was really excited to get a Katz's Pastrami sandwich without having to fight traffic going into the LES. TL;DR go to the LES if you want Katz's. \n\nThe food court it's in is an amazing place. A show kitchen in a mall - what? Lots of variety in the food court, but the Katz's stand was a bust. \n\n3 of us got sandwiches. One was pretty moist, one was a little dry and one was inedible. There is about 25% less meat in the sandwiches here than at the original, and the quality isn't good. \n\nBrooklyn should do Brooklyn and let Manhattan be Manhattan. This whole Katz's in a mall thing was a bad idea.", "author": "Al W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-02", "description": "Katz's is famous all over the world for their pastrami, which you can get at A Taste of Katz's in DeKalb Market with no line. It's not the same experience as the original seeing as it's in a food hall, but getting the pastrami is a nice treat. The half sandwich combo with pastrami and matzo ball soup will run you $18.45, so it's definitely not the cheapest thing in the market, but the pastrami is really good. I love the matzo ball soup in any weather, comfort food at its best. We've also gotten the hot dog and knish combo ($8.90), which is fine, but nowhere near as good as the pastrami. There's a reason it's what they're known for, and we're happy to be able to get it here without the crowds.", "author": "Marissa L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-10-14", "description": "Food: 7/10\nService: 6/10\nAtmosphere: 4/10\n\nA Taste of Katz's is exactly that - an approximation, but not quite the real experience.  If you want that massive, over-stuffed meat sandwich, this out-post in the Dekalb Market is a fine way to get a taste of Katz's (as the name implies).  That said, the menu is limited and expensive.  The best value is actually the hot dog (just avoid the \"onions\" if NYC tomato stewed onions isn't your thing... the dog is fantastic otherwise, and I've heard it's a custom make by Sabrett, just to serve Katz's).  \n\nService is generally lacking, but that is in part due to the high volumes that the market can experience around lunch time, in my experience.  Everyone has always been kind and accommodating, but it can be a longer wait than you might want on a lunch break from work.  My favorites are definitely the dog with kraut and mustard and the reuben - worth a try if you're in the area.", "author": "Ryan S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-15", "description": "I got a  pastrami on rye sandwich from here on December 15, 2017. It was large and very fulfilling. The meat could barely stay within the bread. The pickles were sub par they seemed like they had been sitting around a while which is disappointing because there is nothing like a nice crisp pickles with a pastrami sandwich. It took about 7 minutes to get the sandwich. I would say the sandwich is seriously overpriced for what it is. I lucked out that my friends treated me! I would say it is nice to try for the 'experience' but it is not worth $23!\nYou could possibly share with a friend  to cut costs, but I was greedy and ate the whole sandwich as well as three of the four sub par pickles.", "author": "Kia A."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-03-24", "description": "Came here on a Sunday afternoon, they forgot to make my sandwich, claimed someone else took it, and then didn't apologize for the 15+ minute wait. The food is great but they really need to get their act together when it comes to service.", "author": "Jay N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-13", "description": "Ordered the pastrami sandwich. It was tender and delicious! However, compared to the Katz in LES, it was a bit dry. Nonetheless, I would come back again since it's more convenient for me to get to here than the LES location.", "author": "Will Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-25", "description": "Tiffanie was great! Very helpful, polite and professional. We need more people like her! Thanks Tiffanie you're the best!", "author": "Amanda C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-12", "description": "When all else fails you can always turn to a sandwich to relieve your hunger right? WRONG! Katz Delicatessen is the embodiment of what all sandwich companies endeavor to be when it comes to size, texture, moistness, quantity, quality, and so  on. Unfortunately, their sibling branch in Brooklyn does not live up to the same standards. \n\nAfter numerous nights of binge watching Impractical Jokers, I was left with a yearning for one of Katz Deli's famous sandwiches. I was fortunate to be in downtown Brooklyn this afternoon so I didn't allow this chance to go to waste. With a brave smile and a tummy full of hungry, I made my way into City Point Shopping Center, down the escalator into the Dekalb Market Hall, skipped (I really didn't lol) my way to the Taste of Katz booth, and ordered myself my favorite sandwich, a Philly cheesesteak. \n\nI'm genuinely not used to paying $20 for a sandwich but I am a firm believer in paying for quality so I did not let the price dishearten me. After all hype, I was finally face to face with that which I have been longing for. After the first few bites I was saddened to realize that it was just hype.\n\nI will acknowledge A Taste of Katz for charging a hefty amount but providing large portions because as you can see from the picture, they really loaded that sandwich up. That's why I gave them an extra star. However, as far as taste is concerned, it has to be the most stale sandwich I have ever eaten. I personally feel the biggest trait of any food is flavor and this cheesesteak was honestly too bland for my taste. \n\nEveryone has an off day and maybe I caught Katz on theirs. It doesn't hurt to give anyone the benefit of the doubt so I truly hope sometime down the road I can come back and have my current review proven wrong.", "author": "Sai H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-03-21", "description": "I grew up in the LES and now live in Brooklyn so imagine my excitement when KATZ announced they were opening in Brooklyn. But man oh man was I quickly disappointed, I've been there 3 times and all 3 times have been nasty. The cashier is sweet and the staff although not like the original are somewhat friendly, I'm a manager in the food industry and totally understand the stress that comes with the job, but the sandwich,the main reason people flock there was so bad. Today was my last time, I picked up a sandwich explaining that last time my sandwich was full of fat to please make sure it's doesn't have chunks of fat, I was assured that they will make sure that doesn't happen. So I get home and not only is my sandwich chunks of fat but I had to ring out the bread from all the oil the bread was so soggy just the worst I've ever had.", "author": "Marie P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-04-11", "description": "I was really hoping that this would be just like the LES Katz's but I was pretty disappointed. I had my usual, The Reubens. The meat was nowhere near as juicy and tender as the original location and was actually pretty dry and underwhelming. The bread didn't seem to be as fresh either. If you want the true Katz's experience, I'd still recommend going to the original location despite the long lines that you may need to wait in. I know this location is relatively new so I hope that the quality improves and mirrors the food quality at the LES location over time.", "author": "Paolo C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-02-26", "description": "If you have time to spend majority of your lunch waiting for your order, and coughing up over $20 for a sandwich, by all means. \n\nIt was my first time trying Kat's famous pastrami on rye and honestly, I didn't like it. The meat was tender, a little too tender, cuz the sandwich was falling apart and it was too messy to eat. My boyfriend had to scoop the fallen pieces with his hands every time he took a bite. It doesn't sound that bad, but when you're in a food court with strangers eating next to you, it's a tad bit embarrassing. \n\nAnd what I was disappointed with is the taste. I didn't really taste anything spectacular. It was kinda plain. I can't compare it to the original Katz because I never had it before. I might try it again at the original, but I won't be going back to the Brooklyn one. \n\nDefinitely overpriced and overhyped. \n\nLove the pickles though.", "author": "Irene Z."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-06", "description": "Honestly, I wanted to come and see what the fuss was all about. Needless to say, this market is bursting with options from tacos, seafood, ice cream to fresh mini donuts. I'm sure that before it's all said and done, I'll be try evenings down here but not today. \nMy trip this time brings me to try the legendary, Katz! There really is no reason for me to go on and on about how amazing my sandwich taste or how fresh and crispy the pickles are. The name Katz's rings bells as they say. \n\nKatz's is a must if your visiting the market.", "author": "Percy H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-19", "description": "This Katz branch is excellent. Short lines with fast service, this spot is actually meant for people to eat and not sight see. Pastrami and corned beef are my go to, and although it is expensive, I would have to say it is the corned beef/pastrami sandwich I've ever had. \n\nI've been to the Katz in Manhattan and it is full of bad service and bad attitudes. Their pastrami and corned beef sandwiches are super tender and really have a unique flavor to the meat. In addition, the sandwiches are served hot, which although seems like a given, was not true with the other Katz. \n\nIf you are someone that wants to eat and doesn't care about the ambiance, I'd highly recommend this branch of Katz.", "author": "Raymond F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-10-27", "description": "Pastrami on rye is delicious! Got the potato salad which was NOT by favorite. Great portion but the salad was straight potato with mayo and maybe some vinegar. Not my style!", "author": "Vivian W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-07", "description": "The best pastrami, and no lines like the original.  A must visit if you're in downtown brooklyn", "author": "David A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-14", "description": "The first time I had the pastrami sandwich at Katz's was a pivotal moment in my life.  I'd never before had pastrami like that at ANY other deli.  It made me sit back and say to myself: \"Whoa.  There's pastrami, and then there's Katz's.\"\n\nSo on my recent trip to NYC, I absolutely needed to experience their wonderful pastrami again... so when I found out that they had opened a new stand at DeKalb Market in Brooklyn, I was intrigued.  Would their new outpost have the same amazingly tender, delicious pastrami as their original spot, but with no lines or wait?\n\nIt sounded too good to be true, and well, it was.\n\nDon't get me wrong - the pastrami sandwich at A Taste of Katz's is still pretty good.  But there's something missing from the pastrami here... it wasn't as juicy, it didn't have quite as much flavor, and the brisket (I got a combo sandwich - half brisket, half pastrami) was frankly quite dry.\n\nOVERALL: 3/5.  On the plus side - zero wait here, and the staff are very friendly.  But they're missing some of the magic that makes their famous pastrami so amazing.  I really hope they figure it out because I love Katz's and I don't want poor reviews of their new spot to weaken their brand, but for now I'd avoid their food stall at DeKalb and just go to their original location on the LES.", "author": "Eric C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-24", "description": "I have been to the original location numerous times and the location in the Lower East Side has never disappointed me.  \n\nThe ordering process was simple and fast.  A plus is that they accept credit cards which the original location doesn't. But that's all that's good about this place.  \n\nThe food preparation was fast and well packaged.  Thw meat was dry and really hard to eat.  My wife usually half leftovers and I would crave to eat that portion.   I dreaded eating her leftovers, there was nothing good about their signature pastrami sandwich.  The one I received was dry and not moist like the one made at the Lower East Side.  \n\nI would avoid coming here and stick with the original location.", "author": "Stephen L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-02-25", "description": "OMG I was so excited that Katz was coming to Brooklyn until I went.  The original one on Houston is the truth.  This is just a bad copy.  The meat wasn't as tender and juicy as I'm use to.  I guess if I want pastrami in Brooklyn, I will have to go to Junior's.\n\nSo disappointed.", "author": "Tracey L."}], "servesCuisine": "Delis", "priceRange": "$11-30", "name": "A Taste of Katz’s", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "445 Albee Square W", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/wnnglJOVj5uDPWGZJQPZOg/ls.jpg", "@type": "Restaurant", "telephone": "+12122542246"}