{"aggregateRating": {"reviewCount": 100, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-12-30", "description": "I shared a pastrami sandwich with my wife. The pastrami was good, but not as memorable as the location in the city. Price was really high and I felt like the portion was smaller.", "author": "Bryant Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-31", "description": "Great service Tiffany was amazing. Love Katz it's always a place you have to try at least once a year!", "author": "priscilla a."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-07", "description": "I'm only shaving off one star because of how expensive the sandwich was. As far as the taste, it was amazing. I have never been to the original Katz's so I don't have a true comparison point, but I can't imagine the original serving up a sandwich much better than this one. I got the pastrami with mayo/mustard on rye and it was phenomenal. I split it with my wife and I really wish I wouldn't have because I was quite sad when my half of the sandwich disappeared so quickly. If you are in Brooklyn and don't want to deal with a long wait to get a killer sandwich, this is a great spot to try out. Credit cards are accepted as well.", "author": "Mike W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-10-08", "description": "good food, a little pricey. The sandwich was tasty\nand side dishes. The mall was nice. The tip bowl\nwas not an option. That is why I take out.", "author": "Gayle D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-30", "description": "Not sure why this place has received some negative reviews. I've eaten at the original LES location multiple times and the pastrami here is every bit as good (IMHO). Obviously it doesn't have the old school vibe and history of the original but that's to be expected; on the plus side it also doesn't have the huge queues of tourists. \n\nAmazing pastrami. If you come for the food you will not be disappointed.", "author": "Tommaso S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-20", "description": "Wow, the pastrami on rye is as good as hyped. The sandwich doesn't look as impressive as it feels, when they hand you the bag you feel it. The meat is juicy and flavorful, and best offset by the mustard and the pickles they give you.\n\nI'd not add the mayo, it's heavy enough already. \n\nI did detract one star because it is hard to accept spending 25 dollars on a sandwich, even one that's this good. But I did it and I'd do it again sometime.", "author": "Erik S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-04-15", "description": "A fatty,flavorless taste of Katz! This Katz serves pastrami that is far below the quality of pastrami that is served at the Manhattan location. Serving greasy,fatty pastrami is a sure way to lose customers.I didn't return my $23.00 take out sandwich because I live in Manhattan. One costly mistake is all that I can afford. A $23.00 sandwich voucher will provide an opportunity for me to give you another chance.\nOn a positive note, the service was quick because there wasn't a line.", "author": "Joice T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-27", "description": "The food here is just as good as their location on Houston street, except that there is no long lines. Because there are the same company, their food taste exactly the same and they also give you a big portions. It is as expensive as the one in Houston, but you pay for what you get which is good food. I'm so happy I found this place.", "author": "Shona M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-05", "description": "The best pastrami anywhere and in the convenient DeKalb Market. An institution that must be cherished.", "author": "Jason T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-05", "description": "Was told not to leave without going to Katz. Two sandwiches, a bag of fries, and $50 bucks later I have concluded I could do without. Sandwiches are huge to justify the pricing but the meat wasn't moist - tender - or flavorful. I am from the SoCal area and Langer's is way more legit. So if you want to blow some dough on a sandwich then do it. If you want just a sandwich then you got plenty of options.", "author": "Cam A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-02-13", "description": "I ordered some food via their delivery system, Caviar, to be delivered tonight at 6:30pm for my brother-in-law who just lost his brother.  I felt it would be comforting to him as Katz is his favorite food.  Well, without notifying me Caviar changed the delivery time to 9pm (I checked online when my sister texted at 7:30pm to say no food had arrived).   When I called Katz's, they said, \"not our problem;  call Caviar\".  When I called Caviar, the phone rang for 10 minutes.  When I called Katz's back to see if there was any way to get my brother-in-law his dinner, I was told they didn't take orders over the phone but I could speak with the manager.  I was put on hold.  After several minutes on hold I hung up and called again;  I got the answering machine.  Really????  Never using them again.", "author": "Ruth W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-12-09", "description": "I was trying to avoid being starving when going to Trader Joe's, so I stopped by the new Katz outpost to have a Knish to hold me over.\n\nSo disappointing. The outside was hard from over microwaving or freezer burn - and tasted of oil dirty oil. Just smelling the outside you would know the oil that it was cooked in was filthy. The mustard was fine - but overall - gross. \n\nI was starving - and couldn't bring myself to finish it. It was $6 -- I have had $1-2 ones on the street that far exceed this. :(", "author": "Jaclyn V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-17", "description": "Amazing place and the service was great!! Have the brisket and matzo balll soup!  Though my wife had the pastrami and it was also amazing!", "author": "Chill C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-12-31", "description": "This is far from the Katz's on Houston street.  The staff is very rude and the food was not up to the original Katz's.", "author": "Pamela T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-19", "description": "I've heard great things about Katz's and I figured the Dekalb Market one would be just as good. It's definitely on the more expensive side, which I was a little turned off by but the meat was delicious! We got the half pastrami sandwich but we didn't eat it with the bread since my bf and I were sharing and the meat was overflowing so it would've been hard to eat as a sandwich anyways. The meat by itself is yummy but definitely missing something. When you eat it with the mustard and pickles however, it's perfect! I can definitely see why pastrami is their most popular, but I for sure would be down to try their other sandwiches as well.", "author": "Nancy V."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-09-08", "description": "Overpriced dry food. Beware: the cashier asks you questions as if what he's asking is included. Example: you want pickles too? Why in the living hell would you think I wanted 3 regular ass pickles for nearly 4 dollars? Never again.", "author": "Lola C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-30", "description": "The pastrami on rye is tasty and a meal in itself.  It also came with some pickles.  For $21.45, the sandwich is on the pricey side.  The meat is soft and moist and I wish the bread is a tad thicker as it breaks apart in my hands.  \n\nIt is a good local signature food to try.  Would I eat it again, may be on my next trip.", "author": "Kin N."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-06-26", "description": "First things first, I've eaten at the original many many times. So it makes sense that its my point of reference.. Laura, the cashier/order taker or whatever was amazing. She never stopped smiling and even shared a 15 second story while taking my order.. Simply amazing!!!.. Now to the other folks.... I was watching them make the sandwiches and the look on these guys faces told me they hated their jobs.. Should have been my first clue, but ignored it because I was at Katz.. At the Original Katz the team preparing your meal are very very engaged and always smiling. Second clue, the pastrami looked dry and it was. NEVER IN MY LIFE HAVE I EVER HAD DRY PASTRAMI FROM KATZ!!!! NEVER till now....OMG now I am disappointed and suffering from buyers remorse...", "author": "Wmb B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-05", "description": "Very meh. The sand witches I've had from here are pretty good but a little on the pricey side for what you get. You can say anything bad about the katz' meat. That being said the service here isn't the greatest. Very short when placing the order and not too helpful. That being said if the price was less, I'd give his place 4 stars. But if I'm paying $20 for a small ass sandwich it better be huge and the service better be amazing.\n\n\nSee below: giving an extra star because I appreciate the response. I will be back for sure to check you guys out again. I respect a business taking responsibility like this. Cheers.", "author": "Charles A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-21", "description": "So A Taste of Katz's is a stall in the DeKalb Market at CityPoint, just outside the soon to open Trader Joe's. They do not have the full menu of Katz's on the LES, but they have corned beef, pastrami, knishes and Dr. Browns, so who cares about the rest? The knish was delicious, nice and fluffy inside and toasty out, but I'm always disappointed they use Gabilla's knishes instead of a nice, round dough wrapped Jewish knish. The corned beef was yummy, although they need to work out some kinks (they'd been open a whole day before I dashed over for a sandwich): the meat was sliced a bit thick and the rye bread got a bit soggy and broke apart. Don't be freaked out by the $20 price tag - $1 more than the last time I got a sandwich at the original - because my husband and I split it and there still was enough meat left to make a second sandwich for lunch the next day.", "author": "Denise P."}], "servesCuisine": "Delis", "priceRange": "$11-30", "name": "A Taste of Katz’s", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "445 Albee Square W", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/wnnglJOVj5uDPWGZJQPZOg/ls.jpg", "@type": "Restaurant", "telephone": "+12122542246"}