{"aggregateRating": {"reviewCount": 100, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-07", "description": "Extremely overpriced for a sandwich, but you still get the same Katz's taste without waiting outside for an hour. However, part of the Katz's experience in sitting in the dingy lower east side establishment so some of the mystique of paying over $20 for a pastrami sandwich is lost by going to the new location. \n\nMy take - if you're a tourist and want to see Katz's this isn't a substitute, but if you're a NYer craving pastrami, go to Dekalb and grab a sandwich without the fuss of the Katz experience", "author": "Rachel M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-03", "description": "Kudos to Laura my waiter as my receipt says ...  I asked her about the quantity of meat in a sandwich and she was up front and very honest about it.  When I told her I was traveling a bit far on a very warm day, she said they would wrap the rye bread separately.\n\nWhen I got home, I found some excellent pastrami and there was a lot of it.   The bread was wrapped and well protected away from the meat, there was mustard, pickles, both sour and half, napkins pus extra napkins, a knife, fork and salt and pepper packets.  IT'S THE KNIFE AND FORK THAT BRING THIS TO A 4 STAR VERSUS A 5 STAR RATING.  They need to upgrade the plastic cutlery they give you.  It's weak, flimsy, cheap looking, doesn't do a good job ...\n\nWhen Laura told me how meat is placed inside a sandwich I was pretty amazed.   BUT, this is a costly sandwich $ 21.45 and at check out  the check out system prompts you to select 'add a tip' for the person taking your order.  You move to another area to pick up your order, which is an area where you can actually see the crew preparing the orders.  I was a bit miffed to see a tip cup there where the meat was being cut because no one was offering me any type of meat sample - as they do in the NY store ... I wasn't expecting it.  But given there is a tip cup there, what am I tipping you for ?  I wasn't too thrilled with adding a tip to Laura, but I did.    \n\nAbout the MEAT - fantastic.  Sliced by hand, beautiful cut of Pastrami, well cured and just fantastic fantastic and great again!  \n\nOne other thing - guys and girls, this is 'Jewish style' pastrami -  It's not to be mixed with lettuce, tomatoes, onions, etc.  This is to be eaten with or without mustard, nothing more, nothing less.\n\nENJOY", "author": "M M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-11-01", "description": "Wasn't as good as the real Katz's. The corned beef was deec. The split pea soup was pretty tasteless. Was full by the end, but felt kinda meh.", "author": "Andrew K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-17", "description": "It's Katz's!!! The pastrami tastes great and same as the original storefront location. \n\nThe meat is piled high - perfect sizing for sharing!\n\nThe only thing is their service is really SLOW. Definitely does not have the same speed as the original. Other than that, great addition to the neighbourhood!", "author": "Julia H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-27", "description": "A Taste of Katz's is by far the best place to eat in Dekalb Market. I came here once on my lunch break and decided to splurge on a whole pastrami on rye figuring I could take the rest home with me for dinner. The portions are so generous I could barely finish half! The meat, rubbed in a delicious garlic-peppery spice rub, was so tender and tasty. These sandwiches are definitely worth the money, though the price can be overwhelming at first. Honestly, you're paying less than $18 for a pastrami sandwich, or any traditional deli sandwich for that matter, you're probably getting shitty meat and your stomach will hate you later. Gotta pay for that quality people. \n\nI came back to this place a few days later to try the latkes and matzo ball soup--two dishes I hold very near and dear to my heart. My high expectations were far exceeded. The soup had a lovely flavor, lots of dill in the chicken broth and matzo balls the size of softballs. The latkes were fried to golden brown perfection and not too greasy. That's all that I've tried here so far, but I'll surely be back to try the brisket and coleslaw. \n\nI don't really understand why this place has barely decent ratings. It could be that people are expecting the same ambiance as the Katz's on the LES, and are disappointed at the simplicity of this place (which runs like a basic fast-casual restaurant: order, tickets, pick up window). However, the name plainly explains that this store is a \"Taste of Katz's,\" and while it may feel different from the original, the food is every bit as tasty as the one on the LES.", "author": "Lauren C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-10-23", "description": "I have always been a fan of Katz's and was so excited when I stopped in to the Brooklyn kiosk and ordered a matzoh ball soup to go. \nFor $8 and change I got a small soup.. no bread just crackers and the saltiest worst matzoh ball soup I've ever had. This is a sorry attempt at being the original Katz deli.. I'm offended by how bad this is. Never again!", "author": "Jorgie N."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-06-27", "description": "A taste of Katz ... perfect name for this place, because that's exactly what you're getting. Not full blown Katz, but just a taste, something similar, but not quite up to the original. Pains me a little to write this review. I was hoping, and fully expecting this outpost to be putting out top quality pastrami, like the namesake, LES original does. \n\nI went with the classic, pastrami on rye. All I can say is, meh, it was pastrami, but I don't see it impressing anyone other than an overwhelmed tourist, or a born-again vegetarian. Maybe I caught them on a bad day, but the pastrami wasn't nearly as tender as I know pastrami can be, and a good bit of it was noticeably rubbery. I should have known something was amiss when the best smell coming out of their stand was from the hot dogs, which, I'll definitely be back to try. At least they have Dr. Brown's cream soda.", "author": "Mike F."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-03-25", "description": "Thanks Jake D; I appreciate your response. Will think about giving Katz's another visit.", "author": "Jimmy L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-04-01", "description": "Worst corned beef sandwich I ever had. The slices of meat were thick, dry, chewy, and inedible. There is no way this place should be in business selling such low quality product at a ridiculously high price point. Don't believe the hype - this place is clearly living off of its name and not its food.", "author": "J M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-02", "description": "Yuck! Sooooo disappointing....the pastrami sandwich should have been name \"fatstrami\" as it was 1/2 fat instead of meat... for $22.00!!! Gross!\nI love Katz's on Houston and was looking forward to having a place in Brooklyn but won't go back to this location no matter how convenient - This side stop should be side stepped!", "author": "Julie L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-02-25", "description": "Was so excited to get Katz's normally delicious corned beef, which I've eaten many times at LES. I ordered a pound to bring home for my family. I have NEVER written a complaint about a restaurant, but I really just can't let this go.  As I waited, I watched  my order being prepared.  When I expressed concern that the slices were too thick I was told not to worry. My regret is that I didn't insist. But it's Katz's! I had faith.\n\nGot home and upon opening the package discovered thick chunky slices. And the meat tasted terrible. Not edible.  I'm out $30 and still have to figure out dinner.\n\nSo very disappointed.  I'm not seeking any refunds or special attention. I just want Katz's to know that they need to manage quality control in their satellite shops.", "author": "Laura G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-11-10", "description": "The food here is good - no qualms there. The issue is that the portions are too small for the price at this outlet. $21.45 for a pastrami sandwich that has the same amount of meat as your local lunch deli sells for $8.95.\n\nI grew up on the East Houston Street Katz's, before the days where there was a line outside to get in.  And the sandwiches were always packed with enough filler to take home \u0026 make seconds and even thirds with your own bread.  If you want the real Katz's experience \u0026 your money's worth, you're better off heading to the original on the Lower East Side.", "author": "Doug W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-18", "description": "Everything about this place was my childhood. My Dad was Russian Jewish and Katz's is amazing. Just the taste of that corned beef and I was ten years old again. Just loved it. My husband got something else and was picking at my Reuben. The matzo ball soup is also sublime (and better than mine I will admit). Next time I plan to take home some Knishes for later. Awesome place.", "author": "Tai L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-27", "description": "Amazing pastrami sandwich! So happy you guys are in  Downtown Brooklyn. Only was able to eat half of the sandwich cause I was so full.", "author": "Sonia E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-13", "description": "These reviews seem rather harsh to me. Maybe people are here when Katz first open. Have no idea, but we ordered a Reuben, paid the extra dollar to have it with pastrami. The pastrami was very moist, and only had one tiny piece of fat. The bread was fresh. We cut it in half, and I didn't finish my half cause it was quite filling. See pictures for reference. Five stars for the sandwich, minus one star for the price.", "author": "erica m."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-29", "description": "Stop FORCING us to take the sandwiches to go. This ain't called Katz' to go. Not only was the meat dry and poorly cut compared to the original location, the whole sandwich fell apart when we opened it up out of the bag and wrapping. Disgusting. Never again for this amount of money.", "author": "Jason O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-27", "description": "I decided to pay the Brooklyn location a visit seeing as it's close to where I work. I ordered a sandwich and a few knishes. Sooo good!  It may seem expensive at first but the amount of meat that's on that sandwich, Wow! I had a half for lunch and the other half for dinner! \n\nThe guys and also a lady that helped at the register were awesome as well. I'll be back for sure.\n\nThanks, Brooklyn Kats for an awesome and tasty experience.", "author": "Khatia D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-02-16", "description": "It's not the same as going to the original Katz, but if you are looking for a \"taste\" of it, then this works. It's in the foodcourt of a mini-mall that has lots of options. The location is great but the service is meh. One sandwich is very expensive, but it is enough food for more than one person. We shared. So, basically- it is what it is.", "author": "Ursula T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-23", "description": "Fantastic pastrami on rye sandwich with a cream soda. OMG. Perfection.  Had to save half for later. They never firget the cindiments and napkins. Friendly smiling staff and the cashier, Alliyah's memory is ALWAYS on point. Delightful experience every time.", "author": "Chris P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-09-03", "description": "I had the brisket on rye and was extremely dissatified with the quality of the meat. Very fatty sandwich. For the price they are charging, you would expect a better sandwich.  With all the other options in the food court I would not recommend Kats's Deli.", "author": "Kenny I."}], "servesCuisine": "Delis", "priceRange": "$11-30", "name": "A Taste of Katz’s", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "445 Albee Square W", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/wnnglJOVj5uDPWGZJQPZOg/ls.jpg", "@type": "Restaurant", "telephone": "+12122542246"}