{"aggregateRating": {"reviewCount": 100, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-10", "description": "I have been to the original Katz deli once in 2011 and I distinctly remember being so WOWWED by their sandwiches!  So I tried this new location twice last Sunday and these were the pluses:\n1) very short line (if any at all) to order and very quick wait times to get the food\n2) credit card payment is accepted (unlike the original which is only deals with hard cash -- no need to bring wads of $ especially when you order add-one) and \n3) super friendly staff -- a special shout out to Wilson who gladly let me sample different meat slices so that I knew what I would feast on!\nThank You to the 'eager to please'k Katz crew at Dekalb Market Hall :)\nThe pastrami and beef brisket are truly DELECTABLE!  1/2 sandwich is more than enough to satisfy a hungry tummy due to the generous portions of meat.  And the soups (giant matzoh ball and chicken noodle) were delicious as well.  \nHow I wish there was a  Katz Deli where I live because I would definitely be a regular.  Hmmm, did I read somewhere that online ordering and delivery to California is possible?  I'd better check that out and spoil myself for Mother's Day, haha.", "author": "Tess S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-02-25", "description": "I went here with my S.O. for a quick bite before a concert at the Barclays. The service was quick. The cashier was so nice! Her customer service was A1!!! She saw that i was about to order the whole menu and she told me to hold on and think about what I'm ordering. She knew I didn't really want the soup and she knew i didn't need the fries. She literally made our day because she suggested that we get a whole sandwich and she would have the mustard for him and the honey mustard for me on the side. You would think that we could have thought of this on our own but I was hungry and being a brat. I can't remember her name but she is literally amazing. She saved my S.O. $30 lol.\n\nAlso, the food was great. This was my second time having Katz and I was not disappointed at all. I was literally filled to capacity after eating half of a pastrami sandwich!", "author": "Shanice G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-02-14", "description": "Posting this for my Mom who was really disappointed with her experience at your Brooklyn location:\n\nOn Jan. 15th I visited your Brooklyn location at approx. 11:30 am.  Over the past 30 years I have eaten at the original Katz many times, always ordering the pastrami on rye so this is what I ordered on this visit. I was terribly disappointed, the pastrami was dry and tasteless, the bread even fell apart as I bit into the sandwich.\nI didn't expect the original Katz experience, the sound, the smells, etc., but I did expect the sandwich to taste the same. I only knew I was eating pastrami by looking at it. I brought half my sandwich home for my daughter. I hadn't  shared my thoughts when she tasted the sandwich and said \"this is terrible it has no taste.\" Hopefully this was a fluke that day, but I will not return to this location.", "author": "Keisha B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-05-04", "description": "A Taste of Katz's is Katz's younger sibling in the Dekalb Food Market. If you can't get to the flagship store, this is a good place to experience what Katz's is all about. The sandwiches are huge and generously filled. While they are expensive, you have to give it to Katz's for doing it right. I appreciated how they packaged their take away bags. Your sandwiches come with plates, full sour and half sour pickles, napkins, salt, pepper, and mustard. I wish they gave water cups when asked but hey, it happens at a lot of places. You can take your meal to go or sit at the counter. Definitely sit at the counter. It's cool to watch how they create the sandwiches. When you see how much meat is carved and goes into your sandwich, you might get a deeper appreciation for your sandwich. Could you get similar quality for cheaper somewhere else? Maybe, but it's a classic for a reason.", "author": "Esther L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-02-24", "description": "I just thought this was highly overrated and did not live up to my expectations. Definitely not the same as the OG location. I asked for coleslaw on my sandwich and they forgot to add it and the meats were lacking flavor. Definitely not worth the 28 dollars I spent on my sandwich and honestly probably won't come back.", "author": "Daniel P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-05", "description": "I've loved Katz's as long as I can remember. My grandfather claimed to call a Katz a friend. My father makes a point to stop by just about every time he's back in the city and as a result, I've been going to the original LES location for over thirty years (they've been going far longer). \n\nNow, we haven't been going because it's affordable (the price has crept - nay, sprinted up over the years), we haven't been going for the service, and we certainly haven't been going because of the weird ticket payment system.\n\nWe've been going for the pastrami.\n\nSo I was understandably excited that this pastrami was moving over the bridge a few blocks away from my apartment. And after a few visits and much pastrami, I'm not sure how to put it...there's just something missing here. \n\nThe pastrami is still good, but it often seems a bit drier, a bit less flavorful. I don't know if it's the cutters, the lack of turnover since it never seems to be busy, or simply my own brain missing the original atmosphere...but it's just not the same. I'm sorry if I'm being silly and/or nostalgic, but there it is.\n\nDon't get me wrong. It's still good pastrami...it just isn't the best I've ever had, which is what the LES Katz's represents for me. \n\nThat said, you can still catch me over there because IT IS delicious pastrami that I can get without waiting on a giant line, and it's a few blocks away.", "author": "Peter D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-30", "description": "I first tried Katz in Manhattan and was very disappointed.\n\nLong line, super expensive, and worst of all, my pastrami was dry. Years later I discover Dekalb market, a less crowded, more attractive Chelsea market out in Brooklyn. I see Katz and circled around it a few times because I was craving a pastrami sandwich, but also scared to be let down again. The feeling is similar to trying in n out over and over again in California, just so I can force myself to like it. How can you not like In n Out or Katz?! So I forced myself to try Katz again and I'm glad I did. Incredibly juicy Pastrami!!!\n\nKatz is well worth the money... when it's juicy of course! ;)", "author": "Diana N."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-12-21", "description": "Friendly staff\nI highly recommend you go to the original location as this spot is lacking the same depth of flavor\n\nCost is also super expensive \n\nOverall Thoughts\n\nIt's worth the trip/time to go to the original location, your wallet and palate will thank you", "author": "Eddie W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-06-21", "description": "I have been meaning to try Katz's for long time but there's always a long line in the original LES location so I'm glad they opened a location here. I ordered a Pastrami sandwich on club bread (extra $1) with lettuce (extra $0.60) and tomato (extra $0.60). The sandwich was super big and filling. I split this in half with a friend and I couldn't finish it. It was lots of meat and overall very heavy. The sandwich was alright. It wasn't out of this world. \n\nWe also ordered the potato latkes ($6.25) and it wasn't that great. I don't recommend it as it was bland even though they gave us apple sauce and other condiments to go with it. It was slightly mushy. I actually preferred the frozen potato latkes from Trader Joes and frying them on my own.", "author": "Teresa C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-12", "description": "Best food in all of NYC!!!!\nBest pastrami and corned beef I've ever eaten!!!! So juicy and tender!!!\nBest mustard!!!\nGreat service and friendly staff\nSame great quality food as the original \nHopefully I'll return to the Houston St. location soon so I can review it.", "author": "Daniel L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-02", "description": "This is another must try place for pastrami sandwich in New York. Yes, it is $25 for a big pastrami sandwich but it is to die for. Maybe if you're from Hawaii like me you really appreciate awesome pastrami sandwich like this. Unless, you're a huge eater, I recommend splitting with someone. All I can say it that it's done right and worth every penny. You gotta admire the beautiful pink color with dark edges. There's nothing like it. The sandwich also comes with 2 huge pickles. This place gets busy so be patient.", "author": "Joyce L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-08", "description": "Katz's Deli is a New York institution. Have you ever been to the OG location? Its a PIA place with a ticketing system, jammed up with tourists and expensive as hell. It's still a five star joint for pastrami, the food is legendary. \n\nWe had dinner in New York City and my brother in law has never been to Katz. We walk by the booth and he says I have to try it. Now I'm thinking its Saturday night, the meat is going to be dry as hell, no bueno. We grab a few Dr. Browns sodas and he ordered a hefty pastrami sandwich.\n\nWhen we opened the package, this had to be the most moist, tasty and perfectly cooked pastrami I ever had. The four of us were like, OMG its crazy good.. Trust me, if this pastrami sucked I would be slamming this place. Most of the reviews are slamming A Taste of Katz's based on price. Guess what? The prices on par with other high end delis. If your going to order a sandwich, be prepared to throw down some paper and don't pitch a bitch about it.\n\nA Taste of Katz's is a smaller version of the original location. I highly recommend coming here for a huge pastrami sandwich with no lines, ticketing system and tourists.", "author": "Bill S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-01", "description": "I mean, clearly you don't need me to tell you that Katz's:\n\n1. Has the best pastrami sandwich you can get just about anywhere\n2. Is ridiculously expensive\n3. But 1+2 still = go there\n\nAsk them for the extra fatty pastrami. What? You want extra extra lean? Are you serious? No, no, no. Extra fatty. Go on - you're welcome.\n\nPlunking down $25 for a sandwich makes my heart hurt, as does eating a pound of fatty pastrami goodness, but live a little, and go to this branch of Katz's. It's the same as the original without all the silly waiting.", "author": "Julie B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-25", "description": "Let me clear my throat !!! Bottom line people... Katz has the best Pastrami sandwich in Brooklyn (don't forget the sauerkraut) yummy . Service is the best and all the staff are friendly . Shouting out the cashier who took care of me. Tiffany you're the best and keep smiling . Thank you for an outstanding experience... I'll be back again .", "author": "Alethia R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-04", "description": "Well worth the money! Can't believe this location has such a poor rating. I had the Pastrami on rye with spicy mustard, lettuce and tomato. This sandwich is huge. The meat... oh my goodness, so flavorful and tender. You really don't need anything else on it except the meat. I watched them carve and prepare my sandwich. An excessive amount of meat, but like I stated, well worth the price! \nKatz has been around since the beginning of time, if you're in NY.. definitely give them a try! This location is more of a fast food place. If you want to sit down and have more menu options, check out the original on E Houston.", "author": "Missy F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-01", "description": "It's still the third best pastrami I've had.  Yes I at at the original many times and always loved it and I always get the same thing my pastrami sandwich on rye mustard on the side. \nI have to say this Katz Annex wasn't as good as the original. Yes the meat wasn't as tender as original  and at times a little dry. The flavor weren't what I'm use to with the original, but it's hard to measure up when compared to greatness but again it wasn't that bad that I'd say I would never try it again . But let's say if the original and this one were next to each other I'd choose the original every time.", "author": "Jahmal P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-25", "description": "Still the best pastrami on rye in the city!!! Special s/o to tiffany from the downtown brooklyn site shes the best", "author": "Aaron C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-04-27", "description": "Do not waste your time if you favor the Katz delikatessen on East Austin then stick to what you know... Not only was there no rolls everything is served on rye bread ....pastrami and corn beef ...smh...never again...the service is not 100% either ask for mustard and mayo...got an attitude...ok..no...get to my table and no mayo...go back to the counter to have it damn near thrown at me....I DO NOT RECCOMEND THIS PLACE STAY IN THE CITY...THEY TASTE BETTER AND ARE BETTER AT CUSTOMER SERVICE.", "author": "Arkeem D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-11-12", "description": "I know this location always gets a bad wrap but when you live in Brooklyn and you have a fix for some amazing Pastrami, look no further. \n\nFor starters, the line is non existent (which is a plus and also concerning) and the quality is pretty solid. This outpost definitely misses an ambience but what do you expect in a food hall. \n\nAgain, if this is your only way to try Kat'z, I would opt for the original LES location but if you live close to this location, give it a go! It should satisfy your cravings for some legit Pastrami! \n\nMy only fear; can this location survive? Let's do our best to make sure it lives on.....", "author": "Thomas M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-21", "description": "We have been dyling to try Katz's after seeing it on so many tv-shows. It was a great treat with the ca 500 g pastrami sandwich with spicy mustard as only condiment. I enjoyed it but my wife thought the sandwich needed some lettuce and greens for the balance. Im a man and a carnivore so i disagree. \n\nThe price for a lean sandwich with pastrami was about 23 $ wich is crazy high. You could get a steak dinner elswewhere at that price. But this is the typical U.S style pricing. When something has been around for ages and people like it, the pricing gets as high as people are willing to pay.  Im happy i have tried it as it was on my bucket list but of course you can get a better overall sandwich at max half the price of this one.", "author": "Stefan W."}], "servesCuisine": "Delis", "priceRange": "$11-30", "name": "A Taste of Katz’s", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "445 Albee Square W", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/wnnglJOVj5uDPWGZJQPZOg/ls.jpg", "@type": "Restaurant", "telephone": "+12122542246"}