{"aggregateRating": {"reviewCount": 100, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-12", "description": "Do NOT try this location with all of the other options in that food court. One of the WORST customer service experiences I've ever had! After our order had been called, my boyfriend said he didn't need an extra plastic bag and the preparer snapped back at him \"This isn't for you! And yours has already been packed!\" and then threw it down. When we asked why a request to save them time and plastic required rudeness she then called her manager on US to say that we were being rude to her?! He then came over to defend her. I'm guessing she'd either had prior issues due to maybe a mental or personality disorder or they were dating, but it was completely uncalled for and unprofessional!!!!", "author": "T F."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-11-13", "description": "I went to \"A taste of Katz\" and I was excited to try this famous spot of New York. Now a little background I have never been to the real Katz deli so I am not sure if there is that much of a taste difference but after going here......I rather save my money. $21.45 for a pastrami sandwich? I'll goto a hole in the wall deli in the bronx and get a better sandwich for half the price. \n\nThere were was a spot across from Katz that was a bbq spot my girlfriend got a pulled pork sandwich and it blew my sandwich out of the water.\n\nSave your money.", "author": "M C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-02-19", "description": "Just not how I remember it. I knew my food was going to be on the pricey side but not this pricey. You do get a lot of food, but it's just not that tasty. I remember enjoying the original Katz and I hope I still will. If you're looking for a place to have lunch look elsewhere.", "author": "Joshua R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-09-06", "description": "My husband and I have been eating at Katz's Deli 205 E Houston St, New York, NY 10002 since we were children, always enjoyed our meal. Today I ordered two pastrami sandwiches on rye at Katz's DeKalb Brooklyn. We both agreed it was the worst sandwich we ever had anywhere. Dry Grisly pastrami, cut improperly. If Katz's at Albee square/DeKalb in Brooklyn hopes to keep customers. They must deliver the same quality product cut properly with the same inviting service team as the E Houston location. We will give them time to improve before trying again for a $20.00 sandwich. We really want Albee Sq to be a success.", "author": "Jackie D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-10-01", "description": "The trusted name is this only reason you might want to shell out $23 for sandwich on standard commissary sliced rye bread down at this new outpost of Katz Deli.  Next door, You can buy trader Joe's entire corned beef and entire loaf of better rye for less than one sandwich here. But you know you can trust Katz meat is go so cant argue with that (so i thought). Last week i went to this location and they had a cheesesteak they were selling as a special and im from Philly originally and this was just a shameful display of bad hero bread, fake frozen steak-ums , and the wrong type of cheese. Katz should stick to what they know  before they risk ruining the rep of what generations built. To top it all off the sell it for 17.45 and i just cant understand why they are even offering it if its not done the right way.", "author": "i V."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-03-30", "description": "Hi this is the worst possible representation of Katz's deli there has ever been.  HORRIBLE!  The meat is dry as a bone they give you the stuff they call gravy versus jus from the brisket and this mud they dare to call P soup it's horrible.  I can't even imagine anything this bad.  I got it home already having my mouth tuned up it's still wet so I bought non-alcoholic beer objects not alcoholic or ready to chow down and I get this horrible piece of crap for 20Yeah for $20.45 each for my brother and I and I ate like a quarter I kid you not a quarter of the sandwich and just said I can't do this anymore I want him having to do peanut butter and jelly I got ready to take it back yesterday but I was running behind schedule and couldn't do it this is horrible I don't even know what to do it makes me never want to try Katz's downtown Brooklyn again.check out your people Katz.   I don't know if this is a franchise or what but whatever it is needs to be burned in health absolutely Lorraine Gamble-Lofton we bout to go get a picture to two", "author": "Lorraine G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-08", "description": "Totally different than what you have at their original location. Don't expect to have the same quality. We ordered 2 classic pastrami sandwiches, waited 20 minutes and once I told them that I am waiting for 20 mins, they gave us  sandwiches  which are\"not being picked up\" by other customers. The sandwiches were cold and dry. Big disappointment!", "author": "Erik C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-08-15", "description": "I have been going to Katz since I was a kid and this new Brooklyn location is the worst! The meat was sooooooo fatty, nothing like their NYC location, they only give you 2 pickles, one sour and one half sour. I will continue going to their Manhattan location but will never return to their Brooklyn Location. Its just not the same. I doubt very seriously if this place will make it because old fans of the original won't go back to this new location after trying it and new customers will be turned off by the price - $21.45 for the sandwich and $6.95 for fries.  I was the only person on line.", "author": "Jonn B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-07-30", "description": "My pastrami sandwich costs $25. Including a $2 tip for a takeout. I'm ok with paying that price to try the \"best\" sandwich ever.  Boy was I disappointed.  The pastrami was so fatty.  I couldn't eat half of it.  The must was nice, I don't usually like mustard. The pickle was tasty too.  I wouldn't go back.  The smoke meat sandwiches in Montreal are way better.", "author": "Yi L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-21", "description": "Dried out brisket sandwich for $22.  You have got to be kidding!  No lines on a Friday afternoon for good reason.", "author": "Steve W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-26", "description": "this deli is in the food court in albee square. it is the same as the main Katz on the lower east side. a mountain of meat,salt,fat for a price most can afford. you need a partner to share the sandwich, or you will get sick trying to eat it all yourself. you really must love jewish deli to eat this stuff. its very strong in flavor- nothing subtle about any of this. pastrami and corned beef are the stars,and things like knishes,a jewish favorite,is available but not special in any way. if you never had this food before,you should have it here first. Its fresh and well made and they really know what they are doing. a real jewish NYC experience you won't soon forget.But not for the weak of heart(stomach).", "author": "Len S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-28", "description": "I ordered a corn beef sandwich thinking it's the same Katz Deli.  Ordering was easy.\nThey never asked if I wanted my sandwich lean or with a little fat.  Past that everything went down hill.  I love Katz and for many years I lived on 2nd Street between Aves A \u0026 B  and enjoyed many sandwiches there.  \n\nBut with a sadness in my heart, I have to say, there was not enough meat, the meat was not sliced but  in crumbles, it was dry and tasteless.  I would not eat here again I would go over to Manhattan and get the real!", "author": "Rah A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-01", "description": "Can't beat Katz's pastrami. I don't know if it's as good as the LES location, but it's sure better than almost anything you can get anywhere else.", "author": "Simon B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-10-21", "description": "Extremely disappointed. The price of $21 should ensure an excellent sandwich. Instead I got a very fatty, hard-to-chew, unpleasant tasting corn beef sandwich", "author": "geri S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-07-19", "description": "I had a very high expectation for a deli that charges $20 for a soup and 1/2 sandwich. I got matzo ball soup and pastrami on rye. This is the first time in my life when i did not finish my matzo soup and it its not because the portion was so large, but because of the taste. It smelled like fish!!! A very very very strong order of fish. I had this type of soup in many different places, but this one i could not eat at all! What a waste of money. Pastrami was much better, but could have been a little leaner on white fat...", "author": "Peter N."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-09-05", "description": "Today I had the pleasure of going to the Albee square mail, or shall I say regrettably had the pleasure, I was excited I wouldn't have to drive to e houston with the awful traffic, ordered my fav my pastrami on hero mustard , I couldn't believe the meat was dry and tough , the bread was hard almost stale, as I discovered when I got home , the meat slicers were not friendly and hell they didn't offer any meat to eat while I awaited for my two sandwiches . They have to do better I will continue to go to e Houston . Manager pls make sure the location in bk take notes from Houston .", "author": "Lytia W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-03", "description": "I've been happily going to the original for over 25 years and happy with the pastrami in the new location. Though moist and juicy, the most surprising thing was the intensity of the flavor. They  were absolute mouth crack and reminded me of how the sandwiches tasted about 5 years ago just before they went through their rapid expansion of customer/tourist traffic. Their original location meat now is about 90% of what it was, likely because of the sheer volume they have to prepare daily. Still tastes better than any other pastrami but not like it used to. The Bklyn location is smaller so maybe that's the reason why. My lady friend mentioned the same after the first bite confirming what I was thinking. \nGiving it 4 stars since it's still the best available, but $21.45 for a pastrami sandwich is a lot of money and a buck more than the original location. The prices seem to always be going up. How much before even the most loyal customers say it's too much and stop going?", "author": "Mr. S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-07", "description": "i was super excited when i found out that they open Katz at Brooklyn,  but got pretty disappointed once I try their sandwiches. the quality is not the same as the main store at Houston Street. the pastrami sandwich was dry, not worth it's price.", "author": "Christine T."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-08-04", "description": "I've given this place 3 tries. And they struck out every time. Are the same owners of Katz LES really behind this? So disappointing. Seems like they just want to cash in.", "author": "Malcha R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-08-03", "description": "I am extremely disappointed with the service I received here Thursday I paid over $26 dollars for extra lean pastrami, waited for my order number which was served to me by a rude black female. To add insult to injury i take it back to work and the sandwich was not what I ordered it was fatty! Calling the number on my receipt and being kept waiting to speak to a customer service rep I got the Manhattan location because Brooklyn does not have a phone number. I explained my situation.  Part of the problem with this location is the guys who work there spend more time flirting with female customers instead of concentrating on their work. One big dude in particular was saying to a female \" you should try my fat hot dog\" with the woman responding \" LOL My God\". The dude says \" Thats what my girl always says\" Who wants to wait for their order listening to this street talk. The manager who ever it is should start managing so paying customers get their correct order. I wonder if there is a place for staff to wash their hands. The guys are sweaty and filthy looking.This place is a turn off and I will never take my business there again.", "author": "D. M."}], "servesCuisine": "Delis", "priceRange": "$11-30", "name": "A Taste of Katz’s", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "445 Albee Square W", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/wnnglJOVj5uDPWGZJQPZOg/ls.jpg", "@type": "Restaurant", "telephone": "+12122542246"}