{"aggregateRating": {"reviewCount": 245, "@type": "AggregateRating", "ratingValue": 2.5}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-09-16", "description": "While my wife and our guests had a fabulous time here for our wedding reception, it was definitely not due to the waitstaff. They attempted to rush us, up sell us, and hurry us off at all points of contact. They were incredibly rude, and had on numerous occasions bumped into us without any apology. They even had forgotten our reservation, which they had just called to confirm two days prior. Thankfully my friend was dropping off the cake, otherwise nothing would have been ready. If not for the location (right under the Brooklyn bridge) and the yummy (though over priced) food, it would have received no stars at all. Definitely will not be going back there and I would not recommend it to anyone.", "author": "Erin M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-09-10", "description": "Sometimes it's fun to do the tourist thing in your own city.  LOL.  This place was a fun stop on a fun evening tooling around Dumbo.  Why haven't any of my fellow yelpers reviewed this place? \n\nWe got the prix fixe menu with salad pasta and main.  I have to say I was most excited by the salad, tri-colore with arugula and endive.  Yum.  The bottle of cabernet wasn't bad, and the service was great.  The waitress was super friendly and on top of things.", "author": "Sean S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-09-23", "description": "This place is only horrible and over priced. Had a $13.00 order of over cooked calamari that was as tender as shoe leather. And a fettuccini that a Russian grandmother would be proud of. The ceasar salad with chicken cost as much as a main course at $19.00. I blindly walked into here. Every one do your self a favor and never come here. Never...", "author": "James D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-10-02", "description": "Ripoff!! Bad service !! average food ! Way too expensive!! Don't even think of coming to this restaurant!!", "author": "Nicolas D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-05-31", "description": "There is simply no excuse for eating here.  The food is overpriced and horrible.  The wine tasted like it had been sitting out for days.  The waitstaff is inattentive and pushy.  The decor is a little gaudy (which would be fine if the place had character or the food was decent).  \n\nThe place survives purely on tourist traffic that does not want to wait on line at Grimalidi's/Julianne's.  I don't blame them but the correct thing to do is head into Brooklyn Hieghts or Dumbo.", "author": "Robin C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-08-29", "description": "DO NOT EAT THERE, NO THERE EAT THERE,  ONLY  ATTRACT UNKNOWN TOURISTS  EVEN THE LOCALS WOULD NOT GO THERE, THEY WOULD HAVE PIZZA NEXT DOOR and THEY HAVE A LINE THERE WAITING.\n\n\nLast night, My partner , Timmy and I ate here.  Throughout the whole  night.  he was Tossing and Turning all night after what seems to  Normal dinner.  I had mussels and Clams. Timmy on the other hand, had Spaghetti and meatball,  The service was bad.   The tap water came in room temperature.  I had to ask for ice and the waiter did not know whom/ where to obtain them.  After seeing her run back and forth the reatuatuant twice.  she finally brought us a glass of ice.   They were cheap on the bread and butter as well == We had to ask again.. The place was very inattentive.   Timmy got sick from the spaghetti all night,  I had a feeling it was either the  meatballs that look processed since you can cut it like butter  OR the gradated cheese they gave him from a canister and not freshly gradated by hand..  I called 311 and filed a report  4:35AM   ==     DO NOT EAT THERE.  I should have seen the sign since the place was empty to begin with and all the other place were crowded and people waiting in line.  There was an old man and a young lady who were wearing RED t- shirts.  I asked  one of the waiters who it was , he old me that he is a waiter.  First of all, He was on the phone carrying on for the duration of our stay, Why would any establishment would let their waiter  eat and talk in public on his cell phone in view of the public.  Also his female companion seems like she was running the restaurant .  She was running around changing the climate control in the restaurant and helping our waiter  our bill.  Their staffs are unequipped   and were not giving the necessary training / tool to run this place.   This place is a F===ing joke and so is the owner.", "author": "Sammy C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-11", "description": "I love this place, I usually go for dessert and wine. The ambiance is nice, the bartender is always very welcoming and I could say they probably have the best Italian cheesecake in NYC. Can't wait to go back", "author": "Carlos M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-02-24", "description": "-1 star if I could, the head waiter/manager or the owner idk her behaviour is disgusting, very pushy, got upset and mean because we didn't order drinks like wtf, over priced,, food wasn't good either, she kept talking in her native language probably cursing at us lol, they pretend they are Italians but they sound eastern European. Avoid this place,,,,,,", "author": "E K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-20", "description": "It's a sweet little place, open just a few weeks. The owners (formerly of O'Crepes) were friendly and said they were still working out the menu, though they focus on organic ingredients. \n\nHappy to see a shop open in Fulton Ferry Landing with new food options. \n(And not another pizzeria on Old Fulton Street).\n\nOn the menu: sweet and savory crepes, Vietnamese sandwiches (Banh mi), fresh juices and smoothies. \n\nWe ordered savory crepes. They told us the food would be carefully prepared -- and made with love. (Nice!)\nI had the Yoga Sun -- stuffed with feta, spinach and fresh tomatoes. My husband had the Brooklyn Bridge -- filled with chicken, mushrooms, onions and cheese. The crepes were light, but made well enough not to tear, and they were delicious. Looking forward to sampling more of the offerings. Eyeing the dessert menu and the Hula Hoop....", "author": "Toni T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-12", "description": "Best crepes I've had outside of France. Very quaint, the food is so good, sweet or savory and prices are so reasonable. Check out the Brooklyn Bridge savory $9, or the Nutella $6, or create your own.", "author": "Denise J."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-07-18", "description": "2 stars because the waitress was friendly, otherwise it absolutely warrants a 1 star.  Food so bad I thought I was getting Punk'd. I mean seriously. I was wondering why it was empty. Now, I know.", "author": "Ben C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-07-18", "description": "Been to this restaurant twice. The first time, I ordered a pasta dish that included broccoli, sausage, and beans and explicitly asked that the beans not be included in the dish. It came out with beans but without sausage and I had to ask them to remake the dish. When it came out a second time it was made correctly and tasty. Mistakes happen. \n\nWent back a second time and ordered the same dish with the same instruction. This time, instead of broccoli, they made it with broccoli rabe. We called them out on the switch, and at first the owner/manager tried to deny that there was anything wrong. When we told them we understood the difference between broccoli and broccoli rabe, she tried to apologize and admitted they were out of broccoli, but then she said broccoli rabe was better anyway. Please don't tell me what my food preferences should be. The sausage also contained lots of hard bits that were inedible. \n\nWon't be going here again. Plenty of other great options in the Dumbo area.", "author": "Rez M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-28", "description": "I live across the street from this place. Been there once. It wasn't a horrible experience. Food was decent. And so was the staff.", "author": "Dale T."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-05-28", "description": "This place is a hot mess.  Seriously.  You walk in and you think it'll be a cool atmosphere but the waitresses are beyond stressed, all over the place and there aren't even enough seats for the amount of tables (6).  \n\n-Parisian (swiss cheese, ham and a fried egg): it was runny and the ham wasn't great.  EHH is was such a runny mess. Yikes!\n\nFINAL VERDICT: The way they delivered the bill was pretty cool (in this little box which collects your cash because the place is cash only), but don't waste your money.  Poor service, not-so-great food.", "author": "Alexandra K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-16", "description": "Been to this fancy spot handful of times. It's definitely a place not just for tourists but New Yorkers also. If you ever want to feel like stepping back in time after a nice walk around dumbo then you can't go wrong with coming here. You get a feeling of hospitality and welcome from the waiters and the hostess. Prices are decent even though you may think it's top of the line, anyone and everyone can enjoy coming and ordering without frowning at the menu. My personal favorite is the mussels and clams appetizers, the broth is delicious. It's become one of my favorite spots to stop by whenever I'm in the neighborhood.", "author": "Ardit B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-04-12", "description": "We stopped at this restaurant since we were hungry and tired. We were seated right next to another table out on the sidewalk and the entire meal the waiter reached over my head to give them their drinks and dishes as well as clear the table. This is totally unacceptable! When it is ok to reach over your patron every five minutes to get dirty plates over another table?! The service here is horrible, they have no idea what they are doing. If it was up to me I would have tipped them $2, they honestly did not deserve more. We actually didn't even get our bread until the end of the meal. The food here is subpar, not fresh and completely overpriced for the quality you are getting. I should have just grabbed a burger next door instead.", "author": "Joyce L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-09-03", "description": "This place was a very last-minute choice - 7 people exhausted after walking around the Metrotech area (yeah, it was a long walk).  I made the reservation over OpenTable and when we got there, it LOOKED promising - old world decor with wood embellishments, French painting, cozy feel.  However, the service and the food were a completely different story.  \n\nFirst, we had two vegetarians in our group - any restaurant I have been to would have accommodated to their preferences.  Instead, the waitress made no effort in suggestions, the other waiters passing out the food made very rude and snide comments under their breath but still very audible to the group, and the one vegetarian dish took 25 minutes AFTER the first order was botched.  \n\nSecond, the service was EXTREMELY slow.  One member of our group ordered a beer and it took over 10 minutes (plus myself addressing the waitress a few times).  I can understand a crowded bar/restaurant for that wait but there was NO ONE at the bar except for the bartender and at most, 4 tables were occupied.  \n\nThe food was OK at best, but we could have gotten better quality for less elsewhere, and no, I would not pay the amount of their \"suggested gratuity\", which was 70% of the base price.  A typo maybe, but it really sealed the deal.\n\nAVOID THIS PLACE!!!", "author": "Gina C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-04-26", "description": "Stopped on a hot day to get some sparkling water. After getting the water and check the bartender proceeded to tell us that the ATM is down and the credit card terminal and that we would have to walk down the street to get cash after it was the restaurants fault they can't except cards or provide way to get cash. He was very unprofessional and proceeded to blow up on us because we said why is it our fault as a customer that you didn't tell us it was cash only. The bartender then made a big scene slamming the check away from us and telling us to get out over a water.... That any person with good customer service would of said, \"I'm sorry it's our fault we didn't warn you that our systems are down and that its cash only, this drink is on us.\" For that bad experience this place gets 1 star.", "author": "Cory S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-13", "description": "I have been accused before of being a perpetual proponent of \"the underdog\"... Whether this \"accusation\" holds any truth is still in dispute, but I must say despite the negative reviews on yelp, I had a rather positive experience here.\n\nYes, the decor is tacky, but in a charming way. I find the snobby reviews of this place to be somewhat amusing...first of all the \"tourists\" that come over the bridge keep your local economy afloat. Talking about biting the hand that feeds you! (Pun intended) Secondly, I'd be willing to place a substantial bet that there are more BK based \"tourists\" that come into Manhattan every weekend... Yes, BK is charming, but in my eyes in no way can be compared to the cultural mecca that is Manhattan. So in the most polite way possible, get off of your high horses!\n\nBeing a product of the over priced Manhattan environment, I thought the $22 dinner deal was amazing! My favorite parts were the soup and the actual entree which was a modern twist on the traditional chicken parm...it was the most perfectly friend piece of chicken I've ever seen in my life. My boyfriend also enjoyed his meal. The staff was all very nice and helpful. My only complaint is that the appetizer left something to be desired.", "author": "Susie T."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-08-18", "description": "Quite possibly one of the worst meals I have ever had. Instant mashed potatoes with the main, cold antipasto consisted of rubbery warm mozzerella, a half slice of salami, dried out provolone, and 3 slivers of watery canned red pepper.\nThe wine, (holy shit overpriced for selection), was the only thing worth paying for, \u0026 not even that.\nZero stars, but Yelp won't let you do that.", "author": "Zuba C."}], "servesCuisine": "Italian", "priceRange": "$11-30", "name": "7 Old Fulton Restaurant", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "7 Old Fulton St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/9d2vjc3kQYcziEq35bTQmw/ls.jpg", "@type": "Restaurant", "telephone": "+17187970007"}