{"aggregateRating": {"reviewCount": 245, "@type": "AggregateRating", "ratingValue": 2.5}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-04-22", "description": "New Yorker and Brooklynite of 13 years here. This place is situated between 3 of the most sought after restaurants (Shake Shack, Grimaldi's \u0026 Juliana's). Because of the intense crowds of foreigners and tourists waiting for these other places, restrooms are scarce. This creates a \"no restrooms for non-customers\" situation. \n\nFine. \n\nI walked into this place (Again, Local of 13 years) desperate to use the restroom. I had to literally haggle and fight with the hostess and push my way in. There were a total of 5 customers eating. No one cared about this place and they were desperate for business. It was bad business saying no to me.\n\nPoint is: be kind to the locals. We'll give you more business than any tourist will. And if we're a New Yorker and tell you so, be kind and let your neighbor use the bathroom for god sake. Or else, we know how to write a damn good yelp review to get you replaced.", "author": "Julia C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-04-17", "description": "I was waiting for my friend to arrive, but didn't want to sit down just yet since I wanted for her to check the menu and see if she likes that place or not. \n\nI asked to use their bathroom while I was waiting for my friend, but was attacked by the waiter and was treated like crap; I almost got pushed out. I texted her that we have a change of plans and went to  Juliana's next door instead. What an amazing place. Definitely recommend it to anyone who is exploring the area but there might be a wait.", "author": "Inna S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-23", "description": "My parents and I are visiting from Las Vegas and we were looking for either pizza or Italian food and most of the restaurants on this block had lines outside the door. But when we noticed this place had no line we were curious and I can't believe it only has 2 1/2 star ratings!! It's so amazing! I ordered the cheese ravioli which was so good. The linguini is delicious as well. I really enjoyed the warm welcome from all of the waiters, especially the manager, Julia, who was very sweet to my parents. The atmosphere in this restaurant is so calm and fun.", "author": "Isa B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-10-26", "description": "I went into this establishment and saw the bartender chatting it up with a few guys at the bar. I asked him if I could please use the bathroom. (I was almost 7 months pregnant). The bartender was very rude and seemed to be annoyed that he had to stop his conversation to answer me by telling me \"they had no bathroom\". I'm so glad I didn't get a chance to spend any money in this establishment and wouldn't recommend anyone to go to this restaurant. You'd think because of the location they'd have better customer service and from the vast majority of reviews I read I'm questioning how are they even still open.", "author": "Sheprica S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-02-14", "description": "Horrible ! I came here with my coworkers for lunch few hours later I got sick and ended up in the er with food poisoning... nothing tasted rite ! Just stay away .", "author": "Sam H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-10-07", "description": "If i could give zero stars i would.   Place is disgusting. Only thing worse are the nasty people\nWorking there.  Stay away !!!! Rude nasty and poor terrible excuse of a restaurant", "author": "Andrew L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-25", "description": "I only bought the House Salad Lunch to-go. I'm giving it 4 stars because it was exactly what was on the menu. It was vegan and definitely do-able. The leaves were pretty fresh and avocado was nice as well. The balsamic vinaigrette was basic. Like everything in NYC it is overpriced but I finished it in one sitting so I liked that it wasn't too big of a portion that I have to lug around for the rest of the day.", "author": "Tina S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-04-29", "description": "I would give this place 0 stars if there was an option for that. The food was pretty bland; waiters were rude. I did not think a restaurant could ever get as bad as this.", "author": "Rokeya B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-06-03", "description": "From the moment I stepped up to the hostess and asked for a table, my experience only went down. I asked how long the wait for 5 adults and 1 child was, and she then blankly stared at me like I hadn't said anything. I stared at her until she said \"i have a table right now inside\" \n\nGREAT! We walk in and she gives us this cramped space. My family is not big on asking for too much but even we felt that this minuscule space was too small for our party. We asked to change tables and she gave a frustrated look and started pointing at other tables going \"You want that one?\" #rude\n\nWe sit down for a good 5 minutes before water was offered. The servers were too busy staring at the soccer game to bother with us. Once one of the servers realized that we were all staring he came over and was apologetic. However, he paused mid ordering to look at the TV again. WHAT????\n\n Water and bread is served, then the food soon after (we only ordered appetizers). \n\nOh god the food was terrible. Extremely small dishes for such a high price point. \n$14 crab cake - lacked in flavor and had a sad salad placed next to it to fill the plate. The cake itself tasted like fake crab meat that was frozen. Pretty certain it was frozen.\nYou know what else was frozen? The calamari. Barely any batter on the pieces and they were all way too chewy.\nThe only thing that tasted remotely good was the Caprese. That's because it's literally tomato slices and mozzarella cheese slices stacked on top of each other. Hard to get that wrong. Didn't even pour the balsamic and olive oil on top, just placed two bottles of it next to the caprese. \n\nSuffice to say that this restaurant is probably not going to be open much longer. Especially in this location.", "author": "Esther Y."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-02-19", "description": "Bad bad bad ! Owner is not nice people, \n\nI was there with my wife kindly asked if she can use restroom because she is pregnant he have a long gray hair men i thing he is owner , he said outside left next door which I understand they have restroom outside but when step out I understand he lied to us which my wife entered inside building apartment and went to second floor to look for restroom, \n\nWhy would you lie ? I dont understand this kind of people, i would understand if he could say sorry its only for clients but he did not even say this ,\n\nWhen i come back to ask why he was rude and was not nice to us ,\n\nI will never go and will tell everyone about this ,\n\nNo restaurant owner have right to tell pregnant woman cant use their restroom in New York.", "author": "Ridvan S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-18", "description": "Great family owned restaurant. Don't know why it has bad reviews. My girlfriend are visiting Brooklyn ,and I loved the place. They must of ironed out the kinks. -JH", "author": "Jake H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-08", "description": "We went for dinner. Great view, delicious food, we had pasta and salmon.surprised that they have only 2 stars. Very good experience.", "author": "Christina S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-11-25", "description": "Horrible service. Ordered food (salads!!) and never came (1 hour). Bad bad bad...tsk tsk.", "author": "Chris C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-28", "description": "Never go to this place. My wife is 7 months pregnant and asked to use the restroom. The smug waiter refused her. The place didn't even have any customers yet as it was just opening. Nothing like a lack of hospitality to ensure I never patronize this place again.", "author": "Collin S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-08", "description": "I don't know what you people are talking about. Our server, Osli, was attentive and friendly. We stumbled upon 7 Old Fulton, wandering around Dumbo, looking for a pleasant outdoor restaurant to have lunch. We had a great table to people watch and enjoyed the mussels and clams with a chunky tomato sauce, along with Mozzarella caprese. My husband said he enjoyed his burger, also. I would definitely return to this old school Italian restaurant with a traditional feel.", "author": "Eileen R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-25", "description": "This is a really nice place with good atmosphere. I'm a little surprised that it is a ghost town at 9pm on a Saturday, seems like it should be packed with customers. The ambience here is great, would definitely come here again.", "author": "BC C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-17", "description": "It's hard to take a second bite at their cheese ravioli, the waiters don't seem like to be speaking English. There is a reason it's the only restaurant that's empty in this area.", "author": "Sihao F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-17", "description": "I'm giving this restaurant a 5 star rating not because i ate there. I actually lost my phone and one of the waiters there found it, somehow called my grandfather and this way i was able to get my phone back! I wish i could remember the waiters name! But all the staff was amazing and super friendly even knowing that i wasn't there to buy or eat anything.", "author": "Jolanny L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-14", "description": "Very accommodating and kind even with our large group. Staff was very patient and generous with us and of course the food was delicious!", "author": "Ashley B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-09-25", "description": "This is the first time I've felt the need to warn other people.  It looks nice but the food tastes like it was thawed after having been frozen for 10 years.  \nI'm a vegetarian so making pasta and cheese go together shouldn't be tough... but it was awful.  The dinner rolls were like rocks and dry gravel.  \nSave your money and fill up with something else.", "author": "Cindy C."}], "servesCuisine": "Italian", "priceRange": "$11-30", "name": "7 Old Fulton Restaurant", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "7 Old Fulton St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/9d2vjc3kQYcziEq35bTQmw/ls.jpg", "@type": "Restaurant", "telephone": "+17187970007"}