{"aggregateRating": {"reviewCount": 245, "@type": "AggregateRating", "ratingValue": 2.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-04", "description": "Really beautiful patio outside to have a nice meal and wine. Little gem in a neighborhood limited with alfresco options. Staff was lovely and food was good!", "author": "Jenny B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-10-05", "description": "Typicall Tourist trap. I wouldn't recommend it. \nI had a ham sandwich with very dry ham and almost no taste.", "author": "Marco K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-03", "description": "We went there after walking the bridge, party of 6 people. The service is horrible, the manager has such a bad  customer service attitude. I asked about some dishes and she was giving me attitude when she was responding and then she just said don't take the dish.. I asked for more bread they didn't want to give it to us. Not recommended.", "author": "Juan Carlos H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-06-01", "description": "The reason it is getting 3 stars is that the food happened to be pretty tasty. \n\nThe service was sub-bar--they seated us, and then my friend and I had to wait 20 minutes before someone came around to take our orders. By then, both of us had finished our small glasses of water and needed refills (which we didn't get for probably another 10 minutes or so). We also had probably 4 or 5 waiters attend to us? We couldn't figure out WHO our waiter was.\n\nOne guy took our order, another came around and asked us how our food was, another brought us a bread basket, another gave us the bill, yet another person gave us the paid bill back... it was really bizarre. \n\nThey didn't seem terribly attentive. The food was decent, but I probably wouldn't return as I've had better food with better service previously.", "author": "Jeenie Y."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-06-11", "description": "While walking under the Brooklyn Bridge, stopped by this restaurant as the menu seemed decently price and the location was close to the piers. A review of the menu and you think to yourself nothing unique pretty simple and straightforward no way of messing it up. Wrong. Order the crab cake and my girl got the linguini with shrimp. The shrimp was bland and flavorless. Didn't seem very fresh for a place that you know would have high turnover. The bottom of my crab cake was burnt and didn't taste all that great. Service is sub par.", "author": "H M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-06-11", "description": "The crab cake was delicious!  1*  due to terrible, really terrible service. There were 4 of us, gave our drink order and 20 minutes later had to ask for our drinks. 3 of us received our wine, the 4th had to ask again about her beer and the excuse was bad bartender!  Meanwhile the 3 young ladies next to us were seated and had their drinks in 5 minutes.  Our orders were mixed up, dinners brought before appetizers, one of us did not get anything and since we were sharing some dishes, we did not notice. She had to ask for her dinner!!!!  The setting was nice on the sidewalk, nice conversations, shady and great sightseeing, like a Paris cafe, food was mediocre if that. Expensive ( they even  had a dish we did not order on our bill). Nice for pre dinner app and drink but that's about it.", "author": "Geri H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-10", "description": "We had a very pleasant experience and we are not tourists- \nThe location of 7 old Fulton speaks for itself. The service, the drinks and the food were excellent . Can't say one bad word about anything. Yes waitress had an accent (Vivienne), but she was quick, circled back several times to check on us and made pleasant conversation .\nArugula salad with salmon for $15- huge portion and very fresh. Roast beef- tender and just the right medium rare and well seasoned. I think the people who talk about the food not being fresh are just plain lying. \nI will definitely come back.", "author": "Georgina W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-08", "description": "Jimmy was a fantastic server. Not only does he look like an actor (Hire him Scorcese!), he acted on our lunch like nobody's business. \n\n3 course lunch, 5 star service!\n\nMake sure to get an outside table under the sun.\n\nThanks Jimmy!", "author": "Food M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-02-15", "description": "We came here to enjoy some wine \u0026 appetizers.\nnice place , i like to wood panel ...nice admosphere pretty romantic since its not very loud. \nwe sat down \u0026 ordered a bottle of white wine to go with our meal. they star u off with some gread \u0026 olive good , this was good nothing special.\nfor appetizers the grilled calamri salad was pretty good \u0026 so was the mediterranean salad the dressing was pretty tasty. \ncan't judge on the rest of the food the salads were good \u0026 went well with our wine.\nwe skipped the desert \u0026 headed down the block for some ice cream.\n\n**QUICK UPDATE **\n\nI recently stopped by \u0026 tried some of the food this time around , For Appetizers we tried the Calamari , good  nice sauce with a bit of spicy kick to it. \nThe Crab Cake , pretty good good taste even though its fried comes with a small salad good as well nice dressing.\nMain dishes The Fettucine was delcious , the combo of beef \u0026 veal was very tasty. Next was the Linguine , this was pretty good as well I could do with out the anchovies since I am not a fan but the rest was good , nice garlic taste. \nFinally the Cowboy Steak nice piece of meat , nice \u0026 tendor comes w some mash potatoes \u0026 veggie.", "author": "Ginette P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-07-03", "description": "Service was great and that's about it\nWait on line at Juliana's or grimaldis don't settle\nHad the crab cake for $11 and change...\nI was served a Gordons crab cake or something that was bought at Costco\nGrilled chicken Caesar was mediocre at best\nDressing was good chicken was dry and flavor less\nThe other folks in my party felt the same.\nBill for 4..3 salads one pasta dish 1 glass of wine and 2 sodas was $100 \nDon't waste your time or money\n2 stars was for service only", "author": "Jonathan R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-06-20", "description": "Food was tasteless and the manager din't let me use the bathroom as a paying customer . Don't even bother with this place .", "author": "Dassa A."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-03-19", "description": "The food was fine, even delicious, and the atmosphere is nice enough (though it's as crowded as any Brooklyn restaurant...), but the service was dismal.\n\nThings started out strongly, we were seen quickly and with the bottle service one would expect, but once we received our meal, the ample and abundant staff didn't see us for an upwards of 40 to 50 minutes. They truly left money on the table, because if a waiter had checked on us after we finished, we would have ordered dessert or possibly more drinks. At first, I gave them the benefit of the doubt and assumed they were perhaps trying not to rush us, but even after we put our card on the table (again, a long while after our meals were finished), it took our waiter an exceedingly long time to drop the check, even as we observed patrons around us that had come in AFTER us get served promptly and efficiently. \n\nAnother small detail that made it difficult to enjoy the experience was our table. It was a marble top end table simply NOT made for dining... One couldn't sit at it without spreading their legs entirely because of the ornate and sprawling legs at the center. \n\nAgain, the food and wine was fine but the service simply too negligent for me to say that I had a good experience at this restaurant.", "author": "Kelsey C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-02-15", "description": "Stopped in to heat up from the cold so not sure how fair of a review I can give considering I didn't take advantage of the full service from the restaurant.\n\nService was prompt and polite. Got a seat at the bar and order a draft(only 2 selections available). The restaurant is primarily Italian with a decent selection of wines. \n\nVery ornate and a great place to to get a bite to eat after walking around the park.", "author": "Samuel C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-04-17", "description": "The owners are not very polite except for the gentleman. Both mother and daughter have no idea what it's like to be courteous to customers. Would not recommend. Not only was our experience not pleasant the other two ladies that walked in after us left after being greeted poorly. Maybe they were both having a bad day.", "author": "Barbara K."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-08-14", "description": "I came with a few friends after an opening in the area. Two of us ordered from the set menu since it seemed like a good deal, and the other two each ordered a salad and a pasta. I was one of the two who got the prix fix, and the other and I ordered the same things in the end.\n\nThe mussels were OK, though some didn't taste fresh. The soup in the next course was bland. The small bowl of pasta in tomato sauce tasted good, but it was a bit too simple. I mean, I cook that myself all the time at home. For the main course I got the fish of the day - tilapia, which was actually cooked pretty well and tasted nice with the lemon. Overall though I was unimpressed. I had a little taste of a friend's pasta dish, which was spaghetti with scallops, and that was delicious. The olives on the table were yummy too. The service was a little \"moody,\" there were good moments and bad moments so I wasn't sure what to think in the end. 2.5 stars.", "author": "James K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-30", "description": "ATTENTION: Please do not believe any of these negative reviews about food being not fresh or service being bad, or the staff being rude or slow. This place is located next to probably the nicest view of the Brooklyn Bridge. With a park located along side the water.  It's not expensive for  ( Being in probably one of the highest rents in Brooklyn ) \nI heard from many Brooklyn people that this place is awesome. And one day while riding my motorcycle I stopped by and say down outside and had the steak", "author": "Danny D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-05-06", "description": "This by far the worst restaurant I've ever been to in the entire 5 boroughs of magical NYC. On a beautiful spring afternoon, we wanted to sit outside and eat on the public tables so we opted for take out from 7 Old Fulton. \n\nThe woman who took our order by the door was completely inattentive. She took my friend's order and as I opened my mouth to say what I'd like, she walked away. I guess not seeing an entire human being right beside with body language that said PLEASE I AM STARVING I NEED FOOD.\n\nA few minutes later she came back and we finished our order. I got the lamb shank. They forgot the vegetables as it was described on the menu. The lamb was soooooo overcooked, and the only flavor? SALT. a ton of it. In addition, there was dinky side of paraboiled rice with that salty sauce. \n\nMy girlfriend chose the shrimp linguini. No sauce, just salt. The shrimp wasn't even cleaned or peeled properly. She had a few bites and  trashed the rest. \n\nMind you lovely Yelpers, these meals both cost over 20 bucks. Yelp some other joint if you're in DUMBO and don't even give this restaurant a millisecond of consideration.", "author": "Priti K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-07-03", "description": "Why can't we give noooo stars??  I am a New Yorker.  I am not a tourist but I have never walked the Brooklyn Bridge.  Suffice it to say, we landed at 7 Fulton. Listen to me people.  It is disgusting.  Anyone of you could cook better in your own kitchen.  Do not come here and waste your money.  NOTHING is fresh and you will be in the bathroom the entire night just like my family was.  They rush you to turn the table.  The service is horrific and I watched as they were nasty to other tables.  DO NOT EAT HERE. YOU HAVE BEEN WARNED.  DISGUSTING  ON EVERY LEVEL....EVERY LEVEL.", "author": "Robyn C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-08-12", "description": "**DO NOT EAT HERE!!** There is a reason why this place is always empty. I'm really not sure how they are paying their bills because there FOOD \u0026 SERVICE is HORRIBLE!!!!\n\nCHEF RAMSEY!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!", "author": "Josh L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-06-27", "description": "My fiance and I were looking for somewhere to sit outside and have a drink. We stupidly chose this place.The food was not good. But the service was worse. The manager (I think she was the manager) was so rude and annoyed because we came only for drinks. But I wanted an appetizer also. She kept trying to force us to sit by the bar. I kept trying to tell her I wanted an appetizer also but she kept insisting on the bar. She then tried to tell us several outdoor tables were \"reserved\" and tried to stick us right by the door which my fiance didn't want. And she kept ignoring him. Eventually after about 5 minutes of back and forth about a table, we were seated. The waiter offered every other table dessert except ours.  HUGE mistake to come here. We ended up going to an outdoor bar directly on the pier and it was GREAT. Please don't waste your time on this place", "author": "Mandy B."}], "servesCuisine": "Italian", "priceRange": "$11-30", "name": "7 Old Fulton Restaurant", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "7 Old Fulton St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/9d2vjc3kQYcziEq35bTQmw/ls.jpg", "@type": "Restaurant", "telephone": "+17187970007"}