{"aggregateRating": {"reviewCount": 245, "@type": "AggregateRating", "ratingValue": 2.5}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-08-20", "description": "Food was sub par, really nothing special. The ambiance was great though and the wine selection was great. Server was really funny and accommodating and knowledgeable about the menu, as it should be!", "author": "Lucas P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-11-17", "description": "Alright, here's the thing: we had originally planned on attending the Brooklyn Light Show and then going to Grimaldi's next door. Apparently, so had, like, 40 thousand other folks. Way to over-market and under-deliver BK Light Show. Ahem.\n\nAnyway, 7 Old Fulton, located directly next to Grimaldi's, was fairly crowded as well, though it did have a table open and seemingly no one else waiting. The menu seemed a tad bit pricey and not all that alluring, but the atmosphere was super cozy looking and, as I said, there was a table available. We audibled to take what was in front of us and sat down.\n\nThe food is not the best in Brooklyn, but it isn't the worst. If I could choose, I'd give it 2.5 stars, adding an extra half of a star for good service and a nice ambiance. If you're just coming in for drinks at the bar, I'd give it 3 stars. $5-6 beers and $8 for full glasses were a welcome surprise.\n\nMy advice to Old Fulton: add more fresh ingredients or lower the price! The prices are reminiscent of handmade pasta and fresh moz, but the dishes are not.", "author": "Kirsten C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-04-06", "description": "Anyone restaurant staff that tells you that the food is fresh, and is adamant as if you questioned their freshness... We asked what kind of cut the steak was, and the response was a \"New York!\" - it's fresh cut. I see the guys cut the meat myself!\" \n\nWtf. Nothing taste fresh. I had the lamb shank and it wasn't even HOT at all. Like it was nuked.  Fresh vegetables or seasonal just means a sauce with minced vegetables. \n\nAny place that is practically empty and hour after dinner service starts should be a No No. It's up the block from Gramaldis... Empty, and it's small! Food is wretched, and is one step away from a Gordon Ramsey restaurant makeover.", "author": "Dililah S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-02-08", "description": "This restaurant is so bad that I felt insulted by the mere fact that it remains in business.\n\nOkay, our service was decent. And the decor was surely tacky and over-the-top, but a little kitsch never hurt anyone. \n\nThe lunch menu, a sliver of the dinner menu, is rather limited. Still, I saw a salad with shrimp and avocado! Cool! I like those things. (I chose it over scallops, which also looked good.) The bread was decent, and it was nice to have marinara sauce with the oil. \n\nOur food came out. I am not someone who needs very large portions, because goodness knows I like to keep my trim girlish figure, etceterrrahhh. But it was a few leaves of lettuce with four small shrimp and some light dressing. Plating 101 was never a class taken here, because many of my friends had small portions on large dinner plates. (No one's plate looked well arranged. It looked like something you would cook at home while looking somewhere else and throwing stuff onto your plate. The fact that we got to eat stuff that looked like that was insane.) It looked weird and reinforced the fact that, contrary to what I had imagined, $11 was a normal price for this thing I was getting. It was legit a few pieces of lettuce. \n\nThe shrimp were small and a product of failing Seasoning 101. Way too much pepper! I was almost choking (and I like spice). Oh, and there was no avocado - one of the VERY few ingredients. So I asked and eventually received some avocado on a butter plate. Still, you have like two other tables seated and you forget one of the four ingredients? What? Also the soda (Diet Coke for me) tasted like a combo of soda and seltzer. I like seltzer, but I ordered a Diet Coke! Anyway, it was nice to eat with my friends, and we all had fun with each other, but this restaurant is a shining example of doing the bare minimum - or perhaps even less.", "author": "Melissa F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-15", "description": "So walked in and immediately was welcomed! Asked if we could watch the basketball game and they said no problem \u0026 turned it on for us. \nOur Bartenders Soso and David whipped up some of the best cocktails we've had in a long time! I didn't know what I wanted so Soso asked what kind of drinks I enjoyed he asked sweet? Citrusy? I said yeah both, A nice balance. He goes ok no problem and made a cocktail that tasted something like an Italian ice, soooooooooo delicious! I was just sad I was driving and could only have one! My friend asked for Johnny Black which they served and then took it back only to whip something even better up out of it!!! If you are looking for awesome cocktails and bartenders or should I say mixologists that FAR exceed your expectations I can only recommend coming here!! And Definitely ask for Soso or David!!!!! \nAnd btw the calamari was delicious!!! Perfected to snack on while drinking the cocktails!! Can't wait to come back!!!", "author": "Jeanette M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-05-28", "description": "The location is good, but the servers and the owner won't leave you alone until you order something. They are really  pushy. Not a good experience.", "author": "Nicole M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-04-17", "description": "Great view if you sit outside however the food is well below average and the same goes for the service. Have a drink if you want to enjoy the view but don't bother staying for dinner.", "author": "Anne L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-10", "description": "Very nice staff and awesome service. Great food...I will definitely be returning to eat here. Me entrée was the dinner special, linguini with mixed seafood...very tasty and just the right amount at a reasonable price.", "author": "Mario M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-08-30", "description": "Simple but good food and service. Nice ambiance inside, like an old English pub. The portion size was reasonable and so was the price. We had fired calamari as appetizer. It was fresh and not overly oily. Everyone was satisfied with their meal (the burger, the salmon, the vegetarian sandwich, the lamb and caesar salad). Nice spot near the new Brooklyn Bridge park.", "author": "Safran Y."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-04-17", "description": "Terrible. I felt awful wasting calories and money at this place. If you are thinking of getting out of line at Grimaldis- don't. \n\nThe food was just blah. They placed random pieces of lettuce on the plates, the hamburger bun was definitely from Wal-Mart and the Mediterranean salad had the scraps of lettuce you would normally throw away. The waitress made a point to ask if we wanted all of the food at once (which we did not) but it magically came out all together anyway. \n\nSo  ok- maybe the wine is good right? Wrong. Possibly the worst glass of wine I've ever consumed. We looked up the bottle after we saw the name and it was a crappy $6 bottle! Just a terrible place.", "author": "claudia c."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-08-28", "description": "Ate outside. Food was average at best. If you are starving like we were it will suffice. Waiters are a bit snobby and only as friendly as they have to be. Small selection on the menu. After a long wait they asked if we were still waiting on our food and we said, I'm yes? And then it came out a few minutes later. So while it wasn't horrible I'm sure there are plenty of better options nearby for your dollar.", "author": "Chris C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-04-19", "description": "Leron's Lesson: Really nice place to grab some wine and sit outside.\n\nFull Review: I came to 7 Old Fulton after visiting Smorgasburg and only wanted to drink outdoors. The bartender was quick to serve up some mini wine bottles with cups. There is plenty of outdoor seating to satisfy everyone. There were a lot of tourists enjoying the rare NYC occasion of drinking outside, perhaps it felt a lot like home for them.", "author": "Leron G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-19", "description": "Best place ever to get to birthday shot!! David will take care of you!! Best mixologist from Georgia!", "author": "Liz E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-19", "description": "I enjoyed 7 Old Fulton, the food was good and was reasonably priced. I had a hanger steak and fries for $25 dollars, beer selection was limited but there were decent options.\n\nIt was indeed busy with tourists and the decor was tacky but the staff was friendly enough, the space was nice enough and the food was good value for money. There are \"better\" places down at the River Cafe, Julianas, etc. but that has nothing to do with 7 Old Fulton.\n\nAnd this place gets an extra star because of how seemingly despised it is by Brooklyn 'locals'. If it's not a gluten-free pizza made in an original brick over from Del Monico's it's not worth of a decent review.", "author": "Mama R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-08-02", "description": "I stumbled upon this place on a Friday night when there was nary a restaurant in Dumbo that could seat our party of 10. Surprise! No wait a 7 Old Fulton. As we entered, I noticed that it reminded me of my childhood. For frame of reference, I grew up in a town where the culinary attractions were the 6 Dunkin' Donuts and an Olive Garden. And yes, this did remind me of Olive Garden! The first basket of rolls arrived, and I was pleasantly surprised to find out that they reminded me of Olive Garden. Except the rolls weren't warm. My whiskey soda also reminded me of old times. Yes, it tasted like the drinks bartenders gave me when they knew I was underage and intentionally watered down my liquor to avoid the liability of a drunk teenager.\n\nLook, you have to give the place points for efficiency. Three plates of calamari came out at record time. You could tell they had the calamari waiting for us! It just needed to be defrosted.\n\nAfter the appetizers, I went to use the ladies' room. Our waiter stopped me, and asked where we were from. \"Here,\" I said. He looked taken aback. New Yorkers in 7 Old Fulton? Clearly we had missed the memo. \"Well, some of us are from here. A lot of people aren't.\" Looking at our group, he smiled knowingly. Of course locals wouldn't come here. You shouldn't either.", "author": "Margaret W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-05-28", "description": "Not a nice attitude when they figured out we were there just for drinks and appetizers.", "author": "Sima S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-08-31", "description": "I wish I could give it a zero...live in Manhattan and came to tour Brooklyn w friends who live across bridge. \n\nWe stopped here during our water photo shots after some awesome pizza at Roberta's and beer at other places...\n\nAvoid this place, abnormal pricing that prays on possible Euro credit cards and an incredibly unfriendly staff towards locals. \n\nPass on this dive", "author": "Jason H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-04-01", "description": "This place simply sucked. The food was awful. We got some chicken and some calamari, neither of them have any flavor furthermore the chicken tasted like a TV dinner with Salsberry steak sauce. The atmosphere was nice though and the server was great with her heavy Hispanic accent she did a great job serving us. Be warned this place is not tasty.", "author": "Ilona O."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-07-18", "description": "Alright place for lunch! It's very dark inside which is a bit odd but the food is good, very cheap-under 13 dollars mostly. Calamari was a little disappointing and  the veggie sandwich was just ok. Caprese salad was bland. French fries, beer and wine were all good though", "author": "Maddie M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-21", "description": "The bartender David was fantastic and charming. I had a great time. Good music and atmosphere.", "author": "Emily M."}], "servesCuisine": "Italian", "priceRange": "$11-30", "name": "7 Old Fulton Restaurant", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "7 Old Fulton St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/9d2vjc3kQYcziEq35bTQmw/ls.jpg", "@type": "Restaurant", "telephone": "+17187970007"}