{"aggregateRating": {"reviewCount": 245, "@type": "AggregateRating", "ratingValue": 2.5}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-01-30", "description": "The food was horrible (not fresh bad) the service was horrible (throw breads at us, act like do bf us a favor bad) We were the ONLY table for a Sat lunch, but we had nowhere else to go because every restaurant nearby was packed, hello!  Big warning sign that we chose to ignore.  It is not you, it is me (I should have made a reservation in a decent restaurant before being trapped in the worst restaurant in Brooklyn).", "author": "Juan J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-04", "description": "Amazing, is the word that comes to mind when I eat the food at this amazing restaurant. If you LOVE food you will love this restaurant. You can eat, drink and be merry and the owner and his wife are so wonderful. They treat you like family when you come in. If you haven't been here yet you must stop in and have a full meal! But don't leave without eating some delicious homemade dessert. The crème brûlée is to DIE for. Trust me when I say you will not be disappointed!", "author": "Jessica N."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-06-03", "description": "We came in for a drink and had the worse experience with one waitress. Skinny black long hair. Would not tell me her name. \nI don't care if you are having a bad day... no excuse to be rude to people. Even the nice gentlemen that was sitting next to us was wondering what her problem was... we enjoyed the drink, would of stayed longer but she ruined it... we also tip very well, so don't know what her problem was. \n\nThe owner in the other hand was nice! \nBut will not return \nThanks to her!", "author": "Loraine B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-11-27", "description": "Overpriced tourist trap with sub-par sandwiches and regular burgers (named the old Fulton burger--buns, meat,  lettuce, tomato,  onions).  The wait staff was awkward and the atmosphere dark and decor tacky.", "author": "Laetitia D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-09-11", "description": "Mandatory gratuity for a party of three? Yes. How weird is that. Wait staff couldn't remember our order after taking it. It was not hard. We ordered 2 linguine and 1 fettuccine. He completely forgot the order of the table next to us. The food was good. The desserts are store bought.", "author": "Entrigen T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-01", "description": "I took my parents here while  they were visiting and we loved it. Though the waiter was a little hard to understand, the service was excellent. I had the salmon with Dijon sauce and it was delicious, my parents had the burger and a pasta and meat dish respectively and loved them. We finished off with a great tiramisu.Finally the atmosphere was very nice making the place feel more spacious.", "author": "John M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-04-24", "description": "I have never experienced such a disrespect and horrible  customer service in my life ! I just walked in to get a table for me and my girlfriend but I asked where was the bathroom first and she said no that I had to buy something then I can use the van I kept explaining to her that I was going to buy something but I need to use the restroom urgent. But the short Mexican lady doesn't know how to talk English and told me no and told me no I couldn't use the restroom. And the little guy in the front was rude with her trying to walk away from me while I'm talking . Use the bathroom before coming here because if not you have to pee before using a bathroom ridiculous acting like middle-class people in a big city like this . Unprofessional I will make sure none of my people come and eat here", "author": "Amalyn C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-09-25", "description": "I assume this restaurant only gets traffic from first timers. I will never go back. Everything tasted like it was frozen for a while then reheated. I had the shrimp linguini...not good. My girlfriend ordered the cheese ravioli. The cheese inside was dry. She ate one and couldn't eat anymore. The bread they brought us was cold and hard and served in a gross looking yellow basket. \nWe didn't want to stand in line at the pizza places nearby, but once we took a bite, we wished we had.", "author": "Shelby H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-31", "description": "Definitely go here if you have loads of spare cash and calories to waste. Also, definitely consider going here if you are in a hurry to loose weight via diarrhea/indigestion.", "author": "Paulina H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-04-28", "description": "Unfortunately we were hungry and tired so didn't think to check reviews before going here. Would not recommend. We were seated right next to the dessert fridge so had to contend with waiters constantly reaching over me to access desserts, without saying excuse me and barely mumbling an apology each time. Service was fast but perfunctory. There food was fine - not worth the price as it was nothing special - and the wine was bland. Such a shame we didn't do more research for our last night in NYC.", "author": "Chanelle C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-05", "description": "My husband and I were starving that we just ended up coming in here since all other restaurants were packed on a sunday afternoon - i guess being not crowded is already saying something. The service was really awful. My husband ordered a steak but it really tasted like pork (is it possible?); instead of being courteous, the waiter insisted its beef and just left us. After that, he never went back to check on us and just put our check on our table. I had to ask another waiter to take care of our bill. Whether its really my husband's mistake or not, the service should have been better than that.", "author": "Mara O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-03", "description": "Beautiful looking restaurant and great food! The staff is very friendly. Definitely would come back.", "author": "Al K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-06-11", "description": "I wish that 0 stars were an option.  Waitress was rude.  She forgot about our order and didn't apologize.  I ordered a walnut and avocado salad.  There weren't enough walnut pieces in the salad to make even one walnut.  There were two measly (and not fresh) slices of avocado.  When I told one of the waiters about this, he told the manager, who did nothing.  You would think that they would have at least offered me more walnuts and avocado.  Worst dining experience ever!", "author": "Alan G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-06-06", "description": "The food was decent. We had the linguini which was good, but the service was horrible. Besides the older gentlemen ( no offense ) with freckles, he was nice and was the only one who attended to us besides the busser. The hostess wasn't as pleasant or inviting. A baby spider was on my plate. My friend asked for a refill on her coke and a fork because her daughter dropped it but those both never happened, so she ended up grabbing a fork from another table. Not once were we asked if we were doing ok or if we needed anything else. You would think that a restaurant right at a prime location that probably caters to many tourist would step their game up but maybe they were having an off day so that was.....Um.... FAIL!!! Great outdoor seating on a nice day, but do not expect to get any good, great, or even mediocre service cause this isn't the place for it.", "author": "Theresa M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-09-11", "description": "Do NOT go in there! Waiter was nice but that was it it. We had a grilled steak. We got it with fries, ketchup and one piece of broccoli and carrot. The steak was dry and so was the hole  dish. We asked for a sauce or a gravy but they only had mustard or mayonnaise as options. Really expencive place and totally not worth it!!", "author": "Veronica B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-23", "description": "This place is just fine. Had spaghetti and meatballs. They were delicious and the pasta was cooked perfectly. \n\nThe service wasn't an issue it. It also wasn't terribly busy either, but we were seated and food came out within 10 minutes of ordering.", "author": "Anthony Q."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-14", "description": "I went here for dinner after seeing the line a pizza place nearby.  The staff was quite friendly and the food was good - it was nice and filling.  The only reasons I didn't rate it higher was that the water wasn't cold enough and it seemed like the AC couldn't keep up with the restaurant, it was rather warm and stuffy inside the restaurant.  I sat inside because it was rather warm out but I think I would've been more comfortable outside.", "author": "Jesse G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-07-06", "description": "the worst place. The food was horrible, I asked for a beer and it was brought from the box, that how hot it was. \nAND on top of that my aunt left her reading glasses and they couldnt even look for it. like they do not care. \nI WILL NEVER COME TO THIS PLACE AGAIN", "author": "Johanna S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-04-17", "description": "There was hair in my food which was bad. The replacement dish they sent out has a fly in it that looked to be cooked into the meal!! NO JOKE. I thought maybe a film crew was nearby filming my reaction and this whole thing was a joke but sadly it wasn't. The service was horrible and food...well, not edible. DONT EAT HERE! To make it worse they asked me to pay for both dishes.", "author": "gigi n."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-05-03", "description": "Terrible. I spend so much money here and left hungry ): one of the servers has a bad attitude ..", "author": "Angela S."}], "servesCuisine": "Italian", "priceRange": "$11-30", "name": "7 Old Fulton Restaurant", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "7 Old Fulton St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/9d2vjc3kQYcziEq35bTQmw/ls.jpg", "@type": "Restaurant", "telephone": "+17187970007"}