{"aggregateRating": {"reviewCount": 245, "@type": "AggregateRating", "ratingValue": 2.5}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-08-31", "description": "Do not go here! Ewwww, vomit bad! Disgusting place, outrageously rude staff. To say this is a tourist trap from hell would be a complement", "author": "Kate C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-06-03", "description": "I stopped here with a friend for a bite on a nice day... We were just passing by.  Basically the lady at the counter (whom could barely speak English or understand us) made a mistake and put us down for one too many crepes. When we got the check I mentioned it to her and she adjusted the check.  No problems. Out of no where this other woman storms in and is like \"what's the problem here\". Trying to interrogate me over 1 crepe lol. So I explained what happened... The lady who helped us could barely speak English and that's my fault?? No. I'm not paying $12 for an extra crepe I didn't order. Not to mention it's ridiculous that an owner from a restaurant would make a scene like that in front of other customers.  But that's ok because in the end the business suffers with service like this.", "author": "Christi D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-13", "description": "David the bartender is awesome, he is the best. He is from is from Georgia, the country not the state. He is known as Chuck Norris. You can come here and find out why.", "author": "Liam H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-01-06", "description": "ZERO stars! Just thinking about my experience here makes me cringe. Literally THE worst restaurant I have ever encountered! There are NO positives for this one. I cannot believe this place has managed to stay in business! Incredibly rude staff, astronomical prices for the horrendous food/drinks. AVOID at ALL costs! If there was a zombie apocalypse and this was the last safe place on earth I still wouldn't set foot in here!!", "author": "Anna C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-08-16", "description": "Really weird experience here - went at 2:30 (lunch menu ends at 3:30). Weren't greeted by anyone though passed by 4-5 times. Asked if we could sit and were told that a perfectly clean table had to be cleaned. Waited 10 minutes and sat anyway. \n\nSat for 5 minutes more, went in and inquired. Menus finally brought over, but no water, no waiter after that. Had to get up and head down the street. Really bizarre after reading such great reviews. \n\nNot sure if they were understaffed and underprepared, or something had happened to cause the mess, but after overhearing the waitstaff complaining to each other, I was really turned off.", "author": "Matthew W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-30", "description": "Stopped here for dinner and drinks when Grimaldi's had a line out the door...\n\nVenetian pizza with mushrooms and cheese was really yummy. Ben the bartender made an excellent tokyo tea and georgia peach.", "author": "Trishia P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-08-31", "description": "I would exchange the 'e' with 'a'\nThe sign at the entrance should have been a good warning for us, saying:\n\n\"You have two options for dinner:\n1. take it\n2. leave it\"\n\nWe should have left!\n\nwhat a mistake... but we were too tired crossing the BBridge,\nand the line near the favorite  pizza looked like a 2 hours wait...\n\nIn short, we were served the crepes in the cheapest styrofoam plates one could get, and the coffee came in matching styro cups.\n\nThe coffee was horrible, and the crepes were completely inedible.\nThose crepes were evidently bought  frozen and warmed in a microwave\n\nOther than being thick they were rubbery because of the micro, more like delicate pair of Crocs than a crepe. \nThe Napoleon cake (imitation to the French Mille-Feuille) was pathetic and sad, but compared to the crepes, it was certainly a glimmering jewel.\n\nWhen we were leaving, the waitress (or was she the owner?) asked:\n\"i assume the kid would not want to take the leftovers?\"\n\nWell, how did you guess?", "author": "M S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-06-09", "description": "You know...i will probably never go here again. Gourmet food it is not (at all), but the atmosphere is lovely. the staff is lovely. Its just one of those places you will probably see on Restaurant Impossible one day....", "author": "Gloria F."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-07-05", "description": "Poor service, even worse food.\n\nThe pizza here was just a fat loaf of bread with a sprinkling of cheese and tomato sauce here and there. The sandwich was also very dry.\n\nThe waitress was not responsive and when we asked for bread, she told us that we could only have bread with main courses. Eventually she begrudgingly gave us 3 slices although even that took her over 10 minutes to bring over.", "author": "Charles T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-03-02", "description": "cool little place with comfortable seating options and a sort of bohemian coffee shop type atmosphere but my double machiato was 5 bucks! in shock,, did not have enough money to try a crepe..  there is a decent amount of seating..", "author": "Mark N."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-04-26", "description": "For being one of the few restaurants on that street you would think it had better service. Took forever to seat us, the waitress was not very nice.  The food took an extremely long time, and the taste didn't justify for it. \n\nPrice: $-$$ \n\nService: needs improvement \n\nAmbiance: casual  \n\nGroups: yes\n\nWould I come back? not likely", "author": "chase m."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-18", "description": "Well worth the 5-item prix fix at $22 - figured we would treat ourselves to a bottle of wine on top.   I don't remember having any complaints about the service, and it was early enough on a Friday afternoon that we had the place to ourselves.\n\nExcellent quality for the price, especially considering the area, which can be a bit overpriced.", "author": "Quinn J."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-08-24", "description": "The waitress has no customer service skills at all not to mention the food is over priced and tasteless.\n\nWhen it was my turn to order she quickly cut me off and did something else, then came back to my fiancé (in his face with her ugly smile) when it was my turn to order. She totally ignored me. And when the food came out she forgot the vegetables and and brought mashed potatoes instead! Shes an old hag with no skills, the place is old and not worth it.", "author": "Nicky W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-07-25", "description": "The worst place in Brooklin. Attention is frightful and the food is horrible. Avoid this place!!!", "author": "Andres V."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-06-02", "description": "This is a family spot that is still working out the kinks, but my Nutella crepe was delicious and it was lovely to see the son packing the crepe his mom had just made.", "author": "Tracy N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-05", "description": "Not sure why there's so much hate here.\n\nWe both did the $22 prix fixe.  The antipasto to start was great, as were both pastas.  She got the chicken avocado and I did the veal...chicken was better, but both were decent.  \n\nThe decor was fine, and it was refreshing to not be cramped.  \n\nOkay, a few negatives.  When ordering we didn't explicitly say we wanted soup (since there was no choice, only minestrone), and for some reason the waitress thought that meant we didn't want it.  When the pasta came out, the waiter said he'd be right back with grated cheese and never came back.  When my entree came out, the mashed potatoes were kinda cold.  Waa waa.  \n\nFor $22 this was a great dinner.  Ah, and the waitress gave us the soup in a to-go container, so I know what's for lunch tomorrow :)", "author": "Jimmy O."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-21", "description": "Yummy crepes, relaxed, casual, open atmosphere, good cappuccino.", "author": "Clarisse C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-12-23", "description": "This little crepe shop may be French themed but do not be fooled, this place is all Russian! The tablecloths may be emblazoned with Eiffel towers but they are made of rough potato sack burlap! Toilets are $2 per use, audacious considering the free public restrooms in the park across the street. We ordered two cokes and a Parisian crepe but instead received two creeps an no cokes, an easy mistake which was hastily corrected, providing us also with a humorous view of the cook's shocked expression when the unserved crepe was returned. The crepe was indeed no crepe, it was unquestionably a blin, a Russian pancake version of the parisian crepe, but I didn't mind, I'll eat anything after all, and it wasn't bad for a blin. I did appreciate the carved carrot garnish sitting atop, it brought a flavor of Asia and I like to be reminded of the east while I dine. \n\nThe decor is a mix of vintage inspiration and home arts and crafts. A little stage sets a scene in the front with a wooden bench flanked with mustard sheer drapes. Beneath sits an ikea chest of drawers decorated simply with a tiny wooden box and a Verizon wireless router, blinking cheerfully. This leads me to believe that they offer wireless service, important for today's Internet savvy customer, indeed I am in fact writing this in the cafe itself, giving an account in almost present time.\n\nThe cheque arrived in a little wooden box, luckily service was included at 15% which saved us doing any maths, I wish more places would do this, I only got a B in arithmetic. This was collected by a little boy who came from nowhere it seemed, I assume this is a family establishment because it is normally surprising to see such young employees in this part of brooklyn. \n\nOverall, a healthy experience and I will certainly come back to sample their $2 toilets.", "author": "Egg F."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-04-18", "description": "Horrible dining experience and an obvious tourist trap.  We left after waiting about 20-30 minutes to order an entree. Waitstaff is very unprofessional.", "author": "Jeremy M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-11-04", "description": "After a great day in Dumbo, at the Arts Festival, my friends and I were looking forward to trying crepes and coffee. We were immediately turned off by  how hot it was. After I placed my order and paid, the woman behind the counter told me that she did not have enough change.She told me that she wasnt going to give me the change, nor did she make any attempts to ask for change from me or the  store manager and assumed that it would not be a problem. I was so aggravated that I didnt even realize that I had given her $20 and only got $1 back as if I given her $10. I didn't feel like I was treated respectfully as a customer and therefore would not be going back there or recommend that anyone else does.", "author": "Bree A."}], "servesCuisine": "Italian", "priceRange": "$11-30", "name": "7 Old Fulton Restaurant", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "7 Old Fulton St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/9d2vjc3kQYcziEq35bTQmw/ls.jpg", "@type": "Restaurant", "telephone": "+17187970007"}