{"aggregateRating": {"reviewCount": 245, "@type": "AggregateRating", "ratingValue": 2.5}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-11-23", "description": "We were visiting for LA with a family of 10. Grimaldis was closed and this looked like a cute little Italian place. They sat us quickly but then the nightmare started. The waiter wasn't writing our orders down which is ok if you're a professional waiter. It's not ok to come back 3 times to confirm the order and then charge for an extra plate at the end. My husband ordered mussels and clams. When they came out the smell of urine was so strong it was smelled across the table. I actually checked my kids to make sure no one had an accident. We eat seafood all the time and this did not taste or smell safe. We brought up our concerns and a waiter came to say \"this is how mussels are\" then the lady who I presume is the owner very rudely said \"we've sold 10 today without a problem\" and left. Unbelievable! No wonder there are so many crappy reviews we were just desperate for food and in Brooklyn. And the prices! Over priced and small portions. Disgusting from their attitude to the food. The only reason they got one star was it was cute inside and they placed Italian music. We all wished we had sandwiches from Starbucks instead. RUN!", "author": "Sona G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-10", "description": "We had a most wonderful experience here. All of the waiters were amazing and the food and drinks were delicious. We'll definitely be back to visit! Thank you!", "author": "Windy C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-06-19", "description": "Just don't.\n\nWhile out for lunch we got stuck in a downpour without an umbrella so my husband and I sought refuge in the first door we saw, which unfortunately was 7 Old Fulton.  We were soaking wet, then shown to a table and while the server was clearing off the other two table settings with napkins I politely asked if he could leave the napkins (so we could wipe ourselves down before sitting, as we were sopping wet) and he very rudely asked \"WHY??\", ummmm, because I am dripping all over the table??  \n\nIt just went downhill from there.  After looking at the limited menu, we decided lets just get a few glasses of wine (reasonable prices), caprese salad (so bland and over priced at $14 for 3 slices of tomato and 2 slices of rock hard mozzarella), and the house salad (Costco lettuce mix with 2 slices of avocado and bottled Italian dressing for $10) while we wait out the rain.  \n\nNever going back, and would suggest you avoid it as well!", "author": "Brittany D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-22", "description": "We saw this place as we were walking around the area and had to stop in. The atmosphere was inviting. The bartender was nice, as well as Julie who is running the place. After there for a few hours we ordered the bruschetta and calamari. The bruschetta was the Best I had ever had, and probably one of the best food items I've ever had in my life. I'm a huge foodie and love to try new places. It was so good, we ordered 2 more and got a few friends to join us. I didn't try the rest of the food, but the bruschetta is amazing!!", "author": "Cristina T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-14", "description": "Best palce to have lunch and enjoy the view. The food is amazing and the service too. I had sea food pasta and fried calamari for appetizer, seated outside on beautiful Saturday sunny day. Olsi and Leaonard were the best servers and funny, they made our day.", "author": "Dev Ç."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-10-14", "description": "We sat outside for lunch, where the atmosphere was very pleasant. For this, the restaurant earned it's only star. \n\nThe food was quite ordinary, like you might expect in a low-end diner. My burger was small and undercooked. \n\nThe service was inexcusably poor. For example, we only managed to get our water glasses refilled after vigorous waving at a staff member who seemed determined to ignore us. \n\nTo add insult to injury, the bill included an 18% \"gratuity/service\" charge! \n\nI cannot find any reason to recommend this restaurant.", "author": "Bruce G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-13", "description": "My second time going to this restaurant, but my first review of it.  I can say the two visits were nothing short of great.  The first visit was for apps and drinks, my old fashioned was made to perfection.  That was sometime in June.\nMy last visit on Tuesday Oct 10 2017 was great, me and my date ate outside.  The server was great and very attentive.  The food was superb, she had the Salmon Dijon and I had the Lamb Shank and even the sides were delicious accompanied with Sparkling water .. Pellegrino of course lol.. We stayed past closing and the staff encouraged us to stay as long as we wanted.  We didn't abuse the privilige but when you are having a great conversation after a great meal with great service, you kind of don't want it to end.\nThanks Old Fulton for a great experience and I will be back for a third time soon.", "author": "Arnold J."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-04-07", "description": "This place is location, location, location. Great spot for a drink if you're a tourist looking for warmth after a DUMBO stroll in the winter. Terrible place if you'd like quality wine or professional service. We ordered 10ish drinks, one wine was bad and the bartender \"Jimmy\" refused to make it right, calling the issue \"your taste.\" Blaming us for the taste of the wine (clearly past the allowable storage time for an open bottle), despite five people tasting it and confirming the issue. \n\nSave your money and go some place else. The two star review confirms that this place cares only about 1 off customers, banking on bad quality because no one ever comes back.", "author": "Santana I."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-27", "description": "Honestly I loved the atmosphere, got the burger and drinks after my acting gig in dumbo and had no idea this little spot was here! Loved it! Go just for the staff THEY ARE WONDERFUL! And so warm! Jimmy the bartender alone is a delight and well go out of his way to make you happy. I truely recommend this spot just on the staff, been a while since I met such nice people at a bar. Btw the burger was very good!!! Hahah", "author": "Ivy G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-05-28", "description": "The waitresses are very aggreesive like they are in rush and you have to order immidiately\ndisrespectfull , unfortunately because of the good locaton they have many custumers and they dont care if custumer is unhappy", "author": "Ali P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-07-09", "description": "Two stars because the service was great but the food not so much . The meat was dry and tasteless and we've def had better . The limited menu needs a lot of work", "author": "Mary Clare L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-04", "description": "It was crazy busy, since it was the 4th of July... But the service was great and the food was good. I would recommend the lamb shank and crab cakes.\nJulian was always checking on us and the waitress was great... Very pretty too", "author": "Eman H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-07", "description": "Based on JUST drinks. The place is super cozy and cute. We came in here after a long walk and had a few drinks. The bartender was friendly and attentive. It stood out to us because of decor, and gave us that homey feeling. We don't come around the area often, but wouldn't be opposed to trying it out.", "author": "Lauren T."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-14", "description": "Just wait for the better restaurants around you. The food will be the biggest disappointment of your day.", "author": "Megan F."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-07", "description": "This place is the worst. If I can give 0 stars I would. I usually never leave a comment but this place is another level. They make money off of people who can't wait on line for Julianna's and Grimaldi's. I'm sure that's the only reason they are in business. The food taste like school cafeteria food and the service omgsh... When we asked for San Pellegrino, the bottle was already opened. It really looked like they just refilled seltzer water in the San Pellegrino bottle with the fountain soda at the bar. They also take a very long time to get your order and make you wait for no reason. When we asked for more bread they seemed to have forgotten about it (twice) however when we asked for the check...that check came to us 0-100 real quick and they charged the credit card 0-100 real quick and sent us out. I really don't understand how these people are in business. For me, this review is just a buyer's beware warning. I am telling you guys DO NOT EAT HERE.", "author": "Thomas B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-05", "description": "I went here with my sister, mom and nephews simply because we happened to be nearby when we were hungry and we couldn't be happier! The staff was amazing, especially Julia! Food was fantastic and they even replaced my sisters cocktail when she spilled it. Will definitely go here again!", "author": "Kehkeshan H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-29", "description": "Very unethical place. We request a salad to add chicken but they did not clarify that this will almost double le the price. Plus there is no option, gratuity is charged automatically in the bill. Place that clearly take advantage of tourists. Not recommended when the customer satisfaction is completely ignored. This gives bad reputation to the city.", "author": "Eduardo C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-11-23", "description": "7 Old Fulton is a total tourist fly trap, but I'm inclined to leave a kind review. Bear in mind that we were here under very specific circumstances: namely, taking refuge from a rainstorm after our walking tour of the Brooklyn Bridge wrapped up on a random Wednesday night. Most New Yorkers were happily ensconced at home, many watching the Mets get spanked by the Royals.\n\nWe were welcomed into this rather quirky, old-fashioned-looking restaurant with seasonal decorations by an ambiguously accented lady. Her husband sat in the back, engrossed in restaurant business, and a smattering of staff was in various staged of closing up. I was surprised they even received us at this dead hour. 7OF clearly does most of its business during sunny hours conducive to tourism.\n\nWe mostly wanted a drink, and the friendly proprietor poured us glasses of totally decent wine. We also ordered a couple plates of caprese to snack on, which also emerged pretty quickly from the kitchen. They switched from some broadcast channel movie of the week to the Mets game at our request and we enjoyed a nice hour or so with our drinks.\n\nI'm sure a lot of the flack here reflects daytime disappointments, but as long as you set your expectations right, I can't see this joint ruining your day.", "author": "Yan T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-25", "description": "We loved the place, especially our bartender Nina.\nGood looking place.\nFriendly and Considerate service.\nThe dish we had was delicious.\nBeverages were fair to inexpensive.\nI will definitely go back....\nEspecially to see Nina, not only was she great but she looks like a young Angelina Jolie.", "author": "Thomas G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-17", "description": "The Best restaurant in New York, vary good food and friendly Waiters. I love this place. \nBRAVISSIMI! :)))", "author": "Ade N."}], "servesCuisine": "Italian", "priceRange": "$11-30", "name": "7 Old Fulton Restaurant", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "7 Old Fulton St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/9d2vjc3kQYcziEq35bTQmw/ls.jpg", "@type": "Restaurant", "telephone": "+17187970007"}