{"aggregateRating": {"reviewCount": 245, "@type": "AggregateRating", "ratingValue": 2.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-06-08", "description": "Well for me as being a DUMBO native for years. I have eaten at the location 3 times so far and enjoyed it very much every time!!  Me and my wife awaited the opening ever since we heard \" restaurant N wine bar\". It has no comparison to Petes and Grimaldis. We met the  owner who  is the chef as well and takes great admiration in his work. The decor of the place is just amazing, from the arch tiled ceilings to the handmade bar!! As for the food, like I said no comparison to the local places. Finally a place I can continue to go to with neighbors and friends!!!!", "author": "Mike S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-05-12", "description": "Don't go there unless you want to be cheated and insulted right in your face. Worst restaurant experience ever.  I ordered the mussels and clambs platter but what I got was just mussels and calamari. I asked the Maitre d where were the clams and she answered that they were right there: she pointed at a mussel and said it was a clam. I didn't know if she was joking or if she was calling me stupid right in my face so I insisted: that is a mussel, I said, where are the clams? And again she said they were there! only that this time she added that she was too busy to talk with me and left. Then I asked to talk to the manager, and when she came she said that I had to be grateful that they had added extra calamari for free on top of the mussels and the clams!! But where are the clams? I insisted. Guess what she did?  She shhd me! I asked her to take the plate away, warned her that I was not going to pay for that and asked for the check on the drinks and my wife's food (which she hadn't touch given the uncomfortable situation) As we were waiting for the check she came back and admitted that they had forgotten the clams and that they could serve the right thing now. Too late, I paid the drinks and my wife's food and left.", "author": "Fermin E."}], "servesCuisine": "Italian", "priceRange": "$11-30", "name": "7 Old Fulton Restaurant", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "7 Old Fulton St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/9d2vjc3kQYcziEq35bTQmw/ls.jpg", "@type": "Restaurant", "telephone": "+17187970007"}