{"aggregateRating": {"reviewCount": 245, "@type": "AggregateRating", "ratingValue": 2.5}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-10-29", "description": "This place is the worst. Bland food (with hair). Pushy hovering servers. Staggering prices. Tacky dated decorations. Avoid.", "author": "Daniel T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-12-05", "description": "This place was good because we were tired and everywhere else was packed. The waiter attended to us well but the food was mediocre for the price.", "author": "Alex G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-09-29", "description": "A bit pricey for what I got, I felt like. Great atmosphere and indoor space, but that's about it. \n\nGot an iced caramel latte and it wasn't that great. But the fruit in my crepes were fresh and it was worth coming in to try. Not a bad place to chill with friends.", "author": "Elizabeth E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-02", "description": "Beautiful day outside, so we dined by the sidewalk.  The service was excellent.  We had the clams and mussels, crab cakes and spaghetti and meatballs.,,all were spot on.  I see the poor ratings previously, but we had a wonderful dining experience with the food, service and atmosphere.  Were we lucky?  I don't think so...the food is too good.  Management has responded to the critics...I would hazard a guess of yes.", "author": "John K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-01-30", "description": "I give the location(quiet \u0026 cozy) 1 star but aside from that my, the dish was terrible! My shrimp were raw and my fish had a strong concerning odor. I tell my server I can't have it, to simply take it away ( I didn't complain - was just not going to eat it) he asked repeated why I won't eat. I explained the issue and he just leaves. Truly terrible customer service/food quality. My first Yelp review- driven by the need to give a warning !", "author": "Y A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2010-05-25", "description": "For the location and decor this place needs a little help. Simply put, everything is overpriced and it is awkward. We were told that the owner put 18 months into renovating the interior - I believe it. It is beautiful, minus the picture of George Washington (c'mon it's Italian). The staff is friendly. The food came quick, but it should have since it was a Friday evening at 7:00pm and there were only two other patrons in the place. \n\nOverpriced: The food is OK, nothing special. I know alcohol is how these places make money, but I'm pretty sure that the wine they sell for $30+ per bottle is found at Trader Joe's for $5 a bottle. My wife ordered a glass and it was 1/4 full-no kidding.  The entrees are also costly for the quality of the food. \n\nStaff: Friendly, but overly attentive. Of course, when you have four patrons and over 5 people waiting to work, that's what happens. \n\nThoughts: Even with the average quality food, this place has the ability to be a great business, but it needs to make some changes. 1) Either lower the prices across the board, run cheaper specials, and give out coupons for discounts on wine, drinks and entrees to people in the Brooklyn Bridge Park. 2) If you're going Italian, go all the way. Play Italian music, not Lady Gaga (that was my first indication that something was awry). 3) Get rid of the TV. 4) Educate the employees on how to give meaningful service to the customers, not just annoy them. Educate them on the food and wine available. \n\nI would sincerely love to see this place make it, but it will need a little help.", "author": "Shannon N."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-09-03", "description": "Just left service was the worst. Moody people. Food was terrible and very over priced do not get ripped off by these people.", "author": "Mike W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-08-30", "description": "Such a shame for this prime tourist spot to be taken up by such crap food, poor service, cheap decor, wobbly tables and disgruntled staff all at tourist prices. Would have been a better experience at Shake Shack next door.", "author": "Meg M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-06-20", "description": "This place doesn't deserve any stars. Not only the manger is stuck up, but obviously shows she doesn't care if her food is worth the price. The chicken was alright, nothing special. Same thing with my lamb, more fat than meat.. Plus it came from an old lamb because I know the taste of it so it wasn't as delicious. For the prices, I would do a better job. This place is ridiculous, while dining I saw I wasn't the only customer not satisfied with this place. Never coming back here again.", "author": "Katie S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-08-08", "description": "How this place achieves a 3.8 rating is bewildering. Service: some wait staff were friendly, sure, but the owner (or whoever he was) was disgracefully rude... And without being asked the simple courtesy of: \"how is your meal\", I wasn't able to explain that my daughters hamburger was burnt and inedible... Our meal of meatballs and salad was joked about: \"shoelaces of barely cooked pasta with a couple of tennis balls; next to a wilted chicken food'esque pile of what appeared to be offcuts from a market trash can\". Would've been funnier if it wasn't overpriced.\n\nWe laugh about it still... But seriously: there's a reason why there's no wait to get in here. Save ur money and go elsewhere!", "author": "Dina N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-22", "description": "I read a lot of the reviews about 7 Old Fulton and I am amazed at the ignorance of people who post on this site.  Before you read the negative reviews, keep in mind that most of the people who had negative things to say are tourists who were upset that they could not get into Grimaldis, so they were disappointed and they took it out on this really great restaurant.  I got news for you... No one from Brooklyn goes to Grimaldis for pizza.  That is where stupid tourists who know nothing about Brooklyn go to eat.  \n\nI took my girlfriend and our friend to 7 Old Fulton for her birthday.  I made reservations a couple weeks in advance.  The restaurant is beautiful, with art work and candle lighting.  Its a lovely setting and a very relaxed atmosphere.  The staff are incredibly friendly.  I read reviews of people who criticized the service... and what you have to realize is that people are assholes.  There is only so much crap people can take and I am 100 percent sure that the people who complained are probably giant assholes who want everyone to kiss their ass because they are a tourist.  \n\nThe staff was completely on the ball, and super attentive.  The food was amazing, the wine was exceptional, and the service was amazing.  I pre ordered a birthday cake and it was the best cake I have ever had in my life, and beautifully decorated.  We had a great time.\n\nAfter dinner, we went to see a show at the Galapagos Art Center which is about 4 blocks away and walking distance.  We caught the 10:30 Burlesque show and walked back toward the restaurant where one of our friends had parked her car.  The rest of us had to wait for a cab to drive back to Brooklyn.  We stood outside the restaurant hoping to catch a cab.  The manager saw us waiting outside the door and asked us if we needed anything, and then called us car service even though they had been closed for an hour.\n\nI would suggest that anyone who wants to go to a real New York Restaurant, that is not pretentious, and down to earth... try 7 Old Fulton.  You will be more than happy!", "author": "Greg M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-05-28", "description": "Good food. Solid atmosphere. Very poor service. Ruined the experience. Would not go back.", "author": "Jordan O."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-05", "description": "Very nice atmosphere.  The staff was friendly.  We had Julia both times there and she was great.  The Chicken Francaise special was delicious.  The mussels and clams were amazing.", "author": "Michael P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-05", "description": "I would just like to say thank you to Brian for the amazing service he gave us yesterday. As a group of 8, looking for somewhere to relax and wait for the fireworks that evening, I know we were not the easiest bunch to deal with. But Brian continuously made sure we had drinks in our hands and bread rolls on our table. Thank you for helping make our 4th of July memorable.", "author": "Shelby P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-07-04", "description": "Absolutely disgraceful \n\nWe were watching the July 4th fireworks and my girlfriend became dehydrated and dizzy. I asked them if she could simply use the bathroom, even offered to pay them to let her use it, but the woman at the door was entirely rude and unreceptive. \n\nIt takes a special kind of person to turn away a girl who nearly passed out due to heat, and the staff at 7 Old Fulton are exactly that brand of special. \n\nYou should be ashamed of yourselves...", "author": "Daniel S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-05-18", "description": "This is bar none the most atrocious establishment I have ever been to. The staff was not only rude, but offensive- questioning/interrogating my friend and I as we walked to the bathroom as to whether or not we were paying customers. After that, the bartender told me he \"didn't have time\" for this (this being an adult conversation with the water who accosted us). Long story short - eff this place. Zero stars.", "author": "Lexie T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-07", "description": "Please, PLEASE, ignore the reviews of  hapless tourists. I'm a local and I LOVE this place. The food is delicious and the staff is friendly, welcoming, and inviting.", "author": "Jason B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-08-13", "description": "There is no doubt that 7 Old Dulton is convenient... Just a few strides down the block and you're at the breathtaking Brooklyn Bridge park. But, there is a price!  A few drinks can run up a tab of over $50 pretty quickly.\nThe bar is beautiful: ornate wood, columns, and a spiffy built in shelf for purses and bags. Service at the bar is painfully slow but the staff are very nice and accommodating.\nNo review for the food as we just stopped in for a quick refreshment.", "author": "Jen N."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-08-08", "description": "In reviewing my restaurant reviews, you will notice I normally don't hand out 1 stars. It's a rarity, but I honestly wish there was a way to leave zero stars... yes, it was that bad!!!!!!!!!!!!!!!!!!!! This was one of the ONLY restaurants in NY that we didn't absolutely love, and there was good reason not to like it!!!!!!!!!!!!!!!!!!1\n\nMy friend and I went there at 10 pm on a Monday because the line for Grimaldi's was clear down the street and they would be closing soon. The people who walked in ahead of us were only asking to use the bathroom and the hostess/waitress practically bit off their heads. That should have been our first clue. \n\nI ordered water and a glass of wine. My friend ordered a water. When the waitress went up to the bar, she didn't order the wine yet, so I asked when she came back if rather than the glass, if we could see the wine menu instead. She brought us a wine menu, and then proceeded to still bring the glass. I looked at her puzzled. \n\nWith our cold bread, okay, so it's just a preference that we have warm bread, but still, is it that hard to serve warm bread for meals that are $20+??? They brought out olive oil and marinara sauce. I asked for butter (for my bread). They brought frozen butter. Yes, frozen. I couldn't even spread it. When I asked the previously snotty waitress if I could have spreadable butter, her response was \"you'll just have to make due with it like all the rest of our customers do\". Wow. REALLY??? That's how you treat customers. I tried to melt the ramekin of butter over the candle. Hahaha! Finally I asked the bus boy to melt some in the microwave. He did, fortunately. \n\nI ordered the lobster ravioli. I couldn't eat most of it because it was that horrible. :( Sadly I usually love lobster ravioli and this was the first time I couldn't stand it.\n\nMy friend ordered the spaghetti, but she asked if she could have chicken instead of the scallops. Cheaper, and easier for the restaurant and the lady sort of freaked. Really? Wow, never heard of a restaurant saying no to that request. Whatev... this lady was horrible. Horrible... horrible!!!! And the food was disgusting. \n\nIf I was paid to go back there, I still would NOT!", "author": "Jennifer C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-07-29", "description": "Went there with my mother, aunt in law and husband on the way to Governor's Island. We initially planned to go to Grimaldi's, however looking at the mile long line we were discouraged and decided on giving this place a try. \nIts a quaint place with beautiful outdoor seating area. \nWe were promptly seated, however eating and paying the check took forever. \nOur server was apparently having a very bad day. She didn't bring us water, bread or anything for almost an hour. We were not in a hurry, therefore we didn't mind a lot.\nFood: The food is above average. All the dishes tasted authentic and fresh Italian. \nService: Terrible.\nAmbiance: Quite nice and beautiful. \n\nWe are definitely going back but only for the food.", "author": "Pallavi B."}], "servesCuisine": "Italian", "priceRange": "$11-30", "name": "7 Old Fulton Restaurant", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "7 Old Fulton St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/9d2vjc3kQYcziEq35bTQmw/ls.jpg", "@type": "Restaurant", "telephone": "+17187970007"}