{"aggregateRating": {"reviewCount": 245, "@type": "AggregateRating", "ratingValue": 2.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2019-05-29", "description": "I thought this place was very much what was expected, and don't understand the low reviews at all. \n\nThe service was friendly and attentive. The menu is simple, but everyone in our group loved what they ordered. Maybe people are setting too high a bar for Italian: this place was a well run normal restaurant in a slightly touristy area.  The pasta I had was great. \n\nThe group I was with all commented that the place was a very solid pick after walking across the bridge and just wanting to sit and eat and drink for a while. The price/quality/service ratios all made total sense.", "author": "Walt N."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-03-31", "description": "The steak was over priced and horribly poor quality it came out rare not medium rare and was very chewy. The speghetti and meatballs were very bland. The service was a 3/5. The interior is old and dated just like the menu.\n\nI would not recommend this restaurant I doubt the food is made fresh. I suspect that the steak was frozen when it was put on the grill.\n\nWe only ate here because there wasn't a wait and we were starving, we should have taken better notice that there wasn't a wait for a reason.", "author": "Joseph O."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-05-09", "description": "Horrible service. Went for an office lunch. Our food took 2 HOURS to come out. One of the waiters was extremely rude \u0026 disrespectful. Literally told us it is not his job to check our order as he is not a waiter but clearly waiting on tables. Several parties around us came and went. Half of our party got meals, dined and got their entrees packed to go before the other half received theirs. So some of us waited almost 3 hours. We have been here several times and had a great experience, not sure what happened this time. Never again. The rest of the staff was pleasant but 30-40 mins to get a menu and glass of water after being seated is insane. The only reason we waited the 2 hours was because we were a large party and trying to be considerate, although we had a reservation, and always have had a party that size and never that kind of service. Definitely will not be back.", "author": "Natasha E."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-05-20", "description": "Service was slow but most importantly the food is simply awful. \nFrozen food done badly! Pathetic.", "author": "Christophe O."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-29", "description": "Loved this romantic spot steps away from the Brooklyn bridge and promenade. The waiters were so nice and courteous! We had a baby with us and they were accommodating and even moved some of the foliage nearby to make room for our little one. \n\nI ordered the shrimp linguini with anchovies and it was so delicious! It wasn't dry even though I had asked the vodka to be removed. Nothing is worse than dry linguini. The saltiness of the anchovies tied everything together. You can always take it off if anchovies are not your jam.", "author": "Rithu S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-05-19", "description": "Good stop for a hearty meal. Waiter was attentive. Food: bread just o.k  could be warm. Meatballs were very tasty 4 out of 5. Veal and pork well blended. I am a meatball critic so this is saying a lot. I would give a 5 if the temperature was warmer on the dish. Lamb shank is a 10 out of 10. Meat was delicious, fell off the bone. Management was very accommodating.  They made sure you are satisfied and go above and beyond. We will be back!", "author": "Carolyn S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-05", "description": "Stopped here for sustenance during the 5 Boro Bike Ride.  Best vegetable and chicken soup in the world (made to order from scratch so be patient)! Excellent service (thank you Julia!) great ambiance, cold beers, and a perfectly made Irish Coffee. Who cares that it's raining cats \u0026 dogs outside. La dolce vita!", "author": "Shaun B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-11-27", "description": "Meh, should have known when we sat down and the background music was playing an 80's hit list in the foreground.\n\nService was good food OK nothing to write home about. Probably not a repeat. One compliment was the salads, nicely dressed and presented. See the pictures, lamb shank was better than the pasta.", "author": "Gc S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-09-26", "description": "There is a clear reason why when you walk around the area, all the other restaurants are packed and still have a line out the door.  That was a clear red flag, but my hunger clouded my judgement and I was desperate for a place to sit down and eat.  \n\nWe were seated really fast and the fried calamari that we ordered came out quickly.  It was hot and fried, however, the fried calamari was bland and had no taste. Although I added a squeeze of lime and lemon to the calamari.  Dipping it into the marinara sauce was the only reason why this was edible.  \n\nWe sat there for nearly 20 minutes after our appetizer was finished and the waitress asked if there was anything else we needed.  It was as though she forgot our entree orders, which were lamb shank and shrimp linguini.  These two dishes were a bit better, but it definitely didn't wow me. \n\nThe service was slow!! I had to ask for my water to be refilled several times.  So with sub-par service and food I will not be returning to this restaurant.  Good luck to those that try this restaurant.", "author": "Stephen L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-15", "description": "Initially wanted to go to Gran Electrica, but they had a longer wait so decided to walk over to this place. It was completely dead- which was a little strange. \n\nMy friend and I sat down towards the back, there was one other party there. We ordered the Cabernet Sauvignon- which came out pretty fast, it was not that good. We also got some bread with butter, but hey where is the balsamic vinegar and olive oil? Isn't this an Italian place? The bread and butter stole the show though. \nWe ordered the mozzarella caprese and French fries. The mozzarella caprese was pretty bad- so bland. The French fries were too salty.  \n\nWe decided to order a second glass- ordered the Malbec, and that unfortunately was worse. We sent it back and got another order of the Cabernet. When we got our check we saw that we were charged for the Malbec which was pretty disappointing- we flagged our waiter and he went to get it fixed. \n\nI would not be back.", "author": "Tahima B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-12-25", "description": "Unpleasant experience from the moment we walked in. First and last time I come to this place. Host (old lady) was very rude... like if she didn't want people to visit the place. Host needs to remember that customer service's level is what determines how well we tip waitresses. \nDrinks were ok... customer service awful.", "author": "Yuliana A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-23", "description": "Ask for Gin(our favorite waiter), a hidden Wine Dive Bar Restaurant with a taste of Italy, a must when in Brooklyn. The food is delicious!!!, you can't go wrong. A walk away to see the most amazing view. You will get a shot on the house at the end of your dinner. The best decision for food and drinks for a beautiful night.", "author": "Luz M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-09-06", "description": "Stumbled in here because everything else had a long wait compared to this restaurant (we still waited). Our waiter was nice and the service was quick once we ordered. The food was nothing special - it was just ok. For lunch in 90 degree weather, it did the trick.", "author": "Jess R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-23", "description": "Excellent food and great service. Will definitely be coming back. Had the fettuccine and one bite of felt like I was back in Italy. The pistachio soufflé was amazing", "author": "Lillian A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-12", "description": "You ever sit in a restaurant and think to yourself \"I think this place needs to be on Kitchen Nightmares?\" That is exactly how I felt the moment I sat down. Immediately as we were seated the waiter did not give us any menus. I assumed the waiter will be back with the menus but we sat there for about 5 minutes with no menu. No big deal, so we just asked a waiter walking by if we can get the menu. He comes back with 3 menus. Mind you, we were a party of 4. Again, not a big deal. HOW MANY TIMES DID I SAY MENU?? LOL\n\nAfter we quickly browse through their short menu, we finally order the food. Spaghetti meatballs, some chicken breast thing on the bottom of their \"entree\" section and rigatoni with sausage and broccoli. While we wait they bring us bread. This bread is not the type of bread you get at a normal restaurant. These are straight up the rolls you got in your school lunch. AND!! they literally gave us four rolls. \n\nFinally the food comes out and wow...easily the worst food ever. This is not an exaggeration. First of all the meatball, was mushy inside and tasted like straight up dog food. The rigatoni was hard as hell, under cooked as a motherflower. And the chicken breast dish was...I cant even describe how bad that was. BUT! we were hungry so we ate it. We were initially trying to go eat at Grimaldi's or Juliana's but the line was literally half way around the world. We should have just waited..\n\nANYWAYS! back to the food. While we were eating we also asked for more bread. Not that it was good but we were hungry. We asked one waiter that is literally 4ft 8 and kind of resembled the Cleveland Indians logo. He says \"ok\" and I see him in the back of the restaurant just staring at the customers. So we asked this really tall waiter, he's like 7ft tall for sure. He also forgot. Super annoyed and disappointed by the experience we just asked for the check. They bring us the bill in like 10 seconds. It was evident that they wanted us to leave. We still gave them 10% tip though.\n\n\nOH!!! and also!! their San Pelligrino water is just an empty San Pelligrino bottle and they get they fill it up with seltzer water from the fountain soda machine! I SAW IT!!!! ALSO!! before the whole dinner thing the lady (I think she's the owner) was screaming at her staff in front of all the customers and arguing with another customer. Something about a child seat and how they weren't providing them with multiple child seats. \n\nOVERALL, this restaurant sucks! DO NOT WASTE YOUR MONEY HERE!! \n\nFROM YOUR COOL KOREAN GUY.", "author": "Tommy C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-09-26", "description": "Over priced, mediocre food.   Poor service - the bartenders seemed more interested in chatting with each other than serving folks.    The place itself is very pretty though.  Good spot to stop for a cold drink if you have just walked across the bridge.", "author": "Chris S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-16", "description": "Poor service. overpriced  and far from an Italian portion size on the plates. Ordered a Cheese Ravioli ($21) for 4 Ravioli in a very pasty and dry tomato sauce. \nwe told our waiters about the little portion size and he rudely said \"Its how Italians eat their portions of pasta, if you have a problem talk to the owner\"  this is so wrong. Save your money and go TO Shake shack next door.\n\nCiaooo 7 Old Fulton Dinner\nAddiiooo", "author": "Isaiah C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-11-28", "description": "Stumbled in from the cold looking to warm up with a cocktail. Lovely inviting bar and friendly staff greet you. Drinks were ok, nothing special but not awful either.", "author": "Pooline N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-02", "description": "walking to this restaurant very nice treat welcoming hostesses even i'm an asian got the same treat like every one the service was very nice give them 5stars the food was very good, we are deeply in love with clam and mussel with wine sauce super tasty and pasta with seafood and anchovy \nhighly recommended this place", "author": "Ayuwadee B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-03-30", "description": "The experience was not good from the second we approached the restaurant. The host (older lady) barked orders at us (stand here, don't touch the flowers, don't stand near the bar because you have children with you, etc etc). Our meal and waitstaff were actually quite pleasant, but she continued to bark at them and us the entire time. We weren't the only ones uncomfortable or annoyed. She needs to remember what costumer service is and that customers are paying to be in her restaurant. Be at minimum, respectful or a tiny bit accommodating especially to those with small (well behaved!) kids.", "author": "Samantha C."}], "servesCuisine": "Italian", "priceRange": "$11-30", "name": "7 Old Fulton Restaurant", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "7 Old Fulton St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/9d2vjc3kQYcziEq35bTQmw/ls.jpg", "@type": "Restaurant", "telephone": "+17187970007"}