{"aggregateRating": {"reviewCount": 245, "@type": "AggregateRating", "ratingValue": 2.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-07-15", "description": "LOVED THIS PLACE!  We were heading towards Grimaldi's for pizza, when all of a sudden, the pizza nazi (seinfeld reference here, not a nazi fan) turned the sign on us as we reached for the door. CLOSED. Bastid.  Starving and tired...and cranky, we headed for anything that would serve us food.\n\nThankfully this place took us in and served us that $22 meal at 11pm. IT WASSSS DELICIOUS! We were bummed about not getting some of that famous pizza, but once we realized what a great bargain we were getting, we quickly changed our attitutes. Frasier, our server, was friendly and polite, made us feel welcome, even though we were making somebody make our meal at 11pm, he acted as if that was not a problem at all.  Food was good, ambiance was nice and location was excellent. Will be returning with my husband in August!", "author": "Lili B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-15", "description": "Had a great dinner with family.  Julia, our waitress was very nice. Food was excellent.  They ran out of the special. But we were not disappointed when our dinner came - delicious!", "author": "Audrey D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-04-14", "description": "It was promising when we walked in. This restaurant has a classic old upscale Italian feel with rococo paintings, a nice bar, Romanesque ornaments and a few touches such as a portrait of G. Washington nestled in between the fake white marble caryatids on either side of the fireplace. Charming in a cozy slightly kitchy Italian American restaurant way. \n\nPromising, until the food came, which reneged on the promise. We ordered the 4 course dinner, which would be a great deal at $22, but frankly, it's just not very good. The apps were mediocre, the soup was bland with overcooked vegetables, the pasta course lacked flavor and (cardinal sin) was not cooked al dente, the entrees were meh. \n\nThe over enthusiastic waiter overcharged us by $4 on the tax. I suspect this was a ploy to get a bigger tip, since most people often just double the tax. I suppose this place will try to milk the unsuspecting tourist trade that's overflowing from Grimaldis down the block and from Pete's next door.", "author": "Matthew P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-04-23", "description": "In one word- Awkward. After working in DUMBO for almost two years I've had my share of long waits for food that may or may not be great. While the service was quick it was more awkward than being asked to scootch forward, a little more forward, while my legs are in stirrups. The waiter lingered with his hands grasped on the empty chair and stared a little too much into our eyes, the hostess berated my friend about picking off the onions and tried to convince her since they were caramelized she could eat them regardless of her distaste for onion, and when asked for a fountain soda, the barkeep/waiter whipped out a liter of soda and poured it into a wine glass. Classiness cringed at the thought of this place.\n\nThe decor was as though someone went to Brooklyn Flea and fell in love with wrought iron gates, old Italian statues, and a random unframed painting of George Washington that if ever brought to antique roadshow would elicit nothing but im sorry sir, you've been had, followed promptly by gut bellowing laughs.\n\nAs for the food, well, while I didn't feel as though I wanted to vomit I was quite disappointed at how large the garnish (piece of lettuce and two small tomato slices) was in comparison to the foccacia pizza.\n\nMid way through I thought about a glass of wine, while I didn't see Riesling on the menu I asked and was promptly, and with great assurance that Prosecco was better than Riesling. I don't have a quip about this because really I'm just dumbfounded.\n\nIf you're into overly attentive wait staff who look as though they are always waiting for a punchline of a joke that no one ever told then 7 Old Fulton is for you. Otherwise, don't get fooled by the cheap prices. This is not a 'that one time I was in New York and......' story you want to tell.", "author": "Megan H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2010-05-01", "description": "We were drawn in based on what turned out to be the lunch menu posted out front, ready to bolt when we saw the dinner menu prices, then told by our waiter that if we wanted to we could order from the lunch menu. The owners were very pushy and overbearing, and against better judgment we stayed. Two minutes later the guy comes back out, we're ready to order, he says we are looking at the wrong page, this is the lunch menu. We say, \"you just told us we could order from the lunch menu.\" He says, \"was that me or the woman?\" pointing to the other owner.\nWe got to order from the lunch menu but should not have bothered - the pork was good but the eggplant has some funny metallic taste, and the portions were miniscule. Then towards the end, the woman asks where we are from. We say Brooklyn but not DUMBO and she lets off a scowl that was off the charts. Awkward is exactly the word for this place.", "author": "Stephen Y."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-10-06", "description": "I'm generally not a one star kind of reviewer, but for eating, stay away from this place.  Eat at any of the neighboring places: Grimaldi's, or the newer Grimaldi's imposter next door, or River Cafe, or Shake Shack.  They will all leave you much happier no matter how long you have to wait.  This place has ok ambiance inside, and the tables outside are great on a nice day.  But the only thing you should do here is get drinks with friends.  We waited an excessive time for our food, several later customers got served before us, without explanation.  When the food arrived, the food was embarrassing, I was embarrassed for the chef.  My table mates said the tepid crab cake was inedible, and though it was rather small, neither finished it.  The salad greens were wilted the dressing tasteless.  The entree chicken Cesar salad had too much chicken for the limited greens provided, and the chicken, which may have been prepared days earlier, had been pounded thin and cooked to a dry, jerky-like texture.  I ordered the pasta with the braised beef and veal.  The dish arrived cool to the touch though the center was still warm. Thankfully they used dried pasta which gave a wide margin for error on pasta texture, because nothing else was particularly pleasant about the dish, and it was under seasoned to boot.  I am in this neighborhood often, and was looking for a new place to eat.  My mistake.  Barf.", "author": "Eric S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-05-28", "description": "I like my pork cooked and not raw. When I sent it back they put it in the microwave and returned it to me. This place needs a new chef that puts pride in his work.", "author": "Svein Erik J."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-06-22", "description": "Terrible... i was at Brooklyn Bridge Park, w / wife and 3yr old daughter. They got no high chair, waitress was the worst ever, it was really bad service. I ll def NOT recommend this place.", "author": "Leandro B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-04-14", "description": "The food was terrible. We order three burgers and all of them arrived with raw meet inside. We returned them and we received them back with the cheese burnt and no buns. The pasta marinara I ordered was bland and under cooked. The restaurant decor is dingy, it is poorly managed and the wait staff is incredibly disorganized. I would often see people walking back and forth franticly. Our service was decent, but after we left paying 50 bucks for crappy food I realized why people were waiting in long lines at other places near by. I honestly think the hot dog stand would have been a better experience.", "author": "Jason S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-04-30", "description": "Stay clear of this place; especially if you want to bring in your children!  The owner/mgr should be ashamed of themselves. Zero customer service and just plain rude.  The food is nothing special.  I had to beg for a glass of milk for my 1 yr old.  \"We dont sell milk\", seriously??  With all the clientele coming in for Jane's Carousel, I hope this place gets replaced.", "author": "Georgie W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-04-06", "description": "Just stopped in for a quick bite...thank goodness that was all.  Was met by a pushy older lady, who was hovering over us the whole time.  She seemed like she had to oversee everyone's order, yet she understood nothing.  I ordered the crab cakes ...correction, the crab cake (only one). I guess getting only one was a good thing because I believe they left the crab out of it.  As I tried to cut it, it totally crumbled.  And it tasted like a bread crumb patty.  The most horrific replica of a crab cake I have ever had. Then I asked for the sauce on the side...which they did, but it was served with a dry salad.  When I asked for dressing for the salad, they pointed to the remoulade sauce for the crab cake they gave me on the side.  The pushy lady came over and said I said no dressing...well I didn't say that because I was unaware the crab cake came with a salad.  They then brought me another serving of remoulade sauce.  I told them this won't work.  A gentleman, then asked if I wanted oil and balsamic vinegar, I told him, that will work...WHEW! all of that to get some salad dressing? Then I saw someone order a latte from the pushy lady, so I asked for  an iced latte.  Oh my gosh! She responded as if I was speaking Greek, she said ice? Then the gentleman came over, and said he can get me a latte and pour over ice...duh??? \nThe ambiance was nice....but the trouble to get everything wasn't pleasurable, and most of all, the food was horrible. I should have stopped and gotten a slice of pizza from any other place on the block!\nDon't waste your time at this place!", "author": "A M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-09-22", "description": "Great atmosphere and the nicest staff ever. Everyone is very friendly and eager to serve.  Bad food and wine though.  Like REALLY bad, can't eat / drink it, food and wine.  It was sad because I want so badly to like this place.", "author": "Kevin C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-08-31", "description": "This place was very mediocre. The French Fries were worse than bowling alley French fries. The waitress did not show up once to ask how we were doing. We didn't even get a refill of water. The decorations are tacky, but the restaurant had nothing that was amazing. Mediocre at best. A food cart would be much better.", "author": "Dan S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-06-25", "description": "Overpriced.  Very small portions.  Bartender not knowledgeable about the menu.  Mashed potatoes that tasted like instant.  Great cold Brooklyn Lager on tap so it gets two stars for that.", "author": "M D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-10-31", "description": "This was actually pretty decent eat. Had to wait a long time for the food. Overall it was far off my expectation, nice place.", "author": "Tiantian X."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-10-06", "description": "Interesting to look at the variable ratings in other reviews.  Visiting form Austin and might not have stopped if we'd seen them before hand.  We had a great meal.  Truly fresh oysters and a super scallops and spaghetti for me.  I loved the small amount of spicy cherry peppers in the sauce, really jazzed it up.  My wife ordered the Prix Fixe and everything was good.  The soup was especially good, rich and well seasoned.  She is not a big eater and she polished it off all courses.  Maybe some folks were put off by the wait staff banter and casualness, but they were timely and present and I enjoyed the exchanges.  Even met the cook, who explained a little about why the spaghetti sauce as sooo good.", "author": "John T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-04", "description": "One of the finest classic Italian restaurants downtown Brooklyn.  Perfect setting for a business dinner or to celebrate a special event.  The service is impeccable as we were served by an amazing lady named Julia. She catered to our every need. The venue is breath taking with beautiful handmade wood work basically everywhere.  This place is literally steps away from downtowns most beautiful attractions, DUMBO, the city skyline and the Brooklyn bridge. We were very pleased with the food which was amazing and pretty big portions. We Can't wait to go back again for a nice family dinner.", "author": "Stephanie C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-08-24", "description": "Came here with some family after a boat ride to grab a bite- bad decision. The old waitress took my order wrong I ordered salad with crab cake it was horrible. I could have bought a better meal at rite aid, the chicken was pink n crab cake tasted burnt and nasty. The waitress is a cougar she stared down my 18 year old cousin as if he was a piece of meat she's very creepy, took everyone's order wrong n the food is horrible not worth it at all.", "author": "Amanda L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-04-10", "description": "My family and I ate there yesterday. I had mozarella caprese, my sister ordered a burger. Both was carelessly prepared and unseasoned despite the high prices. In my opinion this restaurant is nothing but a tourist trap. The tables outside on the street are not served by the restaurant, cause they are public but a nice trap to  get new customers.The staff was very unfriendly. One of the waitresses confronted me directly on my way to the restrooms, if I'm a customer and have ordered something. She wanted to know exactly where I was sitting. After leaving the restaurant my sister decided to use the restroom as well but she was not allowed to do that cause we weren't customers anymore. I definitly can't recommend the place.", "author": "Anne F."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-09-15", "description": "I can't even begin to explain how completely awful the service is. Unfriendly, ignorant, and almost rude. No one knows what's going on and as I'm writing this I'm waiting to pay for 2 beers....ugh. The bartender or hostess or whoever is sitting eating food and hanging out with a friend at a high top. Nice work! Being in the industry and dealing with this on my day off was not the plan. What a $\u0026/!-hole", "author": "Danielle M."}], "servesCuisine": "Italian", "priceRange": "$11-30", "name": "7 Old Fulton Restaurant", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "7 Old Fulton St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/9d2vjc3kQYcziEq35bTQmw/ls.jpg", "@type": "Restaurant", "telephone": "+17187970007"}