{"aggregateRating": {"reviewCount": 245, "@type": "AggregateRating", "ratingValue": 2.5}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-07-07", "description": "Doesn't get much worse. Foolishly didn't follow other posts' advice and skipped the lines at Juliana's and Grimaldi's to come here. There is something to be said when two restaurants next to you have lines wrapping the block and you don't even have a 5 minute wait. Even Shake Shack had a line!!!!\n\nService: The place wasn't even full on the 4th of July! Half of the tables that were filled were family and employees of the place. We sat with no wine/beer list for a solid 5-10 minutes despite how empty it was. When I asked for a Pinot the waiter didn't even bring me a wine list, he just brought over the most awful house wine I've ever had. When I asked to modify my plate (1 of 4 pasta dishes they offer mind you), he told me could not substitute the shrimp for chicken or anything else, and suggested my boyfriend would eat it. Sure. I told him to leave it on the side and I'd give it to my boyfriend. Not only didn't they do that, they made sure they really tossed it around my dish. We again waited for about 10 minutes after the waiter cleared our plates before he came over and asked if we needed anything. Then another 5 minutes for him to remember to get the check. We saw him blatantly forgetting us. \n\nAlso, there was an oddly dressed man - an employee. He looked like the host at first, but then we really and no idea what his role was. He was drunk. Just sucking down his Heinekens and wandering around. \n\nAtmosphere: The atmosphere itself isn't bad, but it's misleading. You expect so much more. THey had an iPod hanging from a cabinet next to our table. A younger member of the operating family asked an older waiter to switch iPods. He had no idea what he was doing and disconnected it so we heard a piercing noise go through the speakers, and then the music was killed for the rest of the night. They also clearly don't have a floor plan as they jostled us around a few times adjusting other seating arrangements. \n\nFood: So disappointing. AWFUL. I couldn't even finish the dry pasta I was served. The menu is VERY limited. No variety. There is no flexibility when you order. \n\nIf you can't wait for Juliana's, just go to the Shake Shack. I hope this little place can get some help. They seem like nice people.", "author": "Ela M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-11", "description": "Yelp is mixing up reviews of 7 Old Fulton -- a lovely family-run restaurant -- and a creperie up the block which is not good and has bad  reviews (under the wrong restaurant heading), including displeasures with their business practices.  Don't penalize the good restaurant with this confusion.", "author": "Martha L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-12", "description": "food was great, service was good. their info says not good for children but the staff was kind and accomodating to the two children we had with us.  they're a little overpriced but aside from that it was a nice experience.", "author": "Tonianne C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2010-09-19", "description": "Some friends and I picked this place for lunch because they had a gorgeous little garden, and we thought it looked like a nice lunch oasis after a long walk over the Brooklyn Bridge.  Quite unfortunately, the food and service was a disaster.  I knew we were in trouble when I asked the waiter what he recommended on the menu and he hmmed and hawed and then said with a shrug, \"People like the chicken.\"  That's never a good sign.  One friend ordered the chicken, two ordered the BBQ Pork Tenderloin, and I ordered the burger (it seemed like a safe bet, even if it wasn't the chicken).  When I asked what kind of cheese came on the burger, the waiter said, \"Italian.\"  Um... ok, I like pretty much all Italian cheeses, it seemed like a safe bet.  When I asked what came with the burger, he said it came with mashed potatoes and a vegetable.  However, after I ordered it, he said it came with fries.  It was going to be a surprise either way.  \n\nWe were all ravenously hungry  by the time our food came out, and we had almost demolished two baskets of bread - which was pretty decent bread.  When we saw our lunch come out, the only thing I can honestly say, is that this restaurant should be embarrassed and ashamed of what they served.  My friends' entrees came out on these huge white plates with a tiny dollop of instant mashed potatoes, four over cooked green beans, and two little pork tenderloin medallions.  Um, last time I looked, this place isn't The Russian Tea room, if you know what I mean.  It was jaw dropping.  My burger was the only thing that was actually palatable, with the exception of the greasy undercooked fries.\n\nWhen we paid the bill my friends split theirs on two cards and I threw down some cash.  Apparently the waiter felt very confident in his service, and didn't bring me back any change.  When I asked for my change, he seemed confused and became a little argumentative.  It took him a good 15 minutes to figure out my $7 in change, and it still came back wrong.  At that point I was over it and we left.\n\nIt's such a shame that this place's food and service is so atrocious.  It's a fantastic location, beautiful garden, and a nice little restaurant.  But until someone with vision and taste buys and redoes this place, we won't be back.", "author": "Nicole S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-12-25", "description": "One of the worst restaurant experiences I've ever had. First we arrive and are seated, but then no one comes to check on us or take our order for nearly 20 minutes. Servers had severely lacking English skills. I ask for a drink menu so I can see their wines and it takes her 10 minutes to come back with one.  Finally she takes our drink order and doesn't come back for another 10-15 minutes with the drinks. Now it's been over 40 minutes since we've sat down and we're just now ordering food. Couldn't ask any questions about the food because the server didn't understand. The bread tasted stale and disgusting (like so bad I couldn't even choke it down), the oil was also bad. We order a 3 course meal off the menu. It takes over 30 minutes between each course. My BF asked if soda refills were free (FYI they're not) but the server doesn't understand and brings him out another anyway. By the time we got our last course I was ready to flip the table and walk away without paying. To add insult to injury, it's not cheap and it took them another 20 minutes to run my credit card. 3 hours of my life wasted and the food was mediocre.", "author": "Tony M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-05", "description": "I was very pleased eating here, it was good service good food and a very nice atmosphere.", "author": "Christian L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-11-07", "description": "This was sort of a disappointment because I enjoyed my bar experience here.  The service is great and very authentic in a touristy way and I loved the almost authentic/classy, yet quirky decor.  I was really hoping the food would be adequate.  I had a salad and Spaghetti and Meatballs (one of my favorites) and my Father had a pasta with garlic, anchovies and some other seafood.  I actually enjoyed my Father's dish more.  The spaghetti was obviously pre-cooked and reheated, but that is common.  My main issue was with the meatballs which tasted absolutely RANCID.  I am hoping it wasn't the meat and just the oil it was cooked in, but obviously not fresh.  I could see this place being on some sort of restaurant reform show.  I am hoping they improve things because I live around there and like the service, but as someone in the food service industry, I am actually afraid to eat here. I know you guys can do better! On a positive note, I love the warm bread!", "author": "Jenna J."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-06-27", "description": "SO came here for desert because the ice cream place near dumbo closes at 10. This place is a little pricey, got the mango sherbet. Wow was it refreshing because it was a warm dry night. I also got the tiramisu. They put cinnamon on it, which gives it a different taste. but this place is expensive for desert. 8 bucks a pop.", "author": "Will C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-08-08", "description": "Really pretty restaurant by the water with a great outdoor seating area as well as a $22 prix fix which included a salad, soup, pasta and fish. The fish was very good but the soup and pasta were average. Right next to Grimaldi's and River Cafe. Probably wouldn't go again as it's relatively average italian but a good spot none the less.", "author": "Bjorn P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-15", "description": "i went to this restaurant last night with my girlfriend, I had the living social deal and the food was really good.  Even without the Living social deal - the prix fix dinner is great value.  I had the roast chicken - half a chicken that was reallly big!! I could not finish, my Girlfriend had the veal and again, hers was really good.  The place is really nice atmosphere and our service excellent.  the waitress was attentative and really nice.  there was no rush and no long waiat for food, drinks etc.  We both would go back..great location too - eat and take a walk to the park...", "author": "Judy D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-10-26", "description": "I have never been inspired to write a yelp review before, but the overpriced, definitely not fresh food, weird atmosphere, and inattentive service inspired me. They served the crepes on styrofoam plates with plastic cutlery, gave us the check in a strange wooden treasure box, wouldn't give us cups of water (something I believe you're legally required to do), and the crepes were minimum $9 for a small amount of greasy food. This felt like an alternate shitty universe restaurant and was quite an experience!", "author": "M O."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-07-09", "description": "weird service and awful food. we hardly at our food, ended up leaving to go somewhere else instead. Unreasonably bad.", "author": "Janet V."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-09-30", "description": "The food is horrible!!!! Crab cake tasted soggy and microwaved. For the entree, My husband spit out his chicken and my pasta dish had absolutely no taste at all. I have to say it was one of the worst meals I have ever had. They don't even deserve one star. Two thumbs down for you \"7 old Fulton\".", "author": "Darlene D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-08-21", "description": "Loved the place ! The Inside was so well done, and the outside area is amazing.  The prices are super low for the quality you get. If you go there, ask for Danny, he is the owner.  He is so nice, and will go out of his way to make you feel like you are old friends. Did I mention the food was to die for, great place, can not wait to go back! I loved the painting of George Washington, I do not know what other people are talking about.", "author": "Rob W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-04-14", "description": "This place was awful from start to finish. don't let the prix fixe menu fool you. everything was mad bland. the anti pasta, steamed mussels, the undercooked \"pasta\", the chicken broth and raw vegetables they call minestrone and the chicken. i wasted two hours of my life there. the service wad awful. Our waitress was rude. we waited 30 mins for each course to come out and it wasn't.crowded. i mean how long does it take to serve soup. we got our entree before the pasta dish. everything was ass.backwards. we had the bus boys checking on us. and when we tried splitting the bill by three cards the waitress came.back and threw our cards down saying we can't split three only two. So we give her half cash.and then want to pit the rest on the two cards. she comes back trying to tell us she wants the tip in cash. Im only giving.this place a star cuz i couldn't do no stars. i could.have run this place.and.cooked better food my self. They were lucky we didn't walk out after the garbage soup they probably \"cooked\" with the left over.vegetables from the day before.", "author": "Matt J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-03", "description": "Went for dinner and was pleasantly surprised. First, the menu and prices. The $22 price fix is unreal. Food was excellent. Everything from the bread, appetizers and entrees were very good. Service was excellent, our young waitress was very attentive and friendly. All in all we will be back, great find.", "author": "Steve R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-06-06", "description": "Food was good but nothing amazing. Service was good as well. Anyone going here will really just be going here as a casual dine in near the bridge.", "author": "Daniel P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-04-30", "description": "I can only blame myself for this one. My boyfriend and I went here last night and were the only ones seated- on a friday, on a beautiful spring day. A huge warning sign; but we were hungry and my boyfriend was delusional with a serious cold. The waiter was useless- couldn't recommend wine or food; nor could he smile or pretend to be a person. The food was disgusting- all of it. Extremely over salted and mushy and fishy and inedible. I'm getting a little nauseous thinking of it.", "author": "Megan C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2010-08-18", "description": "This restaurant is a joke. I ordered the rigatoni with sausage and broccoli rabe and have never been so shocked at the lack of food for the dollar. Two slices of sausage were in the whole dish and they were the size of pizza topping sliced sausages. The dish was $13 and soooooooo not worth it. When I asked the waitress if this is the amount of sausage typically served with the dish, she replied in the affirmative. Its not like I'm looking for some meat-heavy dish here or Olive Garden sized portions. I just would like to get what I'm paying for. Avoid at all costs.", "author": "G. W. Gant L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-06-16", "description": "The prix fixe menu was excellent. Yes, our waiter was \"awkward\" but that word should not be used to describe the experience as a whole. Our pasta course was delicious and the meal overall was satisfying. We greatly appreciated the staff's attentiveness. Better ambiance and food than any of the other neighborhood options (especially Grimaldi's)!", "author": "Julie A."}], "servesCuisine": "Italian", "priceRange": "$11-30", "name": "7 Old Fulton Restaurant", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "7 Old Fulton St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/9d2vjc3kQYcziEq35bTQmw/ls.jpg", "@type": "Restaurant", "telephone": "+17187970007"}