{"aggregateRating": {"reviewCount": 245, "@type": "AggregateRating", "ratingValue": 2.5}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-11-08", "description": "I had a great plate of pasta, linguini with shrimp, and a glass of Pinot Grigio. The former was delicious, good, old fashioned Italian. \nThe restaurant is just that. Old fashioned Italian restaurant and wine bar. I hate to say as a wine bar they are sadly lacking - but I'd come again for the pasta.", "author": "Andrew W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-09-04", "description": "Well... how can I put this nicely. The staff are very polite and experienced but the owner or manager (Julia) was beyond nasty to us upon walking up to ask for a table as well has her staff. I watched her belittle our waiter (who was lovely very good) in an unbelievable way. She was disgusted that we ordered 2 cocktails and a salad at 4pm. In between lunch and dinner. Wish we checked yelp before we sat as the 2 and 1/2 stars actually is too nice for this place. Fire julia or send her to anger management classes. Its the hospitality industry, not the \"be nasty make you feel uncomfortable industry\". FYI 45 year die hard New York and not a tourist opinion. Best of luck with that Julia.", "author": "Michaelangelo L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-05-12", "description": "The Armenian Lady who waited on us was super pushy (meats/dairy)and did not listen well (wanted shellfish\u0026non dairy).\n$18 for 4 small unseasoned shrimp, linguine, capers and no sauce. \nThe place is purely LocationLocationLocation~ cheers", "author": "Mi C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-03-04", "description": "Absolutely terrible. I can't believe I didn't look yelp before coming here. That's my fault. I had salmon which was tasteless. My guest had pasta with shrimp and he told me it smelled very fishy. Inside was charming but the food t gave 2 stars just because atmosphere and the waiter was nice. Otherwise it would have been one star for sure.", "author": "Dimo H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-01", "description": "Perfect location and the bar service was excellent! I would recommend trying a cocktail. The bartender is very talented and pleasant to talk to. We really enjoyed are evening there", "author": "Phil N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-09", "description": "Great little spot.  Very nice staff and great wine.  The inside of this building has a lot of history and character.  Definitely would come back.", "author": "Dorothy G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-09-22", "description": "Very bad service. The host was standing around with his hands in his pockets while we waited for someone to clean the table and give us menus we had asked him for menus, but he said he has to wait until the table we were already sitting at was wiped down. So, my husband got up to get our own menus and still we waited for service, water, general acknowledgement, all of which never came, while the table seated after us (a set-up table)was given all. It seems there is something missing from management here. No surprise that it was the only restaurant on that strip that actually had free tables...", "author": "Katharina S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-01-02", "description": "The service was okay, the food was less than okay. I went on Christmas Night, so I understand some slowness but this was a whole new level. We sat for 20 minutes before even getting asked for drinks. Sat for another 20 waiting for water and bread. Then we were finally able to order. The waiter was nice but didn't get our order right, forgot the appetizer. The food was just bland. It looked GREAT, but it was very bland. They also don't have a dessert menu and it was so cramped in the restaurant. I was constantly hit by a waiter walking by or by other guests walking in or out. To top of the less than okay night, they do automatically include a 20% gratuity in their checks. I would have given at most 15% to this place.", "author": "Kurt P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-09-16", "description": "Very unimpressive. If you ask me my opinion I would wait online for Grimaldi's pizza. However me and my wife were having a beautiful day and thought a wine bar bistro style place would be much nicer on a summer day. There's some sort of conspiracy that didnt allow the staff to sit you inside even though we specifically asked for indoor seating.  Another couple made the same request seated outside. I'm sure there's many better places in Brooklyn to find tasty cuisine.", "author": "Mike B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-11", "description": "The mozzarella caprese was great! Friendly service and the linguini was yummy, the sauce was very good and the shrimp were big! The grilled chicken salad was nice, the chicken a little dry but good anyways!", "author": "Ximena D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-03-29", "description": "Wandered in after a lovely brisk stroll across the Brooklyn Bridge and was in the mood for something quaint, New York bistro food rather than the always tempting but utterly predictable Shake Shack to the immediate left.\n\nThe menu was short but promising. Mediterranean/French...yes, please. My friend ordered the house salad with arugula, candied walnuts and avocado, I ordered the tomato mozzarella caprese app to start. A most unfortunate choice--the mozzarella was flavorless and rubbery, the tomatoes unripe and topped with a measly 2 barely discernible pieces of basil. My friend fared somewhat better with her salad, but that caprese was the worst I ever had.\n\nMains: My friend had the fettuccini, I had the rigatoni. Let's just say one could do better with a box of Barilla pasta and a jar of Raoul's. Also I was horrified when the waitress came by to offer cheese (ooh, I thought, freshly grated Parmesan)--and it was of the prefab dried sawdust variety.\n\nLong story short, the food was underwhelming, lacking in flavor, and ridiculously overpriced. And for two people (a party of 2, I say!) each having one glass of wine, a salad and a simple pasta main, the bill came to $100. That's including the 20% \"service\" fee they added to our bill. Excuse me but since when did maximum gratuity become a mandatory charge? We weren't a large party by any stretch of the imagination and the service was okay, but certainly not great. I probably would have left a 15% tip had we been left with any choice in the matter.\n\nOf course the view is absolutely fantastic. But restaurants on the waterfront have got to stop taking advantage of this fact, especially if they can't offer halfway decent food. I'd have sooner paid 5 times as much to dine at The River Café less than a block away than pay a penny to eat at this sad establishment.\n\n$50 poorer and now suffering from tummy troubles, I will never eat here again.", "author": "Esther L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-12-27", "description": "The woodwork is lovely... of course, a bit overboard, but you have to go with it since it was the times. The staff is friendly, and the food works. We ended up going to this place b/c the pizza line was a bit too long. The hard part is reviewing a place after you've been anxiously hoping for something else. I try to be subjective, but COME ON - I wanted pizza.\n\nThe clam spaghetti was pretty tasty - certainly not the best I've ever had, but not too shabby either. I make a pretty good clam spaghetti, so if I say it's \"not too shabby\", that's actually a serious complement. The wine selection was good enough, and we walked out of there without breaking the bank. So overall, it wasn't too bad of a replacement for pizza. A little heartbroken not to get the pizza? Yes. Wasting calories on tasteless food? Nope.\n\nThe thing that did kinda annoy me (the reason we couldn't hang in the pizza line is that we had somewhere to be) was that it took a while to get our bill. The place was a little too empty for that kind of nonsense.", "author": "Martha R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-08-06", "description": "Don't go here. Second time here. Bad experience. Surely if a staff member has a hygiene issue as a boss you should feel compelled to not only HELP this individual but also be concerned with your customers comfort. A simple pasta dish ruined. The only good thing I experienced was the bread and my glass of wine. I was turned off from this one individual walking pass everyone and they didn't even flinch. Wasted time, money and food.", "author": "Dat S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-07-16", "description": "Awful food, overpriced and our waiter was not attentive. Wish we had the brothers instead, they were so nice.", "author": "Rose G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-06-07", "description": "interesting place in a great location, but limited in many ways.   outdoor patio will be packed on a nice day, but the inside will likely be empty.  it's a nice space (indoor \u0026 out) but lacking something.  staff are super nice and worth the third star alone.  food was average in my opinion.  walk in the front door and the bar is immediately on the left (west wall).  maybe 10 wooden stools with back support.  bar top is a beautiful wood with a traditional rail.  no foot rest, but an interesting bar face with extra woodwork and lighting.  a nice touch.  interesting back bar with large arches and shelves.  couple TVs on each end of the bar.  opposite the bar are a few two top lower tables.  beyond the bar is the restaurant area.  stop by for a beer and to chat with the staff.  great people.", "author": "D H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-05-14", "description": "Surviving by tourist trade only - anywhere else this would die. \n\nThe Prosciutto sandwich had ham, the roast pepper was cold straight out of the fridge. The linguine was so al dente it was almost uncooked. The mussels didn't come with bred for the sauce. The burger was ok and the mussels were good.  The chips with the burger and sandwiches was the worst we'd ever tasted. \n\nThe waitress barely understood English.  \n\nBest thing was the beer and the venue was cute.", "author": "Elise W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-05-30", "description": "Rude servers! Seriously, this place is not worth it. There are several other spots in the area that are way nicer. Aaand we got overcharged for wine! Never will come back for sure.", "author": "K D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-11", "description": "I think it's good Italian restaurant in New York.Very delicious pasta and friendly waiters", "author": "Sergey P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-10-13", "description": "This review is only for the bar and not the food. I came in here to grab a quick drink while waiting for Grimaldi's. The service was okay and the drinks were overly prices. They also have a $15 credit card minimum which is pretty steep. Not sure if there are better options for a bar while waiting in the area.", "author": "Laksen R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-12", "description": "Wonderful service and food! Not sure what is up with these unwarranted bad reviews.", "author": "Jess N."}], "servesCuisine": "Italian", "priceRange": "$11-30", "name": "7 Old Fulton Restaurant", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "7 Old Fulton St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/9d2vjc3kQYcziEq35bTQmw/ls.jpg", "@type": "Restaurant", "telephone": "+17187970007"}