{"aggregateRating": {"reviewCount": 36, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-12-18", "description": "It looks good BUT it's just not. No flavor and extremely dry. It's a \"NO\" for me. This is in regards to the ribs.", "author": "Natasha P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-12-08", "description": "This was the worst \"meal\" I've ever seen ( I would not eat it, I only looked at it) in my years in the city. I returned it to the their stand in Dekalb Market Place and let them know that it was probably a crime to serve such utter filth at any price. My wife picked up the bbq chicken for me while I held down a table. It is accepted that all the food in the hall is a bit over priced but this place is serving garbage and  charging for it. \n\nWith all the businesses and people who work so hard in the city who fail how in the world does this hole stay in business. I'm actually upset ! I don't ever write a bad review but this dump needs to be called out.", "author": "Thomas Q."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-12-02", "description": "Same experience as DJ D below, I wish I spent the 15% tip I dropped on my $17 meal to instead pay the $1 for extra bbq sauce the cooks insisted I needed to pay.  I'd expect that from Taco Bell but not a $17 bbq Joint.\n\nManager, please update your policy to enable your workers to deliver good service.  Food is okay (pork was on the dry side, nothing a little bbq sauce can't fix) but the hospitality was lacking.", "author": "Forrest C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-01-28", "description": "Tried Fletcher's for lunch and was disappointed with the customer service, the cashier/cook acted as if I were bothering him when asking about an item on the menu, not a good way to attract customers. I ended up ordering the pulled pork (it was alright but nothing to write home about) with waffle fries, when I asked for ketchup, the rude cook/cashier said they only carry bbq sauce, who sells fries and doesn't provide an option of ketchup, first and last time I'll be going there, I'll take the ride to Smokehouse in LIC if I'm in the mood for bbq style food!!", "author": "Matt A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-24", "description": "If you want a quick BBQ meal this is your place. I got a brisket sandwich and was not disappointed. It tastes so good and really hit the spot. Although a little pricey, being in a market hall I don't expect anything less", "author": "Laura W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-08", "description": "These may actually be the best wings I've ever had...and if you know me then you know I don't say that lightly. Wings are something I take very seriously. The chicken was fresh and the sauce was clearly crafted with care. The barbecue wings were smoky and not too sweet. The Buffalo wings were the perfect amount of kick. Also whatever seasoning they put on their waffle fries is addictive. A bit on the pricey side (10 wings for $15), but totally worth it!", "author": "Garynn N."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-22", "description": "They were okay. I ordered the pulled pork sandwich. The bun was dented. It was completely drenched in bbq sauce. I could not even pick up the sandwich because the bottom of the bun was just soaked in bbq sauce. The sauce was also super sweet. The side pickle was good though. It was lightly sweetened instead of the usual sour ones.", "author": "Axl-Rose A."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-04-12", "description": "Possibly the worst BBQ brisket I've ever had. The sauce redeemed it a bit, but there wasn't enough of it to make the whole sandwich edible. I'm usually a big eater, but I threw out half the sandwich because I just could not eat any more of it (and not because I was full). The cold hamburger bun that the brisket was served on did not help the experience at all.\n\nOn the plus side, the servers were pleasant and efficient and the food was prepared  promptly, and they served a big portion of brisket (even if most of it was inedible). NYC is becoming a decent place to get BBQ (Mighty Quinn's, Blue Smoke, Dinosaur, Hill Country, et.al.), but this was just bad. I have not been to Fletcher's other locations and they have a good reputation, but I will not try this Dekalb Market location again when there are so many other good options there.", "author": "Steve N."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-03-23", "description": "I've been here two times so far and neither was a great meal.  First I had the rib combo with fries and a beer. The ribs are pretty small and kind of dry. The waffle fries were pretty good, even if I wasn't a huge fan of the BBQ seasoning. They were crisp on the outside and soft on the inside.  \n\nThe second experience involved the pulled pork sandwich with fries and a beer. The fries were good as usual, but the pulled pork was horrible for a few reasons. The The pork is more so chopped than pulled, so the meat can hardly stay in the sandwich because the pieces are so tiny.  The meat was also incredibly dry. I can understand why they put so much sauce on the sandwich because it's hard to get down otherwise.  Even the amount of pork they give you is a negative because it's so heavy due to how dry it is.  The flavor is there, but if I didn't spend $21 on the meal, I probably would have thrown it out.\n\ntl;dr - the fries are pretty good, the meat is incredibly dry. i would not come here again.", "author": "Alex B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-03-23", "description": "The bun is cold, the pulled pork is just warm and texture is too tough!  It's not how it's supposed to be! Num pang is so much better!", "author": "Nathalie L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-10", "description": "Good food overall but do not be a sucker and tip them ahead of them actually serving you, especially if ORDERING TO GO ... they refuse to pack your food for you and instead make you pack the bag and everything else/utensils etc on your own - totally unheard of in 99% of places in NYC!", "author": "DJ D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-04", "description": "I recently  visited  this location  with my kids. It was amazing.  We really enjoyed the pulled pork sandwiches.  Employees  were nice  as well.  Place was clean and trendy.  My experience  was great! I will return!", "author": "Leslie M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-05", "description": "As a physically challenged individual I have never received such great service as I did visiting the Fletchers establishment at dekalb. The food is mouthwatering. Customer service is everything. For me a simple '' hey how's  yours day going\" really goes a long way. The staff at Fletchers really have gone beyond all of this. I've NEVER been to an establishment where the staff remember me by name. This particular staff from the manager Khloe to the assistant manager Kaydeen, the other staff member Danielle all know who I am. They always look out for me and make sure I am well taken care of.\nMoving to the Downtown Brooklyn area has not been the best experience due to personal issues but this particular staff has erased all the negative and given me another perspective of enjoying life. This place is more than a restaurant. It's a community. I feel at home due to each and everyone of them. I humbly say thank you, thank you, THANK you!", "author": "Joshua A."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-02-05", "description": "Their product is not consistent. I went to their brick and mortar on 3rd Ave and their ribs were the worst I have ever had. We sampled 5 different meats and all of them were too dry (with the brisket offerings being \"alright but could be better\").  The ribs were a whole other level of dried out and chewy. The sides we had were really good tho (coleslaw, beans, potato salad, collards).", "author": "Chaka K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-26", "description": "All I have to say is the hygiene quality is disgusting. I ordered waffle fries and a pulled pork sandwich; the pork was dry, and the waffle fries disgusted me after what I had seen. The lady was seasoning the waffle fries in a aluminum bowl, after she finished tossing them around and distributing them to customers she grabbed the aluminum bowl and banged it against a waste basket to empty out the remaining seasoning that was left over. No she did not wash it afterwards either, so I immediately stopped eating and walked away. Disgusting! Before all of this i asked for ketchup and there wasn't any when the big ketchup bottle was visible in the prep area. But she swore there was no ketchup, how could theys serve fries with no ketchup? It's the least you can do after you have given the customers waste residue. Overall it was a bad experience worsened by an even badder attitude from the server.", "author": "Jonathan U."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-01-02", "description": "This review is for 1-1-18. Finally ventured to the Dekalb market and stooped at Fletcher's. They were out of ribs boo. We ordered fries, wings and rib tips. Let me start off with the good. The fries were magically seasoned. They were so good. The chicken was saucy; in regards to taste it was nothing special. The rib tips oh dear they were so dry and chewy and the sauce barely helped. The sauce tasted like ketchup with hot sauce.  The rib tips definitely knocked a couple of stars off.", "author": "Tarneka M."}], "servesCuisine": "Barbeque", "priceRange": "$11-30", "name": "Fletcher’s BBQ", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "445 Albee Square W", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/qVsuTtnUEHQTmUGozLQ02Q/ls.jpg", "@type": "Restaurant", "telephone": ""}