{"aggregateRating": {"reviewCount": 36, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2019-04-23", "description": "My first time here but this place is a good place for a bit of bbq. I had the brisket sandwich with there waffle fries. I got more food then what I expected. There bread to meat ratio is about 25% bread 75% meat (which is how God intended it to be). I needed a fork to eat my sandwich because I couldn't pick it up. The bbq sauce was sweet and tangy with the perfect balance. The waffle fries were great and kind of giant. Which I'm not complaining about. They were tossed with a cajun spice I think; and also come with bbq sauce. Which I got on the side.\nThis place is in a food hall. So don't expect table side service. The menu is limited, but if you eat meat you will be ok. There are a few seats at the counter. If you want to see the action ( mostly chopping meat and frying stuff). \n\nJust an FYI service is a bit unreliable in this whole building, could just be me too. (Tried to write the review while I was there It didn't work out really well.) Well that's all I remember until I come again.....", "author": "Gabby G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-05-20", "description": "Absolutely horrible, horrible, horrible, horrible, do I need to repeat it again ? \nservices is horrible !!! \nthe manager Khloe was absolutely disrespectful I came there for a sandwich at my usual time, and this lady was just not having it that day her attitude stinks, she's been working here for a while now, I see. I don't understand why the owner just don't replace her.\nShe was very rude to her staff members she's bad for business. I'm quite sure I wasn't the first to say it and, definitely not going to be the last. The manager is not professional at all the best option is to eat somewhere else when you see her on shift.", "author": "Kevin B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-02-15", "description": "I stopped by the Fletcher's stall in DeKalb Market for the first time recently and picked up one of their lunch specials. Service was fine, and my order was correct and quickly prepared. Compared to the prices in the rest of the food hall, the weekday lunch specials were a pretty good value, so no complaints there.\n\nI got the BBQ chicken sandwich, which was a chicken thigh chopped up and topped with BBQ sauce, and served with waffle fries and a small cup of either slaw or pickles. I liked the sandwich. The chicken wasn't dry at all and had a nice smoky flavor, and the BBQ sauce was good. The fries were nicely seasoned, and waffle fries are one of my favorite types, so I liked those as well. Overall, what I got was pretty good, and I would get it again if I knew it would be like that every time.\n\nThe person I was dining with got the pulled pork sandwich, and I tried some of that as well. In contrast with the chicken, the pork was so dry it was hard to eat. It had very little flavor and absolutely needed the BBQ sauce that it came with. It was hard to believe that the same kitchen that put out that chicken could be making this pulled pork. I've never been to the main Fletcher's location in Gowanus, so I don't know if we just went to the stall on a bad day for pulled pork, but the quality seemed inconsistent.", "author": "Marissa L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-29", "description": "Great! The meat falls off the bone. Pulled chicken and seasoned fries are simply delicious. Reasonably priced and good customer service. Good Job!", "author": "pamela j."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-11-13", "description": "I love barbecue. It's my favorite food. And Fletcher's can be so, so good. I've been to three different locations in this city and had excellent ribs, badass barbecue fries, and damn good wings as well. I'm truly happy to have them in Dekalb Market Hall, because it's the closest spot for me to get my smoked meat fix.\n\nThat said, there's definitely a problem with consistency. The last couple of times, the ribs and pulled pork have been dry as a bone. \n\nIf you get a sandwich, the staff tends to overslather on on the sauce (which does have good flavor). I like to let the meat shine on its own, so I asked for the sauce on the side...but man, did that pulled pork sandwich NEED the sauce. There was none of the juice you want from a meaty meal, which is a bummer when you drop $11 + tip on it.\n\nSpeaking of the last time...I'm not one to complain about too much meat, and maybe it was because I tipped him well, but the dude LOADED me up. I actually think he tried to kill me with pork (maybe I didn't tip as well as I thought?). \n\nEither way, I survived, my man. I wish you didn't forget my pickles though.", "author": "Peter D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-10-17", "description": "Really good beef brisket sandwich. \n\nThe sandwich doesn't come with any sides, not even chips, so I of course thought $12 was too much. However once I saw the ginormous amount if meat added to the sandwich, it made price a bit  more palatable. That said however, for the amount of meat given, they sure were stingy with the sauce. I had to ask for a little more and even that wasn't enough. They do sell a side of sauce for $.95 (I think, the number on the menu board was smudged).... but I didn't feel like buying it.\n\nAnyway the sandwich was good, I ended up with left overs, the service was okay, and I'd return to try more.", "author": "Kimberly C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-27", "description": "Man.. that was some righteous Que. \n\nMy wife \u0026 I came for lunch and had a really good experience. We ordered a Chopped Brisket sandwich combo along with some Pork Rib Tips. The brisket had a nice charred exterior as well as being juicy. The pork ribbed tips, also a home run hit. Aside from being a tad expensive, the combo meal is the way to go. I grabbed a beer from another vendor, beer and BBQ on Sunday. It doesn't get any better.\n\nThere are lots of choices in the DeKalb market, if your looking for good BBQ then you have to stop by Fletcher's BBQ.", "author": "Bill S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-04-14", "description": "They have lunch specials: 3 wings for about $7, ribs for about $10 or pulled chicken sandwich for about $10. All came with fries and a pickle/coleslaw. \n\nConsidering the fact that this is so close to my workplace, I reeeeally want to like it, but I can't. I went with the chicken sandwich and I kind of regretted it. The sauce was okay but the chicken was super dry. My bbq waffle fries tasted like they were put out for a while, kind of cold and stale. A huge disappointment considering it was about $13 with tax. I could have gotten a lot better food around Dekalb Market for that price.\n\nMaybe I'll try again next time and get the wings instead. But for the most part, I would avoid this place.", "author": "Alice X."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-10-28", "description": "Food: 7/10\nService: 7/10\nAtmosphere: 5/10\n\nFletcher's is located in the Dekalb Market Hall food court, and almost always beckons with the sweet smell of hardwood smoked barbecue.  I stopped in once, to try some smoked wings and ribs.  That day, they had run out of wings and had to retreat to somewhere out of site (not in the food court itself) to grab some.  Between that, and then the time needed to crisp them up in the fryer, it turned into a pretty lengthy visit.  That said, the young lady taking care of me made sure to include extra wings and ribs for my wait.\n\nThe ribs were meaty and had a nice smoke flavor, and for the most part were tender (a few tougher spots here and there.  As for the wings, they didn't get nearly as much smoke flavor into them as I would have liked, and a few spots might have gotten hit with just a bit too much heat, creating some spotty dryness.  Overall though, Fletcher's probably won't let you down if you're doing some shopping and the smoky aroma draws you in.", "author": "Ryan S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-12-06", "description": "Got a brisket sandwich. While a lot of meat on sandwich, it was extremely dry.\nAdding $5+ for fries and can of soda is steep also. Overall potato hamburger bun fries and can of coke for $20", "author": "Kathy C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-11-10", "description": "This was my first time been in here so I had some questions about the menu \u0026 Cashier was super RUDE \u0026 unprofessional!\nIf you want your business to grow, you need to be friendly!\nI didn't even try the food due to how rude he was!", "author": "Leo S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-27", "description": "All I have to say is that their bbq is absolutely delicious!!! Best bbq I've had! Tried the pulled pork and the brisket sandwich and the fries with meat. I loved that we got to watch them pull the meat, and prep it, it was a lovely drum roll for a fantastic sandwich that is huge and heavy and lean af. The bread doesnt stand a chance tho, but I'm not complaining. Food was still great the next day", "author": "Amber B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-02-16", "description": "We had ordered two of the beef brisket sandwiches and they were absolutely inedible. The meat was so dry I thighs I was going to choke on the first bite. They also left out our drink. First and last time we will order from Fletchers. Very disappointed.", "author": "Amy G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-18", "description": "I got the ribs and the fries with brisket. The meat was extremely dry and the texture was gritty. Let's just say I had to eat it super fast so I don't take that much time realizing how bad it was. I just scarfed it down.\n\nFor $20 I know I had to finish it soon or else it would have found its way to the trash can. Couldn't bare to throw it away so just had to swallow it whole.", "author": "Brennen D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-17", "description": "This was actually really good. I did the lunch deal and the chicken sandwich was a thigh and had great smoke flavor. The buffalo wings were really good. Smoke flavor and buffalo sauce with a great crisp from the frier. The waffle fries were done to order. Ribs looked great, I didn't have them but I will next time. With the lunch deal it was a great price. Highly recommend.", "author": "Scott B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-27", "description": "When in DeKalb Market, be sure to stop by and pick up an order of their buffalo chicken wings. They have a smoky flavor and nice crunch to them. Simply heavenly!", "author": "Terry H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-09", "description": "This is one of my go-to places in Delkaub Hall. Their rib tips are crack and so are the waffle fries. It's good bbq for NY , prices are pretty good, and the food is always good. Servers are friendly and everyone behind the counter is cool. Love it!!!", "author": "Dominique S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-02-02", "description": "Agree with some comments here that the ribs are dry but wings and fries not bad. Combo is a better deal. I've had better BBQ s else where. If anything would only try the wings again. Pricy? A bit, yes, for the quality.", "author": "Shanny L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-26", "description": "So.Freaking.Good. The brisket was suuuuper tender. The BBQ chicken was soooo tender as well. The BBQ sauce was phenomenal. Also had the waffle fries and cornbread, both were also amazing. I have only good things to say about the food. This location was at the Delkab Market in Brooklyn. Definitely find a spot to sit and enjoy this BBQ, it's too good to stand up and eat.", "author": "L T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-14", "description": "I don't know what y'all are taking about with the rest of the food here, but I've gotten the pulled pork barbecue fries twice and they are AMAZING. The only thing hard to stomach is the cost, which I pretty much forget about as soon as I dig in.", "author": "Daniela I."}], "servesCuisine": "Barbeque", "priceRange": "$11-30", "name": "Fletcher’s BBQ", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "445 Albee Square W", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/qVsuTtnUEHQTmUGozLQ02Q/ls.jpg", "@type": "Restaurant", "telephone": ""}