{"aggregateRating": {"reviewCount": 223, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-07", "description": "Westville, I am low-key obsessed with you. \n\nYou tease me with your too-hard-to-pass-up-on happy hour menu (not to mention the generous 4-8pm HH time frame). You're humble with your cocktails but damn, your 'BERRY ROADS' is off the chizainnns good; that raspberry purée really hit the spot with the ginger beer. Your 'TRUFFLE FRIES' are legit truffle fume bomb and for that, I'm eternally grateful (you guys, they don't skimp on the truffle so it's the real deal). Hanger steaks are usually a faux pas for me but you had me swooning over your 'SWEET CHILI RICE BOWL WITH HANGER STEAK'; super filling, sweet and non-tough steak.\n\nGreat staff. Solid American new/comfort food. I'll definitely be back for more Berry Roads. MY. FAVORITE. DRINK. IN. ALL. OF. BROOKLYN.", "author": "Lisa Z."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-10", "description": "Loved the Sweet Chili Lime Rice Bowl Special w/ kale, farro, carrots, sweet potato, corn \u0026 zucchini over brown rice topped w/ dried cranberries \u0026 toasted pumpkin seeds\nI have now been here several times and always enjoy the Specials. Great fresh food. Nice open space (patio is great year round). Good service.", "author": "Suzanne J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-16", "description": "Always great service and great food. Never more than a 10 minute wait. Variety of food and fresh. Plus you have the option of indoor or outdoor seating.\n\nToday's choice was salmon with sparkling rose. Amazing.", "author": "Natasha E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-29", "description": "Delicious and good atmosphere. They have indoor and outdoor seating. As it was a nice day, most of the outdoor seating was already gone, so we opted for inside. \n\nGot some eggs benedicts, and you could get it with mixed greens or potatoes, but they never asked. I didn't realize until I got my order and had the greens with it, was kinda craving the potatoes, but decided to just keep it! The Benedict's were on like hash brown potatoes already instead of classic English muffins, and I enjoyed the hash brown potatoes. Food was tasty. \n\nThe St Germain pitcher of mimosa was not well mixed at all though as the top was quite bubbly and the bottom was very OJ. They could've done better on that.", "author": "Sara W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-13", "description": "I live near a Westville and it's pretty good. The prices are a bit expensive but the food is worth it.           The atmosphere is delightful and friendly and the staff are nice and very welcoming. I love the blueberry pie, the Mac and cheese and especially the fish and chips.", "author": "Olivia C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-29", "description": "What a nice place!  Inside, outside and outside covered dining options here. Deliciously fresh and mostly healthy menu AND they still know how to dish up a tasty spicy margarita and buttermilk fried chicken sandwich with avocado, arugula and chipotle mayo on a Portuguese muffin. \n\nMy girlfriend decided to make her own market bowl consisting of four vegetables - cauliflower with tahini, artichokes with parmesan, zucchini with cherry tomatoes and mozzarella, and brusells sprouts with honey dijon.  It was quite difficult for her to choose a favorite when I interrogated her for purposes of writing this review, so then I had to sample the array and I completely understood her dilemma.  I would say all were great and that you wouldn't go wrong with placing the very same order.\n\nService was very polite, mostly efficient, and made us very comfortable in the enclosed, but semi-outdoor seating area.  Next time, weather accommodating, we will sit in the fully outside seating area.", "author": "Charles B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-03-26", "description": "Little pricey for what you get, but hey, you're in Dumbo. Nice atmosphere, solid brunch. I'd definitely go back.", "author": "Adam H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-07", "description": "My two friends and I wanted a light lunch and this place was perfect. It's in a convenient location in DUMBO and there are many tables inside and out. We got to sit at the covered patio (there's also an uncovered patio) and it was lovely! We decided to share the market plate (4 items) plus one a la carte.. We chose the asparagus (with parmesan), mushrooms, sweet potato fries, Ientil hot dish, and cauliflower covered in tahini (as the a la carte).. Everything was delicious and you can tell the quality is fresh and the ingredients are good. We felt healthy after a lot of NYC foodie adventures so it was a great way to reset. The market plate is $17 (4 smaller portions) whereas a la carte is $7 (larger portion of one item).", "author": "Krystal V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-30", "description": "Third time here and third time they accommodated a large group I had. The staff here is friendly and quick. It's a cool neighborhood spot, nothing fancy but has a little something for everyone. Some reasons why I keep coming here with friends: \n1) Menu can accommodate vegans, vegetarians, diabetics, people with high blood pressure, picky eaters, even pickier eaters (someone who ONLY eats chicken tenders) and people who can never decide.  \n2) good quality \n3) great value \n4) good for families or couples\nYou get the point. They do a good job making everyone feel welcome. Check them out if you're in the area.", "author": "Danielle H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-14", "description": "Was in Dumbo for an event at Duggal Greenhouse which offered free food.  Having not eaten all day, my buddy and I decided to eat a quick bite before going to the event.   We ended up ordering the House Vegetable\nSpecial with yucca fries on the side and a steak sandwich.    \n\nWe were both really pleased with the meal, service, and the ambiance of the restaurant.   My steak sandwich was cooked wonderfully and all the ingredients were farm/garden fresh.    We both questioned getting a meal before an event with free food.   The event did have some great food.  However, after the event ended that evening and we set off on the long drive back to Maryland.  We were both happy that we decided to try Westville out.\n\nOne of the easiest 5 star ratings to give!", "author": "Benjamin T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-19", "description": "I came here on my lunch break specifically to try their famous Mac and cheese but saw the grilled kale polenta and knew I must try that as well.                                  The really great thing about Westville is that you can order online for delivery or pick up if you don't have time to sit and eat at the actual restaurant, which I did not today. I placed my order for pick up online and popped on the subway and it was ready when I arrived. The interior of the restaurant is lovely: kind of beachy and has a California vibe that is light and airy. They also have an outdoor area to sit and eat as well. I came around 12:25PM and it was pretty packed.\n\nMy food was waiting for me when I arrived and was already paid for online. You have the option of paying cash when you get there if you'd like as well. The Mac and cheese was divine: so rich and creamy with a crispy ness on top from being in the oven. I loved the cheeses used. It just had such great flavor. The polenta was excellent. The kale was married perfectly inside the grilled polenta which had a kind of nice Smokey flavor from being grilled and was crispy on the outside and soft on the inside. \n\nThis was an excellent meal and the portion sizes were large so I have leftovers for lunch tomorrow! I'm stoked!", "author": "Joanna V."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-09", "description": "Honestly I am a big fan of Westville Chelsea but today's lunch was very average at the Dumbo location \n\nStaff suggested the chicken bean salad as the special of the day but it was everything from special.  In fact it was so boring and bland I could only eat half. \n\nThe cucumber lemonade was like drinking sugar water \n\nThat being said the place does have plenty of space and outdoor patio if you don't mind waiting and very attentive staff.", "author": "John B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-03-28", "description": "Healthy good food. Menu is interesting. We had pumpkin soup, grilled cauliflower with sour cream, and skirt steak sandwich.", "author": "P. T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-17", "description": "My boyfriend and I stopped here for dinner and were BLOWN AWAY by how delicious our food and vegetables were. He got the chicken with two veggies (Brussels sprouts and asparagus) and I got the salmon with two veggies (zucchini and sweet potato mash...they were tragically out of eggplant, the only downer). The meats were yummy, but the vegetables were truly the best I've had at any restaurant and the star of the show. Perfectly seasoned and absolutely delicious sauces. I'm still dreaming about my zucchini. We left full and super satisfied, but not bloated. \n\nService wasn't super attentive, but that was understandable since they seemed busy on a Sat night, but we still tipped generously because the food was just so amazing. I will be back!!", "author": "Allison Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-08", "description": "I vote you should bring Westville to Detroit! \n\nThis is a great place to eat that accommodates many different food preferences/ dietary needs. The times when you have a hard time deciding where to go... think no more. \n\nSpeaking of thinking no more, I can't stop thinking about the brussel sprouts and veggies. The sauce on the sprouts....so good. \n\nThe staff is welcoming and warm. Great atmosphere and nice place to connect with friends or enjoy a meal at the bar. \n\nThe cookies hardly made it to where they needed to go as I was bringing them to a friends home. Order dessert, you'll be very happy :).", "author": "Becky S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-10-11", "description": "I'm sorry.  Am I ruining your overly pretentious hipster vibe with my presence?  Is that why it is too inconvenient to serve me?  Oh.  Were you too busy posing for your close up and that is why my pork is dried out?   I forgot no fries, but apparently an extra order of oil came on this weeks delivery so might as well soak the pan roasted potatoes in it.  That's close enough to fully cooking them?\n\nYeah.  You guessed it.  Bad service.  Bad food", "author": "Denise S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-09-24", "description": "Things I really enjoyed at Westville:\n- Most of my meal: I loved that there were so many interesting veggie options and I had a hard time choosing my four items for the market plate. I went with the fried plantains, the Brussels sprouts, the soy long beans, and the mixed mushrooms and all were pretty good. I also had the mango lemonade which tasted nothing like mango, but it was still a pretty tasty lemonade. \n- The outdoor seating: it was a perfect evening to dine al fresco, and it was a peaceful patio away from the touristy hustle and bustle of the rest of Dumbo. \n\nWhat bugged about Westville:\n- The lady they had greeting people at the front on a recent Saturday night. I walked in with a smile and a 'hi,' and without making eye contact she snapped 'you can talk to her,' gesturing to a (much nicer) lady standing behind her with an ipad. Then after we checked in with the nicer lady, the mean lady had the awful job of having to show us to our table. There's a glassed-in area that leads to the outdoor patio, and she made a vague gesture from inside to one corner of the patio saying 'you can sit there.' I asked her where she was talking about specifically since she was so far away as to not be helpful at all, but she made the same general gesture, so we just headed to the empty table that was in the vicinity of her rude hand gesture, then she yelled at us from her spot that we were in the wrong place. Ugh! Just an unpleasant way to start the meal. \n- Though we made a reservation online and came right on time, I got a scoldy email that night saying that we never showed up for our reservation. I responded via Open Table that we had in fact showed up, but all in all the host situation is not on top of their stuff at all, which is really unfortunate for a place that seems to get so busy. \n\nSo though it was a nice enough meal and there are other items on the menu that I'm eager to try, I'm not so eager to go back to this specific location.", "author": "Christina P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-09-25", "description": "Okay cant blame the establishment for crying babies. But i sometimes wish these Dumbo stroller brunchers stayed home and bond more with their kiddos on their balcony or a no-baby/stroller policy like coffeeshops have a no laptop rule. Just to offer more convenience...\nWell having that said. \nI have never had such a basic cobb salad void of creativity or love. Just greens, chopped bacon chopped chicken some blue cheese and half an avocado  thrown in... THATS IT!! No union not a single cranberry. My friends from Europe were happy with their burger, so I am happy. The grits were a new thing for them and they loved it. But my salad ..... but i ABSOLUTELY love the staff. Kind and service oriented. But they should get a new chef/cook.", "author": "Richard K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-12", "description": "Got to this place a little late, and there was a bit of a wait. We we're offered a seat at the bar which was very comfortable. We ordered off of their brunch menu. The breakfast burrito was absolutely off the charts. I would recommend to anyone. If you are in Dumbo def check this place out.", "author": "Michael N."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-04-23", "description": "I stopped by with my family on a Saturday at 3pm. It was a very nice day out and everyone was at Brooklyn Bridge Park so I would assume this place be very busy (it was). It was a cute place with a lot of seating and a great outdoor space and screened in patio. \n\nI was told it would be a 20-30 minute wait but was pleasantly surprised when we really only waited 10 minutes. We were seated quickly, but the quick service aspect stopped there. Granted, the restaurant was really busy but it took nearly 10 minutes to get water, another 10 to order and 20 minutes to get food. When the food arrived, there were no utensils and it took a long time to flag down someone to get them. The food was also not super spectacular. Their chicken cobb salad and fried buttermilk chicken sandwich was really good. However, we were just not too taken with the other dishes. A bit pricey as well. Overall, 2.5 stars. Probably will not return.", "author": "Erina W."}], "servesCuisine": "American (New)", "priceRange": "$11-30", "name": "Westville Dumbo", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "81 Washington St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/6iR4MOEJIdEMXhHxm5nj7w/ls.jpg", "@type": "Restaurant", "telephone": "+17186185699"}