{"aggregateRating": {"reviewCount": 223, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-09", "description": "Amazing food.  The pickiest eaters LOVED their food.  Great salad selection.  Fast and friendly delivery (seriously - the delivery person was so nice!).  Highly recommend.", "author": "AE F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-27", "description": "This place is fabulous. AMAZING choices for Vegeterians. I ordered a rice dish that has sweet potatoes, corn \u0026 Zucchini. It was to die for. Portion size is very good. Service \u0026 laid back ambience is wonderful. Would highly recommend this place!", "author": "Nidhi P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-28", "description": "My first time! The food \u0026 the service was amazing!! Its my new favorite place!! I recommend the vegetable platter with cauliflower, Brussel sprouts, beets and goat cheese and garlic mash potatoes. I loved the lemonade with mint!!", "author": "Keith L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-24", "description": "Great place to have breakfast or lunch. They serve a small but fantastic brunch menu. We had the Mediterranean breakfast salad, breakfast burrito, potato cake benny and some healthy tea. All was fantastic. Service was also very attentive. Highly recommend.", "author": "Greg S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-21", "description": "Great for take out and love eating outside in the summer.  Yummy food and cocktails!", "author": "Brooklyner B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-18", "description": "Walked in here for an early dinner after exploring Dumbo on a very hot day. Ordered a salad and the market vegetable plate; salad was great and the vegetables were very well cooked. They have an indoor seating area as well as a patio and a terrace, so plenty of tables! Great service too. Would definitely come back here if I'm in Dumbo again!", "author": "Linan C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-15", "description": "Great food! Great atmosphere! Great service! From the hostess Madison greeting you at the door throughout the meal was wonderful. The manager personally checked on us. Great experience all around.", "author": "Justin F."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-10-15", "description": "My worst experience with quality and service in NY \nRaw eggs on over done New York steak ...  not once did the wait staff came to ask about the experience ... \n One star is one too many", "author": "Gaguik G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-12", "description": "Quick and attentive service with good food. Nice stop after the hike across the Brooklyn Bridge. The Market Place veggies were good!!!!!", "author": "M C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-09-01", "description": "If you want warm water, dry salad, slow service and over priced food... go here! Not impressed, very loud inside too!", "author": "Bekah M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-08-02", "description": "Everything on the menu looked incredible and I loved the place's atmosphere but the food itself was incredibly underwhelming. I ordered a lime tahini cauliflower bowl with sweet potatoes and chickpeas which looked beautiful and tasted like cardboard. There was no lime and just a bit of tahini drizzled on top for show. I tried getting through the bowl but it wasn't possible. I'd recommend either trying something not too starch heavy or be fine with bland food because it seems like that's what you're going to get.", "author": "Radhika S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-15", "description": "Enjoyed a wonderful lunch at Westville Dumbo where the food was fresh and very delicious. Added benefit is that the food is also very healthy. The  broccoli with garlic is so good that you forget that you are eating vegetables. The macoroni and cheese was scrumptous as well and it is just a good vibe at the restaurant.", "author": "Cynthia M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-13", "description": "Just great service and amazing food!!! The staff was incredible.  I love the ambience and location of the spot. Really authentic for its kind!", "author": "Paul C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-04-29", "description": "Was so excited for Westville to come to my hood. Every time I go though, the service seems off. Understandable for a new restaurant. But tonight took the cake. \n\nI called and asked if they had a table for two outside. The woman on the phone said \"yes, we have several free.\"  So my husband and I head over only to find they are packed full. Hostess says \"oh you shouldn't call and ask. They don't really know the status - they are in the back and don't check with us.\" Sorry? How am I supposed to know the people who answer the phone don't know what they are talking about. \n\nWhile I am arguing with the hostess, the mysterious woman from the back who answers the phone appears. She asks the hostess how long the wait is for two. And this is just when the hostess is telling me that the woman in the back doesn't check. That woman baited me to come down there on a lie because she was too lazy to ask for accurate information at the time I called. Too lazy to put me on hold and ask. \n\nThis wouldn't happen at any other westville. This place needs to figure out how to run a neighborhood joint. Thanks for the disappointment and the snobbery. So glad café gítane is coming to the hood now!\n\nWould have given one star for poor execution, but giving two because other westvilles are good.", "author": "Lindsay F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-08", "description": "There isn't much to say, really.  Westville makes goo food at all of their locations.  They've also managed to secure competent and courteous service staff.", "author": "Pablo G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-23", "description": "Westville's food was always great in Manhattan and it looks like Brooklyn has followed suit.  The Brooklyn location, while busy, is also a bit less hectic.  Service was a bit odd in that all three waiters/waitresses tries taking our order the second we sat down but were very pleasant overall and our orders came out quickly and correctly.  Great options from healthy to indulgent and the vegetable sides are all very good as was the special salmon burger.  \n\nMy one issue was the $2 up-charge for sweet potato fries when they are the same price as regular fries on the menu and I don't recall seeing an up-charge stated.  At lower end places, fine (when its advertised), but when a couple is dropping nearly $100 for a primarily vegetarian meal (albeit a very good one), I feel like I am getting clipped and not in the hippy-dippy vibe they are promoting.  Likely to go back but will be ordering strategically (and if I ever get out of work in time happy hr looked cool).", "author": "Sam B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-07", "description": "LOVE,LOVE,LOVE!\nI've been a regular at Westville for a few years,always have a great experience and was so pleased to see that Westville Dumbo was no exception.\nQuality food, super friendly and fast service and beautiful ambiance.\nVery excited about this new location and will definitely visit frequently!", "author": "Laura A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-07", "description": "I visit Westville locations in Manhattan often, and they're all great. The new location in Dumbo is no exception!\n\nThe food is great, the service is awesome, and it's an excellent location. I recommend to all. 5 stars.", "author": "Zach M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-27", "description": "An amazing find. Spectacular hospitality and market fresh food. Lively and extremely welcoming. The owner is approachable and generous. Will be back on our next visit.", "author": "Mark S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-28", "description": "The food here is truly excellent. I had the crispy quinoa burger and beer. Really tasty and reasonably priced. Even more, the service is speedy!  Even more than that, the folks at the bar will give you tastings of what is on tap!\n\nSean, one of the directors was on hand and filled me in on the company. And he gave a free shot of an Irish whiskey they are offering at the bar. How great is that!?\n\nThe only reason I didn't give five stars? The noise! The space is very echoey and one must almost shout to be heard by the person next to you. If that was solved? Seven stars!", "author": "H. Stephen B."}], "servesCuisine": "American (New)", "priceRange": "$11-30", "name": "Westville Dumbo", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "81 Washington St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/6iR4MOEJIdEMXhHxm5nj7w/ls.jpg", "@type": "Restaurant", "telephone": "+17186185699"}