{"aggregateRating": {"reviewCount": 223, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-12-03", "description": "Westville: It's Fine™\n\nThis new outpost of the Manhattan chain is in many ways emblematic of DUMBO--at least 25% too expensive, filled with white people and their children under 5 years old, and it has exposed beams. \n\nWestville serves large portions of what I'd call \"sure-fire\" food. The service was friendly and the food comes out FAST. An appetizer, two entrees, two drinks, and a dessert was $90 including tip.\n\nFor the same price, you can eat sparingly at one of the only two good restaurants in the neighborhood (Vinegar Hill House) and feast like a king at the other (Juliana's Pizza). I'd just as soon go to either of those places, (or heck, get a sandwich from Foragers). But because of the dearth of restaurants in DUMBO, they will be packed all the time and make a lot of money. It just won't be my money.", "author": "Steve C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-30", "description": "We ate out few times while in NY, but this is the only place I wish was in Boston. I would definitely visit at least once a week. Meals were delicious, drinks tasty, and staff friendly. Hopefully can go back because there were so many things that I want to try.", "author": "Sarah M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-03-20", "description": "Sweet little chain restaurant tucked away on Washington Street. Cheery waitress, yummy burger, not so great dessert. \n\nThere are only two bathrooms, you might wait a while to use the loo. \n\nIf you leave your coat on the back of your chair rather than hang it up, your chair will fall over backwards (happened to three people while we were there).", "author": "erika s."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-22", "description": "SO GOOD!! Fresh food, great service, and all around good vibes! And on top of that the prices are so reasonable for what you get! Definitely recommend and will return!", "author": "Rebekah K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-16", "description": "We were starving after walking the Brooklyn Bridge, so walked into the first place we saw, with no expectations. None of us have ever heard of this place. What a pleasant surprise! The market vegetables were really good, especially the deal where you get a combo of four. Both of my friends ordered it, and I ordered grilled salmon with two sides of market vegetables, Asian-style bok choy and artichokes with parmesan. All was excellent. We then had really nice tea with cinnamon sticks and lemon.", "author": "Anna B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-15", "description": "thank goodness for Westville in Dumbo. We were in need of this comfortable dining atmosphere with variety + easy menu with somewhat healthy options. After a long renovation, it has finally opened, and we are so very happy. We(my husband and I) were always big fans of westville. We relocated from East Village to Dumbo about a year ago. We love Dumbo, but it seriously lacks dining options compare to our beloved East Village. So we are very happy and can't wait for the outdoor space to open up :) \n\nmust try: french fries ... don't get one to share, get your own, you won't regret :)  I had crab burger the other off of their daily special menu. It was amazing :) \n\nAnyone wants to open a good ramen or asian spot in dumbo? We need that too !!!", "author": "Christine H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-08", "description": "It was pretty good. Food is kind of expensive but that's expected of Dumbo. It was close to work so I came with my co-workers. Not much seats inside so they offered us to sit out in the yard. Food was good but I wish there were more seats inside because sitting outside was uncomfortable when the sun kept shining on me.Great service and setting. Very lovely outdoor patio seating is available.", "author": "Michael J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-25", "description": "went here for Saturday brunch! Got seated and served really fast. Our waiteress was very nice and food came quickly. Had the avocado toast and it was very delicious. The place had a nice hipster aesthetic vibe and was very comfy. Would definitely come here again.", "author": "Macaron M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-06-23", "description": "I took my Family for dinner here last night and had a not so great experience.   Our friend that lives in Dumbo recommended it as they have a lot of vegan/veggie options.  I ordered the mac and cheese for my son and I asked the waitress if there was any bacon in it because we are vegetarian.   She said no there isn't.   When we got the mac and cheese my wife and I tried it and she immediately said it tastes like bacon so we did some digging and sure enough some small bits of bacon were in there.     \n\nWe told the waitress and she apologized and took it back then another waiter (maybe manager) came by and said \"I looked there's no bacon in your mac and cheese but it's ok we'll make you a new one on the house\"   Nothing like being called a liar.  I told him I could show him the bacon he just said \"No it's ok and walked away\"   As a matter of fact I still had the small piece of bacon on my plate. He came by later and apologized if he offended us and offered dessert on the house.  We politely declined.\n\nThe food was ok.   Quinoa and Artichoke burger was bland.  Truffle parmesan fries did not even slightly taste like truffle.   My son enjoyed the second round of baconless mac and cheese.", "author": "Daniel C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-22", "description": "The place has great foods. I personal like the sweet chili salmon bow a lots. We come in 10 people group and the waiters served us very well, even split the bills perfectly and quickly.", "author": "Duy P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-22", "description": "Food is amazing!!! Good place to come before or after walking the bridge. You can get an amazing picture with the bridge behind you! Serve was amazing.", "author": "Monica B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-11", "description": "My friend who works down the block took me here for a light dinner. Not realizing that we should have made a reservation, we waited 15 minutes to be seated - it's worth the wait. The amazing location, delicious food, friendly staff, inviting ambiance, and vegan friendly options make for a satisfying and delighting experience. Highly Recommended for those who've never been. We both had the Quinoa burger, served with a side of fresh lettuce.", "author": "M S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-02", "description": "We love Westville and are so happy to have it in the neighborhood. The food is fantastic (we are partial to the market sides, sandwiches, and veg burger) and the service is top notch - it's always an easy, reliable option. The outdoor space and happy hour menu are major bonuses.", "author": "Joe S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-06", "description": "What a good go to spot. If I want a well mixed cocktail and some good ole veggies to make the old lady happy with me, this is the place! Well priced too.\n\nI've just never been a fan of the overly bright/white decor of the westville chain. But thats more of a personal preference for dark woods and the occasional tv playing sports. It's kind of in that awkward spot between a lunch spot and a dinner place.", "author": "B C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-19", "description": "YESSS the market veggies are just so good. Fresh and interesting and healthy. Good to balance with the lesser healthy items like smokey mac n cheese. I ordered from up the Hill (Brooklyn Heights) and it came so super fast I actually nearly burned the roof of my mouth. now that is a first for delivery!", "author": "Jennifer M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-19", "description": "Service was excellent! The best thing about this place! The food was pretty good. Had the breakfast bowl with poached eggs which were a little over done. But the drinks were yummy! Had the homemade bloody Mary and cucumber lime lemonade with prosecco. Delish!!!", "author": "Andrea D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-25", "description": "Great variety of vegetable dishes and slightly above average food. Mistook my friend's order and then undercooked his salmon (it was raw). Okay place but go elsewhere if you don't love the menu.", "author": "Max W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-24", "description": "I've ordered here 1 per week for the past year and it's been going downhill.  Last week I paid close to $30 for shrimp tacos with 3 shrimp.  I called to let them know and was kept on hold for a long time and finally hung up.  No call back.  Then I sent them and an email and again nothing.  Poor service with too many other options.", "author": "Sara L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-16", "description": "Westville, you are great... You never fail to fill my stomach after a long day and you always manage to put a smile on​ my face. The staff is always friendly, and they always manage to satisfy​ every customer​ request. I would recommend this restaurant for a casual​ night out or a nice brunch with some friends.", "author": "Amber P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-12", "description": "I had one of the greatest salmon salads here. Amazing. Service was decent and the waitress was friendly and attentive. Price was reasonable for the quality. I will definitely go back but for some reason I can't bring myself to rate here 5 stars. May change it during next visit", "author": "Kamran N."}], "servesCuisine": "American (New)", "priceRange": "$11-30", "name": "Westville Dumbo", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "81 Washington St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/6iR4MOEJIdEMXhHxm5nj7w/ls.jpg", "@type": "Restaurant", "telephone": "+17186185699"}