{"aggregateRating": {"reviewCount": 223, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-26", "description": "My SO and I went here for dinner. Food was incredible. He had the quinoa burger special and isn't a vegetarian and he loved it. The ahi tuna was cooked perfectly and the asparagus was easily the best ive ever had. Service and atmosphere were also a thumbs up. Would come back again", "author": "Samie S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-01-03", "description": "I'm writing this as one who has lived in DUMBO for 8 years and yearned for more better restaurants - and in the best interest of Westville. We want you here.\n\nI love Almar, Superfine and Gran Electrica, but that's not many options when it comes to an NYC neighborhood. I understand that good restaurants either don't want to come here or don't make it here because we're a neighborhood of families with kids who can't go out much. Regardless, we're jealous of other neighborhoods and want more options. Enter Westville. We've eaten in Manhattan locations and liked it. We were excited. The food was great. Somehow, the food isn't as great here. I have no idea why. I'm down to liking only the fries. The mashed potatoes are really bad. I had soup that really sucked. I went for breakfast and had one of the worst omelets I've ever had. I got grilled chicken to improve it but the tastes didn't go together. The salad was average but was the only saving grace. How can you screw up breakfast? \n\nThe design is stunning. It's a great space to work with. The service is really great. But they're bored. They said so when I was the only one eating at the bar. Thanks. You're welcome for my $50 shitty meal and 25% tip. \n\nI'm trying to like you. I'm trying not to miss Rice. (And that's a pretty low bar.) I want you here, Really. Please please make better food. Make better children friendly food. That's the reality you signed on for. \n\nThis really is out of a desire for things to work out for you.", "author": "Little R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-14", "description": "Visited twice in our trip to NY. First time we went was lovely with great service. Second time there was a mix up with our order, meaning some of our meals did not come out. However the owner/manager quickly rectified this by giving us two main meals on the house and free pie for dessert! Overall a lovely experience and delicious food.", "author": "Jed D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-05-28", "description": "You know what you're getting at a Westville - a menu that has something for everyone, but a tad bit overpriced. I added grilled chicken to my Greek salad and it came out to be $16 + tax. Our server was very nice!", "author": "Scott G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-23", "description": "I've long been a Westville fan on account of their numerous vegetarian options (and incredible mashed potatoes). And I don't usually leave Yelp reviews, but I had such a pleasant experience here that I had to write one.\n\nI went with my boyfriend, who has specific dietary restrictions. Our server was truly excellent in accommodating him, going back and forth to the kitchen to check with the chef about ingredients. We both really appreciated it.\n\nThe food was delicious also! As usual.", "author": "Nicole P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-27", "description": "Great place to grab food with a chill vibe. Unfortunately when we went the patio was under construction. The was wasn't long. The food menu is great. The Israeli chicken shawarma plate is as good as it gets. It's flavor full and the size is great as well. I had the veggie burger with a side of greens and was alot to eat. Pattie was homemade and the spicy tartar sauce with grilled mushrooms were the right touch. Happy is good here as well.\n\nHighly recommend checking this place out if your in DUMBO.", "author": "Akshat D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-20", "description": "Love this place!! I eat here almost everyday for lunch. The kale salad is sooooo good and so are their sandwiches and burgers. A+ place to go for lunch.", "author": "Jeirlynn J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-09", "description": "Delicious food, cozy vibe, amazing service - Westville Dumbo is exactly the type of place I want to go for brunch or dinner. I've been for both meals and each time I was impressed. Lots of healthy options and cheat day dishes too. My favorites are the mac and cheese, grilled salmon, and the California Benedict.  This is a regular go to weekend spot for me because of the comfortable atmosphere and stellar food. I especially love the art work decor and the layout of the space. 5+ stars easy!!!!", "author": "Lindsay N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-07", "description": "When I walked into the restaurant for the first time I was welcomed by a warm energy. The decor is personal and different from other restaurants in the area. The staff welcomed me with a friendly smile. THEN WE HAD THE FOOD....in one word the food is DELECTABLE! Each plate  is fresh and there is a wide selection of delicious options. I ordered the Mac and cheese and the Chicken cutlet which were delectable! The chicken cutlet was better than my Nana's and is a high bar! ALSO ! Don't miss dessert! I had there take on an Oreo and I nearly died! \n\nLong story short this place is the bomb! I hope it stays as a staple in this neighborhood for years to come! :)", "author": "Alyssa N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-31", "description": "Simply fantastic! We found ourselves in Brooklyn Bridge park (4 adults / 3 kids) on a holiday weekend with no brunch reservations. Westville exceeded our expectations on all counts: \n1. fabulous outdoor patio for take out food (same menu as the restaurant, incredibly fast service)\n2. delicious food with lots (and lots!) of veggie options, great breakfast burrito, fantastic and refreshing drinks and very welcome Mediterranean influence on traditional American food\n3. lots of kid friendly options (in addition the outdoor space)\n4. great owner who was super hands on, accommodating and welcoming. \nWe will definitely be back!", "author": "Anna T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-07", "description": "Love all the Westville locations. Nice to have one in Dumbo! Enjoyed my first visit and will be back!!!", "author": "Zach M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-27", "description": "Just starting my adventure of eating more vegetarian dishes and had the quinoa artichoke burger and was delicious. Food came out almost too quick and pricing is expecting for the type of food and sit down atmosphere ($13 bucks) Highly recommend to check out as lunch spot to sit down at with veggie options.", "author": "Daniel K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-07", "description": "Obsessed! Known for its 20+ market veggies and tasty burgers, I'm stoked to invite Westville over the bridge!\nMy company has ordered from Westvilles around Manhattan for years. They always handle our large orders well and deliver quickly so I was super excited to see they were opening one in my 'hood.\nI was not disappointed when my delivery came piping hot in under 30 minutes. The delivery guy was polite and pleasant to boot!\nMy husband and I stopped for a drink at the bar Friday night after 8 and despite a previous post, there were only adults in sight. The friendly bartender chatted us up and told us of plans to open the large outdoor raised patio. OUTDOOR DINING!?! Yes please!\nThe beauty of this place is its versatility. I can speak to its family friendliness during the week, adult vibes later in the evening and prompt delivery services. What more could you ask for? \nWestville you make my food dreams come true!", "author": "Vikki R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-12", "description": "Never leaving the neighborhood!  Westville was the perfect addition to DUMBO.  I have been a long time of their city locations.  This space is compact but functional.  The food is perfectly served and the team is very friendly.", "author": "Jason C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-01-08", "description": "I agree with other reviewers who mentioned Westville Dumbo is at least 20% more expensive than it's worth, and they charge you for extra sauces (although i liked the horseradish mayo enough to order it again in the future).  The service was great, and the food did come out quickly though some of my market sides were not even warm.  My husband enjoyed his fried chicken dinner plate, but wished it came with more protein (it would have been enough food for me!).  For now, Westville Dumbo is definitely somewhere between 'Meh, I've experienced better' and 'A-OK'.", "author": "Michelle R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-05", "description": "Place is nice and cozy. Ordered the scrambled eggs with salmon, which were delicious. Portions are small for the price. Dessert menu needs improvement. Service was extremely good.", "author": "Luciano D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-06", "description": "Great food with attentive service. Everything tasted very fresh. The atmosphere is cute and charming. Will be back.", "author": "Adam Z."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-01", "description": "Great comfort food (reasonably priced) and excellent service. It feels like the people running this place really care. Definitely recommend the breakfast burrito!", "author": "Dmitry K."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-12-22", "description": "FYI -- delivery zone map on website is inaccurate.  The map indicates that they deliver to Boerum Place but the restaurant says not beyond Court Street.", "author": "Deepa A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-05-29", "description": "sat right away, waitress was very pleasant.  Food was average.  bascially an upscale diner with prices to match.", "author": "Nathan N."}], "servesCuisine": "American (New)", "priceRange": "$11-30", "name": "Westville Dumbo", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "81 Washington St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/6iR4MOEJIdEMXhHxm5nj7w/ls.jpg", "@type": "Restaurant", "telephone": "+17186185699"}