{"aggregateRating": {"reviewCount": 223, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-01", "description": "I came here with my family from a busy day in Manhattan, and was surprised by the vegetable dominating menu. The food was EXCELLENT I got the lentils, eggplant, beets, and broccoli with a side of chicken. You should definitely try this place and you won't regret it!", "author": "Alexander K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-29", "description": "I recently moved my business to Dumbo so of course I had to find new places to order lunch. I've ordered here at least a half dozen times . I've been satisfied every time. I mostly eat the turkey cheeseburger with fries sometimes I add veggies on the side or the macaroni\u0026 cheese. The food is always delicious and fresh. Delivery is also in a timely manner.I have yet to be disappointed. My clients have been pleased as well.", "author": "Nilijah S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-26", "description": "Westville Dumbo is a neighborhood brunch spot welcoming all kinds of people. There are two inside dining rooms perfect for groups or for couples on a brunch date. If you have a young family or enjoy being outside, there's a large outdoor patio in the back.\n\nThe service is great and the food even better. All the ingredients are fresh and change weekly. When we went, we ordered the poached eggs on a kale salad and the roasted brussel sprouts with cucumber lemonade to wash it down. All was really good. The only thing to note is that the brussel sprouts come with a more intense sauce than you'd think. It is layered on there thick and a tad too sweet.\n\nFor families, it's the perfect spot. The servers are friendly to kids and they even have a large changing area in one of the unisex bathrooms so Mom or Dad can change the diaper.", "author": "Austin G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-15", "description": "Love this place! So many vegetable options to choose from and still a few fish/poultry dishes for those not vegan or vegetarian. I had the BBQ cauliflower wings and vegan quinoa burger with yucca fries. I wish the yucca had been sliced thinner (they're like steak fries as opposed to shoestring) but otherwise great meal! Looking forward to trying the other locations.", "author": "Michael T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-27", "description": "Delicious! I came here today for brunch with two of my friends. We arrived at 1pm on Saturday and surprisingly there was no wait for a table and we were seated right away. The staff was pleasant to us. All three of us got the same order: fried chicken and waffles. This was on a special brunch specials menu that was separate from the normal menu so I'm not sure if it's always available.\n\nThe food was amazing. The fried chicken and waffles came not only with those two and its gravy, but it came with a fried egg and gravy on top, with a few green apple slices attached to the side with a toothpick so you can pretend this is a health meal. Needless to say, we all enjoyed our meal. I would definitely come here and try other food off of their menu, and maybe even a mimosa next time.", "author": "Samantha M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-21", "description": "Outstanding food and service.  Menu has something for every palate.  Fine selection of burgers and sandwiches.  Great fresh ingredients and friendly servers.", "author": "Jim G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-10", "description": "If you're looking for healthy and want to forget that what you're ordering is healthy then you have to try Westville. It's the guilt free restaurant with fresh market vegetables grilled and presented beautifully. I'm a sucker for their Cobb salad with their house vinaigrette. Their market salads are amazing and you can try up to four for a yummy plate with variety like zucchini and tomatoes with mozzarella. I always come here because the food is consistently good and tastes fresh. I've brought my male friends who prefer to eat large quantities of not so healthy food and they love the weekly specials which sometimes include salmon tacos and healthy c. It's a crowd pleaser and doesn't break the bank.", "author": "Joanna M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-10", "description": "This restaurant had a great happy hour. They let us add flavors to our margarita so we had mango and strawberry and they weren't too sweet or too strong. They were delicious. They have tons of vegetarian options we had cauliflower chicken wings and veggie chicken nuggets. We also had the sliders and tacos. Every dish was done well and was full of flavor. The owner brought us a free dessert in the end which was a cookie cheesecake. It was a yummy dessert and an overall good experience!", "author": "Serena S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-12", "description": "Super casual brunch/lunch/dinner spot with ample seating. Food was delicious but expensive... $28 for a bowl of stir fry over rice and salmon. But it's supposed to be higher quality ingredients so I guess that makes it's ok- for nyc prices. I would come back if it weren't so expensive.\n\nWe came on a Sunday night around 6pm, plenty of seats, lots of families and kids running around. They have a lot of options on their menu but we all got the honey chipotle salmon stir, which was a bunch of stir fried veggies over rice with a generous quarter of an avocado and a giant chunk of salmon. Salmon was yummy and crunchy on the outside, soft and moist on the inside. Avocado was perfectly ripe and delicious. Stir fry was great, but the sauce kind of felt like the cheap sweet and sour sauce that you get from chinese take out. I wish they used a different sauce but it was still fine. \n\nOur individual bill came up to $28 for one bowl of salmon and veggies which imo is expensive but to each their own. Their drinks looked good but we didn't get any.", "author": "Jenn Z."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-04", "description": "Fresh produce at its best. Simple cooking that lets the ingredients shine. It's nothing fancy but the freshness makes it great. Friend and I both had fish entrees with vegs. All the seasonal veggies were so delicious! Happy hour until 8pm weekdays is a bonus. Would definitely be back.", "author": "Amy H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-12", "description": "Only came here for a quick drink and an app and had too many healthy veggies to choose from! Finally chose the artichoke parm and was not disappointed. Definitely have to come back. Great seating indoors and out!", "author": "Jacklyn S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-01-25", "description": "Ordered overpriced take out of grilled chicken and sides from this place. So disgusting my fam threw it out after 3 bites. The entire thing arrived as a sloppy mess. The chicken has these BS grill marks like those you'd find in lousy corner deli. I can guarantee they pre cooked the chicken then nuked it. Sides were basic and weak. Worse than airline grub. 50 bucks down the tube on food I coulda made ten times better at home.", "author": "d l."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-29", "description": "Amazing! I had my engagement party here and it was fantastic. The staff was incredible and my guests enjoyed themselves and loved the food. I had a bunch of people from outside the city and I think Westville got themselves a few new fans that night. Great food \u0026 amazing vibes.", "author": "Shimon A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-29", "description": "Love their kale and quinoa salad with sliced almond, cube mango and some sliced green apple. Everything was just so fresh. You should probably add some protein into it, grilled chicken was great.", "author": "Sook Kuan H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-25", "description": "So these guys have a baller staff.\n\nI forgot my credit card, they kept it safe, and then treated me to a beer on the house because they're AWESOME.\n\nAlways fresh, great draft selection, and they take care of their customers.\n\nVegetarian options are on POINT as is their delivery.", "author": "Sparkman C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-22", "description": "My friends and I came by for lunch after walking by and noticing the big patio. They have a decent selection of cocktails and beers with a fair extensive, veggie focused menu. The restaurant has a great aesthetic and most of the party really enjoyed the food. I had the fried chicken sandwich, and it was perfectly fried with simple, but great toppings. The salad was nothing special, but works well as a side. Others at the table also really enjoyed their food, except for the chicken quesadilla. It was nearly impossible to eat, and contained almost no cheese. It was more of a veggie and chicken salad clumsily wrapped in a tortilla. Overall I would go back to try more menu items. The food is simple, but perfect for a light lunch.", "author": "Logan C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-29", "description": "We ordered braised beef sliders and chicken tenders. Sliders were amazing even though they forgot the blue cheese. \nSliders are shown in the picture below, they were not good at all,no flavor,no taste..", "author": "Besa A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-23", "description": "My boyfriend and I were desperately seeking dinner in the BK area and stumbled upon this place by looking for places here on Yelp. This place was such a great find!\n\nIt's a very small and intimate place with a limited menu. Tables are a bit too close together but once you settle in you don't seem to mind at all. It's a very romantic atmosphere and perfect just for couples not large groups as it's a tiny place. \n\nI ordered the cuban sliders and my boyfriend ordered the battered fish and chips. I loved my sliders they were perfection! I tasted my bf's meal and the fish was so fresh and clean in taste! We also ordered two glasses of Chardonnay which was fantastic!\n\nService was excellent, friendly and speedy. I have no complaints about this place.", "author": "Kendra H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-16", "description": "Westville Dumbo\nNY BK Dumbo\n2pm Wednesday 15th February 2017\nFour Stars\n\nThe place had a 5 minute wait in the afternoon so they must be doing well for themselves. We got water as soon as we sat. I had a cup of coffee and a medium burger with gouda and avocado with a side of roasted Artichoke. The Peruvian bun was delicious and less carry, the burger was tender and juicy, the cheese was shredded instead of a whole slice, the quarter avocado was just plopped on the patty instead of fanned or smashed. The Artichokes were out of a can which was less than I would have expected. The service was exceptionally friendly.", "author": "Leonard L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-15", "description": "Today was about my one hundredth time eating at Westville and probably my last. \n\nI went to Westville with my two young sons (ages 6 years old and 9 months old) and two friends to have lunch there today. Towards the end of lunch I took my infant son to the restroom for a change. There was a short line, about 5-6 people ahead of us. While waiting online I was approached by a worker of Westville and he suggested that instead of waiting online I should go use the public bathroom down the street. He made the assumption that I was a non-paying customer and I should use someone else's facilities. He decided to approach the one person online that had a regular to-do t-shirt and shorts while holding his infant son -- very classy.\n\nThe worker's manager told him that I had been eating in the restaurant already but the worker never apologized and continued to give me instructions to the public bathroom down the street. Mind you, I live in the neighborhood and would frequent this spot -- but not anymore.\n\nThe food on the other hand was ok. Not sure how you can mess up burgers and fries!!\n\nC ya!!", "author": "Albert D."}], "servesCuisine": "American (New)", "priceRange": "$11-30", "name": "Westville Dumbo", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "81 Washington St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/6iR4MOEJIdEMXhHxm5nj7w/ls.jpg", "@type": "Restaurant", "telephone": "+17186185699"}