{"aggregateRating": {"reviewCount": 223, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-17", "description": "If you're looking to fill up on a plethora of hearty veggies, Westville Dumbo is the place to go! I've visited Westville East and West but they weren't as impressionable as visiting the Dumbo location. \n\nTo start, the Dumbo location has much more space and you don't feel crammed or rushed by the staff. Next, compliments to the cook because he/she did a phenomenal job cooking my veggies (brussels, sweet potatoes, cauliflower, mushrooms) and accommodated some of the options to be vegan friendly. I also had a larger portion of market veggies here compared to the other spots making it almost impossible to finish, but boy was my belly happy. We sat at the bar and the waiter/ bar tender were very friendly and accommodating throughout the entire night. I wasn't sure which drink to order and had some reservations about a cocktail that mixed rum \u0026 blackberries but the bar tender reassured me that if I didn't like it he would make me another.\n\nOnly improvement for Westville Dumbo is to update their printed menu as some items have not existed for quite some time and to remind guests to look at the wall for items not on the menu. If you can add a vegan dessert to the menu would also be the cherry ontop :)", "author": "Justine K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-05-17", "description": "Another good spot to get a healthy meal in Brooklyn. As I was heading back to the subway after picking up my gear at the Brooklyn Half Marathon pre-event expo I was starving. I have been to their other locations and was happy to find one here.  \n\nYes, the veggies here are no joke. They are delish and the real deal! Pretty consistent menu across each location. I try to eat as healthy as possible and Westville did me right with a grilled salmon plate that came with two market sides. I chose the brussles sprouts and roasted sweet potatoes. Just right portion size with a generous amount of those sides. Perfect meal to satisfy my hunger.\n\nA nifty option for vegan, meat eaters, and vegetarians as there are enough options on the menu for all. Beer, wine, and a full bar available too.\n\nThis location has more space and seating than the others. As I was solo I sat at the bar. Quick and friendly service by the bartenders there. My meal came out almost within a few minutes. Healthy and hearty food at a decent price.", "author": "Phil H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-03-26", "description": "I came on here Saturday afternoon after doing a workout class in the area! It was around 3pm and they still had the brunch menu going. I have heard of Westville before, they have a few locations around the city so I was excited to try it. Since we had just worked out, we were interested in a healthy option so this seemed perfect.\n\nI ordered the smoked salmon and arugula salad that came with avocado and two poached eggs from the brunch menu. I did not enjoy this as much as I wanted to unfortunately, mainly due to fault of my own. I was expecting the salmon to be a piece of salmon, but it was smoked salmon, exactly like the menu said, more like lox style you would put on a bagel. I just did not read the menu thoroughly enough. It was a good salad, just not what I was in the mood for. I probably wouldn't order it again as there were other things on the menu that sounded better. But everyone around me, had meals that looked really appetizing. And my friend ordered the Greek Salad with steak and loved it.\n\nIt is a cute place to come for a casual breakfast or lunch (probably dinner too but not positive they serve that) and definitely has a lot of health friendly options. Service was also good!", "author": "Kristen W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-05-27", "description": "Nice restaurant! Was busy- we had about a 20 min wait. They have a nice patio. Service was great and food was good! My friend and I split a burger and the grill cheese. Both were really good! I lightly perfected the grilled cheese though.", "author": "Lydia M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-05-10", "description": "Was not a fan of any of the Vegan Options here and probably won't be returning. Food is just way too mediocre lacks seasoning and I just truly believe that maybe you guys put more effort into the regular food items than you do the Plant based ones. Please keep in mind that this review is truly based on the Plant based items on the menu.", "author": "Nic P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-03-01", "description": "Healthy, heartwarming food, at a bit of a premium. I love that Westville has so many delicious veggie options, I just wish I could afford to eat there more often! \n\nI've tried the chicken breast, spinach, brussel sprouts, mushrooms, and garlic mashed potatoes. My favorite is definitely the brussel sprouts (covered in a honey Dijon sauce)! The chicken is juicy, lightly flavored, and tasty.\n\nThey have a range of happy hour specials, mostly on drinks, but there are a few food options.", "author": "Jennifer D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-23", "description": "We loved!! Great restaurant to feel full and healthy. We ordered two salads and truffle fries, because balance. Great portions and decent prices. The weight staff were accommodating and attentive! Will definitely return in the future!! Happy hour is from 4-8! Yay for 6$ wine", "author": "Paige E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-22", "description": "Oh yeah BABY. Brunch time in Brooklyn, this place is a must. \n\nTrue to form I get coffee and a lox bagel. What can I say? I'm a sucker for habit. I jazz it up and get the plantains with cotija for the table to share. \n\nBagel is amazing. Chewy dense and carblicious. Lox is salty sweet and melts in my mouth. I black out during eating it, so good. \n\nPlantains are perfectly fried, carmelized, with the salty cotija reminding me that they aren't a dessert. \n\nService and employees are very friendly and kind. Service was quick as well! Everyone was very pleased with their choices in meals.", "author": "Mckenna D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-12", "description": "We loved the food and service received at Westville Dumbo. Wanting some comfort food, along with fresh sides, we ordered the Butternut Squash soup (LARGE Bowl!), Fish and Chips which came with coleslaw and tasty fries. The fries had a special seasoning on them and you could tell they were freshly made. We also ordered the Market Plate which included 4 choices of the abundant choices of delicious vegetables. We chose the Sauteed mushrooms, Grilled asparagus, Brussel sprouts, and Asian style baby bok-choy. YUMMY!\nDrinks: Caipirinha (Happy Hour special), and Pinot Grigio both pretty darn good! Caipirinha was on point! The atmosphere here is cozy- they make you feel like you're eating a special, delicious home cooked meal with class and comfort. Best of both worlds. There is a nice brief view of the Manhattan bridge as an added sentimental bonus. Enjoy!!", "author": "Amanda M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-05-13", "description": "I recently went here for the first time with my friend. They had great food and a great atmosphere! I'm gluten intolerant and this place had some excellent options for me. I absolutely loved sitting outside in the warm weather.", "author": "Maddie M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-05-31", "description": "Met the owner on the subway and so was curious to try the restaurant. Am a big vegetable eater, so was thrilled with all the choices on the menu. Got the veggie sampler plate with four choices and it was delish.", "author": "Cas B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-19", "description": "I like this place in Dumbo - the ambiance is great and the food is tasty!\nThe soy hot dogs were amazing, though the side cauliflower was missing the tahini.\nThe veggie burger was delicious, but the first time I was here it came in flat bread and this time in a bun, and I liked the bread better.\n\nThey have good food, drinks, and great vibes", "author": "Moshe H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-18", "description": "This was so good! My friend and I both had the cobb salad and shared a plate of yucca fries. Let me tell you - yucca fries are WAY better than regular fries! The salad was great - lightly dressed in a way that gave flavor but felt like there was so dressing.  We sat on their patio and the weather and ambiance was perfect.", "author": "Sophia E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-04-05", "description": "I've been here three times and will definitely come again. The staff is really great! Always kind and understanding when it comes to dietary needs or mix up in an order. Food variety is awesome and everything on the menu is delightful! Only giving four stars because the food itself isn't very filling and the prices make it that you don't want to spend more money. It's ideal for a lite brunch, especially in the summer.", "author": "Samantha M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-29", "description": "I had the pleasure of lunching at Westville Dumbo with my sister, and after several days of overindulging, it was really the perfect lunch. I went with the Cobb Salad, and she ordered a vegetable plate that included a variety of delicious options. The Cobb included so many fresh ingredients, and the chicken was cooked to perfection. Just the perfect way to start the afternoon. Will be back.", "author": "Hayley B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-31", "description": "You can always count on a good meal at Westville X. I say \"X\" because, if you didn't already know, Westville is a small local chain with locations in Chelsea, FiDi, East Village, Hudson Square, Dumbo, and the West Village (duh).\n\nIf you eat out a lot in New York City, you know it can be tough to get your veggies in. When we feel this way, we know a cure is to be found at Westville. Whether for brunch, lunch, or dinner, our favorite thing to order here is a plate or two, or three, of 4 market sides to split with the whole table. We've had just about every fresh veggie on that list, and the seasonal rotations are great too. I am not a die-hard vegetarian or vegan or anything like that, but these veggies are just _that_ good.\n\nWhen we are looking for something else on top of the veggies, you can't go wrong with their Mac \u0026 Cheese or Burgers, but seriously, get some market sides too.\n\nOnly downside is that the prices, while not super high, are not super low either.", "author": "Matt C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-18", "description": "The quintessential DUMBO food venue: it's bougie, it's healthy, it's pretty, it has outdoor seating. Not that these are all good things, that's just how it is.\n\n*** FOOD ***\nPretty good for the price. I'd say the healthier options are more worth it. After all, you should order what they do best. And at Westville, that's the market veggies. The beets and fresh peas and bacon were my favorites.\n\n*** DRINKS ***\nGreat selection of refreshing beers and cocktails for the summer and I'm sure they'll transition to a similarly good spread for the fall/winter.\n\n*** SERVICE ***\nCan REALLY be hit or miss. Some of the staff are extremely nice and attentive and quick while others can be curt or *very* slow.\n\n*** AMBIANCE ***\nGet a spot outdoors on the patio while you can.", "author": "Chris P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-26", "description": "Been to this location several times. The food is always fresh but the service is what gets me to come back. Every time I'm in this place the manager Alejandro is always welcoming and makes us feel at home. If you're in dumbo it's definitely worth a visit.", "author": "Alex M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-21", "description": "This is the go-to spot for work lunches. Interior and ambiance is on point. There's a great patio and outdoor seating area. Everything is extremely fresh and cooked right. I haven't had anything mind blowing but I've also never had anything terrible. \n\nConsidering the fact that choices in Dumbo are limited unless you want to fork over $40+ for lunch ...Westville is a solid choice at around $15.", "author": "Victoria Q."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-22", "description": "We were looking for a good salad and this fits the bill. I had the kale salad with chicken and you just have to make sure you get s bite with a little of everything.  So good. My daughter had the salmon and was very pleased, especially with brussel sprouts as the side. My husband had the rice bowl with chicken and he thought it was a very hearty serving.  Very good!", "author": "Mary B."}], "servesCuisine": "American (New)", "priceRange": "$11-30", "name": "Westville Dumbo", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "81 Washington St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/6iR4MOEJIdEMXhHxm5nj7w/ls.jpg", "@type": "Restaurant", "telephone": "+17186185699"}