{"aggregateRating": {"reviewCount": 223, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-16", "description": "We went to DUMBO in search of a happy hour and found one in Westville. The interior is so so cute, like my ideal place. I love that they have a large inside room with booths, an enclosed patio and outdoor seating. I ordered the avocado tacos, 3/$8 and they were amazing. It's hard to find veggie options in NYC and this place has so many. I also got the happy hour margarita and it was large and delicious. Definitely go here if you live in the area!", "author": "Britta G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-16", "description": "Serving healthy food choices. Nice decor with indoor or outside area. Noisy since tables are close.\nHostess greeted us with \"Hey\" - American casual...\nOrdered market plate with 4 veggies- very tasty but portion is ridiculously huge. Two of us could have shared it.\nThe vegetable curry was good.\nNext time I won't order so much food.", "author": "Emme S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-05", "description": "We stopped by this one accidentally this morning. It's a very hot day so we thought ok let's try out this restaurant. Honestly, we have no expectation at all. However, my husband and I love this place so much! We just had a quick Sunday morning brunch here but the food surprised us in two aspects. Firstly, the amount they served was way more than we expected. It turned out to be over full for both of us after finished all the food in our plates. Secondly, the food here is so fresh and heathy. And my husband love the homemade mango lemonade here, so cheer up drink in hot summer. The atmosphere is neat, it's up to you to choose to sit indoor and outdoor.  Overall, so good experience! Mark as a good brunch place!", "author": "Olive D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-15", "description": "Delicious!!! I've been to the EV and Tribeca locations, and then Steven and I stumbled upon the Dumbo location... SO glad we did!! We were starving, it was raining, and we were able to sit 'outside' in the enclosed dining area. I got the egg scramble with chicken sausage on the side, Steven got two eggs sunny side up with potatoes and the fixins, and we shared a side of sweet potatoes :) \n\nDELISH!!!! Service was great, too...", "author": "Paige H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-11-30", "description": "I craved for Westville's carrot cake and placed an order even after having lunch somewhere else.  They delivered a stale carrot cake.  For $8 a slice, I expected it to be fresh!!", "author": "Luk L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-01-24", "description": "$17 for two thin rubbery breaded chicken cutlets. Yep, that sounds about right for DUMBO.\n\nI was super excited for Westville to move into the neighborhood since it's basically a lunch desert in this area and I'd enjoyed the Chelsea location years ago.\n\nI placed an order online for pickup (highly recommended since it gets busy). It was ready on time, so no issues there. I also got to take a look inside and the place is great. Lots of natural light and comfortable seating.\n\nThe entree came with two sides. I got the roasted beets with goat cheese and the chickpea/eggplant stew. The beets were good but were hardly roasted. Tasted like the kind you get out of a can. The eggplant stew was much better, but not very aesthetically pleasing. Quite the opposite.\n\nI'm willing to give Westville another shot, but... maybe on the company's dime.", "author": "Kenny C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-13", "description": "This place have amazing organic food, anyone can eat here.  The waitress we had was amazing. She was very attentive and very friendly. She offered us dessert but we were in a mood for something outside of what they had. She ended up giving us a suggestion to have dessert outside of their restaurant and gave us detailed directions. Not only is the food great, the people who work there are amazing too. \n\nI would definitely recommend this place to someone who was looking for a trendy restaurant and also a great location too. It was very close to the Brooklyn bridge and", "author": "Maria C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-06-10", "description": "Ate at the bar on a Sunday at noon.    Great staff and service \n\nFried eggs on short rib hash was tasty - hash was short rib, mashed potato shepherds pie -ish\n\nBloody Mary was just ok\n\nThe big complaint would be the ill behaved children and their stupid parents. May come back in the evening, but never again for the kids brunch", "author": "J A A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-22", "description": "I enjoyed the atmosphere as much as I enjoyed the food. My server was amazing. She had good honest opinions on the food and checked on is throughout. The food came out really fast and was fresh. I would definitely visit again.", "author": "Occasio G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-25", "description": "Lunch was fantastic. The Spicy Mango Margarita is a MUST try as well as the Frozen Mint Lemonade. I also had the Guacamole Chicken Burger, and my Wife had the Grilled Chicken Burger. Nice quiet spot In Dumbo", "author": "Astyle A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-03-15", "description": "Great vegetarian options and hour selection! We were sat quickly and the staff was attentive.", "author": "Amber R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-15", "description": "This place is right by the Brooklyn Bridge - and it has a great outdoor seating and patio seating. Their coffee is good; I had their latte. Their potato hash is mashed potatoes, which comes as a side. I got their scrambled eggs, which were ok. This is a nice spot to eat at before walking the bridge!", "author": "Taylor A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-30", "description": "Fresh food, great options, and a solid beer selection. Westville is one of those places that is great for every occasion when everyone can find something they'd like. It's also on the short list of favorite delivery options! Weekends can get a little busy but wait times are usually manageable.", "author": "Kathleen W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-16", "description": "Westville is a food haven for vegetarians and vegetable friends. With a menu focused on seasonal produce, I always leave here feeling refreshed, full, and inspired to cook. There are plenty of options for carnivores, and I think this is one of the few places that can please most palates. Cuisine tilts American, with nods to many other cultural spices and flavors. I've been a fan of their Alphabet City location for a long time, so knowing there is a new Westville in Brooklyn makes me an automatic fan. \n\nHubby and I came for an early Sunday 5:30 pm dinner and were seated immediately. The place was actually about half full already and completely full when we left around 6:30 pm, with a small wait out the door. There are three seating areas: the main indoor dining room, the covered patio, and the outdoor patio with picnic tables. The indoor and covered patio areas are best for strollers/wheelchairs, although they may make your table neighbors feel a bit squished. There are two or three neutral bathrooms, one especially large for families and changing tables. I think Westville is nice enough for a casual date or to bring your out of town parents. It's not pretentious, but its bright and charming and very much a neighborhood staple.\n\nService is good, with helpful waitstaff that know the menu in and out and a good attention to allergies. They check in often and are pretty friendly. We always had water and plates were cleared quickly. In addition, the kitchen turn over is great, I remember getting our dishes very quickly. \n\nThe food is the best! I love love love their market plate, where you pick four different veggies for $17 (as of Aug 2017). The vegetables are super varied, from tofu, to roasted beets with goat cheese and walnuts, watermelon with mint and feta, zucchini with mozz and cherry tomatoes, kimchi cucumbers, dark leafy greens, tofu, potatoes, lentils and beans. The market veggies change seasonally, so it will always mix up if you come frequently. I also like their crab cakes and they make a decent burger and mac and cheese. They also offer cocktails and wine.", "author": "Suanne L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-22", "description": "Best delivery I have ever had! Both the chicken with two veggie sides and pear salad were delicious!\n\nReally great quality ingredients. I love how they have healthy options that fit a lot of dietary needs. \n\nWill be ordering a lot, as the price isn't too bad either. Awesome addition to DUMBO", "author": "Kelly G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-17", "description": "Exploring DUMBO and ignored our hunger until it was unbearable. We were seated promptly, though my violent hunger was not pleased at the promises of \"cauliflower\" and \"kale\" written on the windows since it felt as though I would only be satisfied with a five pound burger and cheese fries piled to the size of a small animal. Luckily enough, I was in for a surprise.\n\nThe service was excellent - we asked to wait for another friend to show up and ordered drinks in the meantime. They were out of the watermelon juice for one of their signature cocktails, but the pineapple margarita special was a good replacement. Naturally starved by then, we placed an order for the Westville Market which is where you choose four of their freshly made veggie sides that come piled separately on one huge plate. Our choices: brussel sprouts (amazing and whatever sauce they are in, I could swim in it), artichokes with Parmesan (amazing because cheese), roasted butternut squash (cooked perfectly but little seasoning - could've done without these), and zucchini with mozzarella and tomatoes (like a warm veggie salad with cheese - so good, favorite side).\n\nThere was a little confusion about who was our waiter/waitress because multiple people checked on us, but that simply meant the service was very attentive, and they were patient when our friend took an extra 20 minutes to show up. We finally ordered our mains, and after stuffing myself with delicious vegetables, I didn't leave much room for a huge main so I opted for the Greek salad which comes with balsamic lemon dill vinaigrette (where can I buy this stuff, it's light but flavorful and heavenly), and a grilled baguette with goat cheese which turned out to be the perfect accompaniment - the other salads come with meat instead but I was on a veggie kick. \n\nAnd this was no small salad - it was a big bowl, the size of a small animal (so no need for cheese fries). So if you're feeling like you need to force yourself to eat something green but can't bear the thought of choking down some mysterious green juice, come here, and you'll be satisfied with fun takes on veggies and some fabulous, large-and-in-charge salads. \n\nAnd so my only recommendation to Westville is to get rid of the boring-sounding vegetables written on the windows and write \"yes, this is healthy ,but yes, you will be happy.\"", "author": "Alex K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-25", "description": "Service was attentive and welcoming. The food quality was pretty good! My only complain is the burger patty was a bit small, I left hungry. Other than that the restaurant is in a nice location and has a warm atmosphere.", "author": "Oxana M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-11-23", "description": "Ordered a hot chocolate and then found out that it has alcohol. I don't drink alcohol why the heck a hot chocolate has alcohol. And why nobody said anything. Also nobody even asked me for an ID which illegal. Wth", "author": "Noor E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-22", "description": "We  had  a Saturday brunch , the place is big with indoor and outdoor seating  , fun trendy  atmosphere, fresh healthy eating . \nI had the mimosa apple Bellini ... wow !! A must.\nMaisie was so sweet and helpful.", "author": "Nicole S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-01", "description": "Came on weekend for brunch- couldnt decide between breakfast or lunch. So picked the best of both worlds and got the eggs with tortilla chips and guac sauce (it was a treat yourself kind of day ok). But I said multiple times 'i wish i could order one of everything' the veggie platter options seemed amazing! I will definitely be back until i have tried the whole menu!", "author": "Monica L."}], "servesCuisine": "American (New)", "priceRange": "$11-30", "name": "Westville Dumbo", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "81 Washington St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/6iR4MOEJIdEMXhHxm5nj7w/ls.jpg", "@type": "Restaurant", "telephone": "+17186185699"}