{"aggregateRating": {"reviewCount": 223, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-30", "description": "Wow everything is always on point . The healthy tea is must have , and don't bother looking at regular menu ask about the special menu .your tummy will thank me later", "author": "Eric D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-20", "description": "Stopped by here walking through Dumbo. Overall pretty good, a relaxed atmosphere with happy hour and some outdoor seating, bar seating, and regular seating. Service was prompt and efficient. For food I ordered the market plate with grilled chicken and 2 market plates. The vegetables are great, I got the kale with garlic and parmesan artichokes. The grilled chicken was not good though, very dry and not much flavor. I also tried some of the burger, it was a good sized burger cooked perfectly, however not much taste. The fries were surprisingly really good. Overall would come back for healthy food, but not the grilled chicken.", "author": "Kendra C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-18", "description": "Found this place while walking up to boulder. Decor was very relaxing and the person who seated us was definitely unique with his Shakespearean outfit. We were suited quickly. I ordered the hamburger with fries. It came out in about 15 minutes, which was pretty speedy. Burger came out medium rare as asked. It was pretty hefty as it's 8 ounces. Very juicy. The English muffin was a nice touch. The fries were thick and crispy but not too crispy. The meal was pretty filling even for someone who has a huge appetite. All for $13 which is a food price as some places charge upwards of 18 dollars for burgers that's less than half the size of this. Definitely a great place to grab a quick bite if you're in the area. They also have outdoor seating so if it's warm out, great option to have.", "author": "Andrew C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-18", "description": "What a lick we found this place! The daily menu was perfect. We had four different vegetables as a starter and all were superb. Very good prepared and interesting new herbs and spices. The veggie Quinoa burger was the best veggie Burger I ever ate! Also was our host very kind and helpful.", "author": "Holger L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-08-31", "description": "I we had a really nice waitress Anne. In the defense of this place it's difficult to please everyone in the vegan world.  Every vegan/vegetarian burger has its own flavor.  We were not fond of these.  Also the fact that the crispy quinoa burger and fries in the same oil they fry the chicken.  Duh it's vegan why would you fry it in the same oil you fry your meat.  However I appreciate Ann's honesty in informing us.  Thank you Anne.. the ambiance is cute but then again it's NYC!!!", "author": "Nicole P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-03", "description": "I like a vegetarian lunch every now and then. This is the best place for that. I ordered the lunch market plate and had a huge assortment of veggie options.  I ordered the parmesan sautéed artichokes and asparagus, both were terrific. I also ordered the fried yuca, a nice change  from french fries.  A great choice of you want a flavorful vegetarian lunch or dinner.", "author": "John S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-07", "description": "The service there was very friendly. The food options weren't that great and not too much to choose from. Their drinks were good but not too much to choose from for happy hour. All of the sides though were delicious! You definitely go there for the atmosphere and appetizers/sides.", "author": "Bailey A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-15", "description": "I really like the spaciousness of Westville. Service was fantastic and food was very good.", "author": "Ken S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-09", "description": "Great service! Great food! Ordered food and the waitress asked if their was allergy concerns. Very considerate.", "author": "Alexandra R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-28", "description": "Lots of healthy options, great kids menu. Loved the patio, lots of shade. Fave: yucca fries!", "author": "Anna D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-21", "description": "Was in the area and hungry, looking for a place to eat on here I read a couple of good reviews about this place so I walked in to have lunch...\nNo regrets:  great atmosphere, welcoming, and great food:\nHad the 'eclipse mojito' ( very good), quinoa and artichoke burger and watermelon  salad, all very delicious,  highly recommend this place", "author": "jackie r."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-01", "description": "Wow, we found both our watering hole and breakfast/brunch weekend stop. Great staff, great food, good prices, and amazing happy hour!!", "author": "James O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-30", "description": "Very nice place. We came here accidentally and were surprised by the quality of food! I personally recommend salmon and chicken breasts. If you take it, you won't regret. \n\nPrice and quality ratio is perfect!", "author": "Aleksandr B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-09-09", "description": "I came here for dinner once a few months ago and remember it being very good. I had some salad special so it's a shame I can't get whatever it was again. Tonight I ordered delivery. They get points for a short wait time. But I'm mostly disappointed in the appetizer special described as: Roasted Balsamic Glazed Brussels Sprouts - w/ onions, butternut squash, sweet potato \u0026 carrot topped w/ dried cranberries. It's all undercooked. The Brussels sprouts, sweet potatoes and carrots are all crunchy. And the amount of Brussels sprouts compared to the toppings was measly. $10? I also got a \"side' of hangar steak, which also cost $10. Some bites were incredibly chewy. At least the portion size made more sense for $10. Overall, way too expensive for food that isn't well prepared. Maybe it's better to stick to their salads?", "author": "Melissa Z."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-13", "description": "Love eating brunch outdoors in the backyard patio. The food here is simple and well done. It is really easy to choose healthy options here and you really get your money's worth with the service they provide. Not to mention the huge portions. Great value for amazing food and company. The servers are all very polite and service is quick.", "author": "Heidi V."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-09-08", "description": "Not really sure why this spot gets such high ratings... Food was quite a disappointment. On par with diner food. Had Mexican Cobb Salad special. Not special! Seriously, have had similar and much better with fresher ingredients at other spots for less money. My friend's salmon was standard. Veg was good, but corn app was starchy. Interior Super loud.\nPros, happy hour extends to tables\nNice outdoor and semi outdoor seating\nNice servers", "author": "Ruth R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-20", "description": "Aug' 17.\nWas in the area for a week, needed a place to recover from jet lag. Colleagues from Dumbo office recommended Westville. Great, extremely tasty food (anything with eggs!!). Good service,  not cloying over-the-top. Returned three more times.", "author": "Paul S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-19", "description": "Hands down one of the BEST restaurants in Dumbo/Brooklyn Heights. Great in house and delivery!", "author": "Alyssa C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-13", "description": "I came here for brunch with my best friend today. As we walked in, it wasn't too crowded we actually got to pick our own table. The waitress was really attentive and polite. She served us right away. My friend and I both got the egg scramble plate. I got it with baguette, salad, bacon, chorizo, and organic spinach. My friend got the basically the same thing, baguette, salad, bacon, pork sausage, tomatoes and organic spinach. It was definitely comfort food. Everything was cooked perfectly, nothing was over-seasoned. The food overall was tasty and seemed pretty healthy. My friend really enjoyed her order as well. The bill came out to be only $19 (including tax but not tip). That's really cheap for a place in NYC. This is definitely a place I'd recommend to people who was a nice, comfort food brunch. I can't wait to come back!", "author": "Sharon L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-21", "description": "All the veggies are devine specially the corn on the cob, the cumin takes it to a whole new level.", "author": "Bryan P."}], "servesCuisine": "American (New)", "priceRange": "$11-30", "name": "Westville Dumbo", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "81 Washington St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/6iR4MOEJIdEMXhHxm5nj7w/ls.jpg", "@type": "Restaurant", "telephone": "+17186185699"}