{"aggregateRating": {"reviewCount": 223, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-31", "description": "Came in here with 6 friends, had a few pitchers of beer and dinner. Loved the fish and chips! My friend also really loved the steak sandwich. Quirky crowd, but definitely good food and service!", "author": "Elise K."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-10-07", "description": "Ooh our third visit here was not good, son.  This was.....ummmm.  I had the burrito before and the last time it was life changing, but this time it looked and tasted a bit rough lol.  Was there a management change or something?", "author": "Dean T."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-11-06", "description": "Not happy at all. Ordered delivery, it came late. Now this was not my issue. I ordered thru postmates so that's not really the restaurants fault. HOWEVER, the food was not good! It was not the warmest because of the tardiness, but it was not good at all! I ordered a turkey burger that came as a blob of meat and I guess asking for avocado literally means put an entire, uncut avocado on a sandwich. Fries were dismal. Utterly disappointed and still hungry. I use Yelp a lot and really read the reviews and I wish that I had seen a review like this in regards to delivery. if you must, go in to the restaurant yourself and skip the delivery.", "author": "Lee D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-26", "description": "Their steaks are great, and the waiters are very friendly and know what they're doing, I always feel welcomed there. Make sure to try their lentil soup if it's on the menu the day you visit. I can't say anything bad about that place, it's perhaps one of the coziest spots to have lunch in Dumbo.", "author": "Ryan S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-26", "description": "This is our go-to restaurant in the neighborhood. The food and service is consistently great! Delivery is also consistently great and really fast.", "author": "Jordana M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-22", "description": "I went here on a day off during the week after walking around Brooklyn Bridge Park and needed a bite to eat. Since I have been to Westville in Chelsea and enjoyed it, I thought this would be a safe choice especially since it adheres to my dietary restrictions. This place is a short walk from the Park, so I took my order to go and headed back to eat by the river. I ordered their new Salmon salad and asked for the tomatoes to be removed. I was pleased when taking my order not only did they agree to this substitution but offered to replace with with cucumbers. I was offered water as I waited and told I could sit at the bar and they would bring my order to me. The salmon was really good and the dressings that came with it made the salad an even better compliment. I'll definitely be returning.", "author": "Doris D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-21", "description": "Perfect location and even better food! I had the turkey burger with a side of the garden roasted sweet potato. Both were seasoned perfectly! Staff was super friendly and helpful, giving our group plenty of recommendations. I was part of a group and everyone enjoyed their food as well! Had no problem with separate checks!", "author": "Carl R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-06", "description": "Unexpected that this restaurant was SOOO good....  \nAs a vegan who hang out with meat eaters, this place is just awesome. So many choices on veggies and they are always fresh and cooked perfect!! Portion is great for price. My favorite place.", "author": "May S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-03", "description": "I love Brooklyn bridge park. Almost every weekends we are there and Westville is a great restaurant with a great organic food. Recommend this place! 5 stars!", "author": "Altana K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-02", "description": "I love this place since I first tried it in 2009 in East Village. The food is always amazing. I love the market veggies and fish. It never fails me when I go there and I always leave satisfied without feeling guilty that I ate something unhealthy.", "author": "Liubov A B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-28", "description": "The food and service were amazing. I had the chicken fingers, they were thinner than I'm used to but had a nice crispy breading. My boyfriend had the skirt steak sandwich, also very yummy, the meat was very tender. My boyfriends kids had the grilled cheese and sliders. The cheddar \u0026 gouda grilled cheese was one of the best I've ever had... and I looooove my grilled cheese. The slider burgers were flame broiled and very fresh. Fries are very good too. My only gripe was they don't have ranch dressing which I love dipping my fries/chicken in, but they made up for it with a garlic aioli (great with the fries) and a chipotle mayo (great with the chicken fingers).", "author": "Suzanne F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-22", "description": "Clean environment \nStaff was attentive\nMeals were tasty \nAwesome outside sitting area", "author": "Jewel D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-11", "description": "Nice lunch find away from most of the tourist crowd in Brooklyn Bridge Park.  Surprisingly large vegetable menu and at $15 for 4 picks hardy enough for a full meal, plus burgers/sandwiches/platters. Large indoor and outdoor seating.  Manager (?owner) Shy (?sp) stopped by to ask about our experience and genuinely interested in feedback. A repeater for me.", "author": "Laura P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-27", "description": "Finally a non-diner lunch place with enough options for everyone! Burgers, sandwiches, market sides, quinoa bowls. They're all good, healthy-ish and filling (and yes a tad pricey). The service is good, the food comes out fast and you leave sated. What more can you ask for?", "author": "Lana V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-03", "description": "Decent spot, had a few drinks. Good casual atmosphere. Grab a couple cocktails and some bites. A lot of veggie options. Really cool outdoor patio.", "author": "Konrad D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-19", "description": "A great find, just steps away from the Brooklyn Bridge.  Very attentive staff, great menu choices, and fresh ingredients.  Added plus was that I've been wanting to try Mulled Wine for a year and finally found it.  And it was so good!", "author": "Joanne N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-14", "description": "Delicious -- We had come in from a long walk in the cold and the food was hearty and tasty. The mulled wine and cider (with cinnamon sticks) started us off. I had the platter with 4 market sides -- peas \u0026 bacon, kale, sweet potato mash, and beets. We also had salmon with cauliflower and garlic mash as well as grilled cheese with tomato soup. For dessert, my son ordered the carrot cake. Everything was tasty and filling -- and the service was helpful (offering suggestions upon request)! We will be back.", "author": "Juliette P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-12", "description": "Ambiance is so unique and really awesome wait staff. Sat outdoors and after ordering our food was served in less than 10 minutes. Absolutely delicious food and filling too! Great menu and lots of options even for dietary restrictions!", "author": "Mia S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-10", "description": "I came here for lunch with a friend on our way to the Brooklyn flea. This place has great vegetarian options. I got the market plate of 4 different veggies, beets with goat cheese, mixed mushrooms, Dijon brussel sprouts and cauliflower with tahini sauce. Everything was very tasty and it was a perfectly sized portion for lunch. My friend got a Caesar salad and yucca fries. The yucca fries were awesome. The rose sangria also didn't disappoint. Lunch for two with drinks came to about $60 so not cheap but hey, it's New York. I would come back next time I'm in the neighborhood.", "author": "Sidra M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-01", "description": "Absolutely hands-down! Food is absolutely wonderful and the bartenders are amazing! Especially Christian Mendosa", "author": "Jeff V."}], "servesCuisine": "American (New)", "priceRange": "$11-30", "name": "Westville Dumbo", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "81 Washington St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/6iR4MOEJIdEMXhHxm5nj7w/ls.jpg", "@type": "Restaurant", "telephone": "+17186185699"}