{"aggregateRating": {"reviewCount": 223, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-20", "description": "My 3 teenagers and I had diner last night and we all found something we loved and that met our various diet preferences. The Vegetables (Westville Market) alone are amazing. The waitress was attentive to our table and was always smiling. \nWe came in at 6:30pm on a Sunday and we waited 30minute  for a table of 4 (I had tried to make a reservation 3 hours before but they had already closed their reservation booking). The wait was worth it and gave us the opportunity to stroll around Dumbo.", "author": "Aurelie L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-27", "description": "This chic and cozy space charmed me with its simple yet classy decor. The servers were hot! And the food is tasty and healthy. Good place.", "author": "Paige E."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-01-26", "description": "I've ordered 3 times from here since they opened in my neighborhood a few months back--lunch, dinner and dessert, and I've had a drink there once (wine--not disgusting, but certainly not impressive; I'd held hope in this regard, but no expectations). The bartender was quite friendly, though we encountered no other staff.\nI was REALLY REALLY hoping we'd get a decent restaurant in DUMBO since there are few around. \nBut no. My chicken burger looked like processed meat--something cheap from the frozen section at a grocery store. The fries were unspeakable. I don't know if the oil was rancid, or they were merely overheated. Either way, no. \nThe fish and chips were completely vile. They were clearly frozen battered fish heated in the microwave. Floppy, soggy, disgusting and utterly inedible. \nFinally, on a different occasion, I once ordered some desserts, which appeared to be no different than those one might find mass processed and frozen, although the site says they're \"baked fresh daily\" at one of their Manhattan locations. The ice cream was fine, but the containers were moldy. Yes. \nAnd all of this is relatively expensive.\nWhen I see people inside this place as I walk by, I wonder what they're thinking. \nVERY VERY disappointing that WV is filling this nice, enormous space in a neighborhood with few options. The \"few options\" is what allows a place like this to continue.", "author": "Elizabeth K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-25", "description": "The food is yummy and the ambiance is great. Good for family dining. Friendly servers were able to accommodate us with a bulky stroller outdoors. The space is smoke free  and not too loud. Salmon with cauliflower and beets was very fresh and delicious. My husband who's a picky eater enjoyed his burger very much. I would certainly recommend this place.", "author": "Miss P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-19", "description": "Let's start with the food: from the salads, to the sandwiches, and of course the famous market plate, you can't go wrong! (Pro tip: always check daily specials too!) There's something for everyone - always fresh, healthy, and absolutely delicious (did I mention the perfect price too?!). They also have fresh desserts daily if you care to indulge :)\n\nNow the drinks: blended mint lemonade is out of this world.. and little known secret: Westville has happy hour! \n\nThe space: absolutely beautiful with an outdoor patio (heated for winter months). If you're solo, you can eat brunch / lunch / dinner at the bar and enjoy the company of the fantastic and friendly bartenders. \n\nWhether I want a quick lunch, a nice dinner to bring a client, weekend brunch with friends, or an after work happy hour with coworkers, Westville is my go to. Couldn't be happier to have Westville in Dumbo!!", "author": "Ariana A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-16", "description": "You can tell that this place is good by the number of people that have been to their Manhattan locations and are just happy they're in Brooklyn.  It's one of the only places you can go and eat a lot of vegetables that taste good, without feeling like you're giving up anything. And the meat is good, too.\nGiven the location, which is starved for restaurants, it is not surprising that they are kid-friendly. But they have a real bar, and the outdoor space should be excellent in nice weather.\nOne could gripe with the prices, but this is DUMBO.", "author": "Alex N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-31", "description": "Westville has never disappointed. Great wait staff that was very accommodating and attentive in terms of seating us and making sure that we were okay while waiting. The restaurant has an indoor seating area and an outdoor covered patio. It also looks like they are extending their outdoor seating area. We opted for the indoors since we didn't want any of the sawdust to fly into our food. Seats were a little dirty when we got to our table. We informed our server, but I guess they were busy and forgot to come help us wipe it down. We ended up doing it on our own. No biggie though. \n\nI came with 3 others and each of us had a wonderful experience. The food portion was moderate. We ordered the westville cobb salad which was great. I had to ask for extra dressing on the side though. My salad was missing an egg .. didn't realize it until halfway through dinner. Generally, cobb salads are served with half or whole hard boiled egg. At least it was served with it at the Chelsea location. My friends ordered the mac and cheese (very yummy and cheesy), veggie burger, chef's salad (much smaller than the cobb salad), fish and chips and a market plate. Overall it was a pretty healthy dinner, even the fish and chips. The fish wasn't drenched with oil like other places. It was nice and fluffy. The fries were amazing. I didn't get a chance to try the chef's salad or veggie burger, so there's not much for me to talk about. We ordered the zucchini, brussel sprouts, mushrooms and garlic mashed potatoes for our market place. I liked all of them but the brussel sprouts. It was very flavorful, but I didn't like the fact that it was diced. The pieces were small so it was hard to grasp the flavor of it. I accompanied my meal with the cucumber lemonade, which was such a great pairing for a warm summer day. It was cool and refreshing. I honestly could've had 5 glasses of it.\n\nAfter dinner, we took a stroll around the DUMBO area to view the skyline. It's a nice brisk walk for the summer. This spot is a wonderful location. Close to many ice cream shops too!", "author": "Christine L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-07", "description": "Nomnomnom LOVE! This place is fantastic. So glad they opened in Dumbo. Love the Mac n Cheese", "author": "Paige C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-05", "description": "FYI: this is not just for vegetarians. That Sesame Tuna was killer! But if you are a vegetarian, this is also a great place for you. The bok choy was also AMAZING, and don't get shy because of the look of the Pesto Mashed Potatoes. The outdoor seating was wonderful too. Make sure to stop by if you are in Dumbo!", "author": "Linda Q."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-03-22", "description": "The place was crammed so they're not hurting for business. Ordered the veggie burger and it exploded in my hands. $1 uncharge on a bread change resulted in a $17 pile of wet veggies and that sealed the deal: I am never going back.", "author": "Osh P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-01", "description": "I have been here in one of its first weeks of opening and it was great. However, went back recently and it's even better. Definitely one of the top Westville's. Great for a decisions healthy meal. Also great indoor outdoor patio for a nice dinner.", "author": "Mallory A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-31", "description": "This place is a great addition to the neighborhood. The food quality is good and predictable and the service is very efficient.", "author": "Peter P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-09", "description": "Came here to satisfy my monthly burger craving. Left superbly satisfied. The burger hits the spot. It has the flavorfulnpess and satisfaction of a steakhouse burger minus the greasiness and post-meal big-burger aftertaste. I ordered market sides which were also fantastic. The spaciousness and airy ambiance is a welcome change from Westville's buzzier Manhattan locations. I highly recommend this restaurant and this particular location!", "author": "Jasim R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-27", "description": "Just went for the first time for Sunday brunch. The food was amazing and the service so friendly. Enchanted. Can't wait to go back.", "author": "S A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-11", "description": "The vegan hotdog was so amazing, I was skeptical it was actually vegan. Great place and great service!", "author": "Evie S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-08-10", "description": "Beyond disappointed. Decided to takeout my daughter's lunch from here today because didn't have a chance to make her lunch in the morning. Long story short, told cashier she has a dairy allergy and he said he'll make note of it so that the kitchen will exclude cheese from her meal. Come home and see mozzarella in her food. Call them and they offered to deliver the side dish that they messed up on. Was hoping they would remake the entire meal in case of cross contamination, but didn't want to make a huge fuss since mistakes happen. Tried feeding her parts of the meal that looked untouched by the cheese. Well her mouth and chest are covered in hives and she's scratching like crazy right now. Luckily her tongues not swollen (sign that her throat is closing up) so hopefully I won't need to administer the epipen or take her to the hospital. They made some sort of attempt to remedy the mistake but I saw it as the bare minimum they could have done. If you're working in the food industry, you need to take allergies seriously; thankfully the reaction today doesn't seem as serious as it could have been but some allergies are life threatening. And side note- but found out today that their fish (both salmon and trout) are farmed. At $19/$23, respectively, you would think otherwise. Used to be our last minute go-to dish for her when necessary, but won't be anymore.", "author": "Rebekah C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-12-23", "description": "I had the fish and chips tonight one of only six \"plates\" items on the menu.  The fish batter was very soggy from the get go and got soggier as time passed. What more can I say.  The service was good though thus 2 stars.", "author": "Vincent T."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-09-29", "description": "The food was fine. The service was depressing. I was waited on by a tag team of various people, none of whom ever took ownership of my table. Nobody told me what had been 86'd until I tried to order some of it, then asked for a rundown of what else they didn't have on the menu. There was more, but hey, why bother to tell me?  I had to beg the person who came to take my plate away to take a drink order for a second drink. Turns out I was in her station. I'd been listening to her chat up other tables, while her coworkers took turns cobbling together the basics of taking my order then abandoning me. I didn't find out she was supposed to have been my waitress until she dropped the check and I asked whose station I was in. By that point I felt so dismissed at having never even been offered a dessert menu (just an offhand \"anything else?\" which I'd had to follow up by actually asking if they even served dessert) that I just wanted to know whether I'd ever been anyone's table at all. I'd made a reservation. What a joke of a place.", "author": "J W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-31", "description": "This Westville location is awesome! Such a cool space and the same amazing food as all other locations. It really fits perfectly in the neighborhood. I have so many favorites that I keep coming back. Healthy options galore. Excited that there's such a great option in Dumbo!", "author": "Gili B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-27", "description": "I ordered online and they called saying there was a glitch with their system so my order didn't go through. They took my order over the phone and comped my meal! So nice, they didn't have to do that, I was hardly inconvenienced!", "author": "Caitlin T."}], "servesCuisine": "American (New)", "priceRange": "$11-30", "name": "Westville Dumbo", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "81 Washington St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/6iR4MOEJIdEMXhHxm5nj7w/ls.jpg", "@type": "Restaurant", "telephone": "+17186185699"}