{"aggregateRating": {"reviewCount": 223, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-06-25", "description": "Food was good, not amazing though.\n\nIt was crowded, noisy, the service was great. Had a steak dinner and a very yummy fresh herbal sage, ginger tea. Steak was good, tender, but half of it was drowned in olive oil, was hard to taste anything else.", "author": "Anna H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-01", "description": "Granola and avocado toasts were really great, the service is friendly and you don't have to wait for your meal for too long. Definitely one of the best breakfast spots in Dumbo.", "author": "Jedrzej N."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-05-23", "description": "This spot is obviously still working out the kinks. I was a big fan of their EV location and was pumped when they moved to bk. Seems like they need some of the leadership of their other stores to step in and raise the bar here. They're constantly running out of menu items, the wine \u0026 beer list is much different then what they have and their staff is a lil green and not educated on the menu (ingredients, allergies, etc) \n\nBeware they close much earlier then they advertise too. \n\nStep it up Westville!", "author": "John L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-06-20", "description": "We must have picked the worse items on the menu - the grilled chicken was dry the fries cold the fish overly fried...not planning on coming back. The only upside is that the outdoor space is nice.", "author": "Elizabeth P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-29", "description": "Brunch was excellent. Had the cauliflower with Tahini and eggs on avocado toast. All great and good service", "author": "Daniel N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-12", "description": "Thank goodness I don't live too close, otherwise I would bankrupt myself. The food is fresh and there is an abundant of vegetable choices. I really feel taken care of...like someone wants me to eat something nourishing, and that means a lot. Plus they got fancy cocktails on top of all that. And given that the guy next to me order naked veggies with no salt and little olive oil, and they served that up without a blink, that I knew I was near nirvana/bliss.", "author": "Scarlet R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-03", "description": "westville in dumbo... music to my ears!! i still remember when this space belonged to rice (RIP ratatoullie- never forgotten). westville is certainly deserving of such a special location. the decor is cozy and casual, but actually spacious (compared to the closet on west 10th). same fresh dishes and flavors as the nyc sister restaurants. came for brunch the other morning and thoroughly enjoyed my eggs and avocado toast. definitely an asset to the 11201", "author": "Steph G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-03", "description": "Westville is a chain and it's so delicious. Only giving a 4 star this time because the salad I got (cauliflower BBQ quinoa salad) wasn't as good as my regular order (market plate with 4 veggies). Still was very sizable- I brought home leftovers so it was essentially 2 meals. My fiancé got the Cobb and loved it. Very spacious and they have an outdoor area. Bathrooms weren't as clean as I'd hope for. In a gorgeous area and perfect for a stop in.", "author": "Britt D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-27", "description": "You can compare this to a Dig Inn - with table service, a bar, a bigger menu, and dishes prepared to order. Diners combine vegetables and around 5 meat or fish offerings to make meals, or choose from an array of complete plates. You probably want to know about the quality and it was excellent to very good. Ambition and creativity are the two ingredients missing from the food. We can tolerate or even welcome their absence when food which is good and good for you is the center of the experience. And a few dishes were remarkable, such as the mushroom special in chimichurri. We sat at the bar. The restaurant was comfortable and spacious. Here's the deets (20 May 17):\nSteak plate, 26, very good, the 8 ounce portion was excellent for sharing; who needs more than a quarter-pound of steak at a meal?\nMarket plate, 17, four vegetables from the gigantamous list on the blackboard and 3-4 more on the specials list.\nSmokey margarita, 12, mezcal and tequila, drank up; didn't need agave to sweeten it in favor of the fresh lime\nRose, 9, special price, good\n\nBONUS pleasant setting\nBONUS good value\nSHOUT OUT to Rosalee at the bar for being friendly and cheerful to us and everyone eating there\nBONUS family friendly\nTIP convenient to St Ann's Warehouse for pre-theater dining", "author": "Steve N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-15", "description": "Amazing food and service! Fresh vegetables, well cooked. Great ambiance and staff. The menu has lots of options, and they can customize for allergies. Overall, great place!", "author": "M. G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-23", "description": "Been a big fan of westville for many years, the mac \u0026 cheese is one of my favorites anywhere and was pretty excited when one opened in DUMBO as I'm not too far away. Food is good, staff/service is good BUT if you order for pick-up or delivery then check your order. Sides tend to be forgotten and something seems to have happened (on a corporate level?) with the green sauce. Not sure why you have to request this or speak to a manager to get it but it's delicious and I'm a bit sad to see it being faded out or just difficult to obtain. Almost wanted to take a second star off for forgotten items as this isn't a first time mistake.", "author": "anna m."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-01-11", "description": "A bit overpriced and overrated. The first time I came here, the food was good. But the second time I went, the cheese on my mac and cheese wasn't melted and was cold. It tasted really off. My boyfriend also got a salad that was pretty meh and tasteless. This is kind of a last resort if I'm in the area.", "author": "Nicole O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-22", "description": "Been here twice now, the service and quality are excellent, The food  is fresh,delicious, well presented and came out quick, atmosphere is great, friendly owner.\nSoft, hot yummy bread with fried eggplant and olive oil is the beginning of the perfection. Nice size delicious portions are priced very reasonably. Wonderful restaurant.", "author": "Berkay C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-05-07", "description": "Thank the heavens for new food options in the hood, we desperately need it. I did takeout via their website and it was perfect -- I walked to the end of the bar (towards the back) and our order was ready. Their marinated tofu is magical and the turkey burger hit the spot. It was super packed dining-wise, and has been since it's opening. There's nothing like a market plate when you're able to leave the office for lunch!", "author": "Shu Jin S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-12-17", "description": "I've had two experiences at Westville. DUMBO was the first. Sometimes I go into restaurants with high expectations. And I think maybe that's what I did here. The menu looks solid. It sounds amazing. But the food just fell short of that. Some people love it clearly, and if you've never gone, I'd suggest giving it a shot. Buiuuuuut not for me.", "author": "Andy S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-14", "description": "Called and ordered a Dumbo delivery at 8:15 pm. Never arrived. Called at 9:15, man said they were short staffed. Asked to hold. Man said he couldn't find order, asked to hold again. Was on hold for 8 minutes, call was cut off. Called back, they said they would send. Called again at 9:40, they said they didn't have ingredients but would send something. To their credit they said they wouldn't charge us. Arrived at 10:10. Cold slices of chicken with cold broccoli, not what we ordered. And a limp salad. Really nasty. Threw dinner in the garbage.", "author": "Charlie H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-10", "description": "This place is so damn yummy! I really, really enjoyed the food and it was well priced - especially for all the food you get as well as the quality. The drinks were super tasty as well, and I definitely filled up on 'em thanks to our awesome bartender Kylie! She was stellar! I'd say if you are looking for a nice chill place to eat a good meal and enjoy some great drinks, this is definitely a good place for you to check out. They'll take care of you for sure, and you'll leave very happy!", "author": "Tricia R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-25", "description": "Best happy hour ever!!! I've live in the city for three years and finally found a place with amazing eats to match the amazing cocktails for happy hour. Vegan meatballs are a must, even if you're not vegan. And the Grapefruit League was my fave cocktail!! Highly recommend their truffle fries too- not too heavy on the truffle like other places (I hate that). SO GOOD", "author": "Taylor J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-19", "description": "Order delivery from Westville all the time--tonight was no different.  Arugula, lemon, Parmesan salad add avocado and hangar steak is the go to order.  Tonight I got my steak and it was over cooked and chewy.  Because I order it all the time and it's always great I called the restaurant to let them know.  I was immediately connected to the manager who was gracious and apologetic.  He asked if I'd rather have a credit for my full meal (including the salad portion which was great) or a replacement.  I opted for the replacement.  It was delivered within 15 minutes and was delicious as usual.  Highly recommend!!!", "author": "Laura P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-19", "description": "Stopped in here for a late lunch and was pleasantly surprised. The ambience is great - relatively small with an urban, industrial feel. Service was excellent. They have an amazing selection of vegetable sides. They all sounded good so it was hard to choose only two. (They do have a plate where you can choose four vegetable sides)  I ordered the salmon plate with the beets \u0026 goat cheese and the sautéed mushrooms with leeks. The salmon was prepared perfectly and the beets and mushrooms were delicious! We also ordered the Chicken Caesar Salad which was fresh and good - 4/5 on the Caesar. Highly recommend this delicious Brooklyn restaurant.", "author": "Tiffany C."}], "servesCuisine": "American (New)", "priceRange": "$11-30", "name": "Westville Dumbo", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "81 Washington St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/6iR4MOEJIdEMXhHxm5nj7w/ls.jpg", "@type": "Restaurant", "telephone": "+17186185699"}