{"aggregateRating": {"reviewCount": 4, "@type": "AggregateRating", "ratingValue": 2.5}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-04-05", "description": "There is some sort of conspiracy going on. My theory is that every single grill man in this part of Brooklyn gets together with his buddies on weekends and they all share a good laugh about how they will never, ever put salt, pepper and ketchup on my bacon egg and cheese. \n\nThe guy here even turned around, as he was making it and CONFIRMED that I wanted the SPK on it. And then he STILL didn't put it on. He faced the other way, undoubtedly to hide his huge, mischievous smile. It must have been extremely difficult for him to contain his laughter at my expense.\n\nI'm on to you, Hoyt St. Market \u0026 Deli guy. I know you're in league with the guy at 3 in 1. I just wonder how high this thing goes. Who do you work for?\n\nDespite their affiliation with some shady bodega faction, the Hoyt St. Market \u0026 Deli is a pretty solid corner store. They have the limited \"grocery\" items you'd expect, as well as a small selection of beer. Since I informed the counter guy that I was extremely disappointed in their Ben \u0026 Jerry's flavors, he's stepped it up and gotten me some Americone Dream.* I do prefer Jesse's Atlantic Limited over on Bond for sandwiches and their larger beer selection, but this place does the trick in a pinch.\n___________\n\n*But is it my imagination, or are the bits of cone in Americone Dream not as crunchy as they used to be? Stephen Colbert is going to get a strongly worded letter.", "author": "Peter D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-03-10", "description": "Terrible dirty dirty..\nThey have different prices for different people\nThey dont believe in receipts\nCant believe the State has not shut them down", "author": "Sonja G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-05-05", "description": "Decent beer selection. You can mix and match or buy looseys. Guy at the counter was nice but aloof, busy watching videos on his phone.", "author": "Kenny C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-08-10", "description": "$13 for a sixer of Lagunitas. I ought to know better, but I'll groan about it anyway. Pretty standard deli all around. They all just run together in one big mashup of living in this city.", "author": "Mike O."}], "servesCuisine": "Delis", "priceRange": "$11-30", "name": "Hoyt St Market \u0026 Deli", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "348 Atlantic Ave", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/OjeOAxModFYjIVoZugS4cw/ls.jpg", "@type": "Restaurant", "telephone": "+17182608067"}