{"aggregateRating": {"reviewCount": 143, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-04-05", "description": "I moved out of this neighborhood about 2 years ago but remembered this restaurant as being nice decor and tasty.  NO more.  Went back.  The food arrived less than 5 min. after ordering, everything was microwaved.  Where there use to be chunks of chicken, now there were little worms of chicken.  The staff sat at a table two down from us, gathered around an iPad watching the Simpsons at full volume so they could hear.  Go down the block to Trader Joes, buy frozen food, go home and watch movie of your choice.", "author": "Mary H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2007-09-28", "description": "holy cow.  best masaaman curry I have ever had.  oh and the hot sauce carosel - MAN - when the proprietor comes over and says, \"This one - really hot!\" - be forewarned.  naturally, as curiority killed the cat (or in this case, the taste buds) my brother and I dipped in...holy shit, that one sauce is hot, hot, hot.  wow.  sorry, I digress - the food was all fantastic - brother had the seafood medly, GF had the drunken noodles with veggies....but really, the masaaman took the cake.  unreal - kinda spicy with a tangy sweetness to it I have never tasted.  def recommend this place....", "author": "Joe O."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2009-05-18", "description": "I just don't get the concept.. east meets west, but instead of fusion, it's just a hodgepodge of thai and italian dishes, which just don't go together.  The pad thai was a bit watery, and our curry doesn't taste thai.  Though the decor is trendy, the food was disappointing.", "author": "Jonathan Y."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-11-20", "description": "The green curry wasn't good.  The ambience of the restaurant was great, but the food was only okay/below average.  The Thai tea was pretty good, but not enough to make me return.", "author": "Secondbelle B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-02-22", "description": "the atmosphere inside is very nice the food is very delicious . good service i would recommend  someone  to go there and try it out .  the only thing the menu is limited but for price not expensive  try the banana  split  desert .", "author": "Ludgi T."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2009-02-03", "description": "food was definitely mehhhhhhh.\nit was really warm in there, too.  and the decor was weird... and things were crossed out on the menu.\ni ordered something which sounded like pad see ew but ended up being noodles in a pile of gravy and it made me naush.\nnot going back, i am an 'Em thai freak !", "author": "Jessica W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2009-09-21", "description": "A friend and I wanted to go to Joya but the wait was ridiculous for the hunger pains we were already experiencing, so we went to Cafe Chili. It seemed nice enough, we were seated immediately, and the menu looked good. However, something was totally wrong with the Red Curry (tofu) that I ordered because I was sick for 3 days after eating here! I felt absolutely terrible and will not go back.", "author": "Olivia R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-10-08", "description": "If I could go lower than one star, I would.  Over an hour for delivery for food that had hair in it...  Save yourself the money and the waste of throwing away the bad food that arrives...", "author": "Andy S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-12", "description": "Good food, and VERY good service, I love the girl who always serves me, she has great smile. and the interior inside is so relaxing and comforting, perfect when you eat alone or couple.", "author": "saryu w."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-04-11", "description": "This is really not good Thai food. Like most people, we went here because the wait at Joya was too long. Pad See Eew was average or below that. My friend got the Pad Thai which was a little better. Service was slow. I wish we had just waited for Joya.", "author": "Jeff R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2007-11-13", "description": "Boo.  One star because the decor is kind of nice and one star because the food didn't actually suck.", "author": "Jocelyn B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-14", "description": "We stumbled into Cafe Chili on a Saturday night because Joya was jam-packed, but I am glad we did! The food was delicious and served fresh. I ordered the scallops and shrimp in their curry sauce. Tastes very similar to Joya's recipes, but slightly more expensive.", "author": "Kris T."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2010-05-29", "description": "This is a terrible restaurant.  We had tornado chicken...turned out to be what looked like, tasted like and had the texture of deep-fried chicken fat.  The vegetables with garlic sauce were tasteless and looked like something you'd find at the back of the refrigerator at the end of hte week.Actually diidn't mind after all that the portion was so small.\nWould give zero stars if possible.", "author": "Mary R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2008-12-26", "description": "A Thai place close to my bf's place. I have to admit that I've had better pad thai elsewhere. Great ambience though! I think there are several Thai places on this street. I probably would like to check out the other places too. Oh well. An evening spent well, still. =)", "author": "Amy F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2008-10-20", "description": "very cheap food that is definitely decent. the portions were extremely generous, the waitstaff super-quick, kind and efficient. not the place to hang out for mega-ambience but a good place to hop in for a fast and filling dinner for not a ton of cash.", "author": "Amy S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2009-05-08", "description": "2.5 stars, and probably varies dish to dish, this place is about as average as all the other Thai joints in the gauntlet of Court and Smith. Nothing to write home about--or to take home, either.", "author": "Jeff M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2008-03-28", "description": "There are at least eight Thai restaurants in a four block radius in Cobble Hill/Carroll Gardens, and I've tried most of them.  So I wasn't in a rush to try one of the newest -- Cafe Chili.  Joya is still the king of Court Street, but after they put pork in our vegetarian appetizer we decided to boycott.  Lemongrass is hit and miss.  Em Thai on Smith is decent but too far.  But once we tried Cafe Chili, it's been a reliable addition to our takeout routine.  I love the Pan Seared Thai Vegetable Pancake -- it smells kinda weird but it's delicious.", "author": "Tracy H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-23", "description": "I think these guys are great. The service is always warm attentive and friendly, and the food is yummy.", "author": "Aurora P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-22", "description": "I had dinner at Cafe Chili last night with a friend (03/21/09) and I had the pad thai because I rarely deviate from it because why mess up a good thing?   The pad thai here was DELISH.  It was as good as my ultimate favorite thai place, Thai Market, which is on the upper west side NYC (my neighborhood).  It was super spicy like I like it, and the flavors were excellent.  The only thing I was disappointed with was the Rose wine which tasted a little cheap...but other than that....I love the decor (I don't think it's weird??).", "author": "Lizzie R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-02-01", "description": "We ordered from Cafe Chili tonight and we were really disappointed. When we placed our order, the delivery window was between 45-60 minutes. Once 70 minutes passed I made a phone call to the restaurant and the woman from Cafe Chili admitted that our order had left (along with half a dozen other orders) about 30 minutes before! The food finally arrived, 85 minutes after we ordered and everything was lukewarm. We ordered Pad Thai (I asked for it a little spicy and with extra sauce), Panang Curry (extra spicy), and an order of fried wantons (they call them Bags of Gold). The Pad Thai had almost no sauce, and while it was a little spicy, it tasted like nothing. The Panang Curry was so watery, had only a mild spice, and was mostly liquid with a few chunks of chicken and vegetables. The \"Bags of Gold\" had a nice flavor but they were barely warm. We will not be ordering from them ever again. Such a waste of money.", "author": "Meghan R."}], "servesCuisine": "Thai", "priceRange": "$11-30", "name": "Cafe Chili", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "172 Court St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/iIK6_7Yxje77gJCD1dtsBQ/ls.jpg", "@type": "Restaurant", "telephone": "+17182600066"}