{"aggregateRating": {"reviewCount": 143, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-14", "description": "Cafe Chili is a legit Thai food restaurant.  I came here 30 minutes after the lunch special had expired and they still honored it. \n\nI was able to get a free spring roll VIA Yelp special offer. I had the Beef Cee Yoo with $2 additional shrimp. Food tasted very good!\n\nWill definitely come back again!", "author": "Freddy V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-08", "description": "No real complaints. I had the lunch special with Thai salad and Vegetable Pad Thai. The salad dressing on the salad was surprising and delicious. The Pad Thai was good, your typical Americanized Pad Thai...not too much sauce and bean sprouts and peanuts on the side of the dish to mix in as you please. \n\nI only wish that there was an option to add spice to my Pad Thai like a dish of chili flakes or chili sauce on the table. Besides that everything was presented nicely and the service was quick.", "author": "Haylie L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-07", "description": "Was in the neighborhood for the first time in a few years and was looking for Thai food. I saw Chili and it looked really nice from the outside. The menu was clearly posted on the window and the prices were very reasonable. I gave it a quick google and it had good reviews so I stopped in for a late lunch. I ordered from the lunch menu. The lemon grass soup appetizer was delicious. It had a spicy kick to it but was just right, not too spicy. Then I had the Shrimp Pad Thai. The portion was generous. It was made to order and very fresh. The service was good. I enjoyed my lunch and will be going back. Nice place! And friendly staff.", "author": "JJ H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-08", "description": "I enjoy coming here because the ambience is so soothing. The music of soft, the staff are nice and the food is good. They have 2 different lunch menus and bubble tea for anyone interested. If you're interested in Thai food and you're in the area try this place. Great for a date as well. Oh and the spring rolls were free with my check in on Yelp. Woohoo!!", "author": "Sylenya P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-29", "description": "This restaurant was a savior for me on the New Years night as all the restaurants had shut down and they welcomed us!!\nThe ambience of the restaurant is very pleasant and elegant. It had a lot of character. \nThe food was indeed incredible.... I don't like Thai cuisine that much but the food was tasty to my likeness.\nThe service was very good too.", "author": "Mariyah S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-02-01", "description": "Well priced, satisfying food, and very, very cozy. Wonderful decor. Maybe not the most extraordinary or regionally specific Thai food in the world, but I enjoyed my time.", "author": "Will H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-16", "description": "The decor was nice. The food was so so. My husband and I ordered the vegetable drunken noodle. It was so watery and not that flavorful. We probably won't return again.", "author": "Khadine B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-01-04", "description": "We've been slowly going through a checklist of Thai restaurants near our office. I went here with coworkers on a Friday. Lunch prices are pretty solid--$7 for an entree and a choice of soup, salad, or wonton (or something else? It was one of three things).\n\nPlace was dead and it still took well over half an hour to get our food. I get the pad gra-prow, the standard Thai basil and chili dish. It was bland. Like...really bland. Flavors weren't there, chicken was overcooked, and there was hardly any basil! We were also given chopsticks, which I found odd...considering the Thai use forks (or at least they do to my knowledge).\n\nIn short: long wait, mediocre food, decent prices. I'll stick to Lemongrass--it's basic US thai, but it's much better quality.", "author": "Dylan K."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-07-16", "description": "Horrible delivery experience! Ordered through Seamless at 7:45p and was given window of delivery as 8:25p - 8:35p. At 8:45p I called to check, was told food was on the way. 20 mins later no food so I called back. Woman wouldn't answer me if food ever went out and wouldn't let me cancel my order. Told me to wait 10 more mins. After 12 mins, I called again and told her food still hadn't arrived. She just said she'd cancel my order (no apology, no further explanation). At 9:45p (2 HRs after I ordered) the food arrived, we just sent it back.", "author": "Heather L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-10-24", "description": "After walking through DUMBO one day, we stumbled upon this small little hidden Thai restaurant in Cobble Hill that serves yummy Thai cuisine. \n\nThe places offers a good variety of Thai cuisines with low prices, nice ambience and good service. It's probably a good option for Thai for the area and if your looking to grab a quick affordable bite!", "author": "Farhana S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-20", "description": "Lovely thai restaurant in Cobble Hill.  Solid good, solid service, and superb backyard garden!  Really, do come see the garden. I also feel like there is a appetizer special if you get here before 6pm.", "author": "Kieran H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-18", "description": "Always passed by this and one night i decided to dine in. Good food for the price, lovely staff! \nOutdoor seating looks amazing, but dined in...\nOverall great place but, next visit will be a pick up.", "author": "Brian A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-01", "description": "I am updating my previous 5 star review, because I still really can't imagine how this place isn't more popular. I love Thai food. I've been to Thailand and ate the real thing there. I am always in search of a good Thai place whenever I travel. This place is the real deal when it comes to good food and quality service. The interior of the restaurant is small, but beautifully decorated.  The service is always friendly, and the food is amazing.\n\nIf you are in the Cobble Hill area and want good food...EAT HERE!!!", "author": "Ronald E."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-08-14", "description": "I've been working through the various Thai places located around me in downtown Brooklyn and decided to try Cafe Chili last night.  The delivery was quick, it actually arrived a little early with no problems, the food was pretty bland.  I typically start a new Thai restaurant with pad thai and some appetizer that I'm familiar with.  This time they had crunchy taro bites which sounded interested, I love taro anything, so I gave it a go.  They were pretty bland, no flavor at all.  I've never really had taro before that wasn't in custard or bubble tea, but I thought it was supposed to have at least a subtle sweetness to it.  Fortunately there was an incredibly sweet and spicy sauce to go with it which was kind of tasty.  Still they'd be edible on their own, fried foods are good in their own way.  The pad thai was also really bland.\n\nOf the other thai places I've tried around here, I think Lemongrass Grill is probably still the best in the area, unfortunately their food quality seems to be dropping.  I also think Spice has the best curry of any thai place I've tried in the area.", "author": "Scott C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-12-25", "description": "It is the really RUDE restaurant. I ordered my food and it took more than 1 hours to arrive. I called to them and ask my order status, and they JUST CUT MY PHONE. IT IS SUPER RUDE and UN-Professional. I WILL NEVER ORDER FROM THEM ANYMORE.", "author": "Angie L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-04", "description": "This was my first time eating at Cafe Chili and it was a most enjoyable experience. The food and service was excellent.  This should be your first stop to experience authentic Thai food. \nThe dining experience will be one you are sure to remember.  I would recommend Cafe Chili\nas your only stop to really get the opportunity to eat delicious Thai cuisine.  Cafe Chili was not my first choice for Thai food, but my first choice was closed for the 4th.  Imagine my surprise when I got my meal. This will be my one and only stop for authentic Thai food from now on and I give my dining experience a 10 + + + +! \n :-)", "author": "Cherly S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-13", "description": "I've only ever gotten take-out from here, but the food is good, the prices are good, and the people are kind. Never had a miss. I'd say the quality is about the same as Lemongrass Grill nearby, but the prices are a little better while the selection isn't as impressive. They advertise a weekday lunch pre fixe that seems like a great deal. I'll go someday when I have someone to take to lunch on a day off.", "author": "Bernard S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-05", "description": "After a very bad experience at a Thai place up the street, I decided to try this place. I ordered pad thai spicy, chicken red curry spicy and chicken satay. The food was awesome. The satay was cooked perfectly, and had great peanut sauce. The pad thai was very tasty as was the red curry. Of note- it was pretty spicy- so if you like food very spicy, that's the way to order it. If you like it not that hot- maybe order it medium spice. Service was very good and the owner was very kind to those of us ordering take out.  This will be the place I'm going to from now on.", "author": "Charles B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-20", "description": "My favorite thai place on the court street/cobble hill strip. Really great lunch specials, nice seating environment, and good food.", "author": "Michael L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-27", "description": "The food was excellent. If you want to enjoy some excellent Thie  Cuisine with good atmosphere. Highly recommend this place.", "author": "Jose C."}], "servesCuisine": "Thai", "priceRange": "$11-30", "name": "Cafe Chili", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "172 Court St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/iIK6_7Yxje77gJCD1dtsBQ/ls.jpg", "@type": "Restaurant", "telephone": "+17182600066"}