{"aggregateRating": {"reviewCount": 143, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-16", "description": "I'm an unabashed Thai food snob and Cafe Chili delivers the goods!  The paneng curry and pad Thai are both authentic to their southern Thailand staples and they were accompanied with cheerful service.\n\nI'll certainly be back to satisfy many Thai cravings to come.", "author": "Evan W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-12-08", "description": "Beautiful restaurant, great service. Super nice ladies let us linger. It was a slow night so we stayed well past the end of dinner because it was so comfortable. \n\nWe shared the corn fritters to start. The fritters come with a spicy sweet sauce but can stand on their own. I had the Sauteed Tiger Shrimp as an entree. The veges were cooked but not overdone with a delicious sauce. The shrimp include bacon which was a nice added touch. But I could've had a few more shrimp. I've never had bacon in Thai food but found it a nice surprise. \n\nThis is certainly not the best Thai food I've had but I had a great time, had a great meal and look forward to dining again.", "author": "Sabrina W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-10-13", "description": "I really wanted to give this place 4 stars, as I think it's some of the better Thai food in the neighborhood - great flavor, good prices, good selection, fast service, and nice decor. I have only good things to say about the couple of times I ate in the restaurant for lunch.  I always order the Thai Salad and the Panang Curry with either chicken or vegetables. \n\nWe decided to order for delivery the other night, and I can't even believe this was the same restaurant.  When dining in the restaurant, the curry was thick, flavorful, and had that rich reddish hue that Panang does.  When I ordered it for delivery, it was soupy and resembled Wonton Soup - with that thin, translucent tan-like color.  Not at all what that curry is supposed to look like.  My husband had the exact same experience with the Massaman curry - great in-house, not great for delivery.  Maybe it's the way it's prepared for delivery.\n\nOn the plus side, even with the sub-par delivery curry... the vegetables were still cooked well - too many Thai places fall short on that one, so I'll give them some credit.  I would still recommend trying the restaurant.", "author": "Dana L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-05", "description": "Food is always good and great service. Would usually order take out but nice to eat in too. Better food than most of the Thai places in the area IMO.", "author": "Chris W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-20", "description": "Food is typical for most Thai places but the ambiance and service makes it a standout....very personalized and family friendly would go again and again", "author": "NJ J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-05", "description": "My girl and I pigged out in Cafe Chili it was a slow night and we had the whole place to ourselves which was nice. We started with the roti and massaman curry chicken it was very good, then we had the curry puffs loved the presentation (photo attached). We then moved onto drunken noodles which was made in a very authentic style, loved it. Next came the red curry with duck, the taste was wonderful and a little spicy. To top it off we finished with fried banana desert (pic also attached). It was a lovely dinner in a lovely Brooklyn thai restaurant.", "author": "Dom C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-05-29", "description": "Food was okay, coconut shrimp tasted more like chicken, and service was extremely unattentive. Had to ask twice for a refill and again for the free spring rolls.", "author": "Kisha K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-02", "description": "This is a great neighborhood Thai go-to place with solid Thai food and very reasonable prices.  Their portions aren't huge but they have good quality food.  In particular, their pad thai is quite authentic.  They have good basil chicken and their cashew stir fry with tofu is good too.  Their dishes are flavorful without being too salty or saucy which can be the downfall of some other Thai restaurants.  I will be coming here more often.", "author": "Amy L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-25", "description": "Cafe Chili is my go-to for thai in the neighborhood. We're always seated right away, the backyard is a great place to eat (and the tables in the front window are excellent for people watching).\n\nIn my many trips here, I've tried everything (vegetarian) from the pad thai to the drunken noodles to the curries, and everything is always tasty. Steaming hot, good portions, and not over-seasoned. The tofu is great.\n\nStaff is always attentive and friendly, giving you ample time to peruse the menu, answering questions, and keeping your water glasses full. And since it's never very crowded, they don't push you out the door once you've paid your check. \n\nThere are a few other thai places nearby that I've tried, and this one is certainly the best of the bunch.", "author": "Cynthia C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-05-10", "description": "The food is delicious, but I just had an experience so cartoonishly offensive I'll never order from here again. I ordered delivery, and the delivery person told me \"don't order from here after 7 or so. There are too many black people around here, and it is a problem for me.\"", "author": "Andrew K."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-03-16", "description": "The staff is very very nice and friendly.\n\nThe downside is the menu fails to mention what is spicy and what is not. I myself have a very low tolerance to spice and a slight allergy, so this isn't the ideal situation for me.  The food itself is not mind blowing, but it may suffice depending on how hungry you are.  The prices are good for lunch specials.", "author": "Erica C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-06", "description": "We went to a show and we're looking for Thai for dinner.  This place came up on yelp so we went.  It was a lovely restaurant and we ate in the garden because it was such a beautiful day.  I had curry and my \"date\" had pad thai.  We loved them! The price was very reasonable for dinner, and the appetizers were yummy.  I would recommend to anyone.", "author": "Kirsten S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-07-16", "description": "Really greasy. Spice level was good but still bland :(. Two stars because food was edible. Have yet to find a really good Thai place that delivers to the north slope.", "author": "Heidi W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-08-02", "description": "Sat on the back patio. Cool, secluded area. We had it to ourselves. The back patio has a completely different feel than the rest of the place. The prix-fixe menu was a great deal - $20 for appetizer, entreé and dessert. I had the volcano chicken. Very good.. Just needed a bit more sauce. decided to try the fried ice cream. Was not a fan. It was a bit mushy and was expecting it to be more crunchy.", "author": "Rachel O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-29", "description": "Having briefly lived in Thailand and grown up among a Thai community in California I can attest that this place is LEGIT. I'm not sure why it has not great reviews here on Yelp, but then again I've always been confused by New Yorkers' taste for Thai. It's been a difficult quest finding good Thai here in New York- it's usually bland, Americanized, and lacking spice. They do it right here. When you ask for spicy, it's actually spicy. They put tamarind in the pad Thai, and garnish it with peanuts and lime- that's how you know they know what they're doing. The portions are also huge and well-priced. Most importantly the service is excellent- staff was really friendly and genuine. And yes, they're really Thai people. I'll keep going back here.", "author": "Pedestrian C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-08-02", "description": "Overall the food was decent and the waitstaff was nice. The garden area is cute but the mosquitoes were running wild and the staff said they had no citronella candles. Vegan options are pretty good and they altered the prix fixe appetizers to suit us, although it took some convincing.", "author": "Danielle S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-12", "description": "$3 Singha for lunch- can't beat that!!! Excellent Massaman curry that comes with a yummy salad for $7- can't beat that either. Smiling attentive staff- can't beat that. A solid place, I wish I had Jury Duty more often!!!!!! As long as my tenure as Juror lasts I'll be frequenting this place. A great deal for lunch!!!!!", "author": "Will R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-11-13", "description": "I ordered chicken pad Thai and it had a long piece of hair in it. Thankfully they took it back and brought out new plate but \nI was still turned off.", "author": "Aisha J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-10", "description": "of course i had the spicy thai fried rice w/ chicken-- n yessss all the spicy spicy peppers and oils . waitress was nice and going with da flow. the place wasnt crowed lol that scraed me because it was my 1st time. n i feel a type of way if a spot is empty --lol shyt is suspect to me. either its nasty or sumin.... but nope this spot wasnt nasty at all. too good! good to go or stay!!! fyi it was on my lunch break!!", "author": "I C Y U N V S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-07", "description": "Good food at better than average Brooklyn prices! Thai bread was delicious (if a little oily) and Thai Sausage fried rice was on point and plentiful. Would eat here again!", "author": "Matt J."}], "servesCuisine": "Thai", "priceRange": "$11-30", "name": "Cafe Chili", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "172 Court St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/iIK6_7Yxje77gJCD1dtsBQ/ls.jpg", "@type": "Restaurant", "telephone": "+17182600066"}