{"aggregateRating": {"reviewCount": 143, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-20", "description": "This is the best Thai i had in years. I am always on the look for a good thai place, this is my go-to-spot for lunch, as i work in teh area. My husband likes it as well. He works in manhattan and comes by sometimes just to eat here for lunch. Their lunch box are a great value for your money thing. Its more than enough food for one person, my husband thinks its a lot of food not for me LOL... Anyways, i love the staff they are always soo friendly and sweet and their garden is very pretty and tuck away from all the noises. We love to sit out back and eat there. They also have a very nice collection of beer. \nI think most of the people don't visit them because they have this huge grocery store right before them that actually hides the restaurant away. Oh well, if you are in the area and craving thai go here, you will not regret it i promise, try their chilli vegetables, they are yum,... I will try to post pictures next time i am there.\nFor now, Happy fooding...", "author": "Pam K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-08-19", "description": "Having only eaten here once, I thought the food was decent. I'm not entirely sure why the reviews are low, but my experience was not bad.\n\nService was fair, restaurant was clean, and prices were average. Really no complaints, but I suppose nothing stood out in either a negative or positive direction. \n\nMy only word of advice: If you decide to sit outside, don't. You'll have food exhaust pumped onto you from the kitchen fan the entire time... which is a bit disgusting.", "author": "Ian J."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-09-22", "description": "I simply gave this restaurant 3 stars because of the fact that I was charged twice on my debit card which was an inaccuracy. I grabbed lunch worth my friend and sister and we each used out card to pay. Not only was my friend charged for her meal but I was charged double. How does that happen? \n\nAnyways I didn't appreciate that and I'm steal waiting in the issue being resolved. Heads up, just pay with cash.\n\nOther than that the food is good.", "author": "Jenn B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-17", "description": "I was pleasantly surprised by dinner here! The reviews weren't awesome, but we took a chance, and the food was super flavorful and tasty. Good size portions, great sauces, good prices. I highly recommend checking this place out. And the staff was really nice too!\n\nOne little thing was that they didn't ask me how spicy we wanted our food, so be sure to mention your preference.", "author": "Carla D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-07", "description": "Good place to go. Quiet. Free spring roll. However too much ice in my Thai tea.  Food was okay", "author": "Cuiting C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-04-24", "description": "Here is the down and dirty on Cafe Chili.  The food tastes good. Note: the waiters are a little slow and in their own little world. Other than that it's a nice environment, for take out a Thai restaurant. By the time I walked home my stomach was off charts not well. I had the Panang Chicken Curry for the next hour diarrhea central. \n\nStay away from Cafe Chili unless you want to take a chance on bad stomach ache.", "author": "Kingludy S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-25", "description": "Got FREE crispy vegetable spring rolls for checking in from Yelp! The spring roll sauce was delicious, I wanted to add it to everything else I was eating. I got the Pan-Seared Atlantic Salmon entree. It was ok. The fish wasn't seasoned throughout and flavorless on the inside. The spring roll sauce gave this post 4 stars.", "author": "Valerie M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-10-17", "description": "Showed at 2:30 when it was totally dead and did not have a good experience. I requested extra veggies and offered to pay extra, emphasizing that what mattered to me was to get a lot of veggies. \nMeal came, not only did it only show up with just 2 pieces of broccoli, it was swimming in grease. The flavor was bland, and the oil took away any pleasure this lunch could have provided. \nI will not be back. Too bad, as the staff was nice enough, but not enough to make up for the crappy food.", "author": "Syl R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-05-29", "description": "I feel terrible giving this place 3 stars because of the great service we received, and the fact that they ACCEPT CREDIT CARDS unlike Joya... but to be honest, their food was somewhat lacking behind the other big name places, namely Joya or Spice and Tue Thai for you West Villagers.\n\nI came here around noon on a holiday and the place was empty....which means empty garden and perfect place for a impromptu photoshoot :D My party all ordered the $20 prefixe special: salad AND soup, appetizer sampler (coconut shrimp, spring roll, and this amazing deep fried fritter - don't remember what was in it, but TASTY!), entree, and deep fried ice cream (**it's NOT tempura like, it's more like a donut type of breading). \n\nI usually complain about pad thai at Spice and most Thai places for being too saucey and sweet, almost dessert-like. However, this pad thai was dry and bland, to the point where I felt like I could taste the noodles... o_____0\n\nAppetizers were the highlight of the meal in terms of both taste and presentation. However, I appreciate the presentation of all the dishes. Dessert was pretty, but I was disappointed that the ice cream came with thick breading rather than a crispy tempura batter.\n\nTo those getting the pre-fixe --- prepared to be stuffed for the ENTIRE day. Good deal for $20, I guess?", "author": "Cathy K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-02", "description": "The restaurant is small but beautiful.  Even the bathrooms are pretty. However,  there was a bit of an unpleasant odor by our table when we sat down.  It went away after a while,  not sure if it was because we mentioned it to our waitress and they did something to fix it,  or if after sitting there for a while,  we just got used to the smell.  \n\nWent there on a Friday at 6 only because Joya down the block was crowded,  and it was very quiet here.  You get a free order of spring rolls if you check in on Yelp or download their app. The spring rolls came our very hot and were delicious.  I ordered the chicken pad Thai,  the chicken was great,  the noodles were so so,  just dry and without any sauce. The prices are great,  pretty cheap,  and the waitresses were nice and brought out our food very quickly.  Would definitely come back here,  if only for the decor.", "author": "Lori A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-26", "description": "I preface this by saying I am from Detroit, MI... So there isn't a lot of variety in the Thai food market. That being said, I really enjoyed the Garlic Tofu. It was flavorful, although I would have liked some spice with it.", "author": "Joane B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-24", "description": "I saw this place walking through Court St. in Cobble Hill, Brooklyn a month ago and decided to give it a try next time I was here. It looked like a nice restaurant from the outside, and had a nice ambience inside. The staff was very nice and friendly. The food was good and full of flavor... My favorite was the Drunken Angel dish. On top of that, the prices weren't that bad. Would definitely come back again.", "author": "Bert K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-06", "description": "To be honest, I was a little wary when I walk in. Yet, their satay, pad tai, and drunken noodle are delicious. I have no idea why they are given such low rating on yelp. One possibility is that they are way too diversified with the whole \"east meet west\" theme. If they were to focus on traditional Thai cuisine, I can imagine that this could be the next must go spot for Thai food in Brooklyn.", "author": "Gavin C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-06-08", "description": "First, the reason I choose 3-star \u0026 not 4-star is simply based on the price vs portion size.\n\nI am a pretty decent judge when it comes to Asian cuisine ~ I regularly eat Chinese, Japanese, Malaysian, Thai and Vietnamese.\n\nI enjoy a nice curry, tom yum (or lemongrass chili) soup, or a drunken/ stir fried noodle most of the time.\n\nI find the spicy shrimp soup (their secrets is fresh chilis, dried chilis, and curry spices) to be quite delicious, but small for $4/cup.\n\nI also like the duck or mock duck dishes equally - the mock duck is $8/dish and the duck runs $15/dish.\n\nI wish they served larger portions but I find the portions to be flavorful and tasty.", "author": "Kirsten P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-10-06", "description": "I went there a few nights ago. It was Sunday around 9PM.  There was not one single customer eating there.  A few doors down, there was many packed places.\n\nI should not have stayed to eat.  We had a bad experience a year ago, when ordering take-out through Seamless - just not very good food at all.\n\nAnyway, I order the Fried Calimari appetizer that was devoid of flavor - like it had been sitting in the middle of nowhere for a week.  Unreal.\n\nEntree:  I would call it 100% like an attempt by a restaurant to impersonate hospital food at its worst.  \n\nDO NOT EAT HERE UNLESS YOU REALLY REALLY want very tasteless and flavorless food.  I have a relative that is easily the worst cook I have ever known.  She cannot hold a candle to Cafe Chili.  Gross.", "author": "Marci W."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-08-01", "description": "Food was just so so. What I want to talk about is their people. I ordered delivery to my hotel. The guy arrived on time and called me. He just talked what he wanted to say then hung up, without allowing me to say a word. I did not get him so I just kept waiting. He then called again and scolded me on the phone then hung up straight. So I called the restaurant to find out what happened. The lady told me she does not have the number of the delivery person so she could not check, then hung up. The whole thing repeats and ended up he just left my food unattended in the lobby. Hotel staff were the ones to help me find the food! \nI guess they were in a rush or lack of people. But you shouldn't offer delivery service if that's the case! Couldn't imagine how can treat their customers like this. Terrible experience! Would never come to eat again. Ultimately disappointing!!", "author": "Roxanne F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-01", "description": "Good food, friendly staff and really good lunch deals. Overall great value for money and a yummy meal. Free spring rolls at check in on yelp too!", "author": "Sarah B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-12-03", "description": "Well I gave this restaurant two chances and it failed both times. The first time we ate in the restaurant and thought the quality of the food was slightly lower than the rest of the Thai places around but it had a good location. Then I got their delivery. And it was so much worse. Every part of my meal was greasy. Including the soup and corn fritters. It was just not really edible and both my husband and I gave up on our dishes about a third way through and threw them out (something we never do!). I'll be sticking with Hop Hap.", "author": "Lana V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-03", "description": "Lovely Thai restaurant, amazing food. The staff is very attentive, great hospitality! Lovely place.", "author": "Ninoska T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-01", "description": "This place is great! We eat a lot of Thai and after this, it is one of our new favorites in the area. We ordered the vegetable dumplings, Thai bread, panang curry, and pad see ew -- all were delicious. Friendly and attentive service too. 5 stars!", "author": "Jeff D."}], "servesCuisine": "Thai", "priceRange": "$11-30", "name": "Cafe Chili", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "172 Court St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/iIK6_7Yxje77gJCD1dtsBQ/ls.jpg", "@type": "Restaurant", "telephone": "+17182600066"}