{"aggregateRating": {"reviewCount": 143, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-03-11", "description": "Chili is a misnomer because the dishes here lack heat for sure. This place serves up OK Thai food, but overall it is pretty bland. You can always get a seat in here, as every visit I have seen only one or two other tables taken. There seems to be a reason for this - the food is just not that good. However, if it is a choice between this place and Song or Joya, I would come here any day as their dishes are less greasy, and you could actually hear the people at your table.", "author": "Cynthia S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-21", "description": "Delicious food, not too pricey. The appetizers were really good, and the handle sauces really well. I went with two friends and there was lots of space. Also the lighting was low and it was pretty quiet, which is great for conversation. definitely plan on going again!", "author": "Allison M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-06-25", "description": "its ok, I usually go when the wait for Joya (across the street) is over an hour.  The prices are great, the food is decent, sometimes too salty, but there is never a wait, and its Thai food :)", "author": "Jill Z."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-03", "description": "When I'm in this area, I come here whether solo or with friends for Thai food. I have not been disappointed one bit. I love the spring/summer months b/c the gorgeous backyard is open and foodies can luxuriate on their nosh while sipping on the ice tea. Treat yourself to something delish on a budget!", "author": "Chante R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-28", "description": "I'm really surprised by all these below average ratings.  Joya gets all the press but this place has better food.  I have to agree with one of the previous reviewers that questioned whether those offering the negative reviews are even into Thai food at all or just go with a few of the predictable American choices.  Nothing wrong with Pad Thai or Basil Chicken, just don't judge a whole restaurant on a few generic dishes.  \n\nThey have pretty darn good food at a fair price and the service is friendly.  Yeah the decor is a little off the wall but the place is tidy and clean.  Instead of waiting for a table at Joya tune out the crowds and house music and head a few blocks north.  I'm no Joya hater as I think the place is a value and the food is pretty good but Cafe Chili definitely takes more risks with their menu and the dishes are good to great across the board.  Enjoy.", "author": "Ryan P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2007-07-03", "description": "Good food.  A little nicer than Joya, but a little pricier, too.  I don't know yet if the food quality is better enough to justify the price hike.\n\nSmaller, more intimate.  Maybe a little echoey for a date, but good with a friend.", "author": "Tony M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2009-10-11", "description": "Another thai restaurant in a neighborhood with way better options (including about two storefronts down).\n\nThe food was tasteless and without texture.  We started with the steamed spring rolls which tasted like fish and were too crispy to have been steamed.  I had the basil fried rice which was bland - the tofu was dried out and the skimped on the veggies.   My GF thought the massaman curry was too thin and also lacked vegetables.\n\nFor a better experience I'd try Lemongrass next door.", "author": "Craig R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-10-15", "description": "OK.  First off, if you think Lemongrass = Thai food, you know **nothing** about Thai food.  Anyone from Thailand would be insulted by the association.\n\nI ate here tonight on the spur of the moment.  I had passed by it before and the menu looked decent enough price/dish-wise and the atmosphere was nice but not trendy.\n\nI ordered the tom yum goong (which they just called \"Lemongrass Soup\"--not necessarily the best sign) and the \"sauteed\" Chicken Basil entree--my litmus test for trying a new Thai restaurant.  Spice levels at a Thai place are often treacherous.  I like it when there are 5 levels--here they only have 3, so I played it safe at \"medium.\"  I like to be able to feel the sweat on my forehead without having to gasp for air or dump sugar in my water.\n\nUnlike some places where the soup comes out at the same temperature as Solar plasma, it was just right.  Unfortunately, it was not nearly spicy enough for my taste, but the shrimp were good quality and the flavors were nice.  \n\nOn the entree, I ended up having to ask for hot chilies, as it was quite mild to me.  The quantity for the money was good and the flavors were good but not bold enough.  They need to learn how to pump up the flavor.\n\nI'd go back, but not before trying some of the other Thai places in the neighborhood (just moved to Boerum Hill).", "author": "Matt B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2007-11-15", "description": "The first time I saw this place I thought it was a new Mexican joint but realized it was ANOTHER Thai restaurant. It took the place of Siam Garden. Siam Garden was around for many years but the two times I ate there it was clearly subpar to the then raging Joya just down the street. But recently Joya has gone down several notches in quality. Ever since they opened Song the food has been noticeably spotty. And with so many Thai restaurants in the neighborhood there's plenty of other options.\n\nCafe chili had a hand drawn window marker sign noting the specials\nwhich I read as either desperation or bad design (at best) but we grabbed a table for ourselves after being seated in the front with a cafe table, which was not gonna work for three people. The space had that typically wacky kind of Thai restaurant design. There was a large table surrounded in beads and the tables were all up against banquettes on the wall side. Not terrible, but wacky. Overall, it was a pretty lacking environment in terms of going out though. Was there even music?\n\nWe ordered the crispy tofu with spicy plum sauce and the puff pastry for appetizers. The tofu was pretty lame.  It wasn't fried and crispy it was just hard and boring. The puff pastry was more successful and actually had flavor. It was like a samosa with some cucumber type of palate cleanser on a spoon.\n\nThe menu was confusing and it took a while to find the main Thai courses. The \"East goes West\" section featuring New England chowder and pasta courses was pretty bizarre. Everyone ordered either drunken noodles or pad thai so I opted for the red curry.\nIt was ok but nothing spectacular. Just really average with so much red curry and very few vegetables except for the tough lemongrass which I had to keep removing from my mouth. The portion was not that large and I did wonder why we didn't just go to Joya and save a few bucks. But the Singha was great.", "author": "carl g."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2007-12-29", "description": "With Joya down the street being packed, Cafe Chili seemed to be the best possible next choice. The decor was somewhat interesting, albeit a bit misguided. \n\nWith any Thai restaurant you have to employ the pad thai test, similar to the samosa test for Indian restaurants. If a Thai restaurant can't make a good pad thai they probably can't make anything else of decent quality. And so for Cafe Chili, the grade was about a C-. It really lacked any kind of seasoning.", "author": "Bryan H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-18", "description": "My friend and I were in the neighborhood to celebrate Bastille Day at Bar Tabac - well, the celebration was a little crowded so we walked over Cafe Chili. The restaurant was quiet and we grabbed a great spot in front of the window where we could people-watch. I ordered pad thai and she had a salad - both were good. The server was nice, the bathroom was clean, and the food was good; what more could you ask for? It looked like they have a nice back patio too that would be worth checking out some other time.", "author": "Lee B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2009-05-27", "description": "I came here only because Joya was closed.  I was hoping to try Joya for the first time but by happenstance the building close by, above, or nearby collapsed or something like that so it had to shut down.  Bummer.\n\nI'd give one star solely on my meal.  I got the salmon and it was horrendous!!  How do you mess up salmon?  It was dry, bland and all sorts of bad.   Maybe I should've asked myself why would you order  a salmon dish at a freaking Thai restaurant.  But, salmon isn't really that hard to mess up, just don't overcook it...and of course my dish was way overcooked. \n\nMy friends ordered the usual and typical (which I should've done) choices of Pad Thai and Pad See Ew.  Their meals was a hell of a lot better than mine, hence the extra star.  The papaya salad was good but the eggplant appetizer was greasy.  But I guess Thai food isn't the healthiest option.\n\nService was incredibly slow!!  I don't know why our meals took forever..maybe it was just us? Bad day? Forgot some orders?  Usually Thai food is quick, I hate waiting an extended amount of time for food.", "author": "anita h."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-22", "description": "I agree with Cheeseball. People who frequent yelp and post their reviews are quite picky. I received great and personable customer service. It was low key and intimate. The decor is kinda funky, and retro. But overall experience was good. I had chicken and shrimp dumplings for appetizers along with coconut shrimp.\n\nThis place is very affordable and it convenient when you just want to do something simple with a significant other or a buddy.", "author": "Jennifer L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-12-02", "description": "It was my first time having thai food. I ordered the cheapest thing on the menu. Didnt really like it. Never went back. Beautiful decore though.", "author": "Ali F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-03", "description": "We have been here twice and have been happy both times. We usually go with the basil chicken (ask for it to be spicy) and have not been disappointed.  Have had the satay and veg spring rolls and both have been good.\n\nThey have a great lunch deal, definitely worth it!", "author": "Azi N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-01", "description": "I'm absolutely a fan. As I searched Cafe Chili I was very shocked by the reviews. The food is not horrible, it's decent. I was with my date and the only reason we stopped here was because our movie started in about 1 hour.. so we needed something quick and near Court St Theaters. For the appetizer we had \"Pretty Package\" It was dumplings served with a thick soy sauce. It was delicious. I believe the dumplings were stuffed with chicken and seafood. they gave a total of 5 I had 2 and she had 3 (Greedy Bastard!) J/K. For the entree she had Pad Thai Chicken or Chicken Pad Thai, how ever you say it. I had the # 34 Sea Scallops \u0026 Shrimp.. it came with a curried sauce and it had cashews, It was a party in my mouth. I don't consume alcohol so I figure she didn't want to drink alcohol to play follow the leader.. so we both had the Thai Iced Tea!.. Damn!! I loved that shit!!! It tasted like regular Lipton tea bags.. steeped and then they added condensed milk to it so 75% tea and 25% milk. Overall... it's a great place to eat.. not too crowded.. the ambiance was very nice.. try it out.", "author": "Dre D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-28", "description": "The setting is wonderful! Attentive service crew. Lobster bisque soup is beyond!! Love this place! Wonderful for conversation with friends", "author": "Tiantian X."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-01-04", "description": "I am compelled to write a review on my favorite neighborhood Thai cheap eat because of all the nonsense I've read so far. \nFirst, if you appreciate Thai food then you do not order Pad Thai because that's as generic as it can get. Expand your horizons! Do you only order cheese on your pizza too?!\nThere are so many affordable options at this cozy and well decorated corner on Court Street. \nI'm originally from San Francisco and have had my fair share of Thai cuisine, and this place takes the cake in my opinion. If you're on the fence then go check it out, and you'll end up loving it as much as I do!", "author": "Ariyan D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-01-09", "description": "Very bad service, disorganized. Waited a half hour for a salad with no onions that arrived with onions. I sent it back and they brought me the same one. The chicken satay and glass noodle soup were bland.  My spring rolls never came.", "author": "Lee N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-03", "description": "Tasty dishes (drunken man noodles and basil tofu), okay prices, and good delivery.  I've ordered twice before and will order from them again.", "author": "Tanisha N."}], "servesCuisine": "Thai", "priceRange": "$11-30", "name": "Cafe Chili", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "172 Court St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/iIK6_7Yxje77gJCD1dtsBQ/ls.jpg", "@type": "Restaurant", "telephone": "+17182600066"}