{"aggregateRating": {"reviewCount": 143, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2019-04-28", "description": "The food at the restaurant is great. Corn fritters and currie are recommended, the dumplings are good too - but not as delicious delivered. Not a shocker, but good to know.", "author": "Kateryna R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-05-10", "description": "Food is good. Thai cuisine. Generally acceptable. The drinks, though, were terrible. I ordered pino grigio, and could not finish it.  I probably wouldn't cook with it. My husband ordered a Manhattann, which traditionally has whiskey in it.  This did not. It was revolting. Even the cherry was gross.   However, the food made up for it.  I ordered glass noodle soup and mixed veggies - bok choi, American broccoli, and green beans - in garlic sause. I did not realize both dishes were vegan (usually not my thing) until later. But both were absolutley deliscious. My husband got pra ram chicken, which he said he'd eat it again. And finally the decor was nice (suitable for the area) and the wait staff were really good.", "author": "D P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-18", "description": "Cafe Chili is one of the better Thai options in an area oversaturated with the same type of food. The food is fresh, the flavors are consistent and they have yelp specials and happy hours. They're also open on thanksgiving", "author": "Raye S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-18", "description": "Stopped by after rock climbing in the area with my friends M.Y. and N.S.. We were looking for an open garden/backyard to enjoy the weather and some Thai food. We shared the papaya salad and then each got our own dishes. M.Y. opted for the Drunken Sea. The Drunken sea had a nice hit of spice to it and had a good amount of seafood. I got a quick taste of spice, salt, and seafood but nothing super notable as far as Thai food.\n\nN.S. ordered the panang curry which he enjoyed and I didn't get a taste of because he ate so quickly haha. I ordered the massaman curry because who doesn't love potato curry. It came out in a nice little metal bowl with a side of white jasmine rice. The curry itself had a nice ratio of potatoes, peanuts, onions, and chicken (you can choose another protein if you desire). The spice blend was good but could have been a little stronger in my opinion. Lord knows I don't do well with spice but it could have done with a little extra oomph in the taste department. Instead of that extra flavor, it ended up being much more salty than I like. While I eat a pretty healthy diet, I do like my salty snacks over my sweet ones but this hit the salt meter much too high up on the scale for me. \n\nOverall a three star because the place and service were great and my friends enjoyed their dishes. I just had a hard time with the salt level of mine. Would come again if they tone down the salt a little or if I want to try the Panang curry or Drunken Sea.", "author": "Caroline L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-21", "description": "This was a pleasant little surprise spot for a super quick lunch for me. I literally only had 30minutes for lunch and then had to run back to work.\n\nWell as soon as I walked in they sat me immediately and with a smile. I sat by their super fancy decorative booth. I thought it was an adorable decor choice in an otherwise small space that could easily lack style in decor.\n\nI was asked by the manager what I'd like to order , I told him...\"This is a super quick lunch...literally only 30 minutes! So I'd like the spicy basil shrimp fried rice, duck salad, spring rolls and Thai iced tea.\n\nNo lie folks that Food came out in about 7 minutes leaving me time to savor the food!!!! I was floored by the speed in service!!! Not only were they fast but the food was good too along with a great presentation!!!!\n\nYes I'd recommend this place and if I'm ever in the area I would be glad to go back again ;-)", "author": "Nzingha Z."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-12-16", "description": "Another underwhelming Thai restaurant in our neighborhood, if it wasn't for some surprise complimentary Spring Rolls when you checked-in on Yelp, I would definitely give this place less than 3 Stars!\n\nEverything that we ordered here is just similar to any Thai restaurant on any NYC street corner. Nothing's wrong but nothing's too special either, if maybe slightly better elsewhere.\n\nThe sole waitress in duty when we dined here for brunch was however genuinely friendly and attentive.", "author": "Reggie M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-22", "description": "The food was great. I ordered Drunken Noodles with shrimp and it was the perfect lunch for my solo dining. The Thai ice tea was a bit sweet for my liking but others may like it. \n\nThe ambience is great and it wasn't crowded at all. The waitress and manager (I think) were super polite and attentive. I'd definitely go here again. \n\nPS: They have a great lunch menu so get there before 3:30pm (I arrived at 3:25 lol)", "author": "Jimmika R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-03-09", "description": "Horrible, I will never go back! I had the worst papaya salad of my life...just a little lettuce, a couple of cherry tomatoes and papayas with a lot of salt, no flavor, no condiments, it was not even spicy.", "author": "Grazia S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-07", "description": "The service was good the food was great. My daughter said this is her new spot. She's 9 lol.", "author": "Tracy J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-23", "description": "We had party at Cafe Chili and it was well organized. The service is great. Ambiance is lovely. They have a garden in the back I might return for a dinner. Everyone enjoyed the food. I would return for dinner or lunch.", "author": "Meline V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-18", "description": "I love this place, especially for there lunch special!! For $8 you get a box filled with appetizers, salad, rice and a decent sized entree. The restaurant is never very crowded so the service is good. Also the quality of the food is very good. I would definitely recommend.", "author": "Carly G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-21", "description": "Good prices, good food, and I love the outdoor section too. The portions are pretty big, so I shared and we were both plenty full. Great bang for your buck and friendly service as well.", "author": "Adrianna J."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-01-22", "description": "Awesome lunch special. For $12 you choose a starter, lunch option, and a dessert they call \"go bananas\". We decided on splitting an order of the spring rolls and the \"bags of gold\". Although they were smaller portions, the presentation was top notch. Both dishes were crispy, but not greasy, and the sauces were a perfect pairing. \n\nThe entrees were pretty tasty but the sauce on the drunken noodles was too viscous. Probably too much corn starch. We tried our best to eat around the sauce but it was hard to ignore. \n\nThe \"go bananas\" dessert was so cute! They tucked little bananas in wonton wrappers topped with a chocolate sauce. \n\nCafe Chili nailed in on the service, starters, and atmosphere, but the main dishes left much to be desired.", "author": "Sara S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-01-04", "description": "If you like watching a waitress take other orders and run them while you're waiting for a container of soup to go...then it's great.", "author": "Sally R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-02-22", "description": "I can understand why this place has 3 stars Dont get me wrong, it's not awful nor did I have a bad experience ,but 4 stars seems too generous\n\nMy friend and I walked in and were a bit confused about where to sit since we didn't see a host or wait staff. A woman appeared from the back and gestured to a table and we happily sat. Well not so happily as the table wasn't exactly clean but i didn't make a big deal of it. I will say that the place is moderately priced as the appetizers  being at $6 and the main courses around $12.I was disappointed at the drink selections when I saw a lychee martini was made with sake......sake? All of the typical cocktails had sake listed instead of the usual gin or vodka as the main ingredient.  Outrageous if you ask me!\n\nService is pretty spotty. There was an older woman who was friendly but she kept disappearing for long stretches of time and there was a younger surly looking woman. The young one looked like she wanted to slap me when I requested salt. I mean was she the cook or is she dating the cook? I needed salt. I noticed everyone else had water glasses but my friend and I were never given water even when I made cow eyes at the grumpy young one as she refilled glasses at other tables  not even then did it click to bring us water.The chicken and shrimp dumpling wasn't very good or tasty, it was a chore to finish and if you know me you would know I typically demolish them.  My green curry was very spicy as I requested, (boy some water would have been great!) but it was more vegetables than rice and curry in my bowl so it wasn;t enjoyable and my friend;s basil rice lacked real flavor. My booze and dinner plans not really reached I asked for the check from Surly but I guess she forgot so we sat and waited. I told myself Yelp was spot on this time. 3/5!!", "author": "Ariel S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-08-24", "description": "First stop back in NYC after my Baltimore/DC trip. This was our contingency plan as the Thai place we normally go to was packed out. This place was a decent substitute. \n\nOur waitress had an extremely thick accent or speak impediment, I'm not really sure but she was difficult to understand. It did help that she was nice though.\n\nThe food was okay and I did enjoy the bubble tea that I ordered.\n\nMy only beef with this place was I ordered a bubble green tea to go and I got coconut, I didn't realize this until I was a few blocks away and took my first sip. I didn't feel like going back and I really didn't care for the coconut. So that kinda sucked.\n\nOther then that it's a decent spot.", "author": "Wanda W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-04", "description": "This is my favorite authentic Thai foods. Curry is very nice. The owner is very friendly and comes to talk to me. I would suggest people who love Thai foods to try this restaurant.", "author": "March S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-02", "description": "After going to the horrible and rude Thai place called lemongrass, I walked a little further and reached this very pretty restaurant. The gentleman walked over to me in such a kind way and offered me a seat, but I was taking out, he then handed me a menu and said have a seat. While I was looking he brought over a glass of water which I thought was very thoughtful. Then proceeded to hand me a buy 6 lunch special card and get 1 free. Not to mention the food is absolutely delicious and the rest of the staff is also very nice. I'm so happy I ran into this place.", "author": "Jennifer G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-24", "description": "I held my friend's bridal shower here in the back garden and it was fantastic!  The wooden wall and flowers matched our theme perfectly. Jett and Apple helped us with everything and they were so nice and sweet.  The food was very good, especially the spare ribs and fried rice.  I had a thai ice tea and it was very tasty as well. Will definitely love to come back. Thank you again.", "author": "Anna L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-02-20", "description": "This place use to be the bomb but after some years the service and the food quality has gone down drastically. I've tried almost everything on the menu and i use to come here religiously after i would go to the movies. It is a good snack to have if you want a quick bite. The ambiance is also nice as well. but if you want to impress someone on a date this will not be the place. Not anymore.", "author": "Racquel N."}], "servesCuisine": "Thai", "priceRange": "$11-30", "name": "Cafe Chili", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "172 Court St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/iIK6_7Yxje77gJCD1dtsBQ/ls.jpg", "@type": "Restaurant", "telephone": "+17182600066"}