{"aggregateRating": {"reviewCount": 143, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-22", "description": "Yummy pad thai. Not overly saucy, which is just how I like it. Drunken noodles are also good. \n\nMy favorite thai place is in the Slope, but this will do for the Heights...", "author": "elizabeth a."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-07-12", "description": "If you're a masochist, you will absolutely love this place. \n\nThe food and service are bland and painful. \n\nGo up the street to Lemongrass Grill instead.", "author": "Junior T."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-11-27", "description": "One of the worst Thai food I've ever had in a long time.\n\nI had Volcano chicken and Drunken noodles for my hubs to go. Mine was dry yellow pieces of leather with sweet, watery sauce on the side, while his was NOT AT ALL like Drunken noodles should be. More like a very BLAND pad see yu. Usually I go to Joya, but I wanted to try a new place. Plus they charge extra for brown rice and that was the only thing tasty about it. duh~ I take my hunger seriously. I get upset when my hunger is wasted on boring, horribly done food. I highly question if this place really know how to make Thai food.\n\nPlease, Cafe Chili, get yourself a new chef. : (", "author": "Julee K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-05", "description": "First of all, the food is amazing. They have chicken pra ram that is my favorite in all of NYC. It is fried to perfection and tastes like the perfect mix of decadence and dinner! LOVE IT! Secondly, the service is incredible. They are extremely attentive, so so nice, and extremely accommodating. You can tell the staff has been well trained and cares about each individual table. They let us sit chatting for hours and didn't give us the side eye or force us out--in fact, they kept coming over and refilling our water--exactly as it should be! Can't say enough nice things about this restaurant. I've sat outside in the courtyard and inside in the adorable decor and really enjoy both spaces. I highly recommend this place to anyone looking for quality Thai Food in Carroll Gardens.", "author": "Marlena H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-26", "description": "I usually wind up here for lunch, and they have a great bento box special for lunch.", "author": "Daniel C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-14", "description": "I'm beginning to think Yelpers are the pickiest, most high maintenance people on the planet with their impossible expectations.  I find the reviews of Cafe Chili unfair.  Will you have THE best meal of your entire life here?  No.   What you will get is a reasonably tasty meal at a very affordable price with service that is not only efficient, but genuinely friendly.  I have eaten here multiple times and I have never been disappointed with the varied menu and flavorful food.", "author": "Patti M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-11-28", "description": "I've usually had wonderful food here (delivery only) and I am extremely disappointed. I've called 3 times, they're almost a half an hour late and I still don't have my food. Too bad-lost a loyal customer.", "author": "Rebecca B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-20", "description": "Just had dinner here. Loved it! 3$ Thai beer;half off appetizers. Food was delicious. I had the chicken pad Thai. Awesome. Quite. And great service! I will definitely be back", "author": "Omi H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-13", "description": "Very cozy atmosphere and the drinks are priced the same as any thai restaurant but this place is great if you're trying to munch. All about the food, twas yummy and the service was good.", "author": "Crisy N."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-08-16", "description": "This wasn't where I'd intended on going for dinner, but since where I had planned on going closes at the unreasonable hour of 9pm, I ended up here. I was attracted by the really nice decor. I overheard the people who were getting seated right before me also commenting on how 'pretty' it was. Also, the prices were reasonable, and the take-away menus outside had 15% off coupons on them - so, looked good to me!\n\nI got the \"pretty package\" appetizer, which was shumai-style shrimp and chicken dumplings, with a soy-based dipping sauce. Tasty, but extra points for nice presentation, arranged on a platter with carrot flowers and shredded beets.\nAs an entree I got chicken penang curry. I asked for pineapples in it, since they weren't listed on the menu, and got them added in - at no additional charge! The curry had a nice, thick, rich sauce, and was good. \n\nI wouldn't necessarily travel out of my way to come here - I have equivalently good Thai places closer to me - but if in the neighborhood, I would eat here again.", "author": "Althea A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-04-23", "description": "Ordered here from seamless app and got 20% off so that was a definite plus. I got the lunch special Kee Mao with Chicken and a Thai salad. The salad was yummy and they gave a good amount of dressing on the side so I was happy with that. Unfortunately the Kee Mao was a bit on the dry side. The portion was also a bit small and everything seemed haphazardly prepared. I am glad I tried this place once since it is in my work hood, but I don't see myself coming back.", "author": "Cynthia M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-10-07", "description": "After walking around the fringes of DUMBO on a Sunday, it was around 9PM and we were stylishly starving and started walking past the lunch-on-the-go's and fast food restaurants on Court St. \n\nAs lack of strength precipitated by lack of nourishment would have it, we decided to sit and chat here.\n\nSince I usually order a bunch of appetizers instead of entrees, we divided and conquered a array of the usual, steamed vegetable dumplings, and the unusual, Cilantro Corn Critters and Pan Seared Thai Vegetable Pancakes.\n\nThe food was pretty good, but I don't think it warranted any attention that seems as polarized in some of these reviews. However, the space itself was really nice, conducive for good conversation, and the service was exceptionally attentive and the waiters were incredibly sweet. I think we left a 25% tip. Good stuff.", "author": "Kendra C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-05-23", "description": "I like Thai chili alot, really a 3.5 stars, they have a cute spot, great customer service, good good to very good and reasonable proves. Their appetizers are to die for.", "author": "Caterina M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-08-15", "description": "The interior is not very nice, the waitress had to reach over the table to bring me anything because of the lack of space. The food was dismal, I got beef pad thai. The beef was dry. The prices are what you would expect. It took 30 minutes to get our check after we all finished eating.", "author": "Allen A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-06", "description": "Very reasonably priced at $8 each for dinner- we had the Pad Thai and the Chicken Green Curry.   Both were very good... the default spice level is pretty low, so you may have to ask for extra chili.  We also had the Green Papaya salad- it's definitely been toned down for American palates and didn't come with chili or fermented crab, but has the right seasonings.  Thai Iced Tea hit the spot.\n\nThe atmosphere is great for conversation and the service was good\n\nWould eat there again", "author": "Dorothy C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-01-22", "description": "Cafe Chili's decor says all Ikea everything. Multi-colored satin pillows on the eating sofas, soft tea lights, even softer fake flowers, beads dangling from the ceiling and light fixtures made mostly out of paper. It's cozy and cute. I used to really like the food here but my last visit (and the one before it) wasn't so great. Coconut shrimp appetizer was over cooked and the shrimps tasted like gourmet, frozen goodies from the Trader Joe's on the corner. A crab cake appetizer was left in the grease so long that the cakes were half burned and the garlic mayo drizzle tasted like plain old Hellman's. My pad Thai with shrimp was full of shrimp, onions, scallions and other goodies but the chopped peanuts were overkill and the noodles were undercooked. Sodas are served in really tall glasses and the staff is nice. Boyfriend loved his chicken fried rice. I'll give Cafe Chili another try again but not anytime soon.", "author": "Tanya R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-06-01", "description": "I end up here when Joya is too packed for me to deal with.  BUT, the food I've ordered is pretty good.  The service is great, everyone who works there is super nice.\n\nI usually go with the same thing - app = pretty package (bc the name cracks me up, I know, I'm 12).  It's a yummy steamed chicken/shrimp wonton thing.  \nEntree = basil chicken.  Keep it simple.  I usually ask them to make it spicy as nothing here is.\nIf I'm feeling soupy - salmon lemongrass.  Trust me.  Big chunks of salmon and a nice lemongrass kick.  Sooo good.\n\nI've been here or delivered quite a few times now that I think about it and can only speak to the items above.  Once I got fancy and ordered Panang Curry and a friend got the Drunken Noodles.  The DN was meeeehh but I do NOT recommend the curry.  It was gross. \n\nSo....to wrap it up - if you feel like salmon lemongrass soup and basil chicken and ordering something called \"pretty package\" - this is your place.   Other than that you may want to keep it movin'.", "author": "Monks C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-02-18", "description": "I've been there twice and both times were in the afternoon so it wasn't ever crowded. The food is delivered quickly eough, but nothing really stands out. The presentation is okay, taste and selection all are OK. Decent spot to go to if you happen to be on court street and you're hungry enough. The decor and music selection however is interesting. Very...pretty. It makes you want to stick around.\nPS: take advantage of the lunch special.", "author": "Sam D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-02-16", "description": "This place probably has some of the worst thai food I have ever tried. Our food tasted like leftovers that had been reheated in the microwave numerous times. We thought of at least ordering ice cream to end our dinner on a good note (let's face it - its hard to screw up ice cream) but weren't even given a chance to order as, apparently, they don't offer dessert. Aside from that, the service was far from great and my friend and I got charged for an item that we didn't even order! Will not be back. Especially considering the other yummy thai alternatives in the area.", "author": "Monica Z."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-04-22", "description": "The service is VERY nice.\n\nBut the food is terrible. Wouldn't go back.", "author": "cate y."}], "servesCuisine": "Thai", "priceRange": "$11-30", "name": "Cafe Chili", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "172 Court St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/iIK6_7Yxje77gJCD1dtsBQ/ls.jpg", "@type": "Restaurant", "telephone": "+17182600066"}