{"aggregateRating": {"reviewCount": 326, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-04-20", "description": "Generic addition to usually interesting Fort Greene bar/restaurant scene, this was a disappointment when it finally opened (after an endless renovation of the space, which once housed a hideous bodega.) However, like the colorless bagel shop next door, I suppose it fills some sort of void.", "author": "David C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-27", "description": "only came once (THAT'S WHAT SHE SAID!), but had a good time.  i had a veggie burger w/sweet potato fries. the fries were pretty great - they came with some sort of cranberry compote. burger was good too.\n\nAND i had a peppermint pattie, which made me feel lame yet sophisticated.", "author": "Ms J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-27", "description": "I like this bar as an afterwork spot.  It's loud and the drinks are good.  So the far the food is not disappointing.", "author": "Nathasha P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-03-22", "description": "I love Mullanes. It's the perfect bar because it's a sports bar that I\ncan take my non-sports friends to, it's laid back, has great food (the\nburgers in particular are amazing!) and an awesome beer selection. The\nbest part about Mullanes is Todd, the bartender. He always remembers\nme, he refills my beer just after I've taken my last sip, he's\nfriendly without being nosy and he gives the bar a very inviting\n'Cheers' feel. He's knowledgeable about everything on the menu and\namazingly manages to remain calm and attentive even when the bar is\ncrowded. Todd's relaxed, funny personality creates the perfect\nambiance at Mullanes.", "author": "Zoe T."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-06-08", "description": "I'll start with the good: Decent beer selection, passable food, lovely outdoor seating area. Unfortunately I'm done with this place after my recent experience getting takeout. Paid the hostess (her first name began with an N, according to the check) with a credit card and drank a beer while I waited for my food. And waited. And waited. It's not like the place was mobbed and they were just that busy. After waiting 40 minutes I went to find the hostess...and my food is sitting right there at the hostess station. Who knows how long it had been sitting there. I grab it and leave, disgusted. Maybe she was angry I didn't tip her (for takeout?) Would it have been too much to tell me the food was ready, even if she didn't bring it over? Or does it really take them 40 minutes to cook two burgers? I don't know who's to blame and I don't care. But I know there are too many other options in the neighborhood to settle for that kind of service.", "author": "Dan S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-20", "description": "I have been here before but this last time I truly had a great experience. There were six of us and we were able to score a table in the back to watch the Jets playoff game. Vinny the host was magnificient and super friendly, nice guy. Two of us arrived and four more were coming but were stuck traffic then had to find parking . They arrived about 20 minutes later which was fine but the owner was a bit annoying by coming over and saying if they don't show up soon you have to give up the table to which we replied we would gladly cover their $15 minimum which they impose on tables near the big screen which isn't a lot of $$ considering you can stay for the whole game without harassment. Once we told him this things lightened up and all was fine. At first the sound was ridiculously loud and quite offensive. You had to scream to carry on a conversation and someone else must have complained because after halftime the volume was perfect and so was my headache which had disappeared after taking super motrin. The food was really delicious. We had everything from appetizers to entrees to desserts. Nothing was bad and the service was friendly and also very good. Never waited long for anything and our waitress seemed to appear whenever we needed her. The muffins they give to you when you sit are fantastic and made on the premises. Everything was sooo fresh. The crowd was friendly and down to earth and we all agreed we had a super time. In fact, we had such a good time we're going back this week too!\n\nOkay we went back for the second time and I have to say... same great service, same great food, same great crowd.", "author": "Denise D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-04-24", "description": "I read some of the reviews about this place and it turns my stomach.  One said the burgers have no taste.  I'm sorry!  This place has some of the best burgers in bk. And there's like 10 different choices of burgers to try.  I have been coming to this place since it opened.  The owners and staff have never been anything but super-friendly to me. I bring my friends and family here all the time because I know it's gonna be a blast.  They have about 20 beers on bottle and a very versatile draft beer selection.  The prices are great, and the happy hour is even better.  Come to this place for good food/drinks/times.", "author": "Mike J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-10-21", "description": "As a newly-minted \"local,\" Mullane's is my go-to bar for Sunday NFL-watching. The staff couldn't be friendlier -- they recognized me by the second time I came, and shhh, they do buybacks. Always a great, mixed crowd, and good vibes all around. The beer selection is solid, and the burgers are better than I'd expected. An unpretentious neighborhood joint to hang out in for indefinite periods of time.", "author": "Adam K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2009-10-01", "description": "I literally just made a yelp account so I could give this place the least amount of stars possible. I ordered a Shepard's pie for delivery. When it showed up they charged me $4 more than the price on their web-site menu for the worst shepard's pie i've ever eaten. Spent almost $20 for instant potatos and ground beef. AVOID THIS PLACE! I'll never go back.", "author": "chris r."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2008-09-26", "description": "Nice decor, clean, cozy, etc. etc. In my opinion, not a lot of character. I must admit, despite other reviews - dangerously bad service. And they were out of the beer I wanted. Conveniently located, but maybe a few steps further is better.", "author": "Jacqueline K."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-07-05", "description": "The food was okay, the service was better, but the overall experience isn't anything to rave about.", "author": "Monet S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2010-10-09", "description": "Couldn't be more rude!  Service was terrible.  Which is a shame since the layout is great and they have a solid beer offering.", "author": "Stacey S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-12-29", "description": "Cant be mad at this place at all.  One if the first places I happened to patronize since I've moved back to the Fort Green neighborhood.  Decent amount of draughts on tap (Blue Point, Brooklyn etc)  Most importantly Brooklyn.  Pleasantly surprised by the Sliders, mini Taco's, BBQ Wings, and Buffalo Mac \u0026 Cheese.  A ton of Hi Def TV's line the bar from begining to end, and a huge Projector screen in the back for the folks seated for dinner.  If your a fan of sports, like good beer, decent bar food, and good atmosphere.  You cant go  wrong here.  Manager and staff/bartenders and waiters seemed very friendly, and down to earth.  Nice place to fall back, have a few beers, watch the game, and munch on some decent bar good.", "author": "Duane A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2008-01-08", "description": "I started going here during the NFL playoffs last year.  I was hoping there would be some fellow pats fans as I had spotted some Pats caps  around the neighborhood.  However, I made the mistake of going to the Pats/Colts game despite the utter hatred Jets fans have for the Pats and blind allegiances they have towards anyone with the last name Manning.\n  Needless to say there were only a couple other intrepid Pats fans there and they kept to themselves but the Jets fans were more lively (but not as obnoxious as Yankees fans) and until I got drunk off of the mediocre beer selection and the Pat's total meltdown I had a pretty good time.\n  I go to sports bars either for the camaraderie of having other people around rooting for the same team or to have a good back and forth with the enemy's supporters.  Mullane's more often than not leads to the latter, although I've met a few local Boston fans over the last year.\n  The crowd is unpredictable here in terms of size and sports to food ratio but even when it's crowded it tends to be pretty subdued, except for the those damn Yankees fans.\n  The food here is hit or miss but it's consistently too expensive.  I agree with the other reviewer who said the horseradish burger was bland.  I'm pretty sure it was just mayonnaise.  The seasonal summer salads were quitegood and the some of the entrees and most of the soups are good enough to fill time between plays but I never go here for the food unless it's late and I'm starving.  There's next to nothing on the menu that wouldn't be just as easy to make at home and for the price it's just not worth it.\n  The brunch is a little better, and on par with the price in the rest of the area.  Their special Eggs Benedict with asparagus and some other random stuff was pretty tasty.  The bloody marys are on the small side and without fresh cracked pepper, but they're pretty strong and spicy.  (i guess that's where all the horseradish went)\n  The bartenders are nice guys but do occasionally get distracted by chatting with the regulars.\n  Overall a solid 3 stars.", "author": "Evan G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-05-30", "description": "this is the kinda place that you dont necessarily want to like, but you end up doing it anyway. after a long morning of apartment searching in fort greene, my friend and i stopped in for lunch and a re-charge.\n\nour waitress and the manager were super friendly. food was fast and tasty. and, here's where an additional star gets thrown in, i had four flat screens to choose from to watch the mets game.", "author": "Mackinnon W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2009-10-23", "description": "this place is so annoying. too many rules. the outdoor area take for example where you can now only sit there if you are eating. honestly, if you think about it, you are more likely going to have a bigger check if you let people sit there for hours on end after a summer friday than you will for 1 app, 2 meals, and 2 drinks each. I don't know. This place is just really contrived and crappy. . . but it's the only sports bar in the area so I guess that's worthy of a star?", "author": "Jackie D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-02-13", "description": "This place is ok-- pretty typical bar food, nothing special whatsoever.  I ordered the Black and Blue burger, which had more bleu cheese than beef-- it was a bit hard to get down.  My friend ordered the chopped steak, expecting to get just that-- steak, but when it arrived, it was actually meatloaf.  The service was fine and the ambiance was your typical bar and grill atmosphere but this food is pretty average to mediocre.", "author": "L S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-04-26", "description": "i need to go out and drink more often, because this is the perfect \"morning-after\" brunch place. good coffee, friendly waitstaff, a fabulous cheeseburger--what more can you ask?", "author": "Sara N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-10-17", "description": "Great sports bar. They work hard to accommodate out-of-town fans as well as fans of local teams. The food is reliably decent bar food.", "author": "Jenny M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-11-04", "description": "Came here on a Monday night to watch the game thinking that since it's a \"Sports bar\" they would be playing it. They had it on the TV, but they played music instead of turning up the sound! However, the onion rings were amazing- huge rings w/ the perfect amount of breading (the onion doesn't just fall out like what often happens with the big ones). The turkey burger was juicy and a decent size.  Prices are ok for the bar food, but way too much for the entrees (personally I'll never pay $17 for anything at a sports bar). But our waiter was very friendly and attentive, so overall it's a good place to go. Just be prepared to follow the game without hearing the commentary.", "author": "Davi H."}], "servesCuisine": "American (Traditional)", "priceRange": "$11-30", "name": "Mullanes Bar \u0026 Grill", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "71 Lafayette Ave", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/x77IccjKjR3Q3FgSeypIPA/ls.jpg", "@type": "Restaurant", "telephone": "+17187977606"}