{"aggregateRating": {"reviewCount": 326, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-09-29", "description": "the only reason this lovely place is getting a 3 star review is because I so happened to go for brunch a day that the Giants were playing and between when we arrived and left the service and overall experience went from great to alright.\n  First off, the locale itself is very charming in a gastro-pub kind of way. We happened to go for brunch and the menu they had and what we ultimately ended up eating (breakfast burrito, benny's special breakfast, and crepes) were fantastic and totally hit the spot. They also bring you some great bread and muffins while you wait. \n  The service was attentive but slowly decreased as the loudness of the place went up (we got there right before the game and left after it had started). \nI would want to go back either for lunch or for dinner to see how different the atmosphere is, but regardless, we had a good time and it' was def a good place!", "author": "Sofia H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-06-08", "description": "If you're looking to watch the game, grab a beer and a burger this place is a great pick. The crowd is usually a good mixed group of people. The food is decent and the kitchen stays open late. The drinks on the other hand aren't so great. I ordered an old fashioned and it came out looking like fruit punch...I say stick to the beers.", "author": "Terry N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-31", "description": "nice sports bar, late kitchen, roomy.  the basic pleasing details.   enjoyed the food and drink selection.  while I have a nostalgic attachment to nearby Mo's(formerly Moe's), i cant get with this.  Not a single bar type of place, more of a drink with your buddies, informal date thing.", "author": "Jean L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-10-26", "description": "A fine sports bar as far as Fort Greene goes. $3 high life to a $7 duvel. \n\nFood is decent.\n\nWould only go to catch a game, but since leaving the area I don't see myself going out of my way.", "author": "Blake M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-05-27", "description": "Holy Apple Salad. I went to this place for the first time yesterday and lemme tell you something, they know what they're doing over there. It was quite possibly the best salad I've ever tasted...crumbly blue, green apple slices, walnuts and raisins, on a bed of lettuce with raspberry vinaigrette on the side...oooh wee!\n\nI happened in the place again that evening [my high school is there, I had a concert etc.] and got some burgers put in front of me. Burgers with cheddar and swiss topped with sweet sauteed onions. The delicious factor raised about a thousand with the side of sweet potato fries. I mean c'mon. GO to this place!", "author": "La Toya L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-05-10", "description": "I liked Mullanes at first - the bartenders were friendly, the food was fine, it was a good place to chill and watch a game (I don't have a TV at home).  \n\nThen there was a game I particularly wanted to see, and I stopped in an hour beforehand to make sure they would be showing it.  If not, I had time to hop on the subway and go to another bar further away I could be sure was showing it.  The bartender hesitated, but finally said okay.\n\nI came back, only to be told that all eight or so screens were spoken for.  The bartender I spoke to had finished his shift and gone home.  \n\nI tried to let bygones be bygones and went back once, but I just don't feel comfortable there anymore.  I know it's due to the carelessness of only one bartender that I feel that way - the others have been fine - but I've decided to find another sports bar, subway ride or no.", "author": "Jojo C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-21", "description": "Went there for a late lunch on Saturday.  Had the Benny's special poached eggs. Loved it. Really well done with a nice mix of flavors", "author": "Tony L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-11-04", "description": "Great bar/restaurant for a beer and a burger.  The place is pretty decent-sized, and in the summer has great outside patio seating.  If you go to early and get seated in the back alone, it can feel a little cold... but in the end it's good food and with good people and drinks, you can't go wrong.", "author": "Marcus Z."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-12-15", "description": "Great place to go out for a drinks and a burger...a veggie burger that is :) Its nothing great or fancy but the food is good. Like I said I usually get the veggie burger with sweet potato fries at night and if I go during the day I get the Portobello, red pepper puree, tomato, and blue cheese (I sub goat cheese) sandwich, both sandwiches are great! Drinks and food are reasonably priced. The servers are always nice and usually on point. I dig it.", "author": "Amber W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-05", "description": "This place is down the street from me....and when I cannot think of anywhere else to take visiting friends or family, this place never fails.  Drinks are good, atmosphere is pleasant...food is good.  Definitely love during the spring and summer when can sit outside and people watch the trendy brooklyners walk around while eating...", "author": "Justin H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-11-02", "description": "Incredibly rude manager; I'll never come here again after years of frequenting this bar. I've brought in probably $500 of business for this bar over the last several weeks during the Mets postseason, friends, family, co-workers, for dinner and drinks ~3x a week. I stopped in for the last inning of a game last night, my friends ordered beers, and I didn't immediately order anything. The manager told me I would have to order a drink immediately or else I couldn't watch the game - in a packed bar, with tons of people nursing a drink or not drinking and just wanting to watch the last few minutes of the game. I explained how much business I'd brought in, that I was a regular customer and all his employees recognized me instantly. He said it didn't matter and threatened to kick me out of the bar. Easily the rudest service I've experienced in decades of living in New York City. He just gave up tons of $ in business for a $7 drink. I was appalled. The food is awful too - nearly raw burgers. Never again.", "author": "Eliza S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2010-04-04", "description": "After not making it into another local place before their kitchen closed, my girlfriend and I decided to just walk around and find a place and grab a burger. Big mistake.\n\nThe burger was terrible. Meat was dry and utterly flavorless. Even the pickle was no good. \n\nAlso, it was one of those nights where everyone in the restaurant besides you is the most bizarre outlandish caricature of themselves humanly possible. You know what I mean right? It's unfortunate that I have to make a judgment on the clientele and not the place, but that's how it is. \n\nThe only star I'm giving here is because the waitress was capable and attentive. Ask me my opinion in person and I can give you all you need to know with a simple facial expression.", "author": "Brandon S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-25", "description": "Mullanes is a cool place. Usually has a pretty solid mix of people. They have plenty of TV's so it's a good place to watch a game, and they have a decent beer selection. The food is solid. It's not spectacular, but I've never been disappointed. Plus it's in Fort Greene, which is a pretty chill neighborhood. I go to Mullanes about once a week.", "author": "Jon C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2010-07-05", "description": "Had attended this place several times for the hamburguer but the two most recent experiences with the waiters made us not come back ever again. \nWill just relate the most recent one. Arrived on Monday night at 10:30 pm and were 2 people. Wanted to seat in a table for four since they were only 2 tables taken out of 10 in the rear. We were forced to sit in a two seater since we were not expecting anyone else. I really doubted that the place would get full for dinner at that time, but still agreed.\nWhen a spanish speaking waiter came pour water I told him that it sounded completely irrational where we were forced to seat given the space availability and the time frame, to what he replied that I shouldn't have said so to the first attendant!\nI guess this new unexperienced waiters have completely forgotten the first rule you are taught (I work in a client related field)... the customer is always right.\nToo bad Mullanes, will just walk a hundred extra feet and keep having good experiences in 67 burguer.", "author": "jenmac m."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-04-07", "description": "I'm really partial to Mullane's. I've been here a few times on different nights. The food is ok. Some nights the service is awesome and others the service is ordinary. Last time I was here the waitress was extraordinary. She made sure the drinks were flowing and strong. It's a neighborhood staple so I'd definitely recommend it. Worth a try.", "author": "Sonny A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-03", "description": "Great sports bar to watch the games. Great place to get dinner and relax. Go with one person or a group, works either way. The food is consistently great. They have amazing mac and cheese. The chicken wings are awesome. All the burgers are good. Happy hour offers a dollar off beers. They also put out a small tray of free food during happy hour. I love it here.", "author": "Chris G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-04-17", "description": "Good local sports bar with some decent food options. I recommend the Elliot burger with some fries and a cold beer. That will get you through the game!", "author": "Zach K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-01-09", "description": "Totally solid.  I went for brunch so the place was not too busy.  I had chili topped with onions and cheddar cheese and served with tortilla chips.  It was nicely spicy and filling.  Cheese wasn't melted on the top but rather grated and cold, which kind of irked me.  Service was nice enough and the food came quickly, which is always good.  In sum, I wouldn't go out of my way to go back, but if I were in the neighborhood or suggested to me I would be down.", "author": "shibbie l."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-15", "description": "We've been coming here are a pretty regular basis since we lived in Fort Greene. Is it going to blow your mind? No. Is it going to satisfy your need for constant hipster trendiness? No. But it is consistent, the staff are nice, and it's a great place to watch a game. We're Red Sox fans and they're always happy to put the game on for us. The food is pub food, but probably above average. Taco rolls and nachos are yummy. Turkey burger is awesome. Late night menu is a must if you're rolling in at 1 AM and everything else is closed. Brunch is decent. Their happy hour is not bad, especially the can of rolling rock and shot of wild turkey honey for $6.", "author": "Nathan H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-02-16", "description": "Mullane's. I have spent so much money on you! Your sesame ginger wings (well done, please) make me so happy. But what's up with the unfriendly signs? The one up yesterday said \"there will be two seatings on sunday...\" with the times for the two playoff games and a big \"$20 minimum per patron per game\" bit. Well not one...there were like a dozen of this same sign all over the bar. Your bar is packed for games. Your happy hour is meh. If a couple of people don't spend quite as much as others...tough. You're a sports bar. In the friendliest and most wonderful nabe in the city. Don't be unfriendly. That is super lame.", "author": "Vanessa H."}], "servesCuisine": "American (Traditional)", "priceRange": "$11-30", "name": "Mullanes Bar \u0026 Grill", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "71 Lafayette Ave", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/x77IccjKjR3Q3FgSeypIPA/ls.jpg", "@type": "Restaurant", "telephone": "+17187977606"}