{"aggregateRating": {"reviewCount": 326, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-18", "description": "This is my 2nd time grabbing something to eat and meet up with friends here. And let me tell you the chicken wings are delicious. Bartender took our order because we ended up going around lunch. \n\nThe host was really sweet and gave us the option to decide where we wanted to sit", "author": "Jenn M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-07", "description": "We have finally found our burger/bar spot! Not only is it conveniently located close to our home, but we had left this place beaming.\n\nService: the server was nice and attentive. She took our orders as soon as she was free with other people. A few minutes after we got our meal she checked with us.\n\nFood: we ordered the bacon burgers with some additions and they were spectacular!!! The meat taste was great, the fries were seasoned and delicious, the bacon was crispy and crunchy, and the rest of the toppings were perfect. I honestly have nothing negative to say about the food; quite the contrary.\nThe size and the portions were generous, so you're getting a lot of bang for your buck.\n\nPlace \u0026 ambiance: there's a very nice outdoor seating area in front of the place, and it adds to the charm, especially on a sunny spring day such as today. There's also plenty of seats inside. \n\nI recommend trying the burgers! They have tons of options at decent pricing. Unfortunately we were in a hurry and couldn't try other things, but we'll make this our usual cheat meal spot.", "author": "Carla T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-01-19", "description": "Came here for my mother's birthday. Apparently this is one of her favorite spots. We were there during happy hour. \nAs a group we ordered the Ginger Chicken Wings for an appetizer. For entrees we ordered the Salmon Platter with a side of Mashed Potatoes and Broccoli; A Cheeseburger with Steak Fries; and the 2 Cheeseburger Sliders with Skinny Fries (my order) \n\nThe wings were very good, and the sauce they were surrounded by was good, but it was if they placed the sauce in the plate and the cook wings on top vs. tossing the wings in the sauce. Unfortunately this meant the wings tasted kind of plain, and there wasn't enough sauce to really in the wings in. \n\nMy mother enjoyed the salmon, the portion was huge, enough for her to make a breakfast with it in the morning the next day. My sliders were also really good and my niece seemed to enjoy her food too. \n\nIn terms of service, the persons delivering the food/assisting the waitress were very attentive. Our waitress however while social and pleasant, seemed distracted and made quite a few minor errors during the service. More than once we had to find her to request something, and she inadvertently included a tip on our check when apparently that's only reserved for larger parties.. if it hadn't been for me requesting an itemized bill, I wouldn't have caught it and I had tipped her on top of the included tip. Later she explained that she noticed her error so  didn't charge me the additional tip, but not before I contacted the manager to try to get it reversed. Naturally if she'd let me know her error and corrective action I never would have spoken to the manager. That was the type of minor errors/miscommunication things that happened with our particular waitress.. I just chalk it up to her being new, but I don't know.. \n\nOverall the experience was cool, the food was good (wings coulda been better but even kinda plain they we're delicious) and I would definitely go back.", "author": "Kenya K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-05-26", "description": "It was pretty cool, my client and I had breakfast. Well she had turkey burger with fries. I had the banana pancakes which were good. We also had mimosas not the special, that was also good. The service was pretty good, it was very early around 11 am. It wasn't crowded at all at this time.", "author": "Kashiro W."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-10-17", "description": "I was very disappointed with my visit to this restaurant.  First off, parking is horrendous.  I guess they mostly cater to the neighborhood locals.\n\nThe second clue should have been at 5:30 p.m. , my friend and I were the only patrons in the restaurant, besides a group of guys at the bar having beers.  I dont know why took over 40 minutes for our order to come.\n\nI ordered the chopped smoke chicken which was delicious.  My sides were the baked beans and mac and cheese.  The baked beans was nothing spectacular.  They probably opened a can of beans and not add any additional seasoning.  The mac and cheese look and tasted like canned liquid cheese was used.\n\nI cannot understand how people go to the expense to open a business and not put TLC into the food.\n\nAnyway, that was my last visit to this restaurant.", "author": "Denise W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-20", "description": "I'm a sucker for bars-- especially those that are dimly lit and lend to conversations. This was my second time at Mullanes, the first time being late last year with friends visiting from the West Coast. Perfect place for a nightcap, and it didn't fail this time either.\n\nAesthetics/Ambiance: Low lit, sports-bar style, music can be a bit loud hence the half star demotion. The space is quite large though, with space in the back away from the bar for a little more privacy which is where my boys and I were. \n\nService: Yuliet was her name I believe. She was sweet and capable. No real complaints. Just a heads up that it you do decide to sit in the back, ordering may be a bit more of a task. Food came relatively quickly though, so that makes up for that. \n\nFood and Drink: I had a Dark and Stormy that I ordered prior to my boys arriving, which is my other half star demotion, leading to a solid 4. It's not that it was bad, I've just had a lot better. So blame my rapidly maturing palate. \nI had an order of mozzarella sticks: cheesy, well fried. Contentment. D had the Trio: rolled chicken tacos, cheese sticks, and buffalo chicken; as well an order of nachos. Jay had the veggie burger, being vegan and all. I don't know how I got roped into being friends with a vegan, but there you have it. They both enjoyed their meals so that makes for a happy MarieM. \n\nAs always-- happy eating and drinking. MarieMG", "author": "Marie-Madeleine G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-13", "description": "They have the basics- but compare to the few pub spots I've been to, Mullanes kind of steps it up a notch with some of their bar food.  \n\nEven from a block away, you could see Mullanes' red frame. Spacious layout, sizable Bar hooked up with high tables/stools, Dining area in the back with Brick walls here and there. There were a couple of decent menu items, but kept it low key for a late night. \n\nSeasony Mozzarella Sticks had a crunchy outside and gooey inside. My 'Green Tea' Cocktail tasted good, had some strength with Whiskey, Iced Tea and Peach Schnapps- but was overwhelmed with ice. \n\nReally liked my Salmon Burger and went with just lettuce, tomato and raw onions. Originally, my Salmon Burger came with a House or Caesar Salad side- but opted out of those and eyed the Cinnamon dusted, Sweet Potato Fries- instead. Our server Julie, substituted that quick- at no charge. Thank you! Oh... and the Cinnamon-Mango Chutney for my Fries? Ruled that night!!!\n\nMy husband went for a Bleu Cheese burger and said was good. Quick midnight meal here was good and can't complain about much. But I get it, you're not coming here for a gastronomic experience. Our server was pleasant, all smiles and accommodating to my ways- definitely a 5 Star for her. Just wish cocktails weren't drenched in ice- that's all. It's a 3 \u0026 a 1/2 for me. In any case, Mullanes is a really nice neighborhood joint for a super quick midnight fix.", "author": "Mercedes C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-23", "description": "The servers and bartenders here are always pleasant and the drinks are decently priced considering how close it is to the Barclays center. I came in and had a Taco salad the other night which was quite filling. The server constantly came over to check on us and made sure we had everything we needed. If i'm in the neighborhood, I would definitely stop by for a drink and catch a game.", "author": "Elizabeth M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-03", "description": "Turkey burgers as AMAZING! it's always so super hard to find a place that makes good turkey burgers that don't taste like card board. Drinks are on POINT! Fun atmosphere in the front and in the back. This is more than a great neighborhood hangout spot, the food is actually DELICIOUS. \nDRINKS gets you feeling NICE! \nI am giving this place 6 stars!!!\n I would give it more but they need to step their game up on the french fríes. Lol Everything else is GREAT!", "author": "Lady B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-14", "description": "This bar is the place where my friends hang out after exams! The staff here are more than friendly and you always will feel welcome. There is always space here to sit and chat. \n\nThe go-to dish here is the mac n' cheese. I recommend adding the bacon for that extra crunch. I am also itching to try the shephard's pie next time. \n\nThe one downside when I was here was that the service was a bit slow at times. We would be waiting for the last dish or we would be waiting for our change so we can leave. \n\nJust to note: if you are in a large group, they can split the bill but they can only accept five cards. The rest will have to pay in cash or split it amongst themselves. \n\nOverall it is a great bar to hang and talk with friends. The food is delicious and the staff is amazingly friendly.", "author": "Anthony L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-18", "description": "This place was okay. I would come back for happy hour because the prices are good and they have delicious buffalo chicken egg rolls but they have whack fries :/. It should be a crime for restaurants to serve whack fries or salad as they are the easiest things to make on the menu lol. I'm joking, the fries were still awful but I'm sure this place has better things to offer that I just didn't sample. The buffalo egg rolls were great and  so was the palm trees drink. Maybe just stick to those and you'll be fine.", "author": "Jessica C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-12-29", "description": "Stopped in for a quick drink. Lively neighborhood spot! Didn't try food, but good tequila and draft beers including Harpoon IPA. Confortable, warm and friendly. Will be back.", "author": "Familia S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-23", "description": "Went for Mother's Day brunch after failing to receive service at another establishment in the neighborhood. Simple yet tastefully decorated. Wasn't as crowded as the previous place but was friendly and inviting atmosphere. There was a television near our table but the volume was muted and a sign hung close by informing to download an app to hear the program being shown. If that isn't genius I don't know what is!\n\nThey also had a special Mother's Day brunch menu to celebrate the occasion which made me happy with my choice to dine there. \n\nWe received a complimentary muffin basket filled will warm, tasty variety of muffins after ordering our meals. The food was good, service was fast and out server checked on from time to time to ensure everything was as we liked. \n\nOverall a wonderful experience and I'll definitely be going back.", "author": "Natalie G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-10-22", "description": "If you're into sports bars, and don't care too much about beer selection and quality of food, you could do a lot worse than Mullane's.\n\nThere is plenty of room, with the area by the bar separated from the back of the rooms where tables are. If you don't care about sports, grab a table and you'll be in a relatively quieter environment. Added bonus: the big screen at the back is muted, but you can download an app to listen to the TV on your phone. There is also outdoor seating alongside Lafayette, perfect on a sunny day or a warm evening. If you care about sports, you'll find plenty of screens, and a great atmosphere.\n\nIf you care about food and drinks, however, keep your expectations low. This is fundamentally a sports bar, so you know what to expect. The tap selection is not great, but they have Harpoon IPA and Montauk Driftwood Ale. As far as food, pub classics like calamari and spinach dip with pita were good, but my open face reuben sandwich was bland and heavy at the same time, and the fries were limp. I should have ordered the calamari salad.\n\nService is attentive and fast, with plenty of servers if you're in the seating area; certainly a step above your average neighborhood sports bar.", "author": "Matteo R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-08", "description": "Great atmosphere, pleanty of TV's to watch all games, wings are amazing! Bartender Tevon was great and always made sure i was refilled. Great place overall!", "author": "Rafael S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-09", "description": "Shout out to Stephen, the best manager with the biggest shoulder muscles.\n\nThis place is a good one. It's never empty. It's never over crowded. The service is really good and the prices are far for nyc. The food will also get it done.", "author": "Sam B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-25", "description": "I came here with my best friend raving about how good the food has been in the past. Monday was my first time there in probably 2 or 3 years. When i was a student at LIU Brooklyn, it was one of my go to spots.\n\nOur server was super sweet and quirky. Very funny and she was comfortable laughing at herself. She spaced out checking on us well and was attentive to our requests. The food came out speedy.\n\nShe ordered the calamari which she enjoyed. I ordered the crab cake sandwich which completely lacked taste. Even with the sauce, i wouldn't eat it. It was simply bland. I love seafood and crab cakes are one of my favorite. But definitely not at this establishment!", "author": "Taiesa H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-17", "description": "This is long overdue.... I'm am a frequent visitor since 2012. The bartender miguel is absolutely amazing. The definition of amazing service, he is clean, friendly, organized and his drinks are amazing. I solely come for those reasons. I wish more establishments are like this...Great food, good service and great prices. I would recommend this place to anyone. Keep up the great work.", "author": "Aaron C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-29", "description": "Solid place\n\nSimple bar with a good selection of beers and burgers - a perfect combo for watching a game (or pretending to watch one). The bar has a decent selection of beers. I have been here only two times but both bartenders working, were very friendly and nice. Mullanes is a nice place were you can go alone or drop by with a few friends to grab a bite to eat and/or a few beers/cocktails. The prices for food and drink a very reasonable for the place and you will not break the bank indulging at Mullanes.", "author": "Kwame S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-18", "description": "Came here on a night during a baseball game, super loud! As expected! Didn't ruin the vibe of the restaurant at all. This spot is very game friendly with large tvs for your viewing pleasure. We had the Italian burger and the Irish nachos. It was good. Nothing amazing but I had zero complaints. Staff was friendly and accommodating! I  wouldn't say I'm def coming back, but if I happen to be on the block, I'd stop in.", "author": "Stephanie A."}], "servesCuisine": "American (Traditional)", "priceRange": "$11-30", "name": "Mullanes Bar \u0026 Grill", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "71 Lafayette Ave", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/x77IccjKjR3Q3FgSeypIPA/ls.jpg", "@type": "Restaurant", "telephone": "+17187977606"}