{"aggregateRating": {"reviewCount": 326, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-13", "description": "Perfect place for happy hours! Yummy food and great service. I love this place.", "author": "Polina T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-09-22", "description": "I went here late the night before labor day. I was starving and in need of something greattt to eat. It was pretty empty that night but thankfully the kitchen was still open. I had one of their burgers and it was delicious. The bartender seemed pretty decent. I only gave it 3 stars because I do not think I got to fully experience this bar because I came on a dead Sunday night. However, hopefully I would go back on a Friday or Saturday night to see how it really is. But the burgers and fries are good.", "author": "Stacey D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-10-19", "description": "Great wings, decent burger, nice bartenders and decent beer selection. I like how huge the bar area is too, makes for easy sports spectating. It's a pretty standard sports bar with pretty standard menu and decor, but the bartenders were also nice enough to charge my iPhone behind the bar for me, so I think that's worth an extra star.", "author": "Rachel B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-06-07", "description": "Pros..its a good sports bar. Awesome nachos and thai salads.\nCons..its a sports bar.don't expect to talk to neighborhood people here.if you talk to anyone out will be riff raff from out of town and it will be about sports statistics. \nWings are horrible..basically undercooked with Petes hot sauce thrown on top and two sticks of celery on the side. Margaritas are pure sugar syrup. Beer selection is very much top 10 whatever the beer distributor recommends (bud light, blue moon, corona etc). With so much good beer out from local breweries its a shame to see the same draft selection over and over again. \nIf you don't have cable at home and need to watch a game this is good in a pinch. Otherwise I prefer Tap House for beer selection and sports.", "author": "Hank R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2008-12-14", "description": "A solid Irish/sports pub. You won't write home about Mullanes, but you won't complain, either -- there's a decent selection of beers on tap, the food is good, the service is friendly, and the decor is clean and bright. \n\nFew people will call this place their favorite, but it's a great place to grab a brew or a burger, especially if you're out of other ideas.", "author": "d e."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2009-11-07", "description": "Mullanes is a sports bar and a kind of home-away-from-home for the Brooklyn folks that belong in Manhattan with the other dull douches.  In a word it is a shitty suburban sports bar plunked down right in the middle of Fort Greene.  Come for the boring draught selections and stay for the bad cheap disgusting food.  Dress code: white baseball hat and sweatpants.", "author": "Sean C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-03-24", "description": "The service at this restaurant is atrocious. The waiter never brought my dinner, brought the wrong salad (and only after my friend's burger), twice brought a side we didn't order, argued when we pointed out it was the wrong salad and replaced it but with the wrong dressing. Meanwhile, his boss didn't care, didn't do anything to make it right, and was rude and hostile.", "author": "Tyrian L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2009-02-13", "description": "Mullains is the TGIF of Fort Greene.  If you're going to be a sports bar be a sports bar...if you're going to be a restaurant be a restaurant, but don't attempt some schizophrenic approach where you try to accomplish both half-assed.  Nothing is better than watching a basketball game with 14 dollar overcooked frozen cheeseburger, as the bartender ignores you, and 3 servers stare at you while they eat their staff meal behind the bar, all while the owner supervises with a wine glass full of Coors Light. Classy.  Because it's the only pseudo-sports bar in the neighborhood I guess the ownership feels it can dish out the lowest denominator in food, spirits, and service.  On the plus side, the blaring U2, Oasis, and Rod Stewart softens your brain enough that you don't even care if your team loses.", "author": "Scott W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2008-07-14", "description": "Been here a couple of times since it's right around the corner.  Good for a late-night beer,  and I've heard the burgers are good, so I must try them at some point.  It's your regular sports bar with a milder, older crowd (at least during the late hours I've been here) and a relaxed atmosphere.  The whole ambience of this bar is kind of meh.  Not really anything too exciting, and the bartenders and waiters aren't exceptionally friendly either.  The prices aren't that great but aren't bad, either.  I guess everything here is just normal and expected of a bar and grill place.", "author": "Mabel L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2007-11-15", "description": "After having a drink at Moe's my Friend and I made our way down to Mullanes. I liked the decor inside and the crown was pretty mellow. Their Sangria wasn't the best but it did the job! the food was pretty good also. After a few drinks we were settled in and felt right at home.", "author": "Michelle M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2008-02-09", "description": "I tooootally give every restaurant, at first, the benefit of the doubt that my experience, all the way around, from walking in, to being seated, to being treated, served, et al- counts for something. Mullanes is my local pub, I'm proud to say. The folks couldn't be nicer, and I have to tell you, it's ab damn good burger. There's always a table for you, (as long as there's no big game going on, then you're screwed, unless you get there early) it's clean, spacious, and has that nice, down-to-Earth Brooklyn feel to it. Come in for a beer and a burger, simple and delicious!", "author": "Scott R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-11-30", "description": "Mullanes has become our old standby. I think the food is consistently good and the staff is always friendly and attentive. They have a pretty intense sports-watching crowd, so that's something to keep in mind if you're looking for a place to take a lady. I highly recommend the mac and cheese. It's creamy with a tasty, crusty top. The BBB burger is outrageously tasty and the buffalo wings ain't half bad. This place is great to go with friends or out-of-towners as they have something for everyone.", "author": "Mavi G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2008-01-12", "description": "This isn't what we needed in Fort Greene.  I left Boston for a reason.", "author": "J. N."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-09-19", "description": "Good place to hang out with friends - great bar food, space, location. Yummy bread pudding for dessert. It doesn't get higher than 3 stars because ultimately it is just a bar, but a solid neighborhood one is always a good thing.", "author": "S. A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-28", "description": "Great attentive service. Tasty food! Nice chill atmosphere! Location is perfect!! I like this place and will be back before we go bar hopping in the neighborhood!!", "author": "Feygens S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-03", "description": "Love the friendly staff and relaxed atmosphere.  Have never had to wait more than 10 minutes for a table for four.  The food isn't going to knock you away, but this is a great place for casual food with friends, watching the game and getting free refills on your soda.  I wouldn't recommend the sangria, but have enjoyed my mixed drinks and margaritas here.  For food, I'm a fan of the fish and chips and shepard's pie.  Their mac and cheese is a favorite for my husband too. We've been there countless times and get a bread basket with our waters about 25% of the time, so I'm not sure if you need to ask for that or not.  But friendly service and nice prices make this a definite recommend.", "author": "Alexis A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2007-10-30", "description": "Mullane's sort of passes itself off as a sports bar, but it's a little stale.  I mean sure you can watch the game here like any other bar...but would your local watering hole also serve shrimp tempura, seared salmon, and sirloin steak?  P'shaw.  Hardly a dive...the most expensive entree is the Mullane's Steak @ $21, and I haven't been to a bar lately that served mussells.  It's a nice place to grab a bite and a drink, but the crowd is older.", "author": "Koku K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-12-06", "description": "Fun sport bar. Good place for Sunday Fundays during football season. Great bar food.", "author": "Tiffanie T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-20", "description": "I like this place. I attended a nearby University and my friends always came here to de-stress. Nobody bothers you, you can sit at your table for 3 hours without the server coming around every 10 minutes offering you the check or dessert as a polite way to say please leave. The food is always delicious, portions are great, you get what you pay for. And get this. My friends and I ordered a pitcher of sangria. We asked the server if we can get the pitcher with no ice (because you know the ice takes up space and you end up getting less drink) and the server asked the bartender and we got our pitcher with no ice! That was really nice of him to do. Overall, great place to kick back and relax. Prices are very affordable. Roughly 25-30 bucks per person with appetizer, entree, and liquor. They also have outdoor seating when the weather is nice as well. Once again, I love this place.", "author": "RandBlues L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-04-21", "description": "great atmosphere to watch the game and/or grab some lunch. food came out fast and is reasonable", "author": "Jayson W."}], "servesCuisine": "American (Traditional)", "priceRange": "$11-30", "name": "Mullanes Bar \u0026 Grill", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "71 Lafayette Ave", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/x77IccjKjR3Q3FgSeypIPA/ls.jpg", "@type": "Restaurant", "telephone": "+17187977606"}