{"aggregateRating": {"reviewCount": 326, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-02-27", "description": "Not much to say people the food is so so. Had the trio platter. Tasted like the tacos or whatever the hell that was, was frozen and then dumped in the frier. I will say the customer service was alright. We just came here to eat cause MO's doesn't serve food anymore. Ain't all that!", "author": "Kheeda C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-14", "description": "Found this restaurant yesterday on our way from the parking garage to the Barclay's Center. \n\nWhat a find!!!!!!!\n\nWe had one hour to grab a quick bite before the concert and this restaurant made it happen. We were seated immediately, the staff was super friendly and accommodating. Our waitress was awesome. Got our cocktails on the table in less than 5 minutes from the time we were seated.\n\nMy husband ordered a burger and I ordered the crab cakes. Both were delicious. I will definitely come back here when we have more time to hang. I'm curious about the rest of the menu. This place did not disappoint.", "author": "Nicole C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-29", "description": "We came here on a whim will strolling around the neighborhood. The food was...aeyy..bar food but the beer was cold and cocktails mediocre. We love Irish pubs but the menu didn't give an Irish pub feel nor did the service. We ate, we paid, we left. Nothing special but its worth popping in for a drink or two if in the neighborhood around happy hour time.", "author": "Jenna Z."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-05", "description": "A great spot for a bite and drink! I had the fish and chips, which were pretty amazing, and my roommate had the burger. She griped a bit about it not being the best burger, but for one thing she's picky as hell and two the service made up for shortcomings they might have had. \nOur server JT was super nice and genuine (not usually a word you associate in the service industry). \nAnyways, I got ditched by said roommate and just ended up hanging out at the bar over a drink chatting with the staff. Yeah, that's weird huh? They're that welcoming and friendly. Go check em out. And don't skip dessert!", "author": "Chantalle U."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-13", "description": "Great atmosphere, attentive bartenders and awesome Irish nachos. Stopped in on my way to Barclays", "author": "GreenpointGirl D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-04", "description": "Usually stop by here while at work, I'm an overnight worker and this place is 2 blocks away! Hard to find a place with some decent food at 1am. Their kitchen stays open late! Like 1 or 2am depending on the Day. Have never had a drink here but it's a bar.... so I'm sure it's the same as everywhere else. Place gets pretty packed on a weekend night but you can walk right up to the hostess and order your food. Speedy service every time and exactly what you ask for! Have only had the burgers and I gotta say they taste great for it being a bar. Kudos to the kitchen!", "author": "Emmanuel V."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-05-28", "description": "On a nostalgic visit to Clinton Hill/Ft.  Greene  (my old stomping grounds from 5+ years ago), I got turned around looking for the cluster of cool bars I used to frequent in the late 2000s. Before giving up and heading back to Manhattan,  I decided to stop at Mullanes based on a distant memory of being there before.  Ordered the Mexican Scramble from the brunch menu.  The plate comes with eggs, Scramble scrambled with onions,  black olives or black beans,  tomatoes,  green peppers and Jack cheese. It was pretty darn good.  The sides were home fries and a conservative serving of cubed melons.  The potatoes tasted a tad bit... old.  As if they were made this a few hours ago and reheated,  but still decent.  \n\nThe atmosphere is chill and casual. Diverse mix of patrons and servers. 6 nice size TVs at the bar showing whatever sporting event is on.  If you prefer a more restaurant feel,  you can grab a table in the back which,  barring the occasional roar to a made goal/shot/first down,  you'll forget you're in a sport-ish bar.  \n\nOverall,  cool spot.  Will stop by if I ever again make it back to BK.", "author": "K V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-04", "description": "I went to dinner with a group here (after walking by it at least four times a day for the past year!) on Monday night and found the overall experience to be very enjoyable.\n\nPros:\n-awesome outdoor sidewalk dining--good place to see and be seen in Fort Greene, also can bring your pup to eat with you outside\n-easily located near the G train and a short walk to Barclay's\n-large indoor bar and dining area--good for groups (accepts reservations)\n-happy hour is 3-7 pm weekdays includes $6 beers and shots, $5 house wines,  and a free buffet (small but can't beat free food!)\n-great place to watch sports games or relax with a drink\n-service was prompt and polite throughout\n-they have lunch, brunch and dinner menus\n-burgers and shepherds pie were top notch!  myself and one other had mac and cheese which was good but not as good as the other meals (needed a little more sharp cheese i think!).  Prices were good, $10-20 for most meals and they were good sized.  Pub food but a level above\n\nCons...not many to mention:\n-might not be the most kid-friendly spot as it can be more of a drinking crowd at times (might not be for everyone)\n\nWould suggest you check it out!", "author": "Amanda B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-21", "description": "Come here once in a while for lunch and sometimes after work. Pretty good draft selection. The drinks are good. Anything I ordered on the menu was always good. Never any issues at all. A nice pub with good food good spirits and nice people in  Brooklyn .", "author": "Paulie X K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-08-10", "description": "A few years ago this was the best place to watch a game and have some of those BOMB quesadillas.\n\nNot sure if they changed management but the service is at an all-time low. Hard to believe that its the same place. But the food is still good! Just take it to go.", "author": "Yue L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-06-22", "description": "- Cool sports bar with lots of TVs\n- gets PACKED during World Cup soccer, especially USA games\n- Show up at least an hour early if you're coming to watch a soccer match or any big event", "author": "renje g."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-13", "description": "Nice dinner. Great burger and mussels. Service excellent. Ambiance was nice for a sports bar.", "author": "Ayanna J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-11", "description": "Great bar with amazing service. They have amazing menu with something for everyone and awesome French onion soup! Perfect for watching sports", "author": "Monika G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-13", "description": "Came to this place with my girlfriend and her friend. We decided to come here because her friend was carving burgers. At first glance the place looked pretty cool, with a full bar service and the the back there were seats to eat and also seats outside to sit also. \n\nThe servers are pretty nice and friendly. One problem i have with this place is that they check our IDs but didn't check anyone else. I remember that night when i went to eat a girl from another table looked younger then 16 and they didn't even ID them. My suggestion is if you going to check one people, you should just check everyone. \n\nWARNING the food is super big portions. The burgers are huge and have different burgers suck as hickey burger, fort greene burger, turkey burger and etc all comes with fries. The fries are very salty and the caramelized onion was not cook correctly. Suggestion i would stay away from the onions ring, i order some and the inside of the onion ring was not cooked. The cocktails are pretty strong my favorite is the june bug. \n\nOverall this place is good for a late night dinner or snack. i would be coming back soon.", "author": "Rafael Y."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-01", "description": "Ive been here a few times with friends ..mostly after not wanting to go where we usually go to grab some grub and a drink. \n\nDefinitely a clean sports bar with a pretty standard bar fare with one of my faves...frickles (fried pickles). They have pretty strong flavored margaritas that keep ladies pretty happy if they aren't interested in any game that's on any one of there screens.\n\nIts safe to say we'll likely hit this spot up again for a grubage, sports, \u0026 convo.", "author": "Ebony C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-27", "description": "Nice bar, food is ok. The best thing about this place is the outdoor seating when weather permits.", "author": "Oscar P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-07-15", "description": "The blonde bartender has a terrible attitude. I said I didn't like my drink and wanted another. Let her know I'd pay its no big issue. I get it, my fault. But she goes off on this rant saying \"this is why I specifically asked what you wanted.\" Like ok. But can I get a new drink??? Lol. I tipped her bc I'm not rude. Hope that made her day though bc clearly she hates her job or needs to get laid.", "author": "Ashley C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-11-25", "description": "My worst bar experience ever! I have never met such a rude bartender in my life. Her name is Laurett (as she introduced herself, blonde one) and this is the story to avoid that bar when you have a choice just around the corner (eg Black Forest with great selection of German draft beer). I came in on a busy Wednesday night to have a couple drinks before a hockey game in Barclays center. She spotted me on the bar in a couple minutes, I asked for the beer list and then she aggressively put the happy our list in front of me saying nothing, just turned around after that. But that was not a big deal. I got a beer and the time came close to the second drink. It took time to flag her down and ask about \"long drinks\" on a cocktail list, I just love drinks sizes which compared to beer glasses;)) She aggressively pointed out the word \"rum\" and run away. It took time again to flag her down and ask one more time the same question: \"Which are the long drinks on the list?\" Can you imagine what she responded to me? \"What the fuck it is?\" And she looked at me as if I'm a piece of shit. I repeated my question and she didn't understand again, then just moved to another customer. I said that she is very rude and she admitted right in front of other people \"yes, I'm very rude\". I could not believe I have that type of conversation with bartender. I stayed calm and asked where is a manager but she proclaimed that she is a manager (probably bullshit but I didn't want to argue anymore), then she asked me to pay but refused to give me a check, and in a moment just stated arrogantly \"Cheers\", which means I'm free to go without paying. Wow, so generous. The bottom line is I could not pronounce many times the simple words \"long drink\" as incorrect as hell even with my slight accent. And absolutely nobody deserves such miserable attitude which she gave me. For sure, if you read, you need a bartender classes to know what it is \"long drink\". Clear the fuck enough is it now? And message to the owners: you should kick her out immediately because such an ugly bartenders I didn't meet even in the worst hood places. P.S. Looks like that bartender works there for a while getting complaints constantly. Well, if the owners don't care, skip that bar, guys. There are many good places around.", "author": "Dmitry T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-15", "description": "My husband was craving \"meat\", but we had already tried the Smoke Joint across the street and so we stumbled upon this place.  He's a chef and can be very very picky.  He wasn't so convinced, but I told him they had steaks so he agreed.  Turns out it was AWESOME.  We had our 9 year old daughter with us and opted to sit outside because the game was on and inside was pretty loud with enthusiastic fans.  It was a nice breezy evening and the other outside guests were quiet and chill.  I got the stuffed chicken and it was SO FREAKING GOOD!!!  My daughter had the Panko Chicken fingers appetizer as a meal and she loved it.  My husband was very satisfied with his steak and potatoes.  We had a $35 pitcher or Margaritas which was WAY MORE than we needed we couldn't even finish it all.  Our waitress was sweet as well. All in all this was a great find.", "author": "Brooklyn R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-06-24", "description": "This is your basic good sports bar. Descent beer selection, bar food and big screens. It's clean, good service and has a terrace. \nIt's the kind of place you can depend on and I like that.", "author": "Jeremy W."}], "servesCuisine": "American (Traditional)", "priceRange": "$11-30", "name": "Mullanes Bar \u0026 Grill", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "71 Lafayette Ave", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/x77IccjKjR3Q3FgSeypIPA/ls.jpg", "@type": "Restaurant", "telephone": "+17187977606"}