{"aggregateRating": {"reviewCount": 326, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-11-12", "description": "I always hang out in the Ft. Greene area, but for some reason haven't been to Mullanes too often - If I want to drink, there are other bars which I am more familiar and I am well taken care of - If I want to watch sports, I usually do so at the BWW in Atlantic Mall - but Mullanes is growing on me... \n\nI usually go there when meeting female friends (who would be horrified at the other dive bars I attend) and if I figure we'd want a bite to eat while drinking. The food has sometimes been hit and miss. I am not too thrilled about the burgers, which are not flavorful enough. The wings are okay, the chili is good. \n\nHowever with my last visit I was craving comfort food and the Shepherds Pie definitely hit the spot. The bartender was friendly and gave a great suggestion of the having the pie. 3 stars for now with the potential to increase as I will now visit more often.", "author": "Leonard P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-06", "description": "Luv'd the food, service, ambience, big screens, football, baseball, tennis, and UFC fight, on Labour Day Sunday. Need I say more", "author": "Dante D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-25", "description": "Mullanes is more popular than it is spacious, but I lucked out and snagged a couple bar seats for my pal and I. There was music instead of game audio, which at night I understand, esp. w/competing games during March Madness. The bartender was a pro-- laughs at a man's jokes, criterion #1. \n\nBeer selection mediocre...I'm okay with that, considering Brooklyn's got a million spots for beer-sperimentation, and there do be some passable brews. \n\nI got some fried pickles which were aight. Friend got an app. sampler plate which was fine. Peeked the kitchen, looked clean and professional, so I went ahead and ordered some more food...Mac N Cheese was pretty blah to be honest, not a cut far above box mac, which it might have been, but they baked it and threw some bread crumbs atop. \n\nI wish they had a 3.5, but I'll inflate my rating upward since it fit the billing.", "author": "Nick W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-25", "description": "Great bar food! They have some of the best burgers around town. They are accommodating, in so far as substituting a salad for fries. \n\nThey have a bar, tables near the bar, tables in the back and tables outside on the sidewalk. \n\nCan get quite crowded and loud during games, since they have many tvs around the bar and a very large screen in the back dining area. \n\nService is usually good, and food is served quickly.", "author": "Amy M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-07-25", "description": "Ambiance: typical bar atmosphere.\n\nFood: Solid food. A bit overpriced. The salmon burger is a weird foamy salmon patty that's mixed with God knows what. I expected a salmon filet burger. Not what I got, but what I would expect for $18.\n\nDrinks: We ordered a bottle of wine. It wasn't good at all- tasted like beer, but it got the job done. A couple friends ordered cocktails and they were watered down.", "author": "Mrs S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-06-09", "description": "Mullanes seems to have ok food and pretty nice staff, but I remember it being a bigger Rangers hockey bar when I lived in Fort Greene about 4 years ago.\n\nJust stopped in recently hoping this was still the case but the staff didn't know what was going on, even tho it's the biggest thing for NYC hockey fans in 20 years.\n\nI would recommend this place for its friendliness but not if you're trying to catch the Ranger game with a hockey crowd. We ended up leaving after we finished our dinner and going to Plan B on Vanderbilt since it was closer to home.", "author": "Jay L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-06-16", "description": "Haha. I took a vegetarian to a grill. Big mistake. \n\nAnyhow, my companion wanted \"French fries,\" and we don't have that in Fort Greene. Extremely hard to find. But this place has it. \n\nSo this was what I offered, only to forget my dining companion does not eat meat. I felt bad about that. \n\nThis is your typical sports bar and with typical bar food. But we needed to refuel, so this worked. \n\nMy dining companion ended up not eating French fries. LOL. a salad and a corn and bean salsa. So healthy, I say. \n\nI had two beers, both Blue Point and I also had some Six Point.\n\nIt was pretty empty and a good place to chat. Pretty much the only place in Ft Greene for French fries. Or you could go to Burger 67 two doors down.", "author": "Vivian H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-05", "description": "This is my go to place before Nets games. Awesome food and strong drinks. If your looking for a one and done get the Blue Long Island.CYAAAA", "author": "The Glutton .."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-07-31", "description": "It took the bartender a really long time to acknowledge me and my boyfriend (the place had maybe 6 people total). We then noticed it was because he was taking shots with other customers. \n\nHappy hour specials are pretty good, but I would go somewhere else for better service.", "author": "Maria C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-17", "description": "Came here to watch the Panthers and Seahawks game. The restaurant is very nice, low lit,  with a nice bar and about 10 tvs. I had a burger with sausage and cheese, the burger was very good and it also came with a nice serving of fries. The atmosphere was nice and the waiter was cool. I would definitely go back.", "author": "Tarik B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-12-28", "description": "Met a friend here for a bite to eat and to catch up. There are certainly better places to have dinner than here in the neighborhood but this is probably among the more affordable places than Smoke Joint across the street. \n\nThe waiters were attentive and the quick. I ordered a regular burger with fries and a beer. The burger was all right and the beer was cold. Nothing to really write home about. The fries were the frozen, reheated kind that come from a bag from Jetro.", "author": "Stephanie F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-01-09", "description": "I went here the other night for dinner after the place we wanted to go was closing up for the night. Like every other time I've gone here, It was alright. I mean the food was good and it's a very nice place, but it's never my first choice. I ordered the cobb salad and my friend got the fish and chips. They said the fish and chips here were better than one of our favorite restaurants that we frequent on a weekly basis. My cobb salad was so so, I didn't get a choice of salad dressing which turned me off a bit. Our waiter wasn't the best either, he seemed to be ignoring our table for most of our time there and was more interested in the table next to us with a group of girls. \n\nThe time before this when I went here was over the summer. I was really drunk, I wanted to go to this bar in park slope, but some how managed to get lost and end up in Fort Greene. I believe I got a rum and coke and had the mac and cheese with chicken and bacon. At the time I thought it was the most amazing mac and cheese ever, haha.\n\nOverall it's a nice bar with pretty good food, I just needs to be more memorable if you ask me.", "author": "Rosemarie H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-06-17", "description": "Tasty house salad - check\nDelicious chips with corn \u0026 black bean salsa - check\nSixpoint bitter ale - check\n\nDamn this place wasn't bad at all!  Who says a grill doesn't have veggie options!  :-)\n\nI'm not normally one for a sports-bar type place, but this one isn't bad.  Ft Greene is soo damn hip!", "author": "Sean S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-16", "description": "Good solid neighborhood pub food. Tightly run, nice staff. \nFor what it is, it exceeded expectations.", "author": "Steve H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-01", "description": "It takes a special place to be able to create an atmosphere that is both comfortable and lively. Mullane's pulls this off pretty damn well.\n\nI went to Mullane's several times during the baseball postseason, and each time it was relatively easy to secure a table, though it was pretty busy with all the sports fans.  There's a certain ebb \u0026 flow about the place that makes it a great option for watching a game.\n\nTheir burgers are wicked good, and the wait staff keeps a keen eye on your glass so it's not long before they walk by and see if you need a refill. \n\nGood prices, good space, overall good times whenever I'm here. If I lived nearby, I think it would easily become my neighborhood bar.", "author": "Mickey M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-22", "description": "Get the barbecue wings! Probably the best thing I've ever tasted.\n\nOne of the best sports bars in the area. But even if sports isn't your thing, it's still a lot of fun, just don't go when a big game is on. \n\nHappy Hour \n4 - 7PM \nMonday - Friday\n\n$6 1 beer 1 shot\n$2 off all well drinks and draft beer\n$5 wine\n\nGreat spot also if you already went to the Nets game and want to celebrate, or drink your sorrows away.", "author": "Talia M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-12-16", "description": "Came here late night after a movie at BAM with my bf. It was ok, nothing spectacular. I had the wings appetizer which was plentiful and a good price. The TVs are huge and great, I can imagine this is a nice place to watch a game.", "author": "Sam B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-06-28", "description": "I've come here more than a few times and had a good experience at the bar..drinks, finger food. Today I became extremely embarrassed after recommending this place to my friends for dinner and experiencing with them the poor level of customer service that both the manager and server displayed. And I am from the food industry so It takes a lot for me to get upset at a restaurant as I understand the difficulty of front and back house operations. First my friend got served water with a pinkish tint, we were told it must've been from the gun...ok its totally fine we get it. Then my friend ordered a frozen drink that came out watery and from the look of it obviously was not tasty Then they completely forgot to put one of our orders in. Brought 2 meals out and we sat at the table for 15 mins staring...hoping the 3rd meal would appear. It never did. We finally decided to ask someone to get the server, she comes to the table and says \"the kitchen didn't make it\"....ok...did you put the order in? \"No I didn't, do you still want it?\" REALLYYYYY? No apology. We ask to see a manager. Explained to him what happened and he was defensive, and proceeded to make an excuse for why the server may seem uninterested in the fact that she just forgot to put someone's meal in. Let me say again, a server forgetting to put an order in the system is not the worst thing in the world. HOWEVER what separates a great business from a mediocre one, is the way they handle the situation. And MULANES #FAILED.  I will NEVER support this place again, there are too many other great places in Brooklyn, to support one that obviously doesn't care for its customers. They show no regard for customer concerns especially when it was their mistake. And not to mention the food is BLAND! Please hire a consultant to train management and staff, the investment will take you a long way.\n\njust checked my CC statement and they billed me twice! Comedic. Thankfulkly I have AMEX, I will be disputing the charge.", "author": "shanna m."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-26", "description": "Never actaully been here but they're famous. On season 2 of elementry watched it and knew it sounded familiar I was flabbergasted at the idea of such a amazing TV show so close to home:)", "author": "Shira F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-25", "description": "Bartender \u0026 owner very cool ppl!!!! Food is  outstanding, happy hour has free snacks.", "author": "Denise C."}], "servesCuisine": "American (Traditional)", "priceRange": "$11-30", "name": "Mullanes Bar \u0026 Grill", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "71 Lafayette Ave", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/x77IccjKjR3Q3FgSeypIPA/ls.jpg", "@type": "Restaurant", "telephone": "+17187977606"}