{"aggregateRating": {"reviewCount": 326, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-10", "description": "Mullanes is a sports bar located in Brooklyn's immensely cool \"bar triangle\" (where Lafayette, Fulton, and South Portland meet). I call it a sports bar because the first thing you notice after the bar, are the absurdly large televisions screens hanging behind it. We happened to go on the second night of the Olympics; one would expect to see nothing but curling and bobsledding on every TV right? Wrong, this place is super \"sports\" diverse, and I love that. Yes they Olympics were on the main scree (as they should be), but flanked on either side was the Premier league soccer match....AWESOME. \n\nThis place is jamming on a Saturday night, but can't quite seem to manage all the foot traffic they get. To be honest the only reason they didn't get a full five stars was because we had to wait almost 15 minutes to get a drink. When we finally managed to get as seat at the bar, all became right with the world. \n\nStarting with the bar tenders - absolutely hilarious, but I'm not convinced completely by design. The guys behind the bar are probably the quirkiest group I've run into in a long time. Comments ranging from Putin being on the bed sheets in all the Olympic rooms, to off the cuff soccer jokes - they were a hoot.  The beers on tap were also exceptionally diverse, ranging from a really nice winter white (single cut), to a spring beer (spring fling). We hung out long enough to get a bit hungry and decided to order dinner - fantastic call let me tell ya! Is it bar food? Absolutely, but it's really REALLY good bar food. The skins were done just right, and the burgers were ultra-creative. I had a burger topped with sausage (weird right?), it just about knocked my socks off.  \n\nThe ambiance is lively, the tap selection diverse, the food is wonderful - definitely a fun spot to watch a game, I'll be back soon.", "author": "Chuck C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-09-17", "description": "To be honest I didn't have the food...that's how bad the customer service was. My girlfriend and I randomly picked this place. After sitting down for about 10-15minutes in a restaurant that wasn't busy at all, we had to signal a \"waiter\" who never introduce herself or asked us if we would like anything to drink(pretty much the basics of being a waiter). When our order was finally taken down, 15mins in, she took our order and still didn't ask for our drinks. Customer service is the foundation of waiting if you can't do that find another job. So if you like efficient customer service don't bother with this place. You won't find it here.", "author": "Alexander S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-30", "description": "Been here a few times...Prefer going in the spring/summer months. Dining outside is cool. Large interior...not a family type setting for kids...more bar like..drinking etc. but overall experience is great!!! Staff was polite and service right away. \n i had the mac and cheese...thought it was creamy/cheesy and tasty...i really liked it. Great menu...many choices...prices are good..not too crazy.", "author": "Demora F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-22", "description": "The 'daily deal' is probably one of the better lunch offers in the neighborhood. For $11 I got a quality clam chowder as well as a spice turkey burger with a small hill of fries. The environment is relaxed, pubby, and the wait staff knows how to roll with the randomness that comes with their job.", "author": "Dominik D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-21", "description": "The food wasn't that good. I wasn't impressed by the food nor the service. Firstly, I waited about 30-40 min for a burger that had no lettuce, tomatoes, sauce or anything. Seems like they were understaffed. This business need to do better with hiring more people. I went in with 4 people and the our waitress was rude. She looks spanish, petite, with light colored eyes and a tattoo behind her ear. The guy I was with gave her a $40.00 tip and her ungrateful a** said she can't no longer serve us after he asked for another drink. If you're the boss and you see this pls have her fired. I'm beyond annoyed by the service. If you're thinking about coming here, please save yourself the money and go somewhere where they will better attend you with better service. I wouldn't come back here if it was the last restaurant on earth. The food was disgusting and had my drink had a hair in it. Go somewhere where the food is actually tasteful. Hope this review helped.", "author": "Genesis H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-26", "description": "Went in a Saturday night. Not too busy. A very chill vibe. Great prices and impeccable service.", "author": "Shanna D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-20", "description": "Love this place. \nMullanes is slowly becoming one of my favorite little spots to sneak off to. I stopped by yesterday to grab lunch in a gorgeous Spring day. Of course there was no outside seating but since I wanted to watch the NBA playoffs I didn't mind going in. \n\nInside was amply packed as well. Recognized a few folks I had previously seen there so I figd they love this place as much as I do. \n\nI ordered the shrimp mac n cheese. It never fails. Best dang idea ever! I had the red Sangria (the white taste like a bad iced tea). My side kick got Nachos. We were both well nourished. The game was great. Day well spent.", "author": "Sasha B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-11-14", "description": "I've been to Mulane's a handful of time and by now I can say is an Ok place. It depends on what you are going for. This can be a great location for drinks and watching a game plus some standard bar food. Good for groups, and the outdoors sitting is a plus. However, what makes this review a three stars is the service. It has never been 100% on point. Sometimes feels like the place is too packed and not enough wait staff, the last time I was there the waiter forgot our chicken wing order, the main reason why we went in the first place. I would not consider this a sit down dinner location but more like a very big sports bar.", "author": "Denys S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-12", "description": "This place is laid back, clean and has good service. I like the location and despite the food really being at most a 3.5 stars I always still enjoy coming here.", "author": "Nadia G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-09-08", "description": "I've put off coming to Mullanes for a long time because I'm not a big sports bar guy, but you know what? It's actually not bad. Pretty big space. Clean. Outdoor patio. Friendly staff. Beer bucket specials. Probably the first time in 5 years that I've drank Bud heavy. Maybe I'll come back for one of those burgers that everyone's talking about.", "author": "Kenny C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-28", "description": "Just steps away from Barclays, this bar is almost always packed. The 8 screens show sports and the bar is strategically situated in front of the large screens. Grab the Greene Tea cocktail but any drink is great. I love to pair it up with buffalo wings.\n\nThis place can be great for families or bigger parties as well. They have a quieter dine in set-up at the back.", "author": "Pauline M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-26", "description": "Came and had the BAM burger. It was DELICIOUS! And you could taste the nice char on the burger from the grill. I love when burgers are legitimately grilled this way.\n   I got it well done because I usually asked more meats cooked that way if it's a bar or I'm unfamiliar with the place, until I become familiar.\nUltimately, DELICIOUS! I'd definitely come back for this burger.", "author": "Jared J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-06", "description": "The service is great, the drinks are strong and the food is tasty. Every time I come here, I'm always pleased. This is one of many spots I take my friends when they want a night out in Brooklyn experience.", "author": "Tiffany I."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-10-06", "description": "The service here is despicable. Me and my friends were spoken to so rudely by all the servers AND the manager. We ordered fries and wings and a short time later the server came over and told us to pay for quesadillas we did not order. I explained to her we did not order them nor eat them if they happened to bring them to our table. There were other people at our table we didn't know. The manager came over and asked me to pay for the quesadillas. I explained to him none of us ordered or ate quesadillas. He walked away, and when he came back over to us he LIED and said he checked the camera that we did get quesadillas. I reassured him we didn't. Meanwhile another guy sitting at our table confessed that he ordered and ate them and the manager did not even apologize. He made a scene at the bar and everyone was staring at us because he accused us of stealing. The other people at the bar I spoke to had similar experiences with the staff here. Do not go here!!!!!!!", "author": "Zaine S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-29", "description": "I was steered to this place by Chris from Brooklyn Industrial. We were talking about great Bread Puddings and he said that Mullanes has one of the best! I would have to agree! It was great along with my French Onion Soup and Chicken Hero!\n\nI would go back next time I'm in NYC!\n\nIf you go remember to tip well!\n\nMiami Guy Here.", "author": "Miami Guy H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-05", "description": "This place has become my new favorite spot! It's super casual and great fun. The staff is always attentive and friendly. I basically live there now!", "author": "Mina K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-11-04", "description": "As others have said, it's your typical sportsl bar. \n\nA decent amount of TVs, decent drink/beer selection, plenty of food options - we had burgers, which were good.\n\nPrices are reasonable. Staff was chill.\n\nNice neighborhood spot with laid back folks enjoying sports - seemed like there were a lot of regulars and people that knew each other, which was cool.\n\nWill definitely be back.", "author": "Adri P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-26", "description": "This spot is absolutely perfect for bar food !\n\ni love the mac and cheese . my boyfriend loves the burger . \n\nGreat drink prices and draft selections .", "author": "Rose R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-09-02", "description": "Had a few drinks here tonight with some friends. Good atmosphere and good drinks. The nachos were good as well. The service was pretty good, sitting at a table by the bar kind of slowed service down but it wasn't bad. Would recommend if you're not in a rush and are just going to have some good times and good drinks with friends.", "author": "Vincent T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-05-08", "description": "Nice little spot, especially in the spring and summer when they have the outside seating going on. If you're in the area for something at BAM definitely recommend it. Decent draft selection and the food is your typical American gastro pub. For all my north Brooklyn crowd it's literally across the way from the Fulton G stop. \n\nI had Elliot's Burger... Pretty good, nothing to scream about, but let's be honest very few burgers elicit that kind of passion. Waitress was lovely but a bit overloaded with the entire outside section. They could use another. I would give it another shot on a week night for sure next time I'm down there for BAM action.", "author": "Kenneth K."}], "servesCuisine": "American (Traditional)", "priceRange": "$11-30", "name": "Mullanes Bar \u0026 Grill", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "71 Lafayette Ave", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/x77IccjKjR3Q3FgSeypIPA/ls.jpg", "@type": "Restaurant", "telephone": "+17187977606"}