{"aggregateRating": {"reviewCount": 326, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-03-15", "description": "I live very close to Mullanes, and I live for a great neighborhood spot that has very simple bar food to counter all of the fanciness that's out there. I order take out and delivery there pretty often I even take meetings there during the day when it's not as busy. I recently was completely disappointed when I went in to pick up a take out order and was treated very rudely who turned out to be the GM!! I walked in to pick up my order and it was visibly busy so I patiently waited for someone to come and take care of my pick up. The woman who came up gave me my total and I gave her cash (I barely paid attention to how much it was I just handed her some cash), she handed it off to the bar tender and told me that he would give me my change. I then waited for him to go get his food for people eating at the bar. I smiled at him when he looked over to let him know I was patiently waiting. Then I said that the woman who took my money gave it to him for change. He yells, \"SPEAK UP! WHAT?!\" I then repeated myself and he went to go get my change. He then scrunched up his face and yelled across the bar, \"46 CENTS!?!??!\" I finally lost my cool and and yelled back at him \"WHATEVER IT IS!!!!! YES!!!\" He handed me my change and said, \"Merry Christmas\" while rolling his eyes. As if! I ordered take out!! Was he assuming I shouldn't have waited for my change because it was busy in there? Because it was only 46 cents? Was I supposed to leave that change for him? Why? Because he was rude? Sorry dude. I waited for my change on a busy night. Didn't mean to put you out. How about this, I won't ever bother you again. Let's see how successful your business is if you make a habit of treating your local customers like that. I called in as soon as I got home and the woman I spoke with apologized and promised a call back they never did, I've never returned.", "author": "Lindsey C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-06-26", "description": "Been coming here for the last couple of years and have to counter some of the poorer reviews that I saw on here. Food is pretty good....it's pub grub so stick with the appetizers and burgers. Irish nachos are the bomb!!! The best thing about this place is that it is a good sports bar. There are more than enough TVs and the bar staff are always willing to accommodate everyones taste. Shout out to Todd who is a really good bartender and one of the reasons we keep coming back for the soccer games.", "author": "Matthew S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2008-09-28", "description": "Comfortable and not too loud. I had the apple salad with chicken, delicious! Pricy though! Not my first choice to go back to but if I wanted to take my dad some place he'd be comfortable and enjoy the food, this might be it.", "author": "Tara B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-03-23", "description": "I don't quite get some of these reviews.......I've been there on numerous occasions and the food is always delicious. Amazing burgers and salads. And trust me, the service is some of the best service Brooklyn has to offer. You don't get the consistent \"I don't really wanna be here\" attitude you get at a lot of spots in the neighborhood. My only valid complaint would be that I almost fell down the stairs going to the bathroom.......and by the way, whats an overcooked frozen cheeseburger?", "author": "Ian S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-21", "description": "mullanes is a unique gem in fort greene.  it's a sports bar, in the sense that it has numerous tv screens that generally show sports, but this is not your \"frat boy, irish car bomb and jager bomb aplenty\" sports bar.  i found mullanes a couple years ago when a friend-of-a-friend worked there and became enamored during brunch.   the friend-of-a-friend has since moved on, but mullanes retains its \"great neighborhood bar\" feel for me.  try the special benny for brunch!  delicious!  granted, there is certainly better food in fort greene, but for the price and for the atmosphere of a laid back, unpretentious neighborhood bar where you can catch a game on the tv and listen to the national, this place hits the mark.  the servers and bartenders are prompt and polite, the decor is more pleasant than any \"sports bar\" i've ever been in, amazing brunch(!!)  and just overall a solid neighborhood place.", "author": "Michelle D."}], "servesCuisine": "American (Traditional)", "priceRange": "$11-30", "name": "Mullanes Bar \u0026 Grill", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "71 Lafayette Ave", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/x77IccjKjR3Q3FgSeypIPA/ls.jpg", "@type": "Restaurant", "telephone": "+17187977606"}