{"aggregateRating": {"reviewCount": 326, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-02-17", "description": "The food was ok BUT the service was the worst service I've EVER had. Our waitress was HORRIBLE! She was very short, curt and  condescending in speaking and dealing with us. We just left a event and wanted some burgers so one of the people with us suggested this place. We asked for the manager and spoke with a guy standing by the bar that was drinking, hugging and kissing on a young lady all the time that we were at our table. He didn't care in the least on what was transpiring and blew us off. So we paid the $127 bill and left. \n\nAs a owner of 3 businesses myself I know customer service is key to your success. This is why we approached management first.\n\nNeedless to say that we Will Not be returning to this establishment.", "author": "Todd P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-20", "description": "Excellent burger and chips. Ducked in to see the Cavs victory. Friendly crowd and staff,  good TV viewing with good beer list. Good value for the buck and location to BAM and Barkley", "author": "William G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-19", "description": "Went back today, haven't been in a while.  Brunch was good, the omelettes were huge.  Service was just ok but we were surprised to see an 18% charge added to the check for a party of two.  We paid cash and they shorted us 49 cents on the change.", "author": "Cary R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-12-11", "description": "If you want a nice sports bar to watch NFL Sunday, I beg you NOT to go to Mullanes.\n\nFor your money, you will get:\n\n-Terrible, rude servers who simply refer you to the bartender, who will ignore you as he gives out shots to people who clearly should have been cut off hours ago (especially odd given it was 4 pm on a Sunday).\n\n-A tiny selection of NFL games, despite the fact that they claim to show all games. I waited for 45 minutes while one game (the BROWNS!) was on nearly every single screen and missed the entire first quarter of the game I came to see. When I asked to change just one screen to the game I cared about, the bartender scolded me for asking and walked away. When I asked a second time 10 minutes later, I thought he was ready to rip my head off. I threw my cash on the bar and walked out. \n\n- Pure astonishment. For a sports bar, this place didn't seem to care at all about people being able to watch sports. \n\nThere are plenty of other high quality NFL bars within a few minutes walking distance, and I highly recommend going to any of them over this place. I watch the NFL at different bars in Fort Greene and Park Slope every week, and this was by far the worst experience I've had at any of them.", "author": "Gabe B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-21", "description": "Staff is very accommodating, food is reasonably priced and tasty. Great atmosphere to be in for music and any sports game you want to watch they will accommodate for you any request!", "author": "Greg T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-17", "description": "Big fan of the bartenders. They understand courtesy. Talk to you and appreciate Tips. Happy hour is decent. Food and drinks. Owner is cool too!", "author": "Dmitriy K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-10-18", "description": "This establishment allows its customers to be covertly drugged so I recommend to everyone to NOT go to this place. I ordered a Hennessy and coke and I took three sips and automatically felt the effects of the chemicals that were placed into my drink. This establishment participates in illegal covert gangstalking operations on law abiding American citizens to make their lives miserable. Gangstalking is an illegal covert operation which paid informants who are usually already criminals are sent to spy, harass and intimidate people in their own community in  attempts to disrupt the person(s) they are targeting. Anyone being gangstalked is put on an enemy of state, combatant or national security list who will be neutralized or silenced. They use the poor people of all nations mainly as well as other secret agencies to oversee clandestine operations to illegally stalk a person or cause harm to a person. People on the list haven't broken any laws and that's why it's done covertly because they couldn't justify committing theft, torture, stalking, property damage and murder to people they view as a national security risk. The Elites are the money behind the wicked gangstalking program to silence those who aren't buying the mass propaganda they have been pushing for years; it's also done to whistleblowers also and used as a form of revenge against certain targets. The entire program is based off lies, slander and false reports in order to cover up the atrocities of those in power and to continue making them look unblemished in the eyes of the public. Even mistakes people have made in the past which aren't criminal are brought up; it's an illegal process which is totally disregarded and permitted by our government and it completely violates our constitutional rights.", "author": "Bigboss M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-02-06", "description": "We came here on a Saturday night around midnight. There were people there but it was not too busy. We were seated quickly even though we were a large group. They had a late night food menu with a good selection of burgers and other appetizers. The appetizers were overpriced but the burgers were both an okay price and okay quality. For example, ordering fries alone was $8 but a burger, which came with a hearty serving of fries was $12-$14. We ordered and the food arrived in a reasonable amount of time. \n\nWhen it came time to pay we had a hard time flagging down the waiter. There were probably six people working the bar and waiting table, so the problem was not that we were being neglected by our server. When we finally got a bill from her we asked for it to be split which took her another 15 minutes to get back to us. We waited another 10 minutes before she came back to take our cards despite having only a few tables to take care of. An 18% gratuity was already included in out bill unfortunately. \n\nOverall, the place was very average but the service was abysmal.", "author": "Jack M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-30", "description": "My friend and I made our way over here after watching a movie. Real nice staff, always checking in and a great atmosphere. Got a turkey burger with sweet potato fries and some good cider to wash it down. Enjoyed my time there and looking forward to making a return again with some friends for a late night time of chatting and laughing.", "author": "Kyle N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-21", "description": "I'm not quite sure why it's taken me so long to review this place. Mullanes is definitely my favorite place to frequent in the Fort Greene area. It's a great place to watch a game, grab some drinks, or simply have a nice dinner. \n\nThere is outdoor seating in the front as well as along the side. The food is delicious and consistent. Even though my boyfriend was super disappointed that they recently removed the fried clam strips from their menu. They have a small lunch special menu as well as happy hour specials. The service is attentive and always comes with a smile. I definitely recommend this place to anyone!", "author": "Candace H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-22", "description": "I haven't been here in a while but I came for my birthday last Monday. It wasn't as loud as I remembered but the televisions and music were pretty high. It's a straight forward bar and grill with all-American food. My waitress was also very sweet and accommodating which I appreciate. I ordered a burger with mozzarella, onions and marinara sauce as well as some fries which turned out ehhh just okay. It reminded me of diner food but hey it's sports bar. For desert I got a simple vanilla sundae with fudge. It was pretty good. The vibe was chill; had a nice view of Fulton Street and the lights were very dim giving off an intimate vibe visually but trust me, it's not an intimate place LOL.", "author": "Amber A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-30", "description": "I've been here so many times and am finally coming around to writing this review. This place is always busy, but there was never a time where my fiancé and I had to wait for an open table. They have outdoor seating with umbrellas, which is nice during a hot sunny day. But they have air conditioning and I never pass that up. So we always stay inside. I've had the BAM burger, which was amazing. The meat was cooked to my liking and the fries were crispy. I've also ordered their nachos with chili and buffalo wings. This place does not disappoint. They also have happy hour - as all bars should! They've got lots of tv screens where there's always a game playing - be it baseball, American football, football, tennis, etc. If you're in the area, I recommend you come and visit this place, grab a few drinks, eat some appetizers and go on about your day.", "author": "Florann E."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-12-11", "description": "For a Sports bar, Mullanes seemed to really not care about putting relevant games on the TVs. \n\nWe went to the bar for a 4pm Jets game, we asked the staff to switch any 1 of the 8 TVs behind the bar to the game, and we were rudely told that only the bartender could switch the channel and that he was busy making drinks. We understood he was busy and gave him the benefit of the doubt for some time, but after 10 minutes asked him to put the game on. He responded with \"Jesus, I'll do it when I can\", then proceeded to ignore us.\n\nI then got a notification on my phone that my credit card was charged $125 (I had only ordered 2 beers and had not asked to be closed out yet), at which point the bartender seemed offended that I would be upset about the incorrect charge.\n\nIt was now 4:25 and the staff had still not switched any of the TVs, with most of the restaurant staff standing around while the bartender was completely overwhelmed. The staff continued to claim only the bartender had the power to switch the TV channels and acted like we were being very unreasonable for expecting a sports bar which advertises showing all NFL games to put on the local team's game when it starts. After another 10 minutes, when we had already missed the whole first quarter, we decided to leave and go to another bar - needless to say it was a far better experience. \n\nVery rude staff, could not be more disappointed with this bar.", "author": "Jonah R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-12", "description": "I'm a regular at Mullanes and I have to say the last 3 yrs has been amazing! Tonight I came and had the best service ever by a waitress I've never seen...Her name is Amber and she was the sweetest soul! So attentive and genuine!! KEEP HER MULLANES!!!", "author": "Chasity C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-11-12", "description": "Whaaaat! No frozen magaritaville because the season changed! What type of place/country is this?!? \n\nForced to go with margarita wait for it....on the rocks *le sighs*. It didnt taste that spectacular. No matter how hard I stirred, the flavors just weren't cooperating, they stayed apart. (Yes I was the crazy 'fro lady stirring at the bar)\n\nThere are about 7 regular, 1large screen tellys in here, the music is loud and we're trying to be heard. There's an energy in Mullanes that you won't appreciate if you're looking for a quite evening in Magaritaville.\n\nThe 2 crab cakes which came with mashed potatoes and broccoli were flavour-less. The MickeyDees \"fish\" burger was more appetizing. \n\nThe Chaos Pie: A layer of brownie, cheesecake, fudge cake, walnuts and topped with chocolate mousse, truffles decorated with walnuts and white chocolate hit the spot. \n\nThe End", "author": "Freeyah-Knycky C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-04", "description": "Good Happy Hour Spot.  Food is great.. good Drink specials. Definitely a local after work spot for myself.", "author": "Tyrell S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-08", "description": "We went to bar Mullanes for some drinks it was a nice neighborhood bar located in Fort Green. We had a great time.", "author": "Phillip A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-23", "description": "Go for the bartenders, not so much the food. Love the people behind the bar and they are always friendly, but $10 for \"nachos\" that have no meat and really are just chips and cheese and not worth it to me. First time trying the food and prolly last, food needs to be worth the price stated.", "author": "Renee B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-18", "description": "I absolutely love this spot. I use to frequent this place before I started being \"fake healthy.\" I enjoyed each meal I ever ordered; from the burgers, to the wings, to their salads. Their drinks are tasty also. I also like the vibe of this place. Everyone is extremely friendly, including the bartenders and the wait staff. \n\nAfter a long hiatus I came here yesterday and the vibe was still good. I'm planning on returning soon after I do my \"fake detox.\"", "author": "Wanda M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-03-17", "description": "Poor customer service. Totally rude and unprofessional. The waitress did not seat me and the bar was full. This man who works took drinks in a cup from the bar. Also he told the waitress not to seat me. Also I am disabled.", "author": "Trisha G."}], "servesCuisine": "American (Traditional)", "priceRange": "$11-30", "name": "Mullanes Bar \u0026 Grill", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "71 Lafayette Ave", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/x77IccjKjR3Q3FgSeypIPA/ls.jpg", "@type": "Restaurant", "telephone": "+17187977606"}