{"aggregateRating": {"reviewCount": 326, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-07-14", "description": "came here to watch the WC final, great vibe, good pub food and the servers did a great job in a more than packed house. Would definitely recommend.", "author": "Steve G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-22", "description": "U.S vs Portugal soccer game was our reason for dining, however we did not go in until the game was done, because they were at capacity. We remained outside, and watched through the window until it was done...then went in. We were seated around the table near the door in the back. Wasn't a big deal seeing as the foot traffic did not bother us any. I had the veggie burger with black beans \u0026 corn salsa with avocado. This veggie burger was one of the best veg burgers I've ever had. It was edamame based, and was so delicious. Usually, when I have any edamame based veg burgers, they're either dry, or falling apart. This one was perfect. I also had the sweet potato fries, and it was cooked to perfection. Our waiter was nice, wore a smile, and provided me with drink alternatives since they were out of the sparkling water I requested. All in all, good experience, and great service. I'd return.", "author": "Jei C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-16", "description": "My wife and I were very pleased with the service here. After completing our order, the food arrived quickly. I had a burger, medium rare, the doneness was spot on. My wife had fish and chips, she really enjoyed the coleslaw and fish. We'd been going back and forth on what to eat for quite some time so the quick turnaround on our order was awesome. There's an excellent chance that we'll be back again.", "author": "Dustin P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-11", "description": "Bar food and beer.  Sort of a simple recipe for success and it is well executed.  Really nothing so amazing but nothing bad.   A great cheap option pre- BAM.  Went for afterwork drinks, had wings and fried zucchini sticks.  Sometimes you just need a bar with food- nothing more.", "author": "Alice E."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-04-24", "description": "Dropped in to catch the Hawks vs.  Pacers game. Cool little bar in Fort Green section of  They had a pretty decent menu, standard bar treats, but not a large selection of drafts ( Booooo! ) . The BIG TV''s and Brooklyn Lagers made it a tolerable", "author": "Keith K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-05-30", "description": "From the outside, this restaurant looks like a sidewalk cafe in the Marais. It is not. It is a SPORTS BAR. The food and drink were ok. They have some kind of Vodka citrus and ginger house drink in a 16-oz size for $12 or something that was kind of good.", "author": "Lira R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-02", "description": "Solid food, reasonable prices, casual. Plenty of TVs to watch the games of your choice. Noisy but vibrant.", "author": "Dana B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-10", "description": "In all honesty, I sought Mullane's out only for access to Olympics coverage.  I live in the 'hood and walk by all the time, but I'm not a huge sports fan and so haven't had the need for the particular bar-prototype Mullane's represents: classic bar food, plenty of beer, reasonable prices and several huge screens showing different sporting events.  But for my figure skating, it came through!  Although it was semi-crowded, I was able to get a coveted spot at the bar right in front of my Sochi screen.  The bartender was very attentive without being annoying, and although I wish they had better wine, it was certainly drinkable and not terribly pricey.  I haven't ordered food--and I'll update this review if it dramatically changes my rating--but I will certainly seek out Mullane's in the future when I have a must-watch on TV and can't invite myself over to a friend's couch.", "author": "Maeve M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-11", "description": "Love this spot! \nMake my way here the most around the summer time when they open the outdoor section. The neighborhood is great for an outdoor dine.\n\nThe calamari here is so damn good. When I lived a couple blocks up I would take a walk over and order a plate of calamari with red wine.\n\nThe veggie burger taste like they got it from their neighbor 67Burgers. It's not that great. BUT LET ME TELL YOU, the lobster ravioli is my absolutely fave her. Most ordered by me when I sit in. Along w/the calamari of course....there is a salad that I like that has slices of granny smith apples that's yummy. Forgot the name of it. Sorry\n\n\nIf you are a sports fan this is the spot to chill watch the game and chug down a couple lagers. Make sure you come early cause this place gets POPPIN w/the sports fans. I'm talking internal/external viewers screaming and acting a fool. \n\nIt also has a romantic feel to it when you head towards the back. \n\nIt's a great spot. Trust me.", "author": "Monique H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-06-04", "description": "Decent happy hour drink specials.  I ordered the turkey burger and fries.  Turkey burger tasted like the prepackaged frozen kind and the fries were undercooked.  My server was very nice.  Will I return?  Perhaps. Perhaps not.", "author": "Mmoiselle A."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-01-24", "description": "Slightly better menu than a typical neighborhood bar in terms of variety but at the end of the day it's still just that - typical bar food.  Service was mixed but what drops it from a 3 to a 2 is the fact that they added an auto tip to a party of four and didn't say anything about it.   We picked up on it after starting to sign the check.   Regardless of party size waitstaff should give a courtesy mention.  The fact that they didn't under a party of 6 seemed shady.", "author": "Jacques V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-06", "description": "The staff is quite pleasant. My friend and I had several bags with us, a suitcase and some other items. The hostess met me at the door and opened it before I even walked to it because he realized I was coming his way with a lot. He also put our bags in a storage space so we didn't have to sit with clutter. Low key environment. Good for drinks or a nice meal.", "author": "Erin C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-06-12", "description": "I don't know why this spot isn't higher rated by others.  Like a few reviewers, I didn't want to like this place, but after getting real tired of Moe's, having Mullanes down the block is a great welcome.  I've always been treated well, but I won't review the food since I don't really go to bars and expect good eats...that's what restaurants are for.  \n\nAnyway, check this spot out if you just wanna lay back and chill out.", "author": "Curtis J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-25", "description": "An old roomie of mine turned me on to this bar when we were out and about, I instantly fell inlove with the neighborhood and the homey feeling of this quaint irish pub. Now, I always turn to Mullanes when my friends and family come into town and we want to go for a light dinner and drinks. \n\nThe bar/resturaunt is so cute! You cant miss the location, the bar sits nestled on the corner of the block, and is painted fire engine red with floor to ceiling windows, during the summer they baracade off a portion of the corner for casual outdoor dining. The interior is exposed brick, soft warm lighting, tv for the sports fan and a movie projector featuring movies and music videos, the table and chairs create a nice traffic pattern.\n\nThe menu is chuck full of one of a kind burgers (including veggie, turkey, beef and angus), comfort food galore and an array of appetizers to either share with a table or just keep to yourself ;). My boyfriend and I really love their appetizers, the fried calmari hit the spot with us! Mac and Cheese, sheperds pie,  buffalo chickenwings, nachos, and burgers are also super good, decent prices, and big portions and easy to substitute healthier options like brocolli for fries.\n\nDrinks are decent aswell, they house a nice selection of brews including local on tap. The hotty-totty is really good!!!\n\nOn the downside of things:\nThe service is kinds terrible, maybe it was just a bad night, but my boyfriend and I had a different person seat us, bring up menus and water, take our order, bring us our appetizer, bring us our meal, and give us our bill. We also had a terrible time hunting down staff for extra napkins, a clean fork, and a cup of mustard and mayo, we ended up getting up ourselves to find everything! \n\nwe will be back, but we will say something if we have poor service again.", "author": "Jessica B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-19", "description": "Kid-friendly bar! Watch sports on the big screens while your kid enjoys chicken fingers and fries. And the burgers are great!", "author": "Camille E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-17", "description": "Service was good, we went around 5pm it was simi empty. The Food was okay we ordered the wings, fried pickles, mussels, and a Quesadilla. While the mussels and quesadilla were good. The fried pickles were so sour it made my mouth pucker. I couldn't even finish them. The wings were slightly overcooked and dry. The drinks are good.", "author": "Imari C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-11-09", "description": "Great place to watch a game, but skip the food.  \n\nA bunch of us watched the World Series at this bar.  It never gets overwhelmingly crowded, the staff is really awesome and friendly, and the noise level never rises to the point where you can't hear everyone else or the tv.  \n\nThe food, however, ranges from just ok to pretty dramatically bad.  Avoid the apple crumble, it was a pile of mushy fruit and mushier dough.  The burger is just ok.", "author": "Natalie V."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-07-04", "description": "Good spot for a beer and to watch a game. They used to have good nachos, but they've ruined them by adding fake cheese that makes all the chips soggy - inedibly soggy. Please go back to your old recipe.", "author": "Sara D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-09-18", "description": "MEH. Food is non-descript, as is service. It's like a neighborhood [insert any chain restaurant] except we have an [insert chain restaurant] a few blocks down. And I don't particularly like chain restaurants given this is NYC! Look elsewhere.", "author": "M P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-03-19", "description": "I've only been here once so far, but I'm really, really looking forward to going back. The exterior, right off the bat, stands out and makes me think I'm about to have a real fun time. The bartender was friendly and funny, the fries were good, and (ok and I know this is a weird thing to critique but I've been in a lot of bars) the bar stools/chairs were really comfortable (ok so I need to know these things-I need to be able to sit there for as long as I want, this is key!) \n\nI'm so looking forward to returning! Once I do, will hopefully change to 4 stars.", "author": "Daria K."}], "servesCuisine": "American (Traditional)", "priceRange": "$11-30", "name": "Mullanes Bar \u0026 Grill", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "71 Lafayette Ave", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/x77IccjKjR3Q3FgSeypIPA/ls.jpg", "@type": "Restaurant", "telephone": "+17187977606"}