{"aggregateRating": {"reviewCount": 326, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-11-07", "description": "I died a little inside when I realized Fort Greene  was home to a sports bar.  Walking inside I could only characterize this as your Mom's Sports Bar if your Mom frequents such places and likes a decent beer with her only passable burger.  \n\nI had the same burger Eric P. did and can only conclude he was drunk or stoned when he ate it. While the meat was rare the fried onions and the horseradish had no taste (which is hard for horseradish!). The fries were also not particularly significant. \n\nMullane's musical selection was also pretty typical of the genre, if not particularly cringe worthy.", "author": "nara f."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-09-13", "description": "Im here today for my mothers birthday. This was one of the many suggestions from my cousin. This isnt really the place for a pwrson in their 60's. This is definitely a lively bar. The waiter we had was sweet as pie. The appetizers were microwaved hamster food. My entire which was the chicken fettucine lacked flavor. However their margaritas(16 oz) are a good starter for a great night. This is really a bar playing a restaurant. I give it 3 stars solely for the drink atmosphere and waiter", "author": "Ashlay D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-07-05", "description": "On any given day, this place can be a hit or miss depending on who's in the kitchen or behind the bar.  The first time I went, the food was okay. My crab cakes were pretty good and my friend had an apple salad that was decent too. The mac and cheese is tasty, but it's on the rich side, which makes it a bit difficult to finish.  The second time I went with a group of friends just to grab a meal before a show. I had a few bites of my gf's shepherds pie, but found it to be a little on the bland side and in general the dish just wasn't put together as well as I know it could be.", "author": "Ana D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-04", "description": "This is the best bar I have been to in my 14 years in NYC. Lenetta the bartender is awesome, she understands what it is to provide great service. She knows how to deliver I will definitely be back weekly.", "author": "Anthony R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-08", "description": "I didn't eat here, went for the honey whiskey shot and rolling rock beer for $6 and I fell in love.  :)", "author": "Marissa S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-07", "description": "I got an iced tea and a garden salad for around $10 and they charged my phone for me while I ate. The Bartender was super friendly and so were the other patrons. Great experience.", "author": "ReG C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2008-01-21", "description": "This place is really just ok.  It is good for people watching.  But really, how hard is it to mess up a burger.  My friend ordered his well-done, but it was bright red in the middle almost borderline rare.  I was trying to be healthy, which is so hard in this kind of place.  I had the linguine with chicken and pesto which is okay.  I've had better pesto at Cafe Metro in the city (see my review).", "author": "Andrew D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2008-01-12", "description": "Uh. \nIf you like Friday's or Bennigan's or one of those other sort of bar food/sports bar-type places that are supposed to feel like neighborhood bars but really are sterile, not-at-all-familiar replications of the real deal, then drop into Mullanes (or, for that matter, move to Denton or Charlotte). \nYes. They do have a happy hour that includes a free buffet but even the waiter said that the food was crap.  And the appetizers that we ordered were a little rubbery.  Honestly: who can screw up an order of jalepeno poppers?  \nDrinks were a bit expensive.  But I kind of, sort of recall an o.k. beer selection.  \nEven though it's right down the street, I doubt I'd ever go there again.", "author": "Cannon H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-10", "description": "Friendly. That is the word I use to describe this place. Even though I'm not a Brooklynite, they made me feel like I was one. The bartender was nice. The clientele were respectful. Is nice.\n\nI'd also classify this place as \"safe\"--meaning, if you're going out with people who can't make up their mind what they want to do for the evening, I think everyone can agree on this restaurant/bar... its cozy, but with plenty of seating. It's got sports on TV, but also is good for a nice chat. The TVs aren't too flashy or loud or distracting for a \"sports bar,\" which I liked.", "author": "Laura E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-01", "description": "Went here to watch the Rangers game and our waiter was attentive but not annoying, the beers on tap were good, the food is mediocre bar food, but you don't go for the gastro pub fare. We will go back, it's a good place to watch sporting and eat some snacks.", "author": "A C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-06-06", "description": "Good local spot in Fort Greene for catching a game cuz they definitely have a ton of screens up by the bar and a huge big screen in the back. The space gets tight though but the food and drinks are decent enough to put you on through a game.", "author": "Sonika H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-01-04", "description": "Nice spot to catch a game! Went for March Madness last year and it did the job. Food is cool.....it's not going to be the best you ever had so relax a bit! Staff is accommodating. No problems with this spot!", "author": "David P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-25", "description": "Ahhh Mullanes....part bar, mostly restaurant, always great for brunch. I recommend the special benny - if you like goat cheese, it's a mind altering experience! The mimosas are on point, too.\n\nGreat place to go after partying in ft. greene/clinton hill or a place to hit up on the way home.\n\nJust go!!!", "author": "Melinda W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-10-08", "description": "I love this place! I have been coming here for the past several Saturday's to watch the University of Miami games and have made friends with some of the bartenders and even a few of the regulars. They are all really cool people and make it a joy to hang out there ad watch the game. The food is pretty good and the drinks are reasonably priced. I keep coming back here for the personal service. I am definitely a fan of Mullanes and it's staff.", "author": "Jacob C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-10-02", "description": "Mullanes is awesome! I live in the neighborhood and am here way too often. The atmosphere is unpretentious and laid back (which is not always easy to find in Fort Greene...) but still has a cool neighborhood/local vibe. Very welcoming and fun...it's a good place to both sit at the bar and drink for hours or come for dinner. Bartenders are cool and the service is always good. But I think the best part is the crowd - its a really cool, friendly mix of lifetime Fort Greene natives, neighborhood locals, people working in the area, sports fans, and people who drop by after a show at BAM. Oh wait, and the fries! Best.Fries.Ever. Seriously, they are so good. The kitchen is open late so I always stop by on my way home friday/saturday night.", "author": "Hannah S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-01", "description": "The food and service are both great.  Coworkers and o got to mullanes often.  A little pricey but delicious food", "author": "Carmen C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-10", "description": "We were headed to the Cher concert at the Barclays Center and we looked up top ten places next to the Barclay Center to have a quick bite. Mullanes grill came up. We decided to give it a try. It's a quick walk from the LIRR and headed their to meet my wife who came from NYC. The bar was crowded and happy hour was in full force. The well drinks were priced right as well as the Stella on tap. We surprisingly got a table and sat down. We had the cob salad and the strip steak. Both were very good. They were playing Cher music and we were very comfortable. The owner manager came by and was very pleasant. We asked if they always play the music that is being performed at the Barclays Center and he said he likes to accommodate his patrons. Which a lot were going to the Cher concert. The crowd was very pleasant  and some  were there for the Ranger playoff game. The owner manager stop by again and asked how everything was and we told we were very happy and pleasantly surprised at the food, the staff and the people. We will certainly make this a regular stop when we are going to the Barclay Center.", "author": "Frank M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-09-07", "description": "NO RE2PECT.\n\nSunday 9/7 at Noon. My girlfriend and I asked if we could watch the Derek Jeter retirement ceremony on one of the TVs. The manager said yes and put it on one TV. We happily ate out sup-par eggs benedict and previously frozen home fries as we watched the likes of Reggie Jackson and Michael Jordan honor a New York legend. \n     At 1pm--just after the Mayor declared today Derek Jeter Day in New york and just before Jeter was to give his speech, the channel changed. The Mullanes manager had switched the channel to an NFL game. He'd not said a word to us, just changed it. Which game was more important? The Jets? No. The Giants? No. The Patriots. Seriously? The Patriots? The ceremony would have taken another fifteen minutes but the first quarter of a week one Patriots Dolphins game was more important? Fine.\n     My girlfriend and I asked for the check. Annoyance showed on our faces, but we understood that Mullanes is a football bar on Sundays. Still, it would have been nice if the manager had told us he was going to change the channel.\n    A minute later, the manager came over to us, shrugged his shoulders, and said smugly, \"That's the way it goes.\"  I'd been expecting him to say something slightly conciliatory but instead I got a d-bag cliche kick in the pants. I shook my head but still said nothing.\n   Somehow me not responding made the short, pudgy manager angry at me. He waived his finger at us and spit flew out of his mouth as he shouted over the bar noise. \"I told you when you came in that I was going to change the channel when the football games started.\" \n     He'd never said he was going to change the channel, but that wasn't my issue. I was annoyed because he was treating us like a couple of 3am drunks even though we'd treated him and his staff with nothing but respect. I spoke calmly: \"It would have been nice if you'd come over before you'd changed the channel and told us, maybe even offered to buy us a beer. And, now you're yelling at us?\"\n     The out of costume Napoleon impersonator became irate. His fat face turned reddish orange like an angry oompa loompa. \"WE PAID TWENTY THOUSAND DOLLARS FOR THIS (NFL) PACKAGE!\"\n     What service industry professional shouts over the bar at his patrons? Does the owner know the manager treats customers like this?  We signed the check (and tipped our server.) Again, I spoke calmly: \"You could have handled this situation a lot better than you did.\" \n   The big baby threw a hissy, flapped his arms, cursed us under his breath, and angrily waddled away.  \n    I live in the neighborhood. I'll never go back to Mullanes. And, I'll share this story about Mullanes with everyone I know.", "author": "Tim M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-02-28", "description": "arrived in the middle of the JETS playoff game....\ncraziness!  the bar is huge and was very packed... but accomodating... everyone was happy despite the large crowds and beer splashing everywhere!\nwe had a group of 4 and put our name on the list for a table\nwhen we sat down in front of a huge tv, our waitress was prompt \nand we all ordered burgers....\neveryone was extremely satisfied.....\nsuch a great place...\nothers around us ordered various items, which looked really good as well... i heard no complaints!", "author": "Ashley W."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-04-17", "description": "I do not understand the people who like  this bar. It is completely generic in terms of decor, pricing, beer selection, etc.  If you need a sports bar you should just walk the mile to 200 5th which, while equally overpriced, has a ridiculous number of tvs to justify the prices.", "author": "Ryne D."}], "servesCuisine": "American (Traditional)", "priceRange": "$11-30", "name": "Mullanes Bar \u0026 Grill", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "71 Lafayette Ave", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/x77IccjKjR3Q3FgSeypIPA/ls.jpg", "@type": "Restaurant", "telephone": "+17187977606"}