{"aggregateRating": {"reviewCount": 326, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-30", "description": "Headed to a concert to Barclays and wanted a sports bar.  Mullanes did not disappoint.  If you are seated in the bar area, there were 6-7 TV's showing a variety of channels.  We had the Mexican Salad and Drunken Chicken with a couple of $4 happy hour ciders.  Good food, good service.  Had outside seating area as well but we wanted to watch soccer.", "author": "Tammy K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-14", "description": "Pitcher of beer for two after a long day, definitely a great way to unwind. Music is great. Staff is friendly (could keep personal conversations private).", "author": "Jenna P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-19", "description": "This place isn't unique and doesn't feel like a cute local spot where you'd want to claim to be a regular. it's actually pretty generic.\n\nthat's why I can't figure out why I spend soo much time there. every time I'm craving wings or some sports tv, which seems to be every weekend (?), it always ends up being the best spot. We keep coming back, and will continue to, because it does what it does well, and despite ourselves, we like it.", "author": "Jody W."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-11-29", "description": "Went there to watch the UT-Nebraska game.  Understandably, most of the tvs were showing Rangers v. Yankees.  BUT the other 3 tvs were on the Michigan game, which was a boring blowout.  They took forever to finally put my game on, which was a much better game.\n\nThe bartender was friendly, and did eventually put on my game.\n\nThe calamari was not good.  A little rubbery, didn't like the breading, and the marinara sauce was bland.", "author": "Ralphia L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-19", "description": "Great bar, good price, laid-back atmosphere.  As far as food goes, they have this burger with a chorizo sausage in it.  The name escapes me, but it's listed on the menu.  Order it and thank me later.", "author": "O C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-04", "description": "I basically hit up Mullane's for football since they broadcast all games.  I was well-received from Day 1 there by Todd, and Will is a really personable bartender.  It can be crowded, so try to get in by noon to find a seat if the game is on near the bar TV's.  If the Jets or Giants play, the game will be on the big screen in back.  The fact that I can catch the Texans and Cowboys there makes me happy.\n\nMy main food there are the wings.  I find them to be the perfect flavor and their blue cheese is tasty.  The prices are pretty decent on the food but I do not order alcohol at the games.  I just can't bring myself to pay $6 for a  cider again.  \n\nI had a burger last time I went and it had a lot of potential except that it was cooked on too high a flame and it was burnt on the outside.  Their hand-cut fries are pretty good, though.  \n\nThe service can be spotty in terms of attentiveness if you're not at the bar, but it's a block from my girl's apartment so that's how I roll.", "author": "Jonah F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-25", "description": "Great atmosphere great food,this place has wifi and tv's over the bar.this place is close to transportation ,take the c train to Lafayette and walk over one block.  Great place to watch the game. They have a ice cream covered in magic shell, drizzled with raspberry sauce topped with whipped cream that is to die for.", "author": "Marsha D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-01-08", "description": "I came here for a late-night dinner and the food was decent. I ordered the sweet potato fries and they were AMAZING.... probably some of the best that I've ever had. I also ordered the Black and Blue (?) Burger, medium well. It was alright until I noticed that half the burger was more medium/medium rare than medium well. I immediately lost my appetite when I saw how much red there was (and the kitchen was closed by this point). The drinks were very strong and delicious. The service was great and the atmosphere was very low-key and laid back. I'd definitely go back again, but I would order the burger well-done instead.", "author": "Michelle H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-09", "description": "This place is great. It's a good, classy sports bar and restaurant. It is spacious as well with seating outside, around a large bar, and in the rear. It has quite a few televisions and often projects major events on the wall in the back. \n\nThe food is good and I personally love their lobster ravioli. The drinks are not the most exotic, but I am not a beer/liquor snob. The service has always been friendly and fast. \n\nIt is also quite airy with large windows and is situated near a lot of other venues like, BAM, a wine bar \u0026 a cigar lounge.", "author": "Sid S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-05-06", "description": "Don't you just hate it when people are late to meet you?  O.K. so maybe I am usually the perpetuator and hate being on the receiving end of unexcused lateness.  Oh but how I digress.  Last week my friend was supposed to meet me promptly at 2:15 after the gym for a day of \"beating the streets\" since it was predicted to be almost 90 degrees in NYC on a Saturday. After she informed me she would be running late I decided to take a seat at the nearest restaurant with outdoor seating to bask in the sun.  I settled in at Bar, since they had a brunch menu and pitchers of sangria.  What's not to like? (besides not having unlimited mimosas).  \n\nOnce my tardy friend came through she wasn't too excited about the menu so we decided on a pitcher of sangria and an order of buffalo wings.  The sangria was pretty bland and disappointing.  It also doesn't help that I went to a party the night before and had some kick ass sangria.  As a buffalo wing connoisseur (yes that's right..there is a such a thing) the wings were also quite disappointing.  I didn't hate them as much as my friend did (evidenced by her furrowed brows and deep frown) however the whole meal in general left us pretty underwhelmed.  When you're planning a day of beating the streets you need a bit more.  Would I come back here?  Maybe, but it wouldn't be on my top places to go considering there are a gazillion restaurants in Ft. Greene.", "author": "Donna A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-05-23", "description": "I liked this place a lot. Stumbled in there one Sunday afternoon because I saw they had the playoffs showing. The service was good. The waiter was polite and prompt. Our orders were prepared very quickly and the ambience was very chill. The food was not over the top but it was delicious and very filling.", "author": "Mike W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-02-10", "description": "I'll be honest; I don't know much about Fort Greene.\n\nBut I know I like this bar.\n\nIt's a sports bar -- well, at least it gives off that vibe. Open the door and step in and it's crowded with folks staring at sports on tv. They have wings and burgers (in fact, a whole menu of similarly themed bar food) and it's got that mid-yellow glare that every sports bar that I've ever been in has.\n\nIt has overpriced Bud Light ($5 for a draft) which seems to be the way you signify you're serious about your sporting adventures in this city (I may just be expecting too much when I order it -- what're you gonna do when you expect free refills on Diet Coke, too?) and it's usually full of people, so much so that when we did find two stools late on a Friday night, we were constantly bumped into as people passed.\n\nOk, maybe they were just drunk and we were kind of being \"those people\" at the bar that you desperately wish would just leave and stop embarrassing themselves.*\n\nThe bar area is up front while there are tables on the back. The squeeze is tight in the middle area as you walk back if you're planning to eat, but it's only really bad if you sit there** for the night.\n\nThe owner came by to make sure we were having a good time, and I guess Mullane is his name ... though I've never heard of that one. And I've been to a lot of Irish pubs. So that's a little odd. And kind of cool.\n\nJust like Fort Greene. \n\n* - I hate myself a little, too.\n\n** - Where do you think we ended up?", "author": "Danny P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-12-21", "description": "Mullanes feels to me like two places rolled into one. \n\nAt the front of the house, it is a casual sports bar with lots of Hi-Def TV's, a decent draught selection (all the usual suspects, Bud, Coors, Blue Moon, Hoegaarden, Sam, etc...) high-top tables and sports crap all over the walls. This part of the restaurant is often cramped and loud, with many locals taking advantage of a generous happy hour served by dependably friendly staff--and this makes it perfect for a drink after work or a late night bender with friends. \n\nThe second part of Mullanes requires you to push your way through the sports crowd to the back of the house, where candlelit tables are populated by young families and couples. While still loud, in the summer an amazing breeze comes in from the wide open doors and is really an ideal place for brunch or an early dinner. \n\nMullane's atmosphere definitely has a split personality, and their food is often hit or miss. The menu is a mix of Irish and Mexican bar foods, and they have daily specials that sometimes change your life (Buffalo Chicken Mac and Cheese!) or leave you feeling abused and disappointed (Ginger Chicken Wings). \n\nOn the expensive side for dinner for sure, but the drinks are always reasonably priced and their happy hour is the best in Fort Greene.", "author": "Michael W."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-01-06", "description": "The bar staff is not very helpful even after I have been here several times.  Most recently after waiting 45 minutes for nachos and having to ask some of the wait staff if they could do anything, I decided that there are other sports bars where I enjoy the food and game at the same time.", "author": "Andrew G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2008-12-31", "description": "After party hopping was hungry enough to stop here on New Year's Eve and was handed a hat, noisemaker and horn, as well as a free glass of champagne. Nicely done! The staff seemed happy to be there, which would not have been my state of mind had I been forced to work on NYE, so good for them.\n\nA number of decent beers on tap, but the bar is not a serious beer drinker's place (no small production stuff, etc.). Good cocktail menu. Ordered a chili with chips (decent) and my brother had a burger (very good and fries were decent). \n\nNice chill place.", "author": "Josh F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2008-01-27", "description": "Great burger, great beer on tap and a really cozy sports bar and grill.  Prices are reasonable, food was yummy and its very close to BAM, which is perfect for a pre-theatre drink and/or food.  The french onion soup also was tasty, flavorful and delicious.  But damn go for the burger, cooked perfectly and served with fresh-cut fries or for a buck more homemade onion rings.  \n\nI will def be back!!!", "author": "steph d."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2007-10-29", "description": "It was midnight on a Saturday night (or Sunday morning -- however you choose to see it). A friend and I were craving a cheeseburger, and we decided to try this place. Either it was delicious or I was drunk and had the munchies. I'm looking forward to going visiting again. I can't remember the name of the burger, but it had horseradish sauce and crispy onions. The slaw and fries on the side was great too.\n\nThis place also has a great selection of beers, isn't overly loud, nice bartender, had a few flatscreens for the sport-Os, and plenty of seating. I really loved it.", "author": "Eric P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-16", "description": "I had such a great time this monday with the lovely bartender Hillary. She made me an amazing margarita that I will never forget. Great place, lovely atmosphere. The vibe was energetic and so much fun!", "author": "Decoster C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2007-08-16", "description": "A few of my friends and I were out wondering, in search of food and drinks on a Tuesday night - WHY?!?!  Why must you be closed on Tues nights, Habana?!?!\n\nWe'd already stopped by Moe's - Karoake Night  and we just weren't feeling the obnoxiousness of the vibe there and the movie 300 playing in the background with all its slo-mo gore glory - and with all the neighboring restaurants closed for the night, we ventured into the nearly empty Mullanes.\n\nThe first thing the 'tender told us was that the kitchen was closed - they close at 11pm, but he said they were working on keeping it open later into the night.  Disappointed, but still without an immediate option, we sat at the pub table across the bar.  \n\nMullanes is a pretty sizable place, with a dining area in the back and bar in front.  It was about 11:30pm when we got there and there were maybe six others sitting at the bar and the surrounding tables, maybe a handful of them wait staff closing out tabs and/or finishing up some food.\n\nTo my delight, they had Duvel and Chimay in bottles.  As for their taps, it was the standard affair; nothing overly exciting. \n\nThe 'tender was a nice guy, who was generous with the vodka for my mixed-drinks drinking friend.  At one point, we went down the street and picked up a bag of tortilla chips and coagulated-cheez-dip in our (now drunken) hunger, and he offered us napkins and what not.\n\nI'll be back to check out their food.  The experience was good enough to warrant a second look - since it's hard to gauge a bar's personality when it's totally empty; unless the bar's personality is the emptiness (which is yet to be determined).\n\n--- --- ---\n\nUpdate: Went back to try their burger and it was pretty good.", "author": "Arthur O."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2008-10-19", "description": "The prices here are stupid; a menu that casual should not be expensive. \n\nAs I've said before, I hate paying nearly 13 bucks for a burger, unless it's like the headiest organic grassfed truffle-oil burger you've ever feasted on. This burger was strictly regular, and their fries were kind of mealy and weird. Get the sweet potato fries, they are much better.\nThe environment was okay, but the music was completely inappropriate for the vibe of the place.\nOverall, the service was bland and flavorless, as was the food. Doubt I'll go back.", "author": "Katie B."}], "servesCuisine": "American (Traditional)", "priceRange": "$11-30", "name": "Mullanes Bar \u0026 Grill", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "71 Lafayette Ave", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/x77IccjKjR3Q3FgSeypIPA/ls.jpg", "@type": "Restaurant", "telephone": "+17187977606"}