{"aggregateRating": {"reviewCount": 326, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-01-19", "description": "Mob scene  45minif you want a table. Mullanes will not take reservations on game nights. Don't bother walking here in the winter. No 7 restaurant takes reservations, same beer and a burger food w/out the aggravation.", "author": "Brittany S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-06", "description": "A standard sports bar with a good crowd and good staff. I have never had any food here but the drinks are reasonably priced. \n\nI've thoroughly enjoyed coming here for a few pints to catch some of the game or to just unwind.", "author": "Zach S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-07-28", "description": "Ended our day in Brooklyn at this nice spot.  We were expecting a dive bar because when we put \"Dive Bar\" into our Yelp search this came up.  No outdoor or window seats available so we ordered our sangrias at the bar.  They were good, the service was good, the atmosphere was fine, and we enjoyed ourselves. Another A-OK establishment in my book.", "author": "MandA R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-21", "description": "We went here for a 'night cap' after Beer Fest. Which sounds completely illogical. And it was. But after being surrounded by hundreds of beer loving buffoons for 3 hours, a drink with less buffoons around seemed necessary to calming down. The bar was crowded when we got there. Kind of expected. Everything surrounding the park in general as a whole was crowded this weekend. But b-ball was on the numerous tvs. I found a seat and parked there to finish my unnecessary pint of BluePoint. The beer and wine weren't outrageously priced for being late at night - $5-7. And the g train was somewhere nearby, which I needed to be guided toward. I'm betting it'd be a great place for happy hour or on a less crazy day though to hang out. I think they have a back yard as well if that helps.", "author": "Ingrid S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-29", "description": "I'm a regular at Mullanes since it open in Sept.  2006.  The Staff that works there are more like family then workers.  I have just as much found hanging with them inside the spot as well as outside. My experience has always been great.  I've learned over the years that the only people who complain are the ones trying to get out of paying for their checks.   Mullanes is an original... Everything since has to step up.... Hard to do.  To my Mullanes Family; love you guys!!!", "author": "Salik K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-10-26", "description": "I am very upset about my last encounter with this place. My friend and I ordered the Margaritas and they were terrible. It was so sweet, it was making me sick. The waiter told me that they would not take it back and made us pay for them because it is \"money wasted,\" when we all know the cheap watered down well tequila is not even worth the price of the drink. Lets get real! #pissed #sorrynotsorry #foodwascoldtoo", "author": "Jessica B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-07-17", "description": "I used to come here all the time to watch games. During the World Cup final I showed up early and was standing inside waiting for my friends for less than 10 minutes when the manager asked everyone to leave if they had no beer in hand. Understandable. I heard him from behind me while i was texting my girlfriend who was on the way. Before i could even finish texting and buy a beer (10 seconds max) he grabbed my shoulder from behind and said 'Hey you! Stop ignoring me!' \n\nI respectfully responded that my friends were on the way and asked if it was necessary to grab a customer from behind and embarrass them in public. Instead of realizing his mistake he simply told me to leave immediately and walked away. \n\nI NEVER go to places without paying for something to support the place so i get why you want people to buy something. But you don't disrespect a repeat customer who has been to your bar many times over the past few years and brought friends and family each time by grabbing them, ordering them about and asking them to leave after 10 mins. (To clarify the game hadn't even started, there was a ton of people but it was not packed, and no line outside.)\n\nI'll be honest and say Mullanes is usually really cool. The waiters and bartenders have always been great and super friendly. However if that guy is the management and you care who your money goes to then don't go here. I am really disappointed that my money has gone to such people (if that's the management).", "author": "Kwame O."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-02-15", "description": "Decent food and pretty good happy hour but the service is terrible. I have been here twice and both times, I was very disappointed with the level of service. I know this is just a bar and not a five star restaurant but still. \n\nThe first time I came during happy hour and  our server was super slow. Everyone knows that time is a factor during happy hour and he was moving at a snails pace as to limit the amount of discounted drinks that we received.\n\nThe second time I came on a slow night and our waiter was barely present. We also needed extra dressings and silver ware and those two simple things took forever to come out. Eventually, my boyfriend had to walk up to the crowd of wait staff that was just standing around and ask for our items again! \n\nI do not know if the food is good enough for me to come back.", "author": "Camille S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-11-19", "description": "If you want to see the best busboys in the city at work then this is the place for you.  Went there twice, hoping the first time was just a fluke.  But, management is rude and surly.  The wait staff is unattentive and indifferent.  Perhaps dreams of waiting tables in Manhattan occupy their minds.\n\nFood is nothing special.  Typical sport bar/pub food.  I'd rather give my money to someone who appreciateds my business.  Let me mention, I came with a large group who were hungry and ready to drink.  Saw an earlier post and maybe management has a thing against large parties.  But, I can assure you we outspent whatever tables would have been in our place.", "author": "Michael S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-01", "description": "I really love this place! Good place to hang out with friends or a quick date night place. Now if you are looking for a place that is quiet, this is not the place .. keep in mind it's somewhat a sports/burger joint. Kitchen stays open late, so its good place to come if you are looking for a great burger or after a concert drink ! I always order the turkey burger which btw is delish!!  Only complaint I got is the drinks are sorta weak :(  but great place", "author": "Judeline J."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-01-01", "description": "I would give 2 stars if the portions were smaller so I didn't have to eat as much shit. \nChicken strips? Tyson chicken would have been better because it wouldn't have tasted like deep fried leather. Seriously, I've had juicier chicken mc nuggets. \nDo you love deep fried batter? Do you hate sea food? Order the calamari! No nasty fishlike creatures involved. \nMac'n'cheese? Kraft easy mac is better, faster, cheaper.\nAND with all if this delicious food comes an 18% gratuity charge for a party of 2.", "author": "Erum S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-23", "description": "If you can catch a seat outdoor please do! it's always packed, but there are tons of flat screens inside to get your sports ON.  Optimal People watching, and sun basking with shades.", "author": "Dililah S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-29", "description": "Russ was a great waiter. Had a delicious dinner accompanied by several appetizers. Perfect distance to Barclays Center! Def try the Mac n cheese and tacos!\n\nThe mullanes steak had an awesome glaze loaded with flavor. All was very fresh! \n\nSalmon was cooked to perfection", "author": "Ashley A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-11-18", "description": "I ordered a chicken Quesadilla from here only. The Quesadilla was good. I don't see myself hanging out there though because of the noise level. It was way too loud for me. I grabbed my food \u0026 ran out of there.\n\nThey have a rule that you can't sit at the bar unless you are drinking. I didn't appreciate being kicked away from the bar, but I do appreciate them for having this rule. Non-drinkers tend to take up way too much time at the bar \u0026 the drunks need those seats to get shit faced.  \n\nI'll definitely be back for another quesadilla but in my Jay Z voice \"that bout it\".", "author": "Nafeesha P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-19", "description": "Best bar food you may ever eat. Def puts other bars to shame with how tasty their menu is. Always a go-to for me. I can always depend on NEVER being disappointed with the quality and taste. I always try taking someone here for the first time.  The location is perfect and is always a good 'meet up' spot for someone not too familiar with the area- due to it's corner location and bright red paint decked out on the facade of the building. LOVE Mullanes.", "author": "M. S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-11-14", "description": "Came here with a friend last night for dinner before going to a basketball game at the Barclay Center.\n\nMy friend and I both had turkey burgers (my first time trying one) with well done french fries. Everything was good but nothing I am craving a trip back for. I didn't really see anything else on the menu that I was dying to try on another occasion, so I would probably only come back if I was in the area and wasn't really sure where else to eat.", "author": "Arielle S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-21", "description": "Love this place their mac and cheese are soo delicious!! Every time I  go thats always what I request....nice low low spot to go n hang with friends...the  margaritas are strong n will do the job! ( the house special margarita)", "author": "Liolene M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-09", "description": "Pre Stones at the Barclay and the whole Shadoobee crowd was there. Mullanes blasted out The Rolling Stones Music while we ate, drank and shared Stones memories.\n\nGreat beer selection, an excellent turkey burger with mozzarella and avocado and home made fries. All done just right. \n\nThanks to the crew at Mullanes for starting off our evening just right.", "author": "Adam K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-08", "description": "Renewed faith in this establishment... I hadn't visited in quite sometime due to a bad interaction with a drunken patron.. Today, after a ROUGH morning, I sat at the  bar for a drink and wings.. Will shed some sunlight on my previously gloomy day.. His welcoming demeanor and great convo rid me of my Monday morning blues!! I'll definitely be back soon!!", "author": "Opal G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-17", "description": "I've been here a few times. Good bar with several flat screens and ample seating at and around the bar. Decent restaurant area in the back and outdoor sidewalk seating available. Usually a good, mixed crowd. The food and definitely the drinks are reasonably priced and good service. \nAll the food I tried was pretty good. Went for brunch twice and got the salmon scramble with tomatoes and capers each time. For a dinner I had a traditional caesar salad the appetizer wings (those were just okay) and the yummy mac n cheese with bacon, just the right amount of cheese. The bread pudding dessert, I typically prefer to be a little more firm, but it was good nonetheless. \nAll around good place for a casual dine and on my list of go-to places in the area.", "author": "Shaquana L."}], "servesCuisine": "American (Traditional)", "priceRange": "$11-30", "name": "Mullanes Bar \u0026 Grill", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "71 Lafayette Ave", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/x77IccjKjR3Q3FgSeypIPA/ls.jpg", "@type": "Restaurant", "telephone": "+17187977606"}