{"aggregateRating": {"reviewCount": 326, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-07-27", "description": "Service : Terrible.\nYesterday, I had to wait an excessive amount of time for the young blonde waitress to take my money for the bill.\nShe was too busy being spaced out,  twiddling her thumbs and twirling her hair in LALA land. Eventually, I just got up and  went to the the bartender to pay my bill.\nI asked for a receipt and the bartender said they do not give receipts.\nWeird.", "author": "roni D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-06", "description": "Their Mac and cheese with buffalo chicken and jalapeños  was my dream true. It's exactly what I've always wanted from Mac and cheese.", "author": "Danielle D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-06-23", "description": "My partner and I are house/cat-sitting right down the street from Mullanes, and yesterday after my evening run, I was really in the mood for a thick juicy burger, fries, and a cold beer, so I convinced Margot G. to accompany me to Mullanes (I believe I referred to it at the time as \"that sports bar thing right on the corner\"). \n\nI wasn't expecting all that much except a typical bar burger and a beer (honestly, who expects more than that from a sports bar?). However, several unexpected things happened last night: first and foremost, when I opened the (heavy) door to get in and turned to let Margot in first, it closed unexpectedly with my hand still in it (I'm still not sure how that happened). Several muffled curse words later, I got it open and rushed inside holding my hand, and the hostess was nice enough to get me some ice. We went about ordering our drinks and food and thought nothing more of it except for the fact that my right hand now hurt. Keep this part of the review in mind for later; it's important.\n\nI ordered the burger with cheddar and fries, plus a Toasted Lager while Margot ordered a new IPA. One of her friends from her internship was meeting up with us too and when she arrived, she had a Blue Moon. My burger was cooked like I asked and tasty, and everything seemed typical of a sports bar experience (with the Yankees losing badly on the TV screen). The server comes up and asks if I'd like another beer, and it went something like this:\n\nHim: \"would you like another beer?\"\nMe: \"mmmm...\"\nHim: \"well...you know you're drinking for free tonight, right?\"\nMe: *blank stare* [thinking] is he hitting on me with my partner sitting right next to me? [saying out loud] \"...huh?\"\nHim: \"you're drinking for free tonight! I heard that my door shut on your hand earlier tonight, so...you're drinking for free aren't you?\"\nMe: *blank stare* \"uh, wha...oh, uh, okay!\"\n\nAnd so I gladly accepted my second Toasted Lager of the night. These are the times where I wish I was a little less responsible in my life because on a Wednesday night with work the next morning, my policy is pretty much \"time to leave\" by the time it hits 11 p.m. in order to get to sleep around midnight. But true to form, they comp'd both of the beers I had (woo, I'm a party animal woo), which was a nice $12 off an already perfectly manageable tab.\n\nWho knows? If our house/cat-sitting operation gets extended through the summer, I may just turn out to be a regular here for my short time in the Fort Greene area!", "author": "Shea D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-01-01", "description": "The food is actually 3 stars, but here's why I give this place a whopping 2.\n\nI went there to enjoy the final game of my team's regular season (rather than going to my usual pub in Cobble Hill), as my poor guys didn't make the playoffs and were hoping to finish the season with a respectable (sort of) 8-8 record.  The place was packed, and luckily there was one TV showing the game, and a handful of people watching it.  The Bloody Mary was nice/spicy, and the food was solid.\n\nTowards the end of my game, unfortunately for me, one of the regulars complained that the game she wanted to watch was on a TV too far away for her to enjoy and asked that it be put on the TV I (and some others) were watching, so the bartender (despite the fact that a few of us indicated that we WERE watching and we wanted to see the end of the game) changed the channel to show the game that was already on another TV, and killed our game at the 2 minute mark, so I and the handful of fans watching the original game were s--- out of luck.\n\nHuh?\n\nUsually if a patron (regular or newbie) is watching a game, the bartender will 1) confirm that nobody is actively watching a game before switching it, or 2) put the game on another (perhaps less popular) TV to make sure that the patron(s) get to watch the game they came for.  Neither happened in our case, so my \"game that didn't matter\" went dark.  I couldn't say \"Check, please\" fast enough.\n\nI guess Mullanes doesn't want my business.  Bummer.  I will happily walk a mile to my usual joint where everyone gets treated like a regular, not just me.", "author": "K G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-24", "description": "I was expecting..you know..bar food.. but the meals here are actually awesommmmeeee. I tried the wings, buffalo burger and the mac \u0026 cheese and they were all delicious! I've been here twice and both times I received great service. Prices are reasonable, my friend and I shared a bottle of Riesling with our meal. I would definitely return next time I'm downtown.", "author": "Ria R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-08", "description": "Pretty decent sports bar. Went here on a Friday night around 9 and it wasn't too crowded. Good selection of beers. Got the nachos and BBQ wings and they were pretty good. Average but definitely a place I'd return to when looking for food and drinks in the area.", "author": "Erin M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-02-24", "description": "I popped into Mullanes (no idea how to pronounce it) for brunch on Sunday. It was right up the street from BAM Harvey Theater, where I was seeing a show that afternoon, so the location was perfect. Also, props to it for not having a wait.\n\nThe atmosphere is \"blah.\" The space wants to be cute, but comes off bland and awkward. It wasn't offensive or anything, but I did find the interior to be noticeably lackluster.\n\nThe staff were very friendly and the service was prompt. I ordered the nutty banana pancakes and could have eaten 3 plates of them. They were delicious. It bothered me, though, that they were served with melon. Why not strawberries or blueberries or something similarly banana-friendly? Melon and banana are an odd combo to me, but then again, that's just my opinion. The cream dollop on my plate was strangely sour, which may or may not have been intentional. Over all, I would have been happy with the delicious pancakes and a coffee. Keep the melon and dollop.\n\nBottom line: the food is good, the service is fine, the location is convenient and the ambience is whatever. I'm not rushing to return, but wouldn't say no either.", "author": "Keith T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-03", "description": "Love this place. Have for years. The nachos, salads and BURGERS are divine!\n\nThe manager is not the warmest person around but I really enjoy this place. If you are a major league sport enthusiast, this is where you want to be. It gets live. \n\n*BTW I much prefer these turkey burgers to 67 Burger. I really like that onion hay but other than that, I don't get the big hoopla about that place.\n\nYay Mullanes!", "author": "Ray C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-03-18", "description": "All we did was drink here after the A10 tourney.  The food I saw go by me looked and smelled delicious.  Everyone was friendly, from the servers, bartenders, and even the regulars.", "author": "Tawheed H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-05-26", "description": "My turkey burger was very dry, which I sorta understand because it's turkey. But my turkey burger toppings - bacon, blue cheese and Buffalo sauce - were merely mixed textures of salt (crispy salt, creamy salt, wet salt). I love me some salt, but it was a bit much. Good thing I could wash it down with a $4 happy hour Stella. And believe you me, a $4 pint of Stella in this neighborhood is a screamin' deal... and the source of star #3.\n\nThe fries tasted a bit freezer burnt, the slaw was meager but tasty, the service was minimally polite (\"how'severything?okay?good\"). No reason to go back, but if I lived around there I could go for another one of those cheap happy hour beers.", "author": "Tara R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-17", "description": "I live in Bushwick, so this is prime proximity for me.  I do love the mixture of a bar restaurant so, its always a good choice no matter who i'm hanging with.\n\nOnly problem I have is, with the size of the drinks you do tend to run up your tab pretty fast.  Or maybe that only applies to someone like me who rather have drinks over food. =/  \n\nEither way, great staff and great place.  Love it.", "author": "The Q."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-02", "description": "I consider Mullanes my Cheers.  \n\nI live in FG/CH. I can go there almost any night and see a familiar face.  I've met wonderful people through Mullanes...some, I know will be lifelong friends.  But that's not why you'll read this review, here's the important stuff:\n\nThe Food:\nMeh...just ok.  The burger is the best option. The rest is, again, just ok.  Stay away from the steak.  As much as I love the place, I really wish they'd work harder on the food.  The menu rarely changes.  The fact that only burgers are offered on the dinner menu and not other types of sandwiches is odd. When I do eat here, it's because I've drunk so much that anything will taste good.   : |   Sorry Dave (the owner).\n\nThe Crowd:\nIt's a sports bar!!!  You can't expect deep, heart-felt conversations with perfect strangers.  I don't go to Mullanes for that. You go to get lost in a game.  To meet friends for a game or to just revel in the energy of the crowd during a game. Again, I've met great people here, but I've also met losers.  C'est la vie....it's a sports bar. \n\nThe Service:\nI LOVE Miguel and Ben.  Those are my bartenders and they take great care of me.  Will, you're good too but sometimes a bit spacey.  You know this, but you also know this is why we like you.  The rest of the staff is always friendly and kind.  Again, I've been going here for awhile so I'm considered a regular.  I don't think I get special treatment.  The staff at Mullanes is simply awesome.  If you've had a bad experience there, I'd gather it was a fluke.  Bad servers don't last long.\n\nI give it 4 out of 5 stars because of the food.  I really wish the food were better.  That said, I'm on a diet so it's kinda good that the food is only tempting to me when I'm high, which isn't often.    : )", "author": "Dionne T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-05-06", "description": "I didn't eat - just went for drinks and a playoff game.  It's a big (tall), festive place, especially when everyone is cheering a team.  That said, you probably don't want to go on such nights if you want to have quiet conversation.", "author": "Jonathan E."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-06-23", "description": "When you live in/are visiting a neighborhood such as Fort Greene or Clinton Hill, with plenty of great restaurant choices, there's no need to waste your time on mediocrity. Yelp's description of a two-star rating - \"meh. I've experienced better\" - expresses my sentiments toward Mullanes spot on.\n\nI've eaten here, I've had delivery from here, I've just had beers here - but I've never been impressed here. In terms of food, the sweet potato fries (which are cut thick - so there's potential there) are always soggy \u0026 overcooked to the point where you can't really tell that they were orange. The burgers make you want to sneak over to 67 Burger just down the street. The salads are not bad, but they're far from perfect. The crowd isn't great if you're there for drinks \u0026 a game. \n\nIt's just not worth it.", "author": "Julie S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-06-27", "description": "The Short:\n\nIf friend's want you to go here with them and you have to go then go and it will be okay. If you have a choice, choose otherwise.\n\nThe Long:\n\nI went here with as a party of six and there was only one person who was truly satisfied. The Mullanes itself is a good looking bar. There's lots of seating, and a nice bar area. The whole place is spotless and really gets your expectations up.\n\nThe food is average, and way too overpriced. I had beer battered onion rings as an appetizer and not only were there only 8 onion rings on the plate but they were swimming in oil. Don't get me wrong, I love fried food but this was just disgusting. One of my friends had the veggie burger and she didn't even finish the thing. However, another person got the mac and cheese and absolutely loved it. \n\nThe service was atrocious. We were seated and it took them at least 10 minutes to come to our table to actually get drink orders. You should never be ready to order your food when they ask for your drink orders...this is a very very bad sign. Also, the waitress looked really annoyed when I asked for a refill on my soda. Then when I finished the second one, she asked me if I wanted another one using a slightly snarky tone. I know it's a lot of soda but I was thirsty and it's technically her job to serve me.\n\nI agree with the reviewer who said \"there's no need to waste your time on mediocrity\" 100%.", "author": "Carlo S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-16", "description": "It's been 7-odd years since I've been to Fort Greene. Food tasted super good after swinging on the trees and a one-layover flight from the west coast. Listened to some Jimmy Smith then Jimi Hendrix on a new old style portable turntable, I've stepped into Brooklyn. Faithfully Forum Blue, the Lakes were in Golden State so the local block away-American bar was our mission. Tall ceilings, monitors playing sports, we split the Americans huddled in their teams to a table in the back with a perfect view of our game. American food fed our bellies. Me with my Shrimp Scampi on a bed of rice pilaf and perfect broccoli, Pancho got a double burger with blood still in between its edges and fries. The food was aiite. To me the flavor of my entree didn't warrant the cost but hopefully this is isolated to a sports bar overcharging for being a sports bar. Damn shame. I asked for a spoon and I got the Danny Devito brother. My food was delicious but it didn't have a wow factor and hence no fifth star nor a photo opp. The rice, as seasoned as it was, the texture was too firm for my liking. The rice cooker was clearly not Filipino with that mid range temperature/time choice. The lemon wedge was a bit dry. The devil is in the detail. The Lakers got served 136-115, it'll be a fun and long season.", "author": "Aleks F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-21", "description": "Great place to watch a game with a drink.  The food is pretty good too.  They make a pretty decent burger and the fried pickles are awesome.", "author": "Bryan C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-15", "description": "Loved this place. My waitress was awesome and great with the 2 children we had with us. Plenty of crayons and a placemat sized activity sheet for them to color. I had to sneak a few fries from the kids and they were yummy! My blackened Salmon was AWESOME!", "author": "Nasilele H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-02-22", "description": "Good for a drink, nothing special. Sports broadcasted on the flat screen tvs!", "author": "Alice L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-09", "description": "I went to Mullane's last night for the Jets-Colts game. We got there at about 7:15 and were really nervous that we wouldn't get a seat. The bar was packed but we wanted to eat - they have incredible bar food. The waitress took down our name and less than 5 minutes later we got a seat in the back right in front of the projection TV. Perfect! They gave us no issue about sitting there for the rest of the evening just drinking after our meal. The food was delicious, the service was great, and the crowd was awesome.\n\nMy only complaint was that the manager was basically pushing people out of the larger tables. I understand he wanted to turnover as many tables as possible and make the most money he could, but it's rude and unprofessional to continuously ask a table of customers, watching the game and still enjoying their beers when they are leaving. We were lucky to not be bothered but this experience will definitely be something I think about when planning a big game watch with my friends.", "author": "Brianna C."}], "servesCuisine": "American (Traditional)", "priceRange": "$11-30", "name": "Mullanes Bar \u0026 Grill", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "71 Lafayette Ave", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/x77IccjKjR3Q3FgSeypIPA/ls.jpg", "@type": "Restaurant", "telephone": "+17187977606"}