{"aggregateRating": {"reviewCount": 326, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-16", "description": "I've come here time and time again over the years. Mullanes is a borderline see-and-be-scene hotspot during summer weekends for the Ft. Greene/Clinton Hill/Bed-Stuy set, which might seem unusual for a place that is essentially a bar. But this place benefits from being in the perfect location at the crossroads of Fulton and Lafeyette, a popular thoroughfare for bars, restaurants and (mild) nightlife.\n\nBest bets for food: The BAM Burger and Fort Greene Burger are winners, and the fettuccini is pretty good as well. A lot of people rave about the mac 'n' cheese, but I was rather underwhelmed when I tried it. Stick with a burger and beer or cocktail.", "author": "Sierra B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-01-02", "description": "I got the sweet potato fries...the sauce is kinda weird. I opted for good Ole ketchup. The fries aren't crunchy so there's that. I also got the warm Apple cider alcohol is optional... I opted out, $2 upcharge avoided...nice atmosphere typical sports bar feel. Close to BAM so it's a great place to catch a quick bite before a show. 3 stars for lack luster fries, but awesome location and feel.", "author": "Talicia J."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-12-28", "description": "Just an ok sports bar with sorta mediocre burgers. The only real positive is it is one of the few places in the area serving food late.", "author": "Joe B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-28", "description": "Came here last night and had such a blast w the bartender (Owen.) Will definitely go back, this time a bit earlier lol", "author": "Katherine Q."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-26", "description": "I love the wings here. The Turkey burger is delicious and the sweet potato fries go well with it. One of my favorite plates I usually get is the rigatoni, I put chicken and shrimp in it and ask them to make it spicy to give it some kick.", "author": "Luke H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-24", "description": "This past Monday , I visited Milanes Bar \u0026 Grill . The bar was very clean , but the service was even better. Everyone was friendly and energetic . Drinks was lovely and My waitress Aneshia Reid did a amazing job . My food and drinks came out in a timely manner . Aneshia made us feel like we was at home at our dinner table . I would love to come and visit this bar again and have Aneshia as my waitress.", "author": "Samantha D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-05", "description": "Went here for a quick bite and some drinks.  we had the appetizer platter and that was pretty good i liked the little chicken tacos  the best. the drinks weren't as strong as i would like them to be but that was OK. if you come with a guy be prepared for him to be distracted by the huge TV showing sports which i s guess is a good thing for sports watchers lol . other than that the staff was nice and brought out extra sauce when i asked and kept the drinks coming quickly.", "author": "Bianca H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-21", "description": "Cool staff, multiple TV's are great for a sports junkie. Also plenty of seating inside and outside. Food is consistently good.", "author": "Sean D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-06-17", "description": "From a few years ago until now the service has really dropped off. Even the food that used to be somewhat tasty isn't good anymore. What a shame because this is good place to watch some sports being that they have all those TV's.", "author": "Isaiah S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-20", "description": "Great food, drinks, fun. Went for a St. Pattys day and although there was a large crowd we didn't wait long for a table. Good was excellent and table service was good. The blond bartender was not so friendly but hey can't win them all. Definitely recommend this place.", "author": "Adriana T."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-12-21", "description": "Went here to watch football one Sunday. Things were going okay, food was pretty good, and we had a really friendly server. The early games finish, so it's time for the Giants game (remember, this is the local team). The game has been going on for a few minutes, and they still have yet to put the game on. So naturally, we ask one of the servers if they can go to the game. He says sure. Few more minutes, still nothing. So we ask the bartender. At this point, there are multiple TVs showing just commercials after the earlier games finished.\n\nFinally, a bartender grabs the remote and tries to find the game. She seems to be struggling to find it, so someone from our table tries to tell her it's on the local Fox channel, not Red Zone. She and one of the servers tell us that \"they know what they're doing\". After yet a few more minutes, it's obvious they don't so we try again to just tell them what channel it's on, but we get the same \"this is our job, not yours\" deal. Come on, it's the NY team! How can you not find this game? They eventually turn the game on, but this is where my reason for the 1 star becomes obvious.\n\nA little bit into the game, we actually hear the bartenders making fun of us for telling them what channel the game was on. Weird, but whatever, we'll just watch the game. Then, one of the servers comes over and mocks us TO OUR FACES. We just ignore him to watch the game, but he keeps going! I didn't know what to say, I was so shocked that multiple staff members here were making fun of us for requesting the local sports game. We left after the game, and we definitely won't be going back.", "author": "Megan F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-12-24", "description": "Great atmosphere love the sports bar-type. Not too crazy about bartender. Cocktails was very weak. Service was good, but the cook had an off night.", "author": "EM W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-20", "description": "When I worked in BK this was my favorite local spot. Went back a few days ago after 2 years and it didn't disappoint. Ordered after happy hour, unfortunately buy prices are reasonable. Had a Fort Green burger (juicy and tender)  with sweet potato fries (non greesy) and it was amazing. Glad it hasn't changed.", "author": "Vanessa G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-03", "description": "Mullanes, it's always an good backup option whatever the case is in Fort Greene. Oh, bar is closed? Mullanes isn't. Want to grab dinner but the line is too long? Mullanes has plenty of seating in the back for a meal. Fuck, this place is cash only? Mullanes takes credit. Weren't looking to drop so much cash today? Mullanes is inexpensive. \n\nI'd be lying if I didn't like other options in the neighborhood but Mullanes is a great one. It's also a great place to catch a game or go to for happy hour. \n\nIt's also a good spot if you want to eat out side on those perfect weather days.", "author": "Mitch E."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-12-14", "description": "Unfortunately, nothing really stood out to me at Mullanes...in a word, underwhelming. I think this place really has the potential to be someone's local sports bar and watering hole. Lots of beers on tap, lots of space at the bar, and plenty of table tops (with more room in the back I think) The bartender was nice enough and attentive enough, except for when we actually needed him (for more drinks and/or our tab). Food was decent - fries with chili and their soup...but again underwhelming. Would i come back? Maybe as a last resort, but there are certainly other bars/restaurants around the area that can help liven up your night out.", "author": "Dianne R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-01", "description": "Had lunch here twice, first time had the Sheppard's pie and second time had the Mac and Cheese with Shrimp and Bacon. Both were amazing. Lanetta is a fantastic bartender with a great personality. Love this place and can't wait to go back.", "author": "Dan P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-31", "description": "Cool place if it's not a packed sardines day. \nBar that serves food. I love the tavern feel. \nSurprisingly the ravioli is yum for bar food.\nThey have big tv's so it's good for sports events", "author": "Anna K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-18", "description": "Flies/gnats hanging around ruined it inside for us. Yet, the Food was very good: the BBQ sauce for the wings were lick your finger good. I loved the fries, they had the right amount of crisp. My home girl had the BBB burger (no sauce) \u0026 was very happy. I Had the open-faced Reuben sammich \u0026 enjoyed what I ate of it.. But those darn bugs...\nWill definitely go again, but will not sit in the back by the TV. \nMajor plus.. Food came quick \u0026 I mean quick.\nDowners.. $0.25 for an extra sauce? Not much but dang. Ooh, happy hour rum punch was $8.27, regular $9.  Where they do that at?", "author": "K W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-02-10", "description": "I consider this to be a sports bar. Lots of screens and only playing sports events. (Clearly, Websters has nothing on me). I came here on Superbowl Sunday prior to the game to enjoy a cider with a friend before the rush. Happiness for me was knowing that they keep Magner's cider on hand. I'm kind of sold at the point. Also, if you get a bit hungry, they offer lots of snacking options to fill that craving. They get a good crowd, but it has no overwhelming personality. Quality neighborhood bar.\n\nNot really a place that I'd come to for hours on end, but I'd be willing to stop by from time to time.", "author": "Nyota W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-06", "description": "**this is a great sports bar/ restaurant for you and you boys or girls wanna watch the game on several tvs and get inti the whole sportsmanship\n\ncame here one sunday night with my lover. was cool the waitress act as if she hadnt taste anything in menu before when asked how sum of the menu items \n\n((i had the steak it was great!!\n*my lover had the lobster ravioli that was good too))\n\nand from the others looking onto our plates with watery mouth yes indeed we tore the food down and left.\n\nif not the biggest sports fan id advice u to sit toward the back \n\n-will be back again for the food with friends next time \n\nsigned\ni love to eat \u0026 i do it consistently \n\nmr.von teese n lovers experience **", "author": "Tyshawn V."}], "servesCuisine": "American (Traditional)", "priceRange": "$11-30", "name": "Mullanes Bar \u0026 Grill", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "71 Lafayette Ave", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/x77IccjKjR3Q3FgSeypIPA/ls.jpg", "@type": "Restaurant", "telephone": "+17187977606"}