{"aggregateRating": {"reviewCount": 326, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-10-12", "description": "This bar seriously has to clean their beer lines, or get fresher beer - or maybe both. When a Sierra Nevada Pale Ale on tap (which should be a heavenly expression of citrusy whole hopped goodeness) tastes like a generic batch of fermented barley water, and a Lagunitas tastes like field-of-garlic and chopped onion mess, something is wrong. They need to inspect their beer lines because they are probably real funky. Or they need to work on their pipeline of fresh beer because it's just not right.\n\nI have nothing against anything else about this bar. The neighborhood needs a reliable sports bar and the service is not bad, those are good things... \n\nBut, the beer is off.\n\nAnd as a bar, that's a dealbreaker.\n\nI would love to hear from the owner how often they clean their beer lines and how they keep their kegs fresh.", "author": "Greg S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-04-20", "description": "It's the most square place around here, and that's alright.\n\nIf you're coming here to eat, you'll get a good menu of salads, burgers, sandwiches, and other barish food too eat. They do a very good job within these parameters, and the portions are generous.\n\nAt night, it is basically a sports bar. Sports bars are not really my thing, but by what I can see, they do a good job of it. There are a ton of TVs with all the games going, and a crowd that is into it. The staff is professional and low key. You can hangout here and feel comfortable here all the time, maybe not with a lot of style, but plenty of comfort.", "author": "John S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-19", "description": "The food was excellent, and the bar tender made me feel welcome after I told him it was my first time at the pub.  I enjoyed watching my N.Y. Rangers win on their flatscreen T.V.  I truly enjoyed the experience.", "author": "Orlando F."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-05-06", "description": "I've always been in this area for other foods... and yea, I'll continue to be in the area eating and drinking elsewhere. Horrible management that cant seat people(many many open tables), food is absolute SHIT. Like its pub food but come on have some pride! \n\nJust to double back. I'm not a pushy guy, so when I see 2 tables next to each other I use my brain on how to seat 3-4 people together. I was told they could or wouldn't be able to push to two tables together.  So shortly after a group of about 6 walks in they had a table for 4 the same douche manager then grabs another table and slides it over for them so they can accommodate them .  Don't want to call it a race thing(and I'm a light dude) but... lets just say I felt a certain way about how we were treated.", "author": "Justin B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-12-28", "description": "Everyone raves about the burgers here but they're not impressive. In fact the food is just okay and so is the service.", "author": "Arielle D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-21", "description": "After an intense workout at Crunch Gym, I decided to have a meal here with a friend. I ordered the Pan-Seared Atlantic Salmon $17.00\nPan-seared in a citrus herb butter, it is served with seasonal vegetable and your choice of potato: baked, mashed, or french fries. The price was reasonable, the quality and quantity of the meal was good as well. Order this meal entree and you will be satisfied. TRUST ME!!!!! I've got my Masters in Yelpology.", "author": "Dre D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-10-04", "description": "Sweet neighborhood bar. Mostly generic bar food and beer selection. Fun after work space to chill and decompress. Everyone is nice and be nice to everyone.", "author": "Juan S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-11-05", "description": "I thought long and hard about leaving this post. I decided I should. The customer consideration part of customer service does not exist here. Around the 17th of last month October I went in to this restaurant for a late lunch with a friend. I had a great attentive server. I JT. Our meal came out to $52 and some change.Happy was great here. I left him decent tip $15. I left there happy. The following day I looked and saw that not only was my card charged for the $52 it was also charged $230 something dollars...It was an incorrect charge. Almost 300 dollars for lunch for 2. smh. Normally the procedure when you are charged incorrectly is you are given a void receipt. I received no such thing. I called and spoke to the manager Steven I think a very nice irish man... as nice as he was even after finding the error from the night befores records and contacting the server who made the mistake and was aware he had charged my card 2x in error but neglected to make me aware of it.. He seemed very nonchalant about my money. I explained to him that I wanted my money back asap. This  day was the weekend Sat to be exact, and of course nothing much could be done. He assured me that the employee had voided the transaction and that the processing of my card for the transaction would not go through. The Irish manager promised me he would contact me on Monday to follow up. I told him, the server was an excellent server, I hoped he wont get fired, a reprimand would be in order because he was careless and negligent not letting me know what he had done. Monday came and went... The money was not put back into my account by this establishment. I had to call my bank and cancel the transaction. Till this day I have neever received that follow up call from management or from anyone even after I called to state my disappointment and left a message about the money not being voided. They never took care of the problem THEY caused me. I am super disgusted with Mullanes and its employees lack of professionalism consideration AND honor. I no longer like this place. Look at your check, and check your account before you leave this place. a $52 meal might end up costing you $300 dollars.", "author": "Victoria H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-06", "description": "This is the spot, we've moved out of the BK but whenever we come to visit this is a staple. The burgers are delicious however now that we are vegetarians the salads are the best. Crisp clean taste and the dressing was light and satisfying to the palate. The service was wonderful, food as always delicious and we dined alfresco on a beautiful cool night. I always share this location with others so that they too can have a great experience.", "author": "Vonye B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-01", "description": "I really like Mullanes. Great taps, solid food and the happy hour is impressive. They can get packed for bigger games and I like to come in the afternoon for lunch and a couple of pints. Yay for Brooklyn bars opening before 4p! Lovely bar staff and service is good. Go. You won't be sorry you did.", "author": "no n."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-06-26", "description": "We were having just drinks at the bar when the bartender came up to us and decided to move our seats in order for another couple to sit there because they were going to eat and drink while we were just having drinks. Bad service and bartender", "author": "Karina S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-13", "description": "Good food. Great service. Fast Service. Outside seating. Strong Drinks. Friendly atmosphere.", "author": "Reggie M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-08-27", "description": "I still have no idea why this bar is loved so much. I like it but people rave over it...very interesting to me. What can I say? It's a reliable neighborhood spot,  knowing that your drinks will be acceptable and your  food edible. The service is up to par and the servers are attentive.  Their prices are reasonable and have decent drink specials. I guess I kind of answered my own question! It's a local bar with decent food and drinks with a pretty cool decor. It's aiiiiight. \n\nGreat place for a first meet and greet date.", "author": "Doris S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-12", "description": "Great spot in Brooklyn. Another random find that worked out well. Went for a quick drink and app. Got the mini chicken taco rolls and was happy with them. Not a packed place, but was full, which was nice.  Server was helpful and friendly. Would go back to this place easily.", "author": "Ryan M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-11", "description": "Was looking around with my wife for a lunch spot and we found this place after a next door yelp suggestion didn't fit what she wanted. We walked in after seeing a delicious looking omelet being rushed to a nearby table and decided to give it a try.\n\nThe setting is great, with plenty of indoor and outdoor space. Even if every table was full we would have felt comfortable enough to talk crazy.\n\nThe service was friendly and fast. Lots of smiling faces that didn't hover about too much while we ate. \n\nAlso... The food was fantastic! Well presented with great portions. I had steak and eggs with home fries and there was nothing I needed to change (except for salt. Because I love salt on everything.) My wife had cinnamon french toast: \"it was prepared with just right amount of everything.\"\n\nDefinitely the place to be and were definitely coming back.", "author": "Alex C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-02", "description": "Stopped by this place because I was hungry and wanted to try out a new spot being that I was in Fort Greene. It was a Wednesday afternoon around 3pm. The waiter seemed cool and professional. I ordered a burger with home fries then waited for what seemed like less than 10 minutes then all of a sudden the staff that I had seen scrubbing the table and chairs brought me my food and not the waiter that greeted me. Nevertheless the food was good, but I couldn't get the fact that the guy cleaning up bought me my food. If not for that, I would have given these guys 5 stars for sure.", "author": "Terrence V."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-06-10", "description": "I ordered take-out. I ordered a $20 pasta dish, ok,  it was lobster but it was only 5 lobster ravioli that came with the dish.  My complaint isn't the price or the amount of food.  I knew both of those things already.  \n\nMy complaint is that as a pasta dish, any pasta dish bread should've come with the meal and if I had been dining at the actual restaurant I would've gotten it.  \n\nI called the restaurant since it's only 2 blocks away from my home and asked for bread to be sent over. The girl on the phone checked with the kitchen and came back saying the chef had told her bread isn't given with this meal. \n I gave the girl the above reasons why I wasn't happy and she went back to the kitchen.  She then came back to tell me bread was on the way to me.....  \n\nBut then I had to call to complain again because the chef is clearly a comedian .... \n\nHe sent me 3 squished pieces of bread that sadly looked like Wonder Bread trying to be something more, it certainly wasn't the kind of bread that went with a pasta dish ....\n\n If you're not going to have any respect for the customer who's spending money,  \nIf you think it's ok to insult the customer then maybe you shouldn't be working.\n\n And just because a person is not sitting in a restaurant doesn't mean the amount and quality should be any different ..... especially if your expected to pay the same price .....", "author": "Brenda L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-11-04", "description": "This place use to ROCK!!! food, bev, service.... everything! \nThe bar is now bleh ... drinks are weak and just horribly mixed.\n\nThe food and service is still decent... \n\nIn addition to the food and service the huge TV in the back that blares football .... keeps me coming back.", "author": "Innocence D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-04-02", "description": "this review is solely based on their chilli fries, as I wasn't there long. but as a true yelper, thought i'd leave a note. . I honestly didn't think it was all that, although if it was ordered as a group thing, I wouldn't mind stealing one or two. \n\nI will definitely come back and try more things for sure! The place is very spacious and I can tell that it's probably a packed place on the weekends. \n\nThe staff were attentive and polite.I'll give more/less stars on an upcoming visit.", "author": "Wesleyan T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-04-02", "description": "Not a bad place. Came here for a late lunch on a Saturday afternoon. The front is a sports bar and as you walk further back there are tables set up. Its a nice cozy place. I got the hot wings and mac n cheese. Neither were anything to write home about but I enjoyed them. I also had the apple crumb for dessert which turned out not to be apple crumb but was like some mushed together apples or something..so skip dessert! We had a great attentive funny waiter who even charged up one of our iPhones that had died while we sipped on our wine. I liked it. I'd come back if I was in the area.", "author": "Melissa S."}], "servesCuisine": "American (Traditional)", "priceRange": "$11-30", "name": "Mullanes Bar \u0026 Grill", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "71 Lafayette Ave", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/x77IccjKjR3Q3FgSeypIPA/ls.jpg", "@type": "Restaurant", "telephone": "+17187977606"}