{"aggregateRating": {"reviewCount": 326, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-04-09", "description": "I went to this place to watch the game. The place was fairly full. After waiting to be seated. Two rude people rushed into the seats my friend and I had been standing behind. Seconds later a table opened up in the bar area. We were thankful and glad we didnt sit at the bar.  After going to order our second drink, the owner quickly gave our table away and insisted that we had just came and were not at the table. He saw 2 other people of the ethnicity and assumed it was us.  He said \"I am the owner and you are not sitting here. You can sit somewhere else. I insist you sit somewhere else. And if you dont, someone else will.\"   He was condescending and rude. I will never go back and suggest one would think twice about going.  There are many other places better...", "author": "Lee M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-02-19", "description": "How badly do I wish that Ft. Greene had another sports bar? Really, really badly. Mullanes has the market cornered, even though it's just all right. Decent beer selection, but not great. Food is OK. It's the definition of OK, which in a market as sparse as Ft. Greene's is, well, they're killing it.", "author": "Riley B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-16", "description": "Amazing place great service with a great staff. Sergine Felix the host is bright and always energetic. The food is always the best, smiles and great specials.", "author": "Ghany A."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-11-17", "description": "$7 bucks for a plate of french fries!  $8 after 10 pm!?!\n\nGood god.  This place has a lot of TVs, but they really can do better than charging those kind of prices...even in brownstone Brooklyn", "author": "Pedro M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-05-14", "description": "What a great outdoor space with a great view of prime Fort Greene. Service was fast and courteous and the kitchen is open really late. The restaurant is pretty big. They have a bar with TVs.\n\nThe food was decent. I had the crab cakes and mashed potatoes, which kind of tasted like it was made from an instant mix.:-( The chicken parmesan was okay.\n\nThis is a great space and I'll definitely be back to try out more menu options.", "author": "Zenovia E."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-02-28", "description": "Fun place to watch an NBA game! Affordable happy hour buzz... wish they had happy hour food specials, also. \n\nSingle, heterosexual ladies... you can leave the heels at home. I have a funny feeling many of the guys here are not checking for you. (No offense)\n\nIt's a great place for super casual Irish nachos, beer and sports. They have a decent selection of beer on Tap.", "author": "Amanda M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-27", "description": "Solid neighborhood bar. Had some really fun afternoons here during the Eurocup. Was crowded for the semi-finals and finals but otherwise pretty decently packed. People are fun, especially behind the bar. They don't shy away from paying their customer's enough attention and guaranteeing satisfaction. \n\nThis is certainly a sports bar, so you will have several different games playing at once. Their screens are nicely positioned and it's not hard to follow whatever sport you are interested in. \n\nThe food was solid Irish cuisine. I can definitely recommend their veggie burger and quesadilla. Frozen cocktails are also nice, especially during the hot summer time. Otherwise their Bloody Mary is well mixed.\n\nIf you're in Fort Greene and find the bar of your choice to be crowded (which can often happen, especially since that nuisance of a Barclays Center opened up), you should swing by.", "author": "Laura K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-27", "description": "Great sports bar! Lots of TVs so you're sure to be able to watch whichever game you may be interested. Good food and conveniently located just a few blocks from Barclays center. Bartender Miguel is the best!", "author": "Christian M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-15", "description": "This is definitely one of the better sports bars in Brooklyn. During a big game this place is not for the faint of heart, it gets packed and the sports fans no how to cheer for their teams. \nThe staff is top notch, especially the bar staff. \nGreat options for how you want to enjoy the evening, at the bar, indoor and outdoor dining areas all high quality and spacious. \nI have come here for drinks and to watch a game with friends, its always a fun time. I've even brought a few dates there on non-big sports nights with positive results. \nIve enjoyed the fish and chips on several occasions and the wings are amazing.\nFor a great experience check it out during a big sports event.", "author": "Kurt N."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-07-18", "description": "Bar Mullane's is a pretty non-descript no frills kind of spot. I have been there twice on a Friday after work. They offer a free buffet but it isn't anything too exciting or fresh for that matter. They have a happy hour deal $6 for-a beer (Rolling Rock) and a shot (choose from two types of well liquor-it was something like bourbon or scotch-no vodka) until 7pm. The last time I was there it took a while to get the bartender's attention, he was the only one there and I felt blatantly ignored. It gets a nice crowd, so somewhat noisy but totally acceptable for a bar. It is conveniently located between the C and the G trains but I only go here to meet coworkers-otherwise there really isn't any draw or anything that makes this place unique or interesting. Just a place to grab a beer if you happen to be near I guess.", "author": "Marisa L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-07-25", "description": "Went with a big party to watch World Cup women's soccer and they first refused us a table because we weren't ordering food. The place was nearly empty!. We had kids with us, so we weren't allowed to watch in the bar area. \n\nAfter agreeing to order some appetizers, we sat, waiting for a few friends to join (we were four people). The hostess asked me three times when they were coming and seemed bothered by the fact that they weren't there. Again, the place had probably 6 free tables!\n\nI understand when a place is packed that they don't want people nursing a drink for ages or reserving lots of space, but this woman was really unpleasant for no reason. Won't be back.", "author": "Alex P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-10-30", "description": "Just because they have sweet potato fries, they deserve a 4-star rating!!!!\n\nActually, their food was great although they really don't have lots to choose from but big ass screen tv does a good job especially when Yankees are in the playoffs :D", "author": "Ernie K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-09-14", "description": "Ok so we all know MNF has to be watched in a nice sports bar and that is the exact atmosphere you'll get here. A good amount of TV's all showing the game, a decent amount of table tops and a nice size bar with high tops in front. Food was good tried the trio app. Buffalo wings were the best needed to be tossed in buffalo sauce more, mozzarella sticks a little over fried and mini tacos good but dry. The BAM burger was delicious. Beer selection is decent have a good amount of American and craft and offer pitchers which is always good during a game. As for drinks tried the cooler and definitely had to much ginger beer told our wonderful waiter sunny about the dislike and she bought us her manager. Don't remember his name but was very helpful in selecting a new drink. Down fall is he tried my drink after I told him what I thought was wrong with it. Many red flags there 1. The customer is always right (coming from in the biz) and 2. Ewww you obviously know I drank this and you don't know if it was from the cup or straw. Besides that will probably come back but stick with beer and try some new plates. Hats off to sunny new waiter but has it under control. One suggestion would be to step up beer knowledge for during game times.", "author": "Alexa F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-04", "description": "Good time at the bar. The bartender was pretty chill, but she charged me for a Long Island iced tea when I ordered a 4-2 Slam (great drink btw).", "author": "Ivan B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-27", "description": "If you don't try their burgers you're missing out. The drinks are awesome for the price! This is the go to spot for the family, couples, or sports fanatics. I came here for the World Series and was sold on every other sporting event. It's super close to Barclays Center so it's a great place to go to after a game as well. :)", "author": "Hanif C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-16", "description": "Great spot for turning a quick Tuesday Nets game into a 4am Event!!  We originally tried Mo's (not impressed).\n\nThis place was a great change of pace, lower key, larger space.\n\nWaiter Service was great, he had waters coming the whole night even though we only ordered Shots, Beers and Wine, my body the next day thanks him for that.", "author": "Billy W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-11-26", "description": "This has to be amongst the worst places to eat in the Fort Greene neighborhood.\n\nTheir dishes are almost completely comprised of out-of-the-box ingredients.  The veggie burger looked like a microwaved Boca burger.  The mozarella sticks looked like the ones that you can get at the corner deli.  The mac and cheese wasn't cheesy and required me to season it because it was bland.  The nachos- you know it's bad when an establishment screws up nachos- had both unmelted grated cheese on the bottom and the liquid out-of-the-jar cheese sauce on top.  Worst of all, half of those plates were garnished with the same out-of-the-box salad squares that tasted horrible!\n\nCombine those four dishes with three beers and you're looking at a $70+ check after tip.  Outrageous!", "author": "John K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-08-05", "description": "I really like Mullanes! Me and some homies (Liolene what up dawgs dem lol). It was pretty late i think a little after 1am. But the kitchen was still open.  I had a turkey burger and it's one of the best turkey burgers I've ever had. Service was pretty good. Can't wait to go back during the day and eat outside.", "author": "Erica P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-01-04", "description": "Clearly all this bar cares about is making an extra dollar. On a busy Saturday night, we waited over an hour for a table and when the three of us were finally seated we ordered over $60 in drinks and two dishes. Then we were told that they needed us to move our table over so they could fit in more tables. Then a half our later when we were only drinking and not eating, they told us they needed to take our table apart so three of us had to cram into a tiny two person table. Sitting basically on top of the person next to me is not a fun experience. Won't be returning. But the waitstaff was great, this is clearly a management issue.", "author": "Megan M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-20", "description": "While this isn't a standout sports bar, it is most definitely a solid 4-star establishment. The handful of times I've been here, the staff has always been courteous. The food is good. The mac \u0026 cheese is quite tasty!!! And I'm a complete mac \u0026 cheese snob.", "author": "Janie Z."}], "servesCuisine": "American (Traditional)", "priceRange": "$11-30", "name": "Mullanes Bar \u0026 Grill", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "71 Lafayette Ave", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/x77IccjKjR3Q3FgSeypIPA/ls.jpg", "@type": "Restaurant", "telephone": "+17187977606"}