{"aggregateRating": {"reviewCount": 39, "@type": "AggregateRating", "ratingValue": 2.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-25", "description": "I ordered the grilled chicken - guacamole all day special and it was super filling!  Rice, beans, salad and a warm tortilla is included. \nOh and a soda can too! I got all of this for 8.25! \nSuper convenient for when you're really hungry and don't want to spend much. \n\nIn terms of flavor I think it was ok.\n\nI would def come back again.", "author": "Amanda D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-05-18", "description": "The worst customer service...I went there on lunch break...i ordered a tostada salad with shrimp as i dont eat meat so being that i only had a few mins left on break...instead he gave me chicken...i called the store to get the right order delivered and told him he can have the incorrect order back but he's going to tell me he  had too many customers to remember who I am...I told him I had a receipt but it was left in the store I also told him I was there 5 mins ago if that and have him a full description of myself ...in which he responded he gets 300 to 400 customers so he can't remember...keep in mind I told him what he and his other female worker in the store was wearing and in the 5 mins that I was there he only had 1 customer...so in 5 mins you cannot tell me it was so busy that you can not remember who I was...no more service from me", "author": "Sam C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-30", "description": "I love this place because it's fast, convenient, and definitely very \"yummy!\" I love the vegetable burritos  and the pinto and black bean tacos, since I'm a vegetarian. It's quality \"fast food,\" and is very affordable.", "author": "Rocco O."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-06-14", "description": "It works in a pinch but the wait sucks and its not beef so much as premade chili mix in a tortilla", "author": "Noah S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-07", "description": "This place has some great chicken bean and rice. The green sauce here is amazing, just the right amount of spice. The beef and rice isn't as good as the chicken but still good. Would recommend for quick food", "author": "Alex C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-10", "description": "Very filling tacos steak soft juicy melts in your mouth. Planiing to get more. Sour cream and cheese", "author": "Jackie V."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-04-13", "description": "Let's see, how do I start? Well the first thing I noticed was that it looks extremely tacky. The place looks as if the color orange vomited on it and they didn't bother cleaning up. Not only do they have Christmas ornaments hanging, but they have Christmas lights as well. They have signs written in marker, one of them saying \"Cash Only\", which is unfortunate. I was going to order an $8 meal with my card but only had $3 in cash which bought me a chicken taco.\nFirst things first, the \"tex-mex\" food is made by Asians. I have nothing against them other than the fact that I don't believe the food tastes Mexican. In fact, the chicken in the taco tastes like chicken teriyaki. I could only imagine that's what they're using. The taco comes with chicken, lettuce, tomato, and American cheese, wrapped in a flour tortilla. To be honest, the poor quality can only be excused by it's cheap price. At least it doesn't taste horrible, but I would just rather eat at Taco Bell.", "author": "Christian G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-15", "description": "i normally attend yummy taco in manhattan by 59th st.. and i love the food, it's affordable lunch place for this graduate student. I always got the chicken and cheese quesadilla", "author": "Kerry L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-11", "description": "Right next to this business I notice some  Asian food restaurants. I might very well have to try some food then then write a report. Service was fast at Yummy Taco. We decided to take out our orders as we had just returned from lunch at a restaurant in Flushing Chinatown of which I will review another time. It was a long ride back to downtown Brooklyn so we decided to stop here and try some Mexican food. I tried the burrito while my friend tried the fajitas. I would rate the burrito 8/10. I have eaten better tasting burrito when I used to be out in California. But this is acceptable if you want to eat Mexican. There are some chairs in there if you chose to sit and dine in. The decor is so so. The menu seems extensive. So I will have to return to try out another dish another day. I notice that all the fried chicken joints around that area have disappeared. People are looking for more healthier foods instead of the fried stuff.", "author": "Wayne S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-12", "description": "Love  this tex mex spot hands down. Best hangover food. The tacos aren't expensive \u0026 are best eaten fresh. The food doesn't take long to make. Perfect cheap lunch.  Isnt much to say although they don't give u much sour cream", "author": "Brianna K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-04-18", "description": "So the place is called Yummy taco and looks like it is a Tex-Mex fast food place.  I came in here after doing some shopping today at Macy's when I realized I would be home too late for lunch. \n\nI looked at the menu and ordered the vegetable soup ( which came with tortillas according to the the menu) and a shrimp taco.  It didn't take long to get my food. I decided to eat the soup in the restaurant. The soup had broccoli, white button mushrooms onions and a piece of grilled chicken cutlet cut into slices.  It tasted more like Chinese soup than Mexican. I was given one small pack of  pico de gallo.  I used that for the soup. Since i wanted one for the taco when I was done with the soup I asked for another container of pico de gallo and I was given it.  \n\nWhen I ate the shrimp tacos, it contained 4 shrimp, shredded cheddar cheese which was not melted lettuce and diced tomato.\n\nBoth the shrimp and the chicken was well seasoned., moist and tasty.  The chicken was grilled which was a surprise since it was in soup.", "author": "Suresh D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-01-23", "description": "Their guacamole nachos were such a disappointment. I am annoyed I consumed all of those calories. The only reason I continued to eat them was because I had some hope that in some weird way it would hit the spot. Nope. Nachos were hard and stale, guacamole was watery, cheese was scarce and the plating was very unappealing.", "author": "J A M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-07", "description": "Was in sort of a rush when I came across this place. So I said what the heck, let me give it a try. I ordered a steak quesadilla, nothing special and I must say it was pretty good. Although I wish I had onions and tomatoes in it..but that is my fault for not stating that. The best part about the quesadilla for me was the tortilla wrap lol. All in all I would go back to try something different ! Oh and prices are pretty reasonable as well :).", "author": "Krystal R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-20", "description": "Love this place,, fresh hot food made quick, I like how they sautéed their peppers and onion for the shrimp fajita I always order - the tortillas are fresh made the kitchen is open so u can see them prepping and cooking everything Decently priced as well, buffalo wings are nice and crispy, quesadillas are simple yet delicious I like the mixed veggie with fresh broccoli and mushrooms with cheese of course and  they take phone orders My order is always hot and ready when I get there", "author": "Brenda B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-02-28", "description": "Mexican food made by Asians?!?! Yes please. When you want some good ol low quality food, this is your place. This is going to be your favorite dive spot. After a morning of day drinking nothing hits the spot like a tough chicken taco and finger licking buffalo wings. Always get extra sauce cause it thin and doesn't go far and you'll need the extra sauce for the dry ass chicken. I know I sound like I don't like this place but I actually really do. Sometimes not so great food still hits the spot. Isn't that what make Mcdonalds so popular?", "author": "Wendi W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-08-16", "description": "Not YUMMY stay away. Had lunch with a Co worker. This was our first time so we ordered the hot wings and fries special $4.99. It was disgusting, chicken was dry and bland. The sauce was watery and didn't cling to the chicken. It was not worth the price. That's what I get for being inpatient and not waiting in line at my regular place. Stay away from this place.", "author": "Tracy P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-08-16", "description": "Ducked in quickly for lunch one day.\nNothing to write home about. \nWon't be going back.", "author": "Pallavi B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-11-18", "description": "Alright, all these previous terrible reviews must have their taste buds in a twist. This is the only place you can get a grill taste off the steak/chicken. I have to admit their tortillas can be a bit chewy and thick but for the price and portion size this place is good. \n\nGood: Awesome grill taste, big portion sizes, good prices, fresh sour cream\n\nBad: Chewy tortillas, long lines and slow service, and the cashier kind of yells at you. 'WHAT KINDA SODAHH?!'", "author": "Eugene K."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-12-22", "description": "Mushrooms from can.\nGuacamole was brown and tasted like soap.\nThey didn't really toll up the burrito, just folded in in a tin foil such that everything falls apart.\nTin foil is thick and will cut your lip!", "author": "B H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-11-26", "description": "I was a little thrown off when I entered this restaurant and there were two Chinese young girls behind the counter. They must've saw my confused look and said \"Welcome to Yummy Taco\".\nI ordered a quesadilla and waited almost 15 minutes for it. Considering the fact that the place was practically empty it should've came out much quicker but oh well.\nThe food taste fresh and was inexpensive (expected it to be a little more due to it's location). Of course it's not the best Mexican restaurant but it'll due for now. \n\nOverall: If I'm ever in the area and craving some authentic Mexican food I wouldn't come here. But if I want something inexpensive that resembles Chipotle then I might stop on by.", "author": "Chantel H."}], "servesCuisine": "Mexican", "priceRange": "Under $10", "name": "Yummy Taco", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "52 Willoughby St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/ALvR3YM7CCpofnaXd7iT3Q/ls.jpg", "@type": "Restaurant", "telephone": "+17185226880"}