{"aggregateRating": {"reviewCount": 39, "@type": "AggregateRating", "ratingValue": 2.5}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-04-05", "description": "Ever since my friend introduced me to this place... Ive been going every week! Honestly this cannot be authentic but at least its close enough when Im craving for a taco!", "author": "Bonnie T."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-08-14", "description": "This place is mediocre at best. The food us usually soggy or dry......never in between which sucks. \n\nThe prices are okay and the staff if really nice but I'm guessing people dont go there for the great service.\n\n*cash only*", "author": "Quincy T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-17", "description": "Food here is pretty darn yummy to me. Today, my order of chicken and shrimp with yellow rice tasted really fresh and clean. My small order was rather large and served to me piping hot. My shrimps were pink and crud free. Not usually a fan of dark meat but Yummy Taco makes me happy to take a ride to the dark side. Wish we had a Yummy Taco or any type of tasty Tex-Mex takeout on the Fulton/Nostrand side of town. Good food, dirt cheap. I can dig it.", "author": "Tanya R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-11-06", "description": "If it could give this place zero stars I would. The food was awful. I ordered a chicken burrito and had no flavor. The chicken was burnt, the rice was dry, and the lettuce was not shredded. The guacamole was pre-packaged, not fresh. The tortilla was thick and rubbery. When I asked for extra salsa, the lady said she already gave me one and I could have no more. I then asked for hot sauce instead and was told that they did not have any hot sauce. A Mexican place with no hot sauce? How is this place still in business? Stay far away!", "author": "Danielle D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-04-17", "description": "Cheap \"Mexican\" food cooked by people who are definitely not Latino in any sense of the term (I'm going to go with Asian... specifically Chinese...).\n\nThat being said, I can get two grilled chicken fajita entrees delivered hot to my door for $20 with tip in under 20 minutes! Now that is freaking amazing. The serving portions are pretty decent too. I always save half for leftovers the next day. Is it the best food ever? No. Is it satisfying? Yes.\n\nNotes: Make your own guac since theirs is awful. Oh and use your own hot sauce. If you really want to be a freak like me, use nonfat Greek yogurt instead of their sour cream and swap out the white tortillas for whole wheat ones at home. Ta da, a somewhat healthy dinner in a hurry when you have no energy/time to cook!", "author": "Leslie D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-22", "description": "Brand-new place, bright, super-clean, and open late on a Sunday night.  I like it already.\n\nI am an easy read--my standard Mexican order is the Veggie Burrito.  Here it is $4.99, very hefty, including black beans, rice, cheese, and a variety of veggies such as mushrooms, broccoli, etc.  The tortilla was very fresh-tasting with good chewy texture.  It was served in a take-out tray with garnish of diced tomato and shredded lettuce on the side; a glop each of sour cream and acceptable guacamole; and a little mini plastic container of un-chunky salsa.\n\nThe quality was quite good.  As noted, the tortilla was tasty and sturdy, and the standout ingredient in the stuffing may have been the bold, flavorful rice.  Veggies seemed fresh, crisp, and not too soggy.\n\nA very satisfying experience--I'd eat here again for sure.", "author": "Billy W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-06-05", "description": "Horrible service and food. Ordered a tostada salad, my salad barely had chicken and I was charged  extra for dressing that should have been included with the meal. Very rude. When I asked the lady taking my order to explain why my food cost so much, she responded by yelling, \" look at your receipt,  I dont have time for that.\" I will never eat here again!!", "author": "Keisha M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-05-09", "description": "Ugh. Terrible, terrible tacos made from one flour tortilla, chopped up ICEBERG lettuce, and bits of meat. Couldn't finish it. No bueno.", "author": "Georgia J."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-01-24", "description": "I don't know about their other food, but my chicken taco was sick. (Not in a good way) I don't eat meat, but when I do its chicken or shellfish and I expect it to be good. I ordered on seamless. The delivery time was great, but as far as the food goes - my chicken was burnt and tasted horrible. Don't even waste your money. Even though its easy on the wallet.", "author": "Kaitlyn S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-08-11", "description": "Yummy is not the word. I ordered a black bean burrito with guacamole and was served a soggy mess of ingredients wrapped in foil. The cheese wasn't melted, black beans were mushy (more like refried beans) and the burrito wasn't even to close to wrapped, it fell apart the second I opened the foil. Not good at all.", "author": "Jade B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-04-05", "description": "Its fast and hot and inexpensive,  but you get what you pay for. The quality of ingredients is not there. The guac is horrible. The chicken and steak are cheap tasting. Big portions is a plus.  And fast delivery", "author": "Paul L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-21", "description": "Great lunch selection, Have not tried anything except Chicken Quesadillas and their tortilla are made on site fresh. Cant beat that for under 5$ meal. My place to pick up fresh Tortilla to combine with my homemade curry leftovers.", "author": "Pluto G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-11-09", "description": "I was released for lunch from jury duty and needed a quick spot to eat. Decided to try Yummy Taco for the first time.  This Asian run Taco spot (will someone please explain this phenomena to me) was clean and the service was pretty fast.  I warn against losing your receipt before your order is up because the cashier lady can get pretty testy.  The tacos themselves were really good.  I only take off stars because in my 2 minute walk back to the court, my chicken tacos were already cold, which leaves me to believe they weren't piping hot to begin with. Also, I'm guessing that you have to ask for sour cream as chick did not supply me with any.  Grabbed a menu and learned that they deliver. Holla!", "author": "Toy L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-05-05", "description": "Apparently now when you serve jury duty, they give you these neat little maps so you can find quick eats during your lunch break. So based on the map, I intended to go to Super Taco Plus (thanks to the WiFi, I saw that they had good Yelp reviews). But when I got there it was way too crowded. I saw Yummy Taco across the street with the \"hey, I'm a new business\" flags along the outside. I'm guessing this is a change, since there are so many with the same name. Anyway, not so crowded. Black bean burrito \u0026 a soda - $6.19. Not bad, but not great. Service was fast, they seemed to have it together. Though I wish there were more places to sit. But it's mostly a take out place - what can you do?\n\nMy burrito was rather disappointing. It was poorly wrapped (don't even bother trying to pick it up) and when I tried to cut it, the tortilla was rubbery. Taste was pretty decent, albeit a bit salty. The one thing that made me happy was the salsa. With most Asian-owned Mexican take-out places they get the salsa completely wrong. All the right ingredients are there, but it tends to be watery. They miss the essence of what makes it different from just a sauce. But this time it was pretty thick, flavor was pretty good. Not authentic good, but much better than I was expecting. \n\nSo all in all...meh.", "author": "Danyell T."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-04-27", "description": "Went here last thursday on my way to book club. It was my first time venturing into a Yummy Taco. Obviously, no decor, and it was not what one would call sparkling clean.\nHowever, the meat in the steak burrito was much better than I expected; it actually wasn't bad. For some reason the salsa fresca and sour cream were served outside the burrito, so you have to unwrap the foil-wrapped burrito and scoop it into the burrito yourself, which is annoying. The tortilla was kind of chewy and cold.\nAlso, they had no recycling bin in which to put drink bottles/cans.\nIt was edible for when in a hurry, but next time, I'd try the place across the street and see if it's any better.", "author": "Althea A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-12-08", "description": "Everytime I go to yummy taco, the cashier always shortchange me 1 or 2 cents. I can care less for the amount but rather the principle because WHAT'S THE POINT OF HAVING PENNIES IF YOU AREN'T GIVING THEM OUT. Also, they're very stingy of giving out extra chili sauce, they charge 25 cents for one, but if you ordered 2 fajita for example, they only give you 1 chili sauce.", "author": "Ray Z."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-02-18", "description": "Mexican food made by non-mexicans.  Bad idea.  Food has a very asian twist to it and missing key ingredients.  Soft tacos weren't heated and made for a very awkward taco.  Service is less than mediocre.", "author": "Rose M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-03-17", "description": "This place was horrible.  After eating this place I did not feel good.  The taco place down the street Super Taco is much better. Don't waste your money or time here it sucks.", "author": "Sarah J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-05", "description": "As long as you know what you're getting when you go into Yummy Taco then you shouldn't be disappointed. As other reviews of the Yummy Taco chain have pointed out, it's Asian owned and operated, but still a fresh, acceptable version of Tex-Mex food. We moved around the corner a few months ago and have gotten take-out several times from this Yummy Taco on Willoughby. We're vegan, and appreciate the indications on the menu that the rice and beans are suitable for vegetarians so we don't have to ask all our annoying \"is _____ vegan?\" questions. The black bean burritos aren't the most delicious available, but they're consistent and are made from decent quality ingredients. The bean tacos (without the cheese) don't disappoint for only $1. The Mexican rice is actually really good, and they give you a huge container of it for under $2. It's not gourmet and it's not a destination for a sit-down dining experience, but for satisfying take-out for under $10 it's really a good place to go.", "author": "Brent R."}], "servesCuisine": "Mexican", "priceRange": "Under $10", "name": "Yummy Taco", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "52 Willoughby St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/ALvR3YM7CCpofnaXd7iT3Q/ls.jpg", "@type": "Restaurant", "telephone": "+17185226880"}