{"aggregateRating": {"reviewCount": 39, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-17", "description": "We visited at two dinner times. \n\nOne time it was quite empty and we got good service. \n\nThe other time it was super packed with a long time, and the service was extremely slow as they only had three people. But they gave us free drinks for being sorry at the slow service. \n\nThe food was very good both time.", "author": "Mira C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-05-12", "description": "This has become my go-to for sushi in Brooklyn. The portion sizes seem to have gotten a little smaller since their grand opening but the prices are still on the more reasonable end realtive to other sushi spots in NYC. The specialty rolls are good, with my favorites being the Crunchy Tuna Roll and the Shrimp Tempura Roll. \n\nWe usually only order pick-up, which is always fast. The ambiance of the restaurant itself is a little dim for my preference and almost feels a little \"sketchy\" - it's preserved a bit too much of the bar feel from the last tenant. \n\nOverall, quality affordable sushi.", "author": "Margaret Z."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-04-25", "description": "The fish isn't the freshest. I've had fresher tasting sushi in the area, even at the Khim's market down the street, but... it can work for a quick, cheap, filling sushi lunch.  \n3 rolls... $13 plus tax= $14.15\n\nAnd so what it used to be a pub... does it matter?", "author": "Whitney A."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-03-30", "description": "This is super close to my apartment so I gave it a whirl. First thing I noticed was that the decor was a bit strange, definitely was a pub before.\n\nFood was mediocre at best and I don't think the fish was super fresh. I don't think I'd return.", "author": "Elizabeth K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-05-04", "description": "Nice new addition to the area! I've been waiting for a good Japanese restaurant around MetroTech for a while and Koje Izakaya absolutely fills this void! \nThe space is clearly a former bar, but they have renovated the interior to give it a modern Asian touch, which I like very much. The staff was very friendly and attentive, and the service really quick on a quiet early Saturday evening. I loved the seafood okonomiyaki and the mushrooms cooked en papillote with truffle oil.", "author": "Julia K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-05-13", "description": "A Friendly advise, your restaurant is charging the services gratitudes by adding sales tax and the sub-total after adding your service charge.\nIt is against the city code TB-ST-320.", "author": "Strad D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-05-09", "description": "Nice addition to Downtown Brooklyn. Setting is nice and service is really good. No issue with food just wasn't that memorable. Had tuna tataki, hamachi, soft shell crab bun, popcorn shrimp, black cod and fish pancake. None of it was bad just needed a little more flavor, more interesting.", "author": "Robby A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-03-06", "description": "Came here for lunch on a Saturday around 1pm. The place was almost empty except for a few tables. \nWe ordered the eel unagi and three rolls. The rolls at this restaurant are definitely cheaper than most other places at $13. I got the tuna avocado, California, and eel roll. All three were tasty and the combo was definitely super filling for only $13 for lunch! \n\nThe eel unagi was also delicious. It was cooked nicely and flavored super well. The rice was super soft and delicious to add!", "author": "Amy F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-02-24", "description": "Came here for an early dinner with a friend before heading to the movies. Convenient and easy location to get to in downtown Brooklyn.\nAs you walk inside, it looks more like a bar than a Japanese restaurant. Guess it was before. Overall service was great and staff was friendly. \nThe paintings on the wall are nice and representative of areas in Brooklyn.\n\nThere are happy hour drinks and bites for $5 M-F from 4pm to 7pm.\nHot green tea is nice for a cold day. \n\nWe had the Donburi set - unagi don and curry tontatsu don, which came with edaname, soup and salad. Dishes were good - bbq had some bones so had to be careful not to swallow the bones. \nGood value and good variety of options to choose from.\n\nWill come back for lunch, happy hour and dinner!", "author": "Winny L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-21", "description": "Ordered delivery on a cold day (feels like -7 degrees day!), and Koji's food did not disappoint. The Don buri, soups, sushi, and shishito peppers were all excellent and quickly delivered (thanks to Uber eats).\n\nI also see that they have happy hour M-F till 7pm on drinks, hopefully I'll get to visit for that one day! But, at least, must try their food.", "author": "Karen C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-11", "description": "This little area of downtown Brooklyn is really shaping up to be a Little Asia. We already had soup dumplings, Korean fried chicken, hibachi, and poke. But Koji brings us a legit izakaya restaurant.\n\nIf you're not familiar with the concept, it's small plates to share while drinking. Sounds like the perfect after work activity to me!\n\nEverything on their small plates menu sounded amazing that it was hard to choose. Luckily, I had some Japanese whiskey to sip on while I made my decision.\n\nEnded up getting the fried horse mackerel (three large pieces with a mayo-based dipping sauce), their seared scallop special roll, and the grilled rare tuna tataki.\n\nHad no idea horse mackerel was a thing, but it was tasty. De-boned, flattened, and then deep fried. What's not to like?\n\nThe seared scallop roll was also good if you like cooked fish and lots of mayo. To be honest, their sushi options aren't as extensive as a standard sushi place, but they don't purport to be one, so it's fine by me. Most of their special rolls were cooked, for instance. They also had an extensive sashimi menu, but I didn't partake in that.\n\nThe tuna tataki was probably the only thing I wouldn't order again. I thought it'd be served warm, but it looked like it was previously seared and then served cold. Not the most flavorful tuna either.\n\nI wanted to try their baked yellowtail collar, but unfortunately, they were out of it when I went. I guess I'll have to come back!\n\nThe restaurant is pretty spacious. I sat at the lengthy bar, but there was also a back room and a back-back semi-private room.\n\nStaff was also great. Will definitely be coming back with some friends!", "author": "Kenny C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-14", "description": "I had been craving sushi during lunch for ages. The only option around seemed to be the sushi station in my office cafeteria, which offers rolls with tiny amounts of filling surrounded by thick layers of rice. (gross)\n\nHowever, now I can finally get real sushi for lunch! This place is pretty new and has some pretty awesome lunch deals that I almost don't want to share for fear that everyone will know and it'll be hard for me to find a seat when I come in. \n\nIt's not mind blowing sushi, but their maki rolls are solid and I love their 3 rolls for $13 combo (they also have 2 for $11). Last time, I got spicy tuna, salmon avocado, and yellowtail and jalapeno maki rolls. It was a good amount of sushi for $13, and they were all tasty with good rice to filling ratio! I'm a big tuna person and really enjoyed the spicy tuna. \n\nThey also offer non-sushi items. I'll have to check those out on days when I will not be craving for sushi!\n\n***\nNote: On my second visit here, I tried the eel avocado maki roll, and the eel was basically all fat. It was basically a fish fat maki roll. Kinda gross... wouldn't try it again.", "author": "Nataly N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-21", "description": "Great addition to the neighborhood! It looks like a repurposed bar setting with pretty paintings on the wall and fresh booth seating on one end. Service is excellent and attentive. While most of the dish plates were too big to fit all together on the table, waitresses were quick to fill our glasses and rearrange.\n\nThe highlight was the tempura and sashimi salad. Generous pieces of tuna and salmon lined with freshly cut avocado and greens with a tangy vinaigrette. Tempura also had avocado, shrimp, and kale (crispy but not oily) with a yuzu flavored sauce.\n\nThe eel donburi was a bit \"deconstructed\" in that it came on a skillet with a almost raw egg (could've been a bit more heated) and rice on the side. Very tender and flavorful. But i didn't love the okonomiyaki (likely because of the lack of flavor and lack of fluffiness). This is a great alternative to sushi in the neighborhood (expect izakaya prices).", "author": "Jess J."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-01-14", "description": "I like that they have many small dishes, like tapas style to share. I had the glazed wings and they were pretty tasty. Crunchy, sweet, crispy, fried to perfection. The sauce coating was right on point. Not too much. I also got the soft shell crab roll and it was very disappointed. It looked like shrimp tempura. Rice was mushy and thick. I couldn't taste the crab. Review for other dishes are good. Looking forward to trying them. Service was so so. Our waitress was friendly but after dropping the order didn't check on us nor refill our water. Their payment system is an app on a ipad set to min tip of 18%. You get a 5% discount when check in with yelp. I forgot to use mine.", "author": "Alicia C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-05", "description": "Found this place with the Yelp app and had good review.. the server was friendly and the place wasn't busy for a Thursday afternoon. The sushi rolls were very good and everything tastes freshly made.", "author": "Leslie H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-10", "description": "A new downtown gem has arrived. This place is amazing.!! The food is Japanese fusion. The ambiance is stunning and the experience with the staff and service was great. I started with the Koji Salad and miso soup. Both were great and I loved the presentation of the salad. Teishoku Chicken which had the perfect crunch outside and was really juicy and flavorful inside. It was accompanied with a wonderful aromatic rice and side salad of Daikon called Kimpiru. The price is extremely reasonable for the portion, and the location in the city. This place will now be added to my regular visit list.", "author": "Jennifer N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-12-18", "description": "I love that Downtown Brooklyn is starting to get all these fun new restaurants and bars. It's about time! Koji Izakaya is a welcome addition. The service was excellent and the vibe is pretty chill. The food menu is pretty basic, there's small plates, kind of like Japanese tapas, and there's sushi/sashimi. I would say stick to the small bites. The sushi was fine but nothing special (though very affordable!) and there's tons of other sushi restaurants nearby. The small bites and drinks is the main reason one comes to an izakaya. We particularly enjoyed the  miso cod and glazed wings but there are many more things on the menu I'd like to come back for.", "author": "Lana V."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-04-03", "description": "First time today and didn't enjoy anything except for my drink. However good service though.", "author": "Sacheen M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-16", "description": "Very good lunch specials (also available on weekends!). We got four rolls for under $13. The spicy tuna roll was delicious! The only thing I didn't like were the mochi desserts. Would definitely recommend.", "author": "Paul O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-18", "description": "This is now hands down one of my favorite restaurants in the neighborhood. Now they just have to get their kitchen and staff in order. Food comes super slow. Since it's new, I'm going to give it a benefit of the doubt.\n\nI've been in a Japanese rut ever since Jun Shokudo? closed and got replaced by a ramen shop. I was a bit imitated to try this place at first since it was so new, but boy was I pleasantly surprised. Price and quality here are reasonable. Food is tasty and presented well although I don't understand why we have to eat out of these shallow long plates. Totally would have been fine with round plates.\n\nRecommended dishes are pork tonkatsu, sashimi platter, and the okonomi.", "author": "Connie H."}], "servesCuisine": "Japanese", "priceRange": "$11-30", "name": "Koji Izakaya", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "140 Lawrence St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/UcFTDZ7muZ9Q69mqUOegCg/ls.jpg", "@type": "Restaurant", "telephone": "+13472234699"}