{"aggregateRating": {"reviewCount": 39, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-05", "description": "This is one of my favorite Japanese restaurant in Brooklyn. The food is amazing, and so affordable! I live in Manhattan so I'm used to paying $8 plus for simple roll such as California roll, which only cost $6 here. I've had dinner here about 4 times before posting this review so I've tried majority of their menu! I wanted to really try out the food before giving my final thought. Definitely worth the commute from Manhattan. \n\nI always grab a couple small plates and sushi rolls. They have really affordable sushi rolls for such amazing prices. Their prices range from $5 regular rolls to $15 special rolls! My favorite small plates are gyoza, pulled pork buns, salmon tartare, shishito peopers, ika geso, and truffle mixed mushrooms! I recently celebrated my birthday here and we basically ordered the entire menu. Everyone loved the food, and we will surely be back soon! \n\nMy go to sushi rolls are spicy salmon, special shrimp tempura, and koji trio. They also have gluten free options as well since my friend was allergic to gluten. \nOh, and did I mention they have great prices on their drinks too? I'm used to paying $9 plus on a bottle of beer, and $15 plus for drinks but the drinks are so cheap here!\nOverall, I am very pleased with this place and would definitely recommend checking this place out. \n\nMy final thoughts: \nPresentation: 5/5\nTaste: 5/5 \nSelection: 5/5\nValue: 5/5", "author": "Coco C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-11-08", "description": "Very cute and small place located off Lawrence street! It's a pretty quiet setting, but the atmosphere is great. Got two sushi rolls for $11 which is a pretty solid deal. Also highly recommend the gyoza, it was my favorite part of the meal. The sushi is fairly priced and staff is nice. Only reason I gave 4 stars instead of five was because they messed up my original order. But after it was fixed my experience was great!", "author": "jade g."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-27", "description": "This place just opened. My roomies and I live a few blocks away and were excited to see an izakaya opening in the old Nice bar space. \n\nWhile they definitely have some growing pains to overcome, we were pleasantly surprised at the quality of the food, the ambience and the experience overall.\n\nDetails: \n\nMake no mistake, it is absolutely obvious that this restaurant used to be a bar. They don't hide that but they've added some nice touches. The tables and tableware are nice, including unusually high quality napkins. The bathroom is renovated with an Asian theme and the wall murals are fun and tasteful. \n\nAs Asian Americans ourselves and frequent eaters of Asian food from China Town, St. Marks, etc, our expectations were high. The menu is limited, and anyone expecting a true \"izakaya\" experience will be sorely disappointed. There aren't real izakaya dishes. However, we we're shocked to find our dishes, the pork katsu curry and eel/egg/rice dish to be delicious and delightful. \n\nFor the price, the portions are great, especially compared to DeKalb Market. \n\nI hope this place smoothes out some of the kinks and sticks around. Its clear your chefs are good, put them to use creating more authentic izakaya dishes! Good luck Koji!", "author": "George S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-13", "description": "A real awesome find on yelp!  Full of fresh fish. A great atmosphere and interesting flavors and combinations.\n\nI am a hard critic when it comes to sushi and this place does not disappoint. We started with the Koji salad and glazed wings. Wings were good but definitely on the spicy side. We then ordered varies sushi rolls, the sashami platter and tried their Teishoku lobster set, served 3 ways.\nOut of this world! The presentations were great too!\n \nAdding this on the list to come back and enjoy other dishes!", "author": "T. N."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-02-16", "description": "First off, I will say that the food was really good and tasted fresh. However, for the location the food was way over prices. The pieces in the rolls were very small. However why I gave it three stars as opposed to four was the smell. The odor of the place was similar to nail polish remover. I'm not sure if they just cleaned, but it was nauseating after a while. Maybe great for delivery but I wouldn't eat in the restaurant again.", "author": "Carly G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-18", "description": "This is the best Japanese restaurant in Brooklyn... BY FAR! Great addition to the neighborhood. \n\nWhen you walk inside, you see the beautifully painted walls and decor; gives off an authentic Japanese ambiance with a hint of that Brooklyn vibe, which is exactly what they were going for. \n\nThe servers were extremely attentive. The owner, along with the chef, took the time on a busy night to come over to our table and greet us to assure that we were enjoying the food and having a good experience. \n\nThe sushi was delicious, but that is not all! The pork buns were great and the presentation of all the dishes were beautiful. I apologize to the surround tables for starring at their food; so many dishes I plan to try the next time I am there. \n\nOverall a 10/10 for the food, service, presentation, and the decor of the restaurant!", "author": "Guy S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-28", "description": "This is a very good Japanese restaurant. The sushi is fresh. The price is reasonable. I would highly recommend the fried chicken wings.", "author": "Kenneth C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-05", "description": "Everything we tried was delicious. Gyoza were amazing, soft shell crab buns, sushi, miso cod.... all great.   And the service was great too.", "author": "Erin B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-26", "description": "Give Koji a try! You won't regret it. Amazing sushi. Super fresh! Never frozen. The chefs at Koji take pride in their work and are fine tuning their menu based on what's popular. The sushi platter was just enough for one person and you get to pick your own roll to go with it (many places up charge when you swap California roll but not here). I'd also recommend the miso soup. \n\nZoe the bartender was very friendly and was kind enough to recommend various places of interest to check out in the area. \n\nThe environment was cozy and inviting. I really loved the modern take on the art work on the walls. Kinda of a tasteful graffiti-Samurai style.  \n\nSkip the rooftop place near by and check out Koji!", "author": "Jonathan H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-09", "description": "Went here for a business meeting. They were super accommodating. They even lowered the music and turned on the a.c for us.\nVery nice, respectful, and the food was delicious! \nDefinitley go in and experience the good food and great customer service.", "author": "Em C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-20", "description": "Eel in sweet broth and sashimi platter! The food was both filling and satisfying. We are definitely coming back here", "author": "Alex Z."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-02", "description": "The place has a nice atmosphere. The food was great. Workers there are very hospitable. The chef had forgotten to make one of our orders, and he came out to apologize personally. Overall it was a great experience! Will visit again! :)", "author": "Celina D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-18", "description": "My family and I were invited here for dinner on a Sunday night. My first impression was cozy, welcoming and aesthetically pleasing. We got to the appetizers and they were cooked perfectly to my liking. Our favorite dishes were the pulled pork sandwiches, dumplings and eel and salmon sushi. All the food served were fresh especially the sushi. Service was great and responsive. For those over the age of 21, there is the bar in the back where they serve a variety of drinks. There are also multiple televisions where you can watch sports and whatnot. Overall the experience here was amazing.", "author": "Jonathon T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-01", "description": "So happy this place opened in the neighborhood! We have been about 3 times now and food and service have been consistently excellent. We love the Okonomiyaki, Duck Buns, Hamachi Kama (Yellowfish Neck - amazing!), Tuna Tataki...rolls are very good and always fresh. Looking forward to many more delicious meals at Koji!", "author": "Katie C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-12-24", "description": "Cool place, service is fast, food is good and the prices are reasonable.", "author": "Tarek S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-27", "description": "HANDS DOWN ONE OF THE BEST RESTAURANT EVERR!!!!! The food here is very mouthwatering.  Staffs are warmhearted. Recommend to come and VERY likely to come back.", "author": "Elaine Q."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-13", "description": "Great new spot in the neighborhood! Went for lunch with some friends, food was amazing and super fresh. Highly recommend, it's a great new addition to the neighborhood, great for lunch or a relaxing dinner with a great decor and atmosphere. Will definitely be going back soon! Highly recommend!!", "author": "Joey P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-10", "description": "The food is awesome! I'm normally not a seafood fan, but the spices and sauces are amazing and the sashimi is really fresh! I've already been there a few times and the gyu don and the wings are to die for. There's also something new to try everytime!", "author": "Kelly M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-11-08", "description": "Small portions and overpriced. The rolls are not okay for the price. Tried the seafood okonomiyaki which was thin and definitely not worth $11 (more like $6 at most) and the shrimp/veggie tempura which had fried kale that was 80% fried and 20% vegatable..", "author": "Jonathan L."}], "servesCuisine": "Japanese", "priceRange": "$11-30", "name": "Koji Izakaya", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "140 Lawrence St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/UcFTDZ7muZ9Q69mqUOegCg/ls.jpg", "@type": "Restaurant", "telephone": "+13472234699"}