{"aggregateRating": {"reviewCount": 210, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-11-03", "description": "Okay service, Mediocre food really small portions and I've had WAY better.\nTry Ghent!   This is the second and the last time I am coming here!", "author": "Amaka P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-11", "description": "I've tried Ethiopian food all over NYC and DC and Amsterdam... so I feel qualified to recommend this restaurant. Every place's spices and textures seem to be a little different, and there were a few tweaks on spice here that were unique, though I couldn't define how.\n\nWe got two vegetarian combos, so got 8 different dishes. One made with beets wasn't something I've seen before. It was not terribly exciting but looked pretty. The lentil dishes were really good; one used whole, not pureed split peas, a nice touch. The cabbage dish and collards were plentiful and a especially flavorful.\n\nThe only weak point was the injera was cold and  a little dry.\n\nMy daughter got the Bati Steak Tips (or something like that) which was basically cubed beef sauteed with tomatoes and onion. She loved it. Just didn't feel like battling with her to eat lentils this time...\n\nService was friendly and helpful and the place was pretty calm and quiet on a Wed. eve (maybe 3 other tables in use?)", "author": "Germane T."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-05-20", "description": "I've had Ethiopian food in Austria, Turkey, Tanzania and... Ethiopia (over 10 blessed days). This was probably the worst I've had, both in terms of food and ambiance. Me and my girlfriend found the flavors underwhelming, too oily and watery. We asked for spicy but it wasn't. We got the platter for two and were still hungry afterwards - ate a second dinner at home. Almost as bad, there are entirely too many tables. One waiter had to ask someone at each of the two tables next to us to excuse him so he could pass. One patron rolled his eyes as he scootched in. The other was equally unhappy. You'd think this would be a good signal to management they need to make the place easier to navigate, but I guess they figure more tables equals more money. Too bad they apparently aren't factoring the people that don't return because it's so cramped.", "author": "Daniel M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-06-25", "description": "Service is eh......food good tho. Siga tibs were yum.", "author": "Jean L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-20", "description": "First time in Brooklyn, first exposure to Ethiopian food.  I liked me both quite a bit.  My wife ordered the vegetarian platter and myself the meat platter, that way we'd get a good variety and sampling.  It was sooo good, I've been thinking about it ever since!  Also, try their house beer from Ethiopia \"meta beer\". It was a dark-amber colored lager and went very well with our orders.", "author": "Nick M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-21", "description": "This restaurant made me love Ethiopian food. Great for vegetarians! The beautiful artwork on the walls is an added bonus and the staff is super friendly.", "author": "Tanya K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-05-09", "description": "I like to stop into Bati for a chill meal. It's not the fanciest place but the the food is decent and the atmosphere is nice. Now, I've had better Ethiopian food in NYC but Bati is a nice addition to the Fort Greene scene. I always get the veggie options which are good, especially the lentils. You have to try the honey wine!", "author": "Ola F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-11", "description": "This is an excellent restaurant, the best Ethiopian spot I've been to in the city. I had the vegetarian platter and a glass of sangria, both were excellent. The staff are attentive and friendly - I felt welcomed from the moment I walked in the door until I left. I would highly recommend Bati.", "author": "Gregory B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-07-09", "description": "I enjoyed a meat platter with the boy here back in January. The food was good and fresh, and we both got to try something different for a change. Nice to see a restaurant like this in the area.", "author": "Chey H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-10-01", "description": "Have you ever had Ethiopian food before?  Here is one valuable tip... take a hand sanitizer or Purell wipe.  You'll need it because you eat with your hands.  Your hands are your utensils.  If you don't have hands available to you, then I would suggest training your toes to be prehensile-esque.  Just a suggestion.  \n\nNow that we've gotten that out of the way, let's move on to the food.  You basically pick up the food using a thin bread called \"Injera.\"  Injera is a little tangy and spongey.  So, be prepared for that.  It took me a few bites to get used to, but I ended up liking it.  \n\nWe ordered the beef sirloin stew (Ye Siga Wett), chopped prime beef stew (Minchet Abish Wett ... it's a little spicy), lamb stew (Ye Beg Alicha), split peas (Ater Kik Alicha), collard greens (Gomen), and a beet/potato dish (sorry, I forgot the name of that one).\n\nI liked all of the food.  If you have an experimental tongue, then this is worth trying.  The only thing that I wasn't crazy about was the dessert, which was warm baklava.  I've had much better.  Then again, I've had much worse, too.  \n\nI've seen comments from others about the service being slow.  It's wasn't that bad.  When I went, there was only one waitress and she was busting her butt serving tables.  So, she did a great job in my opinion.  Plus, she was very sweet.  \n\nThe atmosphere is cute.  If you're bringing a gang of friends, you should probably warn the restaurant so that they can push tables together in advance.", "author": "Mimi R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-08", "description": "This is one of the better Ethiopian restaurants I have been to.  It's named after the city in northeastern Ethiopia that's known for being a gathering place for many different cultures to come together.  Like most Ethiopian restaurants, all dishes are served on injera which is a type of unleavened soft bread that you use to pick up the bits and pieces of your meal.  What's great about this concept is that the injera will soak up the flavors of your entree and side dishes.  \n\nThere were two of us and we tried the gomen (collard greens with garlic and ginger) and the Ye Beg Tibs which is sauteed lamb pieces with spices.  The two dishes were served on a giant injera with extra injera on the side for grabbing food.  The two dishes were accompanied with a side of chick peas and a side of red pepper paste. The feeling of having the giant plate with many little dishes is not unlike being at a feast.  People just tend to dig in when confronted with the setup.  All of the flavors that we tried were fantastic.  The lamb was probably the best part because it was incredibly juicy and flavorful while hitting the perfect spice level.  The collard greens were insanely good for collard greens.  The best part about it is getting to mix and match different combinations of food to see which combo tastes the best.  \n\nThe interior is small, but quaint, and adequately decorated to immerse you in an Ethiopian restaurant atmosphere.  The service was also quick and courteous.  The only negative aspect of the meal was that we had some trouble getting refills on water throughout the meal.", "author": "Dan B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-23", "description": "I'm so glad that we decided to have dinner here!  I really love Ethiopian food, and love trying different places - this one seemed to have really nice twists on traditional dishes.  They had really good injera that was much tangier than I had had before, which was great.  There was also a really great vegetarian beet/potato/jalepeno dish that I had never seen on a menu anywhere else.  It was served cold and was delicious!  Their Shiro wet was great as well.  Hope I can get back to the neighborhood soon!  \n\nI should also add that we went around 7pm on a friday, and it was a nice and quiet relaxed atmosphere and wasn't too busy, which is exactly what we wanted!", "author": "Julia O."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-04-03", "description": "I pretty much eat everything, but there are certain cuisines I like better than others.  And one cuisine I've tried and tried, but just never get too excited about is Ethiopian.\n\nI admit, it's a unique experience: going to a traditional Ethiopian restaurant.  First off, they don't really offer you silverware.  In its place you get a very thin, spongy bread called injera.  You're supposed to use this to scoop up the mounds of stewed meat or spicy vegetables on the platter.\n\nNow I learned the hard way that injera can get dangerous.  It's deceptively light and if you eat too much of the mild and chewy bread, it expands in your stomach and you've filled yourself to capacity.  I have a friend who even disregards tradition and eats this food with a knife and fork - just to prevent the filling up on bread problem.\n\nThe stews and vegetables themselves are generally very spicy and thick enough that I've always had a hard time locating the protein or legume.  I end up eating everything together but not really tasting much.  It could very well be my own lack of restraint, but I just never got excited about the flavors in this ethnic cuisine.\n\nWe decided to try a rather new Ethiopian restaurant called Bati in the very cute neighborhood of Fort Greene, Brooklyn.  We ordered the Vegetarian Platter, which allowed us to pick four vegetable dishes.  There were only seven options and they all seemed pretty similar in the descriptions.  This with ginger and garlic, that with a thick sauce, something else with a mild sauce. Not sure what any of this meant.\n\nWe picked the Missir Wett (split lentils in stew), the Gomen (collard greens with garlic \u0026 ginger), the Buticha (ground chick peas with onion and peppers) and Ater Kik Alicha (split peas in a mild sauce).  We didn't want to be complete herbivores, so we also ordered the acclaimed Doro Wett (a speciality chicken stew).\n\nThe flavors weren't too varied but each dish had something new. The collard greens were bright and lemony, the lentils were rich and hearty, the chickpea salad (served cold) was light and crunchy, and the split peas were mildly spicy and had a strong stewed tomato flavor. The chicken had the boldest flavors with quite a bit of heat, tender chicken that fell off the bone, and a hard boiled egg in the middle that helped soak up any sauce that the injera missed.\n\nThe dishes were more bland than I remembered from my previous Ethiopian experiences.  And once again, it's all repetitive and not completely visually appetizing.  I was just pleased I was able to taste the difference in the dishes this time around (thanks to the spice restraint).  And even though I still have a lack of excitement for the cuisine, every once in a while, it's worth the experience of having a unique food adventure.  And a place like the friendly Bati would be the logical choice.\n\n-eatthisny", "author": "Brian H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-18", "description": "My experience at Bati has always been good.  I've been here six times (including last night.)  I usually go early (before 7PM) and the atmosphere is chill and the waitstaff is very helpful.  I love the food...it is so delicious and spiced just right.   It is my favorite restaurant in the neighborhood.", "author": "Joey C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-20", "description": "Went to Bati last night despite the mixed collection of reviews.  My husband and I were both pretty blown away by how good it was!  We are big fans of Ethiopian (I lived in both Chicago's \u0026 NY's Ethiopian restaurant epicenters).  Having frequented the UWS Awash, I actually thought this was better!  \n\nThe service was good (perhaps they heeded the complaints listed by previous reviewers), and we were stuffed with two vegetarian combos, every bite of which was delectable.  If I go back \u0026 have a similar experience, I'll give it 5 stars.  Also, good value- stuffing both of us for $32 before tip is not bad.", "author": "Anne S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-03-23", "description": "I frequently think about their azifa...SO delicious! I wish I had a vat of it right now.\n\nMy boyfriend and I have been here a few times, and we always get the same thing: azifa and 2 vegetarian combos.  Never been disappointed.  The female server is always very friendly, and I don't recall ever had a long wait for either service or food.", "author": "joanne s."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-11", "description": "What a charming Ethiopian restaurant!  We went here before a talk at BAM because of its good reviews and close proximity to the venue.  I thought the food was really good-- we chose the vegetarian combination platter-- and the service was friendly.  I'd totally go back.", "author": "Tony L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-12", "description": "Went here for my birthday on a Friday, June 28th. The food was good and the staff was very accommodating to our party of 13 people. We shared 4 platters - 2 meat, 2 vegetarian - both were delicious. This was a great amount of food to feed everyone to get full on. I especially enjoyed the collard greens (Gomen) and the beets (Key Sir).  A few people in the group didn't know about Ethiopian cuisine and were a little off-put with having to eat with your hands, but I enjoy different experiences and loved it. Also, their Tej sangria was absolutely amazing!!", "author": "Rae A."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2009-11-18", "description": "I've never had Ethiopian food before so i can't compare with other restaurants.. it was a great deal, i thought. each entree comes with their bread and 2 veggie sides. \n\ni think there's alot to improve upon as a restaurant. service was spotty. granted i came on a tues night and there was only one waitress.. but, we seated ourselves. tables were dirty. in fact, i saw a table get up and leave and 20 min later, their dishes were still on the table. \n\ni'm new to ethiopian cuisine and would've preferred a more 101 crash course than a DIY. there are definitions of all the dishes on the other side of the menu, but unless you knew about that, there isn't a compelling reason to flip over.  \n\nthe food was interesting. the first 2 min i was super disoriented w/out utensils but then really enjoyed the experience of eating w/ my hands and feeding other people! it's like edible play-doh! i ordered the lamb stew w/ the kale and ground chickpea sides. only comment on food - bread wasn't super absorbant... which makes it harder to scoop food with. it's like eating with a colander. \n\nfor such a hand-centric restaurant, i wish that they gave out wet wipes before the meal (and after) \n\ni will def. be back bc i enjoyed my experience. also would be good to see what the service is like on a typically busier day.", "author": "Joanie K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-07-04", "description": "Being of Ethiopian ethnicity, it pretty pathetic that Bati is representing Ethiopian food.  If \"ferenji\" or foreigners even notice the lack of quality of food, that's truly unfortunate. The first time I came to Bati,  everything was good, it prompted me to return. The second time, I had a kitfo craving so I ordered it. It wasn't good at all but just thought it was because it was a Sunday and it was left over, whatever.\n3 months later, I came in again and ordered the veggie platter, doro wat, and kitfo...no comment, enough said.\n\nMoving forward, I do agree with many others when it comes to the portion size of entrees. Honesty, I wouldn't be opposed to those small portions if the food was outstanding...costumers would leave wanting more which is a great impression. \n\nAs for the owner or manager, I definitely would \"get off your high horse\" and get your business in order.  Work on the quality of your food and customers satisfaction.  If I were in your shoes I wouldn't want to have so many unpleased and dissatisfied customers.  Ethiopian's are known for showing great hospitality...why are the employees (waiters) inattentive? These issues can easily be resolved. Unfortunately,   As for me and many others, my dining experience at Bati has left a sour taste in my mouth and I will not be returning.\nmelkam megeb ( bon appetite)", "author": "Antique G."}], "servesCuisine": "Ethiopian", "priceRange": "$11-30", "name": "Bati", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "747 Fulton St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/H_V2pdmsd0PQ6pTnN_K-Bg/ls.jpg", "@type": "Restaurant", "telephone": "+17187979696"}