{"aggregateRating": {"reviewCount": 210, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-12-14", "description": "I ended up here because every other restaurant in the area was booked due to an immanent BAM performance... but hey, I absolutely love Ethiopian food so I was still pumped to finally give this place a try!\n\nAnd boy, what an... average experience! Okay, don't get me wrong, the place is fine. The food is edible, it's a cute restaurant, everybody is friendly. But alas, just a satisfactory if not moderately forgettable meal. Noticeably smaller portions and bland spices on top of the 40 minute wait just sort of put me off. \n\nAll in all, eh, no interest in coming back... that said, if you're being BAMcockblocked out of everywhere else in Fort Greene again I'd say it's a better option than pizza.", "author": "Jenna I."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-13", "description": "After reading the reviews for this place, I was skeptical about coming here when my friends suggested it. Nevertheless we planned a dinner here.\n\nLet me just say that I was wrong to be a skeptic. Being an Ethiopian, I have high standards for Ethiopian food made anywhere but Ethiopia.\n\n As other reviewers have pointed out, the injera was made perfectly. None of that thick, salty stuff that makes Ethiopian food hard to digest, but it was thin and flavorful. The tibs was AMAZING! We also got the veggie combo and the meat combo. The food here was so good that it even made me like the Ethiopians dishes I don't really like.  It was that good. \n\nThe place was small but cozy, and the staff were friendly.", "author": "Bethel Hailu D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-05-23", "description": "So a Nigerian and an American go for Ethiopian...and it was HORRIBLE.\nThe two stars are for the service. Our server was friendly and swiftly brought our drinks/food/ and answered all of our questions - which were many since my hubby and I never had Ethiopian food before. \nBut the meal was just lackluster. I had the popular chicken dish, which came with a boiled egg. Only half a chicken leg which was actually smaller than the egg. My hubs had the lamb chunk dish. Was supposed to be spicy, but wasn't. Both of our plates were $18, \u0026 we stopped by a deli on the way home because we were both still hungry. \nI'm still so mad at my plate, though. $18 for half a chicken leg?! I don't even get the whole leg??!! I'm good, never returning.", "author": "Akeeba A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-12", "description": "Went in on a Thursday night around 7 and it was empty, but I have no idea why! The food is great and the service is really friendly. Music and atmosphere are perfect. The waiter was patient and explained what all the dishes were and even helped us out as I fumbled the pronunciation of the dishes. It seems pricey at first, but you get a ton of food that's very well seasoned, flavorful, and lovingly prepared. I know I wouldn't spend the hours it takes to prepare 5 different veggies/curries/stews, so an $18 platter is totally worth it. Especially since there'll be leftovers! If you're not a big eater, you can easily share a platter. I love Ethiopian food or any cuisine of eating family style with your hands, this place does it very well.", "author": "Divya A."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-04-17", "description": "Ethiopian restaurant - service was slapdash, food meagre, the meat hardly existed and everything tasted the same.  Disappointing Ethiopian and will not return.", "author": "Sokari E."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-10-02", "description": "This place is indeed A-OK; maybe a bit better than OK. I can't help but compare it to Ghenet on 4th Avenue and Douglas, which if my favorite Ethiopian place in the neighborhood.\n\nI feel like there's nothing really spectacular in the BAM area.", "author": "Brian R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-18", "description": "Bati is a great great discovery.  Thank my friends for taking me there!\n\nCute and small, and cozy.  Delicious delicious veggie combo and beer.  \n\nThe waiter was very patient with us, when the three of us looked aghast at the food that was brought out, realizing we had ordered a single portion for three people!  He had asked us about this when we ordered, but in our all-around brain addled states, we understood nothing! \n\nAlas, he was quick to bring us more of the same, and we devoured every last bit of it.\n\nI'm coming back here very soon.", "author": "Sean S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-22", "description": "We stopped in for dinner here tonight and it was really good! We split two combination dinners (one veggie and one meat).  The lentil and cabbage were my favorites.. But everything was very very good. \nThe staff was friendly and attentive. The space itself seemed to be pretty small, but there might have been more seating down the stairs.", "author": "Sarah T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-09-11", "description": "My roommate and friend wanted to come here so we stopped by for a quick meal before seeing a movie at BAM. Our server was extremely friendly and we were glad to talk to her, but the overall experience was lacking something. \n\nThe space is perfect for people watching or enjoying a nice, sunny day with friends, but the food is rather expensive and it seems like there could be more added for variety. I ended up splitting the vegetarian's platter with a friend (which also happens to be vegan) and it was more than enough even though it looks like next to nothing.\n\nThe injera really slows down your eating and fills you up as well, so small portions go a long way here...but unfortunately, not long enough. I still left with the feeling of something to be desired.", "author": "Morgen B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-30", "description": "I love this place - especially the veggie and meat combos (because I can't pick just one dish). My sister's favorite dish is the beef tibs. The service is quite fast. Only drawback is no high chairs.", "author": "Tamar K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-01", "description": "Bati, you have never let me down.  On a Friday night after BAM let out and folks were streaming in, you did not lose your sweat.  Hadn't been here for a while, but you still got it.\n\nThe portions could be bigger, but the food is so flavorful, I left satisfied.  I think the injera (bread) fills you up.  Had kategna appetizer and split the veggie combo.\n\nWhile I love honeywine, they do not have the one that I like, so I tried one of their Ethiopian beers.  At $4, the price was spot on, and the amber beer was tasty.", "author": "Jordan D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-24", "description": "Not sure why it took me so long to write this. I used to go here almost once a week with a gluttonous hunger and devour more food than I care to admit. It is hard for me to stop eating.\nYes, it is true that the food might be heavily spiced and it can cause indigestion. That's Ethiopian food for you. You also have to know what to order. Ask the waitress for some milder suggestions or spicier if you prefer that. The meat sampler meal or the vegetarian sampler meals are great to try some of the most popular meat items. My favorite item on the menu is the Lamb (Yebeg) Alicha. It is buttery lamb in a yellow sauce and it melts in your mouth. The beef Tibs are also really good and on the simpler side if that's what you want.\nIt is a small place but cozy and intimate. Also, try the Ethiopian beers and wines. If you are eating Gluten-free, you can request full teff injera with the restaurant the night before and make a reservation.  Otherwise you are having the more Americanized version of injera, which is a bit less sour and more foldable.\nIt is a good place for groups because the Ethiopian way of eating is family style, sharing a large plate and eating with your hands. It would be a unique experience if you have not tried it before.", "author": "Saba F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-27", "description": "Sooo delicious. We went here for dinner on a cold night and loved the ambiance and food.", "author": "Sam K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-05", "description": "Having been to Ethiopia almost a dozen times does not make me an expert on the cuisine.  But I have a relatively strong palate, and with the time that I've spent in that lovely country, I feel that I'm able to identify authentic Ethiopian food when I taste it.  This is the closest that any place in New York comes in my opinion.  The doro wett and the kitfo taste just like what I've had in Addis, the former being my favorite Ethiopian dish.  \n\nWhere I think this place really excels is with its vegetarian dishes.  I'm no vegetarian, but I had the vegetarian combination platter with some friends the other day and was amazed at how flavorful it was.  Everything was outstanding, particularly the shiro and the gomen (collard greens).  I also thought that the injera was excellent.  From what I understand, injera is not so easy to make, and many places in New York fail miserably.  Often you get thick and pasty injera, which can seriously detract from the meal.  The injera at Bati is thin, fragrant, tasty, and well structured.  It holds together well, which is obviously an important quality for injera to have given that you use it to pick up the food.      \n\nI've seen others complain about the service, but we found the waitstaff to be very friendly and patient.  I told a friend I was with to ask for a fork and some ketchup (heresy) just to see what type of reaction he would get.  The waitress didn't even blink and said that she would be right back with a fork, but unfortunately they didn't have ketchup.  This is an enlightened waitstaff, my friends.  \n\nI live in the Lower East Side, but my go to Ethiopian joint is in Fort Greene.", "author": "Michael H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-20", "description": "Goto spot in Brooklyn for good vibes, good food and wine. Me and my lady like to return on date night every now and then. Love the food and energy.", "author": "Tatiana S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-05-25", "description": "Upon walking in, Bati had a good vibe. We got the Kategna to start and the Vegetarian platter.\n\nThe Kategna was VERY spicy and tasted like oil, I wasn't fond of it. The vegetarian platter was alright/acceptable, I wasn't blown by it and have tasted better. I found the injera provided to be quite thin and didn't have the sponge-y-ness I was used to. The injera and platter options weren't served to us warm, big minus. Our glasses were empty of water for a while before anyone filled them up.\n\nOverall, the experience was lacking in several aspects and I doubt I'd come back.", "author": "Pam H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-24", "description": "First time having Ethiopian cuisine, got to sample so many wonderful and delightful dishes. Very intimate atmosphere. Great layout, nice decor, right wall colors and interesting art. I was quite taking by simplicity of food and complexity of the flavors. I saw a wonderful downstairs area, which could be after dinner hookah hangout spot. I really think this establishment will become a fixture and will set standard for Ethiopian cuisine. Thank you so much for a wonderful  experience.", "author": "Mark L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-05-19", "description": "I don't recommend any meat dishes here, none of the meat is stewed or cooked long enough. I ordered the Doro Wett - it was two small pieces of chicken (smaller than the egg) and the meat was chewy - not what you expect from any stew, let alone from an Ethiopian stew. It was as though they had just popped the meat in before the brought it out.\n\nThe vegetarian options on the other hand are pretty good. \n\nIt's ridiculous what they charge for very mediocre food.\n\nService isn't that great when they're busy.", "author": "Bat B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-31", "description": "Delicious ethiopian food! Had good service both times we went.", "author": "Liz P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-10-04", "description": "Went here with some friends. The food was pretty good, and the prices were reasonable. The mead we ordered with the meal was exceptional!", "author": "Rajesh S."}], "servesCuisine": "Ethiopian", "priceRange": "$11-30", "name": "Bati", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "747 Fulton St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/H_V2pdmsd0PQ6pTnN_K-Bg/ls.jpg", "@type": "Restaurant", "telephone": "+17187979696"}