{"aggregateRating": {"reviewCount": 210, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-12-14", "description": "Tonight I ate at Bati for the second time, and I have to say, I left extremely disappointed and dejected. When I ordered one of their signature chicken dishes, all that came out was SINGLE DRUMSTICK along with a hard-boiled egg, slathered in a spicy sauce. Again, I repeat: the main course consisted of SINGLE DRUMSTICK, along with one hard-boiled egg, for $15! When I asked the server if there had been some mistake, she simply said that \"No, it just comes that way\" and did not offer to remedy the situation. I realize it's not her fault, but the management should know that charging $15 for a single, rather scrawny chicken extremity is completely and utterly unacceptable, and leaves the customer feeling taken advantage of and cheated. Everything else was fine, but on principle I just won't return.", "author": "Zachary S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-05-25", "description": "I like that place a lot.  It's simple, nothing fancy but the quality of food is always decent and the deco is nicer than in most other Ethiopian restaurants.  Good value for the money.", "author": "Ewa B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-09-20", "description": "I admit - I adore Ethiopian food and am pretty picky about it (must have good spices!).  I live in DC and eat Ethiopian at least once a month.  I was very excited to visit a NYC Ethiopian restaurant!  Loved the neighborhood and the decor within this restaurant - much smaller than I am used to, but love the coziness!\n\nHad Kategna and Azifa as appetizers.  Was a bit worried at the start, because the injera was not fully fermented, so it had a very sour taste that was like nothing I have ever eaten (not in a good way).  The Kategna has so many spices that you couldn't taste the sourness, but since you ate the Azifa with the injera, it was very obvious.  I had never eaten Kategna or Azifa and was very impressed by both of them - the azifa was nice and spicy and the kategna was very crunchy with delicious spices.  Drank the honey wine with both the appetizers and entree.\n\nWe ordered two entrees - Kitfo (raw) and Veggie Combo.\n\nThe kitfo was very similar to the kitfo that I have previously eaten - great spices.  Would definitely recommend.\n\nVeggie Combo includes 4 different things, so we got:\nAter Kik Alicha - Split peas in a mild sauce\nShiro - Ground chick peas in a thick sauce\nButicha - Ground chick peas in a blend of onion and pepper\nand a special that they had that day (made with green beans).\n\nI was not very impressed by the green beans, but since they were a special that day, I don't know how often they will be served.  The Ater kik alicha is normally my favorite at any restaurant.  Here it was very good, but the other two veggies blew the rest of the meal away, because they were so amazing.  Shiro is a staple at every Ethiopian restaurant, but this shiro not only looked different (lighter color than I am used to) it tasted a million times better.  It was light and creamy, and absolutely fabulous.  I had never eaten buticha before, but was very impressed by the combination and tastes - I could have eaten it all night long!  As we were eating, I realized I no longer tasted the sourness in the injera - not sure if it was not noticable because of the spices, or because my taste buds became used to it, but regardless, my overall impression is that the food was the best Ethiopian food that I have ever eaten.\n\nDessert was baklava and espresso - both the perfect end to a perfect meal.  \n\nI can't wait to go back to NYC to try this food again!", "author": "Michaela B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2009-04-10", "description": "[note: the sign in front of the restaurant at 747 Fulton St in Brooklyn reads \"Ethiopian Restaurant\"]\n\nI went there with two friends last week.  The atmosphere inside was very cheerful, bright, and welcoming.  The three of us ordered two combination plates (veggie and meat).  Throughout our stay, the service was very cordial, and they prepared the food promptly.  \n\nBut nothing with the food itself went right.  All three of us were surprised by how terrible the water tasted -- not something one normally even thinks about in a NYC restaurant.   Our shared platter was the right size for three hungry people, but they only gave us one piece of injera (the soft flat bread).  We immediately asked for more, and they gave us one more.  Later we had to ask for yet another one (read more to see why this was such a difficult thing to do).  For a restaurant where one is supposed to use the bread as a utensil, this was completely unacceptable.  So was the quality of the injera:  dry and crumbly, with flour all over it.  I had trouble scooping up food because the bread would break in half whenever I tried to bend it.   Not only that, but the food itself was not quite right:  way too much salt (water water everywhere but GAG), badly balanced aromatic spices, and a meat dish composed of about 87% bone.  If you do go there, ask for their spiciest dishes, where the heat somewhat overpowers the Viennese saltiness.  The cabbage dish was also pretty good.\n\nIt is currently BYOB, but you may also wish to BYO water.  Afterwards, forget the memory of this place by getting a delicious cupcake just up the street.", "author": "Michael T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-09-29", "description": "Well i consider myself somewhat of a foodie and i especially love ethnic foods!  Ive tried several Ethiopian restaurants in and around the city and Bati is by far the best Ive tried!  not only is the food delicious but you find yourself in a very relaxing and friendly environment...definitely worth a visit!", "author": "charlotte b."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-07", "description": "I've only had Ethiopian food a couple of times, and both times were not the most enjoyable of dining experiences. So, last Friday, I went into BATI with little to no expectations, just to enjoy the company that i was with. However, I was pleasantly surprised by the food.  The four of us ordered 2 vegetarian combo platters which basically covered all of the vegetarian options (of which there are 7) and the Ye Beg Tibs (Lamb pieces sauteed in a blend of spices).  First off, the Lamb pieces were excellent.  I'm generally not the biggest fan of lamb, but this was cooked just right. The lamb was juicy with a nice kick that was not over the top.  The vegetarian choices were also very good, especially the Gomen (collared greens) and the Tikil Gomen (cabbage).  I also had no issues with the service.  We were seated promptly and our waitress was attentive, refilling our water several times.  All in all, we had a nice dining experience and would definitely go back again.", "author": "David H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-10-11", "description": "The service at Bati is wonderful! The waitresses are attentive, kind and great at explaining the dishes. In such a big city, it is very difficult to find this kind of atmosphere where everyone knows each other and it feels like home.  In terms of the food, the shiro was particularly good! I would definitely come back.", "author": "Lensay A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-29", "description": "Found Bati tonight walking around BAM area. Am a fan of Ethiopian food and have tried a couple places in the city which were both so-so. Bati is so far the best I've tried. The seasoning and flavors were distinct and spicy, the portions generous. We ordered one meat combo and one veggie combo which was the perfect amount for two to pig out. Service was friendly if a bit odd. Only downer was that we had to keep asking for more injera since we only got one piece to start. Overall, very satisfying and tasty meal for a relatively good value.", "author": "candice s."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2009-10-27", "description": "Awful service and OK food. Our waiter was so terrible I actually felt sorry for him along with being very annoyed. The kid was just one of the worst waiters I've ever been stuck with. He forgot EVERYTHING, from napkins, to our wine to our food and it made the meal a stressful experience. I will never go back especially since the food was just OK. The portions were tiny compared to the price.", "author": "Jason G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-06", "description": "This has the makings of a great neighborhood restaurant and friendly place to hang out. My friend  and I shared the vegetable combo and each dish had nuanced spices and satisfying flavors. The servers were warm and helpful, and for the moment, they're BYOB. Go try it!", "author": "Lauren A."}], "servesCuisine": "Ethiopian", "priceRange": "$11-30", "name": "Bati", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "747 Fulton St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/H_V2pdmsd0PQ6pTnN_K-Bg/ls.jpg", "@type": "Restaurant", "telephone": "+17187979696"}