{"aggregateRating": {"reviewCount": 210, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-29", "description": "I love Bati. In Brooklyn our Ethiopian choices are limited and Bati always comes through. Their mushroom dishes are delicious. The vegetarian combination never fails nor do the beef tibs. Ask for some Ethiopian hot pepper on the side for an extra kick. The spot is small but you'll almost always get a seat within a few minutes.", "author": "Danielle J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-21", "description": "My Family and I often come to Bati because its so close. The restaurant is often times very crowded and a bit loud. Its small with pictures of ethopians or one of batman on the walls. The music is loudish at times. \n\nWe mostly always get the Veggie meat combo. i enjoy putting a different combo of meal and veggie each time in the bread and eating it. Its a reallly good eat. \n\nThe wait staff can be slow or fast really depending on the night.", "author": "Immy M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-06-10", "description": "Don't compare Bati to other Ethiopian establishments such as Meskerem, Awash, Ghenet, or Queen of Sheba. Compare it to itself. I wonder if Bati is like a self-conscious nerdy teenager.\n\nBati is located on a busy and delightful part of Fulton Street.  There is something for everyone. If you are a fashionista, the Fulton Flea is one block away. If you are a bookworm, the Greenlight Bookstore is right across the street. If you are a lush, Habana Oupost is literally next door.  \n\nMy palate enjoys strong, powerful and spicy flavours, and Ethiopian fits the bill.  Ethiopian food is my favorite cuisine for several reasons.  For one, it is extremely vegetarian friendly.  Lots and lots of veggies.  I haven't come out of the closet yet, but I definitely have an affinity for all things colourful with high fiber content.  And also, the food encourages sharing, food brings people together.  And check civility at the door, this is hands only eating! \n\nJust a few words about Ethiopian cuisine because it is rather unique.  The main course is usually served on a sourdough flatbread called injera and it is made from fermented teff flour.  It has a slight sour taste to it, and the bread is soft and has the texture similar to a crepe.  The injera is your utensil, you use it to pick up morsels of meat and veggie.  It is sort of analogous to naan and indian cuisine (I hope I am not offending anyone).  In addition, ideally, it is eaten on a table called a mesob (made from straw).  I have not been fortunate to snag up a mesob table at any Ethiopian establishments, they usually are the first tables to go.  \n\nWe ordered the combination platters.  One meat combo, One veggie combo.  I won't lie, I was a bit wary of the meat combo, but my fears were assuaged once I tasted everything. The meat combo was a beef sirloin in a stew, lamb cooked in stew, and also a finely chopped primed beef in stew.  The one I liked the most was the the finely chopped primed beef in stew; flavourful, tangy and fiery.  I was a bit sad that doro watt was not part of the combo. After all, I have yet still to try the national dish of Ethiopia!  For the veggie plate, we had a choose of 4 veggies and opted for beets, collard greens, lentils and another veggie (the name of the dish escapes me right now).  The beets were disappointing, it didn't feel like an Ethiopian dish at all.  The collard greens and lentils were excellent!  \n\nThe total of the bill with tax was around $50 and that's including 2 beers. That is a steal! I will definitely be coming back again and soon! Bati is my newest friend on the block, who cares about those in the popular in-crowd anyways?", "author": "Vivian H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-08-22", "description": "Inside was beautiful,cool vibes. As for the food, They need to fine tune the basics. For example I have never been served freezing cold injera before in my life,that is until I eat here. When I asked for it to be warmed up the waiter first attempted to touch it to see if it was cold,But then he caught himself. Afterwards he took it to the back and brought it back and it was still cold. The food had a good taste to it,but the portions are very small compared to most Ethiopian restaurants. The customer service was decent, But at no time did I feel welcomed.", "author": "Clark B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-06-22", "description": "I went with my wife - who is Ethiopian. This was the second time we tried this place, as we normally go to Ghenet (on 4th ave). The experience was worse than I remembered. \n\nThe food is mediocre at best. It's very bland which is pretty hard to do with Ethiopian food. The only good dish was the Kategna appetizer (injera toasted with butter and berbere). Funny story on that though - a fellow customer told us to check-in on yelp and we'd get a free order of Kategna. We did that, but they wouldn't honor it claiming that the voucher was for 2 pieces of Kategna while the item on the menu was 4 pieces of Kategna, really? \n\nThey are very rigid with their menu options. We wanted to try the meat combo and asked that they substitute one meat dish with a vegetarian - they said no.\n\nTo add insult to injury, the items are more expensive than any other Ethiopian restaurant I've been to. Won't be trying this place again. \n\nIf you want excellent Ethiopian good that is reasonably priced - go to Ghenet!", "author": "Kevin L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-05-28", "description": "Was here with friends. Have eaten lots of great ethiopian food in California and Texas.  Even others in NYC are better. \n\nWas here on memorial day weekend with a few friends. Waited about 45 mins for a table, but that is cool. Ordered food, and waited without water refills for about an hour and a half before our platter of food for five people came out......\n\nONLY TO BE GIVEN TO THE COUPLE SITTING NEXT TO US. Whoops. The waitress apologized that she had given our orders to the couple next to us who had just sat. Oookie. Waited another 15 mins for our food, for which we were starving.\n\nTo be fair, the quality of the food is alright. Taste-wise. But really scanty portions. We ended up ordering two more entrees which took another 30 mins. STILL NO WATER REFILLS.\n\nAnyways, food-wise, taste-wise, it is acceptable. But after the service we received, when the bill came out with a 20% gratuity included, some of my fellow diners were inclined to try and leave a negative tip.\n\nWell. Buyer beware! Will not be back. Ever.", "author": "Desmond F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-23", "description": "Went here with a group of 4. Food was amazing! Great for vegetarians/vegans. A wide selection and priced similarly if not a tiny bit cheaper than other Ethiopian restaurants in the area. Would definitely go back.", "author": "Rachel A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-05-28", "description": "Food: 3 stars\nPortion: 2 stars\nPrice: 1 star\nService: 1 star\nAmbiance: 3 stars\n\nI have tried many Ethiopian restaurants, but this is the worst one ever!! Small portions, overpriced food and wine, horrible service and they included 20% tip!\n\nThey made us wait for 1hour till we got the food. On top of that, they gave our food to a wrong table. The customers who got our food were confused, but was kind of forced to eat it. Then, the server came to us and asked, \"we gave your food to a wrong table. what do you wanna do?\" What do you mean what do you wanna do? We just wanted the food as soon as possible!\n\nOn top of that, the food was ok, the portions were way smaller than other Ethiopian restaurants I have tried. If you want to go to a good Ethiopian restaurant, I'm sure Yelp knows a better place with more than 4 stars.\n\nAlso, if you are a big group, they won't give you a table for a long time.", "author": "Aya M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-25", "description": "This Ethiopian restaurant is the closest thing to authentic next to my mama's my kitchen! Food was fresh, delicious with generous portions and fantastic customer service to boot. The owner was so sweet it was very humbling to see her checking in on her guests. Artwork \u0026 music was a great touch deserving of 5 stars.  I'll definitely be back!", "author": "Mimzzy G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-05", "description": "High five for the vegetarian combo! Go with a friend and take 2 vegetarian combos so that you can taste all the veggies and double one of them. \nThey also have specials sometimes such as the mushroom tibs: excellent!!\nThe waiters are very friendly and welcoming, the service is pretty fast. Make sure you get there by 7 pm and enjoy a dinner without too many people around. I love this place!", "author": "Veggie G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-03-08", "description": "I've eaten Ethiopian all over Ethiopia, Kenya, Italy, France, Canada and the US. I've tried all the Ethiopian restaurants in Manhattan and Brooklyn. Bati Kitchen used to be the best, hands down. After traveling extensively for the last six months I finally was able to make my way to Fort Green for a hit of my favorite food.\n\nI was so disappointed I nearly cried. \n\nThe food has changed drastically  since I was last there. It used to be delicious and spiced to perfection, each dish boasting its own unique flavor profile. Now it is dry and tasteless, oily and flour-y. \n\nI had a few bites of everything, hoping it was going to get better, thinking that maybe it was ME. It wasn't. It was the cook, apparently.\n\nI asked the gracious waiter if they had a new chef and he sheepishly said yes, and asked why. I told him and he was very apologetic and said he would tell the owner. I hope the management can fix this. I miss Bati but I won't go back unless they get a new, improved chef -- or better yet, hire back the old one.", "author": "Debra L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-16", "description": "Great place. Food is delicious and our waitress couldn't have been nicer. Four of us split the vegetarian combo plate and tried all the veggie dishes. Ethiopian beer God too. Yum! Atmosphere is chill and its conveniently located. I will definitely be back!!", "author": "Ellie G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-11", "description": "i'm no expert on ethiopian food but i know flavor and spice and deliciousness and this place has it. i go often and get the same thing every time - their home made tea, the kategna to start and the veggie combo. the collard greens and spiced lentils are my fave. the chick pea dishes are next up. the cabbage is pretty good but sometimes there's a lot more ginger than others. i would like the beets more if they were hot. \n\ni don't know if it's all the iron in the injera (bread), but i always leave this place feeling full but not stuffed, and stronger than when i arrived. really fortifying, satisfying, flavorful food that is good for you. love.", "author": "Lola M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-11", "description": "Tried it for the first time despite mediocre reviews and was pleasantly surprised. Got the veggie combo to go to eat in Fort Greene Park and found the generous portion to be flavorful, not all all like the reviews I read about bland and tiny servings. I even had enough leftover for lunch the next day - and I have a big appetite. I had the lentils, split peas, cabbage and collard greens. The service was also good - quick, attentive and they made good recommendations. I've also eaten at Ghenet a bunch of times as well as other Ethiopian spots. I will be back, though sadly not that frequently since an $18 veggie plate is a bit more than I like to spend.", "author": "Shannon B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-22", "description": "We love this place, amazing food and great customer service.make sure you check it out when u are in Brooklyn", "author": "Sara B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-07", "description": "I adore the warmth a jalapeño pepper gives off in my mouth. I really love the comfort and complex flavors of stews or meat dishes that make u feel satiated and ready to face the barren duldrums of arctic Brooklyn on Superbowl Sunday.  \n\nCinamon, clove, cardamom  black tea and soulful African music is completely Unwinding my stress and my stomach and soul are smiling.\n\nThis is the right meal at the right time for me and I feel sheltered and at home at this elegant but laid back bistro.\n\nService is spot on. Incredibly gracious without being intrusive.\n\nMy mini criticism is the lamb was either a bad cut or not cooked well enough until tender.  The flavor/seasoning was done right. I had ye beg ttibs, a lamb dish. \nI'm no expert on Ethiopian food but this was well presented, nourishing and tasty winter blanket for my stomach and palate as far as I'm concerned.  It is down home with more class and Brooklyn flavor than other Ethiopian places I've been.\n\nI'll gladly return and I'm ready to face the chill now.", "author": "Foodie Mamma X."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-13", "description": "I have been here a couple of times: with a group of friends, on a date, by myself after picking up a new book at Greenlight, and before/after seeing a film at BAM. \n\nA couple of nights ago I went again, and it was as good as ever!  There were three of us and we had 2 vegetarian platters, the lamb stew, and the Kitfo,  It was all amazing, but the Kitfo was so good that we ordered a second one!  You should definitely get the Kitfo, and don't be scared to go with the traditional rare preparation. It's spicy, buttery, peppery and downright carnal. \n\nThe injera:   I saw that a couple people had voiced concern that the Injera wasn't thick and spongey enough...  I think that that is strange and I can only offer that perhaps you are used to super thick injera, because you are used to going to places that put a bunch of bleached white flour in their injera.   The Injera at Bati is the real deal, thin, light, and definitely spongey.  More than this, because it has no flour in it, it has that perfect sour, toasty, tang to it, which perfectly complements the spice in the dishes.  It is the best injera I have had outside the DC area. \n\nThe veggies:  Like I said we tried everything (again), and liked nearly everything.  The Shiro, the Gomen and Buticha were our favorites.  I have have the Buticha a couple of times... and usually it is crumbly like cheese, but this time it was creamy and smooth which I really liked. The only one we weren't completely thrilled with was the Beets... the potatoes were kind of over-cooked and the whole dish was kindof bland. \n\n\nThe service was great: super friendly and helpful.  Our water glasses were always full.  Both of the servers checked up on us often without it being intrusive. \n\n\nAll and all a great time.", "author": "Tj D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-12", "description": "Food is always great here!! The dining area is pretty small and the service is OKAY...", "author": "LaDonna M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-06-06", "description": "I've been to a few Ethiopian places in NYC but this is the most convenient to neighborhoods where I hang out, so I'm glad to have the option. Good, solid cuisine -- though I can only speak to the veggie dishes. Portions are not ample, but not tiny. Two adults splitting a combo plate may want to order one extra serving of a particular favorite to fill in. (I like the intimacy of sharing a plate with my bf or a good friend, but others may find it awkward.) \n\nMy few visits have all been during uncrowded times and the noise level is low and the atmosphere was pretty calm. I would probably not go in if all the tables were full -- it would be a bit too tight in the small space and I hate being forced to eavesdrop on neighbors. I've never had a problem with the speed or attitude of the service, though this is not a place for someone in a rush (but what Ethiopian resto is?!?). \n\nThe beer selection is an authentic \"light or dark?\" so if the drinks are important to you, you may be disappointed. I'm quite happy with water and just one \"dark\" beer to counteract the food's spices. \n\nIt's not a place I'd drag all my friends to, but a nice choice for a solid, reasonably priced quiet dinner in Ft. Greene.", "author": "Amy W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-11-25", "description": "We were so excited to eat Ethiopian food again and near our house. It was a let down.\n\nThe service, although friendly, was a bit lack lustre. The injera triangle appetizer was spicy with no sauce. We ordered both the meat and vegetarian platter for two adults and a preteen and it did not fill us up. The portions were very small (compared to Awash in the city) and expensive. There was hardly any meat,  just a spoon full of puree food. The flavor seemed to be the same in most dishes. A bit too lemony overall. The honey wine is always delicious. No arguments there. Spent almost $100 and left disappointed and hungry. Don't think we'll be back.", "author": "Veronica T."}], "servesCuisine": "Ethiopian", "priceRange": "$11-30", "name": "Bati", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "747 Fulton St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/H_V2pdmsd0PQ6pTnN_K-Bg/ls.jpg", "@type": "Restaurant", "telephone": "+17187979696"}