{"aggregateRating": {"reviewCount": 210, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-05-15", "description": "Me and a friend decided to try this place last Saturday night after seeing on Google that it was BYOB. Turns out it is not BYOB. We decided to leave after finding out that the place was not BYOB, but not because of that, but because the place was very stuffy, the service was slow, and the waitress was very passive aggressive about telling us that the place is not BYOB. Oddly, when we arrive even though almost all the tables had people seated, only one table of people had food.", "author": "Robert R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-01-31", "description": "I think I found the only restaurant in New York City that seats a group before everyone has arrived. Next time I will have to use that to my advantage. \n\nBati is a nice quiet spot, and our waitress was very nice, unfortunately the guy at the bar was a little snark. We had the vegetable combination platter with the doro wat (sp?) chicken dish. For the price I expected more food, but I was pleased with the flavors and in the end was full enough to not be swayed by a $6 baklava. \n\nOverall it was a good experience made better by excellent company, but the value is not good enough to get that fourth star. My winter appetite is far too big for Ethiopian-sized portions. Apparently.", "author": "G L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-04-06", "description": "Went here this past Saturday for a laid-back late dinner with an Ethiopian food connoisseur. As for me, I just enjoy eating with my fingers :)\n\nWe walked in and saw that it was full, and the dining area was small.  The waitress kept telling us that we would be seated shortly, so in the meantime I ran out to get a bottle of wine, as Bati is BYOB.  When I got back, I saw that the party who had arrived there after us was seated, and my dining companion was slowly getting to the point where steam was coming out of her ears.  The waitress again reassured us we would be seated next.  But then a party of 6 arrived and were seated (apparently they had left their number to be contacted when a table opened up).  Now the steam was coming out of both of our ears.\n\nAt this point, the manager saw what happened and quickly opened a table for us.  Then they proceeded to treat us like royalty, being super attentive and jumping through hoops.  When our meal arrived, it arrived with extra vegetable dishes that were compliments of the house, and when our bill arrived it was only for $20, when we easily ate $40 worth of food.\n\nThe food was definitely on par with the best Ethiopian I've had.  But what really made the night was the service.  Folks, these people know how to do it right.  They could have easily taken the situation and turned it into a horrible evening.  Instead, I was so moved by the great service that I'm writing my first Yelp posting about this place.", "author": "Shoor K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-13", "description": "This has become a favorite spot for me and the mister. As former residents of DC (which has a large Ethiopian population and thus great options for Ethiopian food), we feel Bati is pretty authentic and really delicious. Our favorites are the kitfo (get it raw!) and the gomen (collards). For the two of us, it is usually plenty to order those two as entrees. The waitstaff is always super friendly and we like the cozy atmosphere.", "author": "Elizabeth M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-04-02", "description": "Two weeks ago: \"Wtf, when did this Ethiopian joint pop up?\"\n\nCue Harry: \"I'll order two empty plates and we can leave.\"\n\nA week ago: \"F, I keep forgetting to check out this place.\"\n\nCue Michael McDonald vs Warren G.\n\nYesterday: \"Damn, this joint is great!  Friendly service, nice vibes, great food, and BYO!\"\n\nCue happy chirping birds and smiling squirrels under blue skies and a golden sun.", "author": "Arthur O."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-02", "description": "So excited for Ethiopian in Fort Greene! I've been walking by weekly (or so I thought) for ages trying to figure out when this place was going to open. Well when I walked by today they said they'd been open for three weeks already... don't know how I missed it!\nI picked up my first takeout menu for Bati and I'm salivating already. Gods willing, I'll get to eat there tonight!\n\nUPDATE:\nThe gods were kind and everything we ate was delicious with the exception of the buticha (I think...) we had 2 chickpea dishes and I believe it was the buticha that we just found so-so, a bit like a chickpea salad or a not so flavorful hummus.\nWe also tried the kategna, while we thought it might be redundant to the injera and planned on saving it to eat with our meal instead of injera, we ended up devouring it before anything else even made it to the table. \nThe meat combo (minchet abish wett, tibs wett, and ye beg alicha) were all delicious. I'd also note that the service is ~much~ friendlier than the service at Queen of Sheba (now my SECOND favorite Ethiopian restaurant). The only thing they are missing is probably some samosa type appetizers (QOS calls them sambousas I believe?).\nGo now while it's still BYOB! They are planning on getting their liquor license soon.", "author": "nara f."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-18", "description": "Having eaten Ethiopian only once before this was going to be a fun experience regardless.  I even took a cooking class in Ethiopian food but never made any of the dishes from the course once completed.  Oh well, I will leave it up to the professionals.  This restaurant in Ft. Greene did not disappoint.  I love eating with my hands, so that was a huge plus.  I went with a friend who lives in the neighborhood.  This is a fun spot to have dinner.\n\nNeither of us are vegetarians by any means, but we opted for the veggie combo plate which gave us all the options on the menu.  Everything was delicious.  The string beans with carrots were my favorite.  \n\nNot sure when I will return, but looking forward to it.", "author": "Caesar R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-05", "description": "Since I've been to Queen of Sheba, Awash, Meskerem, I feel like I have a pretty good idea of what Ethiopian food should taste like. This place got it right.\n\nMost places use a lot of berbere, which I love, but it makes most dishes taste the same. Not here. They give you three free items -- veggies (green beans and carrots), and I think chick peas and maybe red lentils? I wish they had told us about that part, because adding the collard greens (delish!) and kitfo was a bit much. \n\nA word about the kitfo. The idea always entices me (raw meat and butter, yumm) but it never delivers the way I like. We ordered it medium rare which I think helped. They also served it the traditional way, with (cottage?) cheese. The server told us it cuts down on the spice from the meat. In case we wanted it SPICIER, though, we were provided with a tiny dish of Ethiopian spices.\n\nI'd definitely come back here. Two cons, though: first, no liquor license yet (aka, no honey wine!) and second, neither me nor my dining companion felt great later that night, but then again we might have just eaten the delicious food too fast :)", "author": "Lauren K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-06", "description": "I'm not a seasoned Ethiopian diner, but this place is awesome. We split the Veggie Combo, and it was a perfectly balanced and flavored meal.  The atmosphere is fine, the server super sweet and attentive, overall a really excellent dining experience.  If you've walked by several times and thought, \"hey, i should try this sometime\" DO IT. Bati won't disappoint!", "author": "Katy T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-13", "description": "I'm surprised by the amount of negative reviews on here for this place!  I've had Ethiopian many times but I am by no means an expert, I just love the different flavors and textures and the way your hand smells like ginger and spices hours after you eat (I think another reviewer pointed this out earlier, but I don't remember who).  \nOverall, it was a great experience.  We went on a Sunday during off hours so there was no crowd or loud music so can't speak to that part.  There was only one woman serving the whole place but there were only 3 or 4 tables filled at any given time and she was super friendly and attentive, we thought.\nOn to the food: the BF and I went in there knowing that we wanted a meat combo, and what you get with this is 2 beef dishes and a lamb stew, with two veggie sides.  I asked our waitress if we could choose the sides from the veggie menu and she said, \"of course!\" with a smile, which was great because I've been to ethiopian places before where I was told we weren't allowed to choose which veggie sides we would get (which always seemed suspicious to me).  I thought the food was very flavorful and pleasantly spicy, not at all bland.  And yes, I have had bland ethiopian before.  This wasn't it.\nWhen the food came, it looked like it might potentially be a small portion, but once you finish using the injera that's in your hand to scoop up the meat/veggies, it's time to eat the plate!  By the time we were finished using the injera that was used for the plate to finish off the rest of the food on top, we were pleasantly full with room for baklava, which was good, not amazing, but we enjoyed it.\nWe were given a glass bottle full of cold water for us to keep refilling if we wanted to, and had another brought as soon as ours got low so I also can't speak to the not-refilling-water problem.  When our check came, it had a smiley face and \"have a great one!\" written on it.\nSo I guess I didn't experience any problems, service or otherwise, that people are writing about here, which is why I came on here to write this.  We will definitely be back, if you're thinking of going don't be deterred by some of the negativity here, give it a try.  I thought it was much better than Ghenet.", "author": "Joanna M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-11-07", "description": "poor service and it's unbearably loud and hectic. i couldn't hear a word my friend said from across our tiny table.  the waiter said they turn the music up when it gets crowded, which makes no sense at all. we waited for almost 20 minutes before we were even given water or asked for our order. in general, i usually find the service at ethiopian restaurants to be some of the most friendly, warm, \u0026 generous around; this is certainly not the case at bati.\n\nthe food was mediocre. \n\ni won't be back again.", "author": "Beth P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-12-17", "description": "Bati has truly authentic cuisine. The ambience is intimate and perfect for a date or a close group of friends. I have been to many Ethiopian restaurants in the city and Bati is by far the best!!", "author": "Alexandra M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-08-15", "description": "I had been there numerous times because I used to live nearby and always thought the service was terrible, food okay, overpriced, small portion, but I love Ethiopian and this was the nearest choice. But this evening was the worst service I had received in a restaurant ever.  I have never written a yelp review before and felt compelled to write this.\n\nTonight, it was pouring rain, around 7 pm, and the three of us were the only ones in there. We had a child with us, and we ordered two vegetarian combo for three of us. The waitress promptly brought out the wrong combo vegetables. No big deal, we said, fine. I did ask, however if we could have small empty plates each since all we had was the big sharing serving plate in the middle of us with the food on it. Our child was confused where he should put his food in case he could not finish his bite. The waitress smirked and said NO. She said that they do not have enough plates, and if more customers come, they will run out of plates. The restaurant was EMPTY. I said, but there is no one here, and this is a restaurant, why don't you have enough plates? I am just asking for three small empty plates. She said NO. Then she sighed and went back and brought out one. I said, there are three of us, could we have three small plates?  She rolled her eyes and brought one more. But she won't give us three. Not enough plates, she repeated, for other customers although it was pouring outside and the restaurant was empty. I have never ever experienced something like this. I wondered if this was a cultural thing, that they don't give small personal plates for a shared dish. But this restaurant is in Brooklyn, not in Ethiopia, and if we want small plates to put our food between breaks, I think the customer should be given one without being refused. It is simply bad manner, unkind, unprofessional. Restaurant business is meant to be a service industry.  Who cares about the food, that awful waitress, her unpleasant attitude ruined our evening, and we paid money to be treated like that. \n\nI will NEVER go back. I would give a zero or a minus rating if that were an option.", "author": "Kim K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-02", "description": "Ethiopian food is my favorite type of food and Bati is my favorite Ethiopian place in the city. The atmosphere is cozy, service very friendly, and food amazing. The injera is particularly good here. Love it!!", "author": "Rachel S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-19", "description": "Just about 2 months old and taking Ft. Greene by storm. Traditional ethiopian dishes awaits you. I liked the lentils the best. They were spices but great with the injera. \n\nI agree that the decor and service add to the value of the meal.", "author": "Jessica M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-06-25", "description": "The decor and ambiance of this place is modern-eque and simple. The staff are very friendly and helpful. If you're new to Ethiopian, one thing you should know is that you should expect to eat with your hands for the entire meal basically. Anyways, a group of us ordered a couple items from the menu (some meat and vegetarian entrees) and we all sampled some with our Injera (colorful Ethiopian \"bread\").The food was all flavorful and filling. All in all it was great Ethiopian cuisine.", "author": "Mehreen W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-06-28", "description": "I used to love Bati. Was my FAVORITE  place out of the many places I have tried in the city.  But I have grown weary of ordering meat plates that only come with alot of sauce and extremely little meat, i(I mean I had to ask if it was the meat not veg. order)  as a opposed to several other Ethiopian restaurants that I have the opportunity to have all over the city.  The kifo is always good and good amount but when i have order other meat dishes its quite the opposite. So so sad to have to say. Also hate you have to constantly ask for injera because  they never give you a good amount from  the beginning,  again to other establishments, even when you ask them from the beginning extra injera please, so that you don't have to do it later when your in mid eating and have to flag someone down and wait for more.  But the food is delicious which is why I gave it an OK. I will def. give it another shot at some point, because you know you can't just let go that easily of your favorite lover.  But but.. even beauty gets old.. so ..for now, I think  Queen of Sheba will be go to.", "author": "Khemet D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2010-07-16", "description": "My husband is Ethiopian and we've been here twice.  First because we were in desperate craving of Ethiopian food and second to see if our initial take on the restaurant would change (maybe the first visit was a fluke?).  It did not change.  \n\nIn a City of fantastic food and actually good Ethiopian restaurants (like Ghenet), you can't survive with the non-existent customer service that Bati provides and the weak flavors in the injera, doro wat, etc.  Come on, my husband loves good Ethiopian and I, being Indian, know my spices.  This place doesn't live up to what the food can provide.\n\nI would save yourself the time and go 15 minutes in the opposite direction to Ghenet.  You'll be glad you did.", "author": "Vanessa S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-03", "description": "I eat here almost once a week I like it so much, and I live in Fort Greene. I'm not giving it 5 stars because once in a while they seem to have a chef who cooks the food a little differently and not as well as usual. And they have styrofoam to-go containers. \n\nOtherwise, love it. Its almost always really tasty and the service is great. \nI find the review by Joanie K offensive... playdoh? That's cultural sensitivity for you. I wouldn't listen to someone who's never had ethiopian before. I'll agree with her that a wet towel at the end would be lovely, but you could also get your ignorant butt up and wash your hands in the bathroom. \nI say this place is great.", "author": "ygtb k."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-11", "description": "The waitress here was totally awesome, the food was amazing.  It ends up being kind of pricey, but it was delicious.", "author": "Vanessa G."}], "servesCuisine": "Ethiopian", "priceRange": "$11-30", "name": "Bati", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "747 Fulton St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/H_V2pdmsd0PQ6pTnN_K-Bg/ls.jpg", "@type": "Restaurant", "telephone": "+17187979696"}