{"aggregateRating": {"reviewCount": 210, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-08", "description": "Came here in the middle of the day on a Sunday. Me and my friend were the only customers there. It was a cute little spot though, with fun artwork on the walls. I absolutely loved the food. Very authentic and flavorful. Top your meal off with an ethiopian coffee!", "author": "Amina H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-12-08", "description": "Very tightly crowded and too noisy for decent conversation. The wooden tables are outdoor tables which turn the plates and food cold too fast. It was ok. Gave me indigestion. Flavors a little harsh and salty than they needed to be. Tried it. Will go elsewhere. Maybe ok for a through the week local spot.", "author": "Linda S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2009-09-02", "description": "Have eaten here twice. Meh. I'm a fan of Ethiopian food in NYC in the 80s. Make of that what you will. \n\nAnyway: super nice condiments: berbere powder and paste, if you ask for it. Also, cold lentil with mustard oil appetizer is BRILLIANT.", "author": "Pritha R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-07-24", "description": "(Update::Thank you to the reviewer who attacked me for my review via message box! Loser!)\n\nFirst, You eat with your hands. No utensils. Very Small portions for unreasonable prices. Limited vegetarian menu. Says its Ethiopian but feels pretty American to me. \n\nOnly one male Waiter who  is tacky, oblivious. I had to keep asking him for everything, he never even came to check on our table. He treated us like we weren't there. The Place is too tiny, your table is cramped upon another customers table..and there is only one desert which isn't worth it for $6 some sort of vegan slice of almond cake. One tiny bathroom , if someone is in it they dont like you to form a line.. and only a few wines and water to chose from no juices. I'm not going back here its not authentic Could not believe I wasted $20 on peas and carrots and basically a warap which hurt my stomach later on. Its just peas and cabbage for about $20 a dish with 4 small options. If you have money to throw in the garbage and are ok with still being hungry after you go here, This is the place for you.", "author": "Marie Annick M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-07-03", "description": "Stopped in here on a whim since our planned dinner spot was too busy.\n\nImmediate service was great. We ordered the chicken stew and vegetarian platter. We were given the option to get it all on one huge plate, which we chose.\n\nOur food arrived quickly and was served at the table onto a giant platter of flat bread, with extra bread on the side.  Everything was delicious.  The portions were pretty small, but the fact that you had to slow down and eat everything by hand (no utensils whatsoever are provided) made you actually fill up, instead of just stopping when you're ill from overeating.\n\nOnce the food came out though, we never saw our server again, or should I say he never looked up again.  With the spicy foods, with quickly ran out of water. Waiter comes out, checks on the couple closest to the front counter, walks away head down.  We give up, try to get the check. Waiter comes out, checks on the couple closest to the front counter, walks away head down.  I walk up to the counter to try to get his attention directly.  Waiter comes out, checks on the couple closest to the front counter, walks away head down.\n\nIt got to be a rough situation, as we had a show to catch.  After 30 minutes of enjoyment, we sat through 30 minutes of zero service.\n\nOverall, great food, but wouldn't come again due to lack of service.", "author": "Brian Y."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-25", "description": "Yesterday was my birthday and I chose Bati to celebrate. First off let me make one things clear: Ethiopian food is my all time favorite food ever; if I had to eat one cuisine for the rest of my life this is it! Some might think this would make me picky, but au contraire mon ami, it mean I will eat and probably love any Ethiopian food no matter the quality. So it's really about just HOW GOOD the food is because there really isn't any bad Ethiopian food!\n\nMy BF and I order 2 vegetarian combinations, which is a choice of 4 veggie entrees ($14). Since there are 7 veggies I asked the waiter to bring us all of them, doubling up on the Tikil Gomen. We received the bounty on one large platter and the waiter told us the name of each dish. Visually I couldn't tell the difference between the Shiro (ground chick peas in a thick sauce) and the Missir Wett (split lentils in a stew), both we just ok, but one was clearly better then the other. The Ater Kik Alicha (split peas in a mild sauce) was a bit bland, as it should be. The Fasolia (string beans and carrots) and Gomen (collard greens seasoned with garlic and ginger) were pretty standard, but my BF loved the collard greens. The injera was nicely sour but unforgivably cold and dry. Actually all the dishes were a touch too cool.\n\nSo up to this point everything was pretty average and I was a bit hesitant to try my absolute favorite Ethiopian dish of all time, the Tikil Gomen (cabbage seasoned with garlic and ginger). But Bati gets this dish 100% right - the cabbage is rich,caramelized and nearly perfect. I'm also shocked by the Buticha (ground chick peas in a blend of onion and pepper), this is usually my least favorite dish, but dude, their Buticha is what heaven would taste like if it were cold and crunchy too! We ended my dinner with a piece of warm sweet swimming in honey Baklava ($5) and I'm happy to report that it's one of the best pieces I've ever had.\n\nThis is definitely the classiest Ethiopian joint in all of NYC, and the price is just right (especially with the BYOB). If they just figure out how to warm up the injera before serving this will unquestionably be a 5 star joint!", "author": "Kelly B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-22", "description": "This is my favorite brooklyn restaurant experience. Great value, amazing good--actually spicy if you want. Lovely service. Ideal.", "author": "Kate D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-28", "description": "I went to Bati on the Sunday before Memorial Day with two friends, and we only needed to wait 15 min for a table. The food was great - better than a few other Ethiopian places I have tried in Boston. The portions did seem small, but the three of us ordered an appetizer and 2 combos, and it was enough food. The glasses of wine were very small, however.\n\nI wished that the place would have had wipes or wet towels or something - the food is messy and the napkins tend to shred. But overall, I thought it was great, and I would go back!", "author": "Becca S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-02-27", "description": "I'm still waiting to try the food - we waited over 40 minutes for a vegetarian platter, and when it arrived there were two items we did not order.  How difficult was it to get the order correct?  We had to leave to get to a show.  I read the other reviews, so we allowed a lot of extra time.... and apparently it wasn't enough.  When we arrived, there were many open tables, probably only 4 - 5 tables were seated / dining, so it wasn't a question of the servers or cooks being too busy.  What a disappointment, I really wanted to try the food.\n\nI am going to have to find another restaurant to try Ethiopian food - I was so looking forward to it.", "author": "Nic G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-12", "description": "I'm so happy to have tasty Ethiopian in Brooklyn and not have to trek to Manhattan.  I was really impressed by the vegetarian platter- really flavorful and well spiced.  More heat that at other places, which was delightful.  It's pricier than other places ($17- I'm used to $14), and the veg platter doesn't offer everything- you have to pick 4.  They're also kinda stingy with the injira and it comes on a plate.  I wish I got more food for my money, but I've never left hungry.  In fact, I've never left feeling anything other than completely happy, satisfied and looking forward to eating there again.", "author": "Bex A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-05", "description": "One of the better Ethiopian places in the city. I've had most of what's on the menu and nothing disappoints. The basic dishes are well prepared and well spiced (albeit for a mild palette) The service is acceptable, aside from when it fills and the lone waiter is over taxed. The kategna appetizer (one of my favorite things in all of fooddom) is excellent, it goes perfect with those sweet Ethiopian beers. At the end of the meal try an Akeem stout if they have it, it's sort of sweet and fizzy Guinness, really good to say the least.", "author": "Will R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-01", "description": "My boyfriend and I really enjoyed this place. We got an appetizer- the Kategna, which was really tasty. I had the vegetarian platter and got ta mixture of hot and cold dishes (helps to ask to know which are which). I was totally full and satisfied after eating here.", "author": "Liesl E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-03", "description": "On a whim, a friend and I decided to try this neighborhood Ethiopian restaurant up the street. I had passed by it a zillion times but never ventured in. It was mid-day so in between the normal lunch and dinner hours so the place was pretty quiet. The server was friendly and helpful in explaining the menu items. We decided to try an Ethiopian lager, called St. George,  which was not too sweet and not too stouty. We shared the tomato salad with injera to start. This was my first time trying Ethiopian food and I learned that injera is the typical bread served alongside dishes. It is almost crepe-like in texture, a bit spongy and stretchy, chewy but really tasty. The salad was nice on top and you just rip the injera and scoop up some of the salad to eat it. Yup - no utensils - it's all hands on eating here! We then shared a vegetarian combo for our main course and sampled 4 choices: berbere stewed lentils, green cabbage with garlic and ginger, collard greens with garlic and ginger, and cubed beets with potatoes in a marinade of lemon, onion and jalapenos. All dish samples were fantastic and served atop a large \"plate\" of injera with extra injera on the side. The collards and the cabbage were tasty without being overpowering. The beets had a little after-kick from the jalapenos but were refreshing and cool. My absolute favorite was the berbere stewed lentils. I have never tried berbere spices before but this will certainly be something I eat far more in the future. Warming in flavors but not too spicy, it was similar to a curry paste mixture but far better. We truly enjoyed our lunch and for reasonable prices I think it is definitely worth a try!", "author": "Lindsey S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-27", "description": "Having worked in Addis, I am no stranger to Ethiopian food both in Ethiopia and of course here in the States. \n\nThe food is great. Yes, other places sometimes will give you a little more bang for your buck (the portions are a little small--so minus one star)--but the quality is all there. I'm okay with having to ask the waitress to bring more fresh injera, rather than having a pile of it just sitting on the table and possibly going to waste! \n\nThe food is spiced just right and does the trick. I've ordered most items on the veg menu and have not been disappointed. Carnivores I've gone with have enjoyed the chicken (on a bone) and the lamb tibs (off the bone). \n\nNot too many servers, but we've always gotten served and despite sometimes only having one person waiting tables for the whole room--have never waited long to get someone's attention.\n\nAll around--if you can't get to Addis, but want some good quality Ethiopian food in Fort Greene-- come here!", "author": "Toobab T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-28", "description": "If you don't like eating with your fingers this place isn't for you!!  You simply have to lick those fingers.  The food is that tasty...a little on the spicy side so just let your wait staff know your preferences, they are totally accommodating and the wait time for food is not long at all.  Try their honey wine, goes really well with the cuisine.  Desserts need more variety.  Quaint, cute, cozy spot on the Fulton strip.", "author": "Helene B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-16", "description": "Before coming to Bati, I had never once tasted Ethiopian food. Now that I have, I realize I've been missing something in my life.\n\nThis was the first time I had sampled honey wine - or mead, if you prefer. What a completely delicious drink! I found it to be similar in sweetness to Chardonnay, and it definitely had a robust taste that covered your palate. What I enjoyed most about eating here, though, was eating differently. At first, when we received our entrees on one platter served over injera, I was mildly offended. \"Where the hell is my fork?\" was my initial thought. And then as I got into eating with my hands, tearing apart the injera to scoop up the spicy, flavorful meats we selected, I found myself smiling. Here was a restaurant that not only challenged my palate with different tastes, but challenging the very way how I consuming what I'm eating. And hey, it's always fun to eat with your hands.\n\nThe service was excellent, with the waiter giving recommendations and explaining the dishes. I rather liked the ambiance and the decor, and agree with reviewer Dave P.'s assessment: cozy and simple. If you're looking for a nice night out with your significant other, a date, or even a small gathering, you really can't go wrong with Bati.", "author": "Jon H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-07-17", "description": "Let it be known that I think Ghenet has the best Ethiopian food in NYC (although I hate the service and decor), so I was somewhat skeptical of trying out Bati when the Yelp reviews were, quite frankly, so incredibly mixed.\n\nFirst of all, I love the interior, cozy and simply wihout seeming stark, it felt a bit like eating at the Little Owl or something. The tables are really cool and they have a great wine list. Although I would recommend trying one of their honey meads. I had the cheaper one on the menu and it was great.\n\nI also really loved the way they do their portions. At ghenet you have to choose one of like 5 main meat (or veg) dishes and then you get two vegetarian sides to accompany it. At Bati, they give you a decent portion of not one, but THREE meat dishes and two veg sides, for less than one costs at Ghenet.\n\nI thought that the food was terrific, and may try and start going to Bati over Ghenet if only for the nicer ambiance and staff. The lamb and two beef stews (one of which was quite spicy which I love) were all tender and well seasoned. I guess the reviewers who were complaining about too much salt or a strange taste must have gone on an off night. The veg sides were great as well, nice flavor and consistency. The only thing I'm going to grade down a little, but JUST a little, is Bati's Injera, they are a bit inconsistent, but at the end of the day are delicious and serve their purpose. I definitely recommend Bati, great date spot and overall great Ethiopian food!", "author": "Dave P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-31", "description": "Bati is great! Had a great New Year's Eve dinner here, huge meal and 2 glasses of wine for under $60, a great deal for New Year's Eve in NYC. Delicious ethiopian good! I'll definitely be back.", "author": "Kelly S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-21", "description": "I have had quite a bit of Ethiopian food in the US and would say that based on only one visit here, this is my second favorite Ethiopian spot. The first is in Seattle. \n\nExtremely flavorful dishes. Every one. Love the ambiance, the music, the service was sparse but very friendly, non-intrusive but effective. Honestly stumped by all the poor reviews here. I will absolutely be bringing all my friends and likely some dates here. Lucky dates!", "author": "Gabriel B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-19", "description": "Bati has a convenient location , on Fulton Street near BAM, and a good choice of vegetarian options. We enjoyed a veg platter for two, with 4 choices per person, plus injera, which was moist and flavorful. Service was quick and friendly. I loved the hot spicy chick pea, the cold chick pea , lentil and split pea dishes, the spicy cabbage and collards. I definitely will return . Prices were reasonable though the wine list, from which I didn't order, seemed a bit pricey for the neighborhood . A good option for pre or post BAM dining.", "author": "Nancy c."}], "servesCuisine": "Ethiopian", "priceRange": "$11-30", "name": "Bati", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "747 Fulton St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/H_V2pdmsd0PQ6pTnN_K-Bg/ls.jpg", "@type": "Restaurant", "telephone": "+17187979696"}