{"aggregateRating": {"reviewCount": 210, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-10-26", "description": "My friend had a lamb dish and he said that they did not put enough meat in it. The veggie combo is $17 which is overpriced to begin. Then to add insult to injury, they only allow you to choose 4 items (I'm used to at least five at many places). The best items of the veggies that I had were the Missir Wett and Tikil Gomen. I was disappointment with the other items I had. I don't plan on returning unless I get the Missir Wett and Tikil Gomen again. Also they need to give you more injera from the onset. The service was OK here. I look forward to trying out Ghenet to see for myself what a lot of people are raving about.", "author": "Baby G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-10", "description": "Love Bati!  \n\nFood is delicious, among best Ethiopian food I've had in NYC.  Staff is super friendly, though sometimes when it's busy it is slow. Great neighborhood joint!", "author": "E J."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-12-21", "description": "It was ok, but not amazing. We got a couple of starters to share and then shared the veggie platter for a main and everything came with injera! I was a little bit sick of injera by the time we got halfway through the platter to be honest, i just wish there was a little more variation on the menu. I think the chickpeas dish we had was nice, but the beetroot one was frankly awful and I think both of us were pushing it round the injera not wanting to eat it. \n\nThe restuarant had a nice ambience, and its a convenient location for going to the BAM after, which is why we were there! Also a good wine list to make up for injera overkill.", "author": "Meera S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-08-05", "description": "My favorite Ethiopian restaurant in NYC is Awash, but since I live within walking distance of this restaurant, decided to take my mom there. The dry injera+flax appetizer is pretty decent, but the vegetarian entrees are a huge disappointment. We ordered the vegetarian platter which came with four items. They were all undercooked (split peas), cold (potato+beet), and flavorless (chick pea mash). Only the cabbage dish was mildly edible. Surprisingly, despite the lack of spices or flavor, my mom and I both had a mild stomachache for an hour after eating (even though we eat lots of spicier Indian food regularly). \n\nThe service here is definitely lacking as well. With one server/employee for the entire place, it takes way too long to get anything.", "author": "Mohan C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-10-27", "description": "This was my first experience with Ethiopian food, and I LOVED it. The presentation was fun...4 different types of veggies served on a platter covered with injera, a yummy, crepe-like bread. Tear the bread, scoop up the veggies and chow down!  We were there for a late dinner, and the 4 choices were plenty to share.\n\nThe service was good, nice wine and we had a darling server who made suggestions for us that turned out to be perfect. And, I thought it was a great value, cheaper than eating at home!", "author": "Janet F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-09-07", "description": "i've had ethiopian food a total of two times in the past 28 years or so.  i can't say i'm a huge fan of the cuisine in general -- i just don't like having messy hands.  but putting my mild OCD aside for a minute,i can tell you that the food is pretty tasty.  my friend and i got 2 veggie combos, which is 4 veggie options each.  the price was in the high teens, if i recall correctly.  \n\ni thought all the food was very tasty, and the portions were plentiful.  we didn't finish everything on the platter.  the beets were just OK for me.  they seemed over-pickled, if that's even possible.  my favorite was some lentil stuff and the collared greens.    \n\ni did think the service was a tad slow, but that might have been because the place was packed. \n\ni just don't think i'll be back because honestly, i hate the sticky fingers.  i'm getting weirded out right now even thinking about it. if you're not a psycho though, you'll probably dig this place.", "author": "Rachel H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2009-05-24", "description": "Let me preface this review by saying that Ethiopian food is my FAVORITE cuisine. I love it. I look for Ethiopian restaurants everywhere I go. My Fiance and were in Brooklyn and I thought I'd take a chance on Bati, as it was close to our hotel. I'd never actually had BAD ethiopian, so I really wasn't worried. \n\nBati is in a super cute neighborhood (Fort Greene) and while small, it is quaint inside and seems clean. It has a modern feel to it. The two waiters were really nice and helpful -- which is why I have this two stars instead of one. The service was great. It is still BYOB and there is a package store a few steps away. So that's always nice. \n\nThe food was not good. The Injera was cold and lacked texture -- it was kind of dense and rubbery and dry -- thus the food liquids didn't even permeate it and soak up all nice and delicious, as is the custom with Ethiopian food. \n\nI ordered the meat combo and everything was oversalted. I mean, to the point where everything almost tasted the same and you had to stop eating and drink water to swallow. The spices were off somehow --- there was a really strong flavor that I'd never tasted like that in Ethiopian cuisine before. All in all, really disppointing. I usually leave an ethiopian meal busting at the seams -- I didn't even finish my meal. \n\nIt is a new establishment, but still... The food should be good. And not so salty.", "author": "Sarah D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-02-09", "description": "You can eat with your hands!\n\nWhen I first asked a friend about eating at an Ethiopian restaurant, it became very clear that we didn't know the first thing about what to expect. As far as international cuisine, I'm certainly not the expert. If it's not American or Middle Eastern, I assume everything else on the planet is a noodle-based concoction.\n\nWhat? Not everything is Japanese or Chinese? \n\nWhich made me glad that I tried Bati last weekend. It's got a very small interior, and with no bar (it's BYOB but no corking fee to speak of), it makes it weird when people are just sort of milling about waiting for a table. And that's in a \"soft opening\" mode*, as the menu dutifully noted, let alone what happens once it opens for good.\n\nWe ordered mostly vegetarian options and one chicken portion, all of which were brought on a large silver platter with a base of Injera (a spongy Ethiopian bread which you will use as the primary transportation device from the plate to your mouth). I asked if it was equivalent to the Indian naan, and was not told I was incorrect**.\n\nThe food, which is laid out in small piles on the large platter where you dip your bread and eat, was good, if a bit bland (the cabbage and collard greens were notably good). The Injera was a bit cold, but they did give us more when we asked for it, so that was nice.\n\nI'd certainly suggest giving it a try, even if it's not your favorite, just to expand your palate and see something new. It's a nice addition to an apparently booming little area.\n\n* - I have never understood the idea of a soft opening -- you're either open or not, right?\n\n** - This was a new feeling, and one I certainly enjoyed. I don't need to be right, just not wrong.", "author": "Danny P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-22", "description": "Loved Bati! \n\nI'm pretty confused why people take away points for eating with your hands... This is all a part of the culture. If you're that afraid of the germs on your own hands, maybe you should consider... Washing your hands. Not that big of a deal.\n\nThe food here is great, and the staff is polite. My boyfriend and I had four types of meat and four vegetarian options on one platter to share. Delicious!", "author": "Vanessa A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-11", "description": "Bati is just the most wonderful place. Less greasy than other Ethiopian in Brooklyn, and the spices seem to stand out more than the salt. While I always want to order a red wine with all the red meat stews, you can get away with a complex 2 course meal for two for under $30 if you split an appetizer and one combo platter, which is really more than enough for two. One of the better ambiances for the price. I suggest the mustard lentil appetizer and the meat combo platter.", "author": "Lizzie W."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-10-05", "description": "$21.00 (w/tip) for a nothing special small portion vegetarian platter. Served on a tacky plastic-wtf-plate. On a plastic  \"wooden\" table. Only thing I liked was the location and my window seat.", "author": "Von F."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2009-07-05", "description": "Been a while since I've had Ethopian so I can't really compare it to anything really.  Have to say the service was slow but they were extremely nice.  Love that we can bring our own alchohol and that it's located next to a store to buy great beer.\n\nThe Fasolia was excellent and tehe bread was sponge and light.  Can't recall the name of this one dish but it's basically beef tartare, you get the option to have it prepared raw or cooked.  I advise having it cooked!", "author": "Byron W."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-10-28", "description": "Definitely had better Ethiopian food than what I had here. It was overpriced, too! Do yourself a favor and take a stroll over to Ghenet instead.", "author": "Tamara C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-27", "description": "After Meskerem, Bati might dissapoint you a little in food and service but it does score points on the ambience.\nThe food here was pretty good but did not beat the best ethiopian food I ve had in Chicago and other places in new york.\nThe service was awefully slow - But that just might be one time thing as I noticed that one of the waiteresses came in late on the day i was there.\nThe price is reasonable.", "author": "Preeti S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-09", "description": "Love Bati. The veggie combo is solid and always satisfies. This is one of my favorite restaurants in the 'hood.", "author": "Stephanie P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-17", "description": "They've brought back the friendly waitress whom we adore and the service has improved much since. Although, String Beans is still constantly missing from their menu - we're lobbying to bring it back!", "author": "Peng C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-04-09", "description": "I love Ethiopian food but this place is by far, the worst Ethiopian restaurant I have been to. I tried this place twice, both times I was disappointed. The service was very slow. The place is loud (Friday and Saturday evening). Portions of the food are not worth the money. Once you receive your food you will not be able to call over a waiter until you are ready to pay the bill. Two thumbs down to this establishment. I will not be spending my $ at this spot ever again:/", "author": "Skandalouz S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-06-15", "description": "Simply put, the food was pretty bad.  Not spiced correctly and verging from the so-so to awful.  Also, the restaurant is extremely loud so it's kind of like eating in a pretty loud bar.  Do not recommend.", "author": "Chris H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-07-14", "description": "I went to Bati about a month ago, the food and wine were good. I liked the simple deco and I loved the art on the walls. I wanted and still want to find out who the artist is, however the waiter didn't know. So much for a little showcasing. Anyway back to the place itself, the food was tasty and I didn't have any issues with the service like a few of the reviewers mentioned so I would go back.", "author": "Daniella N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-08", "description": "My friend says that I am more snake than human.  In some ways he is right: I experience the world through my tongue.  That is not meant to be a lewd or perverse statement.  My taste buds are the primary vehicle through which I engage the rest of my senses.  Knowing this, he took me to Bati on Friday night and ordered a range of diverse dishes that were served on a large fermented crepe. I was immediately struck by the strong aesthetic value of the presentation, which I believe to be crucial.  Everything was very colorful and well distributed, and the aromas were exotic and appetizing.  I have since learned that crepe is made of teff, a grain extremely rich in iron.  It has a mildly sour taste and a texture which I found very pleasant.  And I also liked the fact that it is a very basic food that does not include other ingredients or filler.  Imagine that: A healthy bread to accompany your meal!  Laissez les bons temps rouler. \n\nI didn't ask what the names of the dishes were, mainly because I am awful with foreign languages and would not have remembered unless I had written them down, which would have been impractical given that I had food on my hands.  Needless to say, there were a number of spices that I had never heard of or tasted, all of which were very vibrant and fragrant.  The highlights of the meal were a chick pea paste, a chicken stew with a boiled egg and tons of chili pepper, raw beef - phenomenal - and the lamb with turmeric.  My taste buds were lit up like so many light bulbs. \n\nThe place is full of positive vibrations.  The waitress had a very gentle way about her and smiled always.  For real - always.  I would look at her from time to time standing behind the bar and she was never not smiling.  Small detail, but you see what I mean about positive vibrations.  It makes the experience so much better when the people serving you are happy to be there.  I believe this to be of primordial importance. \n\nNow, why have I not given Bati five stars?  Let me count the petty ways.  And let me preface said counting by recognizing that these two issues are related to eating with my hands, which is a skill that I hope to become more adept at.  (1) In the bathroom, the paper towels are stacked lazily on top of some surface, so that when you go to grab them, much of the stack comes tumbling down.  If you're environmentally minded like me, this pains you, and you spend several second standing there while you mourn the young sapling that gave its life for the lack of a paper towel dispenser.  Easy fix.  (2) Again, being new to eating food sans implements, I think it would have been a nice gesture to have received a wet nap afterwards.  I'm sure they don't do this in Ethiopia, but I am a gringa, and can't help but feel slightly uncomfortable with soiled hands.  Again, small issue, but I felt I should explain why I didn't give Bati the highest rating. \n\nIn sum: Go to this place.  The food is delicious, the service is eminently friendly, the vibe is strong.", "author": "Adriane B."}], "servesCuisine": "Ethiopian", "priceRange": "$11-30", "name": "Bati", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "747 Fulton St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/H_V2pdmsd0PQ6pTnN_K-Bg/ls.jpg", "@type": "Restaurant", "telephone": "+17187979696"}