{"aggregateRating": {"reviewCount": 210, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-06-02", "description": "Look, it's frustrating that I have to do this, I love supporting Habesha's and their grind to share the uniqueness of our culture and cuisine, but the service left a bitter taste that I just cannot shake off. As a fellow Habesha visiting NYC, I was excited to see a cute, intimate Ethiopian restaurant in the heart of BK, but I was immediately met with sass from an older gentleman working there and..... our server. Unfortunately,  I've heard about this kind of treatment, where Habesha guest get treated lesser than the White/non-Habesha's dining at their restaurants but this was the first time I witnessed/experienced this kind of treatment. I am not asking for special treatment, just equal treatment. We left soon after being seated since the vibe wasn't right. Disclaimer, this review is based solely on the service, we did not stick around to even order....", "author": "MT T."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-04-30", "description": "Came here once and had a great experience inside but terrible experience once I left. Really friendly staff and good enough Ethiopian food, but it completely ruined my stomach for about a week.", "author": "Malik D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-08-28", "description": "Unfortunately we ate here last night and it was expensive and not very good. The food came out shockingly fast. The Doro Wat was so bad it was almost inedible ! The chicken was so dry it tasted like jerky and the oil in the sauce was separated. All the sides were lukewarm and barely any flavor. We were extremely disappointed because we had such a great experience last time. When I order a chicken dish for $20 I expect it to be cooked better then a fast food burger under a heat lamp. I'm sad to say I don't know that I'll be giving this place another chance because it's not cheap and not worth the risk.", "author": "Kami S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-04-16", "description": "Inconsiderate of customers. \nServed nasty, warm tap water that taste like it came from the toilet. When we asked for ice, lemon or desperately for a bottle of Spring water we were barked at and put down for not accepting there was no other option. Water is important.  Clean tasting water is important .  At least the option to buy water should ALWAYS be an option for customers in any decent business. \nThis took away from the enjoyment of our meal. We were thirsty. And the delicious spices sometimes need a sip of water after it.\n\nThe worst was the manner in which the manager handled our request and expression of disappointment.  \nThat alone will stop me from EVER returning or referring this restaurant . \nI was told Ghenet Ethiopian restaurant was better anyhow.  I should've listened.", "author": "Birth Doula Nubia J."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-03-13", "description": "The food here was super oily and portions were super small for the price. Not the best Ethiopian food I've had. Sadly disappointed", "author": "Sherona G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-02-05", "description": "Worst Ethiopian food I've had. The doro wat combo I had cost $25 bucks was swimming in some sort of red oil. The side dishes (cabbage and lentil) also swimming in the same kind of oil. All three dishes tasted the same. Quite odd. Nothing tasted like it normally does when eating at a quality Ethiopian spot, these dishes are usually delicious. I was so disappointed. I will never return.", "author": "Marissa P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-09", "description": "Although delicious, the portions are tiny, even for this part of Brooklyn, and rather expensive for what you get. With that said, the injera wasn't too tangy and the stews were very nicely spiced and the meat very tender.", "author": "A C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-13", "description": "This was my first time having Ethiopian food and it did not disappoint! I arrived early around 5:30 for dinner and the place was empty but it does get crowded after 6. We had the Kategna, meat and vegetarian combo. I didn't care for the Kategna much, it was basically overseasoned, spicy bread. I enjoyed the meat platter, all of which were delicious. I can't comment much on the vegetarian platter because it had jalapeños which I'm slightly allergic to but my friend seemed to enjoy it. The waiter was really helpful throughout the dinner. He gave us recommendations and showed us how to eat the food, haha.", "author": "Jessica A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-19", "description": "I really enjoyed my experience at Bati. The room was lovely and the service was on the mark. I tried the combination platters and they were both wonderful. The meats were succulent and plentiful and the vegetarian platter made me think I could just eat veggies for the rest of my life. The spices were tantalizing. I left happy and full. As it is a Fort Greene restaurant and I live but a few blocks away, I plan to return often.", "author": "Shannon G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-10", "description": "Bati did not disappoint! After going to another restaurant that only served brunch at the time, we came right to Bati. The food was delicious. Salem was very patient and  helpful in explaining the dishes and combinations to be eaten in. She was very attentive and very pleasant. I've been to Bati a few years back and wanted to try something new, now I know better. Always go to Bati.", "author": "Beka W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-22", "description": "Sometimes when my tummy grumbles, I close my eyes and daydream I am back at Bati. I've been to quite a few Ethiopian spots around NYC and this is by far the best. The waitstaff are always so warm and welcoming. The food is truly next level. Just get everything.", "author": "Jay L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-30", "description": "My favorite Ethiopian restaurant in NYC\nI've only had the vegetarian options but brought many a happy meat eating guest \nLove that they do seamless so I don't even have to leave my house", "author": "Sarah M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-05-27", "description": "Small restaurant, nice ambiance and decor. Customer service was good, waitress was quick to bring our drinks and food. The food was just OK. I definitely have had better Ethiopian food elsewhere. The collard greens were tough and probably a little old. The portion size was crazy.....my doro wat came with exactly one chicken leg and a boiled egg. Just one chicken leg......$19! It was tasty, but can I get at least ONE more piece of chicken for $19? The veggie and lamb dishes were OK. I wouldn't return to this restaurant or recommend it. There are many better options for Ethiopian in NYC.", "author": "Kristi F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-28", "description": "Great food but the service is extremely slow. I would not suggest going here if you're going to a show because you'll be late. Having said that, the food is amazing and if you're not in a rush this is a great place. There must be a shortage of napkins because for a place that doesn't give you forks and knives (you're supposed to eat with your hands which makes it even cooler) they only gave us one napkin. \n\nI had the vegetarian platter and my friend had the meat platter and we both loved the food. I will totally go back again. The food is also a lot of fun to eat.", "author": "Chris B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-21", "description": "I don't favor their Injera and my vegetarian combo was entirely too oily. I don't think I'll order from here again. Definitely not worth the price. Even if they were to cut the price in half, I probably wouldn't order from here again. If this were my first Ethiopian food experience, I'd probably never get it again. Overall, I had speedy delivery.", "author": "Taniyah G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-11-11", "description": "Biggest rip-off in New York. I can't believe what we got for what we paid. My wife and I are not opposed to dropping some coin on a good dinner, but this place just made us angry. We had the vegan platter and two entrees. Our chicken entree was $18 and came with one--ONE!--chicken thigh. Our lamb entree was even more egregious: $20 for a stew so thin that I think they used little more than lamb stock. Even the vegan platter was absurdly priced for a series of dishes that are all cooked in large, communal pots. To top it all off, they added automatic gratuity to our bill even though our group wasn't large: four adults and one child. On the bill, they had written that it was a 20% gratuity, but it was actually 22% on the AFTER-TAX total, making it closer to 25% on the before-tax amount. I honestly left feeling cheated. \"But what about the food?\" you ask. To which I answer, \"Meh.\"", "author": "Todd C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-10-08", "description": "There is nothing exceptional about this place, they charge you alot because of the location of the restaurant and not the food. The Lamb is a rip off. They give you only little chunks of lamb with alot of stew in in, and charge you 20$ for that. The atmosphere is food,  but their prices is ridiculous for food that is not even prepared fresh as you order, but already made and kept heated. I have been to an Ethiopian restaurant in Nevada and to another in San Francisco  before and Bati should be ashamed of itself, they are rip off, due to a lack of Ethiopian restaurants in New York. Don't go there you will be charged alot of money for food that does not even fill you up.", "author": "Charmaine A."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-05-30", "description": "Bati is subpar Ethiopian cuisine conveniently located in Broolyn's fashionable Fort Greene neighborhood. As Sbarro is to NY pizza, Bati is to Ethiopian. My date and I ordered the vegetable combo and the meat combo (they don't do any combinations of both, just meat or veggie) and we were underwhelmed by the lukewarm, bland food and the sour, somewhat fermented injera (which they had the nerve to be stingy with in the first place). For $19 you'd expect dishes like the minchet abish wett and ye siga wett to be more substantial. Instead, you get some small pieces of meat and a lot of barely warm sauce. (Some of the veggie dishes like  The one redeeming quality the place has is that the service was OK. If you're looking for Ethiopian in Brooklyn I'd recommend Ghenet or Awash over this spot any day.", "author": "Timmhotep A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-15", "description": "Reliably wonderful. My favorite restaurant in the neighborhood. Vegetarian platter is consistently excellent, and the honey wine is a nice treat. Cozy place, great vibe. I always walk away so happy.", "author": "K R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-10", "description": "One of the best Ethiopian restaurants in the NYC area. The flavor, taste and quality is exceptional.", "author": "Jason P."}], "servesCuisine": "Ethiopian", "priceRange": "$11-30", "name": "Bati", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "747 Fulton St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/H_V2pdmsd0PQ6pTnN_K-Bg/ls.jpg", "@type": "Restaurant", "telephone": "+17187979696"}