{"aggregateRating": {"reviewCount": 210, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-08-23", "description": "I'm a big fan of Ethiopian, but was disappointed in Bati. The dishes were pretty good, but not really stewed enough. My wife said it was like they were trying to do nouveau-ethiopian, which is fine... I guess. But they don't pull it off. The ingera was horrible. Like others say, it's rubbery and not suited to soaking up the flavor of the dishes. Service was fine, and it's a really nice place, but they need to figure out what they're doing wrong and fix it.", "author": "Rick M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-20", "description": "Coming from DC, an area full of Ethiopian food, I was delighted to have it again after a 5 year absence. The food was very good and generous. A perfect amount unless you're a large fellow. My wife and I walked away stuffed from the vegetarian sampler and the traditional Ethiopian chicken. The bread was the best I've ever had. Most of the time in DC, I found it much too thick and soggy. At Bati, it was just right. The service wasn't bad. It wasn't exactly welcoming either. It just 'was'. They took our order quickly, served us on time, etc., but didn't feel the server was quite too happy that day. Oh well, it won't keep me from going back. The honey wine was nice.", "author": "Chadwick S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-08", "description": "I am also surprised at the number of negative reviews of the place.\n\nI've been here a couple times and really enjoyed it both times. Got a bottle of honeywine, vegetarian combo, doro wat, lamb tibs... and they were all sooo good. There were three of us the second time and we ordered plenty of food.. I was stuffed beyond belief, split a bottle of wine and it came out to somewhere around $37 a person. We ordered four dishes. It's not super cheap but not overly expensive.\n\nI thought the flavors were delicious, ingredients were fresh.. the only thing was that the service is a tad slow. But nothing terrible and certainly tolerable.\n \nIn short, cozy atmosphere and great food. Will certainly be coming back.\n\n..and the $6 baklava was quite tasty.", "author": "Melissa L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-03", "description": "Bati serves the best Ethiopian food in New York.", "author": "J S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-07-25", "description": "this was honestly the worst Ethiopian food I've ever had. I even went back a second time to give them a second chance. the food is TASTELESS - it's like they don't even use spices, and it's DRY. I've eaten at many Ethiopian restaurants, and the food should soak into the Injera, making it moist and full of the flavors. Also, the service was TERRIBLE. the first time I went, I was with 2 other people and the MANAGER took one of the two tables (there were two tables placed together to make a 4-top) from us while we were eating and gave it to another party, leaving us without enough space for our plates at our table!!! i couldn't even believe it! she said she would buy us drinks on the house to make it up to us then never even came back to take the order! both times, my water was never refilled and I couldn't even flag down the waiter in the small space. it's overpriced and only seems to get customers because it's in a gentrified area where the hipsters don't know any better.", "author": "Ms R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2009-02-15", "description": "There's a separate listing for Bati at a different address, with negative reviews.  I have to concur with them.  Quite bland food across the board, particularly the injera, which is missing its sour flavor.  Only one or two things out of seven were particularly interesting on our vegetarian platter.  Sad to say, this is not the good restaurant I was hoping would open in this spot.", "author": "Mike E."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2009-03-09", "description": "One of my favorite parts of Ethiopian food is the injera and the injera sucked at this place.  It was doughy, not sour, not fluffy and just odd.  The table next to us found it more useful to throw at each other than to eat (I don't blame them).  Maybe they were having an off night?\n\nThe food was ok.  We ordered the vegetarian combo plate and they served us the meat combo plate.  The waiter and the cook apologized over and over again for the mistake.\n\nIt was ~14 for the veggie platter and ~15 for the chicken plate.\n\nI think next time I may save my money for Queen of Sheba", "author": "spazzy p."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2009-01-19", "description": "The decor and design is good...service is good.  Food was uninspired and all round mediocre.  Tomato salad with chopped up injera in it served on top of injera is just redundant.  Meat combo platter (chicken, steak, lamb) nothing special...base flavor was okay, but meat was a little tough and the spices were doing nothing to bring out the flavor.  Portions were large.  Nice edition to the neighborhood but definitely needs work.  BYOB for now. Cash only.", "author": "Scott W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-12", "description": "The boyfriend took me to Bati for our Valentine's Day dinner (which, yes, means that this review is two months overdue), and it was the first time I had ever eaten Ethiopian food.  Our waiter was helpful (and exceptionally patient considering it was Valentine's Day and the restaurant was packed) in describing the menu items and suggesting which ones items we might like best in our vegetable combination.  We ordered both a meat combination and a vegetable combination, which meant that we had a total of seven different dishes on our injera, and each one was delicious.", "author": "Kathleen B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2009-07-04", "description": "I love Ethiopian food: it's one of the first cuisines I seek out in any city I spend any lengthy period of time in. I frequently visited all the Ethiopian places on the upper west side when I lived there (all very good), as well as all the places in little Ethiopia in los angeles.  Like some of the other yelpers, I'd never met an Ethiopian restaurant I didn't like, until Bati.\n\nThis had to be one of the worst dining experiences I've ever had.  The injera wasn't fully cooked, and there wasn't nearly enough of it.  That's like going to an italian restaurant and finding that they've burnt your bread--I mean, it's the most basic part of the cuisine--how can you mess that up?  But, since injera acts as your utensils (definitely the best part of Ethiopian eating, we breezed through our first portion quickly, and asked for more.  The second batch of injera was even worse: there white splotches all over the dark injera, and this batch was even less cooked than the last one.  On top of that, the water they served was very funky (our whole table noticed this).  The wait staff was pre-occupied with a photo shoot that was going on in the other half of a dining area (on a friday night!), so the service was pretty awful.\n\nFar and away, one of the worst dining experiences I've ever had, and I'm pretty hard to disappoint.  Ethiopian food is fantastic, but this isn't the place to try it.  To be fair, this may have been an off-night for them, but the combination of the improperly cooked injera, funky water, bad service, and bland food makes this the only dining experience I've hated enough to feel compelled to yelp about.", "author": "Eric W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2009-12-12", "description": "Worst Service Ever.\n\nSeated at a table, and then told that we had to get up so that they could seat some new arrivals to another already seated group. They offered nothing but a weak apology for kicking us out of the table they'd just seated us at, and telling us we would now be waiting half an hour for a table.", "author": "A F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-11-04", "description": "We've never come here for dinner, though we come for lunch probably once or twice every couple of weeks. It's solid Ethiopian food in a beautiful, warm, trendy environment, in a perfect and convenient location on Fulton. It's always pretty empty at lunch, and in warm weather we sit at table next to the open window and enjoy our Ethiopian beer in peace. I'm sure the space lends itself to being very intimate, romantic, and candel-lit at night. We love having this place in our neighborhood!", "author": "Viola F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-01", "description": "Frankly, it's worth going to Bati for the kind, attentive service.  The food is solid and tasty (It ranks solidly in the middle among my collective memories of Ethiopian restaurant cuisine).  The meal was inexpensive, and while the restaurant is really pretty small, it didn't feel very crowded, nor was it overwhelmingly loud on a Saturday night when every seat in the place was full.  My one request will be that for a platter with shared veg and meat dishes, the presentation be a bit more careful so finicky vegetarians like me don't have their food touching the meat dishes.  We ended up making little partitions with some Injira which worked well enough!", "author": "Michelle C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-11", "description": "I had lunch with a few friends at Bati this weekend, and I was not disappointed. The service was great, and the food was amazing.  I really loved the tibs and cabbage.  The portions were just right.  If you're looking for an authentc Ethiopian dining experience this is the place to go.", "author": "Jerika R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-11-17", "description": "This time, the injera was warm.  The food was BLAND, esp the collard greens.  Service was so-so.\n\nMy advice  -  stick to 4th Avenue Ghenet!", "author": "K M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-04-22", "description": "They have the best Ethiopian food I have ever had (and I have eaten a lot of it!).  The restaurant is a little small, and on Friday and Saturday nights, it can be hard to get a table (plus they don't take reservations).  But, if you go any other day/time, the experience is generally pleasant.  The wait staff is friendly, and they bring out a lot of water (which is good, because the food is spicy).  I recommend the vegetarian combination platter.", "author": "A N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-02", "description": "This place is very homey and sweet. The owner is lovely and hospitable. I like that the food is not as greasy as Ethiopian sometimes is, but it's still delicious. They seem to have rotating chefs so the food is not totally consistent, but it's always good, and sometimes great.", "author": "Dominique T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-02-22", "description": "First off, Bati is no longer a BYOB establishment--and they won't consider opening your bottle (so don't bring it).  That was a tough start for me.  I decided on the Robertsons Pinotage from South Africa -- an overly sweet wine that reminded me of a tasteful version of Manischevitz.  Then again, I've never had a good wine at an Ethiopian restaurant...and I've never gone to an Ethiopian restaurant for the wine.\n\nThankfully the food was good.  I love the interesting spices and penchant for spicy-hot that the food delivers.  We had a vegetarian plate and the mincemeat beef dish.  As light eaters, those two alone were enough to satisfy our hunger.  The collard Greens, beets and spicy lentils were my favorites.  My wife also liked the tofu something-or-other that tasted like cheese and spices.  While the meat was tasty, I'm pretty sure it gave both my wife and I a stomach ache.  Nothing too harming, but it was there.  If I go again, I'll try the chicken stew with the veggie plate--vegetarian is the best way to enjoy Ethiopian for me.\n\nThe service ladies were really nice, and didn't overtly mess up.  I love how they don't automatically add ice to your water.", "author": "Noah M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-10-11", "description": "I was really glad to finally eat here with my lady.  Totally attractive restaurant, well designed, nice and friendly waitstaff.  The injera was lighter than others I've had before.  The split pea stew and the stewed free range chicken was so, so good.  Couple of the other veggie dishes were pretty good, but kind of started to blend together.  A string bean dish was oily and might have been frozen.  Ideally, I wish there was a meat and veg combo dish we could have ordered.  And I didn't check if it was still BYOB since they now have a beer and wine license, but beers were steep, $7 per bottle.  Overall, very nice addition to the neighborhood and plan on going back when we get another jonesing for Ethopian.", "author": "Evan G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-06", "description": "Bati is a great addition to the neighborhood. The food is far superior to the new Ghenet Brooklyn that recently opened in Park Slope. My favorite Ethiopian restaurants remain in Manhattan (Queen of Sheba \u0026 Zoma), but for Brooklyn, Bati is by far my favorite!\n\nBy the way, it's BYOB, so stop by Green Grape or Provisions on your way in and pick up some wine/beer.", "author": "sarah s."}], "servesCuisine": "Ethiopian", "priceRange": "$11-30", "name": "Bati", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "747 Fulton St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/H_V2pdmsd0PQ6pTnN_K-Bg/ls.jpg", "@type": "Restaurant", "telephone": "+17187979696"}