{"aggregateRating": {"reviewCount": 210, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-13", "description": "My first experience with Ethiopian food was amazing thanks to the great food and service provided by Bati. I tried a combination of the meat and veggie platter and every selection had great flavor and consistency. I definitely recommend this place if you are in the mood for Ethiopian food.", "author": "Frantz J."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-01-29", "description": "The food tastes like it wasn't cooked long enough. The spices were not cooked well in the food and seemed raw/overpowering. Not at all worth the money. They injera is really good though!", "author": "Louise N."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-02-26", "description": "I was in the mood for Ethiopian food one evening prior to a show at the nearby BAM theaters, so my friend and I decided to come here. I got their vegetarian combo (missir wett, gomen, buticha, and key sir for me) and while the food was okay, it was just okay for me. I thought the injera was a little on the dry/brittle side. Perhaps it was an off night when I had gone. \n\nI guess if you happen to be in the area and happen to have a craving for Ethiopian food, and you wanted to be closer to Atlantic Terminal for whatever reason, AND you didn't want to make the trek down to Ghenet, then this'll probably do the trick.", "author": "Cinthia K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-03-28", "description": "I definitely would not suggest this place to eat. The food was sub-par at best and the service was very mediocre. I have eaten Ethiopian food all over the country from L.A. to NY, and this definitely was NOT up to my standards. It was so bad we actually ended up leaving and taking the subway into Harlem to eat at another restaurant. This was my second time here and I would have to say it definitely was a disappointment.", "author": "Rain T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-28", "description": "This place is great, my Ethiopian friend recommended it to me and helped me order some items. Loved everything and the staff was very attentive and pleasant. I like the chill atmosphere and got to meet the chef who cooks from the heart. \n\nCame back here for a second time and loved it even more!", "author": "Paul B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-27", "description": "I have never eaten Ethiopian cuisine so I was excited to try this restaurant located just feet away from my workplace in Fort Greene. \n\nThankfully, I was prepped beforehand that it's customary to eat with your hands so no utensils. Additionally, the culture also promotes communal eating by sharing the same \"plate\" or large round flatbread. Very different from my own Caribbean background.\n\nI opted to try the Ethiopian national dish made with chicken slow-cooked in a spicy onion based stew served with a hard-boiled egg which was served on a large piece of injera ((flat bread made from teff flour loaded with protein, calcium, iron, and fiber) along with potatoes and vegetable on opposite sides. ($18) I thought it was light, healthy, and full of flavor. I definitely wanted more injera to finish my meal. For dessert, we enjoyed delicious baklava ($6), which I have not had in years. \n\nNow I don't drink, but sampled the honey wine. It was too tart for my liking and the server was generous enough not to charge us for the full cost of the drink since I did not have a full glass. Great customer service!\n\nI regrettably made the decision to sit by the windows where my guest literally hovered over the small candlelight placed on the table to stay warm. I hoped for authentic music to complement the cultural food and artwork, but heard Spanish music? I was a bit confused, but overall it was a great introductory experience at an affordable price.", "author": "Kristia B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-08-11", "description": "I was waiting for the day to try Ethiopian food! We ordered two meals.... one combo meat and one combo veg. He served it on ONE round bread.  I don't know if he still served the same portions so...... anyway\nIt's very hot in there! Thank God there was a breeze coming from outside since they opened the door. The food was good though. A lot of puree and very soft but the bread to dip was not all that great for my tastebuds. I felt it was like raw dough. Like it needed to be thrown in the oven. It actually upset my stomach later. I'll definitely try a different Eithopian restaurant just to see the difference.", "author": "Mia M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-09", "description": "I had not had Ethiopian before.  I am a vegetarian so this place was perfect for me.  I hear not such great things about the meat but I don't care! I love that its really mostly vegan and clean.  The waiters were a bit overwhelmed but did their job OK and eventually shooed us out for other customers...not the nicest but hey...we were hangin too long!  I was very full even though the portions look small.  Nope perfect size and the taste was great.  Will come back.", "author": "Cassandra M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-01-05", "description": "Nice romantic ambience, but the food was nothing sensational. Standard Ethiopian in a cute little dimly lit dining room. Smaller portions than I've had elsewhere. The server was a sweet guy but he could have had better knowledge of the food as he was unable to answer some of our questions about ingredients. Overall the Bati experience was just okay.", "author": "Amanda G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-10-28", "description": "This place has the worst Ethiopian food I have ever had in my life. I bought take out and the beef tibs I got were over cooked and the portions were extremely small. The vegetables also tasted as if they had been defrosted. Brooklyn doesn't have a substantive Ethiopian population, so I am guessing they can get away with selling horrible food because of this. I lived in a city on the West coast that had a large Ethiopian population and the food was half the price, large family size portions, and delicious! This establishment is an abomination to Ethiopian culture.  The food is overpriced and terrible. Never again will I support this establishment.", "author": "Angelica J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-19", "description": "I'm from DC, and it's really hard to find Ethiopian anywhere else that compares (or even comes close). \n\nI ordered from Seamless. Was unsure how they would deliver it - but they wrapped the injera in plastic and put the veggies in a plastic takeout container - very smart, so the injera didn't get soggy or anything. \n\nGot the veggie sampler (my usual Ethiopian go-to) with beets, cabbage and carrots, collards, and berbere lentils. Lentils and cabbage are my all-time favorite Ethiopian dishes, and they were fantastic! Beets were ok, collards were pretty much standard. It was definitely enough food for two, as an Ethiopian veggie platter should be! \n\nOnly complaint was the injera. It was a little bland - sour, but not as flavorful as other I've had. I think it was probably made partially with flour, not all with teff. Too bad, but it served its purpose. Not as tasty as I'd hoped, and I love injera. \n\nOverall, I'd love to stop by the restaurant and try this place again! I'd love to try their doro watt, along with the veg.", "author": "Eliza H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-01-14", "description": "I love Ethiopian food and I was so excited when I first tried this place. I got a vegetarian dish and it was good, However, on my second trip their I ordered a meat dish and my friend and I both went home with the food poisoning. I haven't been back since, but i have heard multiple accounts of people getting sick from the food their since. So DO NOT ORDER MEAT here!!!", "author": "Mary l."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-13", "description": "I thought this restaurant served decent tasting Ethiopian food. I ordered a veggie combo for one and it was definitely more than enough for two. However, my friends shared a couple meat dishes and were disappointed by the amount of food. I definitely got more food on my individual plate than they received on their large shared plate. The place is small and cozy. I will say that it got unbearably hot while we were there, so avoid going on a hot afternoon day.  If I lived in BK, this would have been my go-to takeout spot for Ethio food.", "author": "Tiya B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-12-01", "description": "Came here for dinner with 3 friends we ordered 2 meat combos and 2 veg combos. The food was okay I was berry disappointed by the portion sizes of the combo. Not sure I would return. I prefer the Ethiopian restaurant in bushwick.", "author": "Bev G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-06-29", "description": "Too expensive...not great service...food was OK and tasted good \n\n\nBut...$17 for a side dish of mushrooms...we came in for dinner left $50 and went for more food in the Habana outpost next door \n\nI am OK paying for trendy food but I want to enjoy food not tasting menu", "author": "Gil V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-27", "description": "Lovely and authentic place. Neighborhood joint. \n\nThe positives are its one of few Ethiopian joints in Fort Greene and the food is authentic. I thought service was speedy and friendly enough. \n\nThe place isn't super comfortable though -- temperature, tables, decor are.", "author": "amol s."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-11-26", "description": "I enjoyed the Ethiopian wine Tej. Horwever I didn't like their injera. The lamb and beef was delicious.  I loved the restaurant set-up, along with the music. Servers were nice and checked on me to ensure i was getting excellent service.", "author": "Sweet G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-08", "description": "Returned to Bati with a big group and it was a great experience - comfortable at a long table and food delicious in combination platters-  great for tasting many dishes with regular good and gluten free injera. The lamb stew - ye beg alicha-  and beef tartare - kitfo - were amazing and the vegetables were all interesting and beautifully fresh -   gomens with cabbage and collard dishes and chick pea and lentil dishes. Ethiopian baklava was light, with wonderful honey and not overly sweet.  Lovely evening.", "author": "Zoe M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-10-23", "description": "One star each for the decor and music. One star for the excellent service. The food was okay. The honey wine was okay. The injera was just very sour; which seems to be the norm at Ethiopian restaurants. It was also rather expensive. But considering location I guess it's fair.   I don't know. This is just my experience. Give it a try if you like...", "author": "Osaka B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-28", "description": "Bati is very laid back, easy place to relax and have great food without feeling like you're getting rushed in and out. They have awesome Ethiopian beers, which were really cool to try. But the food is the real thing to come for. Great flavorsome injera bread, and the different dishes are all awesome (at least every one I tried was). Make sure to ask for extra injera if you need it.\n\nI live in the neighborhood, and I'll definitely be coming back regularly.", "author": "David B."}], "servesCuisine": "Ethiopian", "priceRange": "$11-30", "name": "Bati", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "747 Fulton St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/H_V2pdmsd0PQ6pTnN_K-Bg/ls.jpg", "@type": "Restaurant", "telephone": "+17187979696"}