{"aggregateRating": {"reviewCount": 55, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2019-04-26", "description": "It's after 9, I'm hungry, and I'm in the vicinity of Albee Square... DeKalb Market it is. I've passed this seafood spot a couple of times but this time I decided to try their food.\nThe cashier told me no more steamed food which was what I wanted.\nAfter trying to decide, I settled for the popcorn shrimp and tater tots.\nThe shrimp was tasty and fried perfect. The tater tots were supposed to have old Bay but I barely tasted it (not necessarily a bad thing). The tots were just, okay but ketchup helped. \nI would def give it a try again but try something even tastier since they have a good selection on their menu.", "author": "Danielle B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-04-20", "description": "Get your seatbelts and belts in general buckled and secured because I'm about to write my second review ever, meaning, it's meaningful to me. TLDR; this is a review purely for service by someone who has been to this establishment since it was birthed from the uterus of gentrification itself. \n\nI traverse across the US to New York. Live in a city that costs more than what people spend on health care. Get an advanced degree in a field that no one gives two (piles of feces) for...aging and social work. \n\nThere are few things I take the time for myself and going to Dekalb Market with my roommate and eating good food is one of them\n\nHence, this review. There have been multiple times I've gone to this market with my roommate after dragging our faces, hearts, and soul across the streets of New York in attempts to put smiles on strangers' faces. We eat and drink our sorrows away. Our staple, this establishment. \n\nFive stars go to the chefs in the back that meticulously put together delicious meals. Whoever chooses the animals that died for our meals. And the recipes that concocted the sauces we dip said dead animals in.\n\nzero...no... NEGATIVE stars to the hostess that worked at 3 PM on Saturday 4/20. Look, I get it. It's 4/20...we all would rather be high. But as someone who has come to this food stall religiously as a place of respite and brought a colleague to share the experience with... I'm not mad...I'm disappointed. \n\nI don't have money and I'm writing a review for a stall in a food market. But I well ordered over 60 dollars of food. I ordered the most expensive thing on the menu which is obviously meant to share. Something I've done regularly. The hostess/waitress was incredibly rude to my friends throughout this process. My friends had all gone to grab juices or snacks from other stalls. I acknowledge that it's not ok to bring \"outside\" food to another stand. She made a point of attempting to kick out my friends from the food stall because they had $3 drinks or snacks from other stalls. Fine, Fair. \n\nShe then proceeded to continue to be rude quite loudly about what was going on. Look, we see your point. I'm sorry you weren't taught how to communicate...but let us know and that's fine. \n\nMy friends even took the effort to go up to this hostess and acknowledge that bringing outside food is rude and we're happy to take our meal and sit at one of the open tables in the food market. In adolescent fashion, she responded saying that there was nothing wrong. I've been to this place enough times to know that her passive-aggressive serving style (placing 10 pounds of food in front of ONLY me, not providing us with tools to eat crabs, not checking in with us, not giving us wet naps) were all ways of being...I won't type it because I don't want this review being removed from Yelp.\n\nI took the time to put myself in her shoes \u0026 as someone who has worked in fast food, restaurant, and customer service positions-i knew enough to know that this wasn't about clearing limited space to ensure customers could come in to maximize profit and tip. She clearly had a friend sitting at the bar babysitting one beer and trying to throw shade at us. \n\nThis was purely a matter of lack of professionalism. I'm sorry you hate your job or you hate people. We all feel the same at times. But you're in a customer service industry. It didn't take much effort to decide not to screw her over by not tipping. In Fact, we left 20% + just to acknowledge the fact that she probably hates her job, she made three individuals' days bad, and that we hope she finds some sort of happiness at the end of the tunnel so that she stops trying to actively strip away the limited happiness others may have in their lives. \n\nTo the owner/manager: we've met you. You're great and accommodating. I strongly suggest you provide training to your employees to provide them with enough perspective to understand that customer service doesn't mean catering to \"people with money\" but to PEOPLE. Plain and simple. No one wants to sit at your counter with a new prospective customer feeling like they've made a mistake sharing your business to friends. That they're not welcomed. That their employees have their friends sitting at the counter judging customers who live a tiring life. \n\nTrain her to be an empathic human or fire her. She probably has a better career waiting for her in security if she doesn't understand customer service. She's not doing your business any good. \n\nI've worked in the food industry. We were spending $ 20 per person and it's more than what is typically spent at a food stall. We tipped 20%+. We were not taking away from profits or business. But I've never eaten faster at a place than I did today because of the rude judgemental hostess we had to encounter and the stares from her friends that were probably drinking for free on the business owners dime.  I've spent well over $500 at this place eating their food but you sure as hell can count on that ending today.", "author": "Reyes J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-01-21", "description": "Listen, your girl doesn't get much time these days to find herself at the new (do the kids still consider it new?) City Point dining hall, Dekalb Market, but with a long weekend ahead and some lunch money, I happily took myself downstairs for a post-movie meal. \n\nAfter walking through the space three times and to avoid suspicious stares, I narrowed down my choices to a Philly cheesesteak and Fulton Landing's Seafood Co's Fish and Tots. I went with my gut and headed towards the seafood.\n\nService- quick, fast, friendly but not to the point of saccharine. Easy and unpretentious. Ordering my food was a breeze. \n\nWine - from a can. A cold Carmenere was poured out for me, and I got nervous, but it was decent - not any fresher or staler than it would be from a bottle.\n\nThe food - The Fish and Tots are amazing! Two ample pieces of fish are fried to perfection with experience and love. Golden and crispy on the outside and moist and flaky on the inside. The fish is fried with just the right amount of flour coating so it's not too bready and the fish can stand out. The tots are lightly dusted with Old Bay for a seafood touch and are abundantly piled on to the plate.\n\nMerch- With fried fish that good, I'm definitely coming back and may pick up ones of their tees in pink.\n\nRating - Bottles and cans just clap your hands, just clap your hands four times.", "author": "Julie L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-11-12", "description": "Personally, I don't like to eat oysters in a basement. Something about that combination just isn't that exciting to me.\n\nThat's why the only thing I've ever gotten here is the fried shrimp and tater tots. They do it right. Hot and fresh and yes. I wish there were more shrimp and less tots, but don't we all? Next time though, I may have to try the Hot Mess I keep hearing about.*\n\nAnd yes, it ain't exactly cheap...but as they say, cheap seafood ain't fresh, and fresh seafood ain't cheap. \n\nP.S. This is also one of the few spots in Dekalb Market Hall that has its own dedicated seating, and beer/wine! I like alcohol. \n____________\n\n*This is supposedly an off-menu dish they serve, not a woman with an unsavory reputation.", "author": "Peter D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-11-28", "description": "Came here after work for a quick bite. I was in the mood for seafood and it was perfectly located before my shopping trip at Trader Joes.  I had the Happy Hour Fried Shrimp basket. It was six shrimps and tater tots for 7 bucks. It was served with what they stated was a spicy ranch. That wasn't the case. The sauce wasn't spicy at all. The shrimp was fried nicely and the tots were good. Kind of salty in my opinon. It was just ok. If you're looking for a quick bite I guess this will do.", "author": "Liz D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-05-24", "description": "The food probably deserves more than 3 stars but you can't charge me 20 bucks for 2 shrimp, 2 scallops and a 1/2 piece of fish and expect me to walk away happy.  Went there for the tots that friends and coworkers have raved about - they were good enough (and the portion was certainly bigger than the rest of the meal) but I guess they ran out of old bay...The scallop (my daughter snatched 1) was cooked to perfection (which almost never happens when you fry them) so I'm a bit disappointed that I'm not going back...", "author": "Renee S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-04-08", "description": "Really generous wine pours here for less than 10$.\n\nCame here for a quick snack of east coast oysters. My order was forgotten and for 45 minutes, I sat there, nursing my drink and just waited.\n\nThe first ten minutes of sitting down, the waitress knocked over my wine, which was nearly a full glass. She did give me another glass and literally poured it to the rim.\n\nAfter 45 minutes, the waitress asked me if I was waiting on something. I told her that I ordered east coast oysters 45 minutes ago. She offered me 6 west coast oysters... which were the worst oysters I have ever tasted. Tiny, and very fishy. I ate 3, thinking they would get better, and couldn't finish the rest. The waitress cracked open four east coast for me. Much better.", "author": "Maggie C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-04", "description": "This City Point location is fantastic!\n\nFresh, quick and delicious. \n\nI come to this area quit often and I think Dekalb Market Hall has only the best of the best bossiness. Fulton Landing Seafood Co. is no exception. \n\nCame here with a friend and we saw some seats open at the bar, so we figured we should try it out. \n\nI LOVE fried shrimp and when you get the basket it comes with a mountain of tater tots. These were probably the best fried shrimp I've ever had. Super fresh and big! We also got some beer and it was just a really good time.\n\nI have to come back and try other seafood dishes! This place is bomb!", "author": "Ellie T."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-04-26", "description": "Ah Fulton landing. So much wasted potential. So I came here with a craving for some seafood. I ordered the shrimp basket. Now I admit, the shrimp were slamming. Big and juicy, perfectly fried. This review is mainly for the service. You get the usual so so NYC customer interaction- you walk up and somebody stares at you until you tell them what you want. No, what's your order? Etc. I get that. Well I got to sit down on a stool after I place my order and the girl who rung me up says \"no you can't sit there\". I'm like seriously? I was in absolute disbelief. I'm a paying customer and I can't sit and wait? The stools were EMPTY. I hope this is good because is the last time I come here. I live upstairs and come to the market almost everyday. Not a good business move. Good luck with that.", "author": "Charles A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-04-01", "description": "This was the most horrible food I've ever had in my life. I had the lobster roll and tater tots. The lobster was dry with no flavor and some parts where brown. The bun was burnt and the tots were salty like my ex boyfriends balls. So disappointed since I traveled from Harlem to BK for a good meal.", "author": "De'Shanda G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-10", "description": "This place is an actual gem.\n\nI came here with my friend after a movie.  We were strolling around Dekalb Market looking for something appetizing.  We decided seafood sounded like a good option and saw some seats open at the bar, so we figured it was meant to be.  We could not have been more right.\n\nWe were greeted by the owner, JJ, who was funny and welcoming.  He quickly sold us on some of the off-the-menu items he had been cooking up.  The one we ordered was called the \"hot mess.\"  He explained we could order any of the options from the shellfish section of the menu and get it hot mess style, so we chose the lobster tail.  What ensued after this can only be described as pure bliss.  The dish included his amazing special sauce, mussels, potatoes, corn, and some other fun stuff I'm probably forgetting.  We chatted and laughed the whole time and drank wine.  It was a great afternoon and I will absolutely be back very frequently for the hot mess as well as telling everyone I know about it.  \n\nThanks, JJ!!", "author": "Lauren S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-05-28", "description": "My colleague and I went to this establishment for take-out lunch. We ordered two grilled shrimp salads and left a $4 tip. Upon receiving our order, we asked for one additional salad dressing and was told that we had to pay for it. We were appalled at the fact that we had just spent almost $40 for two salads (yes, $40 for 2 salads) PLUS a $4 tip and couldn't even get ONE salad dressing on the house! When I mentioned this to the server, she politely stated, \"I just work here.\" Which is true. It comes from the top down. She's simply an employee being advised by higher ups.... So I contacted the powers that be to inform them that as a courtesy, they should spare an additional tiny tub of salad dressing to someone, anyone spending $40 damn dollars for 2 salads!! Because of so much competition, I weigh heavily on quality customer service and they missed the mark! Needless to say, I will never patronize their establishment again! I will also suggest my colleagues do the same. TERRIBLE CUSTOMER SERVICE!! Shame on them! I would have given one star, but the server was polite so I'm giving two.", "author": "Lauri B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-28", "description": "Absolutely excellent!!!  I ate wayyyy too much!! Happy hour is great the chef was super friendly helped me crack my king crab leg because it was huge! Manager was super nice helping me with my gluten free allergies!!  I will be back if I'm in the area! Thank you again!! Also next to it is a beer place got a pineapple cider went well with my meal!", "author": "Ashleigh R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-03-07", "description": "Overpriced seafood that isn't that good. Service is \"meh\". I stood at the counter for a good 10 minutes while the cashier talked with her colleagues and scooped tartar sauce into containers before I was even acknowledged. Go elsewhere.", "author": "Nikki H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-11-03", "description": "Good place, and great food! \n\nManagement was also very nice, which was absolutely great to see. \n\nIf you like tater tots, and sea food, you will love their Old Bay Seasoned Tots.", "author": "Stephanie R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-26", "description": "I love the fried shrimp! Pure perfection. Not really a fan of tater tots, but I enjoy the ones that come with the meal. Yum! This is really a treat!", "author": "Narvina F."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-03-07", "description": "The jumbo shrimp are good but don't get the crab bites. Too much breading and not enough crab meat.", "author": "Jocelyn S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-08-07", "description": "Eh, 2.5 stars.\n\nVisiting the DeKalb Market for the first time, and being a seafood lover, I was excited to see a vendor specializing in seafood, and with quite an extensive menu, ranging from raw bar items (oysters, both East coast and West coast; clams, shrimp cocktail), to a choice of either fried or grilled salmon, tuna[1], striped bass, halibut, to several sandwiches (lobster roll, either warm or chilled; shrimp roll, fried skate, grilled octopus.\n\nThis is also one of the largest vendors present at the Market, and one of the few that has seating.\n\nThe grilled octopus sandwich ($15) sounded better than it tasted. The octopus was nice and tender, not chewy, but it didn't have much flavor. In the end I liked the toasted buttered bun and the giardiniera sauce better than the octopus itself.\n\nTheir sandwiches come with pickles and carrot slaw. I loved the pickles, but I'm not sure what the point of a carrot slaw is, as it's basically a coleslaw without any cabbage, and I like the cabbage in my coleslaw.\n\nThe grilled halibut ($22) came as a single fillet served with tater tots. The halibut was nice and flaky, and it tasted good and fresh, but I'm not sure it was $22 good. In the end, the tater tots were what I liked the most of this dish.\n\nIn the end, I left feeling slightly disappointed. Maybe my expectations were too high; maybe their prices are too high, but with so many delicious food options available at the DeKalb market, I'm not sure I would give Fulton Landing Seafood Co. another try.\n----------------\n[1] I like that it's line-caught.", "author": "Matteo R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-03-11", "description": "This is solely based on the clam chowder. The flavor was just bad. There was big pieces of bay leaf and an over whelming amount of dried thyme in my dish. To top it off there was CORN  in my chowder. Which I feel is a just faux pas when it comes to chowder. The clam pieces where huge which to some might be a good thing but to me it was just a NO. Left disappointed and irritated.", "author": "Erika S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-21", "description": "One of the best, one of the best, one of the best lobster rolls I have ever had in LIFE.\n\nEvery single bite was a huge chunk of RICH seasoned lobster. It was so fresh, so tasty, am experience. The sweet buttery toasted bread retained its integrity the whole way through, every single bite had lobster. This whole meal took me from underground in a mall in Brooklyn to sitting by the bay facing a light house and enjoying a sandwich. My family had a small issue with the chips being a little salty, my take on that was for one, crab chips remind me of when I was a kid, and two, it paired well with how rich the lobster roll was.\n\nThen there were pickles. Too much amazingness for a single plate.\n\nToo good, definitely will return. If there is a location other than city point please let me know.", "author": "Devon O."}], "servesCuisine": "Seafood", "priceRange": "$11-30", "name": "Fulton Landing Seafood Co.", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "445 Albee Square W", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/zyUhIz8lF_vtnDp4KIWUgg/ls.jpg", "@type": "Restaurant", "telephone": ""}