{"aggregateRating": {"reviewCount": 55, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-12-27", "description": "I just left here with my buddy, its not what I expected. There are so many choices in Dekalb food market. I had BBQ on Friday and Lobster for Christmas Eve, I don't want to eat a tremendo pastrami sandwich at Katz, what's left?\n\nFulton Landing Seafood Co!\n\nI saw the counter wasn't too busy. They had a fried fish sandwich special, I was more in the mood for something hot. I choice a seafood crab gumbo with rice. I used my debt card, they utilize Square so it was a simple transaction.\n\nThey put my gumbo in a container with a plastic top. When I went to the bench to sit down, the plastic top warped from the heat. Once I popped the top? The gumbo party dropped. Man, it was on! It was spicy but the crab meat wasn't plentiful and isn't there supposed to be andouille sausage?? For $15 bucks, this lunch was pricey but when you add up the skimpy essential ingredients, I'm gonna pass next time when I'm perusing the various booths.\n\nMy buddy got Pho and was laughing at me. Dang!", "author": "Bill S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-12", "description": "I love seafood, and these guys are definitely bringing fresh fish to what was otherwise kind of a seafood desert in downtown Brooklyn. So kudos for that.\n\nIn terms of food and service, there are a couple of wrinkles that they need to iron out. Their ticketing or back of house systems must need work, because multiple people complained about not getting their orders. I personally watched someone get served before I did when they ordered after me (and we got the same thing).\n\nI went with the octopus roll (never heard of such a thing!). I liked it (a bit salty) and at $15, it's way cheaper than other seafood rolls.\n\nThey do oysters, which is always a plus!\n\nThere are some bar top stools, so grab one of those since the seating at DMH isn't great.\n\nThey're also opening another counter on the side as well.\n\nLook forward to returning!", "author": "Kenny C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-12-12", "description": "We came to this cute little spot to kill time and catch a drink. We both ordered a beer (by the way they had a very good selection to choose from) and some tater tots. I was excited and thought it was so cute that their menu had tater tots, it's a good bar compliment plus its just not something you see all the time. The menu varied in selections and pricing. Since we were going to have dinner at our next stop after this pit stop we just stuck to something light like the tater tots. However, while we were sitting there at their bar our eyes were a roaming while everyone around us was ordering their food. The plates looked full and nicely cooked - it definitely enticed me to make another trip to try some of the food on their menu.\n\nThe service wasn't the best which was weird for such a small location.  It was just one of those situations where they were too dostracted by each other and their conversations to realize the people sitting around them might want something. Either I'm still intrigued to go back on an upcoming date night.", "author": "Elethia M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-02", "description": "A solid seafood spot in Dekalb market. I've eaten here twice, getting their clam chowder the first time and the clams the second time. (I'm so bad at taking photos in dekalb due to the general lack of cell phone service!) The clam chowder was good, with a balance of all of the ingredients and appropriate levels of seasoning- not under or over salted/peppered. At $9 though, I did it as a stand in for a meal. I think the portion might be a bit small for those with a hearty appetite, but it worked for me. \nThe other night I got the clams, steamed with garlic butter. I got 11 clams (10 opened, 1 still closed that I didn't eat) some toast and a piece of corn for $14- a pretty good value for seafood around here. I was expecting cherry stone clams with smaller meats, but these were larger- each clam was a full bite. They were served in a garlic butter broth/sauce, as opposed to it being something dipped on the side. Overall really good, and I'm sure I'll be back to try more of their steamed seafood dishes. (Hopefully with my camera this time!) A lot of customers seemed to be going for the mussels, that might be my next choice here!", "author": "April H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-08", "description": "A lot of gluten free options including fried fish, shrimp, and crab. Had the crab bites, very good!", "author": "Brian S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-12-28", "description": "I'm sitting at the counter leaving this review because the service has been so awful. I love the peel n'eat shrimp from here but one of the servers texted in front of me for 5 minutes before greeting me or taking my order. Now her and the manager are talking about how she needs to find a job with better hours and no one has checked on the other customers at the bar. From what I can tell the cooks are doing a great job but front of house really, really sucks.", "author": "Indy B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-10", "description": "The food is phenomenal!!! The steamed mussels with the roasted jalapeño, garlic, and butter sauce is of the chain!!! All the food is fresh and cooked to order!!! I highly recommend going here!!!!", "author": "Tony L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-08-02", "description": "One of the must go to spot in Dekalb food market because Fulton Landing Seafood Co. is one of the only place with seats.\n\nThis seafood joint has a friendly team that bangs out your dish very fast. The seafood here is very fresh but everything is overpriced. \n\nShrimp cocktail (5 shrimp) - $15\nGrilled shrimp on a bed of tatar tots - $15\nCup of Clam Chowder - $9\n\nIf you love your seafood and don't mind digging a hole into your wallet, you will not regret trying out their food!\n\nLong story short - Decent food;Steep price", "author": "Calvin C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-13", "description": "I was hungry and my bf chose a different type of fare, so I went for the seafood option.   The prices were pretty good especially for such a trendy place. The way some of the other customers were attacking their plates helped me make the decision to stay along with the very friendly workers that served up a sample of the gumbo I ended up getting.  I will say, for $15, the portion is okay (served with white rice, had a few hard grains in it ).  The flavor was on dire need of a gulf region seasoning like Tony Chacherie's or Joe's, old bay and a touch of liquid smoke.  It is spicy but that's about it.  A very northern take on gumbo.  No bad, not the best.  The service is what made this 3 star go to 4.", "author": "Farrah B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-01-08", "description": "Ordered a lobster roll, clam chowder and beer. The roll tastes stale, there are bits of shell in the lobster and the chowder should be called corn starch chowder not clam. Very disappointing, I won't be coming back", "author": "Christopher C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-25", "description": "New players on the scene but not rookies and any way, owners Rob and Jason  are hitting this one out of the ballpark. Both these fellas have a load of experience. \n\nSourcing fresh seafood and serving it up daily is a difficult task, but if you do it right it works. The fried Atlantic halibut was a spot-on; hot, moist and crisp. Lobster roll was delectable with the perfect portion, subtly seasoned but not overbearing. \n\nOysters (Taunton Bay from Maine that day) were high-brine but the source is the Maine waters. Super-cold, medium sized and shucked to order. \n\nSeafood market to follow, once open I think I'll add some words. I usually only cook/eat fish if it came off a fishing line from someone I know. I'll be back here.", "author": "Keylime S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-11", "description": "I do love a good lobster roll. I still prefer lukes but this place is in the top 3. (NYC) I really love the atmosphere. Its in the new dekalb market hall.", "author": "Michael M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-03", "description": "So I really like the idea of this place, and I went a couple weeks ago and just had some oysters  to chill out after Trader Joes and they were delicious and fresh. I think the owner/ manager may have served me. It was really good, if the prices were a bit steep for a food hall.\nI just went back yesterday though and had the same exact thing, and the staff obviously haven't been trained in how to shuck oysters... not entirely their fault, but if I'm paying $3.50 per oyster, I want to be able to eat the whole thing and not leave half in the shell because I can't remove it with a wooden stick. \nPout.\nAgain, not really their fault, but having something metal at my disposable to be able to do it myself would have helped a lot.", "author": "Claire T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-02", "description": "My husband and I stopped here for lunch before our movie since the menu at Alamo is not very good. We were both craving the fried fish sandwich and I'm so happy we ordered it. Perfectly friend Skate (yes.... skate!) it was delicious. The homemade chips with old bay were also spot on! We'll definitely go back. Super nice staff and the owner made a point of asking how we liked everything.... very engaging.", "author": "todd h."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-19", "description": "amazing experience from start to finish, mary greeted me with a smile and pointed out her fav options. i ordered the snow crab combo spicy....food came out within 10 minutes, hot, fresh, and full of flavor. thanks mary for the warm welcome, laughters, and overall experience", "author": "Justina P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-13", "description": "It wasn't bad. I'm gonna give it another shot at some point. The grilled octopus roll was tasty and fresh. The best part of it honestly was the bun though which was amazing. My problem with this was the chips. They tasted burnt and dry and needed more old Bay seasoning. For the prices they charge they should throw in some actual fries man! Not those wack chips!", "author": "Ladislao B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-12", "description": "my salmon salad was really delicious \u0026 beautifully presented~ clearly I was way too hungry for a photo! the ranch {I believe?} was surprisingly full of dill which I loved. all the veggies and the egg were fresh \u0026 the salmon was totally fine, I would have just preferred for it to be a freshly grilled filet as opposed to shredded up. almost seemed like it may have been canned? though it still had a very fresh taste, so I'm not totally sure. overall it was all still really delicious.", "author": "Lauren D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-06", "description": "In town for business, I was really impressed with this FANTASTIC little counter restaurant in the DeKalb Market Hall. I am Guten Intolerant, so I was pleased to find that most everything here was Gluten Free here, except for the bread. Even the clam chowder! Met the owner when I came as well, and was really impressed with how nice he was. If I'm ever back in the area, I'll be sure to revisit!", "author": "Keelan P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-05", "description": "I'm baa-ack. Rob served us on a rainy Saturday afternoon and we had a hilarious conversation while tucking into grilled shrimp, east coast oysters, and salad+tots...and a few beers. The shrimp were grilled  and oysters well shucked. He hooked us up with the tots even though we only deserved salad due to our failed ordering. Ignore the verbose picky folks expecting an impossible trip to an idealized coastal spot and instead stop by dekalb market for some good seafood and drinks.", "author": "Franklin D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-18", "description": "Food was excellent! Staff was quick and friendly.\n\nGreeted as soon as we walked up to the counter by Jason with amazing service. The lobster roll was delicious and fresh. This was my second visit and the service and food was just as excellent each time. Will be returning for future meals.", "author": "Aydan W."}], "servesCuisine": "Seafood", "priceRange": "$11-30", "name": "Fulton Landing Seafood Co.", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "445 Albee Square W", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/zyUhIz8lF_vtnDp4KIWUgg/ls.jpg", "@type": "Restaurant", "telephone": ""}