{"aggregateRating": {"reviewCount": 55, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-04-08", "description": "I usually come here solely for the spicy pull n peel shrimp, which is usually amazing. This time around, my shrimp came undercooked and lacked the usual seasoning. I overheard the tall cook bragging about his lack of care preparing my meal to his fellow co-workers. The ambiance also seemed like a hangout spot with the employees with the absence of the owner. Customer loyalty is key when it comes to the success of any business and it seems like the employees can care less. I will not be returning .", "author": "Adriana S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-06", "description": "Very very fresh food! Customer service awesome. Very clean and friendly environment. If you love seafood check them out.", "author": "Nina D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-18", "description": "I really like the food - great GF options and super fresh fish. But the service is really bad. I'm accustomed to NYC nonchalant attitudes but this place is worse. Taking orders (and God forbid, checking in on an order) is a nuisance, and apparently as difficult as open heart surgery. Skip it; there are plenty of other places in DeKalb Market.", "author": "Cherie E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-02", "description": "In this market hall that has many competing alike foods there only one seafood spot and Fulton Landing  doesn't disappoint. The staff is friendly precise service and they actually have their own seating which is clutch! I had their signature Lobster roll, have to say its not cheap (still on par with most of the food in the hall) but its absolutely terrific not too much Mayo as some tend to have and just right amount of seasoning on a buttery toasted bun.  Cant wait to try rest of their menu", "author": "Manny R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-14", "description": "This was my first time visiting DeKalb Market and wasn't sure where to eat so I picked Fulton Landing mainly because they had a TV showing the US Open. Plus they serve good beer! I had the grilled shrimp on a salad and my husband had the grilled salmon on a salad. Both were really delicious and cooked/seasoned perfectly. I like how they keep the portions on the smaller side so they can offer really good quality seafood at a decent price. I would visit again but maybe after trying some of the other vendors in the market.", "author": "Chelsea B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-01-24", "description": "Should I have known better than to eat seafood in a mall basement? Yes, but naturally I did it anyway. I guess I have a death wish. It was edible, I suppose, but really mediocre. The friend shrimp was dry inside and had not been deveined. There is no excuse for a place that exclusively serves seafood to not devein their shrimp. If your employees have time to hangout out and watch netflix, they have time to properly prepare the seafood that you are serving. The tater tots were fine, but it's sort of hard to screw that up. Also, water in little plastic cups. So unnecessarily wasteful and obnoxious because every two minutes my water had to be refilled. Also, I left my house to avoid a giant tv screen so having a really awful show (The Flash) playing incessantly right near my face was not pleasant. Service was fine though. They were nice and attentive (to me, not the shrimp, obviously.)", "author": "Bea L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-01", "description": "The food was great and quickly prepared, however the prices are steep. I enjoyed the five fried shrimp and tots dish ($15) with a glass of wine ($9). The fried food was not greasy and the shrimp were lightly breaded, both a plus in my book. The staff is friendly and accommodating.", "author": "Shaquana F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-20", "description": "Lobster rolls were delicious -- lots of meat, perfectly toasted bread.  The chips it comes with are way too salty, recommend getting the tater tots as a side instead.  It is nice that you can grab seats at the counter.  Mary made sure we received excellent service.  We'll be back.", "author": "Vanessa M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-08-13", "description": "I ordered the Grilled Shrimp Platter with a green salad for $15 ($16.33 with tax). The shrimp were extremely undercooked and under seasoned and I had to broil them to cook them. While I was doing that I decided to start with the salad. The citrus dressing was mediocre. When I continued to eat I found a LARGE strand of hair in my salad! So unsanitary. I will not return there.", "author": "Jasmin C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-08-10", "description": "I stopped by to get dinner after a TJ's trip and thought I'd try Fulton Landing. I ordered the fried shrimp plate, with the tater tots to go. It took a little while, but not overly long and grabbed my bag and headed home. When I got home I was surprised to find that, while there were a lot of tots (and I'm certainly not complaining about that!), there were only 5 shrimp. They were okay, but nothing to write home about. I'd prefer it if restaurants wouldn't dump the lemon on top of the food as I don't actually like lemon, and I think the coating possibly has lemon in it, too. The tots were the best part, but I think $18.33 (my total) is a bit excessive for five shrimp and some potatoes.", "author": "Diane K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-08-03", "description": "you need a reason to charge $15 for 5 pieces of fried shrimp. \nservice also was uncomfortable when someone stares you down for a tip before you even received your food", "author": "Cherry W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-26", "description": "Food is great. I enjoyed it. But not for the price. Way over priced for such small portion. Service is great too btw. Friendly and laid back. Bartender cracks good joke lol.", "author": "L. M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-10-24", "description": "I had the clam chowder; it cut my tongue with the amount of salt it contained. So disappointed with this place! I couldn't even finish my chowder... of course", "author": "Daphne M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-10-18", "description": "Had the skate and shrimp. Bland and undercooked. Quality and taste just not there to justify such prices.", "author": "Vesper L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-03", "description": "This is a great place if you are looking for super fresh and tasty seafood. This is my go-to spot for lunch every time I am in the Brooklyn area. When I learned that the guys who run the place have been in the seafood restaurant business for over a decade, it all made sense to me. They have really mastered every item on the menu and don't compromise on quality what so ever. The salmon is my absolute favorite. I highly recommend this place. Keep it up Fulton Landing. See you again soon!", "author": "Kinjal P."}], "servesCuisine": "Seafood", "priceRange": "$11-30", "name": "Fulton Landing Seafood Co.", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "445 Albee Square W", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/zyUhIz8lF_vtnDp4KIWUgg/ls.jpg", "@type": "Restaurant", "telephone": ""}