{"aggregateRating": {"reviewCount": 747, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-06-24", "description": "Surprised not to see more 5's here. The food is so good and the place unique. Sure, it's popular -- so best to come here on a weekday, and not at noon. But the fries, meat and poutine are to die for. It's also got a lot of personality, kind of like the cashiers at Trader Joe's, often some funny small talk.", "author": "Jeremy G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-06-02", "description": "Just had a smoked brisket sandwich on rye.   simple and not overstuffed like a lot of delis. But the meat was moist and spiced just right.  Not too fatty. On rye with a bit of  mustard, and it is just right.  Staff was very helpful.   And the price just right.", "author": "Robin M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-07-19", "description": "Since I love causing problems, let me say, *achem*...\nwhat this fine institution represents is, really, a throw-down over a long-asked but rarely-specified question.  And that question, my friends, is this: \"Which is better -- Montreal Smoked Meat, or New York Pastrami?\"\nYeah, I'm spelling it out, for the time being.  I don't believe I can reasonably answer, yet, but -- Mr. Mile End, I'm coming to check ya out.  And also, I'm rooting for you.  Wait, no, that sounds partisan -- I'm rooting for you because you're young, and *hungry* -- and I think, dare I say it, that deli needs a younger generation to step up.  So I give you props.  But!  We'll see how the viand fumee is, my friend.  More to come.  :D", "author": "John W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-09-06", "description": "The BF had talked up Schwartz's for a while and when we had read this place was opening down the street, we were sooo excited!!  So we went about 6 months ago and had two smoked meat sandwiches.  The sandwiches came out and were actually normal sized compared to Carnegie \u0026 Katz's - more like Schwartz's.  It's also a normal price of about $9 (not $17).  The meat is lean compared to what I experienced at Schwartz's and not quite as juicy \u0026 flavorful.  If it was fattier, I would be raving about it.  \n\nAlso tried the poutine on a more recent trip.  The fries were good but salty.  Unfortunately the cheese curds were not melted in a gooey mess like it should be and it wasn't quite the experience of poutine.  Though it was still good.  (Liked the gravy).  \n\nAs for service, both times we went we sat at the counter and talked to the guys cutting the meat - they were great!  I would say service was awesome!!!  Will definitely keep going back.  \n\nOne note - the wait can be pretty bad since there's hardly a seat there but take out is easy and not more than 10 minute wait!", "author": "Lina H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-07", "description": "Went for lunch this afternoon with two born and raised Montrealers and another friend who, like myself, spent a few years of his life there. Suffice to say we all agreed that the smoked meat, though not quite as good as Schwartz's, was largely excellent and as faithful of a reproduction as one could hope form given the circumstances.\n\nAs others have said in their reviews, however, it's still quite disorganized; they were out of St. Viateur bagels and they don't have any pickles yet. I think if they were to fill out both the smoked meat sandwich and platter (both pretty expensive at $8 and $13 respectively) with a pickle and maybe some slaw or fries it would achieve excellence.\n\nI would totally go again to try the poutine, still the Holy Grail for Canadian ex-pats in New York.", "author": "M S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-29", "description": "raising you a half star (4.5 stars!!!), mile end, b/c your poutine is yum city, even if salted a bit aggressively.  i mean, who are we kidding here?  any dish topped with smoked meat, cheese curds and gravy cannot lay claim to healthy eats.  best to revel in it so that when i'm in the mood to overindulge, glad to know you'll make it worth my while.", "author": "Tina E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-10-02", "description": "excellent montreal bagels, smoked meat, whitefish, coffee, service, and ambiance - Mile End FTW", "author": "James R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-09", "description": "They take care with their food and present familiar dishes with the freshest and tastiest ingredients.  Get in line just before opening time on a weekend morning.  A real treat.", "author": "Chris S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-07-04", "description": "Although excellent, the sandwich is really tiny. The restroom is called a washroom here.", "author": "Stephan H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-05-29", "description": "Love this place! The meat is incredible! There's a gorgeous staff member who I'm fond of (he's a cutie!)\nBut: \nI really wish I could try the stuff on the weekend menu (hash,etc), on the weekdays when eating here is not at all stressful. i can only eat the \"mish-mash\" of eggs,salami, and greens so many times! \nThe poutine was NOT like the one I had in Montreal, for some reason the the cheese curds weren't melty and the gravy was too thin. But my friend and I ate all of it just the same. I think this is a trek-worthy place if you're a fan of pastrami and such.", "author": "Alex O."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2010-10-16", "description": "I just don't understand what some of these people ate there that made them write anything positive about this place, unless they are related to the owners. The Matzo Ball soup was straight out of a can and was dark brown.  I didn't know that chicken soup could be almost black in color!  The pastrami we were served at Mile End was nothing but a piece of super salted fat with a horrible smell that was supposed to be a Montreal kind of smoke. Well, as far as I am concerned, let them eat this crap in Montreal, but if you want a real delicious Pastrami sandwich, certainly New York has no shortage of great delis, especially Katz's Deli on Houston Str. \"miles and miles\" superior to anything this horrible place has to offer. If there was a rating of less then 1 star, I'd give it to Mile End!", "author": "glen b."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-30", "description": "I want to note this for others who may make the mistake I made: the smoked meat and poutine (and borscht, etc.) are only available after noon.  It says that on the menu, but not on the front page of the website where the 10 am opening time is given, alas.\n\nAnyway I went at 10 am and had a good bagel w/ lox.  I found the bagel just slightly stale, but the toppings were excellent.  I will just have to go back for the smoked meat.  As a former Montrealer I do think Montreal bagels and Montreal smoked meat are superior to anything I've had yet in NYC, so I have high hopes.  The four star rating is aspirational.", "author": "George S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-05-07", "description": "Vegetarians--Don't Miss the Best Salad EVER! True, there ain't much to choose from for us veg heads at dinner, but once you've tried the Romaine w/anchovies you'll gleefully indulge your carnivorous dining partners, and--like me--start daydreaming about your next visit! Also loved the cheesecake w/poached vanilla-soaked cherries and HUGE cup of Grumpy's java. Mmmmmmmmmmm!", "author": "Bonni M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-21", "description": "This was the best sandwich I've ever had containing brisket, period. It melted in your mouth. Can't say enough good things about it. However since we ate two sandwiches they were pretty fatty and we were full for the rest of the day. Still the be", "author": "Anna S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-01-27", "description": "This place is a great addition to the Brooklyn dining scene. The space is bright and relaxed and cozy at the same time, and the food is perfect for when you've got some serious munchies. I had the Grandfather (turkey sandwich) with gorgeous chunks of turkey on a slightly sweet bread. I also LOVED the borscht (I ate two bowls of it) and the fries.\n\nCan't wait to go back and try the famed smoked meat and their breakfast line-up.", "author": "Coll C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-05-22", "description": "the tiny deli that probably can seat 30 at the most has a take out window for those less patient to get their poutine on.  my pals are sweethearts and treated me to bday brunch at this spot.  we had a 40 minute wait time, which ended up being 30 as we opted for bar seating.  i did want the mont royal, but they were out of it.  i ended up getting the lox mish mash.  it was tasty but the lox was more salty than i like.  the poutine was excellent and i recommend you pay the extra for the meat.  i would like to go back and try the mont royal.", "author": "Sharlene C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-12-04", "description": "Dunch (aka: late afternoon brunch) with my boyfriend at Mile End was delicious. I had  been one other time early in the morning last year but they don't serve smoke meat that early :( so I settled for the Montreal bagel and lox which is also really good:) Especially the montreal bagels (warm and toasted) is the perfect way to serve them. Today we had the smoke meat deluxe (smoke meat sandwich, pickles, slaw and frites), daily special quiche, cinnamon bun and stumptown coffee. The smoke meat is basically what you have to go there for. They pile a mountain of smoke meat sliced thin between slices of rye bread and adding some mustard with every bite makes it perfect. The quiche was delicious with sheep milk, spinach, onions, and duck sausage. The crust was flaky and inside was creamy not overcooked. The cinnamon bun was warmed in the oven with icing poured over the top. It was the perfect way to end our meal.\n\nThe atmosphere is really great, you feel like the restaurant is this tiny local place just around the corner, you can see the chef prepping all the food and the decor and ambiance is definitely Brooklyn-style.", "author": "Stephanie B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-07-27", "description": "It's been 5 months, so I thought I'd give it another try. In the interim, Mile End was blessed with a boatload of positive publicity, with mentions for \"best sandwich\" in New York Magazine, etc. Word on the street has been great, and the crowds waiting to get in are the proof. The good news is that they seem to also have worked out some of the kinks--the food supply is a little less erratic and a little more in tune with demand, so they're able to stay open a little longer every day--and the place seems to be a success, which is great for the owners and employees. The bad news is...I'm still really underwhelmed. The smoked meat sandwich I ordered, to go, was small (maybe 5\" dia.) and, I thought, overpriced. The preparation wasn't especially good--meat that was fatty in an unpleasantly chewy way--and the order took approximately 10 minutes to be ready. (There were 2 customers, with small orders, ahead of me.) If given the choice, I'd definitely choose Katz's, and, although Mile End is only a stone's throw from my apartment, I doubt I'll try it again. Sorry, but I think this one's almost all sizzle, and no steak...er, brisket.", "author": "Harry A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-02-08", "description": "Food: Amazing and unlike anything else greater NYC has to offer, worth a trip from anywhere.\n\nVibe: Fun, fast paced, and casual dining\n\nService: Friendly\n\nNotes: Get there early and/or follow them on Twitter because the smoked meat sells out by mid-afternoon. While yes, they had some kinks to iron out over the first two weeks, service and execution have improved leaps and bounds. That said, the wonderful food is what will keep people coming back. I can't wait until the weather gets warmer and they can do take-out from their window!", "author": "Jen D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-10-25", "description": "Can't complain, great Sandwiches! Be there many times! Tnx", "author": "Salomon C."}], "servesCuisine": "Delis", "priceRange": "$11-30", "name": "Mile End Delicatessen Brooklyn", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "97A Hoyt St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/jL2-f-hVAwkXx5vELTD0RQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188527510"}