{"aggregateRating": {"reviewCount": 747, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-06-27", "description": "already starving when we arrived for saturday lunch, and were quoted a 10 minute wait.. which eventually turned into 30 minutes. by the time we sat down, we were simply famished.\n\nit didn't help though that their $12-$14 sandwiches/burgers were too small to even begin to satisfy our appetites. after 15 minutes of eating in silence simply because we were too hungry to talk, i had finally choked down my dry and extremely salty smoked meat sandwich. i don't usually drink that much water, but that day i consumed 4 glasses of water during lunch, and another 3 after i got home.\n\nthe poutine was fine, and worth getting. but that alone does not warrant a visit here as there are other places with decent prices and portion sizes that actually serve good food with their poutine.\n\nalas, a four star average here does not equate to four stars elsewhere. yelp, for once you've let me down :(", "author": "Yiwen S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-06-06", "description": "I used to live and go to school in Montreal and my mom's family is from Quebec City. Two of my very favorite foods in the world are Montreal-style smoked meat and poutine. I know these two foods better than most.\n\nMile End has no business trying to pass itself off as a Montreal-style smoked meat restaurant, as the meat tastes nothing like what you'd eat in Montreal. Go to a classic Montreal smoked meat deli - places such as: Reuben's, Schwartz's, Bens (now sadly out of business), and even La Belle Province - and you'll immediately understand that Mild End tastes nothing like it. Montreal smoked meat sandwiches have a very different flavor and cut (smooth slices vs. rough cuts at Mile End).\n\nTHIS is a Montreal Smoked Meat Sandwich (Rubens): http://www.foodspotting.com/places/99860-reuben-s-deli-montreal/items/7665-montreal-smoked-meat-sandwich\n\nTHIS is NOT a Montreal Smoked Meat Sandiwch (Mile End): http://www.mileenddeli.com/wp-content/uploads/2012/08/nymag1.jpg\n\nOn to their poutine -- I was not impressed. The cheese was most certainly not authentic Quebec cheddar cheese curds which tastes amazing and squeeks when you chew it...and poutine is all about the cheese. Even McDonalds in Quebec makes a half-decent poutine because they get the cheese right. Mile End seems to serve some sort of bland mozzarella substitute - blah. The fries themselves were excellent, the gravy was just ok, but the cheese just wasn't even close to the real thing and ruined the dish. \n\nThere used to be a place in the Lower East Side called T-Poutine that served real poutine -- but is now sadly out of business. Pommes Frites on Second Ave (East Village) serves poutine with the real cheese curds imported from Quebec, but their fries are not exactly the best for poutine.\n\nIn my opinion, the best poutine in the world is from a fast food place in Quebec City called Chez Ashton.", "author": "Michael H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-08-18", "description": "Highly overrated.  If you are hungry, you will need to spend $40 per person to feel sufficiently full.  I ordered the Sunny Eggs and Corn Hash, which was good but the portion was so tiny.  Mile End wants to be an ultra high-end diner.  You are better off somewhere else.  So, you want to go come here on a weekend?  Forget it!  This place is so tiny.", "author": "Steve W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-06", "description": "I'm conflicted. Each of the two times I've been here provided drastically different food experiences. The first was 5/5, and the second a 3/5. \n\nDecor/Ambiance 4.5/5\nIf you come during lunch hours, this small and cozy spot will be packed to the brim. Nevertheless, it still feels more comfy than cramped. \n\nDinner  might be the same or not. We went on a weekday, so it wasn't so packed and we were able to get a table within minutes of entering with no reservation. \n\nService- 5/5\nDespite it being really busy at times, the staff was extremely polite and pleasant. They also offered good wine pairing suggestions.\n\nFood- 3/5-5/5\nThe smoked meat sandwich was ridiculously good. Eat while hot for extra tenderness. While it isn't on the level of say, a Katz sandwich, it is still really really really good. Try the poutine if your heart can handle it. \n\nWhat wasn't so awesome was the deli board for dinner. The pastrami was extremely salty, even for pastrami standards. Also, though pretty in arrangement, the taste of the chopped liver, salami, and other ingredients weren't really impressive. \n\nBottom line- come here for the sandwiches and make sure you eat them hot.", "author": "Edward Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-15", "description": "I was lucky enough to live in Montreal for 4 years while going to school there. Mild End shares its name with one of my favo(u)rite Montreal neighborhoods. This \"deli\" really brings me back.\n\nThere can be a huge wait for a table, which sucks, but at the same time, I feel like the cramped quarters add to the authenticity of the restaurant. Also, sitting at the counter might be my favorite seat in the house.\n\nThe smoked meat is the best there is. There it is. I said it.\n\nThe beer list is beautiful and filled with Quebecois gems.\n\nMy wife is pretty much vegan these days, so I usually reserve Mile End for when I have a sleepy Saturday to myself or friends are in town. \n\nThis place is special.", "author": "Ben L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-01-28", "description": "I ordered the smoked meat sandwich.  What they gave me was very fatty (some people like it that way, I know, I just can't).  The server quickly replaced it with a very lean cut which was much better, but a little on the dry side.  I would probably go back, but the prices seem high for what you get.", "author": "Amy R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-01-10", "description": "Came here for there brunch which I was not crazy about. I had the cured brisket sandwich and it was extremely dry.    I'm not sure if there lunch and dinner menu is better but I won't be back to try.  The food was fresh but with an open style kitchen we sat at the bar and one of the chefs made food for himself and would handle his cell phone and then back to handling the food with his bare hands.  I saw him send a text message and then reach into the Cole slaw with his bare hands, then he handle the raw potatoes and then back onto the meat and so on.  I know many places may have such practices but I just hate seeing it.   \nThey do have a good selection of beer and use my favorite coffee brand (stump Town)\n\nIf your like the menu I'd say give it a shot but don't expect anything more then average food.", "author": "Michael B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-04-23", "description": "I wasn't so thrilled about the sandwiches but the poutine was a-ok. My boyfriend and I had to wait a bit for a table since we arrived around noon-ish for lunch. We sat right by the counter, which wasn't a bad rendition to the little benches and tables behind the counter. \n\nOur main focus was the poutine and since we're there, might as well try out their smoked meat sandwich also. The boyfriend had the Smoked Meat Sandwich Deluxe that came with the classic poutine for $3 extra, I ordered the Grandpa which consisted of turkey breast, turkey rillettes, mustard and pickle.\n\nThe poutine was nice, not the best since Montreal will always be #1 in my heart. Mile End gives you big chunks of cheese curds, my only pet peeve is if only they were a bit smaller. The cheese melted fast on top of the fries and gravy. The gravy was perfect, seasoned just right.\n\nThe sandwiches were the disappointment. I felt those sandwiches we ordered were a bit on the dry side and no matter how much mustard we put on it doesn't take away the dryness the meat held. Oh, and the dude behind the counter that cuts up the meat always steals a piece after each order... strange.\n\nI would only return for the poutine unless my next experience with their sandwiches aren't as dry and bland.", "author": "Linh N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-19", "description": "Expensive, but the food was Great. I suggest you go on a Tuesday evening. They have a deal where you can get a burger, fries, and a drink for 19 dollars. I think maybe they should lower it to 15 but that's just me. The food was better than expected though and I felt full after which is always a good feeling. I loved the atmosphere and the music selection.", "author": "Bashard B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-01-13", "description": "DO NOT GO THERE FOR THE POUTINE. This is not poutine. I had Poutine at the Bond street location and was very disappointed. Went there after reading about the owner being from Montreal and making the poutine just as good as the ones you get in Montreal. Fries were overcooked, gravy is not good it's the KFC type (not BBQ or brown gravy but instead made with chicken scrapes and fat) not the traditional poutine gravy. Not enough cheese curds. Would not go there again for the poutine. I'm a Montrealer and I know what a good poutine should taste like and it's certainly not the one they serve here. The only good thing about this poutine where the cheese curds. Also something weird was the staff eating at the restaurant table helping themselves out of huge mixing bowls of salads and soup that were on the table.\n\nDo not go to Dive Bar either. The poutine is even worst. Fries more than overcooked, barely no gravy and the gravy is disgusting, not using cheese curds but pieces of cheddard or mozzarella cheese. Plus the place smells like javex.\n\nFor decent poutine go to Pommes Frites in the East Village.", "author": "Josie J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-24", "description": "Really impressed by the food here! Will probably do take-out next time though; thought it was a pretty good deal with a Reuben and beer (fresh ingredients). I came around 1pm on a Saturday to meet some friends for lunch and waited almost an hour. It is super super small. If you are in the neighborhood and want a tasty sandwich, check out Mile End.", "author": "Teagan R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-23", "description": "went back recently for \"Poutine Week\".  This time we ate in the restaurant rather than getting take-out.  We had a great time.  My son says their burger (with egg on it) is still his favorite in NYC, and my smoked meat sandwich was terrific - there was much more meat in the sandwich than last time and the meat was tender and delicious.  Our waitress was superb.  I'm sure we'll be back this summer.", "author": "Joey C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-20", "description": "Expensive so I can only go once in a long while, but seriously delicious food. The poutine is incredible!", "author": "Tiffany R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-20", "description": "Easily one of my favorite restaurants/delis in NYC! I've been to this location several times well as the one on Bond st and have never been disappointed. If I could eat here everyday I would so do that! Smoked meat sandwich is to die for...also smoked meat poutine. So yum! The cauliflower tabbouleh salad is fresh, healthy and delicious and chopped liver never disappoints. Tried the chicken shawarma last time which was pretty delicious and also a creative spin on your typical shawarma. And let's not forget the pickles and slaw, which are also pretty solid! My only complaint is that the place is tiny and gets packed quickly! \n\nI really hope they stick around for a long time and keep up the quality and innovation!", "author": "Nikki S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-20", "description": "You eat a life-changing smoked brisket poutine, then you chase that with a classic reuben. Stomach ache? Nope. Pure satisfaction? Yup. Only the finest provisions means you'll rage the most decadent items on the menu and catapult out the front door of the restaurant with your head held high, that is until you get home and have no other option than to fall asleep watching football. Don't fight it, that's the best part.", "author": "Eric F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-30", "description": "Very cute if hipster-y atmosphere. Brought the kid, they were able to modify a recipe for her. Friendly service, interesting flavors (tried poutine for the first time, the kid had Asian noodles), decent prices. Worth a trip back!", "author": "betty s."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-07", "description": "Had a hankering for poutine ever since I visited Montreal. My boyfriend's sister lives in Brooklyn, and suggested trying this place out. We were not disappointed. I wish the place was a bit bigger, but it was clean, and the service friendly.\n\nThe poutine came in two choices - classic (gravy \u0026 cheese curds) or smoked meat. We went with the smoked meat, and it was YUMMY! It was heavy but satisfying, and definitely big enough to share.\n\nThe rest of our meals were delicious, and the portions were a good size. All in all, it was a good choice (and start) to what I remembered to be a beautiful and sunny day!", "author": "Kate Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-16", "description": "The fact that before they expanded, you had to plan out your visit because they would run out of smoked meat before dinner is a true and telling testament to this establishment. And the fact that they have poutine is also fantastic.", "author": "Andre P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-03", "description": "Got delivery from this place. My family and I really enjoyed everything we ordered. Only complaint would be is that the sandwiches are a bit on the small side. Make sure to order a side dish or upgrade to the deluxe.", "author": "Brooklynite L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-03-09", "description": "Meh, didn't really do it for me. I was expecting more of a flavor explosion for the money.\n\nService was great, cook was friendly, but the food was standard that I can cook myself.", "author": "Nate F."}], "servesCuisine": "Delis", "priceRange": "$11-30", "name": "Mile End Delicatessen Brooklyn", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "97A Hoyt St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/jL2-f-hVAwkXx5vELTD0RQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188527510"}