{"aggregateRating": {"reviewCount": 747, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-09-25", "description": "We saw this place on Food Network last night. We were amazed by how they take time to make the brisket BBQ, so we decided to try Saturday brunch. The place was packed, people were waiting outside.\n\nMy husband ordered brisket platter and I ordered regular brisket sandwich. The platter was huge. It was so much meat and it was so juicy and tender. We enjoyed it so much.\n\nWe are so glad to find place like this in Brooklyn.", "author": "Meg F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-03-06", "description": "Prior to going here, I read the reviews online and expectations were that this spot was like Schwartz in Montreal. I can see some similarities, the poutine, the smoked beef, but that's about it.  \n\nI'd have to say that the smoked beef sandwich was a bit smaller than what I was expecting and a little bit drier than Schwartz. Also the pickles wasn't that all appealing as it tasted like it was drenched in vinegar. \n\nThe room is a bit cozy, I think I counted room for 30 people max between the 4 tables and the food bar counter.", "author": "John M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-06-13", "description": "Bottom line. Not worth it. The waiter I've encountered here was incredibly rude both times. I came to pick up some lunch, not to be served an extra large heaping pile of negativity. Both times I popped in briefly to order, pay and take my food to go since I work nearby. This most recent time said waiter kept his back to me when I returned to get my sandwich. I had not even come all the way inside when he points to the counter away from me and goes \"That's you\", then turned his back to chat idly. I promptly asked [if it appeased his highness] could he please humanely hand me the bag of food for which I sorely overpaid like many of the reviews you'll find echo on here. He had already managed to fit in so much sarcasm from the minute I placed my order, but I brushed it off because my goal was to be as brief as possible once I saw it was the same angry guy from weeks ago. That is until what happened at the end which is disgustingly unacceptable for a business/customer interaction. Must we all be Canadian Prime Ministers for you to maintain integrity in your business when walking through the door?", "author": "Gypsy R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-06", "description": "Very good Reuben, buttery grilled bread, and good smoked meat, unfortunately not toasted bread", "author": "Nicolas V."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-03-14", "description": "I brought my girl here because she became obsessed with poutine when coming back from Canada ay! She said it was decent but not nearly as good as she was hoping. I got the matza ball soup which was pretty good as well. The prices seemed pretty expensive for what we got but that what you get. I have no need to come back here but my lady does so that of course means I will be back. Happy wife happy life right?", "author": "Geoff P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-09-29", "description": "Mile End used to be one of my favorite places in the city.  Fatty, hand sliced beef nestled between perfectly crusty bread with just the right amount of mustard.  One bite of this sandwich would transport me back to the legendary Schwartz's in Montreal.\n\nThe difference with Schwartz's, however, is that they still take pride in the product that they put out.  Mile End seems to have allowed their early successes to get to their head.\n\nSome friends had just moved into the neighborhood and I decided to take the opportunity to give them an introduction to the Smoked Meat Sandwich today.  There was a street fair going on, so we opted for the take-out counter as the restaurant was packed.  I ordered my usual - a large poutine, a smoked meat sandwich and an orange juice.\n\nThe cashier proceeded to grab a jug of orange juice from the fridge and, noticing that the container was getting low, decided that I was only worthy of half a cup of juice.  I was contemplating whether to bring this up when he shoved my credit card and an iPad at me and grunted \"buddy, you're holding up the line.\" Ok, guess half a glass it is.\n\nWe sat down in the seats adjacent to the window and waited patiently for our food.  When my name was finally called, I asked for a cup of water - having finished my three sips of OJ long ago.  Big mistake.  He glared at me and barked \"are you shitting me? These cups cost money.\" I exchanged looks with someone in line, who immediately decided that this restaurant wasn't worthy of their time or money.\n\nService may only be part of the equation, but bad service can have a disproportionate effect on the entire experience.  Please don't make your customers feel like garbage for asking for a plastic cup and tap water after they've paid $31 on a sandwich and fries.\n\nPerhaps it was my frame of mind, but the smoked meat sandwich was unbearably salty today, and the poutine was oddly bland.  The final nail in the coffin was when we were still fuming several blocks away and we realized that the cashier hadn't offered us forks for our poutine or a paper bag so we weren't juggling food.\n\nMile End now evokes images of salty, overbrined meat, bland, tasteless, hard-to-eat fries and bad service.\n\nNeedless to say, neither my friends nor I will be returning.", "author": "Alex L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-02", "description": "You've probably read it 100x here already: poutine. There aren't many places in the city to have this Québécois 'delicacy', which will guarantee you instant addiction - if you're already a fan of fries and gravy.\n\nMile End's poutine is on a slight salty side, but then again, poutine is supposed to be salty. When compared to M. Wells's poutine, I enjoyed Mile End's better because, the cheese curds seemed to have a better bite, and the amount of gravy was just right - not so much that the fries become too soggy. \n\nHowever, it's been a while since I had M. Well's (any) poutine, so...\n\nI am a fan of the kasha varnishkes from Jewish delis, my impression of them is usually dry and simply a bowl of carbs. And I love them! So I was compelled to order though a bit reluctant to - gizzards and gribenes are totally fine, but not sure I'd want to eat veal meatballs. \n\nI was at first shocked when the k.v. came - it looked nothing like the regular deli sort, it was drenched in glistening sauce and the pasta was a soft delicate pappardelle. The taste reminds me of regular k.v. but it's drastically different. It was decadent and meaty (go figure). Call it deli-k.v. in formal attire.", "author": "Dennis Y."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-09-27", "description": "Thought the food here was just so-so, but was happy to discover they now carry St. Viateur bagels from Montreal. However, their mark-up is ridiculous. $20 for 1 doz ($1.67/bagel). You are better off ordering direct from the St. Viateur website (all prices are in Canadian funds) where 4 doz are $28  and even with ground shipping which is $29 to New York you still get a better deal at $1.19/bagel. These bagels will be great for over 2 months in the freezer. Just pre-cut, freeze then toast to enjoy!\n\nhttp://www.stviateurbagel.com/", "author": "Shasami J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-24", "description": "Where did this place come from? I used to live in this 'hood, but it wasn't until I moved back to Manhattan that I heard about it? \n\nMaybe the locals kept their closely guarded secret because this place is such a gem. Montreal-style smoked meat and poutine in NYC? I'm in. Went for lunch on a Sunday, and had about a 45 minute wait, but we had some delicious coffee while we waited (helped us stay warm too!). \n\nOnce you're inside, the place is small, but very nicely decorated - definitely not \"deli\" style, except for the lunch counter seats. The smoked meat was delicious. Not quite as good as what I've had in Montreal, but very, very good. The poutine is the same: not quite the same as Montreal, but very, very good. \n\nIt's a bit pricey, yes, but not ridiculously so. Keep on keepin' on, Mile End, you've really done something good here.", "author": "Peter C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-12", "description": "Amazing to read the negative reviews... It's plain and simple... Mile end is real artisan food-You pay for the real thing! \"Overpriced\" HA! Are you upset at your budget, Or they sold you something which was not true to menu description.  I love mile end!  simplicity is the ultimate quality. TIP-Don't go to mile end if you're a vegetarian\" and don't go tho mile end if you prefer a 1/4 pounder meal (for your $10 budget) rather than getting a MILE END AMAZING HOT DOG!", "author": "Nancy P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-14", "description": "I lived in Montreal for four years, just down the street from St. Viateur and Fairmount bagels, and I visited these esteemed establishments almost on a daily basis. There are bagels and there are bagels and Montreal bagels are the best you'll ever have so when I found out that this genius former Montrealer was bringing THESE bagels to NYC, Brooklyn no less, I almost lost it. Plus, producing smoked meat that far trumps anything you'll find in Montreal or NYC, again, GENIUS! So glad the guy ditched law school. \n\nMile End reminds me of a much nicer version of Montreal's Beauty's. The ambiance is so welcoming, the counter is comfortable and the vibe is truly wonderful. I love the breakfast sandwich, topped with the thickest, meatiest bacon ever, and of course settled onto a delicious, mildly sweet, effortlessly tender Montreal bagel (make sure to specify that you want the bagel, not the rye toast). Poutine is literally to die for and the smoked meat, well, as I said earlier, this is the best smoked meat I've ever had. \n\nMile End is a jewel in Brooklyn's crown. I would live here if I could.", "author": "Christy V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-05-07", "description": "The first trick for going to Mile End is to go early. If you go early, it feels more like a neighborhood diner (which it is really) and less like the hyped-up destination du jour.\n\nThe second trick is to treat your brunch like it's a 3-course dinner. I usually start with the Montreal bagel with onions and tomato, move on to the mishmash with salami, and finish with one of their sweet pastries. Or you could go the poutine-smoked meat-cinnamon bun route. Whatever tickles your fancy.", "author": "Katie C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-21", "description": "Mile End was recommended by friend's sister who lives in Brooklyn.  Brooklyn is the trendiest of trendy these days, and not only is ME billed as a Montreal deli, but I noticed a place nearby offering Montreal bagels -- is there an influx of hip Quebecois?\n\nAnyway, the sandwich was outstanding and I was grateful that it was not obscenely large as seems to be a requirement at some NY delis.  Pickles excellent too.  Fries very crisp, which I like.  It's a small place with limited seating and a small menu but we went for a specific reason (the smoked meat) and it met the objective.", "author": "Robert D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-08", "description": "I had the roasted turkey reuben and the classic poutine. Everything was super flavorful and delicious. I've had their brisket before at the Brooklyn shmorgasburg and that is fantastic as well.The only thing I'd say is that the food (both the sandwich and fries) were a bit too greasy so I didn't feel great after eating lunch.", "author": "Kathryn H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-06-20", "description": "If you coming here for the cornbeef or pastrami sandwich, you may be disappointed. Unlike Katz, you don't get a whole lot of meat for the buck and it's a thick cut. The rye bread was on the hard/stale side. I will not repeat. There is a reason why Katz is the best.", "author": "Johnny Y."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-12-12", "description": "Based on all the hoopla I've read about Mile End I decided to try it back in 2014 when I was there for the Atlantic Antic. I tried the brisket and was underwhelmed. It is now Dec 2015 and I was there with a friend shopping.  We decided to share a rueben and the latkes (for Hannukah) and honestly I've had better tasting deli in bodegas.  the quality of the food is fine, but the flavor is not just mild, it is missing other than the clove flavor which I personally found distracting. If there was cheese on the rueben neither of us tasted any and the russian dressing has no sweetness to it at all. The bread wasn't toasted and the sandwich was very small.  The latkes were small but tasty (although my friend didn't find them as tasty as I did).  Service was fine.   NY Style deli is so far superior.", "author": "Beth G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-10-31", "description": "The food is wonderful. The service is very odd. They just don't get hospitality. Staff made us wait outside when they opened late one morning, despite clearly having the room ready for us to sit inside and stay warm. (Or offer us a coffee on the sidewalk...) You can't phone in a to-go order--you have to place in person. Why no hospitality?", "author": "Josh S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-06", "description": "I've known of this place for years but until today had only enjoyed a quick bagel from their walk-up window. However, with the chill of Autumn in the air I decided to treat myself to a sit down lunch in their original Boerum Hill location.\nFiguring I'd skip the famous poutine this time I instead opted for the Reuben (with pastrami of course though there is a smoked turkey option). I also decided to make it a deluxe which adds a pickle, some red cabbage slaw, and some fries. Got a Dr. Brown's Cel-Ray soda to wash it down!\nThe Reuben was flat-out delicious, with homemade Russian dressing was of the 1,000 Island variety and had sizable pickle pieces in it; more diced than almost-minced like usual. It was served on pumpernickel bread which seemed dense enough to address my typical complaint that a warm and moist sandwich always goes right through the bread; this beauty held fast and was mighty satisfying. No it's not as cartoonishly gargantuan as some of the touristy Manhattan \"delis\", but it was plenty big and nicely balanced.\nThe pickle was snappy and the slaw very good. The fries seemed homemade and were probably great when fresh but mine were a might hard in a \"fried a little while ago\" way and not in a \"fried just a few extra seconds for delicious crunch\" way. You know what though? If the rest of the food in front of me wasn't so stellar I wouldn't harsh on those fries. 2.5 star fries in a 4.5 star joint is 100% acceptable in my book (I ate them all so what am I really taking about?). \n\nMile End has what you want on a blustery day people; go get some!", "author": "National H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-05-09", "description": "So this is serving as an update. Before you read any further, check the calendar and if it is Tuesday night you need to log off your computer and put your name on the seating list for Mile End's Burger Night. I have been meaning to try this for a few weeks now, especially after I noticed it being mentioned in New York Magazines \"Approval Matrix\" (it was both Brilliant and Highbrow!). \n\nFor $19, you get a side of poutine (which has amazing gravy), a choice of a Labatt Blue, Wine, or soda, and, perhaps, the best burger of your life. This was a thick patty which was cooked to perfection, seasoned exceptionally well (I can still taste the kosher salt), and served with no frills, just cheese, pickles, and a few onions. What so many places don't get is that you don't need all the extra junk on top (carmelized onions, avocados, sauteed mushrooms, etc) to make an excellent burger. Sure all those things are good and should serve to enhance the meat but they should not be there to distract from it. Mile End executes this dish to perfection and it serves to highlight the fact that when it comes to meat, these place knows what they're doing. \n\nI can only hope that they sell these burger patties at their new production shop in Red Hook because only being able to have this once a week may kill me....if all the red meat I am about to consume doesn't first.", "author": "Troy K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-01-11", "description": "It is just ok, more quality, less quantity would be a step in the right direction. The poutine is not a poutine. The staff is friendly with too much confidence, it's just not that great, people.", "author": "Lars H."}], "servesCuisine": "Delis", "priceRange": "$11-30", "name": "Mile End Delicatessen Brooklyn", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "97A Hoyt St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/jL2-f-hVAwkXx5vELTD0RQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188527510"}