{"aggregateRating": {"reviewCount": 747, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-01-02", "description": "Came here for lunch with a friend and was disappointed by the smoked meat sandwich. It was a bit dry, tough and too salty. We also had the roast beef sandwich, which was good. However, the poutine was fantastic! I would recommend coming here just for yummy poutine.", "author": "Jess W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-16", "description": "The food here is very fresh and tasty, but pretty expensive, for what you get. Case in point -- our order consisted of 1 sandwich each, poutine, and 1 alcoholic beverage each, and our tab was around $80 -- Manhattan prices in Brooklyn.  The atmosphere is a little on the \"hipster\" side for my tastes, but the food really is what makes checking this place out worth it!", "author": "Susie T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-28", "description": "smoked meat in a burger? two of my favorite things? what's there not to like?  \n\nour service was fine. so it must be a hit or miss looking at the reviews.\n\nsmall place with some communal seating.", "author": "Minh L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-08-28", "description": "Highly over-rated.  Went last night with my boyfriend after reading all the raves.  It was meh and overpriced.  I mean not bad - but the portions were all measly for the prices.  $13 for a Reuben and all you got was the Reuben (and extra $4 for potato salad).  It was good as was my boyfriends smoked meat sandwich - but there are so much better delis with reasonable portions and prices in this city.  Hipster version of a decent deli.", "author": "Joe F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-03-27", "description": "I went to a beer tasting event to benefit animals last night at the Bell House where Mile End had provided their famous brisket. \n\nI don't recall ever having brisket before, but I think that if it were as good as Mile End, I would've remembered. They served it in thin slices on top of a little round of baguette with a smear of mustard. I CAN'T EVEN BEGIN TO DESCRIBE HOW GOOD THE MEAT WAS!!! It had just the right amount of fat, and had a wonderful flavor. I heard one of the women say that they cured the meat for 12 days!! It didn't come apart when I chewed (unless it was fatty), but it didn't put up a good fight either. \n\nI doubt I'll ever be around this neighborhood, but I would probably go out of my way just to try it again. And definitely, hands down, best brisket I've ever had.", "author": "Amanda C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-04-30", "description": "A perfect restaurant for your new Brooklyn. \nOver rated, over priced, and dripping with condescension. \nBut the design is great! \nI've had breakfast, lunch, and dinner at Mile End -- each time hoping to have a more positive experience than the last time, without luck. \nThe staple smoked meat sandwhich is unremarkable aside from the price. Not bad as it's fresh smoked meat on rye and that's why you ordered it, but you're not going to say,'man, that was great!' You're just going to be hungry after eating it. \nThe fried artichokes are a failed experiment. \nThe smoked meat hash is passable and more often than not skimps on the smoked meat.\nOn the service side, people here just seem generally unfriendly -- have been since the place opened. \nTip: For brunch, call ahead every time and see if they've run out of anything. Often the smoked meat hash disappears.", "author": "Mat H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-23", "description": "First heard about Mile End on the Food Network program Meat and Potatoes and immediately thought I had to give them a try.  I was in the area to pickup some Thanksgiving pie from Four \u0026 Twenty Blackbirds which turned out to be a disappointing story for another time.  The \"deli\", it's not really a deli as I know one is tucked away just off Atlantic Ave near downtown Brooklyn.  It's very small.  The restaurant consists of a breakfast counter facing the open kitchen and only 3 finished wood picnic tables and another tiny table for 2 up against the front window.\n\nI came for lunch by myself exactly at noon because their website states they only serve smoked meats after noon.  I waited for a couple of minutes to sit as the tiny establishment had no open seats.  A picnic table opened up and I was sat with a total stranger who walked in about the same time as me.  I was fine with that.  The guy was chill, I just wanted to eat what I had previously watched on tv.  I felt bad for our waitress, she was very pleasant but I wouldn't want her job.  It seems very stressful because there is always a wait.\n\nI started with a bottle of Virgil's Root Beer ($2.50) which was very refreshing.  They also serve glasses of tap water.  I went with the smoked meat sandwich ($9) and a side order of smoked meat poutine ($11).  At first I thought maybe it was an overkill of smoked meat, but once everything was brought to the table I was happy with the decision.\n\nThink pastrami and the smoked meat sandwich is Montreal's version, just not as fatty and stringy.  It came stacked high and slathered in mustard on rye bread.  I thought the meat would have had a little more of a smokey flavor to be honest.  It was tasty, but seemed to have just a hint of smoke flavor.  You could see the smokiness on the tips as the color was darker on the edges than the rest of the pinkish beef brisket.  The rye bread fell apart which disappointed both myself and the dude I was sitting with. \n\nNow the poutine was ridiculous.  That was a meal by itself.  Think cheese fries with gravy and the Canadians take it to a whole new level, eh?  The fries were crispy and didn't seem frozen.  The gravy was oozing with flavor and the cheese curds were slightly melted, but still held their shape and smooth squeaky texture.  All of this was topped with smoked meat which was burnt ends from the brisket chopped up in pieces.  This particular part of the meat had the smokiness I was looking for.  It's a heart attack on a plate, but oh so delicous.  One disclaimer about the poutine, it's VERY SALTY.\n\nIt's not cheap for lunch, but if you compare it to the Carnegie Deli, then it's a bargain.  My bill with tip was $30 for one.  Pickles and cole slaw are a la carte, I didn't have room or money to try either, hopefully next time.  Be prepared to wait outside.  When I left about 12:45 there was a gathering waiting for a table and this was on a Tuesday.\n\nMake sure you order the poutine!!!!", "author": "Mike D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-07-03", "description": "Okay so I order a LOT of delivery and almost never write reviews on them because I think most of the delivery reviews on here are written by complete morons but this time I just had to.  Hands down, the worst smoked meat I've ever had in my life.  I don't mind spending money on great food, so despite the $15 price tag I was like \"what the hell, at least it'll be delicious.\"  Could not be further from the truth.  Dry, bland, barely any mustard, really an awful sandwich.  Also the sour pickle was even pathetic.  Why cut 1 pickle into eight limp strips, what NY Deli would ever sacrifice a poor little pickle in that fashion?  The place should be closed down based on the pickle abuse by itself.  Cole slaw was edible, but not recommended.  I hate this place.", "author": "Pete L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-05-04", "description": "Forty minute wait, after being told it would be fifteen minutes.  Host let friends sit who were obviously waiting less time than others. $15 hamburger was just a hamburger, nothing special. The Montreal style smoked meat flavor did not carry through, just an overpriced burger with an egg on top. My wife's roast beef sandwich was disgusting and $14!!!!!!!. Host and staff were apathetic, in an ironic hipster kind of way. The arrogance of this kind of restaurant will be its downfall, being trendy will soon wear off and no one will be interested.", "author": "Jonathan F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-08-26", "description": "Food is very good, however every time I come here the service absolutely blows! Long waits to get your order taken and even longer waits for food. I recommend doing takeout", "author": "Elliot R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-04-26", "description": "The owner of this establishment emailed me to tell me my life was pathetic for writing this review.", "author": "A.R. G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-07-29", "description": "Went there last Wednesday. Had the meat combo. It was just alright. For $36 it was really not worth it. And the portion was small for the price.", "author": "Ken B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-21", "description": "I had a little taste of it from a Ramen shop that claim they use pastrami from Mile End as one of their toppings, and I had to come here to get the full on experience.  The smoked meat here was truly amazing.  My hanger steak was also cooked to perfection, each bite was tender and filled with flavor.  Restaurant was crowded but the tables were spaciously set.  I must come back and eat again....and again!", "author": "Juan J."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-06-24", "description": "This is one of my most favorite local places. The food is beyond excellent. However, I am writing this review because our service today for lunch was terrible. The host who was also the server at this tiny little restaurant was awful. \n\nThe waitstaff and host at any establishment should never made the customers feel like they are in his way or bothering him. My dining companion and I felt like when we ordered we needed to apologize to him for him having to take our order. And this was after we felt like he acted as if it was a burden to seat us when the place wasn't even full. Instead of welcoming he made us feel badly for choosing to eat there. \n\nWhile we enjoyed our food tremendously I would think twice again about going back if I saw him inside.", "author": "Paul H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-11", "description": "Traditional NYC Jewish deli, but with a strong Montreal twist. \n\nA must stop in Brooklyn. Their poutine is excellent, and their deli, specifically their pastrami, is bar none. What makes them stand out from the litany of other New York Deli's is the flavor of their menu. Almost everything has a unique and distinct twist. For example: they make the BEST chopped liver, garnished with sweet onion relish. Very different from any other liver I've ever had. Very tasty. Their pickles are the best in Brooklyn. You won't leave without eating four of them guaranteed. I've been many times since they opened, and it has been a great experience every time. Have brought countless family and friends, all to glowing reviews. \n\nThe place is small and usually busy, you may have to wait for a table, but trust me, totally worth your time. If it's your first time GET THE POUTINE!", "author": "Desmond E."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-09-29", "description": "After seeing Mile End on the Food Network, we were nearby around lunch time so decided to check it out. What a cute little place! With only a few tables and some counter space, it's a cozy spot. There is even a walk-up window for take-out,. \n\nLet me start by saying that I've had the Montreal smoked meat....I've been to Schwartz's, which is amazing. With that said, we ordered a couple of smoked meat sandwiches, a pickle and some coleslaw. \n\nThe sandwiches, while not huge, were very filling. The bread was very fresh with the right amount of chewiness. The meat was extremely tender, you can tell that they work very hard to make their brisket. \n\nThe coleslaw, used red cabbage and was vinegar based vs. the more popular mayo based coleslaw. It was different, but pretty good. \n\nThe pickle, wasn't crispy, which is how I like them, and was very acidic. Not necessarily a bad thing, but the flavor profile just wasn't for me. \n\nWhile we enjoyed our lunch, I just wasn't blown away like I thought I would be, but then again I was spoiled forever by Schwartz's..", "author": "Krista M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-01-26", "description": "Is there enough room in town for another Jewish deli? \n\nHell yes! Especially if it's pumping out Montreal smoked meat as its raison d'etre. NO, Montreal smoked meat is not another moniker for some Quebecois skin flick*, rather it's a method for curing meat similar to pastrami. Both are food products consisting of briskets slathered in a selection of spices which infuse the meat during its curing and smoking stages. The end result of both methods differs slightly, though for me MSM has always been the smokier, more flavorful of the two. Montreal smoked meat has always found a way into my heart be it my grandma throwing chunks of Lester's smoked cuts into her congee or regular stops at Schwartz's, Dunn's and Caplansky's over the years. \n\nSo when I heard that Mile End was bringing MSM onto the NYC deli scene, I vowed to make a visit as soon as it opened. Rushing down Hoyt street yesterday in the rain, I arrived to a bustling crowd inside the modernist deli decorated with reclaimed bowling lane lumber and black bar stools. \n\nOne customer is wearing a Boom Boom Geoffrion jersey.\nA kitchen aide is wearing a Quebec Nordiques t-shirt.\nThe washroom features vintage photos of Les Glorieux from the 40's and 50's.....I am in heaven already without taking a bite!\n\n I take a smoked meat sandwich, a regular poutine and a black cherry cola. The sandwich is small to begin with and for $8 you think they could throw in a pickle on the side. However, the texture is on point. It is hand carved as tradition dictates and it is deliciously tender and juicy.  There is a sufficient amount of spice and smoke present in the meat but it might have benefited from a longer curing period as it was lacking a certain punchy bite. Another visit produces a sandwich that ressembles sawdust in texture. Since the production of Montreal Smoked Meat is a tricky art, I'm convinced that Mile End's version is a work in progress that will continue to evolve for the better. I'm also with Jeremy S. in longing for a spicier mustard. The house whole grain mustard gives a nice crunch but is a little sweet for the meat.\n\nNow the poutine ($8) was a gut-buster in its own right but lacked enough hot gravy to produce the requisite synergy between curds and sauce that a fantastic poutine deserves. While the gravy was creamy and flavorful, it was not hot enough to allow the curds to melt even if ever so slightly. More hot gravy please. The fries by themselves were good-hot, crispy and hand-cut. \n\nBut I'm kvetching too much. This place has been open for all of what, five minutes and there is enough enthusiasm and dedication in the kitchen staff to improve upon the missteps. They also have montreal bagels in the style of the famed St. Viateur's. Chewy and sweet, these babies will  surely satiate my cravings instead of New York's puffy abominations. \n\n*-attributed to a patron of Katz's in a Cdn newspaper article when asked about MSM, wiseguy eh?", "author": "Deanna W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-06", "description": "Can't really beat around the bush with this place.  After hearing all the talk about this site and seeing it on the Food Network I had to try it and of course being of Jewish decent it would be a crime if I didn't!\n\nWent for lunch on a Wednesday and it was packed! That isn't hard though because the place is extremely small!! About 5-6 counter seats and 3 - 4 tables so if you plan on eating there I would arrive earlier in expectation of not being able to get a table right away. \n\nThis Quebec Jewish Deli really lives up to its expectations.  I had the smoked brisket sandwich, which of course was beyond stuffed with nice, smoky, hot brisket and to top if f the classic spicy mustard spread on two great pieces of Rye bread..it's a crime to get it on anything else.  A side of cabbage and a pickle and I was in heaven. If you have been to Katz's, 2nd Ave Deli, etc you will not be let down!  Everything was delicious and you can count on me being there again!", "author": "marc s."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-05-01", "description": "5th time is not the charm. Very disappointed . Looks like their focus is more on the other new restaurants . Last  4 times visiting they serve the Smoked Meat Sandwich on Rye without mustard. This time mustard was put on the sandwich. Lots of it. I think it was an attempt to disguise the incredibly dry meat.  Boo dry meat. Like they gave us the leftovers from lunch. Rye bread was not even fresh.", "author": "Pablo G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-11", "description": "If Mile End Deli could bottle the smoked meat aroma that smacks your nose when you enter, I'd buy it and dabble it behind my ears every day.  I have no shame in saying that I don't mind smelling like meat.  The aroma is so intoxicating, it practically works like a pheromone.  \n\nThe brunch menu items were all appetizing, but when you read the reviews, what others have to say about their specialty, and the said aroma,  then you have to get the meat sandwich.  No questions asked.\n\nMile End is a small but neat space,  With bench seating, you're not meant to stick around for very long, but that's ok.  When my $12 smoked meat sandwich came I was a bit disappointed with its puny size.  It was piled decently with thick slices of brisket, but the toasted rye slices were little ovals not much bigger than the size of a fist.  \n\nBut after my first bite, all was forgiven.  According to our host, the meats are cured with a dry rub and then smoked.  It made for a very lean, almost dry meat with a subtly smoky, spicy, barbecue taste.   Impressive was how the meat was tender if dry, but packed with flavor without ever being overpowering or too much.  I gobbled it down and enjoyed every bite.  I also tried some french fries which were a crispy revelation.  Fast food chains need to know how to make French Fries like this because they were perfect in texture, crispiness and salt.\n\nExpensive?  Yes.  $12 for a modestly sized sandwich sounds like a rip off, but when it's this good go ahead and treat yourself once in a while.", "author": "Jack A."}], "servesCuisine": "Delis", "priceRange": "$11-30", "name": "Mile End Delicatessen Brooklyn", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "97A Hoyt St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/jL2-f-hVAwkXx5vELTD0RQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188527510"}