{"aggregateRating": {"reviewCount": 747, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-02-26", "description": "This place closes for private parties. Hours are unreliable. Looked lousy from the outside anyway.", "author": "Douglas M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-03-02", "description": "I am from Montreal.  I have lived my entire life celebrating the special qualities of Smoked Meat as it is known only in my hometown.  After reading the reviews of Mile End, I had never been so excited!  Finally, my dream come true - Montreal Smoked Meat, right here in metro New York.\n\nWhat a disappointment!  The meat didn't even come close to resembling what I know and love and grew up with.  It was tough, with pieces neither I nor my wife nor my children could even digest.  It was also strangely bitter, and possessed of a bizarre \"smoky\" taste.  Now, you may find that odd, considering that it's called \"smoked meat\".  But this smoky taste was quite utterly dissimilar to anything I've ever had before.\n\nThe product was entirely, and dramatically inferior to any smoked meat sandwich i have ever had!   And I've eaten hundreds of them at all the delis in Montreal famed for that.\n\nNow, i could understand how a New Yorker could think they were getting the real deal - not knowing better - but even then, the meat would be found to be tough and overly fatty -- a huge letdown.\n\nAnother big disappointment - the Poutine.  Again, same story.  It just isn't done that way in Quebec.  \n\nKudos the effort, and for the excellent french fries.   And special mention for the fabulous baked goods which were a delicious treat.\n\nBut I heartily recommend that the owner of Mile End invest new, serious energy in improving his product and reconciling the very significant and bothersome differences between the meat to which he owes allegiance and that which he is serving.", "author": "Gary K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-29", "description": "Really good smoked meat sandwiches. You will get full after chowing down on one of these bad boys. Brunch on the weekends do get packed but they have a convenient take away window.", "author": "Leonard S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-28", "description": "Dinner was creative and great.  Atmosphere a bit cramped, but the food did not disappoint at all.\n\nWe used to live in the Mile End (Montreal), it's one of my favorite neighborhoods anywhere.  This place doesn't have too much to do with its namesake at all (except insofar as it features Montreal smoked meat).  However, what we had there was a very nice and subtle mix of Asian and western meat-based food; the style of food really is what Talde should have been but isn't.\n\nI have to say I was skeptical given some of the hype and the fact that I'm not a huge smoked meat fan, but I was not disappointed.", "author": "Cabalistic A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-05", "description": "Cute little place with good service. The beef brisket sandwich is good and juicy. It comes with fries and if u add like a few bucks, you get the poutine instead of the reg fries.", "author": "Elizabeth N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-19", "description": "Great food and service that's friendly and genuine. The smoked meat is amazing and can't be beat! Awesome beer list too!", "author": "Enoch M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-03-21", "description": "There are two factors that hurt this place hype and price.  I actually came in expecting to be a little dissapointed,  seems to be that way with most places that have had a food network show do a bit about them.\n\nExpect there to be a wait.  It was one hour, late on a Sunday afternoon.  The place is small and the tables are communal.  The waitress was friendly and the food came out quick.  Now the rundown.\n\nThe beauty- the slight twist on the classic lox n cream cheese is their montreal bagel.  Smaller and firmer then a standard bagel.  I was shocked at how small this sandwich was.  Is this what they feed the regular bagels?  The smoked salmon was excellent and the sandwich was good but I'm a big boy and id need 3 of these to fulfill my hunger.\nRuth wilensky- this sandwich was like number 7 on grubstreets list of 101 best sandwiches.  Its good but once again tiny and really needed more salami on it.  The mustard was tasty and the nice buttery onion roll was excellent.\nPoutine- excellent and very addicitve and a nice portion to boot.  I could eat this often and get fat and sloppy with a smile.\n\nI could see how this place could be hated on but overall its pretty good.  If your in the neighboorhood id say go for it but probably not worth a hike.", "author": "John C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-31", "description": "Generous portion of order of Poutine and the fries held up to the gravy and cheese curds. Yum.  As for the smoked meat sandwich, think the spices (is it caraway seeds?) is too pungent and leaves a strong flavoring to the meat which I do not enjoy.  The meat, however, is tender, moist and cooked perfectly.  Since it's Montreal's version of pastrami I won't compare it to the other NY institutions that service this Jewish delicacy, I\"ll just wait for a trip up North and to the likes to Swartz before I cast my final verdict.", "author": "Angela N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-25", "description": "okay so first i went into the game with little \"yelpers\" two sense in the back of my mind. Not knowing what to expect of the raved about \"poutine\"...the thought of fries covered in gravy with curds of cheese didn't sound all that appeling. Not until I took my first bite of the crunchy gooey hot mess did the general \"make a man out of me\". The flavors all really complemented eachother and the act of stuffing a gooey dripping mess into your face has never been more satasfying. YOU HAVE TO TRY THE SMOKED MEAT SANDWICH. This is a declaration that I am willing to sign. And if you have any left over fries with gravy, dont let it go to waste. Stuff it into your sandwich  and then into your face before it falls all over the place. To say Miles End  was amazing is an understatement. \nBravo", "author": "Carrie S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-03-05", "description": "I had a small sandwich with nothing in the plate but meat and bread and it cost me $12... why?\n\nThe meat was good (I had the smoked meat sandwich) and the bread was all right, not worth $12.. will probably not go back again :s\n\nI did see people order the meat poutine... it looked really good.. so if I do go I am skipping the sandwich and having the poutine instead!", "author": "Sera A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-02-06", "description": "I found this place at exactly the right time--I'd just gotten back from a weekend in Montreal, the taste of their bagels and poutine still in a tasty wedge between my teeth.\n\nThe wait can be up to a half hour if you're eating with company, but they have a bar for single diners if you're self-conscious about your friends knowing you lick plates in public places.\n\nThey have an order called The Beauty, and it really is just that.  Cream cheese, lox, capers, and red onion, on an imported Montreal-style bagel.    The bagel--smaller, denser, sweet, and sesame'd--pairs wonderfully with the salty lox and capers.  Prepare to spend a few moments chewing with your eyes closed, nodding in a trance.\n\nAnd I feel like I'm insulting an entire city when I say this, but... the BEST poutine I've ever had is from Mile End.  Ahhh!  Admittedly, I didn't get a chance to go to the best poutine spot while in Montreal, but for a simple dish of fries, gravy, and cheese, these guys elevate the taste so that it demands to be savored, not merely treated as 4 AM drunk food.  The dish is typically mozzarella cheese and turkey gravy; Mile End gives it flair by using mushroom gravy and melt-as-you-go cheese curds, and their wildly popular smoked brisket.  Your blissful tears will taste extra salty when you've mopped the remaining gravy with that last fry...", "author": "Sei S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-11-24", "description": "I've never had Montreal smoked meat before but my Canadian friends were jonesing for it and I thought it sounded interesting, so off to Brooklyn we go.\n\nWe ordered a little bit of everything - smoked meat platter, the regular poutine, the smoked meat poutine, the hash, latke...\n\nThe food was good.  No doubt about it.  But I'm not sure what makes smoked meat different than pastrami.  Maybe I need a side by side tasting to tell the difference.  Whatever the difference is, I think it's probably subtle.  \n\nThat doesn't change the fact that the food was good.", "author": "Larry L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2010-11-05", "description": "I dig small restaurants, but opening a restaurant the size of my closet is not such a brilliant idea.  Maybe they should focus on just take out because it seems busy in there, but in reality it's only because its tiny.\n\nanyway, i make bigger sandwiches in my own apartment.  i guess their theme here is \"small\" all around.  The poutine was a soggy mess.  I couldn't eat it after 2 minutes.  And i waited for it not to be piping hot, didn't even get to try it when it might have actually been tasty.\n\ni just feel like the place is trying way too hard.  How is it sustainable to ship in bagels from canada.  they say everything is local, but i think the waste of fuel bringing bagels to NYC, where the bagels here are amazing is foolish.  oh well.  i think i'll stick to my grandmother's matzo ball soup and brisket.  thanks!", "author": "Jerry R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-28", "description": "Mile End has the very best menu selection. My wife and I had the Ruth Wilensky sandwich for lunch - beef salami, mustard on onion roll. Ooh so good. And then took with me for my Amtrak back to Ellicott City, Maryland an outstanding smoked brisket on rye and an order of chopped liver. \nThanks to an article in the Washington Post, we now have a new favorite place to eat when visiting my Mom.", "author": "Tony G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-11", "description": "As a daughter of authentic New York Jews, I probably shouldn't be admitting this: this is not your father or grandfather's deli (eg, Katz's, etc.) Everything from the pickles to the Montreal-style bagels is so tasty. Notable mention to the amazing cinnamon bun, bagel and schmear, poutine, pickles, Stumptown coffee. My husband and brother-in-law (who dreams about it in Los Angeles) both swear by the Ruth Wilensky sandwich. Too bad it's such a tight space, but I have enjoyed the food each time I've been here.", "author": "Jen O."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-11-01", "description": "I had the Ruth when it first opened and it was B+.  Good flavour, but a small sandwich.  I was pissed as they don't do decaf coffee (why not?!) and I was pregnant so couldn't get a hot drink - like the server cared!\n\nWent again today to try again and whilst it was packed, I can see no good reason for running out of turkey when you only serve 3 things at lunch!  Had another Ruth and it was tough as old boots.  I'm sitting here picking the bits I can eat.\n\nWaste of $9+.  Yup. $9 for a sandwich the size of my fist. Go to Hancos or Flying Saucer and get a real sandwich.", "author": "A Brit In Brookly N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-12-01", "description": "Excellent food. \n\nThe smoked meat is better than actual smoked meat from Schwartz's in Montreal. \n\nThe place is kind of small but I think it adds to the charm of the restaurant.", "author": "Matthew S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-18", "description": "Had the smoked meat poutine.  The fries and gravy were good, but here is where most American poutine goes wrong: the cheese curds are too soft.  They should squeak when you bite into them.  While Mile End's wasnt as bad as Pomme Frites (who uses chunks of mozzarella, I'm pretty sure), it was still a little too soft.  The smoked meat was decent, but they gave us too many hard burnt pieces.", "author": "Jessica A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-14", "description": "Had the smoked beef hash 3rd time today ,each time different good each time but different . Bigger meat, smaller meat ,dill, no dill ,chives,", "author": "Larry K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-03", "description": "I really, really love this place. When Mile End first opened, it was hardly more than an afternoon shack offering freshly trucked-in bagels from St-Viateur (I've been obsessed ever since my last trip to Montreal) and house-smoked meat. Since then, Mile End has expanded its hours and menu to include all meals, and I love it more than ever. Granted, the smoked meat can't compare to Schwartz's in Montreal, but the poutine here is way better than anything I've experienced in Canada.\n\nBut there's more! Joan Nathan, the doyenne of Jewish cooking, is right to be so ecstatic about Mile End: aside from their famous staples, they also serve unbelievably tasty renditions of Ashkenazi standards. You'd be a fool not to augment your order with some of the more eclectic sides. Hot tip: if you see \"schmaltz\" anywhere on the menu, order it. You've just bought yourself a one-way ticket to rendered chicken fat heaven (aw yeah).", "author": "Pamela B."}], "servesCuisine": "Delis", "priceRange": "$11-30", "name": "Mile End Delicatessen Brooklyn", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "97A Hoyt St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/jL2-f-hVAwkXx5vELTD0RQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188527510"}