{"aggregateRating": {"reviewCount": 747, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-11", "description": "To be honest, Mile End has one of the best white fish salads I have ever ate. LOVE IT. My lover and I came in for a late brunch, she ordered the brisket, which I also thought was great. Waited a little bit for a table, its pretty small, but worth the wait.", "author": "Bianca M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-05-03", "description": "Mile End Smoked meat kills any ol' stanky pastrami in NY", "author": "Charles B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-25", "description": "The smoked meat is fantastic try the smoked meet burger too. The putine is classic. I only wish you had more seating. We would be there all the time. These guys do good work!", "author": "Alexis M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-12-12", "description": "The smoked meat sandwich was delicious but way overpriced. I went for lunch with a friend and lunch for two was $50 + $10 tip = $60 - two deluxe sandwiches which included small plate of coleslaw and few frites and one beer. Very skimpy. Won't be seeing me again!", "author": "roseann t."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-01", "description": "i've been here a few times, and it never disappoints... \n\nthe smoked meat sandwich has probably the best brisket i've ever had.  \n\nthe only regret is that the fried baby artichokes we ordered were really small and at $9 we felt that it was overpriced.  \n\noh yeah, the pickle was super sour but very tasty and the fries were de-li-cious!\n\nthe decor here is super tiny and super cute.  love the vibe and the service is always attentive and friendly.  the open kitchen allows you to see what lovely creations are being made.", "author": "Cherie L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-10-05", "description": "A very special meal.  Good coffee, good meat, good bagels - I wish this were in Boston.", "author": "Andrew R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-19", "description": "Went quite awhile ago (more than a year) and just doing the review now. I went here when I wasn't too hungry so didn't get the meat platters that everyone gets here. I noticed they had matzah ball soup which sounded about right for my appetite. I noticed the price and gasped; soup just should not be that expensive. Ordered it anyway. A medium bowl of soup arrived and now I am even more skeptical. Damn. It was almost as good as my mother's.", "author": "Jill N."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-11-11", "description": "After seeing a number of their sandwiches on a top 100 list for the City it was a must try.  \n\nWent during lunch and tried a number of sandwiches: Beef on Weck, Grandpa, Ruth Wilensky, and smoked meat sandwich.  All were tasty with the beef on weck probably being my favorite.  Nothing blew me away.\n\nWhat was good was the smoked meat poutine!  That ish was bangin son and the highlight of the meal!", "author": "Dan M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-02-28", "description": "I'd like to be able to rate Mile End but I can't.  My friend and I went last Saturday wanting to try their smoked meat.  We were quoted a wait time of one hour.  Rather than wait, we figured we'd get 2 sandwiches as take out.\n\nNope.  They claimed the smoked meat was in short supply and they were saving it for eat-in customers.\n\nWho of course weren't there yet and didn't have reservations anyway.\n\nI can't say anything about the smoked meat but I can give them an A for Attitude.  Or maybe that should be Amateurism.\n\nBTW, in a recent Eater interview the owner claimed that beginning last May their new improved production methods guaranteed that they would now have plenty of meat to go around.\n\nNot exactly.\n\nhttp://ny.eater.com/archives/2011/02/mile_ends_noah_bernamoff.php", "author": "Lex X."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-16", "description": "I had been wanting to try Mile End in Boerum Hill, Bklyn for a while.  The place bills itself as a Montreal Jewish delicatessen, and has a ton of interesting sandwiches on their menu.  Their smoked meat sandwich isn't as innovative as some of their others, but it's good enough to be ranked up there with longtime institutions like Katz's and 2nd Avenue.  The smoked meat with mustard on rye with a side of slaw and pickles isn't a towering sandwich like at Katz's, but the meat is thick-cut with enough flavor and fatty edges to make me go back for more.  The rye bread is thick enough too, unlike sometimes at 2nd Avenue, and holds the meat well without the sandwich falling apart.  If you go, definitely get the poutine - delicious and not greasy fries with gravy and melting lumps of cheese.  As I type this, I definitely wish I was eating more right now.\n\nhttp://sandwichguynyc.blogspot.com/", "author": "Lee G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-03-22", "description": "Two words, over rated.  The food was fine, and maybe better than fine.  The portions for what they were charging was really ridiculous.  I had the steam meat, and poutine (fries and gravy with cheese bits) the food was good, but $ 30 for that is criminal.  Li know in Jersey you can get a better plate of fries and gravy for have the price and twice as much.  The portions were just too small for what they charge.  I thought they would stack the meat like Katz 's deli.  Don't call me a cheap,bastard, as I am happy to pay up for a meal. I just did not think they gave you such a good value, and it was not worth the hype", "author": "Brian W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-09-03", "description": "Awful, too salty...don't know what the hype is ...uncomfortable seats, no air , warm water and all the bread has tons of caraway seeds. The staff was nice but the food was terrible.", "author": "Arlene B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-03-04", "description": "Just another \"hipster\" cafe in this ever gentrifying neighborhood.\nFood that \"sounds good\" on the menu-I can't even get into how idiotic\nit is. Reality is more like overpriced tiny fatty cubes of low grade corned\nbeef-the Bodega around the corner offers better at 1/4 the price.\nMore proof (and its all over this hood) that the young foolish yuppsters\nthat are moving here wouldn't know good food if it hit them in the a**.\nRead review by Gary K from Montreal for the word.", "author": "Brian M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-04-21", "description": "After seeing it listed in \"Hot on Yelp\", I figured I should probably visit this place.  And BTW, the list mostly includes Manattan hunts, so when I saw a place in Brooklyn that made it on the list, I was ecstatic.  It was around noon on a weekday when I decided to give this place a try.  Now please leave your car at home.  It took me over half hour to find a parking spot.  This stretch of Atlantic Ave is a nightmare. In any case, I finally scored a spot pretty close, half a block away. Sweet!  I walk in around 12:30PM and the place is full of diners. That is a good omen. You have a good mix of people in here:  hipsters, office people, BoCoCa residents.  I was lucky to get a seat right away.  The place is small, and probably at max can seat 20 people.  I like that the kitchen is open and you can sit at the counter and watch the staff make the food.  There was a guy behind the counter attentively slicing the smoked meat.  When he looked up and saw me watching him, he smiled. Made me feel like he enjoyed his job.  Service was on the slow side despite it not being completely full.  It took awhile for the waitress to take my order.  There are not too many items on the menu (so no choice paradox).  Some of the popular items included borscht ($5), smoked meat sandwich ($8), poutine ($8) and Virgil's soda ($2.50).  Now for $8, the smoked meat sandwich is small.  It was moist with a slight smoky flavour.  Almost tasted like pastrami to me.  The poutine was nicely done.  The gravy not too salty, with just the right amout of cheese curds.  Too bad the gravy wasn't piping hot to melt the curds. Oh well, you can't have everything good in life right?  Although the experience was enjoyable, nevertheless, the economy is still recuperating, and given the steep prices here, I may have to pass on smoked meats, even if they hail from far away Montreal!", "author": "Vivian H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-22", "description": "I love this place! Best Open-Faced Lox Bagel in Boerum/Cobble Hill. The meats, in general, are amazing. The space is super small so be prepared to wait for a seat - Don't fret, it's worth it.", "author": "Chaley S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-15", "description": "This place is amazing! First time I was there 2 weeks after it opened, and was so pleased. I go to Montreal quite often, and love the food scene there. It's great to be able to have some good poutine here, in Brooklyn. \nI've gone to Mile End many many times since, and it surprises me every time. I've been there for brunch, lunch, and dinner. The chef manages to marry the memories of the dishes my grandmother used to make with contemporary twists (radish and gerkins salad was served with watermelon radishes instead of regular daikon).\nI love sitting by the kitchen, and watch the cooks work. \nI've brought many of my friends there, and I'm sure will be bringing more.\nBravo!", "author": "Genia W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-11-14", "description": "I only had the poutine with smoked meat. The meat seemed as good as Katz's both very tender and flavorful (both overly salty in my opinion). The gravy is good (but how do you mess up gravy). The cheese was fresh tasting and the fries were crispy and well seasoned. The Problem... the combination was not delicious, it sounds like it should be, but it wasn't. I guess I am not a poutine man. \n\nI am going to go back and try the bagels soon. I'll let you know. \n\nThe resturaunt while busy had a nice vibe. I really wish the review could have been better.", "author": "Sunjeet M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-20", "description": "Had the veggies- very good, lots of flavor. Heirloom carrots were my favorite.", "author": "Dinky B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2010-05-14", "description": "Let me start with a few disclaimers: 1) I don't usually write restaurant reviews, 2) I've been to Montreal on several occasions, each of which culminated in at least 2-3 fabulous 'smoked meats' experiences, 3) I really, really, really wanted to love Mile End. But I didn't.\n\nLocation: Visited Mile End today of all days because it was early and I could actually find parking, which is a miracle in Boerum Hill on a Friday. The place is tiny and has 1 window booth and 3 communal tables, as well as bar seating near the cash register. I made the mistake of sitting at one of the communal tables because the place was empty at the time, but I soon moved (of my own accord, sort of) because the server seated a party of 6 (including 2 toddlers) at the table with me, instructing them that I would be leaving by 12:30. WTH? I *don't* love being literally squeezed into a corner by other people's children (the table could seat a max of 6 people, not 7), so I moved to a bar seat, tired of being kicked repeatedly by the 4 year old...\n\nFood: Oh, boy. I wanted it to be good, but it just wasn't. The $8 small sandwich was just that...small, almost snack-sized, really. The meat varied between outright cold and barely lukewarm. This pissed me off, because I waited a good half hour for the 'meat to get ready' as my server put it. They don't serve the meat until noon, because they have to steam it for some time, so naturally, I expected a hot, or at least reasonably warm, sandwich. Aside from the disappointing temperature, it was waaaaay too salty. Now, I like salt; I'd put salt on vanilla ice cream if it were socially acceptable; but this was like eating a salt lick, no exaggeration. And it was actually over smoked. This was surprising, because I didn't know you could actually over-smoke a piece of meat. But they did. \n\nIt was a good thing that the sandwich was so small, because I struggled to finish it, determined that I would get my $8 worth. In the end, I just left what I couldn't eat on the plate. And drank a lot of water. It was just that salty. Another contributor to the salt factor was the thickness of the slices. They are hand cut in front of you, but are entirely too think. Maybe thinner slices, less salt, and less smoke would help this poor sandwich out. I know that at some places in Montreal, they flash steam the meat right before serving, to give it a nice moistness and to melt the fat for a nice unctuousness and mouth feel. Not so at Mile End. To top it off, my sandwich was kinda dry. I am very disappointed. \n\nThe fries were superb, however. But I didn't drive half an hour down Atlantic Avenue for french fries. I wanted a taste of Montreal in Brooklyn, which was what many of the reviews promised me. Hopefully Mile End reads these reviews and takes customer feedback into consideration to continue refining their product. Until then, I won't be back. I'd rather drive 5 hours to Montreal. Seriously.", "author": "christina r."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-04-16", "description": "Ok I feel like I gave it a fair enough shot.  But in the end, generally not good, and way overpriced. \n\nTwo stars for the smoked meat, which is pretty tasty.  Everything else sucks.\n\nBagel with creamcheese: I've been to Montreal, so I'm aware that their bagels are different--smaller, more dense, sweeter--definitely no New York bagel.  Knowing this, I ordered one anyway when I went here for breakfast with friends and wasn't too hungry.  It was SO SMALL and had the weakest smear of creamcheese I was kind of shocked.  AND it was $3.  That's borderline blasphemous in NYC.\n\nPoutine:  Typically the fries are hot and crispy on the outside, drenched in meaty gravy and smothered with cheese curds (and meat, if you choose).  The ones we had here were cold and soggy, the gravy was minimal and they make theirs from MUSHROOMS??? (which I read at the restaurant--a total travesty--to be vegetarian friendly?  You're a MEAT SHOP, get it right!)  The only decent part about it were the cheese curds and meat.  Too bad poutine is all about the gravy.  Also, a whopping $13 for the meat topped poutine.  That's like asking that much for chili cheese fries.  Fail.\n\nBrisket on Rye:  The smoked meat sandwich was actually good, but when I asked if I could get the brisket on an onion roll one time, they said \"usually yes, but not today.\"  Ok...so it was fine, but I had heard how their sandwiches were massive, like Katz's or Schwartz's (the latter famous in Montreal) but no, it was just a regular-sized sandwich.  Tasty, but not worth $8.\n\nI haven't had the turkey, salami, or brunch, but considering how everything else fared, I don't think I'll be returning, and the prices do NOT help.  \n\nThis place is always massively crowded, so if you want to eat in you're gonna wait, and they run out of smoked meat really quickly too.  I think it's just so popular due to its novelty, but that will wear out and people will realize it's not worth waiting that long for, paying that much for, and that they really don't want to eat smoked meat all the time.", "author": "b b."}], "servesCuisine": "Delis", "priceRange": "$11-30", "name": "Mile End Delicatessen Brooklyn", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "97A Hoyt St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/jL2-f-hVAwkXx5vELTD0RQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188527510"}