{"aggregateRating": {"reviewCount": 747, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-07-21", "description": "Went for poutine week and had their foie gras poutine. I can see how it's possible that their poutine could be good, but ours was not. \n\nThe gravy was too salty for my liking, but more importantly the cheese curds were not melted properly and were still cold in the middle ): The fries were very mediocre and there was not enough gravy to cover them. Also it was served on a large plate, which doesn't allow the gravy to cover everything as well\n\nAlso it was $20 for a poutine. It is a large plate, but that is still extremely expensive. \n\nOverall, would not recommend for their poutine.\n\nP.S. I'm Canadian.", "author": "Crystal L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-11-09", "description": "This isn't just your average deli...it's actually a small quaint restaurant.  We came here last night to get sandwiches to go but I think we may have missed out on the atmosphere itself because we were in and out.  It's got a bar area and about 4 tables to sit at.  \n\nI had the Reuben sandwich, deluxe, meaning it comes with fries, pickle and slaw and I added poutine to the fries.  The Reuben was good. It had the right amount of meat and sauce to it...though, you can't really go wrong with it.  My poutine was not what I expected...I would've liked more gravy and cheese curds with it.  But I guess I compromised the quality of the food by taking it to go.  The BF had smoked meat sandwich which in their description was a \"montreal style reuben\".  It was equally good and you can taste the smokey flavor but it may have been a touch too meaty (others may like that but I like having the balance).  Overall, it was good.", "author": "Marybelle P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-21", "description": "I've only had \"The Meat Sandwich\" so I can't speak on the res of the menu. \n\nIt's good, but just about any of kosher deli has better. For brisket, Mighty Quinn's is tops. \n\nThe other food I saw people eating looked great. Next time I will eat something else.", "author": "Susan S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-03-21", "description": "I loved the Montreal bagels I purchased from St. Viateur and read an article that these bagels were like or from there. I came on a Sunday a little after 4 and was told condescendingly that they were closed until 5. I returned on Tuesday to purchase bagels and was told that they only make sesame bagels. I purchased a half dozen, spent around $15 and was not impressed. It was 11:30am and the bagels seem dry and far from special. Haven't tried dinner here but don't come expecting Montreal bagels....you will be disappointed.", "author": "Alicia W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-09-22", "description": "Absolutely terrible. It took two hours to get my food. My soup and sanwhich were cold and my cold drink was warm. The sandwhich the reuben in thr pucture online looks like this big meaty sanwhich and i get it and its all sour kraut maybe one slice of meat. Not joking. The motza ball soup is also tasteless. I also asked for extra russian dressing in two different instruction setting in grub hub and of course didnt get that. Two thumbs down absolutely terrible. Never again.", "author": "Steve P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-11", "description": "I probably would have given this place 5 stars if it weren't for the high prices. Even for a small deli, this place has a lovely layout - a few high tables and a long bar right in front of the kitchen - and a friendly staff. One of my favorite parts of Mile End is that you can see the chef prepare your food right in front of you (against a 80's pop soundtrack, which never hurts). And the food, what food it is! I didn't manage to order one of their sandwiches, but their selection of pastramis, salamis, and meats is impressive. Instead, I chose the poutine with smoked meat, which was beyond decadent. Thick gravy, cheese curds, and pastrami over french fries, it was the best antidote to a winter's day. Like I mentioned earlier, this place is pricy - no way you're leaving her without paying at least $10 - but the food is filling and delicious.", "author": "Charley K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-20", "description": "LOVE MILE END!\nTheir pastrami is exquisite!\nThe $19 Tuesday night burger special is amazing!\nThe place is tiny, but I've never had a problem getting a spot.\nSo happy with this Canadian Deli!", "author": "Jojo b."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-08-15", "description": "For those that are from Montreal or are even mildly familiar with the deli from from that city - stay away, stay far away.  While some have complained about the prices here, price is not the issue.\n\nThe food just plain sucks.  Smoked meat, pulled from a steam table and hand carved should not taste like a Sorel boot.  At least they got that other Canadian export right.  Absolutely inedible, course, dry and crunchy (?) smoked meat.\n\nHorrible let down.  Live, learn, do not repeat....", "author": "Sherwin S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-07-17", "description": "Meh. Matzoh ball soup was bland and latkes over cooked. They also forgot the applesauce (which is good because I think applesauce is gross) but my boyfriend was looking forward to some a-sauce. Def overrated.", "author": "Nicole K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-06", "description": "It says something about the fickle and restlessly forward momentum that exists in New York's restaurant scene that three people can walk into Mile End on 8 pm on a Saturday and be seated without a line. This is a restaurant that still puts out some of the City's best smoked meat, paired with an increasingly gonzo and adventurous set of main dishes and small plates. \n\nIt's also the home base of an expanding empire of places whose popularity now exceeds the Mothership. (The Black Seed in Hudson Eats was completely out of bagels and shut down two hours early when I visited recently. They ran out of food, like a sushi stall in Tsujiki.)\n\nI'm so guilty of being in with this crowded. I went to Mile End three times close to its opening in 2010 and then forgot to return. I didn't have a bad experience, on the contrary, it was on the list of places that I'd sometimes recommend to people who would be in the area - some meat at Mile End followed by dishdisha shopping on Atlantic Avenue. \n\nSo we went back and made a point of not just ordering the old standbys. We ate the meat, yes, and also the poutine, supplemented by things that weren't there before. The meat continues to be excellent - perhaps better than Katz's. There is poutine around than when these guys opened, but their rendition still is classically satisfying, which rubbery cheese, a layer of thick gravy and fries that appear to use the same recipe as Schwartz's (not confirmed).\n\nWe started with two vegetable dominated starters - the roast eggplant and sweet potato paired with 'zhug.' This was not some sort of StarCraft race, rather a type of Yemeni hot sauce that shared space with tomatoes and sunflower seeds. The eggplant was richer than what would be served at the many Arabic places in the surrounding area, and cut with a bit of tart pomegranate molasses.\n\nWe mostly ate family style, but due to a dietary restriction I reserved the lion's share of the 'cold dan dan noodles.' This Sichuan mainstay is very much a street food - I've had bowls on the streets of Chengdu for less than 50 cents. At Mile End you pay 36 times the privilege for a version that mixes in a too small portion of their smoked meat, Chinese sausage and long beans. I get that this is supposed to be an update of the cuisine, but the beans and sausage made it seemed like the chef was trying to throw three different Chinese dishes in the same pot. The beans were the worst part of this noble failure, their crunch overpowering the too thick noodles and the microscopic portion of chili oil. \n\nI like that Mile End continues to innovate. It makes it more like this place will serve the cronuts, ramen burgers and halo halo crazes that have come and will continue to wash over New York's food scene. And as long as their core meat and fry product remains so solid, there will always be a reason to return.", "author": "Jon S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-03-13", "description": "I read all the plus reviews and was hyped to come try out their sandwich. I'm not a fan of poutine, prefer to have my fries dried and crispy; so they could be great, my review is based on other areas.\n\nI got the Smoke Meat sandwich. It was flavorful, not juicy, dried at some parts. Definitely not better than Katz. I would have rate it 3 stars?\n\nReason I only left it 1 star was the service. I hope the waitress is new and inexperienced. She bought me the bill before I finished my food, that's only when she realized she didn't bring me my beverage. Then right away she attempted taking my plate with meat on it, without asking me if I finished my meal.\n\nI have not been rushed out of the restaurant for many years, and I usually finish up quick when I see too many people waiting; this wasn't the case, only 2 person waiting. I was here for less than 40 minutes, minus 10 before she came to take my order and 5 for writing this review.\n\nNevertheless, she reached over the counter to put money in the register, wonder how much germs has came down from the dollar bills on to the food ready to be served on top of the counter. I'm glad one of those sandwich isn't coming to me.\n\nSorry management, get it right. I don't mind she forgot my drink, and rushing your patron out is a big no no. I will not return to this establishment.", "author": "David Z."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-10", "description": "Used to live in NYC and came back to visit my sister. How this cozy little place has maintained its high quality and friendly service will forever be a mystery to me. The Reuben (with corned beef , not chicken) is perfect. The chopped liver and other Jewish comfort food is so good (im the words of Gilda, you don't have to be Jewish, but it wouldn't hurt). The pickle plate and DO NOT FORGET the poutine are just to die for. Never knew the marriage of Jewish and Quebecois comfort food would be a thing and this place takes it to the next level. Highly highly recommended.", "author": "Josephus F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-04", "description": "Tiny, tiny place.  Not a \"deli\" deli, but more of a tiny cafe or bistro.\n\nLuckily, five of us went on the 4th of July, where the wait time for a table was only a few minutes. We arrived for breakfast/brunch/sort of lunch around 1:30-ish.  The waiter was prompt and on his toes throughout.  The music was too loud for us to talk--such a tiny spot and such big speakers it had. (When we asked the guy in charge, he turned the volume down -- a bit.  Sigh.)\n\nHowever, that was the only flaw.  The food was yummy: we went for the breakfast/brunch offerings: sour cream pancakes with blueberries; challah French toast with fried bananas (HUGE portions of bread; incredibly tasty bananas); matzoh-ball soup; home fries.  We loved it all.\nWater is served warm, but you can ask for ice: the waiter'll bring it.  Service was a bit slow for such a small place that probably needs a brisk turn over every few hours, but there was a sign for a sous chef wanted. No matter what, if you're not in a hurry and you want your music loud, this is the place.", "author": "F O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-02", "description": "So much for laying off Bessie. After devouring a whole cow in the Midwest, I vowed not to eat beef for a year. That lasted oh about... a few days.\n\nI found myself at Mile End for a late lunch. At 2 o'clock, it was still packed as ever. We waited for about 45 minutes and even then and until closing time, Mile End could not catch a break. Consider yourself lucky for even getting a table. Mile End is in hot demand like Cafe Habana circa Lenny Kravitz. Except in this case, I feel that Mile End is not hyped enough. I would make the pilgrimage from Queens time and time again for the smoked meat. I am a believer in cow again. \n\nMile End is perfect in every way. It's quaint, smells delicious, and the service is super friendly. The tables are communal which is okay because everyone there is in good spirits. I made some new friends.\n\nThe food is so much at Mile End you need to share. Half a smoked meat sandwich is enough to fill and the poutine (with smoked meat) arrives gargantuan with eye popping and jaw dropping inducing effects. Frankly, poutine always sounded kind of gross to me but Mile End's version was just perfect. The curds slowly melted away into a faint gooey mess. I loved the gravy and the smoked meat bits. The fries were crispy and everything melded together as if they were perfectly fit puzzle pieces. BTW, there could never be enough smoked meat incorporated into the poutine. On that note, I'm making a new vow. To come back to Mile End and order a whole poutine with smoked meat all for myself. No more sharing. It's gonna be mine. All mine. \n\nFor the awkward brunch hours and tiny smidgen of space left in the yummy tummy, I highly suggest getting a cheese bagelach. I had no idea what it was but it turned out to be the best pastry/dessert type item to top off a meal. It was so good I convinced our table neighbors to get one to go for their afternoon tea time. The cheese bagelach was like a croissant tube shaped and filled with soft cheese. It was served with sour cream and a fruit compote (raisins, peaches, etc.). If that is what Montreal pastries are like, then I'm off to cross the Canadian border, um,  tomorrow. \n\nIn the meantime, Brooklyn will do. And as long as there is smoked meat, poutine, and pastries ready and waiting for me, I'll be there. It's all I want and all I can think of at 2 in the morning.\n\nExcuse me while I get a life. A life filled with cured and smoked meat beef brisket. Fries. Gravy. Cheese. Cheese. More cheese. Need I say more?", "author": "Rachel A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-23", "description": "Great breakfast! Lucked out with immediate seating. Generous, but not overwhelming portions. The lox was luscious, and the Montreal bagel is slightly sweeter and a little doughy-er than it's NY breathren. Kind of pricy, but this is Brooklyn, I'm learning.", "author": "David P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-12-16", "description": "Small place. Some of the stuff is overrated but the poutine is nice. I find the brisket a little too salty for my liking. Really good beer list.", "author": "Michael C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-08-13", "description": "My family and I visited here, and were met with such a rude server that we were in actual disbelief with the way she spoke to us. When we asked for clarification of the menu, she became visibly annoyed and chastised us for not being ready to order and walked away. Apparently she was so annoyed that another server had to take over service of our table.  If it weren't so hot and we had a plan for another place to go, we would have left. We did stay and have an average meal, in mild fear of making any further inquiries or further offending the temperamental server who seemed to be having a not so good day.", "author": "Melanie P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-08-30", "description": "If you need a smoked meat fix, this is a good spot.  Just be ready to pay top dollar and put up with the hipster attitude of the servers.\n\nHad lunch here yesterday with a co-worker.  She had the large poutine w/ smoked meat and I had the rueben.  The food is good here - salty, smokey meat.  The place could do with a bit less hipster attitude from the servers and the prices are like you are eating in Chelsea, rather than Boerum Hill, but I guess that is the way of the world.", "author": "David C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-02-18", "description": "Don't believe the hype\n\nI am a Montreal native, that now lives in NYC. This place is a complete joke and does not deserve to bear the name of my old neighborhood in mtl. Since being in NYC for the past 5 years I have been craving poutine badly. I heard about this place and was super excited. I even brought some friends to try the fries, cheese and gravy that I've been raving about. but I left embarrassed and extremely disappointed. \n\nI got the smoked meat poutine. The meat was basically a salt bomb in my mouth, there was maybe 4 cheese curds with gravy not even hot enough to melt it. and pickles, my goodness 3$ for one pickle that was in a sugar bath and tasted like the candy. \n\nNever again.", "author": "Jenny K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-07-05", "description": "Ordered take out delivery from seamless and the food was not all that, I have wanted to try their food for a while now, I've never gotten the opportunity to visit their restaurant.\n\nI ordered the ruben sandwich and Poutine fries, both were not delicious lol.\n\nThe Ruben sandwich was small and tasteless, the Poutine fries were tasteless.\n\nThe problem is that I have had better, their Sandwich and Fries really did lack in Flavor. The cheese in the Poutine fires needs to be a made with a stronger cheese and the Meat portion in the sandwich needs to be bigger for the price.\n\nI will not order nor visit their restaurant ever.", "author": "Leo L."}], "servesCuisine": "Delis", "priceRange": "$11-30", "name": "Mile End Delicatessen Brooklyn", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "97A Hoyt St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/jL2-f-hVAwkXx5vELTD0RQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188527510"}