{"aggregateRating": {"reviewCount": 747, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-12-23", "description": "Something really happened to the flavor of the food here. The meat tastes like nothing now, so sad why would they change a good thing.", "author": "Rie Z."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-06-30", "description": "So much potential spoilt by the fatty reuben and snatty staff. It was the last straw (maybe second last straw, the convenience of the locality and the schnitzel sandwich might suck me back in) today when I was blocked at the door and told to order and wait on the footpath in 90 degree heat when there were a mere 7-8 people inside enjoying the air conditioner.", "author": "Sam D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-08-15", "description": "Came for the brisket and it was quite good.  Service was friendly and prompt.  But when the sandwich came plain on the plate I asked for a slice of pickle.  No can do said the waitress.\nYou have to order the pickle/coleslaw/french fry combination for $7.  So no slice of pickle, no little paper cup of coleslaw.\n\nTo the owner of Mile End:  you're in an out of the way location - and you're in the hospitality\nbusiness!  What does it cost to dress a plate with a slice of pickle and a garnish?  7 cents?\nOk I'm wrong...9 cents?  And you charge $15 for the sandwich?!\n\nI'm glad I didn't need ketchup or mustard.  Would probably have to order a relish combo...", "author": "Jeff K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-04", "description": "Smells great. Poutine and meat are very good. Prices are a little high, but I will likely be back.", "author": "Ian L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-02", "description": "Chinese Meal on Christmas Day!\nWe read about Mile End's Chinese Meal on Christmas Day in the NY Times and are VERY glad we got reservations! Joel was gracious in helping us secure 2 spots for us at 2pm, which ended-up being a perfect time to eat for us -- meant we could sleep-in and have a leisurely morning before heading from Manhattan to Brooklyn -- went via Subway and walked to the restaurant from our Brooklyn stop. The 6-course menu was DELICIOUS and the service was FANTASTIC -- friendly, jovial, and made the experience so much FUN and TASTY! \nManischewitz Spritz cocktail special was hilarious AND delicious!\nFollowing our meal, we walked to the Brooklyn Bridge and then walked across the Brooklyn Bridge back to Manhattan -- great views and a LOT of fun! Highly recommend all of it -- the deli and the walk!", "author": "Brenda K."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-04-06", "description": "Good food, but the extremely tiny portions at insultingly high prices are going to result in you leaving this place either hungry or poor. Either way, you come out with a dissatisfying experience.", "author": "S M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-28", "description": "I really like this place as a solid neighborhood brunch. The staff can come across as rude when they're busy but crack them a smile and roll with it, they'll come around. Bagels and the classic breakfast is key, they also do a good coffee with free refills. Everything I've had here has been super tasty!", "author": "Ciara S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-08-23", "description": "This place used to be good when it first opened before it expanded into other areas, but now it is a far cry from good and I want my money back. $19 for the lamb pita special we ordered take out and it literally was nothing as described, no mint, no fries, no garlic sauce, just super sloppy in a mess of tahini and barely any meat. The $15 smoked sandwich was barely edible, looked like rubber, beyond fatty, tiny and an absolute joke. They need to get their sh*t together or close and let something better come in. Devastating meal.", "author": "Jessie R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-05", "description": "Cozy, little Montreal-based Jewish diner in the heart of Brooklyn. Delicious latkes, fresh bread with Schmaltz, and salmon.\nGreat customer service. We will definitely come back.", "author": "Mark L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-04-17", "description": "Well, it's been five years. And I've eaten a lot of smoked meat. Some* might say too much. And while I still like Mile End, the honeymoon phase is long over.**\n\nThis little deli has made a well-deserved name for itself. Unfortunately, with the fame, prices have crept up to the point that the value proposition seems off. The $9 smoked meat sandwich is a thing of the past, and the $15 smoked meat sandwich has taken its place. I really preferred the former, personally. \n\nGenerally speaking, the quality is usually still high, but there have been days when the smoked meat is dry and sad. And when you pay that much for a sandwich (pre-tax/tip), that is a serious disappointment. Worst of all, my absolute favorite item that Mile End ever made, The Breakfast Burger, has disappeared....seemingly never to return. \n\nI am pleased that there's a place to grab some poutine so close to my apartment, but barring the occasional (OK, frequent) drunken cravings, it's hard to justify at this price point. This has been a long time coming, but I'm downgrading myself from a regular into a sporadic visitor. \n\nI'm sure they won't notice, but I'm pretty bummed about it. \n_____________\n\n*My wife, my friends, my cardiologist.\n**We almost never have sex any more.", "author": "Peter D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-12", "description": "Tight quarters, but so worth it! The food was fantastic! I ate my entire Mont Royal and then had some shared French Toast for the table. Will definitely be back!", "author": "Joseph S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-05-18", "description": "My friend and I saw quite a few positive reviews on their poutine so we decided to drop by and try it out. Although it wasn't bustling with people in here, the seating was quite crowded especially if you're seated at the tiny table that can barely fit 2 plates near the window. It's a small delicatessen so I didn't really mind that but the reason why I'm giving it two stars is because their food is extremely over priced. A plain cream cheese bagel with a slice of thin tomato was approximately $5 and their classic poutine (large) was $13. These two dishes totaling to be $22 with tip was not worth my money. Not only that, their one and only waiter was extremely rude and had a bad attitude. \n\nP.S: I wouldn't recommend getting any bagels here because they are not worth their prices. Personally I do not eat meat, but I hear they are also known for their meat sandwiches so I would suggest giving those a try if you do plan on stopping by, though those are around $15 as well.", "author": "Han C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-23", "description": "Very comfortable environment. Extra friendly staff. There's not much of a drinking menu but the food was great. I got exactly what I wanted and the flavors just exploded in my mouth. The combination was to die for. This is a great little lunch place with a punch. I do recommend the poutine when you go. It just melts in your mouth!", "author": "Jasmin O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-27", "description": "Without a doubt one of my favorite restaurants in New York. Have been here maybe 10 times over the last several years and have always had a stellar meal. (Worth noting that I've only ever been here for dinner.) Yes, I've had the smoked meat and the poutine (many times), but I am always especially impressed by the flavors and textures of the other dishes. Last night this included an amazing brussels sprouts salad with bacon, honeycomb, and labne and a chicken salad with chickpeas, lettuces and various pickled things. But I could seriously recount the menu at almost every one of the meals I've had here, I've enjoyed them so much.\n\nWorth also saying that I have always had such excellent service here. Despite the size of the place and the limited number of tables, I have never felt rushed by service staff, have always gotten great recommendations from them--even suggestions about cutting down to the right number of dishes--and last night, was remembered by the waitress who last served us 8 months ago.", "author": "Raj K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-20", "description": "Never going back! I wish I could give this place 0 stars for service. On three separate occasions I've been treated with such rudeness which makes me think it's because I'm black  I'm also blaming myself for putting up with it just because - as a Canadian - I love the food.  And living in Brooklyn you became accustomed to questionable service but when it clearly appears racist something needs to be said.\n\nYesterday Saturday, May 19 2018 was the tipping point. It was pouring rain and a friend dropped me off in front and went to park. The host/server said we'd get a spot in less than 10 minutes so I decided to wait (by myself) inside because it was raining hard. The host then rudely said sorry but you'll  have to wait outside. Mind you I was out of everyone's way and there was an available seat at the counter. I explained that it was raining and asked if I could wait indoors due to the weather. The response was 'you chose to come out to eat in the rain so that's your fault'. That was such an extremely un-classy response I lowered myself to\nher level and said I refuse to stand out there and again asked if I could stay dry. I was then told well 'you don't have to eat here' and not even offered to sit at the counter. Again I was in an area of the restaurant completely out of the way of patrons and staff just trying to stay dry. At this point I went outside, called my friend and decided to eat somewhere else.\n\nWhat infuriated me was the lack of empathy for someone that was just about to spend decent money or even coming up with another solution for the apparent issue. I'm a firm believer in customer service, and also respect policy, and I know there are times you can make exceptions. This eerily reminded me of what the black men in Starbucks Philadelphia went through because some staff member wasn't willing to make a policy exception given particular circumstances. I did not let it escalate but being treated like that in front of other people was very humiliating. \n\nI'm not sure if this will matter to the owners of Mile End, and I know it's a very small venue without a lot of space, but you may want to train (or retrain) your staff on customer service.  \n\nAs mentioned, I've had other experiences at Mile End that I attributed to someone having a busy day. However during a slow period it really doesn't make sense unless someone is judging you by the way you look. \n\nEven if you don't think it's racism; if the general policy is 'go eat somewhere else we don't need your business'  like I was basically told, you may want to re-examine it.", "author": "Wayne C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-21", "description": "Forgot to write a review yesterday after I stopped by for lunch. But after eating the half of my leftover sandwich just a couple minutes ago.....I'm desperate to write the review right now.\n\nI got an order of the reuben and upgraded that to a deluxe with the poutine. To be honest, I never heard of a poutine before, and when the nice waitress asked me what I wanted for my side, I just said yes, I'll take the poutine, without asking her what that actually was. Turns out it's chunks of cheese and gravy over fries. I personally thought it was okay, I'm more of a leave-my-fries-plain type. For $10, it's a bit pricey for the portion and too much for one person eat. The corned beef.... warm, moist, flavorful, so perfect with the sauerkraut, thousand island, in between 2 slices of pumpernickle. The sandwich was huge and I ended up taking half home, which I ate just now. The sandwich did not even sog up after being  heated in the microwave.\n\nDid I mention anything about their slaw? It's pink! The color really caught my eye, I've been really into fuschia this past year. This slaw isn't like your everyday coleslaw made with mayo based dressing. It's crunchy, tangy, and vinegary, everything I love about coleslaw. I also think it has caraway seeds in there, if not mistaken.\n\nSmall, very intimate place with a couple of picnic style tables and like 5 seats along the open kitchen where the yummy sandwiches are made. It's one of those places similar to a dim sum restaurant, don't have a table? No problem! Let's learn how to share and meet a couple of new friends. I did not make any friends yesterday HAHA.", "author": "Amy N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-18", "description": "They really do a good job at bringing the Montreal-style deli to NYC. Their smoked meat hash (and sandwich) were excellent! I wish we could have tried everything on their menu. \n\nThere is a very limited amount of seating, so be prepared to wait unless you're coming at off times.", "author": "Lorne R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-06-17", "description": "I remember being enamored with Mile End the first time I went. It's been a couple years since and I will say it's lost a bit of the appeal. The food is still good but it's not quite what I remembered. We had a large poutine with smoked meat. It wasn't quite as large as I remember and could have used a bit more gravy. The fries at the bottom were bone dry. I had a grandpa sandwich for lunch which was really enjoyable. I would recommend it. Service was quick and friendly. Overall a decent experience though I probably won't go out of my way again for it.", "author": "Matthew R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-12-17", "description": "I'm just here to understand why the Matzoh ball soup is so expensive...", "author": "Aaron O."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-10-22", "description": "This place is too trendy for its own good. Looks very cute, and I was super excited to try it - but the service was atrocious and food subpar (and way overpriced). I ordered a breakfast item that was $18  and honestly expected something more than a hastily slapped together burnt potato latkes and 2 tiny pieces of smoked salmon. My friend specifically ordered an egg white omelette (for health reasons, he has high cholesterol), the waitress told him it would be $2 extra (ok fine) and waited over 25 Min until the food arrived -- at which point the waitress told him they couldn't do egg whites. No mention of the fact that they couldn't do egg whites earlier on or even an offer to change out the dish. Unbelievably bad service. We live a couple of blocks away and will never be returning again.", "author": "Kamiu L."}], "servesCuisine": "Delis", "priceRange": "$11-30", "name": "Mile End Delicatessen Brooklyn", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "97A Hoyt St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/jL2-f-hVAwkXx5vELTD0RQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188527510"}