{"aggregateRating": {"reviewCount": 747, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-01-03", "description": "3.5 stars.  The home-made pickles were very good (though I didn't care for the fennel).  The chopped liver was just ok. The pastrami was very good, but fattier than I would have preferred. Extremely tight seating. The waitress was super nice.  It's definitely worth a try, but I don't think I'll be back. I prefer Katz's or even Char No. 4 for my semi-annual pastrami indulgence.", "author": "Ethan M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-10-27", "description": "And so the Red Sea parted and...oops! I mean the sea of people finally parted and I was able to come to Mile End after work and get a table to sit and eat at. First of all it smells delicious in there, you will come out smelling like smoked meat for a bit. Ya could get the smoked meat sandwich and poutine separately but that would be a deadly gut bomb. Thankfully they save you from killing yourself with delicious food by topping the poutine with chunks of smoked meat, so you get two awesome things in one. Awesomeness. I can't wait to go back and gain more weight!", "author": "Dina V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-01-28", "description": "Mile End is a great spot for hearty comfort food.  It's tiny, but as I've learned, great things come in small packages.  These folks really know their meat, how to flavor it just right, and how to cut it without wasting a bit of goodness.  The folks who work there are amazing.  They're all very friendly, very knowledgeable, and aim to please!  I will definitely be back.  Neighborhood gem!!!", "author": "K K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-12-14", "description": "brisket is good, i could do without the other stuff that it takes to make a sandwich a sandwich.  should start saving the scraps of bread to give away to dogs I pass by on the way home or something.  but they would be sad because they'd smell the meat \u0026 instead get stuck with just my discarded sandwich bread.\n\nanyway, i don't know that i thought this was brisket when I first saw it.  guess i'm undereducated on my smoked meats.  to me brisket means passover at nana's \u0026 it's all dark on the inside \u0026 tender \u0026 charred outside.  This was tender \u0026 charred, but red inside like corned beef.  whatever, call it moth balls, I don't care, it tastes good.  a little fatty, but good. my nana would probably be really confused.", "author": "Talia R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-01-22", "description": "The one star isn't for the food, the food is great, problem is you can never get it.  The wait there is out of the control and let's face it, the food isn't that good.  Worse, I just called for pick up and was informed they do not take orders over the phone but i was welcome to come in and place an order in person and then wait in the freezing cold while the food is prepared.  Yeah, that totally makes sense.  Since I cant even call ahead for a pick up then I can officially say I'm out of Mile End.  I'm sure they don't mind, they have two hour waits, but after a while those waits dry up and you need solid neighborhood people to support you...problem is you wanted me to order in person, not over the phone and stand in the cold, yeah, I can find a sandwich some where else...", "author": "Hungry Brooklyn Mike C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-05", "description": "Have been here a couple of times for lunch, and last night for dinner.\n\nThe lunch / brunch line is insane, but deservedly so, as they do have some of the usual brunchy stuff, but they also have some other more interesting  items for those (like myself) that aren't a big fan of brunch.\nThe beauty (lox and bagel) is some of the best lox i've had. \n\nI think they can cut their brisket (aka pastrami) alittle too lean, so i usually ask them to cut it fattier, which is more to my liking.\n\nDinner is great, the prices are very reasonable, but be the portions are also on the small side.  Even so, if you order a couple of extra appetizers, it still ends up being a good deal, especially with the great wine list with many bottles under $40.\n\nThe seasonal salads are great, i loved the asparagus app, and the roumanian steak was very tasty.  The poulet  was why i came for dinner, and although it wasn't bad, it didn't live up to my expectations (still a good dish of chicken if that's what you're in the mood for.)\n\nThe space is small, but i find it charming (some may just think its cramped.)   All  in all, a very good neighborhood spot.", "author": "Brian C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-24", "description": "The first time I went to Mile End culminated with the heart attack on a plate that is poutine, and too many return visits that my hips are sad about.\n\nCrisp fries swimming in gravy, amidst lumps of cheese curds, with the option of topped smoked brisket shavings for $11.00USD. Apparently poutine is typically more of a \"sub-diner\" fare in Canada. I myself, have only had local chain poutine in Toronto. This is fatty, savory goodness of a higher quality. The iced coffees, necessary in muggy summer New York, were fair trade, light, and not smoky/bitter. The bagels are straight up Montreal, sweeter than the NYC counterpart.\n\nThe decor is chic-ified Montreal french delicatessen. Sure there are picnic tables and a counter but the look is quite insouciant modestly stylish, understated sheen, with open doors and windows to gentrified Boerum Hill. \n\nYou can order at the window with your dog in tow to continue your shopping round the neighborhood. Prices are usual for the area, over $10.", "author": "Stephanie W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-11-01", "description": "AMAZING!! One of the best smoked meat that I ever had... It was moist and flavorful... It is a small place and I seated and served at the counter, where they torture you as they prepare all that goodies.", "author": "Luis R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-09-20", "description": "Holy smokey meat in my mouth!!!!  I stopped by here late last night, I had the Smoked Meat Sandwich with Frites and a Virgil's Cream Soda, while my date had the Poutine, Smoked Meat Sandwich, and a Black Cherry Soda. The sandwiches came out first, which was a little distressing for my monoeating friend, since he likes eating fries while they're still warm; I on the other hand ate my sandwich with relish. The meat was smokey, tender, and full of fat that melted in my mouth; when the frites came out I was pleasantly surprised by how fresh they tasted, it was the end of the night, and really close to closing time so I was expecting sort of bland and stale tasting 'you suck for coming so late, so we're gonna give you the crappy frites'.  \nMy friend was very happy with the poutine, and said that is satisfied his craving for the Montreal staple.  The only downside was that the portion was a little much for him, so he couldn't finish his sandwich (which was fine by me because I got to finish it).", "author": "Lis K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-07-18", "description": "Going to this deli was simply a horrible experience. With sub-par food being the best part of the experience it doesn't compare to any other delis. The service was terrible as well as the atmosphere. I felt like I was being rushed out from the minute I stepped inside. I would not recommend this deli to anybody.", "author": "Matt C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-02-16", "description": "Places like this are what make Brooklyn better than Manhattan.", "author": "Raphael R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-08", "description": "This is my first Montreal Deli experience so I really have nothing to compare it to but it was really tasty. Had the bagel, poutine, and smoked meat sandwich. I thought the bagel was delicious. It was much smaller, more doughy, and sweeter. I loved the tomatoes they were using, sooo good! The poutine was very mild, again my first time having it but I would for sure get it again. You can have it with meat but I think that would have been a bit heavy for me. The bottom is the best when you can let the fries swim in the gravy. The highlight was the meat. It was perfect! Simple and delicious. \nThe seating is cramped, there are only 3 or 4 tables so I'd go at odd times or just be prepared to wait. We went on a saturday at noon and only had to wait about 30 min for 2 of us which wasn't so bad.\nWhen we were in there the bagel runners were in there eating and chatting people up. I guess they actually drive the bagels down here instead of shipping. I kinda like that.", "author": "Jenn S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-01", "description": "These sandwiches are some of the best you'll have in this city of delis that fail to deliver. They actually hand carve their meat in front of you. Perfect quantity of food and a price that is stunningly affordable for such quality food.", "author": "Sirio D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-04-30", "description": "The outdoor wait in line to this hole-in-the-wall place is well worth it, even on a blistery cold and windy New York afternoon.  The food is well prepared and delicious, and service is rapid and courteous.  I strongly recommend the smoked meat sandwich, but just about everything is good.  They also make a great borscht.", "author": "Vadim K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-26", "description": "Wonderful post Rosh Hashanah meal.  They were so nice helping me figure out what to get and in the words of my mother \"it's the best food I haven't made!\"  Thanks.", "author": "Alexandra T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-22", "description": "Yummy! Stopped here on a Friday afternoon during vacation with my boyfriend. We decided to opt for the take out window and walk and eat. I had the smoked turkey which was moist, smokey, and tender. He had the salami pressed sandwich which he loved! Add to that a pickle and 2 root beers and you have yourself a perfect lunch!", "author": "Pamela S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-05", "description": "I spent my college years in Canada, and I gotta say, this place lives up to the hype. Totally legit poutine, great beef on weck (even my friend who grew up in Buffalo approves) and just an all around great vibe. And don't even get me started on the bagels. Yes, you sometimes have to wait, but that's the way the cookie crumbles. Worth it!", "author": "Lizzie H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-12", "description": "We had a really great lunch of poutine, a smoked meat sandwich, and a smoked meat platter. Enjoyed it all thoroughly. The cherry sodas that they sell went well with the salty rich flavors. The service is pretty austere, not a lot of smiling happening but they got the job done and it's really all about the food. I can't wait to go back.", "author": "Michael S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-04-08", "description": "seriously fantastic! \ndelicious smoked meat (maybe better than katz's, a little drier too). i am now a fan of poutine! even though the sandwichs are \"more reasonably sized\" i still couldn't finish mine (and i'm no slouch in the clean plate club).  i'll be back to try the bagels. \nfyi- small place, went on a thursday at 1:30pm, 3 minute wait for a table, and the place was full.", "author": "luckysquid m."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-03-15", "description": "The meshpochah soup was very good, but the smoked meat sandwiches have become tougher and fattier of late.  According to management, this was done at the request of the customers.  If that does not sound like your cup of tea, definitely order your sandwich extra lean.  Also, unlike some folks, I found their pickles to be not that bad, although considering it is a la carte, they could be a lot better.", "author": "Rafael R."}], "servesCuisine": "Delis", "priceRange": "$11-30", "name": "Mile End Delicatessen Brooklyn", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "97A Hoyt St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/jL2-f-hVAwkXx5vELTD0RQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188527510"}