{"aggregateRating": {"reviewCount": 747, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-04", "description": "My boyfriend's sister was visiting us, and she ate lunch at Mile End at least twice in the span of one week.  She then took us for lunch one Saturday, and we saw why she was so smitten with the place.\n\nBecause it was Saturday, we had the weekend menu.  I got the breakfast sandwich, and it was perfect.  It was eggs, cheese, and canadian bacon (although it was thickly cut in slabs like regular bacon) on fresh, delicious bread, and it was just the right size of being hearty without being too big.  I sampled the boyfriend's brisket sandwich as well, and it was yummy.\n\nI definitely recommend!", "author": "Kathleen B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-01-25", "description": "I found out about a Montreal Deli opening up in the neighborhood two weeks ago that was going to serve smoked meats sammies, poutine and flies in St. Viateur Bagels.  Needless to say I couldn't wait..as I had to be there the first day it opened.\n\nI had to order the basics.  A smoked meat sandwich, classic poutine and i left with a bagel and cream cheese.\n\nThe sammy was ok.  Portions were small compared to what you get in Montreal.  A small piece of bread and not a lot of meat for the price ($8 USD).  Although they do have a platter which gives you more meat and bread ($13).  My biggest complain overall though, is the sammy comes with sweet mustard and not the spicy brown mustard.  The sandwich just wasn't the same because of this.  I think they at least need to add an option to have that instead of the sweet mustard.\n\nThe poutine was good.  Fries had a nice flavor, gravy was a little thick but nicely flavored and the cheese curds, although lacking in quantity, were the right ones.\n\nMy favorite was the St. Viateur bagel with cream cheese.  You can't compare NYC bagels and Montreal bagels..they aren't close enough to say one is better.  They both are good.\n\nI look forward to going back and trying some of the other eats.", "author": "Jeremy S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-23", "description": "Get the pouting with meat! Best corned beef sandwich I've ever ever had!! The slaw is amazing. Nothing special about their salmon lox bagel I don't recommend getting that. Worth the trip for the best poutine you'll have in the city. I thought it was better than the poutine I had in Canada", "author": "Stacey L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-10", "description": "A great little spot for breakfast. Montreal style Bagels and the granola are terrific. Stayed nearby and visited every day. Friendly wait staff and a reasonable prices", "author": "Lindsay R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-12-02", "description": "Perfectly lovely, one of the best meals I've had in Brooklyn.  (The bottle of Willamette Valley Pinot and the company had something to do with it also).  Smoked meats, sour pickles, poutine, friendly and knowledgeable staff. I felt warm and welcomed from the moment we entered, and was full, happy and satisfied by the time I left and returned to the cold dark December night.  The pastrami on rye was melt-in-your-mouth good, and the squash salad with goat cheese - divine.  Can't wait to return to NY and try more delicious things.", "author": "Brent F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-03", "description": "The food was delicious. I went for a private party, and everything we ate was delicious. I went for the smoked meat burger, and it was perfectly cooked and tasted incredible. The blend of meats was unique and exactly what I wanted. The only reason I took off a star is because we waited forever the first time we tried to go. The place is super small, and it was really cold. We waited for almost an hour, and couldn't wait anymore. You can tell its really small, and it's part of what makes it awesome. But it's more awesome when you're inside - not waiting.", "author": "Kathleen E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-02-15", "description": "Teeny tiny little spot..but what tasty tasty food!\n\nHit this place up with boyfriend and 2 friends a few weeks ago. We got there around 12:00 and had to wait for around 25 minutes. I'll say it again, this place is TINY! \n\nOnce it was our turn, we squished into a booth with 2 people who were just finishing their meal and ordered a ton of food. We were terribly disappointed to hear that they might be out of the meat for our meat platter orders..but the waitress (who is also perhaps the co-owner? or wife of owner?) was really sweet and tried to get it in before that happened. \n\nLuckily, they had enough meat for all of the platters. \nDefinitely has a totally different taste than corned beef @ a new york deli--fattier and smokier--but totally delicious. Did think that the poutine could have been a tiny bit hotter, but still tasty and satisfying. \n\nUnderstandable that others have been annoyed to find they are out of everything by early afternoon, but it's a small place and they house-smoke all of the meat. \n\nWe'll be back..but we'll show up earlier, or just call ahead and place a large enough order to steal all of the meat for the day (just kidding-- kind of..)!", "author": "Saskia S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-05-01", "description": "This place is so good that I almost don't even want to write a review about it for fear that it might become even more popular.  Have been for brunch and dinner several times and have never been disappointed.. in the least.  The smoked meat sandwich is so amazing my BF has said he wants to try other menu items but just can't tear himself away from the sandwich.  I, though, have tried other items and everything is wonderful.  Stuffed cabbage is of notable importance. Tonight was the icing on the cake - Burger Night (Tues).  I can't even put into words how delicious this burger was - a smoked meat mixed in with the ground beef give this the most wonderful flavor.  Served simply w/ red onion and thinly sliced pickle with a mayo/mustard spread on the side. The poutine is ridiculous.   Y.U.M.", "author": "Krista C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-03-04", "description": "$23 for a lunch sandwich with fries and a pickle (NO DRINK) !?!?!?!\nThe meet was incredibly dry and overcooked, the pickle sucked, but the fries were fairly portioned and delicious\nThey were closing early (unannounced on their website) so i traveled an hour to eat my overpriced lunch in the cold on the street", "author": "G L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-19", "description": "A friend of mine told me that this place was importing bagels by car from Canada, which strikes me as being really stupid.  I pretty much thought that Mile End would be a trendy, pretentious piece of crap, and I'm very happy that I was wrong about that.\n\nI ate a breakfast sandwich with fresh, smoked Canadian bacon, a runny egg, and parmesan cheese on grilled rye bread... pretty much as good as a breakfast sandwich can get.  The coffee was strong, the waitress was sweet and friendly, and the poutine was also pretty fierce.\n\nI still have to laugh at a place that imports $2.50 bagels that look and feel a lot like the frozen bagels that we used to eat in the Midwest... but Mile End is still worth the trip, even if you don't really get the whole Canadian bagel fetish.", "author": "Charles B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-04-18", "description": "Quite simply, everything i had was awesome...coffee, poutine \u0026 smoked meat sandwich.\n\nIt was really busy when I got there, but walked right in since I was by myself \u0026 immediately saddled up to the bar \u0026 got my meal.  And all this right in front of the guy cutting up the huge slabs of smoked meat \u0026 constructing the these fantastic sandwiches with the utmost care \u0026 attention.  It was all quite drool-inducing.  \n\nCan't wait to go back...and this time, my poutine will have smoked meat all over it...yum.", "author": "Douglas D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-05-22", "description": "Mile End had to really bring it for my four star review.\n\nI've tried to go a couple times, but found the lines were too long. Then, I found out they run out of meat at 4. Then, I read all the rave reviews in nymag, nytimes, etc., and Mile End got on my \"overhyped\" list and I was resolved to never being able to make it in.\n\nThen, on a rainy Thursday morning, I found myself sitting in front of a smoked meat platter with a side of pickles and poutine. The platter is served with a heap slices from a \"mini\" loaf of rye, and you can slather on mustard from a Heinz yellow-mustard jar on the table. I heard that the owners tried to make their own mustard and found that it was too costly, but I'm a Heinz yellow mustard guy anyways and I thought it was fine. Oh yea, and the meat was fuggin delicious; a nice subtle spice crust, corned-beef-esque texture with a nice pastrami kick. I haven't had many sandwiches that compare, and I've been around the NY Deli block.\n\nWhile I was skeptical of the rave reviews so early on (NYMAG gave Mile End \"Best Deli\" Award), the owner, Noah, really deserves it. They have a gem here in boerum, and I hope that Mile End is soon spoken in the same breath as Katz and the like.", "author": "David B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-09-23", "description": "I liked the place (celebrated my birthday here recently) and would love to give 4 or 5 stars but will stick at 3:\n\nService was OK...maybe even a little less than OK. The waitress was friendly enough but didn't offer much in the way of help to those unfamiliar with the menu or cuisine. Several times during the meal we needed her and always found her with her back to us and chatting with other employees. This is a very small space...it shouldn't be a constant chore to get your waitresses attention. \n\nThe food was good but (unfortunately/fortunately...depends how you look at it) I'm a (Montreal) 'smoke meat' snob. I love the stuff and have eaten it regularly for years in Montreal (as a Brooklyn native, it took a little time before I would admit just how good the stuff can be up there). The stuff we were served was OK...just that. Not nealry as good as the good stuff up north and (here's were they really lost me) not nearly as good as the Mile End stuff that I had recently at Smorgasburg in Brooklyn. Yes...they set me up with their own delicious unctuos goodness for disappointment when it wasnt so. Truth be told, the smoke meat that I make in my backyard smoker is better than what I had that night (and not nearly as good as the real stuff). \n\nThe poutine was 'eh'. The gravy was flat (vegetarian, perhaps?) and thin. The cheese curds were too large and didn't warm through the way they should. Cross the northern border and stop in any place with the word 'patate' painted on the window and you'll see what I mean.\n\nThe rest of the food was (again) OK. Nothing blew me away. Nothing was bad.", "author": "Craving Cholent X."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-17", "description": "whoaaaaaa. Being from LA, I'm a huge brunch eater. My friend and I headed out here around noon and waited for maybe 20 min before we were seated at the counter. We both got their Smoked Meat Deluxe and dangggg that hit the spot. One of us got the poutine and the other got the regular. I have to say the poutine upgrade is well worth the 3 dollars. Although, it's a little pricy, every aspect of that meal was amazing so I will definitely back here if I'm in the area again.", "author": "Seiji N."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-12-31", "description": "Mile End, you had me at the smell. I walk in, 8:15 am, thinking it just might be time to see what all the fuss is over the Montreal bagel, and having only had one enjoyable bagel experience since I've been here (sorry, Ess-A, but the butter was the most remarkable thing about the bricks you serve). \n\nI walk in, and the scent of red cabbage just takes over. Now, I'm not one to boast a full on love affair with the stuff. But the smell, sweet, sour, cloves and a waft of cider are a simple, basic ambrosia.\n\nAs for the bagel -- soft, chewy, it didn't taste like wonder bread. The cream cheese provided ballast for the slightly sweet interior. It tasted fresh, it's texture (and bagels are a textural experience), perfect. In other words, yum.\n\nSo why do I only give it three stars? Well, I've only had the bagel. But I'm going to have to make this a destination to try again. Soon.", "author": "Geof M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-30", "description": "First try\nThe smoked meat sandwich \nThe right size , very good .\nFrench fries ,the old fashion good way .\nNot that cheap though - Sand + FF+ Selzer + tip = $21\nBut i will be back :)", "author": "Tsvika K."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-06-20", "description": "Dry and salty! That sums up the smoked meat sandwich. I would have to say tha at $14 a pop, the sandwich needs improvement. The first bite tasted like some kind of chemical. So salty and not nuanced at all in flavor. I'd rather go to Katz's, where I can actually taste layers of spices on the meats. I understand it is a different style, but the meat was a little chewy, dry and not that special. Also, while it is plenty for me for lunch, the sandwich is small. Service was very good, though. But save your sheckles.", "author": "Rosetta S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-11-21", "description": "What a hit. Mile End opened earlier this year and has become one of the most popular choices for Brooklynites this year.\n\nI visited here for breakfast and surprisingly was able to get a table (despite sharing with a family of three).\n\nMy girlfriend and I got Saint Viateur bagels with cream cheese for a little expensive three dollars but.........I LOVE MONTREAL BAGELS. This is the only place outside of Montreal to get Montreal bagels. \n\nI haven't had anything else here, and it seems to be way more popular with the carry-out crowd.\n\nI'll be back soon and give you a better feel for the rest of the menu, but I know for a fact the staff is very good and the ingredients are the best possible.", "author": "Peter D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-12-01", "description": "Mile End was more upscale than expected. I thought I was going to a little local Jewish deli when I found it on yelp but when I arrived I was surprised to find a small well decorated restaurant instead. The wait was only 20 minutes and we did walk 7 blocks to get there so my bf and I decided to wait while we looked over the menu. We decided to try the famous poutine and the smoked meat hash. Mile End serves comfort food and both dishes were well executed. We made the mistake of ordering too much starch since the poutine is gravy covered fries with cheese curds and the hash had potatoes in it as well. After we were done, both of us had food comas. I do agree with other reviewers that the prices are a bit steep for the type of food but the service was great and I enjoyed the atmosphere at Mile End.", "author": "Vanessa T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-06-10", "description": "Hooray for Brooklynizing a Montreal style deli but next time get your meat right.  The smoked meat sandwich was dry and chewy with overwhelming saltiness, which was such a bummer because i really needed something to cheer me up after looking at $3300 shoe boxes on my apartment hunt.  The pickle was crisp and tart and the coffee was strong, maybe if they slipped some acid in it I would have dropped 3K on a \"2 bedroom apartment\" that was actually an eat in kitchen with an office off of it.  The fritatta was good and the service was slow, but the real reason Im not going back is that I'll probably be living somewhere in Staten Island.", "author": "Luke D."}], "servesCuisine": "Delis", "priceRange": "$11-30", "name": "Mile End Delicatessen Brooklyn", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "97A Hoyt St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/jL2-f-hVAwkXx5vELTD0RQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188527510"}