{"aggregateRating": {"reviewCount": 747, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-11-02", "description": "Sorry but I wasn't impressed. After reading all the comparisons to Katz, I expected a little more. The smoked meat sandwich was about a quarter of the size of Katz's. The clove flavor was overwhelming at best and the meat lacked tenderness. It was borderline dry. For $15, it is simply not worth it. Next time I crave smoked meat, I will 4 more dollars to my budget and head up to Katz for 3 times the meat, mouth watering tenderness and free pickles. There are much better overpriced options to appease your indulgence.", "author": "Richard J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-25", "description": "Mile End's prices seem to have gone up, and the portions are a bit smaller, or at least they are not bigger. Nevertheless,by heart sill skips a beat for Mile End. The smoked meat sandwich is heaven, and the fries are great too. For breakfast, give me the beauty bagel with smoked salmon and capers and my day will be a good day. \n\nI really hope their prices don't go up, otherwise I may have to say goodbye.", "author": "Tara S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-07-21", "description": "Disgusting  dry chunky smoked meat shame on them NOTHING LIKE MONTREAL!!! $$$$$ thru the roof go back to Montreal and learn how to cook!!!!", "author": "Deej M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-06-09", "description": "The smoked meat on my sandwich had a nice smoky flavor but the texture was wrong: dry and chalky (maybe from over-curing?). Pulled chicken in the za'atar chicken salad had a grainy texture, too, though the rest of it was tasty. I didn't see the value here, considering the signature item--the sandwich--was so flawed.", "author": "Ray K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-22", "description": "Reuben: Best I've ever had.\n\nMatzoh Ball Soup: sub-Lipton quality. Pass.", "author": "P M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-09-28", "description": "Good but not great.  I guess our expectations were too high after seeing their feature on the Food Channel.  The wait was LONG...which is to be expected in NY, but we went in the middle of the day and still waited a good 90 minutes or so.  The space is tight, very tight, only one or two cramped tables so we sat at the bar.  We were unfamiliar with the cheese curds, a staple with just about every menu option and didn't love 'em but didn't hate them either.  \n\nGlad we went and  experienced it firsthand but most likely won't go back unless we get take out to go.", "author": "Maria D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-06", "description": "The smoked meat poutine was absolutely amazing! Heavy, but delicious. And the matzoh ball soup was very flavorful. And service is fast.", "author": "Zaineh K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-03", "description": "During my foodcation in NYC, we ate a lot of really good food.  I mean a lot.  We tried out new restaurants three meals a day.  By the end of the week, I was craving raw uncooked vegetables.\n\nBut the BF \u0026 I agreed that the one moment of pure pleasure that will be ingrained in our memories forever was when the smoked meat poutine came to our table at Mile End.  Even before tasting it, we knew that it would be utterly orgasmic in our mouths.  And after tasting it, it was even better than we could have hoped for.  Who would have thought that fries, gravy, cheese curds, \u0026 smoked meat would make such an unholy combination?!  Pay the extra $ because it is SO WORTH IT.", "author": "Tiff W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-25", "description": "Great experience all round. Lovely ambience, food and excellent service.\nThe little extras like linen napkins (vs paper) and squeeky clean bath room just made the experience 5 star for me. I would strongly recommend!", "author": "Suvi S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-11-30", "description": "Very small portions for the price, but have to admit the meat is up there with schwatz's in montreal. How are they going to charge $1.50 per pickle lol shameless", "author": "Tony R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-31", "description": "A revelation, best delicatessen/ sandwich shop in New York? Puts Katz' in LES to shame...The bad reviews here are a joke! People complaining about the prices, just plain ignorant! Jorge and Leslie, great staff!!!", "author": "Carlos G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-06", "description": "One of the things about being a Vancouver transplant in NYC is this: I really, really miss poutine and smoked meat sandwiches from home. For those that aren't in the know, they're the best hangover cure on this beautiful earth. There, I've said it.\n\nBecause Mile End specializes in Montreal-style smoked meat and the aforementioned glorious poutine, they've obviously been on my radar for-freaking-ever, and finally I was able to make it to their Brooklyn location for brunch. Booyah.\n\nMile End is a small restaurant, and we were seated at a two-top right next to the window. The seat next to the wall was a bit wobbly, which resulted in a couple of close accidents, so non-lightweights may want to aim for the communal benches or the kitchen bar.\n\nMy bf ordered the smoked meat sandwich (\"You HAVE to get it -- you haven't lived until you do,\" I begged) and a small portion of regular poutine (with chicken gravy, hmm). As the famous Beauty sandwich was gone for the day, I ordered the smoked meat hash, which comes with potatoes, onions, and two fried eggs on top. For drinks, they serve Stumptown coffee either iced or hot, as well as a bevy of sodas and an extensive beer list.\n\nPoutine? Check.\nSmoked meat? Check.\nThe same as the hometown? Mmm, not quite (I mean, nothing's ever as good as the hometown), but fantastic enough to put stars in my eyes.\n\nHighly recommended, even if it dents your wallet a bit -- for the two of us, we cleared $60, and that's without booze or dessert.", "author": "Nicole L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-20", "description": "Here's my confessional, I was vegetarian for the month of Veguary and broke it for Mile End. I'm a terrible wanna be vegan, but I'd probably do it all over again for that reuben and poutine. We came here at 5 PM on Sunday and they were out of at least 3 main staples. Also, a very important note, this location does not sell latkes. All I wanted were freaking latkes. \n\nI think everyone preferred the reuben over the smoked meat sandwich, the bread was toasted, the coleslaw added more texture, and it had more flavor with the dressing. Two different sandwiches, apples and oranges, but I still liked the reuben better. \n\nmatzo ball soup, decent, but has dill.\n\nchopped liver, pretty darn good with that pork crack and even better when you dip it in that poutine gravy.\n\nTips: Don't sit at the furthest booth if you can avoid it. It gets really hot near the kitchen. They only serve latkes at the Manhattan location. Sunday's they offer their pre-fixe $35 Chinese Supper.", "author": "Jacqueline Y."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-03-19", "description": "Went in for breakfast. All the options looked good on paper. We had the hash and pineapple raisin French toast. The hash was severely lacking in seasoning and flavor. The 'brisket' had an chewy texture and the potatoes were just bland (no texture or caramelization). The egg was perfectly cooked. The French toast did not seem to be cooked right. It was very dry in the middle and the pineapple raisins were cloyingly sweet. In summary, the execution and flavor was severely lacking.", "author": "Sara I."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-08-30", "description": "Mile End, you used to be an amazing oasis of tastiness. Now you have instituted you new \"bar concept\" and, frankly, I'm disappointed. I mean, no ability to put my name down? Not serving the full menu of amazingness? Why? Why change? Why stint Brooklyn? Why must I go to Manhattan to have your amazing dinner? Why do I have to hover about awkwardly wondering if those people behind me are going to leave? Why can't I just sit and have my meal? I'll wait, I always waited before. \n\nTo sum up, I'm not coming back until the concept changes back. We had you first and we deserve you in your full glory.", "author": "Glenn F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-11", "description": "As a Montreal bagel fan (I kind of prefer them (my NYC pass was just revoked)) I love that Mile End totes actual Montreal bagels down to Brooklyn. Environmentally it's stupid I realize and I also find that sometimes the bagels can get dried out by the time they get here. That said, I've eaten many of their bagels with lox and also enjoyed their bacon and egg sandwich.\nGood times.", "author": "Rich B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-30", "description": "Went on a not very busy Friday for some lunch \u0026 we were seated within 10 minutes. Loved the delicious fries \u0026 had a nice corned beef Reuben. A special croque monsieur was good but I'll go back for some hot dogs (looked good!!), soup \u0026 more fries!!! The open kitchen was cool \u0026 the server/counter-person multi-tasked well.", "author": "Lucia P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-27", "description": "I know, I know, it's impossible to find deli food in New York, so thank goodness for Brooklyn's Mile End Deli!\n\nSo what distinguishes Mile End from all the rest? Think of it as Jewish food with a Canadian twist...so it's probably close to what Letterman eats when he's at Paul Shaffer's house playing video games on the weekend.\n\nThe smoked beef sandwich is the house specialty, but don't let that stop you from experimenting. With friendly service and a small, cozy seating area, the helpful staff welcomes you and will happily explain what the heck menu items like kasha varniskas are, so don't be afraid to ask.\n\nThe pastrami is great--the Canadian style is a bit smokier than its American cousin, and slices are thick and tender, as opposed to the usual mountain of thinly sliced meat I dream of climbing against the tug of gravity that is my cholesterol level. The closest comparison is Langer's Deli in Los Angeles, whose thick sliced pastrami is so tasty, that you don't mind passing a few crack dealers on the way from your car to the front door for a taste.\n\nIf you're a French fry lover and your life insurance is paid off, make sure you order Mile End's poutine, which is basically fries covered in cheese and gravy.  It's no doubt the poutine recipe comes from Canada as they have a better health care system than we do in the U.S.\n\nFinish off with a slice of olive oil cake, and your experience is complete.\n\nIf you're really lucky, the lingering aroma from your meal will cancel out the delightful fragrances emanating from the F train on your ride back to Manhattan.", "author": "Marc D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-04-10", "description": "Super skimpy portions. $21 for tiny sandwich and small order of fries. Feel completely ripped off. Also meat was just ok and fries were soggy. Overall I say skip it. Not worth the price or the hype.", "author": "Michael p."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-24", "description": "Mile End Deli is described as a Canadian Jewish Deli. Whatever that means.\n\nThe menu is small, which means 2 things:\n1) easier to choose because there are only a few dishes to pick from\n2) harder to choose because everything looks awesome\n\nMy friend chose the Smoked Meat Hash ($10), which consists of 2 eggs, Brisket, potatoes \u0026 onions. The eggs usually come sunny side up but my friend was allowed to change it to scrambled. I got to have a taste and it was scrumptious!\n\nI chose the Mish Mash ($9), which is 3 eggs done scrambled with onions, greens \u0026 salami (also a choice to choose lox but I wanted meat). It also came with 2 pieces of toast. A much smaller dish than the hash but equally delectable. To pile it onto the bread and bite into it - heavenly!\n\nI also chose pickles on the side - how can you not come into a deli and not have pickles? \n\nWe both had their Stumpton Town Iced Coffee ($3), which is direct trade French press coffee. I have no clue what that means but it was lovely.\n\nFor dessert, we shared the Challah bread that was twice toasted in maple syrup, raisings and toasted almond. It came warm and subtly sweet - perfect end to our brunch!\n\n--\n\nThe place is small so be ready to wait to be seated. At 1pm on a Sunday, there was a 20mn wait. Believe me though, the wait is worth it!", "author": "Julia B."}], "servesCuisine": "Delis", "priceRange": "$11-30", "name": "Mile End Delicatessen Brooklyn", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "97A Hoyt St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/jL2-f-hVAwkXx5vELTD0RQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188527510"}