{"aggregateRating": {"reviewCount": 747, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-14", "description": "I think I may have found the best beef brisket sandwich I have ever eaten. I wouldn't go as far as Zagat by calling this place \"the best deli in NYC\"  only because the menu is pretty small and it doesn't have typical deli items. Sadly, you won't get a pastrami on rye here. I'm giving it the full five stars mainly on the beef brisket alone. Wow. You can't really get smoked meat at a normal deli and after having it here I wish it became a deli standard. \n\nThe place is about as tiny as its menu with a couple communal tables. Prices are a bit steep but that's pretty typical at a Jewish deli in NYC. To me it's acceptable if they have the quality to back it up.\n\nWho would have thought a piece of the Jewish community of Montreal would have come to NYC to take on the big dogs and give them a run for their money?", "author": "Evan M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-03-15", "description": "Another recommendation from one of the TV Food Show's that was a complete bust.  Smoked meat sandwich, pickled beets, dill pickle, smothered fries with brisket gravy and a Dr. Brown's soda, $32.00 sans tip.\nThe smoked beef sandwich ordered \"Juicy\" was so dry on day old rye bread, tough to swallow down, the mustard was quite good though.  The beets were under done and the only flavor was White Distilled Vinegar no other flavoring or spice, same for the dill pickle identical vinegar flavor, too much acid and no flavor.  The Smothered fries were ok, but $7.00 an order???? This is Brooklyn, right???\nThe wait staff was great and the grill cook quite attractive, this is the first time I've left a 10% tip in 15 years.  If this is what hipster deli is all about, I'll pass.  This is a basic menu, main meat items are sourced from a central commissary, everything should be perfect, sadly though it was far from that.....", "author": "S. A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-11-06", "description": "I've had tons of Jewish deli food and been to the Mile End in Montreal, and this was one of the toughest, practically inedible cuts of meat I've ever eaten. Would've sent it back in a second if I hadn't ordered it take-out. $25 and 1 hr later I'm out of luck.", "author": "Jared S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-09-28", "description": "Just had this experience 30 minutes ago and HAD TO write a review. \nWe were driving into brooklyn from Manhattan having just spent the entire morning at the hospital and fasting the night before surgery and I was starving so we thought we could call in a lunch order to pick up on the way home. I call and the guy who answers  says it's too busy to write down our order and we'd have to order on grub hub or seamless. A bit dumbfounded, I hung up and then decided call back to explain: Look we're in the car on the way there, I can't really do that. He said they were just too slammed to take the order. How long does two soups and 2 sandwiches take to write down?! So we decide to just drive up and order from their take out window. When we arrive we discover THEY ARE NOT BUSY AT ALL!! the place was half empty, in fact. Needless to say we were PiSSED. this guy just straight up LIED.The Mile End lost two regular customers because of this. I HOPE THE MANAGER READS THIS. NOT COOL", "author": "Kimberley L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-02", "description": "Do not go if you are Vegan! Nothing for you there! Not really true though, the falafel is very good! But you go to Mile End for the Burger \u0026 the interesting salad dishes - try the brussels sprouts if they have them and have a beer - great selection!", "author": "Calliope C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-19", "description": "Kick-ass.\n\nWhat I had: the chopped liver, poutine, brisket, and the special maspucha soup.  The chopped liver was just OK, but the brisket...mang, the brisket was the best I've had.  Better than Fette Sau, better than Dinosaur, much betta than Rub or Blue Smoke.  The marbling on that thing is not of this world.  It's better than any rotting carcass I've had in Tejas and those fuckers take two things seriously: meat and the death penalty.  They don't fuck around.  Apparently Canadians don't either.  Who knew?\n\nThe maspucha soup for two, served as a special during dinner some nights, is definitely worth getting.  I may be a goyim, but this soup had me screaming \"Hoyven Mayven!\" it was so good.\n\nUnless you like waiting avoid weekend brunch.  Better to come during the week.\n\nMazel tov, bitches.", "author": "David D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-15", "description": "Best smoked meat I've ever had, anywhere, hands down. Even better than the meat I've had at Katz's and in Montreal when we got meat and poutine. Mile End beats them both by a long shot. The meat is soft and so full of flavor that I couldn't stop eating it. We stumbled upon this place while looking at apartments in the area and the charm of the neighborhood and the great food there sold us on the area. Love coming here. Prices are nothing too crazy, about the same as Katz's meat sandwiches.", "author": "Jamie P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-10-14", "description": "I really enjoyed this place.\n\nFancy Jewish/Canadian deli.\n\nI would recommend the deli platter. The best. I probably would pass on the poutine. It is okay, but it is on of the few things that is way better in Canada. \n\nIt is a little pricey for a deli, but I'd say it is worth it.\n\nBest to go in off hours. Otherwise it is a super busy. Brunch is ridiculous.\n\nThey also have takeout, but I've never taken advantage of it.", "author": "Chris H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-11", "description": "I passed by this place around 9:45am and there was a line of people outside.... Yes, waiting for it to open.  With no intensions of eating here, we decided to put our name on the list nd have brunch.    They opened at 10, and had a table set for us as soon as we walked in.    Question- Whay hasn't anyone mentioned the The twice baked challah ??? This was AMAZING? We shared this to start, it was soooo good.  For my main, I ordered the smoked meat hash and was blown away! It was so good!!  I recommend Brunch here to ANYONE!\n  I only gave it 4 stars because I've been before for lunch and did have a sandwich but wasn't that impressed.  BRUNCH gets 5 stars, even though I hate the coffee.", "author": "Jill Z."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-01-05", "description": "POUTINE IS AN EMBARRASSMENT. I'm not a poutine snob by any means. I like Sheep Station a lot, and even Dive Bar on 96th/ Amsterdam is good. (La Banquise in Montreal is the gold standard.) The smoked meat poutine at Mile End is not worth it. The fries are decent, the smoked meat pretty good, but the gravy was a friggin joke. Like it was from a Knorr packet. The cheese curds were also lacking in texture or flavor. All told it was outrageous, WAY over salted, and for $16, insulting really. Don't bother. If C Town made poutine, I bet it would taste like Mile End's!", "author": "Tristram S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-01", "description": "This review is for dining in, the take out the first time was great. The place is tiny, 3 picnic style tables that seat 4 comfortably and a counter that sat 4. We got here right at 6 on Saturday night and snagged the last picnic table. Waitress/hostess was sweet and helpful. We started with the chopped liver, Poutine w/smoked meat. Both really good. For dinner the kids both had smoked meat burger which was ridiculous in size they both could only finish half \u0026 these are teenagers! The adults had a smoked meat sandwich and a falafel pita. Meat sandwich was very moist and very filling. Falafel was fresh and excellent.  Not a good place for a crowd.", "author": "ExPark S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-27", "description": "My only regret is that I didn't discover this place sooner.  I've only eaten here once, but I thoroughly enjoyed my pastrami sandwich, and was eyeballing my niece's salami sandwich, hoping she wouldn't finish it.  Surprised at how good the sandwiches were, I found myself eyeballing other customer's plates planning on my next meal there.  I will return.", "author": "Brad K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-21", "description": "Second time here and finally getting around to writing the review.  The place is on an unassuming block in Boerum Hill and conveniently near a subway too.\n\nHave had the smoked meat sandwich on rye, the beauty (lox and bagel sandwich), the smoked meat hash with fried eggs, smoked meat and potatoes and a special fried fish sandwich on a home made bun. Get any of the above, but skip the red cabbage cole slaw, not that great.   \n\nHaven't yet tried the poutine, but will come back for that another time.  \n\nThe place is small, but tables turn around pretty quickly and they pack you in at this place.  There is also a counter for 6 seats.  All of which are reclaimed bowling alley.  Pretty cool.  Helpful staff, seem to have more interest in each other than the customers, but at least they were having fun.", "author": "Caesar R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-11-14", "description": "LOVED this place when I first went two years ago.  I saw it on the Food Network channel and knew I wanted to check it out.  In fact...I went there TWICE during my two week visit.  \n\nUnfortunately...when I was there a couple of weeks ago...the quality didn't seem to be the same.  Also, the poutine recipe was changed...and is no longer vegetarian.  :(  Oh well...I'm back in Cali now...and will work on creating my own version of poutine.  \n\nI had such fond memories of my first experience.  Too bad it wasn't my final experience.", "author": "cheryl r."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-05-19", "description": "They get 1 star for now because I got there at 4:30 today and was told that they were closing at 5:00 instead of the advertised 10:00 PM closing time. I now understand that they close between lunch and dinner service. Seems to be to much of a hassle just to get a sandwich.", "author": "Stan O."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-06-22", "description": "Service was good. Food wasn't worth the price. The food was pretty salty, and I couldn't taste much of other flavors. The meat was chewy not juicy. The dishes were very small for the price point. I don't plan to go back.", "author": "Benjamin Z."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-23", "description": "Think this might be my first 5 star review. It was about 103 degrees outside and probably about 95 degrees in the restaurant which would normally give you about 1 star.\n\nMaybe it was the fact that we were slightly tipsy, or that we were able to sit right away, it wasn't hectic, the server was cool and the service was pretty fast and we weren't angry at the bill. \n\nWe ordered a couple more glasses of wine, started with the simple bibb lettuce and radish salad, refreshing and perfectly dressed. Then the famous poutine, this is the holy grail of french fries people. A Montreal tradition (which I've never experienced) is a plate of fries with all kinds of goodness and gravy on top- this time cheese curds then smothered in gravy. Not something you would typically want to eat in 100 degree heat, but they were just insanely good, we couldn't stop ourselves from almost licking the plate. I am afraid that I know these exist and only live about 5 blocks from the place, it could be dangerous. \n\nThen onto their much talked about smoked meat- it was perfection on rye with mustard. I see why all the press, it was falling apart, full of flavor, just the right amount of fat, pretty much deli heaven.\n\nI will be back, hopefully when it's not 100 degrees, to all you Manhattanites- this is worth your trek to BK. YUM!", "author": "Amy J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-24", "description": "I saw a review of their poutine on the YouTube channel \"Chow\" so when planning a trip to New York I had to get some!\n\nThe poutine was delicious! I got mine with meat, I think I'd enjoy it more without the meat just because of personal preference. However it was still wonderful with the meat.\n\nThere's a walk up window to order and takeout food, and inside it's cozy with only a few large tables and a bar to sit at. The staff was friendly and fast, although the place was pretty empty since I had gone before lunch on a weekday. I will definitely be back!", "author": "Michael M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-08-21", "description": "They've simply done the unthinkable: they've made meat cool in Brooklyn.\n\nVegans eat your heart out, er, rather... eat... your... --So, Mile End. I don't know if it was meat or jello or God's tonsils between those two pieces of bread, but jeez, that stuff melted. \n\nVelvet Underground playing, devoted chef with the beard making the food right in front of you, laid-back waitress, it's certifiably Brooklyn. But go for the food. Worth it.", "author": "Kurt Q."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-05-13", "description": "All I can say is....WOW! \n\nI just got back from Montreal and I was craving poutine AND a nice smoked meat sandwich. A friend suggested Mile End and I am beyond thankful that she did. If only I had more stomach space. \n\nThe meat was very tender and flavorful. The poutine was delicious as well. The staff was VERY friendly and helpful. \n\nI truly felt like I was in MTL on Mount Royal Avenue from the ambience, the food and the people.", "author": "Danni S."}], "servesCuisine": "Delis", "priceRange": "$11-30", "name": "Mile End Delicatessen Brooklyn", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "97A Hoyt St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/jL2-f-hVAwkXx5vELTD0RQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188527510"}