{"aggregateRating": {"reviewCount": 747, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-02-11", "description": "Two and a half stars rounded down as a symbolic strike against the out of control hype surrounding this place.  \n  As is the case with most places representing the food of a city or region in another city the bar need not be set anywhere near as high as it would in the actual metropolis (see any NY style pizza place in just about any other town, or pretty much all BBQ or Mexican food here as proof).  That is very much the case here,  and the problem is amplified by a general atmosphere of pomposity run amok.\n\nOn food alone the place is probably approaching 3 stars.  The smoked meat, clearly the house specialty is tasty I suppose but nowhere near a fraction of he quality to be found @ the legendary Schwartz in Montreal.  The poutine on the other hand would get you laughed out of Quebec.  Its very bland and the mushroom gravy borders on cloying.  The beef on wreck which frankly has nothing to do with Montreal/Quebec and is a pretty big stretch to even associate with Canada as it is totally and irrefutably a Buffalo icon, was actually better than the smoke meat I thought.  Still, a better and much more sizable rendition can be found over @ Bonnie's grill.  A copy of the sandwich served at Willenskys light lunch in the Montreal hood this place is named after is also tasty but yet again pales in comparison to the real thing.  I had a interesting discussion with the daughter of the matriarch of that institution (while the elderly Ruth Willensky sat wordlessly next to us) about the place and her Mom being paid tribute to here the last time I was up in Montreal back in August of 2010.  To say the least the didn't dig the homage too much and pretty much considered it  a rip off and use of their name and intellectual property without permission.  I don't know any of the details so I will refrain from discussing this any further.  Oh yeah they ship bagels down from the great St. Viateur's and jack up the price by roughly 400 percent , and offer a version of the dressed with lox onions a capers in the manner served at the Beauty diner in, of course, Montreal.  All of the food while pretty unexceptional is obviously made with quality ingredients and subscribed to all the typical requirements of being organic carefully sourced, and blah blah blah. \n    The serving sizes  are ridiculously small and the prices are offensive considering this.  Worse yet is the vibe of the place, which is severely precious and pretentious.  The staff, led by a press-hound couple who are literally \"too cute\",   have got the condescending annoyed thing down perfectly.  To say the place as a whole is quite taken with itself would be an understatement.  But hey, why shouldn't they be?   This place gets lauded beyond belief and people line up for hours on weekends and even many weekdays in the dead of winter to get in the cramped tiny spot.  Standing in line for hours to eat wildly over priced, mediocre food by servers who treat you rudely?  Not a good look people!", "author": "Brendan T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-25", "description": "Good fucking pastrami sandwich, Moist, smokey and meaty.\n A whole half-sour pickle. Red cabbage slaw that was not at all old or crappy. Ho cream and good  mustard: solid.\nRecently cut french fries blanched then refried till truly crispy and salty. Check.\nA cold bottle of tap water\n$18+tip. Cool\nNow I have to lie down before the onset of meat-sweats.\nhell yes", "author": "Kenneth A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-01-03", "description": "I think I came in here with the wrong attitude. I was super excited to find out about this place cause I had gone to food heaven during my last trip to Montreal. I wanted Fairmount Bagels, I wanted Wilensky's and I wanted Schwartz's smoked meat! And unfortunately, I got none of those.\n\nThe bagels from this spot are actually shipped from Fairmount Bagels but it did not taste the same. I love the chewy texture of the one I had in Montreal but this was dry and bread-y. The flavor was okay. I prefer my Bagelsmith bagels if I'm having them in NY. \n\nThe Ruth Wilensky sandwich was the tastiest of the bunch of things my friends and I ordered. Not at all similar to the original, this one is on onion bread and the meat is more like a smoked meat than a bologna. Paired with a pickle, this sandwich saved the restaurant from a possible lower rating. \n\nWe also got the Smoked Meat Hash (tasty but super greasy and heavy) and the Smoked Meat Poutine (fries yum, cheese curds yum, smoked meat cold, and gravy kind of weird tasting... not a fan). \n\nThe wait for a table was 45 min on New Years day at 11:30. There are only 3 booths, 1 small table for 2, and a few counter seats so expect to wait if you want to eat in. The feel and mood of the place was the best part. Loved the huge wood tables with extendy-arm lamps at the booths. Service was excellent.", "author": "Michelle Y."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-01", "description": "I'm not mad, I'm not sad, I'm just glad there's somethin new in the hood.... and Mile End will have to work a bit to hold its own, but my first impressions were very positive.\n\nIt is tiny. It is packed and smoked meat sells out fast. Apparently I'm to follow on twitter when they run out. No matter, I am around the corner so that's fine.\n\nOn Sunday they were out of smoked meat by 3pm.  I was fortunate though because they had some scraps around to crumble over my poutine.  I think someone else on here had said the gravy was not hot enough to melt the cheese and I may have to agree but it was damn flavorful, fun to eat, beautifully presented and tasty.\n\nThe warm borcht was ok.. a little to puree-e and thick for my taste. That's just me, I prefer it clear and cold.  I do appreciate the dollop of sour cream though.  \n\nThe salami press on onion roll was yum!  \n\nI love the decor. LOVE LOVE LOVE the recycled bowling alley wood used for tables... albeit there are only 3 tables in this tiny packed joint.\n\nService was great and I felt instantly like a regular. Looking forward to trying the before 10am menu.  Welcome to the nabe Mile End... make us proud. \n\np.s. thought it was strange that the owners? occupied one of the three tables during a very busy period conducting interviews and working on the laptop. People were waiting for seating and i found that odd.\nAlso, you can tell they are all still working out the kinks... don't expect a flawless assembly line. And.. for the love of god, please please please send us some Pickles!!", "author": "Foodie Mamma X."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-18", "description": "I'll stop adding loving reviews of MIle End's dinner after this one, I promise.\n\nI'm glad that this place is unpopular enough for dinner that there was only a short wait on Saturday evening. BUT this was followed by a a full half hour of empty table (fully 1/5 of the seats in the restaurant!), and I also want to make sure that they get enough business to keep serving dinner. Because this is probably my favorite dinner spot in New York, and I want to be able to go back whenever the next occasion arises. \n\nTonight we started with a special, fried brussels sprouts and delicata squash atop a sunchoke puree laced with pomegranate molasses. While not a mind blower, it was totally pleasurable and comforting. We followed with latkes accompanied by scrambled egg with fish roe and chive--a twist on breakfast that was tasty when sprinkled with salt and pepper (scrambled eggs, after all), but not that special, really. Next came a heap of cauliflower tabbouleh, subbing out bulgur wheat with the cauliflower--a brilliant idea made even more excellent by the addition of halved red grapes, occasional bursts of tart sweetness, to cherry tomatoes, peppers and parsley. Alongside the tabbouleh we ordered the schwarma spiced chicken with tiny roasted patty pan squashes, hearts of palm, preserved lemon, apricot, fennel and hazelnuts. What a wacky idea to combine all these! It worked so well particularly because of the perfect spicing and cooking of the chicken, so tender and smokey, offset by all those flavors and textures. \n\nDessert was a flaky apple tart, redolent of cloves, topped with whipped cream. Service was a perfect combination of friendly, attentive and unpretentious. Solid work, Mile End. I'm coming back. Save me a table.", "author": "Raj K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-19", "description": "I truly adore this place and was really excited Mile End was in Brooklyn.  I heard about Mile End years ago when I visited Montreal and my friend raved about the wine here but unfortunately, I couldn't drink that night since I had a cold.\n\nThat being said, my friend and I came over to Brooklyn on a misty night and the wait was only 30 minutes.  We walked around the neighborhood talking and received the call before 30 minutes and were seated immediately.\n\nMile End is small, probably seating about 20 people max, but charming nevertheless.\n\nTwo cooks work out their magic behind the counter and two waitresses take care of the clients.  My friend and I were so absorbed in talking that it took us awhile to order but weren't rushed like other establishments.\n\nI really wanted poutine and asked the waitress if ordering poutine and the tourtiere, which based on their creation was brisket, ground beef, and potatoes  in a fluffy pastry shell would make me look like a fatty.\n\nShe laughed and recommended that the poutine can be shared and I can order the tourtiere as a main dish. I also considered the Waygu steak with potatoes in au jus sauce but have been eating a lot of steak and burgers lately that my body would probably reject it that night.\n\nThe poutine can definitely be shared between two people and it was french fries with velvety cheese curds and gravy.  The fries weren't too salty and the cheese curds definitely melted in your mouth.  I really liked the poutine!\n\nNext, came my main dish which was served with salad.  I really liked pastry shells and enjoyed it more than the meat itself.  The dish reminded me a lot of shepherd's pie without the peas.  It was good and filling.  \n\nMeals like this make me sleepy so I ordered coffee.  They didn't have any specialties but used French press coffee would be fresh. I was surprised since I was expecting a small cup but it literally came in a bowl which I would estimate to be 3 servings of coffee.  They gave me a canister of brown sugar cane and half and half.  The coffee definitely capped the night well and was happy I didn't grave the beer!\n\nI would come back for more poutine and try out  the St. Ambroise apricot wheat beer!", "author": "Neline S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-06-02", "description": "I went to Mile End on a beautiful Saturday and was pleasantly surprised by the food. The mediocre rating, however, is due to the service. \n\nI ordered the smoked meat breakfast hash and it was delicious - it's a huge portion so you could honestly split it. We also ordered poutine which was ok and the breakfast sandwich was also good. We finished eating after 45 minutes and were finishing up our tea and coffee and the waitress came up with an annoyed tone and said \"Guys we've had four waiting for over an hour, would you mind leaving?\" \n\n1) there were other tables with space in the restaurant and other couples who had been there significantly longer than we had \n\n2) There is no way they had been waiting over an hour because we didn't even spend an hour there and they weren't there when we arrived\n\n3) we had paid the bill and were clearly finishing our drinks - being forced to leave when you haven't finished the coffee you paid for is a horrible business practice.\n\nNeedless to say, I definitely won't be back! The attitude of the waitress ruined the entire experience for me.", "author": "Liz P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-18", "description": "Was walking around the area and seen this place.  I was pressed for time but ordered a smoked meat sandwich which was out of this world.  I'm giving it 4 stars because I have to come back for a full meal and will probably give it the 5th Star.  Very impressive and well worth the few bucks!!!\n\nJust have to say WOW!!!!!!\n\nHad to add the 5th star!!!!", "author": "Joe P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-03-19", "description": "This review is based purely on the matzoh ball soup. It's delicious, but for $8, you should get more than a pint of broth and one matzoh ball. It's pretty outrageous. So sad, as it's the only matzoh ball soup around.", "author": "Lia R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-11", "description": "Okay, I'm a pretty big burger snob and Mile End's makes it into the elite few of highly acclaimed burgers that is deserving of its notoriety.  (Burger Joint \u0026 PJ Clarke's, get out of here). \nMile End makes their smoked brisket in house, and 50% of their burger is comprised of that brisket.  You can literally taste the smokey brisket in the burger, which has FANTASTIC TASTE.  I will admit, that ordered my burger med-rare, and it came out a perfect medium.  However, the flavor 100% made up for it.  This is a great burger.  Definitely in my NYC top 10.", "author": "Leah H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-03", "description": "Went in for the smoked meat. It was pretty great. I had it lean and should have gone for something more fatty so the smaller pieces were not as dried out. Huge sandwich, great hand tossed fries and while I had a soda, there was a good beer selection. \n\nThe pickles are only one way....which was sour ( no half sours) and the cole slaw is a special beet slaw. So those two things could be more traditional for me, but still were good. \n\n\nThe prices overall are high. I got out of there for 25$ all said and done for a sandwich, fries and a soda, and its far from Katzs.", "author": "Max S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-06", "description": "A couple of things bummed me out about Mile End.\n\n1) Virgil's black cherry soda (not Cott's) for $3.\n2) Why are they weighing the sandwiches so meticulously? The smoked meat sandwich (reasonably sized) is $11!\n3) That's a lot of mayonnaise on your loxster roll! \n\nI liked some things.\n\n1) The pickles were very good.\n2) The smoked meat (pricing and meticulous weighing aside) was quite good\n3) The coleslaw was well above average.\n\nOverall, though, this is more like quasi fine dining in a bohemian deli shell. I'm sure Jean Drapeau would be, like, \"What the heck?\"", "author": "John B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-07-10", "description": "This place is kind of a scam. It's a shame because the food is good but it's totally overpriced. 15 bucks for a smoked meat sandwich which is not huge and had no sides... Even worse I got the salmon breakfast today, it says \"Smoked salmon with latkes and tobiko eggs\". It should say \"latkes with a hint of smoked salmon\", there's not even a quarter of a slice of salmon there, for $15 again...", "author": "Jimi B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-01-23", "description": "Great meaty little sandwiches. Way over priced. Only a once in a while place for me.\n\n$15 for a delicious tiny little meat sandwich with no drink or sides", "author": "Jason F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-10", "description": "We went on a Friday morning so it wasn't busy. That being said, the service was friendly \u0026 speedy. I had the lox bagel \u0026 mom had the brisket hash. The lox wasn't too salty and tasted really fresh. The hash was hearty with a mixture of lean \u0026 fatty brisket. Never been to Montreal, so I don't have anything to compare it to. In short, good food, coffee, \u0026 service.", "author": "Nicole I."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-26", "description": "I don't understand how there are negative reviews. I realize everyone is a critic these days, but how can you fault a business because parking sucks in their neighborhood? Anyway.\n\nMile End has always been stellar. Everyone on the staff is friendly and helpful. I don't see where people felt a pretentious vibe, because this is probably one of the least pretentious restaurants in Brooklyn. \n\nStand outs:\n- The brisket hash with an overeasy egg. Always perfectly seasoned!\n- Matzo ball soup. This is incredible, the family style version is something I can't wait to have again. Even better when you're under the weather!", "author": "Melissa H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-01-14", "description": "What a rip off. Yes the smoked meat was tasty, but that was the smallest $18 sandwich I've ever seen.  Seriously where did they find such small rye bread?  The fries were over salted, the slaw had a chemical taste but was otherwise bland, and the pickle was nice \u0026 spicy but mushy in spots like it had been bruised.  My 4 year old, who's middle name should have been PastramiVacuum, didn't really like the sandwich. But he's very discriminating. \nI could have been more forgiving were the sandwich larger.", "author": "David S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-10-17", "description": "Been going to Mile End since 2011 and I hate to say the quality of the breakfast options has been going downhill for the past year or so.  Felt the need to write a review after I cracked open my Breakfast Sandwich this morning only to see the gruyere replaced with Kraft slices.  I cringed.  Years ago you would get a perfectly prepared sandwich - authentic Canadian bacon, thick, juicy and cooked to perfection, and beautifully melted gruyere cheese dripping from the bread.  Now the bacon is an overcooked, dry mess.  And the cheese, well, let's just say they've gone American.  Can't speak for the lunch menu, but the breakfast menu needs to get back to the basics.  I should have just stopped at my local roach-filled bodega.  Sadly, it would have tasted the same.", "author": "Tracy W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-10-25", "description": "Well I guess there's something to be said for having a Mon afternoon off....like being able to walk right into Mile End midday to finally sample the much heralded goods.  \n\nAs I've been hearing from everyone including my crazy French-Canadian friend, I must try this place including the bagels which are different than the usual gringo versions and driven down (daily?) straight from Montreal.  Smaller, sweeter and in his humble opinion, tastier.  Can't say I agree necessarily but let's call it a push.  But kudos on fresh, raw onion option (vs scallions) with the cream cheese.\n\nAfter a quick rock, paper, scissors to determine if we were going with the brisket or salami sammy, we ended up on the Ruth Wilensky (salami)....gotta love and respect a joint that actually penalizes you (.10) if you opt OUT of prerequisite mustard topping.  And they were right, a great sandwich.  Served on a pressed onion roll, the salami had just the right ratio of crunch to chewiness.\n\nPoutine was squeaky good with savory gravy and curds.\n\nBonus for me as they serve Virgil's sodas!", "author": "Jeff F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-10-18", "description": "Wow! Super fresh, super tasty and just plain AWESOME! I haven't had a sandwich this fresh and good in who knows how long. I was able to try this crazy good sandwich at the Hester Street Fair and boy was it worth standing in line for. Not even that, I got the last sandwich which made it taste that much better. \n\nYou cannot get a fresher tasting sandwich then here at the Mile End. They cut the brisket fresh and place it on the bread, right after they cut it. From the pot, to the cutting board, to the bread, it doesn't get any better then this. I would HIGHLY recommend this place and the sandwich cost a very affordable $5!", "author": "Michelle W."}], "servesCuisine": "Delis", "priceRange": "$11-30", "name": "Mile End Delicatessen Brooklyn", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "97A Hoyt St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/jL2-f-hVAwkXx5vELTD0RQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188527510"}