{"aggregateRating": {"reviewCount": 747, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-02", "description": "High quality ingredients, The Rueben and Montreal Cheese steak were both on point.", "author": "The Glutton .."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-16", "description": "Yes, Yes, YES!!! I've been craving my Canadian poutine dish and decided to go on a hunt in Brooklyn. This is the 3rd poutine I've tried in 24 hours and YES, MILE END GOT IT RIGHT!! The fries were crispy (maybe a little too salty) but they were definitely not cheap on the cheese. The sauce was thick and amazing!  And the smoked meat on top.....THAT i can go on and on about - DELICIOUS!! My only downside was that I took this order to go...next time will have to eat it there...I don't think it will be too long :)", "author": "Miriam M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-11-15", "description": "Good food here but horrible attitude from employees. Particularly the red haired female employee who works Sunday brunch and receives takeout orders has a stick up her a$$. I have also had another bad experience with an employee a few months back. HR, get it together!! I always appreciate a restaurant with good food but nobody wants to go to a place with employees that seem to hate everything in life. My 2 cents.", "author": "Andrew C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-11-08", "description": "This review is strictly for their smoked meat sandwich at their stand from the Brooklyn Flea.\n\nI was rather hungry upon arriving around 1pm.  My friend and I stroll around to check out the different choices to eat.  I see a standing sign that has $5 meat sandwich.  What a deal I thought.  The meat (I think it's pastrami) was plentiful for the 5 bucks.  But, I've never been a big fan of pastrami, but the sandwich was definitely filling.  \n\nSo why the 3 stars?  Well, because after we ordered the Chicken Cemati and later some Ribs, things suddenly become relative.", "author": "John C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2010-12-27", "description": "Mile End: Epic Fail\n\nIf you want Montreal smoked meat keep driving north until you reach the Canadian border. Do not stop in at Brooklyn's Mile End, do not give\nthe meter or this establishment your money for you will surely be\ndisappointed.  If you are hungry, I'm sure there is a McDonald's close\nby where you can get mechanically separated chicken nuggets, which\nwill at least serve the purpose of...drum roll...being TASTY.\n\nBefore this experience, I had heard of Mile End from multiple sources.\nMy parents were born and raised in Montreal and I have been there at\nleast 20 times in the last 10 years. I have had my fair share of\nsmoked meat at establishments such as Snowdon Deli, Schwartz's and\nFamous Deli Boys. I currently live in Maine but when Mile End opened\nmy friends were quick to tell me. It was written up in the New Yorker. Brooklyn+ Montreal smoked meat+ rave reviews equaled no doubts. I was ready. Could someone have actually brought this fine delicacy to the States?\n\nSo, while being in Brooklyn on Christmas Eve I was pumped to have\nlunch at Mile End with my parents and a friend. I had heard the wait\nis usually around the corner but I was happy to see that there were\nonly a few parties ahead of us. Yes, I was slightly shocked by its hole-in-the-wall size with only four tables and some bar stools. But hey, if they are serving up true Montreal smoked meat it would be well worth the wait, the claustrophobia, all of it. And if they had been serving up the true Montreal deli experience, the purveyor at the cash:  the 25 year-old-Williamsburg hipster-cum-shtetl-cum-balabusta, wouldn't have\nso thoroughly irritated me. Her getup would have been just fine.\n\nAfter waiting twenty minutes for a table we were seated at the bench\nin the back. I liked the tables, which were nice workbenches where a\ngood hearty sandwich should be consumed. There were two options for smoked meat: 7 ounces or 14 ounces. Because we were going to a party later that night we decided on three 7 ounce smoked meat sandwiches to split amongst us. We also got two orders of fries and some pickles. After placing our order I left to feed the meter and arrived back to see sandwiches of rye bread, mustard and juicy meat hit my line of vision. As I approached the table my mother muttered under her breath, \"no comparison\". My friend, who had never had Montreal smoked meat before did not look impressed. And my father said, \"not even on the 30 yard line.\" How could this be? It looked so good. Were they crazy?\n\nAfter my first bite I was not so much saddened, yet shocked by its\ncomplete and utter lack of taste. Not smoked, not peppercorny,\nnothing. Just thick slabs of un-smoked-un-cured, likely just preserved\nfatty meat. Forget for a second the Montreal comparison; this sandwich\ncould not even stand up to something Katz's Deli could provide. This\nestablishment cannot be placed in the same league as the far greater\ndelis that have come before it.\n\nNow let's address the two other items we ordered, fries and pickles.\nThe fries were fine. Like the \"smoked meat\" the pickles were completely off target. They tasted like they had been brined in lemon\njuice. Not a good addition to an extreme failure of a sandwich. They would be better off serving up Clausens or even Vlasics compared to the sorry excuse I bit into.\n\nFeeling deceived and disappointed, the hipster mamala is lucky I did not break her Mad Men specs in half and throw them at the man chopping meat to her right. My expectations were very high but I wonder how this deli could advertise such a fallacy. I want Montreal smoked meat to be represented the way it should be. This is why I urge you not to settle. Wait until you are on Decari and sit down at Snowdon\nfor the real deal. You will not order it from a hipster-balabusta.\nThey will serve it old-fashioned or lean. It will taste right and the\npickles are not cured in lemon.\n\nAnd PS - Jewish delicatessens in Montreal do not have \"chazzer\" on their menus.", "author": "Jessica M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-18", "description": "I had read about this place here: http://newyork.grubstreet.com/2010/05/the_101_best_sandwiches_in_new.html#photo=1x49428\nThey had the #11 and #5 best sandwiches in NYC according to this list so I had to try it out. Unfortunately, the anticipation ruined it just a bit for me. I got the smoked meat and the ruth wilensky to go so maybe the brown bag ruined them a little for me as well. Ultimately the flavors were very unique and on point, worth the extra time spent walking over to this place and taking the dreaded slow F train. I am interested to go back and try to sit down to try some of their other dishes.", "author": "Eugene B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-07", "description": "The lamb sausage is the best and juiciest I have ever tasted! The smoked meat is incredible.\n\nBut the night I was there they ran out of SixPoint draft beer. They had NO draft beer! That was a sad disappointment, but everything else was delicious.", "author": "Jason B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2010-12-30", "description": "Meh.  Such a fail.\n\nHad Mile End's bagels (or whatever their shrunken northern cousins are called) at the Brooklyn flea and they were tasty.  Then I tried a few times to go to the brick-and-mortar location, but was repeatedly thwarted by one bullshit thing or another.  First they're closed on Tuesdays (who isn't?). And then I went another day between \"lunch\" and \"dinner\" when they stop serving and shut down  (because a tiny restaurant serving deli style food needs a lot of down time to prep for the dinner rush?).  You serve cured meat and pickles!  Why do you shut in between?!\n\nThird time's a charm and I made it in and got a table for lunch in their miniature dining room. My girlfriend and I ordered 2 borscht, 2 sandwiches and frites.  First item out was the frites(which were good).  Then my sandwich 5 minutes later then my girlfriend's sandwich and then the soup (after I had asked the waitress if the soup was coming and she unapologetically said yes)   So that's fries...5 minutes...sandwich...5 minutes....other sandwich...5 minutes...soups.  Sandwiches were ok.  Borscht was insipid at best (go to Greenpoint instead).\n\nI should also mention that we were told right off \"smoked meat\" was sold out.  However, while we were there the dinner menu was going up on the slate, which prominently featured \"smoked meat.\"  Reading between the lines...they sold out of the lunch portion and weren't going to sell an order to someone at the ass-end of lunch.  Nice.\n\nMile End is typical of some New York joints where they purport to be the arbiter of an obscure imported cuisine, but ultimately fall short of the real thing (despite their own hype) and are just up their own asses with how great they are. \n\nThe service was rubbish and the prices were a laugh at $40 (with tip) for what I described above.  Water was free.\n\nGo somewhere else...", "author": "Sean C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-08-31", "description": "After all the stellar reviews, I decided to trek over from Queens to this place and give it a try. After all, it's a lot closer than Montreal for my fix of smoked meat. That being said, Schwartz's in Montreal was the standard I was using to judge this place. I also lived in Montreal for 4 years so my standard of poutine is up there.\n\nI came here on a weekday for lunch and there was no wait. My friend I ordered the 20oz smoked meat sandwich, poutine, and assorted pickles. We also had an iced coffee and Labatt Blue (highlight of my visit - fresh, not skunky and $3 only) and the total came out to $50. A bit pricey for lunch for two.\n\nDecor was simple and clean. The place was only 1/2 full but it was hard to hear my friend. I'm not sure what was going on with the acoustics in that place or if some people were just abnormally loud.\n\nThe assorted pickles comprised of mushrooms, pickles, beets, and cabbage. The mushrooms were very lightly pickled and nothing out of the ordinary. The pickles, beets, and cabbage were way too sour. Even my friend who likes sour things said they were way too sour.\n\nThe poutine did not even look the part. The gravy was all wrong - tasteless and semi-clear - poutine gravy is not clear, it's a deep brown and has flavor to it! The cheese they used was a strong and barely melted - poutine cheese does not have a strong taste and is generally melting. Lastly, the fries were burnt/hard but they tasted good, but fries in poutine are usually soft. Just missed on all counts. \n\nThe rye bread tasted stale. The smoked meat was comprised of lean and medium cuts of meat. The medium cuts of meat were very chewy and hard to chew but they had taste at least. The lean cuts did not have much taste and were dry as hell. It was not a very enjoyable platter to say the least.\n\nService was great. They took our orders promptly and were very courteous. They even had simple syrup ready for the iced coffee which was a very nice touch. A lot of places just give you sugar and it's impossible to dissolve that in a cold drink.\n\nI'm not sure why my experience was different than so many other folks. It could be the time of day or the person in the kitchen. Unfortunately, given the trek involved, I don't think I'll be coming back any time soon. Overpriced and overhyped, sigh.", "author": "James C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-08-25", "description": "Passed this place many times while biking down Hoyt Street before finally stopping in for their breakfast sandwich.  It was so good we went back the very next day and this time tried the egg salad sandwich which was supposed to have arugula on a black seed bagel.  When it arrived the egg salad (a mere dollop) was on a sesame seed bagel and had frisee instead of arugula.  When I mentioned this to the waiter he at first expressed surprise but quickly returned after speaking with someone to announce that they had run out of arugula and that they always make that sandwich with frisee anyway.  Huh?  Sorry, but not cool.  So, after spending $30 on 2 bagels and coffee (my fiance had the whitefish sandwich special which was also unremarkable) I think from now on I'll just keep on pedaling the next time I pass by.", "author": "Steve C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-03-30", "description": "All my friends who went to McGill go BANANAS when I take them here.  I'm lucky enough to live a 5 minute walk away, so fortunately, I don't have to wait a gazillion years to get one of those smoked meat sandwiches.  \n\nHere's a little trick for weekends:  come here early, before noon (when the smoked meats are available), order a light breakfast, chew slowly, then once it's noon, order lunch!!  Et voila.", "author": "Joan C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-21", "description": "EAT HERE. GET THE POUTINE. oh my god oh my god.\n\nthe restaurant is small so you may wait a while but if you love french fries, cheese, and gravy your life will be ok. don't worry. i also ate a steak and it was awesome but i didn't even care.", "author": "Miranda E."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-03-03", "description": "Very disappointing. For starters, it is definitely not worth the wait, especially for weekend brunch. I am not picky about portion size at all. I get full fairly easily and don't need a large amount of food for that to happen. But Mile End really takes the small portions to a new level that even I got upset and vowed never to return. The bialy with whitefish salad came with a small bialy and the whitefish salad on the side in one of those little silver pails that usually contains ketchup or mayonaise. CONDIMENTS. I couldn't even cover 2/3 of the bialy with a microscopically thin layer. Very annoying, considering it still cost $10 (one of the cheapest things on the menu) and I was hungry an hour later. I don't think expecting to be full for a few hours is so much to ask for. Will not be returning.", "author": "Sara K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-11-14", "description": "Besides the Anne Hathaway sighting (yes, she was getting a to go order with her boyfriend and adorable chocolate lab *I think*), Mile End deli is awesome.  At first, I didn't understand the whole concept of a Canadian Jewish deli, but darn was everything we had tasty! \n\nStarted off with a bottle of the Brut and the chopped liver and pletzel.  Initially, I didn't know what pletzel was, but with liver, you figure it must be some sort of bread.  It was a thick piece of bread, like a cracker, pita, pretzel combo, that was covered with sea salt.  The chopped liver (I know, I'm sure it sounds gross to most people) was some of the best that I've ever had! So flavorful and the consistency was solid...I was tempted to get a to go order to take home.  \n\nBetween the 3 of us, we had a Mish-Mash, which was a lox scramble with onions and greens.  Probably my least favorite, it was just a bit too salty.  I actually tried to order the smoked meat hash, which was brisket, potatoes, onion, and fried egg, but they were sold out. Boo.  The smoked meat sandwich was beef brisket on rye with mustard.  The 1/2 lb of brisket (I know, TONS) was soooo tender and flavorful with plenty to share! The Ruth Wilensky, which was a salami sandwich pressed on an onion roll, I did not try, but it seemed to be devoured quickly. \n\nBasically, I can't wait to go back and try EVERYTHING on the menu.", "author": "Jenny W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-07-15", "description": "I trucked all the way to Brooklyn for a nice date at Mile End, and the meat was very tasty, smoky and flavorful.\nI really enjoyed the poutine with the brisket on top, worth the trip, despite the impatient rude waitress who told me to wait outside, the food was delicious!\nI understand the place is small and crowded but its not what you say, its how you say it.\nIf the girl at the register was nicer I would make more trips here.  I returned the following week and the female owner was very pleasant.  \nToo bad it didn't rub off on her employees :/", "author": "Courtney B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-01-27", "description": "After a 2 week hankering for poutine, tonight seemed as good of a night as any to head over to Mile End.  It was slow, which was good because I seem to recall my sole other experience there including a ridiculously long line.  The beau and I decided we'd split the poutine, the smoked meat sandwich and the fried corn. The first sign that this was going to be a miss was the warm beer the waitress brought out.  When we asked for a cold beer she brought out another equally not-cold beer and explained that because the fridge was stocked so full, this was as good as it was going to get.  Seems like a fairly easy problem to solve, but I cost to go with no beer over warm beer. The corn came first, and looked like the most rock n roll corn I'd ever seen in my life. The taste however did not match its striking good looks, and was a bit bland.  The poutine was good although nothing to write home about.  The smoked meet was interesting. A little sweet, alot salty and kind of weird. I enjoyed it: boyfriend did not. The thing I think that was really sealed the fate of this place for me was the napkin situation. Our forks came wrapped in dish towels. These dish towels had a very pungent, moldy kind of smell. We spent $50 on the sandwich, the appetizer and the poutine; kind of steep for a deli meal.  \nFor whatever reason wet had two waitresses.  The red head was very nice, answered our questions and gave us a extra scoop if gravy for our poutine.  \nThe other waitress was not so great. Her response to our warm beer was \"we are doing the best we can\". When I asked for the pickles for my sandwich she said they might not have them for sandwiches because they are used for other dishes.  (I could see them behind the counter).\nAll in all it was a mediocre at best experience and I don't believe we will be returning.", "author": "Alyssa F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-28", "description": "Smoked meat sandwich to die for!\n\nAnd that's why we went, for the smoked meat sandwich.  But the chicken salad sandwich, with gribenes was great too.  Amazing french fries went great with the sandwich as did the fine slaw.\n\nTiny space and we waited for about half an hour on a Monday afternoon during Christmas week.  Ambience is just fair, we ate at the counter.  Perhaps not as comfortable as sitting at a table, but we had a show of smoked meat cutting right in front of us.\n\nAlmond mandelbroit for desert and we were good to go!", "author": "Elliot P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-26", "description": "Oh how delicious!!! What a cool place. Such a great, relaxed vibe. Bright and sunny. I sat at the counter which was a real treat to watch them cook the food. This is the kind of unique, forward thinking menu that makes you know you're in a great place. Basically take all the old Jewish deli classics and spin them around into new age, gourmet dishes. The burger I has was absolutely delicious with a fried egg right on top. I devoured this in about 30 seconds. One could argue that I went into beast mode. The beer selection was great as well. The best thing on the menu may have been the wonton chips which are just like you would get at a Chinese restaurant except homemade and they really blew me away. This is also a great place to go before a concert or sporting event at barclays center because it's not far away. We loved it so much we bought the cookbook!", "author": "Fred C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-12-08", "description": "Highly over rated and absurdly expensive.  I had a $14 sandwich that comes only with bread.  The amount of meat would have been laughed out of any other self respecting deli.  Matzo ball for $8, please!  This was my first and last order for \"poutine\".  There are so many other great places to eat in this are (including McDonalds) that this place must stay in business by accident.  And now I read in \"New York Mag\" that the owner called some complaining patrons \"mob wives\"!", "author": "Rick D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-27", "description": "It was very good. Friendly guy chopping up the smoked meat. The sandwich is a large if you're Minnie me. Wasn't as amazing as I expected.. But good none the less", "author": "Burt B."}], "servesCuisine": "Delis", "priceRange": "$11-30", "name": "Mile End Delicatessen Brooklyn", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "97A Hoyt St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/jL2-f-hVAwkXx5vELTD0RQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188527510"}