{"aggregateRating": {"reviewCount": 747, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-20", "description": "Would it be exaggerating to call my visit to Mile End my most anticipated restaurant visit of the year so far? Maybe not for the food, but for the drama. Here was owner Noah Bernamoff, an upstart Quebecois youth daring to challenge the NYC deli hegemony. And with spunk too: he was recently quoted as saying, \"When I see tourists going into Katz's, I feel a kind of rage. This is the food of my people, and places like that are turning it into a joke.\" He would have us believe that a Canadian is going to set us right about Jewish delis, about *pastrami*. He's got chutzpah, to be sure.\n\nWell, to be precise, Mile End serves Montreal smoked meat, not pastrami -- the curing process and spice mixture is different. And to be honest, that smoked meat sandwich is damned good. Hand-cut (like Katz's!) on barely adequate bread (like Katz's!). The hand cutting is interesting to see. In Katz's, their carvers work quickly, gracefully. The guy behind the counter at Mile End is much more awkward and painstaking, but he rewards your patience with chunks of meat that are never over- or undercooked.\n\nIs the meat good enough to erase all memory of Katz's? Hell no. All the foodies swooning over the added \"complexity\" of the smoked meat's flavors are kidding themselves -- an occasional bite of peppercorn does not complexity make. But it *is* juicy, and it *is* good, and it *is* as different from pastrami as Diana Krall's performance of \"Too Marvelous For Words\" is from Billie Holiday's. I can definitely see why someone who'd been raised on it would prefer it. But come on, man. Billie Holiday.\n\nI'm afraid I can't give much praise to their version of poutine. With cold, hard cheese curds insufficiently warmed by the heat of the fries and gravy, I sensed an opportunity being missed. I've never had the Real Thing in its native land, but I hope it's better than Mile End's. If Real Smoked Meat is significantly better, though, then Montreal is a lucky, lucky place.\n\nI was originally going to say something semi-snarky about how tiny the place is, how the waitress had to reach across me to retrieve every plate going out to the customers, how that was only partially mitigated by the fact that said waitress was dazzlingly gorgeous... But I'd be remiss not to mention something that didn't come to light until after I'd left the eatery.\n\nApparently I managed to drop some of the contents of my wallet outside the restaurant. After finding my stuff, they managed to deduce my phone number, call me, and even considered dropping my items off at my workplace before I said that was silly. They were unfailingly polite about the affair and, when I picked up my credit cards in person, seemed genuinely taken aback when I offered them a small cash compensation for their troubles. I literally had to force it into their tip jar. Oh, Canada.\n\nProbability of return within 1 year: 70%", "author": "Lawrence C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-04-28", "description": "Mile End only serves until about 4pm, but usually runs out of meat earlier in the day. We tried to go a few weekends ago. I even called ahead of time to make sure they had a strong brisket supply, but by the time we got all the way out to Brooklyn, a sign revealed our disappointment as they were out of meat by 2pm. I was very frustrated and felt defeated. I even left a little admonishing note on twitter to which the owners replied. They make a good point that they're a new operation and are filled to capacity most days. Still didn't change my disappointment.\n\nI am pleased to announce that on the Sunday that I schlepped out to Mile End once again, they kept their meat supply alive until almost 4pm (you can keep up with their daily inventory on twitter). Maybe they're now getting their act together. After about a 30 minute wait, we were seated at the bar, in the best seats in the house - right in front of Noah. Watching him slice the meat with precision, I got the sense that he was new to this and a bit overwhelmed by all the popularity. But he must have been doing something right because the smell of the spices and his knife skills made my mouth water.\n\nIn addition to the smoked meat sandwich, we ordered the poutine (french fries topped with gravy and cheese curds) which was a delicious gutbomb and the smoked salmon platter on a Montreal bagel (you know, because it was Sunday brunch). The salmon is made from wild king salmon and is also house smoked. The famous Montreal bagels are smaller and sweeter than their NY counterparts (and covered with sesame seeds).\n\nBut on to the real star of the show: the smoked meat. You have the option to get it as a sandwich or as a platter. The sandwich definitely equalled less meat, but this is my sandwich journey so I needed two slices of rye bread. And although Noah smeared only a spoonful of mustard on each sandwich (as is the Montreal tradition), I needed a bit more. Or so I thought.\n\nTurns out this meat is so good that it doesn't need anything to help it along (except maybe more meat). I can't begin to express to you the tastes, feelings, and joys that I encountered while eating this sandwich. It was amazing. It has so much flavor and literally falls apart in your mouth. The delicateness of the meat is something that most of the pastrami I've encountered in this city lacks. The small layer of fat was soft and not greasy or overwhelming at all. And the smoke and spices really light up your taste buds. It reminded me of both Jewish pastrami and Southern smoked brisket. Two of my favorite things in the world.\n\nThe smoked meat was reminiscent of Katz's in that its thick and tender and perfectly spiced. However, Mile End is changing the face of Jewish delis in New York and giving our old standby pastrami a modern and refreshing face lift. I just hope Noah (the owner) never decides to return to law school. \n\n-eatthisny", "author": "Brian H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-16", "description": "HUGE FAN of Mile End, but make sure you come early!  This place is very small.  I came with 4 other freinds and we waited about 20 minutes for a table.  There is also bar seating if you come with like 2 or 3 people.\n\nWe loved everything that we ordered: pickles, brussel sprouts (YUM), liver pate, poutine!, smoked meats (yum), duck proscuitto salad with persimmons, hot borscht, and we shared a bottle of red wine.  It was DELISH!!!\n\nService is impeccable.  Prices are reasonble.  Easily accessible from multiple subway lines.  Big Fan!", "author": "Diana N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-21", "description": "Of course the smoked meat and poutine are a major draw here, but they also have some great traditional brunch choices as well. The lox bagels are great and quite filling too.  I like this location a lot more than the NoHo spot because you can actually get table service.  I saw they also do Wednesday night burger nights and Sunday night chinese food too.  A fun place to stop by.", "author": "Matt M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-10-21", "description": "First off, I understand that MILE END is NOT the same as KATZ's, I've read on the wikipedias that smoked meat from Montreal is a different preparation than pastrami from New York and that makes enough sense to me.  \n\nBut I don't care, Mile End has taken the same cut of brisket and prepared it in a way that makes it less tasty, less juicy, and less good than KATZ's.  Like cheating boyfriends and girlfriends say when pressed, \"it was different\", and different does not always equal better.\n\nOther details: I came via reverse bridge and tunnel for lunch on a weekday, my friends and I were the first ones in the restaurant at 1130am and we got the freshest batch of smoked meat. The sodas were good, so were the pickles.", "author": "David M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-29", "description": "Cute cute place! \n\nI came here to sample the stuff that made my life good while I was living in Toronto. \n\nOut of smoked meat for sandwiches, I went with my original 0 oz of health consciousness urge and ordered myself some poutine with smoked meat. Holy fucking shit. Melty cheese curds, delicious frites, mushroom gravy...It was seventh heaven but I felt like I was committing a terrible sin. \n\nHis smoked meat hash was good as well, but it could have done with larger chunks of meat. \n\nThe staff was wonderful and accommodating, bringing us huge mugs of Stumptown and complimentary pickles (refreshing, crispy, light on the garlic) after our order took a while. We didn't mind the wait, it was great to see how the place functioned. I'm really amazed by all the effort that's put into the products of Mile End. If you read the back of the menu, there is a glossary describing the time and processes of production. It's amazing. While I can't get behind the Montreal bagel craze (dude, i might have gone to school in Canada, but I'm a NY girl and I know our bagels are better), they bring them down from Montreal every weekend. 20/dozen. \n\nI can't wait to come back her for a sandwich and then take another walk down Atlantic to admire some antiques.", "author": "Briana M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-12-09", "description": "You get exactly what you expect here: smoked meat and cheesy fries. The brisket is delicious, and makes a great sandwich if fries, slaw, and plenty of mustard are added. My only complaint is that it is a bit pricey (about $35 for two people...at a diner!), and that some of the food was not as great as it should have been.\n\nFor starters, why are fries, which probably should just come as a side to the sandwich, $5? When you order slaw you get a bowl small enough to classify it as a condiment. At $9/sandwich, basic amenities beyond mustard should be provided. Also, the bread, is small and crumbly, not at all the dense and rich rye the brisket deserves. Their menu is a bit sparse - this place is really a one trick pony, but deserves a try.\n\nPS - The place is really small, so if you don't want to wait in the vestibule, go at an off time.", "author": "Steven J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-20", "description": "must get chopped liver and smoked meat.\nthe smoked meat is pretty fatty but not in a gross way. though, i couldn't eat the whole thing I'm confident that everyone else can and more.\n\nthe borscht is ok.\n\nWould definitely come back and must get chopped liver every time. they do run out, so don't show up too late.", "author": "Elaine L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-10-22", "description": "I was excited to finally try this spot and then $40 and two bagels later, I was bummed.  We were disappointed in these things: portion sizes, watery egg salad, really thick/fatty salmon slices, and pricing.  We have eaten lox \u0026 bagels in the Mile End hood of Montreal so had expected to love this spot, but alas, we did not.  Very happy we decided at least to get take-out and not wait for 40 mins for a table.", "author": "jm s."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2010-07-31", "description": "I had high hopes for Mile End Deli.  Unfortunately, the restaurant does not live up to the hype.\n\nMy boyfriend and I shared a brisket platter and the Ruth Wilensky.  The brisket was not good, and they didn't have Russian dressing, to boot.  This was supremely disappointing.  The salami on the Ruth Wilensky was skimpy.  Lastly, the place is way too expensive.\n\nI frequent delis, especially in Manhattan and Brooklyn.  I was excited for the \"new, niche\" deli.  Mile End has a great space and an excellent atmosphere.  The idea is so awesome in theory, but its implementation misses the mark.\n\nHonestly, David's House of Brisket has way better meat.  But, since they have no ambiance, they don't get all this hype!", "author": "Alexandria G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-04-27", "description": "This review is only for their bagels. I've not been to the actual shop, but I did buy a dozen bagels from them at the Hester Street Fair.\n\nSo the bf lived in Burlington, VT for several years, where he had become a fan of Montreal-style bagels from this one particular shop. I got to try some while visiting and thought they were awesome as well. \n\nWhen I heard this place will be offering these bagels, I pre-ordered a dozen bagels (half sesame, half poppy) at the discounted price of $18/dozen. That's $1.50 a bagel, so these better be some darn good ones.\n\nMeh. Neither of us cared for the slight chewy consistency (this was after we toasted them), and we thought the dough was bland--it definitely needed some salt. Overall they were ok, but at $1.50 each those bagels were overpriced--and I just read that they're actually imported from Canada, not made here in Brooklyn? That just seems like a waste of resources, especially for something not so great. Or maybe they're not so great because they're not fresh bagels. Either way, not the best idea.", "author": "Anna C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-19", "description": "It just doesn't get any better than their smoked brisket sandwich. My son got me the cookbook for Christmas and it's also fantastic!", "author": "Jerry H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-27", "description": "Came here with my boyfriend on Sunday afternoon to grab a quick sandwich. We both ordered the smoked meat briscuit on rye with mustard. Very delicious meat! Great sandwich! \n\nThe only negative I would have to say about this palce is that it is too small and cramped and the canopy thing they have going on is pretty suffocating for summer months. BUT the sandwich is great!", "author": "Siv L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-11", "description": "No a place to go if you want to lose weight or eat healthy.  Every thing pack with favor and cheese, bacon, meat ... whatever!  Service was personal.  Waiter was cool. Decor and crowd was friendly.  Very trendy and cool place.", "author": "Tony W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-12-18", "description": "without a doubt one of my favorite stops in all of nyc. The smoked meat melts in your mouth, whether eating it on a sandwich, or as part of the hash brunch (complete with sunny side up eggs). I've been known to make trips from Brooklyn to the east village/LES on late friday nights just to bring back a Katz sandwich, but now I no longer have to go farther than mile end, which is literally just down the street. \n\nI'd also suggest trying the cinnamon bun they have on the weekends as part of their brunch offering as well. This place definitely ranks in my top 5.", "author": "Abdul S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-07", "description": "Love this small place. The meat is just great and some if the best fries I have ever had. It has a very small seating area but very cute. The only reason I font give this place five stars is that though the smoked meat is always wonderful it never taste the same. One day it can be very peppery one day more salty.", "author": "Madam U."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-29", "description": "I'm sorry Nana, but this matzoh ball soup was the best I've ever had, as was everything else...\n\nThe warm chanterelle salad was gone in less than a minute. The mushrooms were perfectly tender, the radicchio generous and bitter, and the dressing a successful salty-sweet balancing act.\n\nThe smoked meat deluxe (plus poutine) was other-wordly.  The gravy on the poutine was delicious but thin, allowing the flavor of the fries to shine through.  I can't stop thinking about the succulent smoked meat, and the bread was perfectly mustard-ed and masterfully toasted - firm enough to cradle the stuffins but soft enough for an effortless bite.  \n\nThe smoked chicken was just plain amazing (and no, ordering two smoked dishes was not too much smoke, it was just good).  The texture of the rye gnocci was a heavenly cross between a korean steamed bun and a marshmallow, and Mile End gets bonus points just for using the word schmaltz.\n\nThe special, kasha varnishkes, was a surprisingly modern, deconstructed take on the traditional dish.  Instead of farfalle, a large thin sheet of homemade pasta was delicately draped over the cereal grains, and while I couldn't actually see what the rest of the dish entailed (by that time we were eating by candlelight), it too was memorably mouthwatering.\n\nThe only negatives were the pletzel (a not particularly special flatbread), and the hostesses/servers, who could each use a slice of humble pie.  \n\n... and speaking of dessert, the pumpkin cheesecake was seriously incredible.  You must try out Mile End.  It's all just that good.", "author": "Alyssa Z."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-04-02", "description": "I always bring my out of town visitors here. Staff is great, food is amazing, I'm never disappointed. Poutine is off the hook, brisket sandwich is delish, always get a fun soda, and the boys cutting the meat are never hard to look at...they're all sweethearts and seem to enjoy what they do. Place is pretty busy on wknd afternoons (brisket is served around 12) I would suggest going right before 12 on a weekday or ordering ahead. Or hell, go before go early and have breakfast because it is also amazing!", "author": "Molly D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-02", "description": "Cool spot.\n\nThe decor is very minimal and chic. Props for actually having a counter that you can sit at, it is a 'deli' after all. I really enjoyed watching them cook and slice up my smoked beef brisket. Which while delicious, was not the star of meal.\n\nPoutine.\n\nThis poutine is outrageous.\n\nNot only were these some of the best fries I have had in a long time (They rank up there with the potatoes from Taim.) but the gravy/cheese combo slathering them was downright amazing. I was nearly in a food coma after inhaling them.\n\nMy only real complaint was the tiny plate the sandwich came on. Please put it on a bigger plate, it was annoyingly small for a sandwich that obviously is bound to fall apart after the first bite. Also, it couldn't hurt to come on bigger pieces of bread. \n\nAll in all, good service, good food, and minimal attitude. I'll be back.", "author": "Matt M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-28", "description": "Very delicious. Had the smoked burger, which was delicious in spite of being a bit salty. Would go back to try the brisket sandwhich and poutine.", "author": "Nick L."}], "servesCuisine": "Delis", "priceRange": "$11-30", "name": "Mile End Delicatessen Brooklyn", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "97A Hoyt St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/jL2-f-hVAwkXx5vELTD0RQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188527510"}