{"aggregateRating": {"reviewCount": 747, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2019-03-25", "description": "The Poutine will cure a hangover like nobody's business. Wait can be irritating but place is small- only other snag is the coffees pretty bleh, otherwise a good neighborhood spot", "author": "Ciara S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-17", "description": "Delicious breakfast with staff nice and friendly. I had very good French toast and classic breakfast. \nAll the ingredients were fresh and tasty. Orignal place. You can go !", "author": "Loren S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-25", "description": "Delicious Jewish style deli located off Atlantic Avenue. A bit of a wait and because it's really small there is not much room for strollers. Regardless, we brought in our car seat and got to enjoy a delicious lunch but be prepared to wait 45min to an hour on at their busy times.\n\nGot the turkey ruben, smoked brisket sandwich along with a side of fries. Definitely favored the brisket sandwich. Next time I return, I want to try more of their signature dishes like the poutine and other appetizers.\n\nThe pricing is fair compared to other delis like this. I will definitely be back and would recommend this to others.", "author": "Alex B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-03-19", "description": "Went here today for a Ruben. The sandwich was good.  Nothing to \"slap yo mama\" over but it was good. The taste of the food certainly does not justify the price. The service was....well there was none.  The lady who was taking orders kept her back to me.  I said excuse me 2x before she acknowledged me. Her acknowledgement consisted of yes you can place an order with me but I am taking care of something now.  Oooooh ok.  Never will I return.", "author": "Cylantro D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-27", "description": "Absolutely love this delicious local gem - perfect for a savory brunch and coffee. Potato latkes are to die for!", "author": "Jay N."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-01-08", "description": "This is for pick up order only. \n\nI've really really tried to like this place. I've been here 4x times to get a bagel order for my pregnant wife. They have been 100% effective getting the order wrong. Normally I wouldn't write a review for take out but the attitude of the young lady working the register this morning prompted me to do so. \n\n1/8 8am I phoned in our usual order. Toasted Everything bagel with scallion cream cheese and red onion sliced in half. This is not a very hard order especially when there are literally no customers. I arrived about 10 min later to pick up as she told me to do.  \n\nShe looks up from her texting when I arrive to acknowledge my presence and gives me my total. As I hand her my card I ask is this my order? (The ticket on the bag says schmear cream cheese no capers. I tell her \"it's for my pregnant wife so I just want to make sure the order is right\" as I open the bag. She says to me you don't need to check it's right. And lo and behold. It's an everything bagel loaded with capers. I ask her to refire another order. \n\nWithout even apologizing or acknowledging the error she hands the bagel to the line cook and he asks \"so you need a new one or can I scrape the capers\". The lady has gone back to texting furiously so I nod to the cook to toast a new bagel. \n\nMy issue isn't with getting an order wrong (as simple as the order might be). It's with the attitude of the cashier and how zero effs they have. A smile, a word of apology, something would be better than the lack of empathy. To top it off she looked at me incredulously when I took the order from the chef and said \"I got this\" instead of letting her slowly put it into the bag that was already ripped from reopening the bag when I checked the order the first time.", "author": "Peter K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-22", "description": "Came here for their poutine week. This place is small. 3 tables of 4, 1 table of 2 and 5 by the counter. We came on a Friday night and the wait was about 20 mins for 2. Not a lot of people waiting to be seated. We were seat d at a table of 4 and we had to share a table with another party of 2 who hogged all the condiments.. It was really hot in there and the water was warm. There were also a lot of flies flying around... \n\nOverlooking all of that, I ordered the Mac and cheese poutine and my bf ordered the big macher. The Mac and cheese poutine is Mac and cheese over a bed of tater tots with cheese curb. It was cheeseiliciuos! A little salty but the tater tots were still nice and crunchy with the melted cheese on top. The burger was pretty good as well but I think it was a little pricey. I really like their pickles. \n\nDespite the environment the food was pretty good. \n\nThere's also street parking on the other side of the street.", "author": "Daisy C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-29", "description": "Loved it. \n\nA morning of hangover was cured by this inconspicuous beauty. The salamis on my.plate were great, and so were the fries, so soft and yet, crispy. Coffee was like my wake up alarm for the rest of the day. Eggs were not just eggs but a source of protein for my then empty stomach. \n\nWill definitely go there again for some good times.", "author": "Santanu B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-07-08", "description": "Oh how I wanted to love this place, I really really did. \n\nI had the Trudeau and neither Justin or Pierrre would approve. \n\nUnfortunately this place knows nothing about the two most important things: montreal smoked meat and poutine. \n\nMontreal Smoked Meat: please people work on the recipe and understand how to cut the meat. That last point is absolutely crucial. Recipe off. Cut/leanness off.\n\nPoutine: for some reason people think poutine is easy. It isn't. \nFrench Fries: crispy crispy crispy - first the fries then the curds then the gravy. NO OVEN! let the fresh fried fries and HOT gravy do its work.\n\nGravy: you got it wrong. proper poutine gravy is a deep chocolate brown that runs 'wet', not 'thick' and almost congealed. \n\nCurds: hard to 'f' that up, ya kinda did. \n\nService: meh at best. \n\nSigh, ugh, bah...\n\nAt least the Molson is spot on.", "author": "Jimi J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-04-24", "description": "The Passover food was delicious, which made up for the unfriendliness of the sales girl both times we dealt with her.", "author": "Robert F."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-02-01", "description": "In town for the weekend and hanging with family at Brooklyn Inn when I wanted some grub. Was sent over the the Mile End to get a sammich to eat as I had not had dinner from my flight in from Venice. Got inside the deli at 9:10pm and was told they were closed. Showed them the site that says they are open until 11:00. They said no. Asked if they could make me a cold deli sandwich and they said no. Giving two stars because my sister and her boyfriend said the food was good. Don't know as I couldn't get any sammich. \n\nJust think a place should stay open for the hours they market to the public.", "author": "Dan F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-12-09", "description": "Expect a wait. This restaurant is oh so tiny and oh so cramped. Not the best set up but I'm happy we waited the thirty minutes for lunch on a Saturday because the food was tasty. The smoked meat sandwich and the Reuben were both excellent and fair for the price in my opinion. Very delicious! I recommend skipping the matzo ball soup, though. It's such a small bowl, nothing to write home about, and unbelievably over priced. Stick to the meat sandwiches and you'll be happy.", "author": "Sol C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-09", "description": "Mile End is one of my favorite spots in Brooklyn. My boyfriend and I have monthly dates where we go in for coffee and the Poutine of the month. I'm always surprised by how creative they are. The service has always been good and I have never been disappointed by the quality of the food. I'd definitely recommend for anyone looking for a cozy spot to catch up with friends over some DELICIOUS smoked meat and fries.", "author": "Katlyn S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-27", "description": "With few options for 'indulgent' food available over this most recent Passover stint, I happened to stumble upon a miraculous instagram post for matzah tacos...SOLD! (set of 3 tacos for $12, not crazy...and for being quasi-kosher-for-passover, not too shabby).\n\nI made the trek out on a Friday afternoon, though by the time I got there, they were sold out of the brisket variety. I was honestly pretty bummed, but so be it. The other varieties were chopped liver with gribenes or reuben. \n\nI decided to rock my super traditional side and go for the chopped liver - and they were awesome! The matzah taco shell had a great, crunchy yet somewhat chewy texture (and for being matzah-derived, actually had flavor!). The chopped liver was creamy and divine, with the crunchiness of the gribenes for texture, and pickled onions to cut through it all. Amazing.\n\nI, for one, would recommend they keep the matzah tacos on the menu year round!", "author": "Steve L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-11-30", "description": "Something happened to the smoked meat at Mile End. Something bad!\n\nI've been going for years and loving the moist and flavorful smoked meat. Most recently, the smoked meat was tasteless and gummy in texture because it was mostly fat. My husband felt sick after the sandwich it was so fatty (and this is coming from two people who always order moist, not lean, brisket when given the choice).\n\nOne of the chefs left recently--is this why the quality of the smoked meat took such a nosedive?\n\nService was meh but that doesn't very much bother me in NYC. Poutine was still good, which earns two stars.", "author": "Vivien N."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-03-10", "description": "Just an update, I have come back a few times to Miles End from my initial visit in 2012 and wow what a change!  It's gone from a nice restaurant that sells complex interesting dishes at dinner to well just a sandwich shop. It's sad really because the dishes they made really worked. I found them much better then the sandwiches. On my last visit I came early in the day and it was pretty quiet.  We ordered some sandwiches and well I ordered matzo ball soup. I had thought they would be good at this type of food. Well, nothing we ordered stood out from a reg diner\n\nMatzo ball soup tasted like dirty water! Absolutely no flavor, not even salt would help this soup. There was a large sprig of Dill, mushy veggies and well a large wet piece of bread that resembled a matzo ball with no flavor! \nA sad soup!\n\nA duck grilled cheese- the cheese at best was nothing special. It almost looked like kraft? I thought maybe the duck would have been shredded but it wasn't it was super rubbery. The bread was super greasy. The egg was weirdly placed right on top.\n\nPotato pancakes- They were good but a tad dry and possibly needed a little more seasoning!\n\nWe also had a Reuben it wasn't special. Just very small.\n\nOne thing that was super annoying, very rude and Disgusting the waitress was sweeping while we were eating! Who does that !!  Gross!! \n\nI hate to say I prob won't be back. Much better places that deserve my business and money.", "author": "Kim G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-01", "description": "Really fine breakfast for Usedtabe and Wannabe Jews. I'm mean, yeah, Jewish style food but with bacon. Which is the official meat of so many of my Tribesmen nowadays anyways. \nBut the outstanding meat at Mile End is the smoked meat Montreal style. It's really good..not fabulous like Snowden Deli or Schwartz's but damn good. The prices are ok for NYC but they sure ain't Montreal prices. \nAll in all, you can't go wrong with this cute little ersatz homage to Jewish Montreal the way it kinda was back in the day.", "author": "Moe B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-09-28", "description": "For MealPal users -- be wary of Mile End Delicatessen in BK.\n\nFor those who don't know what MealPal is, it's a lunch subscription service that allows you to order your meal online the night before so that it's ready at a selected time and you don't have to wait in line.\n\nI've gone to Mile End Delicatessen via MealPal a few times and the lunch has never been ready, but not a huge deal -- I've patiently waited (10-15 mins) for them to make it. And although I try to get to the front of the line, I'm not verbally or physically shoving people out of the way to get there.\n\nI won't be going again after the way I was treated today. I walked up to the window, admittedly eager to let them know I had a MealPal pickup knowing I'd have to wait a bit on top of that. I politely said excuse me to the person I thought was hanging out by the window, with no issue or protest on her part. Unfortunately, I didn't notice she was still finishing her transaction because no one appeared to be attending her. \n\nWhen the cashier finally resurfaced she rudely scolded me for \"cutting the line.\" I stepped back and let them finish. When my turn came up, I explained that I didn't realize she was still finishing her order and reminded the cashier that the whole point of MealPal is to actually allow you to skip the wait. She then exploded on me and threatened to cancel my order. Even when I reminded her that I had already paid for it, she continued to threaten to cancel it.\n\nOnce I got my order, it wasn't even what was posted on Mealpal -- instead it was some gross mix of turkey, avocado, mustard, and coleslaw that I didn't end up eating. Unclear whether that was deliberate or an oversight on their part.\n\nIf this business is going to scream at MealPal customers for following MealPal's instructions which literally tell you to go to the front of the line, it shouldn't participate in the service. And frankly, if they're going to speak to customers like that, they shouldn't be in business period.\n\nAlso, the food at this place isn't bad (hence the 2 stars) but nowhere near good enough to justify being treated in such a way.", "author": "Andrea N."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-05-29", "description": "There is no way in hell that I just had an authentic smoked meat sandwich. Not. Even. Close. \nSorry, Brooklyn. This was a real disappointment.", "author": "Kenneth H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-05", "description": "I was really excited to try this spot and any place that names a sandwich after Larry David is a winner in my book. \n\nThe food was great. I got the Rueben, it was delicious and pretty huge. \n\nThe service however was, as many people have said, 'meh'.  I was catching up with a friend who I hadn't seen in ages. We ordered coffee and the server came around a couple times for our order after. We asked if we could have a bit more time as we were doing more chatting than menu browsing. After 5 minutes the lady at the cash register yelled across the counter asking if we were ready.  \n\nLook, I get it if you're busy. But the place had several tables available and we were sitting at the counter (also with several spaces available). By the end of our meal we felt uncomfortable eating there as the lady behind the cash register kept shooting daggers. \n\nStill, 3 stars because the food was good.", "author": "Charlie R."}], "servesCuisine": "Delis", "priceRange": "$11-30", "name": "Mile End Delicatessen Brooklyn", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "97A Hoyt St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/jL2-f-hVAwkXx5vELTD0RQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188527510"}