{"aggregateRating": {"reviewCount": 747, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-09", "description": "Just had an amazing breakfast here. Coffee was just right to go along with their incredible hash and eggs. The waitstaff are pretty awesome too. \nLook forward to coming back here again.", "author": "Christopher S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-09-03", "description": "it's always a letdown when a sandwich rolls out and you pick up the bread but find it lacking springy freshness. that and the lackluster pickle disappoint. meat itself is ok. if you're worried about stuffing yourself on an overly meaty sandwich, Mile End won't be that. it's alright but probably will go somewhere else here for deli and await Schwarz's for next smoked brisket.", "author": "Rick S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-12-27", "description": "Dear Mile End,\n\nWe are neighbors.  I live right up the street.  I have always enjoyed your food.  But, today, I stopped in for a hot dog to munch on during my walk to the park and had a terrible experience.  In my 53 years on this earth, I have NEVER been subjected to more abuse by waitstaff than I was today.  I had to walk out with no hotdog in my hand and only a heart full of sadness that I will no longer be able to enjoy your tasty treats.  I wish our break up had been due to moving away or a closing, but alas, it was due to rudeness, arrogance and someone forgetting why the doors of that business are opened every day providing them with employment.", "author": "Steven L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-08-18", "description": "I came here for a delicious corned beef sandwich........\n15 dollars plus tax later I got two pieces of rye, with some dry beef in it.  I should have went with my gut and gone to Katz's. In summary mile end is overpriced junk", "author": "Eric D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-05", "description": "Tony and Dan are ultra dope! This place is so amazing, great service and food in a cozy environment. A must try!", "author": "Steph L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-15", "description": "Food was great! Got the specials of the day French Toast and the Lamb burger. Yum! The poutine was very yummy!  the server could have put on a smile. Guess she doesn't really want to be here. Overall a great little place with yummy food!", "author": "Ashley E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-14", "description": "I have stopped in here several times over the years for breakfast, usually opting for the delicious smoked meat hash.  This visit I grabbed a few lunch sandwiches to go: Ruben with corned beef and a Smoked meat sandwich. Although I did not, I could have finished both sandwiches by myself. That is my only complaint; portion sizes are small compared to the respective menu prices.  But you cannot beat the quality and flavors. And the staff are always friendly and accommodating.  Mile End has been and remains one my favorite restaurants.", "author": "Michael S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-09", "description": "Yum! After owning the cookbook for 2 years I was so excited to finally make a trip in to the deli. My husband and I came in for brunch on a Sunday. We didn't realize how small the space was but walked in at the perfect time and only waited about 10 minutes. \n\nService and staff were very friendly and made everything run smoothly. \n\nI had coffee which was delicious. I also had the smoked meat hash. It was so so good. It seemed like my portion was a bit light on the meat portion of the hash but the flavor was oh so good. The chives on the eggs were the perfect addition. \n\nMy husband had the smoked meat sandwich combination. The sandwich was oh so good. Like we're both still wanting it again today. The fries were perfectly cooked and the pickles were heavenly. \n\nWe wish we had tried the poutine but the prices are a bit high already and we couldn't imagine paying $24 for a sandwich and poutine. \n\nI am glad we had a chance to come eat and will definitely be back. There are many other menu items I want to try!", "author": "Michelle S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-17", "description": "The food here is so lovely! Come here for early seating! Curly decorated and a nice atmosphere. Right off the main drag of Atlantic. Convenient!", "author": "Sarah E."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-05-28", "description": "So salty it hurts. The fries were loaded with salt, the poutine was covered in a thick flowery gravy, and the meat itself was just ok. Basically, this place lacks the authenticity of a real Brooklyn deli. I left feeling very dissapointed.", "author": "Jacob U."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-05", "description": "This is a very tiny deli, 4 family styled benches that can seat six per table comfortably.  This is a great little neighborhood restaurant but plenty of street parking in case you wanted to drive.  You just have to be lucky and wait for someone else to pull out.\n\nThe service is attentive and friendly as well as providing suggestions when you are stuck.  They have specials so always ask so you know you have options.  We had Sunday brunch which was a lot of food for the seven of us.  We sat together as a family, a bit tight and even more so after finishing our meal.  The poutine was very good, fries was crispy, cheese curds didn't have much flavor.\n\nThe challah french toast as a brunch item was very good.  Nicely crusted from the grill outside and soft in the center served with grilled bananas.  I was a little disappointed with the Montreal smoked beef (brisket) as it was a little lean and dry.  The server suggested that in future visits I order the fatty cut but not sure if my doctor will agree.  Just like any good deli, they offer Dr. Brown's sodas which of course is top shelf stuff in the world of sodas.\n\nOverall service was very good, food was good with the exception of the dry smoked beef but I will visit back to try the fatty cut of the brisket but won't tell my doctor.", "author": "Wai W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-18", "description": "Delicious chopped liver and fruit cup. \nSmall restaurant using family style bench seating. \nVery fast friendly service", "author": "Do S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-18", "description": "Living a block away from Mile End, Gibson H. and I come quite often for an evening snack and drink...or just dinner. We try to avoid this place during weekend brunch because there's always a wait due to the lack of seating (very small space with limited seating). Come for a late dinner or before 5:30pm to avoid waits.\n\nService and staff area always very nice. Love the poutine and the chicken liver pate. Great selection of beers. Their sandwich is a bit pricey but it is what it is--and I'm down to pay for it every so often :)", "author": "Ashley L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-11-07", "description": "Had the corned beef Reuben, which was excellent, though not huge. But was it $14 good? I dunno... Debatable. And $14 doesn't even get me a pickle on the side?C'mon man! \n\nI've lived in the hood since before they came along, and the lines are so ridic that this was my first time. I guess I'd like to try more smoked meats and poutine, but I doubt I'd stand in line to do so.", "author": "Kevin R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-03-03", "description": "Went for the Smoked Meat sandwich, left feeling very hungry.  A little meat and bread. That's it. Not even a slice of pickle.  I love deli and was very excited to try this spot, and it ended up being my only disappointing meal on this trip. The people were pretty nice --but not enough that I would return.", "author": "Molly W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-10-27", "description": "Portion of smoke meat is way down, used to be my go to spot for my \"smoked meat\" fix, kinda disappointing for the price.\nService is friendly, place is spotless, usually an interesting playlist on in the background.\nNeed \"full sour pickles\" as well.", "author": "James A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-08", "description": "Mile End catered our wedding party this summer, for 80-100 people at an art gallery around the corner. Many, many of our guests commented on how good the food was--one of the highlights of the affair, for sure. Joel and the crew were mensches, all, nailing pretty much everything down ahead of time, talking me through options on the phone, and then having it all under control during the wedding, from setup to utensils to quantities to service. Also great dealing with vegan options, which you don't necessarily expect from a place known for foods in the Montreal-meatatarian style.", "author": "Jeremy K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-10", "description": "I would give a five star if it was little cheaper. Still worth it? Absolutely. The midwestern in me feels that there is something wrong about a tiny portioned greasy food. But still delicious! I have only been here for brunch but I am curious about their dinner menu too. Tiny spot so not ideal for big group but fun place to stop in for a quick breakfast!", "author": "June K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-06", "description": "I had been hearing big things about Mile End Deli for quite some\ntime and had to try for myself. With delis once being a New York\nCity staple now vanishing like buffalo on the prairie, Mile End looked\nto be a delight. A tip for anyone coming here on the weekend - \nplan to wait quite a bit. The space is intimate, but not overwhelmingly\ncrowded. I went with a ladyfriend of mine who lived nearby and \nshe arrived just in time for us to snag two seats at the counter\nby the kitchen.\n\nMile End is a brilliant take on Jewish delicatessen with a French\nCanadian twist. I went with the poutine. Now, a side note: I got\nhooked on poutine thanks to a trip to Toronto. While I've had it\nat a couple of other places, Mile End served up a version that\nwas authentic and DELICIOUS. Paired with a cold bottle of \nLabatt Blue? man...i even tried the smoked brisket scramble\nand that almost, ALMOST tempted me to order that too but \nthen i would've had to walk to Queens to burn that off. Mile \nEnd is a jaunty, great place; sitting at the counter while the \nchefs chopped up and sliced the meat before you was a real\ntreat. I can't wait to get more of this comfort food the next time\nI happen to be on Hoyt.", "author": "Christopher S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-02-14", "description": "The few things I've had (vegetarian) where good and pretty high quality.  What annoys me about this place is their ever changing \"rules.\"  I feel like every time I have been there has been some new policy mandate that means you either can't get what you used to be able to get or there is some new hoop to jump through.  Inevitably whoever is telling you this new rule is a real jerk about it.  Hipster service belongs in hipster brooklyn, not stroller brooklyn.", "author": "Sarah M."}], "servesCuisine": "Delis", "priceRange": "$11-30", "name": "Mile End Delicatessen Brooklyn", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "97A Hoyt St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/jL2-f-hVAwkXx5vELTD0RQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188527510"}