{"aggregateRating": {"reviewCount": 747, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-27", "description": "I had the three-egg veggie scramble with rye bread, which also came with hummus. The meal  was very tasty - shout out to the freshness of the veggies, which made all the difference. The coffee was decent.\n\nAn area for improvement is the service, which comes across as slightly abrupt.", "author": "Adrien M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-17", "description": "As a very particular and fussy person, I must say that I was handed perhaps one of the Best Corned Beef and beautifully prepared sandwiches ever! Steamed in an aromatic bath of pickling spices, NOT overdone, meticulously sliced, this tender slab o' cured beef presented itself quite splendidly on their artisan bread. Paired well with the crispy fries and dipping sauce. Nice job Meistro... keep up the good work!!", "author": "Ken J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-21", "description": "The Black Seed Sesame Bagel with a schmear (ben's cream cheese, tomato, onion, capers) is ridiculously good.  I've never had a better bagel sandwich in my life!  And it only costs $4.50 for the experience.  Yum.  If you want to add smoked salmon (\"beauty\" on the menu), that'll be $13.50.  The bagel and poutine are for me, their claim to fame.", "author": "Jennifer C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-11-24", "description": "Unless you're part of Mile End's \"in\" crowd, expect some of the worst service you can imagine here. We waited quite awhile to order, and it was AGES before our meal was actually served. The couple sitting next to us arrived well after we did but seemed to know the server. Their order was taken in less than five minutes, and we watched them eat for an hour before we had our mains. Sad.\n\nThe last time I'd been to Mile End (before this recent disaster), the owner recognized my date--the head of marketing for a prominent New York City chef and restaurant owner. He elected to dote on us, delivering free appetizers, desserts, and drinks, and inserting himself in our conversation to the point where it felt like an unwanted threesome.\n\nSo unless you went to high school with a Mile End server, or you're Thomas Keller's publicist and want your ass kissed, take this restaurant off your list.", "author": "Jeff H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-25", "description": "Mile End is located in the Boreum Hill section of Brooklyn. I had some time to kill in the area, so I ventured over the Brooklyn Bridge to meet up with some friends and to catch up on small talk over lunch. We decided to meet up at the Mile End Delicatessen, located at 97A Hoyt Street (between Atlantic Avenue \u0026 Pacific Street) in Brooklyn.\n\nI had the smoked beef brisket sandwich on sliced rye bread with mustard. The brisket sandwich was enough for one person, but not enough for two. It was so delicious and moist; I ate the whole thing while savoring every bite. The beef brisket meat was flaky and tender, it fell apart easily, along with the coleslaw that was a bright and well seasoned (light and bitter with vinegar) and came with a crispy pickle.\n\nMy friends tried the poutine (french fries topped with gravy and cheese curds) which was a delicious stomach grenade and the wild king smoked salmon platter on a Montreal bagel Apparently, Mile End import their bagels into Brooklyn. I found the Montreal bagel to be much sweeter and smaller in size than a Brooklyn Bagel.\n\nI thoroughly enjoyed my meal at Mile End. Bring a group of friends so that you get the chance to sample many of their fine smoked meats and platters. I can highly recommend the Smoked brisket with potatoes, onion and egg platter. Space is limited at Mile End (four tables \u0026 five stools) and they generally run out of smoked meats early, so get there early or be prepared to wait.", "author": "Steve N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-23", "description": "I'm happy to say that after giving Mile End a few more tries, it's now one of my favorite restaurants in the neighborhood. Initially it seemed to be finding its footing with snobby staff and okay food. But over the last year everything has improved, especially the service.\n\nYou can't go wrong with any of the smoked meats (whether it's hash, a sandwich or topped on fries) and there are usually really creative specials on the board above the bar. My favorite dish tends to be the classic poutine, but if you find yourself here on a weekend they have a breakfast version that is #$%\u0026ing amazing.\n\nThis is a perfect spot to take carnivorous dudes, so ladies keep that in mind if you want to treat your fella to a manly brunch.", "author": "Sarah G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-28", "description": "Checked out this place with a coworker during lunch, as it's just a couple blocks from the office. I'd never had Montreal style smoked meat before and I thought it was delicious! There was a bit of a wait for a table because it was lunch time and the place is tiny, but there are benches outside and it was just a 5 minute wait. \n\nWe ended up being seated at a shared table, but it was roomy and comfortable. I felt the food was a little pricey for the portion size, but I can't complain about the quality. Both of us ordered the smoked meat sandwich and approved. I'll probably be back to check out some of their other interesting dishes on the menu.", "author": "Jasmine F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-13", "description": "Came here for brunch yesterday before church because I didn't want to settle for McDs or random pizza.\nThanks for all the yelp reviews.\nI had their hash. Eggs was perfect.\nService was great. Seating wasn't a problem... I sat at the bar. Love the atmosphere and vibe.\nKind of on the pricey side which is why I'm minusing a star.\nThey have an interesting menu and dishes that they serve.\nIf you're in the area, have breakfast here.", "author": "Jewelyn T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-08", "description": "Let's start with the space here. It's rustic, intimate, cozy, and very welcoming. Spend a minute in here and your stomach will hunger for a hearty meal. The service is lightning fast and the petite kitchen is right in front of you with it's fine cooks making everyone's meals right in front of you. The meal portions are perfect. The food tastes so fresh. Everyone else's meals surrounding me looked just as good as the one I ordered. Eat here!", "author": "Alec B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-28", "description": "The smoked meat poutine is serious! Like nothing I've had before... Worth every penny. The staff were also very nice and extremely friendly.", "author": "Julie M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-20", "description": "I went there Saturday (st. Paddy's day) and tried to order a corned beef sandwich, but was instructed that they couldn't go \"off menu.\" I was told I could order a sandwich with Russian dressing and Swiss cheese and take those things off. 1. There was no consideration for allergies or why I was ordering the way I was and 2. The woman's tone was completely unacceptable. I've heard good things about this place from reputable people so if you're okay with unnecessary attitude and can eat just about everything I'm sure this place would be a great option.", "author": "Rebecca D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-31", "description": "Some may say that it's silly to pay $12 for a tiny bialy with lox and cream cheese on it.\n\nThey would be right.\n\nBut still, The Beauty breakfast sandwich is a real beauty.\n\nMile End just opened with brand new menus for breakfast and lunch on the weekends and dinner during the week. After loving the Smoked Meat Sandwich and the Smoked Meat Poutine that they are known for at their Manhattan location, I knew I had to come back to try some of this great stuff.\n\nPreparing for a day of non-stop eating, I decided to go a little lighter and not start off with a pile of fries smothered in cheese curds, gravy and fatty meat, so I resisted the poutine and just got The Beauty. This is a little, tasty bialy with a bit of lox, tomato, onions and capers, with cream cheese applied very liberally to both halves.\n\nThis was a delicious little breakfast sandwich, and I can't wait to come back to overpay for the other item on the menu that's actually called \"The Breakfast Sandwich\" (two fried eggs, bacon and cheddar).\n\nThe shop itself is small and feels very Brooklyn. There are a couple of counter seats in front of the open kitchen, along with some bench seating and some wooden tables.\n\nYou must first try the smoked meat here, but don't overlook the other great stuff.", "author": "Mike C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-07-21", "description": "Mmm, poutine....\n\nMajor craving for french fry-cheese curd-gravy-deliciousness. My Canada trip was a while ago and I wanted some poutine closer to home.\n\nLet's get the big question out of the way. How does poutine in NY compare? We all know that NYC loves to hype everything and proclaim that their food is even better than well, the mother country of said food. And like most comparisons, this one too falls a little flat. \n\nBut! That's not to say that this version isn't good. It's still got smoky flavorful meat, smooth dark gravy, and squeaky cheese curds. It gets the job done. If you've never had poutine in Montreal or other parts of Canada, you probably wouldn't find much fault with this one. A large order is a meal in itself, and in my case, leftovers for next day. The restaurant is small and cute and the service is friendly. Prices are a little high.", "author": "Steph C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-12", "description": "Okay this place is definitely a four star yelp review place. The reason why Im giving it a five star review is because the overall rating is 3.5... and thats just not accurate. Yeah it may be a bit pricey but welcome to new york everyone. Get over the fact that things are more expensive here. If you go out to eat something, you're expected to pay at least 15 dollars.. and this place gives you a TON of food. Its not like those stupid ny tapas places where they give you three carrots and charge you 8 dollars. \n\nTheir food: really good. They do fun spins on poutine and they put a lot of heart into their food. Ive never been to montreal but my montreal friends are always impressed.. \n\nTheir interior: small but cute. The lighting is warm and cozy. Definitely a good place to order some poutine and drink beer.", "author": "Jane K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-23", "description": "Smoke meat hash is good\nOJ is too small\nMimosa tastes like OJ\nSandwiches is good\nWaffle is good but small", "author": "Harvey C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-11", "description": "Mile End is an incubator of mutated Montreal/Brooklyn traditions.  If you visited MTL and had the originals, you will get the in-jokes, the flavor gestalt, and what they are trying to pull here.  If you are from Montreal it's going to make you more homesick as it's not really a taste from home.  If you are a New Yorker, it's a different animal from Katz's or the 2nd Avenue Deli to feel exotic.  They are overpriced for what they serve (especially if you are familiar with the product that they are paying homage to), but if you are splurging once in awhile, it's okay.\n\nOkay, a guide to some items -\n\nThe Ruth Wilensky - it's an homage to Wilensky's light lunch on Fairmount, named after the owner.  In the original it's a $4 mustard and baloney pressed sandwich in an anglo lunch counter.  You chat up the person behind the counter, order one with a pickle and a fountain soda (maybe an egg cream), eat, throw down a Laurier (5 CDN) and a loonie, and settle up.  The original is crispy, savory, comforting but a little bland.    The Mile end version - $9, the major difference is onion roll and artisan salami.  It's a little better.  The recurring joke at Wilensky's is that mustard is non-negotiable, and they simply won't cut the sandwich.  If you order a Ruth here they will cut it.\n\nThe Beauty - it's an homage to the Beauty's Luncheonette (circa 1942, bit of a tourist trap) on St. Urbain, and their special sandwich (Nova Lox, Schmear, Tomatoes and Onions with Capers, served on a St. Viateur's Bagel).  The original is $8, the real star is St. Viateur's bagels - Wood fired oven, honey water dip with sesame seeds, made 24/7.  I don't think the $12 version at Mile End's brunch menu really compares well, even with their own black seed bagels.  Also, If you visit MTL, hit Cafe Replika instead for a Simit sandwich - better bang for the buck.  \n\nSmoked Meat - it's an homage to the viande fumee served at Schwartz's Deli on \"The Main\".  I am going to commit NYC blasphemy here - I like Montreal smoked meat better than pastrami simply because of a) portion size b) depth c) the way how they cut it.  NYC Delis try to justify a hefty price tag on Pastrami sandwiches by giving you a crapload of meat, and even then it's barely break-even.  It's sliced thin, so you have this ridiculous mountain of beef and comically small slices of rye bread.  No matter how you try, you are not going to finish it on one sitting (nor would you want to), and when they dry up, no amount of mustard will help.  In Montreal, smaller, more reasonable portions, $8/sandwich.  They also treat their meat differently and it has a depth of flavor that most pastramis do not have.  Finally, counterman at Schwartz's will ask you how you want it sliced - you always want thick cut and juicy for the best results.  At Mile End, it's $15 for a similarly sliced sandwich, it's thick cut, but I am not sure if I like it better than the stuff from up north.  You can buy the spice from Schwartz's so getting the flavoring isn't hard...it's just..the texture - it's leaner than the stuff in MTL so it feels less gratifying.  Good try, though.  Got any nash?\n\nPoutine - This is a toughie.  Back a few years ago it's not easy to score fresh cheese curds in NYC, so making good poutines was not easy.  Nowadays there's Beecher's on 20th and 5th, and they sell cheese curds that are so fresh that it squeaks.  So, what makes good poutine?  Crispy but soft fries, flavorful, almost consomme-like gravy, and plentiful fresh curds in room temperature.  Poutine in Quebec French means \"a damned mess\", and you should feel a little guilty eating it - the best ones are not found in Montreal, but in cass-croutes outside Quebec City (provincial enough so they won't try to gussy it up, but busy enough to have high turnover).  In the case of Mile End, the fries were not bad, the gravy is okay, but the cheese curds?  Not quite there yet.  Good, but considering that Patati Patata is $5 and La Banquise is $8 for the classique, chargng $9/13 for a small/large is little much.  I should also mention that Pommes Frites on McDougal street makes a very serviceable version for only $6.50.  \n\nThe Fake Chinese Food - Really?  You are going to a fake Montreal deli to pay Brooklyn hipster prices for fake Chinese?  No-Pork-On-Your-Fork real Chinese is only 6 blocks away on Atlantic and 4th!  NO.  Just NO.\n\nWell, their decor is nice, and as a Habs fan I like the pics in the bathroom.  Just remember that they are not quite MTL, not quite NYC, and expensive.  Go once in awhile, but don't forget that a plane ticket to YUL is only $350 roundtrip.", "author": "Kevin K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-07", "description": "I order delivery a lot. I don't leave a lot of reviews. So listen the f*ck up. \n\nThat smoked meat sandwich. It's bananas. Anything with smoked meat in it really. And the pickles. Order 2. It's worth it. Don't get all hung up on the pickle plate. Go for the real thing. Trust me. \n\nYes, you have to be patient for your meal. Yes, it's not a $5 \"deli\" sandwich from your 24/7 spot, you cheap sh*t. \n\nIf you want to eat some real boss player status brooklyn food, man up and do it. I'm an Italian Jew and this place can whip up a motherf*cking sandwich. And if you have the means, go. They have an awesome craft beer selection. \n\nNo I am not getting free food for leaving a positive review. You're welcome.", "author": "M F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-12-06", "description": "Been craving a smoked meat poutine since I got back from Montreal and was looking for places to compare..\n\nHonestly the best poutine I had was at the airport in Montreal! A heaping platter of fries, tons of poutine, smoked meat and crazy made this a smooth food-coma induced plane ride home only to awaken with the sad thought that I couldn't get it at home..\n\nFast forward some months to the bf taking me to Mile End.\nFirst off the place is very small and the parking sucks. There are about 3-4 tables that can fit 4-6 people i think. a small 2 person by the window and counter seats.\n\nAs for the smoked meat poutine..I liked it.. but it would've tasted better with more gravy (i'm a saucy girl ;) ) and if the cheese could melt a little more. Also the serving of the large was meh.. and the smoked meat though it looked like a lot was almost nowhere to be found as it was shredded. Perhaps if I order it to go with extra gravy it would be more to my liking and an extra order of smoked meat. The bf had the matzo ball soup which he thought was very good, but it wasn't hot and only had one ball..albeit a big one, but only one.. lol\n\ni would go back, but i'd try some other places before I make it my go to place for poutine.", "author": "Melissa N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-08", "description": "This place is as good as everyone says it is!! Trust! Awesome, fresh, tender meats served up on a platter or a sammy... freakin' awesome fries topped w/ cheese curds and chipped beef if you want it (a.k.a. poutine)... friendly, accommodating waitstaff... chefs that prepare the food right in front of you (sushi bar style), +++ The list of goodness goes on and on. Btw, even though they are best known for their smoked brisket, the smoked turkey (The Grandpa sandwich) and burger (add the egg) are delish, too!\n\nNote that the restaurant is SUPER small, so prepare to wait... but now that it's warm, just do it! They have some chairs set up outside for long waits.\n\nOh-- and the pickles! Just do it!!!!! No questions!", "author": "Scott B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-27", "description": "Stop: Everyone. Just. Stop. Stop what you're doing. Sit down. Shut up, and prepare yourself. Because, dear reader, if you're reading this review, that means one of two things - A) You're looking for a place to eat in Brooklyn, or B) You've been told about Mile End and are questioning whether or not you should pay a visit. Either way, my friends, you're in luck, because fate has lead you to what is without question one of the best dining experiences I've had. Walk, run, bike, fly, apparate, skate, blade or wheelchair. I don't care how you do it, but get here, and strap in. This is gonna be good. \n\nStar 1: How was the service and atmosphere?\n\nYou know how you see those commercials where it's lightly snowing outside with a few inches already on the ground along a dark street trying it's best to fend off a bitter wind? In every single one of those commercials there's a small building just off the main boulevard with a warm light coming from within. A warm light, dear reader, that signals to stranded outsiders that this is a place of refuge; a place of warmth and kindness that will cure your ailments and mend your wounds. This is exactly how I felt walking into Mile End early one Saturday morning. Granted, it was 95 degrees outside and I was so hot and sweaty I could have cried, but you get the picture. Mile End is adorable, the staff friendly, and the service fast. It's everything you could want in preparation of a glorious meal. Star Granted. \n\nStar 2: How were the portions relative to the cost?\n\nI wavered here for a moment, friends, because for $14.00, I got a smoked meat sandwich that frankly wasn't all that big. However, as I contemplated whether or not the $14.00 price tag would deter from my overall opinion of Mile End, I glanced behind the counter to see the chefs chopping freshly washed vegetables and what looked to be the absolute purist of ingredients. Moments later I had forgotten the price upon realizing that, plain and simple, it was worth it. Have a look:\n\nhttp://www.yelp.com/user_local_photos?select=f-3HfCK5xgXY82ARMEbeHw\u0026userid=OKX-V5j_qfuOebeHeWGrHg\n\nStar Granted. \n\nStars 3 and 4: How was the food?\n\nMarvelous. Absolutely marvelous. First and foremost, while the smoked meat sandwich gets a lot of attention, Mile End's menu is fantastic, and there's something there to satisfy just about any craving one might possibly have. However, back to my smoked meat sandwich. While I would have loved it if the bread were toasted, the meat in my sandwich was revolutionary, and even my 'lean' order (you can order your sandwich lean, medium or fatty) was bursting with flavor. Great stuff all around. Dual Stars Granted. \n\nStar 5: Would you eat here every day if you could?\n\nThis dining experience alone has motivated me to go to Montreal and/or Quebec City ASAP. In the meantime? Mile End is my go-to for sandwiches in the city. Star Granted.", "author": "Paul V."}], "servesCuisine": "Delis", "priceRange": "$11-30", "name": "Mile End Delicatessen Brooklyn", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "97A Hoyt St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/jL2-f-hVAwkXx5vELTD0RQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188527510"}