{"aggregateRating": {"reviewCount": 747, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-11-09", "description": "I had been dying to try their bagels, so one Sunday morning recently, me and a friend stopped by to get a bagel and coffee to go.     Big mistake.   \n\nWe queued up for about 25 minutes before getting served, despite only 2 small groups of people in front of us.   The service was slow to the point of lethargy, and the person at the window did not have a pleasant service-oriented demeanor.   Once we placed our order it took 15 minutes to get the bagel.    \n\nThe coffee was awful.    I had been excited to see they were serving Stumptown coffee, which they were making in a French press.    They seem to be really skimping on the amount of coffee they put in the pot.   My cup was watery.     Stumptown, please sent your operatives out to do spot checks on places serving your brand.    These people are doing it a huge diservice.\n\nAs for the bagel ... all they're doing is taking a pre-made bagel out of a plastic bag, slicing it in two, putting it in a little toaster, and then putting a schmear of creamcheese on it.   Shouldn't take 15 minutes.     They're not boiling and baking their own bagels here, there should be no back up.   I realize that they same people are also preparing food for the dining room, but it is a small place, it can't take that long.   It is a deli for god's sake.\n\nReally people, act like you care.   Get some to work the window that is motivated, likes her job, and knows how to interact with her customers.   Oh, and lost those silly little milk jugs.   They run out after a couple of pours.\n\nI'm sure your meat is wonderful, I've heard many good things about Mile End, but the terrible, terrible service, and the insipid coffee will mean i'll never return.   Oh, the bagel was lovely.   Top marks to the bakery in Montreal that you buy them from.", "author": "Mark S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-10", "description": "If you've visited Montreal, you should (hopefully) be aware of the fabulousness that is poutine. And smoked meat. If you're not...fix that by visiting Mile End. \n\nIt's a small place with counter seating plus 4 or 5 picnic-style tables - you may find yourself sharing bench space with others. The menu isn't that extensive, but that's fine by me. I like places that are content with choosing a few dishes and doing them well.\n\nThe smoked meat sandwich is delicious. The poutine is good (though I would like more cheese curds). I found the borscht tasty but I have no basis of comparison! \n\nServers are sweet and the food comes quickly. They also have a selection of wines and beers available to wash everything down. I've eaten here several times and the consistent quality keeps me coming back for more!", "author": "Michelle Z."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-13", "description": "Pilgrimage complete. A very good sandwich. $14. But awesome. Small and cozy. Glad we went.", "author": "Jeff R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-03-17", "description": "Personally feel this place is a little overrated and overpriced. Service was okay, place was packed to the point we could barely move (and my gf and I are not big people). Would look elsewhere for a Sunday brunch.", "author": "Rob H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-18", "description": "I half expected a moose flavored snow covered in gravy sprinkled with fried cheese curds and motzo balls on top when I first heard of this place. A Jewish French-Canadian Sandwich shop? What does that even mean?\n\nIt turns out that there is an extra layer of flavor beneath what claims to be a Montreal eatery. Mile End is a town in Montreal where traditionally all immigrants come to establish their home base in a foreign country. Much like New York City, the Yiddish population were the first wave of immigrants in this city, and the first to settled in Mile End, or so my Brooklyn/Japanese/Argentinian/French/Quebecais friend tells me, thus explaining the name and the menu of this restaurant.\n\nThe first thing to get here of course is the Pastrami. The 14 oz sandwich comes with a lot of meat so you can share. But their other dishes on the menu aren't as substantial as their main sandwich.\n\nI regret ordering the appetizers however, especially the duck salad. For one, there was barely enough in there to taste anything. And two, it's a sandwich shop, isn't it? So why are you serving me a nouveau (Ohh-La-La) dish? By the time you start to taste something from the salad the plate will be empty. It's that small.\n\nMile End doesn't necessarily strike me as a casual lunch spot as it claims to be. It isn't a Delicatessen in a traditional sense, but it's not quite a full restaurant either, and that's exactly what they were aiming for; a modern, more refined take on what is considered traditional, casual Jewish Delicatessen.\n\nI appreciate the concept they are pushing here. Mile End wants to take traditional Jewish comfort food and prove that it can match against the finest of dining traditions. But when a hungry consumer who is out to get a decent meal, and is left with half a plate of lawn grass and a few paper thin cuts of meat, it can amount to quite an irritation.\n\nThe majority of their dishes are experimental and mostly there to give you a taste, rather than giving you a satisfied meal. Personally I find it all to be bit too bourgeois.\n\nSo try the appetizers if you are feeling experimental and would like to see artists at work. But if you are here because you are hungry, stick with the sandwiches, especially Pastrami/Brisket sandwich.\n\nBottom line: Mile End is unique and innovative. This is an interesting restaurant, and it has a lot of potential. They are still in their early phase when a new restaurant is still in the process of figuring out what dishes are popular amongst their clientele, and I'd say Mile End is worth my time and interest to let them eventually sort out their menu and dish undertakings.\n\nP.S. Ask for vinegar when you have the fries, because that's how they eat fries in Montreal. It works.", "author": "Jim K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-23", "description": "Sad to see some negative reviews of the service here... the outstanding service is one of the many reasons that I come back to Mile End! I've been for weekend brunch, weeknight dinners, and their special Chinese dinner on Sunday nights. \n\nThe food is fantastic. The restaurant's \"no frills\" approach to their overall atmosphere and plating is a perfect fit for their simple and delicious meats. Somehow, magically, despite the rich, filling, and fattening flavors, I always leave feeling comfortable, rather than as if I'm going to have a heart attack. \n\nThe service is always outstanding. I suppose if you prefer your waitstaff to serve you duck in formal suit jacket and vest, this isn't the place for you. Generally I find the informal and chatty attitude of the waitstaff (and the chefs behind the bar) to be welcoming and refreshing. \n\nChinese dinner and burger night ($35 and $19) are well worth the prix fixe. It's challenging to recommend any items as everything I've ever had has been exceptional. Also, don't miss out on their beer list - very well curated seasonal selections!", "author": "Allison T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-05-11", "description": "Tiny little spot with 4 tables and a bar.  Great beer and wine selection, friendly staff.\n\nThe smoked meat is incredible, make sure you get it!  The other things we tried were nothing special including the poutine which I think is better at Pommes Frites in East Village.", "author": "Heather P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-21", "description": "I enjoyed a great lunch at the counter. Ever had a chicken salad sandwich with cracked chicken skins (my friend calls her homemade version kibbeh) and challah bread that has been smeared with schmaltz?! I didn't think so...\n\nThe poutine was pretty good- I know it was done right with real cheese curds and fresh hand cut fries but the mushroom gravy was a little bland. I really wanted to salt and pepper the dish, but couldn't find any shakers.\n\nWe were given a free plate of some delicious ruggelah (lemon, rhubarb) because my girlfriend's brisket sandwich was given to someone else. They whipped up another one in minutes and were really great about it.\n\nI am not a huge fan of the soap dispenser in the bathroom. This may sound like an odd complaint but sanitation is important to me and this device, while interesting and somewhat charming, does not strike me as particularly clean. You'll just have to check it out for yourself.\n\nThe decor is charming, the service is great and the food is good. The prices are a little stiff but the food is very filling and makes for excellent shares...I plan on returning to tour the menu.", "author": "E L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-11-27", "description": "POUTINE is the best way to eat fries ever!! Their pastrami is delicious! Definitely n my MUST-EAT list in Brooklyn.", "author": "Julienne G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-21", "description": "I strayed and got the Roast beef on Weck. The roll was awesome and salty, but I kept eyeing my friends brisket... I felt like a caged dog, trapped in a sloppy roast beast nightmare. \n\nI also saw an overweight couple going at a large order of greasy greasy poutine. It kinda made me horny, is that wrong?", "author": "Jack T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-27", "description": "I tried their brisket sandwich at the Brooklyn Flea Market over the weekend, and all I can say is: MOUTHWATERING DELICIOUS!  It came on this delicious bread, the brisket was smoky, and so tender and the mustard that was spread on top of it balanced it out so well.  We decided to get a pickle as well, and it was the best pickle that I've ever had. Thank you!!!", "author": "Katherine L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-20", "description": "This is bordering on 5. The place is cute and well designed, looks great, and with a good vibe with the cooks preparing food right in front of the counter. Service was relaxed, casual, and friendly. I jumped straight to the\nsmoke meat sandwich. and wasn't disappointed. 7oz provides the perfect size rye sandwidh  full of succulent meat covered in mustard (and with recommended optional Srichacha). I'm coming again, it's a great place but expect a wait.. the place is small and popoular.", "author": "Noel R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-04-13", "description": "This is nothing like real poutine! This was just (mushroom?!) gravy on fries with the wrong kind of cheese.\n\nThere is a difference between real Quebecois poutine and cheese/gravy fries.\n\nAnd the smoked meat did not make baby angels sing when you bite into it (like it does at Schwartz' in Montreal).\n\nI wanted to like it so much, but it just didn't even come close.\n\nMile End is to real Quebecois comfort food what Taco Bell is to real Mexican food.", "author": "Gentry L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-07-18", "description": "This place makes me a lot less inspired to whine about not having access to good southern barbecue. Now, southern barbecue it is not, but Mile End has achieved the level of gastronomic greatness I have previously only acknowledged of talented Carolinian pork handlers. Take that how you may. \n\nI have tried to have other dishes than the brisket sandwich, but they are usually sold out. After having the brisket sandwich (several times), I can only assume that their burger might make my eyes roll so far back in my head that I would lose them permanently. So it's not at all a bad deal to be stuck with another Mile End brisket sandwich. \n\nThe feral cats downstairs who scarf the fat scraps from my sandwiches also mentioned that they would give Mile End a big thumbs up, if they only had thumbs.", "author": "Emma S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-12-29", "description": "I am so disappointed to rate the Brooklyn original lower than the new Manhattan place, but the experience was a little below average.  The smoked salmon of course was incredible and the French press coffee perfect.  But the fries were way too salty and the bialy was...well stale.   Couple that with a pricey bill, and I left feeling a little sad after my son and I were blown away by the manhattan location (our first time).  If you have not been to either location however, I still strongly suggest you go.  I still think the place is a gem.", "author": "Ron Q."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-08-20", "description": "Disappointing. I was SO hungry at 11:30 am on a Sunday, and almost all the other restaurants in the 'hood were closed until noon (such is the tyranny of brunch. DOWN WITH BRUNCH!) My boyfriend had eaten at Mile End before and really liked it, so I was happy to give it a try.\n\nThe restaurant is micro-sized, so there were a few parties milling around outside on the sidewalk, waiting for a table. I inquired with the waitress/server and she told me that the wait for 2 would be \"ten to fifteen minutes.\" Seeing no better option, I said okay, put our name down, and went to lock my bike to the nearest signpole. 3 minutes later, seeing that some groups had left, I walked back and poked my head in to see what the updated wait time was. Turned out that \"10-15 minutes\" really meant 2, and she had given away our spot.\n\n\"I called your name!\" she said. I pointed out where we had been standing, not more than 20 feet away, and she smiled apologetically.\n\n\"Ohhhh, soooorry... I didn't see you.\"\n\nClearly she had not even bothered to turn her head to look down the sidewalk. I was pretty pissed. She looked embarrassed about her mistake (as she should be), but that didn't change the fact that we would have to wait again.\n\nSo wait again we did - for 15 minutes (it would take us that long to pay our bill at the end, too), and I was growing hungrier and grumpier by the second. By the time we did sit down to eat, I think I was too peeved to really enjoy it. The pastrami was certainly very tender, but I thought the sandwich as a whole was rather bland and uninteresting; I prefer something more than just a mountain of salty meat on mediocre sliced bread with some mustard. The coffee was really good, though. And I like that they use recyclable paper straws instead of plastic ones.", "author": "C.J. T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-07-22", "description": "Went for weekday lunch so I don't have a lot to go on. The smoked meat sandwich was very tasty, but the fat was dense and chewy (I got mine medium, maybe next time I'd try lean). $14 is steep for a lunch sandwich. I've been meaning to try mile end for a long time, now that I have I can't say it blew me away. Definitely willing to give it a second chance though.", "author": "Luke Y."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-10-17", "description": "I decided to walk on down to Mile End after seeing them featured in the Brooklyn Paper. In the article it talked about how the young Canadian couple who opened the place less than a year ago just recieved Zagat's highest rating for a NYC \"deli\" (higher than the iconic Katz or 2nd ave).\n \nWhen I went down I realized that the people at Zagat must have been confused as Mile End isn't a deli whatsoever but a charming little restaurant. The wait at 1pm on a Saturday was about 30 minutes as there's only space for about 19 people in the restaurant which is about the size of my living room. The seating is 3 tables that hold 4 people (you'll be sitting next to another couple if you're not in a party of 3 or 4), some stools by a long counter-like table, and a tiny table for two with barely any room to move. Despite the small size the space was well laid out, modern, and had plenty of light. Outside the restaurant there's a take out window and a few chairs to sit and wait. There's also a small speaker that occasionally and randomly plays recordings of birds singing (it took me a while to figure out it wasn't some bird sitting in some tree or on the roof somewhere). To my surprise the cute co-owner girl was the one who was running the front of the house, seating us, and waiting the tables. Their brunch/lunch menus are pretty small and simple with a emphasis on Canadian food as well as organic, local, and homemade items. Local except for the Canadian bagels they import from Montreal. I haven't tried one yet but the Montreal bagel is supposed to be smaller, denser, and sweeter than a typical NY bagel (they're hand rolled, boiled in honey water, then baked in a wood burning oven and covered in sesame seeds). Mile End charges $3 for them (with cream cheese). In addition to the printed menu they also had some great looking brunch and dinner specials like a twice baked challah with fruit compote during brunch or a handmade smoked meat hotdog during dinner. \n \nWhat Mile End is really becoming known for is their smoked meat. It's like pastrami but the smoking and seasoning of the brisket is different so the name and the flavor is different as well (the Brooklyn Paper mistakenly had called their meat pastrami). They dry cure local brisket for 11 days, smoke it over oak, steam it, and hand slice it for their 7oz sandwiches ($9) on rye or as an optional topping for the beloved Canadian dish, poutine (fries topped with cheese curds and brown gravy) $11 ($8 without the meat). They also make their own salami which is made with a combination of brisket and short-rib then cured and smoked over olive wood.\n \nDespite hating the texture of brisket (especially when it's cured) I had to try Mile End's. I found as though theirs had a definitely smoky flavor to it that just doesn't ever come through with pastrami and it was pretty moist. I didn't like it as much as pastrami and didn't think it was a juicy as I've had, say at Katz, or when it's not cured and just smoked BBQ style as places like Fette Sau in Williamsburg but it was still good none the less. Mile End also did something absolutely unheard of in a NYC deli and that's charge for pickles. $1.50 gets you 2 sour pickles from Brooklyn Brine. I found these pickles actually sweet with an odd flavor I've never tasted in a pickle, I think this is really going to hit or miss with people (it was a hit with my roommate but a total miss with me). The fries were homemade, cooked perfectly, and tasted great and the service was also very friendly.\n \nThough not everything was a total hit with me I'm definitely looking forward to going back and trying more of their menu in the near future and wish these guys well (and that's not just my Canadian heritage talking).", "author": "Matt E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-22", "description": "Love love love this place, but I have to remove one star for only serving beef on weck for non-holiday, weekday, lunches... no one can lunch on a non-holiday weekday.  I had the Mount Royal, which is a perfect, giant, chive latke topped with lox, creme fraiche, and that's it.  To die for.  Julian M. had the smoked meat sandwich, and it seriously was the best corned beef I've ever eaten.  He said it didn't break his top five, but that can't be.  We also split the borscht and the poutine.  The poutine was good, but I highly recommend the borscht.  \nWe waited 45 minutes for a table, which I think is reasonable because this place is very very tiny.  I will somehow try this beef on weck, and when I do, I will get back to you.", "author": "Emily M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-09-04", "description": "Quick summary: rude staff, decent but inconsistent food.\n\nLike many other reviewers I was thrilled that a restaurant opened up serving Montreal bagels and smoked meat. Although I am not a native Montrealler, I have spent a significant amount of time there and frequented both St. Viateur Bagels and Schwartz's.\n\nWhen we arrived at 4:30 on a Saturday afternoon I met the staff with excitement and my enthusiasm only grew when they told me the bagels were driven down fresh as often as possible from St. Viateur. I tried to place an order for a bagel and two smoked meat sandwiches but I was told that the kitchen was closed and we'd have to return at 5:30.\n\nWhen we came back we were told that there were no bagels to be had because they had been \"put away.\" When I kindly requested an exception on account of having made a special trip from out of state (I'm from Minnesota) the server turned unexpectedly and intensely chilly and ordered us to complete the rest of our to-go order at the front counter. We instantly felt unwelcome and to be honest I am not sure why.\n\nWe took our sandwiches to the new park on the waterfront at the end of Atlantic Ave and opened them. Although they appear small in size we think the portions are adequate. As others have noted the slices are quite thick--they are sliced using a large chef's knife instead of a meat carving knife. There was also a bit of a problem with consistency: one sandwich was nearly all fat and quite salty while the other was smoked meat perfection.\n\nWe weren't asked if we wanted mustard but I can report that the mustard used was fine ground yellow and assertive. Other reviews had cited that a course, poor quality mustard had been used. They have seemingly worked out this kink.\n\nIn summary I would say: terrible, rude and socially inept service; average value and smoked meat sandwiches that could be sublime with a little consistency and care. I want this place to be successful. Hopefully they will start by retooling their staff which many, many other reviews have cited.", "author": "Jordan H."}], "servesCuisine": "Delis", "priceRange": "$11-30", "name": "Mile End Delicatessen Brooklyn", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "97A Hoyt St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/jL2-f-hVAwkXx5vELTD0RQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188527510"}