{"aggregateRating": {"reviewCount": 747, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-06-12", "description": "I feel compelled to warn you that the Mile End Deli is not what you might conceive it to be by the reviews.  We had breakfast there on a Tuesday morning including their \"smoked meat\" hash, eggs and a bagel with a shmear.  The hash was revolting.  The \"smoked meat\" tasted like burned, fatty, meat-flavored charcoal. The hash overall consisted of the fatty charcoal (I mean \"smoked meat\") too small cut potatoes, and a few lonely onions.  It was way over salted and way over peppered. 100% YUK!\n\nBeing in New York I expected a great bagel....the one served was truly less than remarkable, really dry, just sitting there unceremoniously, closed-faced, on a plate.  \n\nOver all, the Mile End is comically small and the counter where we sat was unpleasantly sticky. The day we went the place felt kind of \"close\" with a bit of a greasy atmosphere feel (with the doors and windows open, I might add, and the fryolator turning out par-cooked frites by the bucket load)...As for the ambiance, well, if you're into new wave punk, this may be where you'd want to roll.  The whole Montreal thing in that regard might be accurate (a poutine-mad venue perhaps?).  \n\nOn a plus note our server was a sweet heart.", "author": "Dennis G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-12-20", "description": "Farewell Mile End!! \nIt was good while it lasted but the new pricing to portion size leaves me empty.  I'm not sure what happened to this place but hopefully they course correct before its too late.  In the meantime, I'll be holding out until my next trip to Montreal for the real thing.", "author": "jason a."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-05", "description": "Mile End has everything that belongs in a real, nitty-gritty deli: smokiness, lots of meats, and affordable prices. It also has a slightly artisan/trendy vibe that is different than the typical meat hook type of institution found in the city's older districts. I also like that it has limited seating, so it keeps the experience very low-key.\n\nThe brisket sandwich seems to be a minor item on the menu, as they do a lot of unique offerings. It is more refined than Kat'z, and it might have been the best Jewish brisket that I have ever had. It was smoky and ridiculously tender.\n\nThe pea leaf kreplachs (dumplings) were probably my least favorite item. The fried dough was a bit oily tasting, and the inside was somewhat boring and straightforward. I really enjoyed the creamy onions underneath, though.\n\nThe deli board was expensive, but that can be justified by the hand-crafted work that goes into the protein. We had smoked turkey rillette, lamb belly, and beef salami. For $14, we probably got about 5 ounces total. It also came with bread and some apricot/bean spread?\n\nThe plate of pickles was a great way to see how their goods taste, and I really enjoyed everything. My favorite was the dill sliced cucumbers. Nothing was too sweet, but I could have used a little more tang.\n\nNow... the poutine. I have not had much of this dish, but boy is it dangerous. Gravy and fries and cheese curds make for a mean combination, and Mile End does it right. The cheese curds were big, and the gravy was slopped on. $8 for a huge platter that probably rounds out at 1500 calories. Nice.\n\nMile End is a great eatery for meat, refined goods, and best of all... poutine. You need to go ASAP to pack your gut in with whatever they have going on that day. You will love it, guaranteed.", "author": "Solomon W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2010-09-11", "description": "After a return trip to this overrated establishment, I was compelled to write this, my first Yelp review. \n\nOver-salted meat, over-hyped sandwiches. It is an insult to Katz's Deli to dare utter its name with this pedestrian place. \n\nThose who rave are surely newcomers to the deli game, and by that I mean, newcomers to the borough, and therefore desperate to find something truly their own. \n\nBut that shouldn't be your problem. You want a good sandwich, and this is not it. Greasy salami? Sodium saturated meat that tastes as if it was doused with a bucket of liquid smoke? This is what you get here. And you have to PAY extra for a pickle! When this place is long gone, Katz's will still be around. Hopefully, these reviews will stand the test of time to bear this out.\n\nLet the bourgeoisie have this crap.  You care about a good sandwich. But do you even know what a good sandwich is? That, my friend, if part of the problem.", "author": "G M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-12-29", "description": "I really liked the vibe of Mile End. Its a tiny place where the employees have a good attitude (the waitress and one of the cook's had a good time ragging on the head chef) and the food is comforting and tasty. My boyfriend and I showed up the night before Christmas eve fairly late and while it was almost at full capacity, we managed to snag a seat at the bar with virtually no wait. It was mesmerizing to watch the chef pull out a piping hot and well seasoned, huge round of smoked meat and then slice a hearty stack for my sandwich. \n\nThe food was very good (I had the smaller of two smoked meat sandwiches and the poutine), but its just not the same as Katz. The bread was a bit dry and the meat lacked the saltiness and juiciness that makes a Katz sandwich so ridiculous. The comparison may be unfair (Mile End is clearly not trying to be Katz), but its unavoidable.\n\nI regret not getting the recommended brussel sprouts.", "author": "Nicole M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-17", "description": "i'm usually somewhat reluctant when it comes to \"sandwich\" places or \"delis\" because i'm not usually impressed. i'd rather waste my \"bread\" carbs by eating an entire loaf of bread with butter and some cheese and meats on the side. yes. i'm that person. i could also eat an entire loaf of homemade garlic bread complete with parsley on top. that's just the person i am.\n\nso mile end was suggested since lucali's was not open until dinner. its a montreal inspired deli and delicious at that. amazing chicken salad sandwich, smoked meat poutine [smoked meat, gravy, and fries? heavennnnnnn], and a great lamb sausage sandwich. the sides of veggies are definitely not the forte of the deli, but everything each main dish is just.... delicious to eat. and not overwhelming with any flavors. the favorite is the chicken salad sandwich, served on butter toasted soft bread. though i don't make it out to brooklyn often, i'll be back.", "author": "Diana Y."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-08-19", "description": "I had heard good things about this place, so I visited and ordered a Smoked Meat Deluxe to go. I was pretty disappointed in the sandwich that I got. It was quite dry and salty, so I didn't enjoy any of it. The fries weren't particularly special either.", "author": "Sean W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-30", "description": "Worth the wait as long as you can get the smoked meat.  It's amazing.\n\nBeef on weck is also very good.  Assorted pickles are a must.  \n\nPacked joint, but the staff has been very cool both times I've gone.", "author": "Tommy H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-27", "description": "I heard the buzz about Mile End and figured I'd give it a try. I'm glad I did. Although the prices I feel are a little steep for sandwiches, 9 bucks plus tax for half a Smoked Brisket sandwich, I do admit that I will be back to get it again. Place was packed and I think at dinner time it is best to take out than wait. A little loud and hectic, but a must try.", "author": "Michael L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-25", "description": "This place is too expensive. The sandwich is $14!! Anyway, they only have few tables + bar. They're friendly. We ordered a large poutine but the fries was not enough, but delicious.", "author": "Zel A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-07-20", "description": "Very rarely is food treated with respect, care, and meticulous preparation. This place fulfills all three. \n\nThe brisket is obviously the Holy Grail; the last bastion of beautiful beef left in the New York deli scene. Yeah, yeah...Katz's, 2nd Ave, Carnegie, blah blah. This is not assembly-line-deli where briskets are shipped in from some stainless steel hellhole west of Jersey. 98% of the products are produced in house, labored over with care and it shows. \n\nThe highlights, aside from the obvious choice of the brisket: Turkey,  Mish Mash, and the dill cured lox. Absolutely delicious. I also know for a fact that you can survive on Poutine and turkey pieces for over a week. If that doesn't indicate that this food was handed down from the Gods, I don't know what does.\n\nAs for the price complaining, get real. This isn't Subway. The old adage rings loud and clear here: You Get What You Pay For. Pristine quality and, really, enough meat to make a PETA member--or a cardiologist--recoil in horror. If you want a foot long with pressed water turkey, wilted lettuce, and unripe tomatoes, take it to Midtown. The food is high quality, and the price is justified. This isn't your corner bodega where you grab heroes on your toilet paper run. Do you see them selling cigarettes and fifths of Remy Martin behind the cashier? No. Quality product for a bit more money. \n\nGrab some sandwiches, enjoy a Poutine, and tip your waitress. This place is a great addition to the deli scene and a behemoth at what they do. Viva Canada!", "author": "Ian J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-15", "description": "I am glad I don't live in Montreal. Poutine is a dangerous thing.\n\nI don't know if all poutine is as good as Mile End's ridiculous version. They pile on the fries, then throw on a bunch of cheese curds, drench it with gravy (I believe this is standard) and then up the ante by topping it with a huge helping of delicious smoked pastrami. OH MAN I could eat this all day long (so it's a good thing that I don't live anywhere near it because I would be enormous).\n\nMile End has a lot going for it besides the poutine. The prices are right, there's a decent, inexpensive wine list, they have a bunch of bottled beers, and their smoked meats are amazing. In addition to the poutine, I tried the hoyt dog (mmm mmm) and had myself a Ruth Willensky sammy. Love the onion roll, love the salami, love that it's a manageable size.\n\nDefinitely recommended.", "author": "Julie K."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-10-18", "description": "Don't get take out here.  While the food is generally really good (especially the burger), the take out portions are tiny.  We got the chicken for $21 and there were three tiny chunks of chicken.  We left feeling utterly cheated (and hungry).  Very disappointing.", "author": "Iceland J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-11-30", "description": "Was so stoked when I heard this place was opening. I have always been an aficionado of Montreal Jewish deli, especially the peppery smoked meat and sweet, dense, boiled-in-honey bagels. Mile End does faithful renditions of both (the bagels are actually FLOWN IN from St. Viateur in Montreal, eff you locavores) in a quaint and cozy spot in Boerum Hill.\n\nThe poutine is made with real curds, and is slathered with piping hot proper Montreal \"sauce brun.\" I haven't seen poutine this good around NYC anywhwere, save for Hobby's Deli in downtown Newark, where they purportedly make it the way Martin Brodeur likes it.\n\nDeli seems to be making a comeback - new, improved, and now serving beer. ($3 Labatt Bleue)", "author": "John H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-10-27", "description": "I love this place-- the smoked meat is the bomb! I love the sandwich and the hash. However, I am only giving it three stars instead of four because they no longer sell Montreal-style bagels.  They were what first lured me to Mile End.  The way they put together \"the Beauty\" now is also a little haphazard. I prefer the sandwich open style so I can layer everything myself.", "author": "Sarah G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-23", "description": "I first saw this place on the Food Network and I was instantly hooked. Being a life long carnivore and fervent lover of deli foods, I knew I had to try this place out.\n\nI had that chance, when I showed a couple of friends around the downtown Brooklyn area. I knew I had to bring them here to share the love with me. \n\nThe meat sandwiches were off the hook, you could smell the spices upon arrival, then the second you bite into it the herbal smokey flavor just overwhelms you. They also had season pickled vegetables and soups, which were also very delicious.\n\nThe decor of the place is very simple and homely, it's alittle gem on side of the street. It's a great place for maybe half a dozen friends, but no more. \n\nThe service was great, the owner took our order and explained to us the dishes and their inspirations briefly, which made us that much more anxious to eat when the food came.\n\nMeat and sandwich lovers, I highly recommend.", "author": "Cristobal T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-08-31", "description": "If Brooklyn had a charm bracelet, place this gem for all to see!\n\nB.B.E. (Best brisket ever!)\n\nI loved the staff's personality, the counter service was great. I had some brisket with brown mustard, a pickle and some Cherry pop. It was last-meal-on-earth-worthy. \n\nMy sister had the bagels. She swears by them. They're Fed-Ex'd in EVERY MORNING, ain't that somethin'? Well, you can just taste the difference.\n\nCanada, thanks for Mario Lemieux, Rebecca Romaijn Stamos and Mile End.\n\n(you can keep the poutine).", "author": "Jake P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-01", "description": "Had smoked meat in Montreal 4 years ago on vacation, loved it. I had been looking for it since in the US. I found it at Mile End. The smoked meat is different from Katz, Junior's and other NY places. Not better, just a different take on it. I like both styles. Price is reasonable, worth a try.", "author": "Thomas S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-04", "description": "yum! did I share the news about the delicious breakfast sandwich I had at Mile End the other day? This place was on my list of places to try and it satisfied my needs in every way. The sandwich was made fresh-to-order with top-quality ingredients. The staff was really helpful and attentive.  Everyone was too engrossed in their food to talk, making the environment nice and cozy for me as I ate and read a book at the counter.  Perfect spot! \n\nMy only issue? the space is hella small, so if you don't come during an off-time, you will be standing on the corner like a flunky. Not my style, but I can see why folks do it. The food is amazing!", "author": "Camille E."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-10-26", "description": "I saw the place on the TV show Meat and Potatoes the other day and I wanted to try it our immediately.\n\nI went there this afternoon for lunch with a buddy and was able to get a couple of seats at the counter.  I ask if I can order our food from there and the guy slicing the meat said very politely that we can order from the waitress.  The place was very small so I didn't know why we couldn't order from the counter but when in Rome do as the Romans.  I guess since the place is so small (5 seats at the counter and 3 tables for 4 people), the waitress has to make her tips some how.  .\n\nThe waitress was very polite and attentive.  We ordered a platter of smoke meat, 1 poutine, and 2 soda.  The total bill w/ tips came out to $37.\n\nThe smoke meat was good but kind of bland tasting.  It's not like pastrami that has a more bolder flavor.  I think the portions were just right.  Each sandwich gets about 7 oz of meat.  I've had poutine in Montreal from a couple of places and ME was just as good.  \n\nThe only issues is if you drive there; the parking is horrible.  Also, if you are there during the busy hours, you can forget about a sit down meal.  This is the reason for the 3 stars.  They would have gotten 4 hours for the food but I look at the total experience.", "author": "Henry D."}], "servesCuisine": "Delis", "priceRange": "$11-30", "name": "Mile End Delicatessen Brooklyn", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "97A Hoyt St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/jL2-f-hVAwkXx5vELTD0RQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188527510"}