{"aggregateRating": {"reviewCount": 747, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-18", "description": "This place is popular spot for brunch, but I think dinner there can be pretty awesome.  It's not on the menu now, but they had a veal cutlet for dinner that was really tasty.  The pickles are really good...I wish I can buy a whole jar of their pickled fennel.  If you sit at the counter, the friendly guys behind the counter will unfailingly ask if you are enjoying your meal.  My respond is always \"yes.\"", "author": "Jocelyn L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-27", "description": "I actually first ate at this place several months ago shortly after it opened, and then several times thereafter at the Brooklyn Flea Market. Perhaps the best aspect of this place is the wonderful people - this is not to undermine the quality of their food, but a credit to their hospitality. My first time there, they had run out of brisket sandwich. No problem - they felt so bad, they gave me a free poutine (who knew gravy, fries, and cheese could melt my heart into my stomach?). Ordering a breakfast sandwich at 7pm? One quick check with the boss, and 10 minutes later I was in egg-heaven.\n\nAs for the food, at first I was not sure about what I thought about the brisket, since it didn't fit into my pre-set definition (it was more like a cross between pastrami and corned beef). But 2 dozen tender bites later, my taste buds changed my mind. I felt the same about the Montreal bagels - shipped down from their namesake -  but the neighbors to the North have changed my mind about this as well.\n\nGreat place, definitely my go-to deli these days and has supplanted all other morning stops for breakfast.", "author": "Jason B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-28", "description": "5 stars for the poutine with smoked meat! The portion is huge and every single bite is delicious. Sandwiches tend to be on the smaller side and nothing terribly special so I would stick with the poutine.", "author": "Tiffany T."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-03-21", "description": "After seeing this Montreal style deli showcased on the Food Network I made it my business to go there. The hand cut french fries were amazing however, the meat...the whole reason I went there, was a disappointment to say the least. It was pretty much fatty meat chewing gum. The flavor was great so it's too bad I couldn't really eat it. When we were leaving and our waitress asked how everything was, I told her and she told me I should have said something and she hopes I give them another try. I didn't know if that was the norm or not and felt kind of awkward saying anything. The staff were all friendly. Although I'm curious about their poutine, I don't think I'll be giving Mile End another try.", "author": "Stacy S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-04-21", "description": "This past weekend I journeyed to Mile End for what I have heard to be a new classic in deli: the \"smoked meat.\"   What seems to be a smokey relative of brisket or pastrami came out on the same un-inspiring rye bread that Katz's uses and is accompanied by regular Gulden's mustard ($8).  I also had the poutine and their version of a blintze (although the name escapes me right now).  Over all I was greatly underwhelmed.  This is not to say it was not good, but just not the deli experience I was hoping for.  The smokiness of the meat was actually wonderful, but it was far to fatty for my liking (but that is a personal preference, many people like their deli meats almost to be marbleized with fat).  Plus for a place that preaches such quality, I would have liked better bread and mustard.\n\nThe poutine was also lacking in greatness.  After eating the best kind of poutine, I will usually feel a bit ill.  (I mean it's fries with cheese and gravy, why wouldn't I feel ill).  But with these, it was the lightest poutine I've ever had.  That is not to say it was lacking in cheese or gravy, but it lacked that certainly level of heaviness that comes with eating something greasy or straight up bad for you but also gives you that sense of satisfaction (albeit a stomach ache later).  \n\nI may not have been amazed by the food, but the service was fantastic; everyone was extremely friendly and attentive.", "author": "Marc S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-05-23", "description": "The poutine was just amazing, I was a fan, first I thought the gravy might be a little too runny, but no, it was perfect.\nWe also had the smoked meat sandwich, and it is for sure a heart attack just waiting to happen, but it is delicious, and I was happy and pleased when we left the place.\nThey serve Stumptown coffe, and being a coffee snob with roots in Seattle, that made me pleased.", "author": "Swede H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-11", "description": "Delicious food. Traveled many hours to get there. Friendly staff and decent portions. But not great value for money.  We came with a party of 6 adults and 3 babies and we split a few sandwiches and sides, drank wine and beer, so kind of annoyed at the 8$ charge for three tiny slices of lox for my 3 yr old who didn't like the brisket. Bill came to $200. Too much, imho.", "author": "Mama K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-04", "description": "Delicious delicious delicious.  \n\nBasically two things on the lunch menu-- smoked meat (brisket) and poutine (disco fries plus cheese curds)--plus a few sides (they have somewhat more to chose from for breakfast, but we went for lunch so I can't speak to breakfast).  Both were amazing.  The brisket has a smoky/peppery flavor that I've never encountered before that's just superb.  Tender and juicy too.  Served up very simply on two slices of bread with good spicy mustard.  Brilliant in its economy.  \n\nNever had poutine before, but from now on I will hunt it down and devour it at every opportunity.  French fries swimming in a delicious smoky gravy with chunks of cheese curds.  Unreal.  \n\nIt was a tad noisy owing to the fact that this place is already overrun, but it's worth the wait and the noise for sure.", "author": "Jim K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-28", "description": "The smoked meat is way tender and tasty. The sandwich isn't huge, it's true, but a little brisket goes a long way. I'd rather pay $8 for a reasonable size than $14 or whatever for a Katz's gutbuster. A pickle would be a nice addition. I haven't tried the fries. A gold star for Stumptown coffee.\n\nI suspect it will become more reliable, supply-wise, over time. That's the only thing keeping it from 5 stars.", "author": "Jeremy E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-10", "description": "If you fall in love at first sight with the potential spouse-to-be in an arranged matchmaking, is the resulting marriage still \"arranged\"?  How about if you fall in love with the picture of the person, does it still qualify as love at first sight?  I fell for the smoked meat at Mile End when a go-between sent me a series of pictures of potential candidates (http://nymag.com/realestate/neighborhoods/2010/65369/) to choose from (thankfully, food does not require me to be monogamous as I also picked Scarpetta).  It has taken me a while to get to the first meeting - an insane queue, sub-zero temperature and unfamiliar territory in place of sweaty palms, uncomfortable silences and idiotic conversations; I fly from flower to flower, seeking out beauty where I find it.  However, here I was, finally - the errant, procrastinating and much distracted suitor. \n\n----- \n\nThe Beauty - lox, cream cheese, tomato, red onion, capers, bagel\n\nThe famed Montreal bagel was indeed lighter, sweeter and somehow the sesame seeds stood up taller; and what was more, there was a hole. Don't I hate it when a bagel is so inelegantly fattened up so that the hole gets squished into a grimace?  I have come of late strayed away from my former loves - Ess-A-Bagel and H\u0026H - because bagels became too heavy, too dense and filled with too much cream cheese.  The \"Beauty,\" as it turned out, was not only beautiful on the outside, but it was also beautiful inside:  The lox, not overly fatty, was fresh and classy; and the amount of the cream cheese was demurely exact, unlike some places where more is synonymous with good in a self-delusional justification. The tomato, red onion and capers all played their parts convincingly and managed to drag me back to the world of bagels, well, Montreal bagels. \n\nChopped Liver - onion relish, egg, pletzel\n\nShockingly smooth and amazingly light, this luscious chopped liver was not like any other that I had had before. The pickled onion relish and eggs were nice complements.  Spread over their pletzel - a flatbread with poppy seeds and onion - was such a delightful sensation that soon my folks were trying to scrape off the faint traces from the small bowl.  However, compared to the bagel, the pletzel seemed rather inadequate, so I spread my liver over the lovely bagel instead. \n\nSmoked Meat - cured \u0026 smoked beef brisket, rye, mustard\n\nWhile this was the reason that I traveled far and away, this particular meeting was a failure.   While the meat was tender - partly because of fat, too fatty for smoked meat - and carefully carved, it lacked the smoky flavor I was looking for.  The composition of the sandwich, 7 oz., was decent, compared with its New York Jewish cousins, with strong smear of mustard.  Lesson of the day: Some things are better imagined than actually had - i.e., the pretty girl from afar may have tons of pimples. \n\nPoutine {classic} - frites, cheese curds, mushroom gravy\n\nA Supreme Court clerk had two loves:  The poutine and the Constitution. He used to extol the virtues of poutine to me diurnally, interspersed with other more cerebral considerations.  Now, I see.  The fries, by themselves, had already triumphed against many of their brothers on the other side of the river.  But why should we stop at just being \"great\"?  Whoever invented the poutine must have been a true glutton:  It needs not one good thing, but three.  The cheese curds, frankly, had nothing to do with the rest of the dish:  Consider nachos, in which the melted cheese acts as a glue, will it be as tempting if the cheese were not melted?  These fresh, elastic and springy balls of cheese - similar to mozzarella - seemed ready to jump out of the dish and run.  Nevertheless, the genius of the poutine was that it had mysteriously managed to instill, drill and brain-wash my mind so that now I cannot consider a poutine without the cheese curds.  In fact, there is no flame hotter than the love of a new zealot:  In the spur of the moment, with the last few dregs of the poutine in front, I have decided to fly to Montreal in the dead of the winter... God help us gluttons.", "author": "The World Digested A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-26", "description": "My parents shared the chicken salad sandwich and a pickle, both which they claimed were delicious.  I wanted the falafel plate, but for some reason they were unable to serve it.  I had to settle for the Hoyt dog, which was ok.  Service was fast and friendly.  It was good, i just wish i had the falafel.", "author": "Mari O."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-28", "description": "Poutine is nice. Smoked meat sandwich is tasty but was a little drier than it should have been. Whitefish was the highlight this time around.", "author": "Steve E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-04", "description": "Love this place but wish it wasn't so small and crowded during peak brunch hours. And what happened to the whitefish breakfast platter? Come early if you hate waiting and if you're also like me, you'll get the poutine fully loaded with meat and gravy even though you're vegan. It's that good.", "author": "Amanda C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-16", "description": "So delicious. I had the beef on weck sandwich. Loved the caraway seed rye roll. Really loved the whole sandwich package- the meat was nicely seasoned, the hoseradish was a nice compliment too. Also had the iced coffee which was very good.", "author": "S P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-04", "description": "The smoked meat here was sooooo friggin' good. DH and I shared a sandwich on house-made matzah rather than rye since's it Passover, and it made for a terrific afternoon snack. I thought the meat was a touch salty, but other than that it was very well flavored and oh so smokey. When some of the pieces fell out of the sandwich into the container, the meat practically disintegrated between our fingers - it was that tender. We will definitely go back. Hopefully they will continue to have meat after 3 p.m.!\nBy the way, we had our dog with us and were excited to see they have a walk-up to-go window. Awesome!", "author": "Nicole K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-10", "description": "Arrived before the lunch time rush. A good idea because the place is tiny with communal seating only. Ordered the matzoh ball soup. I've had a few hundred bowls of matzoh ball soup and this was the best ....really (sorry bubby). Super flavorful chicken stock with carrot and celery and shreds of chicken and perfect matzoh balls...not exactly a sinker or a floater and strangely tasted of Chinese seasonings.....go figure....a hint of star anise. I'd go back for the soup alone. But on to the smoked mackerel sandwich with cider glaze, pickled red onion, pickle tartar, baby mustard greens,sesame bun.. This gets my vote for \"the best use of smoked mackerel\"...on any plate. Please please order  this if you are a fan of mackerel or fish in general. I would order this again and again at Mile End. The smoked brisket plate came next....enough for 4 people. Very yum...smokey and tender..just the right amount of fattiness...It's just that I was so over awed by the mackerel and the soup, that it took third place\n.", "author": "Bleep S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-27", "description": "I was looking forward to Mile End opening for some time now.  \n\nMy first impression was negative. Why does this place have to look like every other eartery in Brooklyn? I really wish they went with more of a deli theme. And why do they have waitresses? She basically took my order, turned around, and told the guy behind the counter my order (who I later paid)\n\nThe smoked meat was great.  The pountine was amazing.  Loved the mustard.\n\nNow, if we could only do something about all the loser hipsters in this place.", "author": "Andrew T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-21", "description": "Smoked Beef Hash. Double-baked challah with dried cherries and almonds. Out of this world. 'nuff said.", "author": "Natasha F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-20", "description": "Ordered the smoked meat sandwich and poutine for the first time. The sandwich is very tasty but the portion was small for the price ($12). Would probably go back more often if the wait wasn't long and the waitress wasn't so unpleasant.", "author": "Lin S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-26", "description": "I was immensely impressed with Mile End's menu. Deli fare, bagels (imported from Montreal - and yes there is a difference), borscht, pickles and, just to go out with a bang, poutine. Seriously, how original and cool is that? The food is good, the restaurant is charming, the menu is strikingly original. So why only 4 stars? Because the restaurant is too small for the demand of its clientele. I came here on a Saturday and it took two hours to be seated. This place would be perfect if it was a secret hole in the wall. However, as you can see by the 200 + yelp reviews, the secret is out.", "author": "Josh F."}], "servesCuisine": "Delis", "priceRange": "$11-30", "name": "Mile End Delicatessen Brooklyn", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "97A Hoyt St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/jL2-f-hVAwkXx5vELTD0RQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188527510"}