{"aggregateRating": {"reviewCount": 747, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-11-25", "description": "Heard the hype and saw Andrew Zimmern pimping it last night on TV, so I figured I'd try it. The smoked meat is decent, but not better than anywhere else. I'd give it 3-stars on taste alone, but at $15 with no sides and a decent but not huge portion, it's too expensive. I can do as good or better at Kutcher's in Tribeca.\n\nBeer selection is very strong, however.", "author": "Food Jerk X."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-01", "description": "I am a born and bred NYer and has eaten Pastrami[Deli] in all the big places in Manhattan on numerous occasions, and in Brooklyn and Queens as well.\n\nMile End deserves to be ranked with all the big boys. \n\nI love when they open the steamer to pull out a piece of meat...that's when you really smell the diference between Pastrami and their Canadian/Montreal \"Smoked Meat\". The taste difference for me is subtle, not as well defined as the aroma.  Meat texture is the same.\n\nEverybody's raving about the poutine...including my wife and daughter...I thought the gravy just put a damper[literally] on some serious good fries or frites as they may call them. So the family loves the poutine and I love their fries.\n\nI'm NOT digging their pickles....NY Style Deli beats them for me.\n\nThe sandwich is GREAT!!  Definitely smaller than all the NY delis..but not really cheaper.  I guess it was the sandwich size[and pickles] that stopped me from giving this place 5*s. I'm used to asking for extra bread in which you usually get 2 sandwiches at the other big NY delis...Carnegie, Katz's, Stage and the old 2nd Ave.  But not here. \n\nThe workers were all very nice and polite, and I'm looking foward to returnig to try different things on the menu.\n\nThis place gives me another reason not to leave Brooklyn for food...and for that I thank you!!", "author": "Ralph D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-22", "description": "Two words were all it took for me to try this place: Smoked Meat. \nAs a Texan living in NYC, I am always ready to try new kinds of meats and BBQ. Although I wouldn't necessary call this place a BBQ joint, it's certainly incredible.  My Montreal-born roommate knows the guys who opened Mile End a little while ago; apparently this guy was in law school and, with no restaurant experience, he decided to take some time off and open up a Montreal-style deli in Brooklyn. \n\nWe arrived on a Saturday around 12:30p and were lucky to be seated immediately next to a couple.  This place is very small, with three booths and counter seating only.  But it's completely worth the wait (unless they run out of meats) to try the food.  My boyfriend ordered the Smoked Meat Hash, which turned out to be disappointing and somewhat charred. The rest of us had smoked meat sandwiches and poutine.  The poutine was fantastic, with not-overwhelming gravy, tasty cheese curds, and crispy fries. The sandwiches come with spicy brown mustard and meat on rye bread. Plain, but powerful! The meat is somewhere between BBQ brisket and corned beef, thicker than deli meat and very tender and flavorful. \nI would certainly visit Mile End again, though they could probably bring the prices down a notch for the portion sizes.  Overall, it was a great atmosphere and I walked out satisfied and full.", "author": "Emma H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-12-28", "description": "This place would've been 4 stars.. if it wasn't for the epic 2 hr wait for brunch. I get hangry. And, I'm getting even hangrier thinking of how delicious the smoked meat hash was... and how I refuse to wait back on that line. sad face dilemmas\n\nTo apologize for the wait, the staff brought over so much extra food on the house, e.g., cinnamon buns, side of hash etc. It was really sweet.", "author": "Joanie K."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-04-27", "description": "Brunched here a couple months ago and am still mildly irritated to think of it. Tropicana from the fridge, no espresso drinks, and a mincing snack of a bialy with smoked salmon, on a small plate with no accoutrements, for 12 dollars. Lazy. In fairness, I didn't try much of the menu, and the smoked salmon and pickles (a side dish) were perfectly good. But in all it felt like a money-making operation, undeservedly hyped.", "author": "A. E. H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-26", "description": "Lamb sausage was full of flavor, lemon and eggplant combined perfectly for a great spicy lamb sausage.\n\nSmoked meat sandwich with poutine is always a safe bet and filled us up, but lamb sausage was our favorite even though small.", "author": "Luisana S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-07", "description": "Virtually everything on the menu is divine. The only downside could be timing. The place is extremely small and often very busy. Plan on waiting for a table and only coming with groups of 1-4. Anything larger will set you up for failure unless you're planning on ordering to go.", "author": "Roman S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-18", "description": "What.s the hype?\n\nJust kidding\nIt is good smoked meat and poutine", "author": "Bubble T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-06", "description": "We got seated right away because luckily it was a weekday and not too crowded.  I was pretty full from breakfast and that heavy coffee drink I had right beforehand, but we still decided to order the Smoked Meat Deluxe with smoked meat poutine.  My other friend got the beef on weck, which is the sandwich with wagyu roast beef.  \n\nThe pastrami in my sandwich was pretty amazing.  Super juicy, and the poutine gravy was great.  We had to call in reinforcements to help us polish up our poutine since all of us were already pretty full before even walking in the door, but even at that level of full-ness, I could tell how amazing the meat here was.  \n\nI walked out thinking it was better than Katz, but after traveling to Katz again a couple days after, I'm not sure again.  The fact that you can even compare means it's pretty great regardless.", "author": "Jenna L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-07-28", "description": "I LOVE meat.  Let me just put that out there right now.  What's better is that I have a boyfriend who knows and shares my love of carnivorous dining. So when he heard about Mile End, he planned a whole afternoon around eating there.  So high were his expectations that he suggested we make a family event of it and bring my 10 year old son, who has inherited my taste for a good meat sandwich.\n\nWe arrived hungry, and as we approached the door, a staff-member blocked our entrance (yes, blocked us with his body) and informed us very unapologeticaly  \"we're closed for clean-up.  We open again in an hour\".  We were literally 3 minutes past the closing, (which we were not told of when we called earlier) there were people still ordering inside, and my hungry son was salivating at the thick piles of meat he could see through the window.  \"we just want a couple of sandwiches.. we'll take it to go..\"  \n\n\"NO\" was the reply between puffs of his cigarette.\n\nNow, generally, having been treated like this, my response would be \"eff this place.. this is New York City.  I'm going to Katz's\", but my son looked at us and pleaded \"we can come back, right?\"  So we spent a hungry hour occupying ourselves.  We returned to find a camera crew taking up the most convenient table in the very small eatery, interviewing Mr. \"No\".\n\nAs we stood by the crowded entrance, no one asked us if we'd like to sit, if we'd like to order,  or anything for that matter.  I could see the blood rushing to my boyfriend's ears and suggested we make it a picnic:  let's get three sandwiches to go and hang out to eat them at Brooklyn Bridge Park.  He liked that idea so we ordered three of their signature smoked meat sandwiches.  To go.  And we had to wait while the guy behind the counter sliced the tomatoes paper thin.  In dong so, we had time to notice the flies buzzing around inside and I wondered what exactly was being cleaned up in that hour.\n\n20 minutes and over $40 later, we were on our way to enjoying our food.  Or so we thought.  My son's first bite was filled with fatty meat.  My boyfriend's was filled with whatever spice they use.  Mine was filled with... blandness (I later bit into the unevenly clumped spices). And it tasted nothing like the Canadian masterpiece it claims to emulate.\n\nBut, how can  this be?  we wondered.. after all of the rave reviews... well, my boyfriend decided to send an informative email to the owner, explaining our experience, and in particular, the fattiness and uneven distribution of the spices.  Maybe the staff was new?  Maybe they were nervous about the filmed interview?  \n\nHe received a nasty and condescending response lecturing him on how he should have read the info online, and then he would have know they were closed for an hour.  And he makes sandwiches \"the way HE likes them\" -- fatty.  He concluded the correspondence  by suggesting we eat elsewhere if we couldn't appreciate the art of this delicacy.  \n\nNow, having grown up on the Lower East Side of Manhattan, I know all about what good meat is supposed to taste like.  This wasn't it.  Having grown up close to the Canadian border, my boyfriend knows what the real deal tastes like.  This wasn't it.  \n\nI don't recommend Mile End on any level.  At all. It didn't even pass the hungry ten-year-old boy test.  I've seen the kid eat things I didn't even know were edible... and he wouldn't finish this.  That's saying something.", "author": "Diana D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-02-01", "description": "I discovered Mile End while watching the #FoodNetwork. I was super excited to see an eatery that was within traveling distance. I have been here 3 times... Each time was more disheartening than the last so I gave up altogether. Although the food is extremely delicious, the service is quite horrible. The first time I walked in, I was never greeted or acknowledged. It is my stomach that battled my brain to continue with my order. The 2nd time I called for a pick up order and upon arriving, I waited 5 minutes for an employee to SPEAK TO ME. My final visit was a few months ago. I walked into Mile End and was told that I could not order and wait for my food because it was too crowded inside and that there were no tables.. .Basically, we aren't serving you. I don't know if it's the days of the week that I go... but what I do know is that I ENJOY GREAT FOOD! Mile End is a SUPER DISAPPOINTMENT to Brooklyn in it's treatment of pre-gentrification residents... I have 2 degrees... I don't know much... but I know enough NOT to patronize an establishment that doesn't respect me as a person for WHATEVER reasons !!! I gave Mile End \"1\" star because I wanted to write a review on Yelp... Good Day!", "author": "Nay C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-05-29", "description": "Normally a 1 star is reserved for a place where a rat comes to the table to beg for scraps but in this case it's because the prices here are insultingly high. Sure this is in a upscale neighborhood but apparently they either think people there are idiots or they don't ever want return customers. I came for the \"best\" matzo ball soup and got robbed. $9 for a PINT of soup with 1 matzo ball. I almost ordered a Greek yogurt with granola before I noticed it was also $8. I tried to redeem my purchase by buying a \"homemade\" chocolate babka. I was horrified when they brought me not a  whole babka but a thin slice of babka...for $8. The food may be okay but they certainly do not have a cornerstone on Jewish deli food in Brooklyn and with those prices, I'm surprised if they don't go under within the year.", "author": "Dori B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-10-29", "description": "I ordered a matzo ball soup to go that was essentially chicken fat with a matzo ball. I've ordered it at Mile End in the past and the broth was light and very tasty.  I called and asked if they've changed their recipe and I was told they did not and that they would be happy to send me another given that I was not happy with the first.  It was the same.  The soup is terrible and at almost $10 it is ridiculously overpriced.  The only reason I'm not giving a one star is because they were nice enough to send me another order of the soup.  I think quality has gone downhill at Mile End.  I can't recommend this restaurant.", "author": "Paul A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-10", "description": "The food here is delicious: up-market takes on traditional Montreal delicatessen food.  The smoked meat is the star of the menu and can had in a hash topped with two expertly fried eggs or in a simple sandwich with a slick of mustard (ask for cheese at your own peril).  Other menu highlights include a dynamite appetizing platter with some truly excellent smoked fish and Montreal-style bagels (a rarity in NYC, go north for the real thing!).\n\nThe space is small and inviting, when not overly crowded.  Brunch lines can be long, but there is take out.  \n\nPrices are a little higher than you might expect.  The price point is right for the quality of the food, but do not go in looking for deli/coffee shop  value.", "author": "Nick K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-09", "description": "Ordered through DoorDash app on a gloomy Saturday morning. My order was delivered around 20 minutes faster than anticipated so I was already primed to be happy with the food. The whitefish salad was fantastic. Very light and fresh, perfect with the homemade pickles. The chopped chicken liver was the best I've had, hands down. The chopped liver was served with a generous collection of pumpernickel and seeded rye toast, and the liver itself was garnished with chives and fried garlic. Accompanying the delicious mound of perfect chopped liver was an assortment of pickles that included some pickled anise and cauliflower, so good. Only reason the review is four instead of five stars is that I expected more from the bagel. The bagel was serviceable as a vehicle to eat the whitefish but it wasn't the dense or chewy classic I expected, it kind of crumbled as well. Overall though great meal, I'll have to go back and sample more of the menu at the restaurant.", "author": "Shahar A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-04-10", "description": "I'm still in disbelief that I live 4 blocks from Mile End and I never had dinner here. Thank goodness I saw my friend's random photograph of The Brooklyn Inn on Facebook, because if it weren't for that, I would have never gone. He's the one who convinced me to join him and his friend for dinner there. \n\nThis was one of the most surreal and pleasurable dining experiences I've had in awhile. First of all, the two people I was with had been drinking since 11 a.m. and were so drunk that one of them fell off his bench and on to the person sitting behind him. I was in shock that our waitress didn't ask us to leave. It's because she was the coolest waitress on earth. I believe her name was Brenna. I'd go back just to see her!\n\nAnyway, after being rather amused by the state of my company, we finally were able to order food. I'm pretty sure we ordered every meal on the menu since my two companions were too inebriated to read the dishes. I felt lucky that I was able to taste nearly everything this wonderful place had to offer. From the french fries doused in gravy and curd cheese to the plate of meat, almost everything I consumed was beyond delicious. I say almost because I was moderately terrified of the lamb tongue. It was my first time eating this muscle, and I felt a little sick to my stomach with the thought of a dead animal tongue on my own tongue. Don't really like making out with my food. But I could tell this dish was good. \n\nFor desert we had the cheese cake. I doubt my friends remember eating it, but I'll never forget how delightful it was. \n\nI'm looking forward to returning to Mile End. I think Brenna said she works there on Monday nights, so I'll be sure to go back then.", "author": "jennifer d."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-20", "description": "I shall write a \"poem\" (in the loosest sense of the word) on the subject of Mile End, for it is deserving of such a thing:\n\n\"Do you want poutine with smoked meat, my friend?\"\nOn Mile End's delights you can always depend.\n\"What of their lox, I ask you is it really delish?\"\n\"On a Black Seed bagel, this is quite some fish!\"\n\nWith staff that know a thing or two of beer;\nPair it with a latke and you'll let out a cheer.\nAnd even your sweet tooth they will satiate:\nEvery dish is superb and can only titillate.\n\nVenture over to this deli on a weekend morn -\nCoffee and a breakfast sandwich, no time to yawn.\nThough the fare's not light, not remotely so,\nIt's the best thing Canada's given us since snow.\n\nWhether it be dinner or an indulgent brunch,\nRest assured: on only delicious things you'll munch.", "author": "Daniel K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-24", "description": "Was going to lunch with my friend Jeremy G. and he recommended this place - an interesting mix, A Canadian Jewish Deli. \n\nIt's a very unassuming tiny place with a few booths, and/or the option of sitting at the bar - since we were just two, jeremy - being the new yorker he is, quickly snatched up the only open two seats at the bar before they were taken. \n\nAt the bar you can see them taking out the fresh meat and slicing it up... Mmmmm.. \n\nWe ordered a smoked meat sandwich, butter milk fried cod sandwich, fries, and purple coleslaw. It was allllllllllllllllllll good..... The meat on the sandwich was so tender - just delicious.  I'm not a big french fry eater but these were probably the best fries i've had in a while... Since they made a mistake on our order - the chef gave us complimentary ruggalah and mondelbrot - lovely, just lovely. \n\nThis is definitely a place worth trying - but the food is really heavy. I plan on going but in not less than 5 months.", "author": "Dew P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-15", "description": "The good: great smoked brisket sandwiches, one of the best in NY.\nThe bad: long wait and not nearly enough seats in this tiny restaurant. \nSolution? Pick up window to go.\n\nIf your a meat lover, you have to try this place. There's a lot of nice shops around to walk off your guilt.", "author": "Lily W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-08-14", "description": "I spent four+ years in Montreal, and this restaurant takes me back. The smoked meat is true to the flavors of all the smoked meat that I had in Montreal, and it is something special and unique. Anybody in the area who has never tried this delicacy should stop by this restaurant. \n\nSmoked meat, if you have never had it before, is very similar to Corned Beef when you first taste it. It is fatty and has the same loose consistency as corned beef, but you will detect that characteristic smoky flavor. The pickles, the mustard, and the simple way of serving the meat to you with a few slices of bread (platter style), is all consistent with how the original Schwartz's does it. \n\nDoes this meat live up to the standards of the grand-daddy's in Montreal? No, of course it doesn't. Is it delicious though? Absolutely. This place is special because it has brought something you can't find really anywhere but Montreal to New York City.", "author": "Jonathan v."}], "servesCuisine": "Delis", "priceRange": "$11-30", "name": "Mile End Delicatessen Brooklyn", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "97A Hoyt St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/jL2-f-hVAwkXx5vELTD0RQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188527510"}