{"aggregateRating": {"reviewCount": 747, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-21", "description": "Stopped in for brunch with a group on a recent trip to NYC. It was raining as we waited outside for nearly an hour and half, but it was well worth it in the end!\n\nThe restaurant is small, but cozy. Decor is modern and hip, with nice white subway tile and black accents. Our server seemed a little frazzled, but friendly and helpful enough when pressed for suggestions on what to order. My husband got the reuben and said it was definitely in his top 5 reubens of all time. I got the Mont Royal, which consists of three giant potato pancakes, housemade lox, sour cream and tobiko. I had a similar dish at Russ and Daughters and (sorry) this was better. The latkes were crispy on the outside, but tender on the in, and the lox was rich and flavorful. I also had a bite of my sister's bagel with whitefish salad which was really decadent and excellent.\n\nAll in all, I had a great experience at Mile End and I'd come back!", "author": "April B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-01", "description": "Oh boy, be still my arteries! Oh man, stop calling me credit card companies, I will pay up soon! Let's ring in the new year proper and start with some decadently smoked meat and heart stopping poutine. Yes, that's right, poutine AND smoked meat. We had ordered the large plate of poutine and had big chunks of smoked meat so for those who got the crappy end of the stick when they ordered this dish then it sure sucked to be you. BUT, I would like to think if you pointed this out to one of the many lovely ladies who works there they would be happy to amend this travesty. \n\nRuth Wilensky was simple and delicious with all the onion-y goodness you can imagine in a sandwich. Smoked meat hash with sunny side up eggs is spot-on basic fare; you can't mess up eggs, potatoes, and of course, meat. The one downside of this joint is the weak coffee; I recommend going elsewhere if you want a hot cup o' joe. Prices can run a bit high so be prepared to see your breakfast bill dent your wallet but that's where credit cards come in handy, amirite??", "author": "Helen C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-12", "description": "Really small place, but the food is excellent. I guess the thing they're known for is their pastrami sandwiches or at least that's what my friend told me. In my opinion the gold standard of pastrami sandwiches is Katz's and while Mile End isn't quite on that level they're a close second. The poutine is also a main item here and I would definitely recommend getting an order. It was my first time having poutine and I now understand why it's so big in Canada. What's not to like about fries, gravy, and cheese? The reasonable prices are just another bonus. Definitely worth checking this place out.", "author": "Devin B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-10", "description": "Great coffee, fast and creative food made with a respect for flavors. The setting is simple and unpretentious, with a real neighborhood vibe to it. We'll certainly be back.", "author": "Ryan R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-14", "description": "Came here for the Chinese Jewish Christmas Dinner (reservations required). We really liked the unique deli-flavors - think Corned Beef Pot Sticker. Although it was a bit greasy, we enjoyed it, so we decided to try it for lunch on a regular day. I got the corned beef (smoked meat) sandwich. It was delicious, but small in size. However, the meat was flavorful. The space is very small, and prices high. I was not wowed,", "author": "Darryl R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-11", "description": "This is a place I've wanted to check out for some time now. I recently stopped in with two of my homegirls on our Tour de Brooklyn. We were going to get the smoked meat poutine, but noticed a foie gras poutine special on the board. Needless to say we had to get that. Poutine is not a light food. Foie poutine is DEFINITELY not a light food. Beds on sight would be a heavenly addition. The wait was about 15 minutes then we sat at the counter. Service was super friendly. I wish I knew the name of the guy that was working there. He was very personable and gave us a small taste of the smoked meat. We now have incentive to return. And return we shall. And so should you. ENJOY!!!", "author": "Sebastian H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-27", "description": "The meal I ate at Mile End was the best meal I had while visiting New York. My husband and I ordered several items since our next trip to Brooklyn will be next year (hopefully). We got poutine, pierogi, latkes and a corned beef reuben to share. It may have added up to a few days calorie allotment. Everything was SO GOOD! It's hard to pick a favorite item... yeah, I can't do it. It was all great. I was so happy. My aunt and a friend both got the breakfast brisket hash. They said it was very tasty. If you are in NYC in any of the boroughs I recommend you make the trip to Mile End. It's a short walk from the subway stop. I should probably walk over from Manhattan next time to burn a few calories...", "author": "Brandy M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-11-04", "description": "I've tried this place time and time again, but the service is horrible, end of story. The food is good but it's not worth the getting treated like dirt. Employees are rude, arrogant and everything and anything seems to bother them. Too bad.", "author": "Roberta L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-10-24", "description": "Decent food but expensive and awful hostess rude and impatient would never give my business again", "author": "Derek C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-10", "description": "Breakfast food and coffee tastes delicious. I like the vibe/atmosphere of the place. Good for groups of 2 people.", "author": "Julius S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-06-13", "description": "This was a disappointment for me. I heard that it was good. However I wasn't impressed. the meat was dry and had no flavor, the poutine just tasted like you fried salt and while it was a nice looking place it wasn't worth it. Also was very expensive. No one go here please.", "author": "Quincy B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-12-03", "description": "I would definitely not recommend this restaurant. I recently placed a catering order ($1,000) for a holiday party and had a wonderful experience over the phone with Hanna. \nThat good experience quickly went away when I politely emailed the restaurant the night before my event. I needed to add to my order, due to some last minute guests who were now able to attend my party. \nTo my surprise, Joel, who notified me he was covering for Hanna, responded to my email the following morning in a extremely un- accommodating/non-customer service oriented manner. I was in a real jam. I then spoke to Joel over the phone. At this point, he was very confrontational. I got the feeling he was the owner. \nTo make a long story short, he could not add to my catering order. He said, being it was Sunday, he needed the food on hand for his every day customers. I thought this made no sense. I went on to explain to Joel; \" So I can come in as a restaurant patron today, order what I need to complete my catering order because I'm physically at your restaurant, but you personally can't add to my catering order? He was still confrontational and argumentative after this and still refused to accommodate me. \n\nIn the end, the food arrived 45 minutes late. The party had already started and the food was not delivered. \nThe food was delivered cold (it was supposed to be delivered hot) and was completely awful. The chicken fingers were dry + over cooked, the latkes were burnt, the hotdogs in a blanket were dry + burnt, the sandwiches were mediocre (definitely not worth the extremely high price tag), the doughnuts were tiny/dry/burnt + tasteless, and the salad was so soggy no one ate it. \n\nWhat a complete disappointment. I should have cancelled my order after speaking with arrogant Joel over the phone and given my business to a local pizzeria who would have welcomed my same day order. I'm 100% sure a pizzeria would have appreciated the $1000 order unlike Joel who thinks his low quality smoked meats are an artisan gift the world should thank him for.\n\nAt Mile End Delis ridiculously high prices for low quality food and bad service, you're so much better off going to the 2nd Avenue Deli. At least you will get the real deal; authentic NY deli food coupled with good old fashioned customer service. Not some arrogant NY transplant (Joel) who doesn't respect his clients and thinks he is doing you a favor by taking your money. \n\nI'm really surprised this place has some good reviews. I guess their are a lot of people out there who don't cook anymore and forgot what real food is supposed to taste like.", "author": "Sky Z."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-14", "description": "Strolled in here for breakfast just before the epic blizzard of 2017. Well, honestly it was more like a mild snowstorm than a blizzard LOL. But thanks for the snow day!!\n\nAnywho, this little place serves up sandwiches and fries. They typically cater to a breakfast and lunch clientele. They offer a smoked brisket sandwich as well as some other specialty sandwiches. However today, I went simple and had your typical bacon, egg \u0026 cheese on a roll. I also ordered a few refills of coffee while I watched ambulance crews and the giant city snow plows plod on by.", "author": "Eric A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-08", "description": "Mile End is one of those places that I must have passed a dozen times and wanted to try, but every single time I did I had already eaten and was stuffed to the gills.  However, on a recent trip into Brooklyn my GF and I needed a brunch spot and Mile End made for a perfect choice!  \n\nWe were lucky enough to get to the restaurant just as it opened, so we were seated immediately.  Seating is mostly along benches that can accommodate about two people on each side (possibly three).  The kitchen is partly visible and the decor is set up to look like you are in someone's kitchen.  There is something retro about the design, yet the mood is very comfortable and contemporary thanks in part to the very friendly staff.\n\nWe wound up ordering the yogurt with granola and the Duck Grilled Cheese.  Yeah, that's right fellow Yelpers...DUCK...GRILLED...CHEESE.  If you're drooling already, then be happy knowing that this sandwich is every bit as good as you are imagining right now.  The salty flavor of the duck, with the savory and sweet cheese flavor and perfectly crispy bread combine to make an artery busting pile of deliciousness.  It was, in short, amazing.\n\nThe yogurt and granola was good, but there was a lot more dried fruit in it than I had expected.  A bit too sweet for my tastes, but your mileage will vary.\n\nMile End also serves Stumptown coffee, which is always a plus for me.\n\nIf you're in the area, you need to check this joint out!", "author": "Benson Y."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-05", "description": "We got there almost right after they opened, so there were only few people in the inside, but it quickly got busy. The inside is rather small, they have nice counter seating on one side, and large picnic style tables on the other side. The tables are large, and are meant to share with other customers. The entrance side of the wall have large windows from floor to ceiling, flooding the inside with natural light, illuminating their simple, sleek interior. \n\nWe started off with a nice cup of coffee. We wanted milk to go with the coffee, and it took as asking 2 different servers 2-3 times for it, before they finally brought the milk...  The service was not consistent, it was ok at the beginning, but quickly became the game of catch. It was not easy to get their attention, even though it was not packed. I guess it was a bit more relaxed atmosphere, which we were ok with, but when we needed milk for our coffee, or refill of water, or wanted to get a check, it took more than enough effort and time. Other than that, they were very nice and helpful (once you catch them). \n\nThe food was very good, even though a bit more pricey than I prefer, but they do come with high quality food.  I have not had any disappointing food from any of their location, so you know I will be going back for some more soon!", "author": "June S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-13", "description": "Meat Meat Meat, everybody \n\nGot the Smoked meat burger $15 and the the Smoked meat sandwich $15. The burger was great, but the sandwich was a bit salty.  \n\nMany other great looking and popular jewish deli options. Need to come back and try other things on the menu. They do breakfast, lunch, and dinner.\n\nThe place is small so expect a possible wait.", "author": "Tim R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-12-03", "description": "Their Hanukkah menu SUCKS!! They dare say they make sufganiyot but they sell tiny balls of dough (smaller than a racket ball) with the smallest amount of jelly possible. Won't order again. VERY disappointed.", "author": "Hannie Z."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-03", "description": "Came based on recommendation of friend. Waited about 15min for table on Saturday morning \u0026 we were seated at bar. Only 3 large tables \u0026 bar seating for 6? \n\nReuben w fries and slaw. Pierogis. Chicken schnitzel sandwich ordered. All delicious and large portions. The large plates of poutine and breakfast items were popular with other diners. Definitely will be back!!", "author": "Cindi P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-25", "description": "Artery clogger alert!\n\nDo you LOVE meat or anything fried?\nDo you want to unleash your inner carnivorous nature?\nDo you want a fried food that is great for brunch/drunk experience?\nOr do you simply just want to find excuses to be pigging out and #YOLO?\n\nIf any of those are yes, then consider Mile End.\n\nToday during my 1st time trying this place I got the following:\n\n1. Ruth Wilensky - which is FRIED beef salami, mustard and onion roll.  It is essentially a small grilled pressed fried meat sandwich minus the cheese -- solid, great start for an artery clogging meal\n\n2. Small smoked meat poutine (gotta have it after all the hypes!). Even with small size it is HUGE in flavors. Delish fries, smoked meat and choose curds smothered in rich \u0026 glorious beef gravy *Salivating as I am reliving this again* - My artery was probably shrunk by 50% by the time I finished this\n\nFood came out really quick. Service is fast and courteous. Price a little high since  my meal added up to $27 with tax and tips.\n\nI will be back BUT not before detox is done post meal.\n\nPS: I wish I could take pics of the food - but my phone battery died.", "author": "Richard J."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-08-26", "description": "Atmosphere is very nice and staff is friendly and fast. The Bagels were stale and came out of a large moving bin. The home fries, bacon, and latkes were delicious.", "author": "Gunnar L."}], "servesCuisine": "Delis", "priceRange": "$11-30", "name": "Mile End Delicatessen Brooklyn", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "97A Hoyt St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/jL2-f-hVAwkXx5vELTD0RQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188527510"}