{"aggregateRating": {"reviewCount": 747, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-06-29", "description": "I had the brisket sandwich. It's called the smoked meat sandwich on the menu. Not bad. For the Small size, Definitely overpriced @ $15... I will MAYBE come back to try other things on the menu, such as poutine.", "author": "Emmanuel I."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-06-03", "description": "Pros - Great coffee, don't spoil it by adding sugar.\n        - smoked duck grilled cheese\n\nCons - Poutine was not worth the price.  I'll take diner disco fries anyday.\n         - falafel was insanely salty and it's coming from a guy who loves salt.\n         - the wait.  This place is small and all I ask is the true wait time.  30 min turned into       55min.  \n\nDo yourself a favor and don't show up between 12 and 2pm on the weekends.", "author": "Thomas H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-08", "description": "A nice little eatery with friendly service. The guy who served us was a little weird but it was coo\nI got the falafel sandwich, which was A+! I did request for the garlic sauce to be taken out specifically, however, which they didn't do, and I was pleasantly surprised to be blessed with garlic breath for the rest of the day. It's good that I don't date a vampire", "author": "Vivian X."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-04", "description": "Amazing food, and great bagels. Quite filling and heavy breakfast options. Didn't rest well in my stomach but was thoroughly enjoyable to eat. Looks like they have an extensive beer menu, for their size and outstanding cold brew coffee. Can't go wrong, but sometimes the wait can be extensive and crowding is to be expected.", "author": "Serena G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-30", "description": "It's poutine week at Mile End! We just stuck with the classic as a side to the smoked meat sandwich (which beware has mustard on it! My boyfriend nearly had a meltdown) and brisket hash (delicious). But my mouth watered watching the specialty poutines being prepared, especially the Greek. Snag a spot at the bar if you can... It overlooks the open kitchen so you can watch the cooks do their thing. Service was a bit slow, and I wish they had bloody Mary's, but overall a solid lunch or brunch spot.", "author": "Davina S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-04-14", "description": "Visited yesterday for what I envisioned would be a repeat of the same great corned beef on Rye but was sadly disappointed.  The beef was mainly chunks of fatty beef with very little meat.  Charged extra $4 for coleslaw side dish.  I was there five years ago when they first opened and the sandwich was great...your typical sliced corned beef to perfection.  No more are they serving the original style sandwich.", "author": "Frances Z."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-03-25", "description": "I liked my food- I got the turkey sandwich and the matzoh ball soup. So what's the problem, you ask? The soup was 9 f*$%#ing dollars! The sandwich was 12 F\u0026*^%ing dollars- now if this were like Carnegie or Katz where you get a giant matzo ball or more then 1/4 lb of meat- i'd be thrilled, but they're nuts with these prices. JEEZ. I've gotten better value at a 4 star celebrity steak house in Vegas. \n\nMy grandpa passed this year :( and I haven't had a decent jewish meal since- but if she saw what I paid for mediocre food- she'd turn over in her grave. You can do so much better with any other jewish deli or if you need delivery- definitely go with a diner that will rival the quality of this food for way better value.", "author": "Bethany W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-12-30", "description": "Overpriced. Underwhelming. Bland.\n\nThe redeeming quality of Mile End is its atmosphere and fantastic service. There are 3 big communal tables/benches and a few bar seats and due to the nature of the setup, you'll leave smelling like fried food.\n\nI had the latke and schnitzel sandwich and a try of the smoked meat burger. The latkes and schnitzel were tiny. For $16, I'd expect a side or something. It's literally, potatoes and 2 small pieces of chicken. Why is it so pricey? My latkes were burnt and the aftertaste was pretty bad. The poutine was relatively good but again, overpriced. Food took quite a while to come out as well. \n\nNot a fan, there are better places in the area to get greasy food.", "author": "Ngoc P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-26", "description": "Always good food, good times, everytime.\nThe place is rather small, there are only 3 large picnik table, a small table for a couple and the bar. A little bit pricey but never dissapointed me.\nI looooove their cheese blintz and chicken shoarma.", "author": "Dita A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-26", "description": "Ambiance/decor-5\nService-5\nFood-5\nStrikeouts-0/3\n\nArrived around 6:30. Good service, good food, and a good night. \n\nTwo people seated in the front of the cooks. These guys honestly look like average joes, but they were very open to conversation and advice. Very modest too, and their prep methods actually differ slightly. The waitress was patient and efficient, though we didn't give her much trouble ordering. The menu was small and it was easy to order a variety. We had chopped liver, small classic poutine, smoked meat sandwich, and beats with smoked whitefish. \n\nThe chopped liver and poutine was served very quickly. Poutine was average. The fries were average, gravy was average(tho very warm), but the cheese curds were awesome. Big chunky and very close to melting point, making the poutine truly a poutine. I've never had chopped liver, but this was a pleasant experience. The bread and pickled veggies accompaniment was perfect. The buttered bread and liver were very similar to eating tuna on a cracker, but more refined as it should be. Beats and smoked fish was very unique, definitely have to try it, and I hate most veggies! \n\nLastly the smoked meat sandwich. Glorious, glorious smoked meat. It can give Schwartz a run for their money. This is where the chef prepared ours with the fat, which I love, but depending on the chef, they cut it off due to controversy on fat. Definitely worth requesting if you're the same as me!", "author": "NimbusExpress N."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-03-19", "description": "Generally consider this a neighborhood fave, but service has gone down hill. Recently my server was pretty rude when I tried to get her attention to ask about a part of our order that failed to materialize--and then she failed to apologize for forgetting it, or the long wait for the item to arrive. Kind of a buzz kill at a place i consider a neighborhood fave.", "author": "Spicy J."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-02-24", "description": "I still think this place is crap and I mean crap, the portions get smaller an smaller and still taste like not a roast meat sandwich:( 8 thumbs down.\nI do not get it?", "author": "Gregory Paul S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-25", "description": "The place is extremely small but it's got good enough food.\n\nWe sat by the window at a tiny table since it's got a bench set up and we didn't want to eat with someone else hogging their own bench. \n\nI ended up switching seats because one side was right by the heater and one side was chilly because of the broken window.\n\nOkay now for the food..: the large poutine was so good! And great for sharing! I had the broussel sprouts and I wasn't the biggest fan. Something in the dish was so spicy but it a weird peppery taste and along with the raw green onions, it was too spicy and raw for me. I did like the way the sprouts were cooked and I loved the fried egg\n\nWhat made the restaurant good was the service and what my fiancé ordered: the chicken Reuben. It was cooked with perfection and so good! Loved the sauerkraut\n\nIf I do go back; I will most likely get takeout since the restaurant is pretty small and they are so busy all the time. I will go back for the poutine if I am in the area", "author": "Yue W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-25", "description": "came here for late lunch on a sunday at 2:00 p.m. we were a group of 4 people and had to wait 20 minutes. hostess was really attentive and updated us whenever she had to let smaller groups go ahead of us. The beer/cider/wine selection was really good ($7-12). There are not many juice options and there is no hard alcohol served. \nMatzo ball soup  ( one matzo ball) was very small for $9, should have been more like $5. \nreuben was very large, but there are no accompanying sides\nyogurt +granola+ fruit was large and the yogurt was fantastic\nspecial sandwhich = bacon, fried pepper, ramp cream cheese, sprouts- was very tasty but on the smaller side. \npickles are HUGE\noverall, attentive service, cute atmosphere, sizing issues but everything tasted great.", "author": "Livery H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-07-29", "description": "Small but nice place but I would consider expensive.\nOrdered the Smoked Meat Sandwich for $15, it's got good flavor and definitely delicious but for the money I think it'd be good if they threw in some sides for free. \nOrdered a coleslaw side for $4, again I think it's overpriced for cabbage..\n\nIf the price was 20-35% lower I would be rating it 4 star. Nothing wrong with the food and environment in fact just based on that it's a 4 star joint.", "author": "Jive O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-26", "description": "I'll be honest ... the only thing I've eaten here is the smoked meat poutine. It's so good I don't even want to order something else. \n\nThe meat is top notch and smoked and cured perfectly. Put it on top of some killer poutine loaded with cheese curds and you've got a meal. \n\nThe last time I was in, I also bought a quart of pickles to bring home with me. Seriously, some of the best deli pickles I've ever had. I can't stop eating them.", "author": "Taylor C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-03", "description": "I took a chance despite some negative reviews \u0026 was pleasantly surprised.  I had \"The Grandpa,\" which had fresh, moist turkey cradled by pillowy caraway seed rye. A slab of turkey rilletes added richness, while the vinegary pickle contrasted with the fat \u0026 added crunch.  The rilletes were a little too thickly applied on about 1/2 the sandwich, actually making it a little too rich. Overall, though, it was Delicious! Yes, the server cashier was a little defensive \u0026 maybe stressed by a large variety of interactions she had that day, but functionally she did her job.  Apparently, it is quite popular judging from the filled tables, phone calls, \u0026 walk-in pick-ups at 9:40pm on a weeknight. I guess they didn't read the negative reviews!", "author": "Yay B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-11-05", "description": "I've been here a few times, and the most recent visit struck me as lackluster.  \n\nThe poutine is what I generally go for here, but the special poutine I ordered, the poutine with foie gras shavings came up short.   It was overfried fries soaking in the gravy, with curds. The fries were rock hard, to the point that spearing them with a fork was impossible.  They were nice enough to let me have my fois gras shavings - or dust -  on the side, but the foie amounted to something like a teaspoon full  (not a rounded teanspoon, but a level one). C'mon guys, I know foie is pricey, but not THAT pricey.  And what's the point of adding them as a feature if you can't even taste them?  It was certainly NOT worth the $20 I spent on them.  \n\nI may just have to get my poutine fix an hour away, at M. Wells from now on.", "author": "Kayo N."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-04-29", "description": "Don't get the Matzo ball soup. One tiny 2 inch piece of chicken and the Matzo ball is off in both texture and flavor. Sorry for such a low review, but this is a staple for any deli.", "author": "Koby T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-06-19", "description": "Tried this spot, I had the Lox with Scrambled eggs.  The lox was very salty and not enough eggs. Also coffee wasn't that good either.", "author": "Fabolous D."}], "servesCuisine": "Delis", "priceRange": "$11-30", "name": "Mile End Delicatessen Brooklyn", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "97A Hoyt St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/jL2-f-hVAwkXx5vELTD0RQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188527510"}