{"aggregateRating": {"reviewCount": 747, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-12-05", "description": "A solid place with good food. They are really friendly and pretty quick once you get seated which unfortunately takes a while. \nHowever, i would say that Katz does a considerably better job at the sandwiches.", "author": "Sachin P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-07-25", "description": "MEAT ME UP SCOTTY!!!!!!!!!!!!!!! \n\nMile End is delicious. I have tried to come here 3 times in the past but it was too packed. My friend and I decided to meet here at 11am to beat the crowds. We were ok not eating any smoked meats since those are not served until noon. We were feeling decadent so we both started off with drink. My rose was good, nothing mind-blowing, but it was refreshing. Mike got a Fire Island ale. \n\nTo eat Mike got the smoked meat hash (which was confusing because if they don't serve smoked meat until noon, why do they have this on the brekkie menu?) and I had the mish-mash, which is essentially an omelet with onions, spinach, and either lox or salami. Citeing anemia as an excuse to eat as much fatty meats as possible (I am really not anemic, fyi), I opted for the salami. They had no issues preparing my omelet with just whites. \n\nWe both enjoyed our food. I snuck a bite of Mike's and I found the brisket to be a bit dry. My omelet was tasty but it was kinda under seasoned. The salami itself was tender and juicy but it wasn't salty the way normal salami tastes. Maybe I'm used to shittier quality salami, but I like it salty. (get yr mind outta the gutter!) \n\nDamage with tip was about 20 bucks. \n\nI want to return next time to try the mont royale (lox over a latke..yum!)", "author": "Anne H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-04", "description": "Mile End has been at the top of our list for several months.  When we finally arrived, we discovered that they closed early for Easter.  However, they let us order 2 smoked meat sandwiches, with a pickle, cole slaw, and a Virgil's cream soda as takeout.\n\nThe smoked meat sandwich is a heaping serving of crimson, smoked beef brisket on sliced rye bread with mustard; 'big enough for one person but not big enough for two'.  It was so delicious I ate the whole thing in a few minutes--the meat was so flaky and tender it fell apart.  The cole slaw was a brilliant purple.  It was light and bitter with vinegar--really refreshing.  The pickle was crispy and not too bitter--better than average.\n\nWe still have designs on the poutine, which we will come back soon for (summer be damned!).", "author": "Matthew A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-27", "description": "This food made me want to hug the chefs; eating this food felt like getting hugs from the chefs.", "author": "Jess T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-20", "description": "I went to the real Mile End once in Montreal.  This is just as good.  I loved the pastrami so much I almost died.", "author": "Marissa G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-02-28", "description": "I was very disappointed when I went here today. I hadn't been in a while and when I saw the smoke meat sandwich at $12, it seemed much more expensive than I remembered.  I asked if the price had gone up recently and was told \"no\". Well, I guess it depends on your definition of recently. I did a search when I got home, and in a review from May 2010, the smoke meat sandwich was $8. So, in less than 2 years it's gone up by 50%!! Then in 2011 they offered 2 sizes, one for $9 and one for $17. Whatever size it is now, which I'd bet is smaller than in 2010, it should be listed as the teeny tiny size. It is ridiculous. While the bread was great, the meat was dry and virtually fatless. Very inconsistent; last time I went it was quite a bit fattier (which I personally prefer). And the brussel sprout salad- very tasty, well-dressed, but unabashedly miniscule again. And a primary reason the salad sounded great was Mile End's use of Ewphoria cheese. If you've tried this cheese, you'd probably order anything that contains it, too. And you'd also probably be very not euphoric, as was I, when you see they only put about 5 paper thin, tiny shavings on it. \nWhy so stingy?? It's incredibly frustrating, especially for a fellow Montrealer- sorry.", "author": "C L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-18", "description": "Loved the smoked turkey. Unfortunately they gave us the drier, crumbly end pieces of the smoked meat. Next time I will have to ask for fatty.\n\nI have very little experience with poutine, but I liked what I had. \n\nAlso my first Montreal bagel experience, it was good but any distinctive taste was lost under the lox and cream cheese. \n\nPics here: http://www.flickr.com/photos/lawandfood/sets/72157623633916486/", "author": "Chief H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-11-13", "description": "Go for the poutine, not bagels and cream cheese.\n\nThe space is small and they will not sit you at a half empty table with another group which was annoying. The staff were also kind of snotty.\n\nThat being said the cheese curds were big, home made and fresh. HTe gravy was rich and flavorful and the fries crispy. If you are canadian or just a fan of poutine check it out. I would have given it 3 and a half stars but this is not an option on yelp.", "author": "Christoff F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-08-26", "description": "Porko and I ended our crazy BKLYN food day with smoke meat, poutine, a pickle, and borscht!\n\nThe smoke meat was okay, but not great.  It lacked the glistening fattiness that I'm accustomed to (okay, maybe smoke meat is supposed to be lean and I just like the BAD smoke meat).  The pickle was delicious.  The poutine was very solid.  The borscht was probably my favorite, though it was a little mealy (again, maybe it's supposed to be mealy, but I just prefer mine smooth like buttah).\n\nI probably wouldn't need to return, but the service was great and the atmosphere oh-so-BKLYN.", "author": "Deborah H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-05-22", "description": "$15 fatty brisket aged for 11 days, like melt-in-your-mouth steak crossed with beef jerky\n$11 crispy poutine slathered in gravy and cheese curds\n$1 fresh pickle\n=delish when you're famished and waiting 45 min in anticipation makes it all the tastier\n\n*beware of the Montreal Canadiens paraphernalia neatly tucked away in the restroom and the funny soap on a spring rope?", "author": "Jomei L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-16", "description": "amazing. nothing more to say.\n\nthe smoked meat sandwich is literally absurdly good. juicy, tender, flavorful. ah! making me hungry talk about it. not cheap, $9, but that's normal for brooklyn.\n\npickles ($1.50) are crisp, wonderful side.\n\nMatzah ball soup was also extremely good, but at $6 it's a pricy \"side\", and you only get one matzah ball.\n\nThe poutine was great, perfect sharing dish for 2 people. \n\nyou have to go.", "author": "Justin S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-09-26", "description": "the smoked meat sammich is deeeelightful. I didn't know what meat I was eating, and I didn't care.  It was like the perfect archetype that is \"meat.\" However, that said, I gotta say I do think $12 is pretty steep for a sandwich that doesn't come with anything (it's $6 to essentially add fries). Really cute space, they move pretty fast, and the iced coffee is legit.", "author": "Gabrielle C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-10-21", "description": "Montreal deli at NYC prices- but that's okay because the meaty goodness reminds this former-vegetarian why embracing the salami(sandwich you sicko) was a wonderful decision.\n\nOh and get a a bowl of matzah ball soup and a sour pickle, you won't be sorry.", "author": "Becca F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-15", "description": "Not sure why some people complain about the size of the sandwiches. I eat like a horse and felt pretty darn full after eating one of those bad boys. This place is FABULOUS. Can't speak of much other than the smoked meat plate. It's a must if you've been dreaming about that pastrami you used to eat when you were a kid (circa 1973). Good grass fed beef, smoked to perfection and then served with one of the best sour dill (apple cider vinegar?) pickles. We ended the meal with the coconut macaroons. Then took four more macaroons to go. I would go back just for the macaroons. Did I happen to mention the macaroons were awesome. Chewy, not too sweet, a little bit salty, with a maringue-y crusty crispy crunch as your teeth make contact with it's cocnutty goodness. Highly, highly recommended. But come prepared to wait...", "author": "Debbie S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-03-07", "description": "Mile End was Mordecai Richler's old hood in Montreal. Its not really Jewish anymore...but the culinary legacy remains. The Montreal deli in classic form this is not (they drink Cotts black cherry, vinegar cole slaw, and the pickles are usually something akin to the full sours like Strubs)...but the poutine (with real cheese curds...like the ones you get in Quebec or the North Country in NY) and the smoked meat are really good. The bagels have the love...dipped in honey water before baked. Very happy these folks have come to Brooklyn to offer up a really unique thing in Gotham. BTW..most of us from areas in New England with a lot of French-Canadians have places with poutine on the menu...so this isnt no new.", "author": "James R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-04-06", "description": "I'd been looking forward to visiting for quite some time, but initially got turned away because my party and I got there too late for lunch (totally fine). The second attempt, I made it in, but it was after having to wait in the cold for 1/2 an hour because there was no seating. (It's a very small location, which I actually like, but it's difficult to get in cause it's usually busy). \n\nMost of the food was delicious, we got the coleslaw (tasty with fennel seeds), the borscht (wasn't the best I've had, a bit watery and empty in terms of vegetables), the beef brisket on rye (WONDERFUL), and Angus sandwich (also super tasty). My partner was upset about the cost of the beef brisket (a hefty $17 for a filling amount), but I actually understand the pricing if the establishment is curing the meat in-house. I found it to be overall very enjoyable, but not remarkable. I still prefer Katz. I'll definitely order a sandwich to go once in a while, but I don't think I'll be sitting in again.", "author": "Keisha F."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-01-12", "description": "Been here several times whenever I'm craving poutine.  The poutine and smoked meat sandwiches are decent, not as great as you'd expect given the outrageous prices.  $10 for fries with gravy and curds is a bit much, sure.  I figure the splurge every now and then is worth it but after this last visit dealing with a nasty window girl, I won't be returning.", "author": "Jessica H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-19", "description": "No need to go all the way to Montreal!!!  Their smoked meat sandwich was melt in your mouth good, with a great seasoning.  The toasted, crispy bread held up perfectly until my last bite.  My only hesitation is the price, given the same sandwich in Montreal goes for half the amount....But, I will be back....", "author": "Jennifer C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-19", "description": "More inventive, delicious, carefully designed restaurants like this please! It's so clear that everything is house-made with care and attention, ingredients are top rate, service is efficient and friendly. A great place.", "author": "S. E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-22", "description": "Sometimes I get a pretty intense craving for a hot turkey sandwich with mustard on rye bread. Until now, I was always forced to satisfy that craving at Katz's. \n\nI don't need to tell you why I've been searching for an alternative.\n\nTo my delight, Mile End fits the bill. The un-appetizingly named \"grandpa\" sandwich has nice thin slices of moist, hot turkey with tasty mustard on good rye bread. Now I won't have to brave the crowds at Katz's the next time I need my hot turkey fix, thank God.\n\nMy boyfriend also made us get some poutine, which, although the cheese curds didn't squeak, was still definitely the best poutine we've had in New York City. We had read online that the gravy is a chicken and mushroom stock blend, but the waitress told us that it's actually just mushroom and therefore entirely vegetarian! So vegetarians who want to try poutine can do it here.\n\nWhat makes Mile End especially great, though, is how friendly and chatty the sandwich guys behind the counter are. At one point, that \"one is the loneliest number\" song came on the radio and my boyfriend, the guy making our sandwich, and I all immediately started quietly singing along. Our sandwich guy looked up and said, \"At least you guys are a 'two' right now. You have no right to be singing this song.\" Ha! Awesome.\n\nFor the food alone, I'd probably give Mile End three stars. But for the friendly staff and the fact that they're saving me from many overpriced sandwiches at Katz's, they deserve a solid four. I'm a fan!", "author": "J K."}], "servesCuisine": "Delis", "priceRange": "$11-30", "name": "Mile End Delicatessen Brooklyn", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "97A Hoyt St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/jL2-f-hVAwkXx5vELTD0RQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188527510"}