{"aggregateRating": {"reviewCount": 747, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-13", "description": "This is definitely a hip Brooklyn version of Montreal famous smoked meat such as \"Schwartz's\". As a Canadian living in NYC, I was hoping it would be more like the mom and pop style of Schwartz's, a bit grimier, vacuum sealed meat to go, etc. \n\nOther than that, meat was amazing, you have to do the sandwich with the cherry soda, perfect combo!\n\nFrom the looks of it, this place is only going to get more and more popular, don't expect to get a table quickly. Good luck with a party bigger than 4. Definitely a place to go with one other person for IMMEDIATE satisfaction or order to go. \n\nI was bummed their pickles weren't ready, otherwise it would have been a close recreation to my meal at Schwartz. Minus the hipsters.", "author": "Charlene C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-05-07", "description": "What happened?  It might have been a bad day or a bad piece of brisket.  I ordered 2 brisket sandwiches and they were dry, salty and devoid of the beefy taste.  Perhaps this was an anomalous situation because the previous times were always quite scrumptious.  I probably will not take my chances again at $15 a pop.  Visions of the brisket sandwich from Schwartz of Montreal is dancing in my head instead.", "author": "William L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-12-27", "description": "The smoked meat is good,  It's a bit spicier and more flavorful than Katz's.  \n\nI tried the poutine too - nothing to write home about, but still the best in NY.  You can get better poutine probably anywhere in Canada.  Just \"NY Fries\" poutine in Canada is better, and you can get that at any mall.\n\nThe cons are - the sandwiches are tiny, very small portions for what you pay for, the wait is very long, I waited over 30 min, the place is small and popular so you're almost guaranteed to have to wait for a seat.  The whole ordering from the outside window for take out if it's too busy inside, waiting to be called for a table and waiting to be called for your order outside is totally time consuming and even confusing.  They really should invest in those buzzers that tell you when your seat or order is ready because the majority of people are forced to wait outside since there is no room.  That's pretty much it, all in all, not too bad, but it's pretty expensive for what you pay for.\n\nNothing comes close to Hershel's in Philly at Reading Terminal though.  You get twice the sandwich for the same price, it's jucier, hand cut and made in front of you while you're on line, the charred peppercorn is much more flavorful and spicy and they seem to have much more of it.  I think that's the key, I really love the charred edges, the extra peppercorn and the juiciness of a Hershel's pastrami.  I've been to all the big names in New York and Montreal and so far no one comes close.", "author": "K C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-09", "description": "Small and cozy and great service. Smoked meat and eggs and potatoes all good.", "author": "Rachael B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-09-23", "description": "I have been going to Mile End ever since they opened on Hoyt Street. Recently, I'd been wanting to have breakfast but it was always closed. Naive me, I thought they were doing some remodeling or what have you, then today I went to the door to read that they NO LONGER DO BREAKFAST IN BROOKLYN! Only Manhattan. Now, I'm happy that the owners are so successful and they're expanding but to abandon your loyal BK clients just to sell out to Manhattan really left me cold and I gotta say, very disappointed. For that reason, I gave them 1 star. BRING BACK BREAKFAST TO BROOKLYN, BE LOYAL TO THE PEOPLE THAT MADE YOU! Ugh! Enough said.", "author": "John C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-04-24", "description": "I ate an open beauty with lox, creme-fraiche, red onions and an sliced heirloom. He ate smoked brisket on rye with mustard. She ate chopped liver on toasty onion bread. We shared borsht with kale. \n\nThis place rocks and their flea market locations are cool too.\n\nThe age old debates: \n1. Montreal bagels are great, and can only be eaten toasted. If you do not toast your bagels, then the NY variety is better. \n\n2. Nothing beats Mile End's smoked brisket save certain varieties of pastrami and corned beef.", "author": "Barnett Z."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-26", "description": "This place opened up about 2 months ago and has gotten a lot of press. It deserves all the praise, it is very tasty...it is also always really crowded. \nThe meat usually runs out by 4pm. I live nearby so it hasn't been a huge problem from me but if I was planning on traveling here, I'd check their twitter feed to make sure they have meat available. \n\nThe meat is very tender and well spiced. My only negative comment about it is I thought it was a little on the salty side. Even with the saltiness, I thought it was delicious...I just ended up drinking lots of water afterwards. The sandwich is served on rye with mustard, very good. \n\nThe poutine is amazing! The fries are handcut, gravy is delicious, and cheese curds are fabulous. Try to forget all the calories and don't leave Mile End without an order of the poutine. \n\nI also really like Montreal bagels. I know there's been a back and forth as to whether NY bagels or Montreal bagels are better. I like them both but they are very different. The Montreal bagel is sweeter and less doughy. A Montreal bagel, cream cheese, and Stumptown coffee is a great little breakfast on the weekend. \n\nI was really disappointed that when I stopped by today they were out of the homemade pickles. In the times I've attempted to buy one, they've been out. I look forward to trying again.", "author": "Melissa M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-02-28", "description": "I first heard about Mild End from New York Magazine and how it is better and cheaper than Katz Deli.  This must be the first time New York Magazine is wrong.  \n\nI went there on a Saturday night and was relatively busy.  I noticed that there were only three four person tables and a small two person table.  There was also a five person counter.  There was a six person party ahead  of my party that got a table about 15 minutes after I arrived.  I however had to wait another 45 minutes just to get a table.  I did put my name down but when someone in my party checked with one of the waiters, he had no idea who we were but reconfirmed with his notepad.\n\nWhen my party did get a table, two people on the same table were finishing up.  However, they took their dear old time and I had to wait another 15 minutes.  \n\nWe were then given service.  I ordered a chicken dish while my family ordered pastrami sandwich specials.  Also, being a Montreal Jewish cuisine, we also ordered poutine and a special matzo ball soup.  The soup was good but very salty.  Also, my biggest problem with the soup was that it was served family style and priced per person.  It was priced $12 a person!  That was $48 just for soup!  What a rip off!.  \n\nMy chicken was good but again, salty.  The pastrami was good too but my family liked Katz better.  \n \nService seemed amateurish.  Food also took a while to come out.  How long does it take to cut meat and put it on bread?!?!?  Also, the music was way too loud and the waitress turned it down a couple of times but when back up soon after.  What I did not like was that most people took their time eating even if they were finished.  I wished that the waiters told people to hurry up, especially when there is a long line out front.  \n\nI don't think I would want to return to the Mile End.  I'll instead go to Montreal or Katz.", "author": "Nicky C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-06-26", "description": "I have never thought of Montreal as a particulary foodie city (though recent trips have made me think twice about this).  Still, even if the resto scene is getting better, I can't think of much of an export factor beyond poutine.\n\nBarney B got a slap in the face for that, thanks to Mile End.  Nummy breakfast in a great little setting.\n\nemphasis on little - but worth the wait.", "author": "Barney B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-08-31", "description": "This is place is ridiculously good. The fries are amazing and the sandwiches are delicious. One of my favorite restaurants in Brooklyn.", "author": "PJ A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-31", "description": "I treat myself for lunch here when I have the time.  I always get the smoked meat sandwich.  So good.  The poutine will put you in a food coma at your desk.  They make you pay for your pickles (1st time I ever did that at a Jewish Deli) but they were definitely not your average out of the jar.  It's a tiny place and really tough to get a seat during the rush so come early.  It's pricey but you know you're getting quality!", "author": "Derek S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-01", "description": "I work from home often and since all the buzz on the street and the edible bk writeup, I had to see what it was about.\n\nHad the smoked meat sandwich and I thought that was just the right size for me.  The platter = 2x the meat.  A guy who sat next to me at the counter convinced them to give him a half sandwich.  \n\nWhile I'm not a connoisseur of this food by any means, I have to say that it was delicious, I almost wanted to change up for the platter but maintained.  While I am used to having more in my sandwich, I guess just the mustard and bread and meat is traditional?  But I agree a pickle would be nice.\n\nI'll be back to try the other offerings soon.\n\nNB: I went at around 12:15p on a Monday and this place got very crowded soon after.  I live around here but I'm guessing manhattanites are making the pilgrimage too.", "author": "Sheanon C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-04", "description": "This is my second review on Mile End but this one will be regarding Take Out. I pass by Mile End on my bike every day on my way home from work. So one evening my wife was still at work so I decided to stop and pick up some take out. I ordered the Smoked Meat Sandwich Delux. Sandwich, Coleslaw, Fries and a pickle that I never eat. Pretty expensive for sandwich and fries. $22. But seriously. It's so good. I am hooked and stop by every week to pick one up. Sometimes twice! This is now my go to place in my neighborhood.", "author": "Christopher S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-06-24", "description": "Decided to drop by on a weekend, after reading about the smoked meat sandwich on nymag's 101 sandwich list (no. 11) and a friend telling me how people are saying that Mile End's smoked meat beats Katz's pastrami. I'm a pastrami kinda guy, so I wanted to check the place out more than ever.\n\nAfter a short 20 minute wait that felt like 40 minutes thanks to the blazing sun. We were seated at 1 of 3 bench-like tables. The tables can fit 6 comfortably and 8 if you want to squeeze. Additional seating is available at the counter (6 seats?) and at a smaller mini table that sits 2 only. The place is small and warm, so stay away from this place if you can't stand smaller spaces and lack of AC. \n\nBetween the 3 of us, we ordered: smoked meat platter, poutine with smoked meat, lox on latke, breakfast sandwich and the Ruth Wilensky.\n\nMy breakfast sandwich (from the brunch menu) consist of a fried egg, chazzer/canadian bacon? and Quebec cheddar on rye. My biggest complaint? The rye bread, it was tough and hard. The cheddar was nice, but the sandwich didn't work too well and felt like all the ingredients might as well have been served individually on a plate. \n\nLox on latke with creme fraiche and chives (brunch). Latke was nice and crispy on the edges/exterior. It was good, but I don't think this item plays well to Mile End's strong points. It's just another brunch item.\n\nRuth Wilensky, I didn't get to try this but my friends did. Basically salami on an onion roll. This thin little sandwich was ranked no. 5 on a recent list. My friends weren't impressed and I don't blame them.\n\nPoutine with smoked meats. This thing was big, enough fries for about 2-3 people topped with gravy, cheese and a heaping pile of chopped up smoked meat bits. This was good, the smoked meat worked really well with the gravy and fries. But man, this is like a mini heart attack. Order the poutine regular if you don't want to take part in a glut fest. \n\nSmoked meat platter. The smoked meat was much more brittle in the mouth than Katz's pastrami, it felt apart easily without really chewing. But at a price, I found the smoked meat to be dryer than Katz's pastrami. I realized after eating my first bite of smoked meat with mustard that the rye bread that came with the platter had a purpose. It was pretty salty when eaten straight up. I had already been disappointed by the rye bread, so I opted to eat the meat as it is. It was good, but I don't see where all the \"this is better than Katz pastrami\" notion is coming from.\n\nIn general, this place is definitely worth your time, but IMO if I had a craving for something pastrami-esque I much rather walk to Katz than to travel into Brooklyn for the smoked meat. Try the lemonade!", "author": "Ken S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-10", "description": "Whoa, that is some goooood brisket!! I stopped by with the baby last week, and was not dis-o-pointed.  The pickle is a bit sweet, but you remember it.  The slaw is forgettable.  But the brisket will have me coming back fo mo!!!  My baby likes the fries...", "author": "joseph a."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-10-23", "description": "Noah and his band of roast masters saved the day at Meatopia and I will forever be thankful. His sandwiches are a head above the rest and his service far surpasses anyone else who showed up that day. And the next time I am in Brooklyn I will make sure I call upon his fantastic services again!\n\nThank you!", "author": "Marie D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-04-30", "description": "Writing this review after coming home from a weekend lunch and waking up from a blissful food coma ...\n\nWe were prepared for a wait because the place is intimately sized and was just profiled on TV.\n\nThe food was spectacular and the service was wonderful. My wife and I went with our 2 1/2 year old and had a wonderful lunch. Smoked Meat sandwich on (amazing!) rye with, a side of poutine, corned beef hash and eggs, and double baked challah with almond paste and a fruit compote. The portions were big (see above referenced nap) and felt like a great value.\n\nThe place was also very green - cloth napkins and earth friendly straws.\n\nThanks for a wonderful experience! Glad to hear you're expanding your hours.", "author": "Ken K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-07-30", "description": "Oh sweet Yahweh. \n\nBreakfast sandwich -  phenomenal. i had left one sitting in my backpack for 3 hrs en route to the Rockaways. when i discovered it, it was soggy, kinda cold, and a bit banged up. still the most amazeballz bfast sandwich I had ever had. it's the bacon. it's really all about the bacon.\n\nbrisket sandwich - feeds something primitive in me. so satisfying.\n\niced coffee - strong, good, dark.\n\nservice - cool, curt, cute. not much more you can ask for, is there?", "author": "christine h."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-06-29", "description": "Their poutine is exactly how I like it.  The gravy is mild, cheese cut into squares, and the fries were fresh.\n\nThe bagels aren't anything special (big whoop, they're from Canadia eh), but they'll garnish them with heirloom tomatoes.  Delicious.", "author": "Blake S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-10-19", "description": "\"NO SOUP FOR YOU!!\"\n\nSaying anything good about this place is like saying \"but the trains ran on time\" and appeasing Germany.  \n\nTheir website literally says \"At Mile End Montreal Bagel,\nour mission is to share these delicious bagels with you!\"  Yet they have a funny way of showing it.  Because when we showed up at 12:01pm this week, we were denied smoked meat hash AND bagels.  Now the smoked meat hash is somewhat understandable, if they wanna keep specific hours on when they cook what, but the bagels??  There were bags of bagels piled on the counter in the back clearly in my line of vision when I was denied one.  The waitress apoligized, said she couldn't serve them after 12, and assured me she'd get them out of my way so I don't have to look at them.  That's their version of customer service, not giving you what you want (that they so clearly have), and then going that extra mile to get exactly what you want out of your sight.  It's not her fault, she was just enforcing the police state policy of the place.  She literally said, \"If I gave you one, I'd have to give everyone one...\"\n\nOoops, yeah, sorry...  then you'd be giving your customers what they want and doing a little thing known as \"running a business\".  You mean to tell me these jokers drive/fly this dang bagels in all the way from Montreal almost everyday, then refuse to bring just one from the counter to my table?!?!!?\n\nIn all fairness, it turns out they DO serve the smoke meat hash during the week.  The owner even took the time to write me about it (and kindly strike down my last snarky review line by line).  So this place was temporarily out of the dog house, and we gave it another shot.  As the owner pointed out, smoked meat hash is served 32 hours a day.  Just so happens, not after 12:00pm, to the disappointment of me, my buddy, and the couple that was then seated next to us (who also made the tragic mistake of asking for bagels).  This place is not worth the hype.  Live free or die.", "author": "Jonah L."}], "servesCuisine": "Delis", "priceRange": "$11-30", "name": "Mile End Delicatessen Brooklyn", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "97A Hoyt St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/jL2-f-hVAwkXx5vELTD0RQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188527510"}