{"aggregateRating": {"reviewCount": 747, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-01-28", "description": "Sweet Jesus this place is amazing. Finally, some great deli in the area.  \nThe big portions of meat, the wonderful bread, the smell, and the fries with gravy put me in a very happy place. In fact, I  am in good mood just writing about it.  \n\nThere was a bit of a wait, but that is only because the food is so damn good. Get here early and get here often. You will not be disappointed.  Canadians certainly kick our ass when it comes to health care, and from my experience, they have us beat at smoked meet too. I can't wait to get back.", "author": "marc s."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-09-19", "description": "Mile End rocks! I have been there several times and the smoked meat is always delicious. Just smelling the meat as you near the place is a pleasure all on it's own. Be warned that yes, if you have issues with too much fat, then you should order your smoked meat sandwich \"lean\". It will still be moist and lovely. I personally prefer to order it lean as I feel the fattier version doesn't provide enough meat texture for my taste. I've always sat at the counter during my visits and I think it's the best spot since you get to watch all that lovely meat being carved and the other menu items prepped and served. Please, don't compare this to Katz's. It's not pastrami and this is not a New York/Montreal competition. Appreciate both for what they are and if you end up with a preference, don't berate the other. I like old school NY bagels (rare though they are) and I really love Montreal bagels. My first time having St. Viatur in Montreal was a revelation. Let's face it. Most NY bagels have morphed too far from their roots--too much bread, not enough crunch. I was floored to know I can get my St. Viatur bagel here in Brooklyn now. Love their poutine. I know Montreal takes poutine very seriously and I must admit than when I first had it up there, I didn't quite understand what the big deal was. I think the poutine at Mile End is pretty tasty but I know people in Montreal argue about poutine the way New Yorkers can't stop debating pizza and burgers, so experts may have a more discriminating opinion on Mile End poutine than I can offer. All the wonders of Mile End aside, if you do decide to treat yourself, please be advised that the place is tiny and very popular. Leave your attitude at home and go prepared for a wait, a hiccup in the service, or some other \"inconvenience\". My first time there I ordered to-go before they had their to-go window in operation and in all the lunch time hubbub they forgot to announce that my order was ready. I finally had to ask. Did I stomp off like a freakin' prima donna all pissed off at their audacity to forget me? No. These things happen. The quality and consistency of the food make oversights like this completely bearable. I still swooned over my food and that is what I go there for. Regardless, the staff has always been really nice and I rather like the vibe at Mile End. My hubby says it kinda feels like you're in Montreal in there--a bit more laid back, no NY attitude like many other places.  Mile End is a great and unique addition to the Brooklyn food scene.", "author": "Lynn Q."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2010-10-11", "description": "I too tried Mile End after a Food Network feature. I would put this on the worst thing I ever ate list. I knew it wasn't going to be an experience like Katz's Deli, but I never expected to be so disappointed that I would rather remain hungry than have to taste these flavors again. I had the poutine, smoked steak sandwich, pickles and coffee, none of which were to my liking. The brine they cure the pickles in has a sugary/sour taste, and I could palate no more than one bite. I don't know which was more absurd them charging $1.50 per pickle, or that this was the first deli I have ever been to that didn't give a plate of them for free. The surprisingly small sandwich measured maybe 5\"x2\" and 1\" high had an unusual bitterness along with the smoky taste. While I love smoked meats I couldn't bear to eat more than a few bites of the first half. I was told that the coffee was fresh ground, locally grown french pressed brew. Since when is coffee grown in New York? If the waitress made a mistake its not so important as the fact that it tasted like a muddy/watery version of Israeli coffee. I am a coffee lover who can tolerate most bad coffee's in a pinch, but I would rather not drink coffee than have that. I cannot comment on the poutin as I have nothing to compare it to. Overall, I just don't know how this place got so many wonderful reviews.", "author": "Private Matter B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-11", "description": "Perfection - seriously good eats....and it was priced well, the service was nice, the food was splendid. A must try.", "author": "Farrah T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-04-02", "description": "Oy Vey! - in a good way. The Jew in me was pleasantly surprised by this Montreal delicatessen's transplant to Brooklyn. Who doesn't love a good beef brisket on rye with a smoked fish salad and chopped liver? Add to that the most satisfyingly crunchy, rotund sour pickles you've ever had. Well, I'd say you've been initiated into the Jewish Breakfast Club. Ale sure was, as she had never had the pleasure of indulging in a proper Jew-food fest. Which made me all the more pleased that the fare was authentic, ushering in the nostalgia of the many sable-on-a-bagel breakfasts of my youth. It kept that traditional quality that my ancestors would appreciate, but somehow felt modern and fresh. The saltiness of the chopped liver was beautifully balanced by a sweet onion relish, and the smoked whitefish salad was refreshingly mayo-free, thus light on the palate, allowing that fresh fishiness to shine through. And those layers of smoked beef brisket were done right, sitting simply on a schmear of mustard between good slices of rye. Though I must say, there was a lot of hype surrounding this mysterious Montreal bagel, which was truthfully unremarkable. They got nothin' on a New York bagel! We left with a sweet-treat in tow: a twice-baked chunk of challah with a berry and pistachio compote on the side. The bread itself nestled raisins and slivered almonds to boot! The Saturday brunch in this smallish space was a half-hour wait for two, so expect Sunday to be even longer. I was proud of my people this day. Kinahora for the Canadian.", "author": "Rebecca K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-29", "description": "Was there today during the October snowstorm, and I have to say I'm more impressed with this place each time I go, not just by what they do right but what they do when they do something wrong. The food is incredibly delicious and fun, the staff from the waiters to the white shirts behind the line, have a great vibe, genuinely hospitable and fill the space with allot of positive energy. When there was a mix up with our order today   (item came with salami instead of the lox we ordered) they took care of it immediately with out an issue, sent a little extra food while we waited, and were totally proactive in making sure we enjoyed everything. Which was even a little more amazing to me because it was brunch and the place was packed which would have made it seem easy to brush it off.  Looking forward to returning many more times in the future.", "author": "Sean H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-11-13", "description": "Very good pastrami. Probably right behind Katz. 2 complaints. They charge for pickles!! I know that it takes time to make the pickles, but every other pastrami joint in the universe includes them! Being this stingy will only hurt you in the long run. They are lucky they are in such a yuppie area where people don't mind being nickel \u0026 dimed for everything. The second complaint is it is cash only and they don't include the tax!! Its either one or the other, not both. I would rather them charge $1 more for the sandwich and have it include tax and a pickle spear.", "author": "Mandle F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-27", "description": "So delicious! My only complaint is I can't go here everyday because the food is so rich and wonderful!  Definitely not for the vegetarian, but I do know some vegetarians who make exceptions for this place!", "author": "Lydia A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-04", "description": "What's to complain about in this place?  I had seen a feature about this place on a cooking show and read the reviews and it was better than expected.  The smoked meat sandwich on rye is beyond compare -- so much more flavorful than you would get at a place like 2nd Ave Deli -- and the 14 oz. serves two, or the 7 oz. is perfect for one. A small but adequate beer selection.  Even the borscht was fantastic, and one doesn't necessarily expect much of borscht.  All for very reasonable prices.  This is a place I will go back to.", "author": "Jared K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-02-24", "description": "After driving around for 30 minutes to find a parking spot- I was hoping the food would be worth it, but it wasn't. 10 minutes past 12 and we were told we couldn't order breakfast- not a problem, but they only had 4 items for lunch. So we ordered and were not happy at all- and to make matters worse the people making our food didn't even wear gloves while prepping our sandwiches-completely unsanitary and unprofessional.", "author": "Sunnie A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-30", "description": "Incredible smoked meat sandwich and burger. Really just delicious.", "author": "David S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-10-17", "description": "the quality of the brisket in the smoked meat sandwich was outstanding, but it could have used a little more salt and more mustard... the curds, gravy and the potatoes in the poutine were outstanding as well, but once again, the dish could have used a little more salt. definitely want to try some of their other dishes", "author": "Ken L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-02-16", "description": "SALTY!!!!! Everything was so so salty! The matzo ball soup was made with salt water! The brisket was SO ridiculously fatty!! I couldn't even eat it! The oxtail kreplach was still cold in the center! The poutine is decent except the fact that the fries and gravy were very salty! The chopped liver was actually good, with buttered toast. The hanger steak was extremely red and some pieces were raw! The prices are ridiculously pricey considering the size and portions were incredibly small. Really, 21$ for a tiny sandwich that I can pay 5$ for a sandwich at a corner deli!! Please do not waste your money and time with this place. Waste Of money and my blood pressure is going sky rocket! Save your money and go somewhere that the food is actually good and not going to cause your health to be in jeopardy. I don't understand why the chefs do not taste what they are serving!! Terrible! For those prices, who do they think they are Peter lugar or David Burke ????", "author": "Jane W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-19", "description": "If you thought you couldn't have Shcwartz's this side of the border, Mile End will think twice.  Amazing hash, and MMMMMM smoked meat!  Delicious!  I wish the bagels weren't $20 a dozen because I miss them like crazy, but I understand, they're expensive to ship.  WORTH IT!", "author": "Sara M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-02-11", "description": "Worth. The. Wait!  \nWent for brunch with 2 friends, and yes, we had to wait 20 minutes or so, but show me anywhere worth brunching in this city where that isn't the case at noon on Saturday!  \nI love the communal tables, the atmosphere is fun and energetic, service was prompt and friendly, coffee was AMAZING, food arrived as it was ready, in quick succession: egg sandwich, smoked meat hash, The beauty bagel with lox and an order of poutine for a well rounded and authentic Montreal dining experience.  \nAll were truly excellent!  Eggs were cooked perfectly, same with the potatoes in the hash, and the bagel...oh the bagel!  I can't believe they can bring them down from Montreal and still have them taste SO fresh!  It was truly a beauty topped with a schemer, delectable lox, cured capers, red onion and perfectly ripe and flavorful yellow tomatoes...in February!  Poutine?  Amazing!  It's all about the gravy and they have that down, it was flavorful, rich and delicious.  \nI love this place!  Having spent a bit of time in Montreal, I can attest to its authenticity.  But mostly I am blown away by the fact that this little deli, non-stop busy from day one, is turning out consistently well prepared, delicious, attractive food.  \nI can't speak to the complaints others had, I thought the prices were pretty reasonable considering the quality; I do look forward to the return of dinner service, but for the time being, I think they have a great thing going that will only get better as they hit their stride--and I can't wait for that!", "author": "Leslie W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-10-29", "description": "We had seen this place in Time Out NY several times.  When we arrived there was a HUGE crowd out front.  The wait for a table was about 40 minutes.  Once we got in we sat at the counter and were able to watch the food being prepared.  I ordered the smoked meat sandwich, my husband got the salami sandwich and we shared an order of poutine(our first ever).  I am not into fatty pieces of meat so the smoked meat was not my thing.  It was a little too marbled for my taste.  The salami sandwich was very good and a better option for those not into the smoked meat.  The poutine was pretty great! Frites, gravy, and cheese curds...yum!", "author": "Sophia S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-21", "description": "made the trip on one of the year's first beautiful sunday's at around 1pm. was surprised our wait was only 10-15 min for two, at a shared table. we got smoked meat sandwich and mishmash. the smoked brisket meat is amazing. tastes like pastrami but thick sliced, super tender and moist.  probably better just to get the platter (vs the sammy) if you wanna enjoy the meat. mishmash was fine, on an warm onion roll which was really tasty. we were scared to try the poutine, fries with cheese in a pool of gravy and it's not a side dish so might try with a larger group in the future.  takeout is pretty buzzing too.", "author": "C L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-06-04", "description": "have had the breakfast......tasty...\n\nand today had the salami sandwich (rated  #5 sandwich in NY)....\n\nsorry, thats a bit of a scam.... it does taste good, but its absurdly small with not exactly alot of...SALAMI!!  7$...you have to give people more.\n\ngreat pressed onion roll..... soaks up the mustard well... but wouldnt say its a \"must have\" by any means....\n\nthe smoked meat is the way to go....more bang for your buck", "author": "seth e."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-02-20", "description": "As a native Montrealer I was less than impressed with this so-called Montreal breakfast spot. The poutine was terrible, anyone that has had a poutine knows to ease up on the cheese kurds and be generous with the RICH gravy. ( the gravy was disgusting and thin) I can't even describe how bad the smokemeat was, it was embarrassing to take my New York wife to a Montreal breakfast and feed her cold smokemeat. The service was terrible, the cash person was annoying and really rude, and the only likeable person was the chef, who tried and had a good staff, but maybe these guys should intern at Schwartz's and Beauty's, before opening a spot in brooklyn ande making people wait 1-2 hours for what amounted to a complete waste of my time. The prices were reasonable but I rather pay a little more to have it done right. The bagels were authentic but not really any choices as to which kind of bagel an individual would want. I drove from Long Island to Boerum Hill only to have enjoyed the beauty of the neighborhood instead of the Mile End deli. Would it be that hard to hire a wait staff that actually knows what they are doing? Service is everything and especially Montreal breakfast service!!!!!!!! How could they get that wrong??????", "author": "Bryan B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-07", "description": "As a native Montrealer, raised on smoked meat, bagels, and poutine (and other things), I was very excited about the opening of Mile End. It did not disappoint. The smoked meat was tasty and had the right cut and consistency. The cherry soda (while not Colt's) was a perfect addition and the mustard was just right. The place is small but very tastefully decorated. The staff were wonderful and accommodating (many McGill grads, which was a definite plus). The only reason I did not give it a full 5 stars is that they were out of St-Viateur bagels when I got there and they did not yet have any pickles. I think once they get a bit better organized, this place will be great. Will definitely be coming back.", "author": "Simon C."}], "servesCuisine": "Delis", "priceRange": "$11-30", "name": "Mile End Delicatessen Brooklyn", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "97A Hoyt St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/jL2-f-hVAwkXx5vELTD0RQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188527510"}