{"aggregateRating": {"reviewCount": 747, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-25", "description": "Ive never been to Montreal. Ive never been to Canada- but now, I have every inclination to go!\nWe had a wholly satisfying adventure with what I would normally consider side items:\nThe Crispy Artichoke Hearts with garlic lemon and heaven were excellent, liver pate with pumpernickel bread paired well with the finale of the smoked meat Poutine. Rich in taste and full in the belly. (The 90's music selection was a plus for me too..) )", "author": "Val T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-29", "description": "Another Visit's Quick Notes:\n\nLittle less salt on the Poutine please, smoked meat was just enough.\n\nFried Brussels with walnuts and apples (tossed in honey, balsamic, and juice) were a yummy treat.\n\nHad to ask for water near the end of the meal, but already ordered a Labatt while waiting.", "author": "Will C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-01", "description": "The smoked meat hash is incredible, and the latte is the best one I've had in Boerum Hill (not exaggerating)", "author": "Dick V."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-01-20", "description": "Never had poutine before, and if what was sent by Mile End is supposed to be the real thing, I will not order it again.  The matzo ball soup was tasteless but with an added chicken boullion cube it became edible.", "author": "Lydia G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-02-12", "description": "Love the people and love the place so I really wish I could right a better review.\n\nUnfortunately the last time I went here the smoked meat just wasn't up to par. Everything was overly salty, just not what this place used to be.\n\nBummer...", "author": "Riot D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-12-08", "description": "What's not to like?!  The smoked meat was superb (and really smoky).  I enjoyed the local dark draft beer and had quite a bit of the poutine that we ordered for the table.  The poutine was much less disgusting than I imagined; frankly, I thought it was tasty and relatively light.\n\nI maintain that our lunch was healthful, though a member of our team described it as \"decadent.\"  Let's just say that this is the place to go if you're willing to have a decadent lunch.", "author": "Kenneth R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-02", "description": "This place is jewish meat heaven. I used to live near by and would revel in their smoked meat creations on a regular basis. It's been years since I've been here now but it's as delicious and just plain old pleasant as I recall. Grateful dead lingering over the speakers and super friendly water. Open a restaurant in Chicago, Mile End! Pretty please??", "author": "Alissa G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-06", "description": "Excellent food.  The chicken soup is particularly good.  So are lots of other things.    It is a tiny place for its level of fame, seats 25 tops, often sharing tables.  If I was gonna be super picky, food can be very salty, there's really nothing for veggies, and sometimes the fries in the poutine are not hot.", "author": "Adam G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-05", "description": "Mile End Delicatessen certainly hit the ground running when it came to Brooklyn. It generated the right amount of hype before opening and then got mostly good press. Ever since, it has been a popular place and people wait for the four small tables and counter space for hours sometimes. My expectations were probably around medium, but I was very satisfied on my visits.\n\nIn cold weather, the places is cozy and has some nice hot beverages to choose from. Stumptown Coffee is $2 and mulled apple cider is $3. The environment is very crowded, but somehow the place does not feel stuffy, the tables are large and there is plenty of legroom. No one rushes you when you finish.\n\nThey get their bagels from Montréal, and apparently this is a big thing, but to be honest I never heard anyone talk about bagels in that city despite many trips. There must be a niche. The bagels are good, but I guess I still prefer my puffy and sweet New York style. Add the smoked whitefish salad ($9) to one though, and it does not matter if the bagel came from the freezer section. This salad is amazing, the fish combined with celery, chives, and asparagus, minus the mayonaise.\n\nBe sure to get a pickle ($1.50) to the table as well!\n\nThe smoked meat is one of the big reasons to come here, so on the breakfast side of the menu, be sure to try the smoked meat hash ($10) during weekends. The delectable pulled pieces of meat are layered on top of very well-cooked potato cubes and then covered with eggs, a dish that could compete for my heart with regular corned beef hash.\n\nAlso using the smoked meat as a centerpiece and more of a Québécois specialty is the poutine ($11 with meat), the best rendition of the dish I have had here in New York. For me the most important part is the cheese curds, and these are excellent. Combined with a generous helping of fries and delicious gravy, this will always be a favorite.\n\nAs any deli should, Mile End also has some sandwiches named after people. The Ruth Wilensky ($7) is tasty enough, but actually is better on paper. The toasted onion roll is very good, but its contents have a hard time standing next to the other dishes. This would be a good quick takeout lunch though maybe.\n\nBaked desserts probably vary each day, but on one visit we tried the twice baked challah ($4) which we had termed \"junk on toast\" before we knew what it was. It came with loganberries or something similar, which combined with the almond topping to really melt in your mouth. While you might not feel like you are in Montréal, apart from the waitress's Canadiens jersey, Mile End is a successful place and keeps its food at a very good price point. It is no wonder that people will wait for a seat.", "author": "Jared C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-11-26", "description": "Giving Canadians a bad name...\n\nI have frequented this deli many times since they opened - out of necessity, not choice.  As a Montreal transplant I often miss some of the comforts of home; poutine, smoked meat, and the occasional Wilensky sandwich.  While I immediately decided there were things I did not like about this deli, I continued to return because, well, there are no other options.  Previous notable complaints: price vs serving size (they skimp on everything!), the Wilensky costs 50% more than it should, and most important I loathe the \"hipster\" feel they have - I've only ever done take out for that reason.\n\nMy most recent gripe with them has confirmed that I will never give them anymore (of my husbands) hard-earned money.  Last night while scrolling my twitter feed I found this tweet:\n\n@Mileenddeli: I love people who complain about sandwiches being $1 or $2 more since the storm.  Um, ya, how the fuck else am I going to rebuild a bakery!?\n\nI was instantly enraged that I have given this tool money.  Is this really the attitude he wants to throw out there to returning and (more important) potential customers?  Does this jerkoff think he was the only person affected by the hurricane?  The crucial thing here is this loser has no PR or customer service skills whatsoever, he's clearly a moron and embarrasses the hell out of me as a Montreal native.\n\nOh, and the food really doesn't compare to Montreal faves like Schwartz's, La Belle Province, and Wilensky's - It was simply the next best thing, because it was the only thing available within a reasonable distance.", "author": "Lisa T."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-01-04", "description": "What a disappointment! I've been meaning to go to Mile End for ages for the matzo ball soup. Since the weather is finally starting to feel like winter \u0026 perfect for soup, I popped in today. I had high hopes for this soup, but it just didn't deliver. The matzo ball had a funny taste and was not as light and fluffy as Katz's, the broth desperately needed some salt, and there were 2 measly pieces of chicken. It's also way overpriced. For the size bowl they serve, it should be around $7 or $8 max. Next time I'll go to Katz's for a proper bowl of matzo ball soup.", "author": "Cuocofelice C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-08", "description": "Best Montreal style bagels in Brooklyn!!? Overpriced but a worthwhile indulgence", "author": "N T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-22", "description": "The smoked meat sandwich and the chopped liver are two menu items not to be missed.\n\nGood vibe, shared tables.", "author": "Evan B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-02-15", "description": "Meh. \n\nThe most expensive breakfast sandwich I've ever had and it was just meh. \n\nHash? Meh. \n\nService was great. Cook was nice.", "author": "Roberto C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-11-25", "description": "I cannot believe I'm writing this. I loved Mile End from the moment they opened and was appalled by the recent customer experience I received. I ordered takeout and got a bagel beauty sandwich. When I tore open the bag, the bagel was a doughy, untoasted mess. They still charged me $13 for it and when I contacted them to complain that it hardly seemed fair or like them at all, that it seemed like robbery, they told me I should go elsewhere. That a dollar from the price goes to fixing their bakery. \n\nWell, I don't know about you, but it seems unfair to force your customer to donate instead of asking when they call in for takeout or maybe there should be a jar on each table. Dude, the sandwich is already $12 and its not even on a toasted bagel. \n\nI'm really sad that they were so gruff with me. What does it cost them to tell me that the prices are the prices for a reason without telling me to go somewhere else. I hate this kind of arrogance.", "author": "Sarah S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-06-27", "description": "I went to this restaurant with my brother as a part of our US road trip...where we basically ate our way down the east coast. I can honestly say, this is the best brisket I have ever had. It is not your typical Jewish deli brisket....no, it is much, much better. It has a smoke flavor to it that far surpasses most bbq places wildest dreams. \n\nNothing else is important. You want an amazing brisket sandwich? Go here.", "author": "Brian L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-13", "description": "Yes, I AM a fan!\n\nI went here over this past weekend for my birthday, because I wanted to try their Poutine. I'm glad I made the play to swing by. I got 2 things: Their breakfast sandwich and the Poutine with the smoked meat. Here's the breakdown...\n\nBreakfast sandwich is LEGIT, it's eggs, cheddar cheese and a special sort of canadian bacon that is very tasty and quite salty, but not REALLY salty, that good amount. It's small, but unassuming, because it packs quite a wallop, in terms of flavor.\n\nThe Poutine was next, and I got the one with the smoked meat, which was $11. Honestly I think this is good enough for two people to share, which is saying alot for me because I usually hate sharing anything because I always want to eat so much food. But after that sandwich it was about impossible to finish this thing. Fries, cheese curds, DELICIOUS smoked meat and gravy. Oh god, my mouth is watering just thinking about eating it!\n\nNow the only reason I didn't give it 5 stars is because it's too small. There was a 45 minute wait by the time we decided to get something to eat from here, so we got food to go, which was nice. If there was space for everyone, it would be 5 stars, where it stands now, its 4 to 4.5. But my God, is that Poutine and that breakfast sandwich good!!!!", "author": "Clint H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-28", "description": "Sometimes I think the world needs and Oligarch. My first rule would to take Yelp away from idiots.\nLet me just say that this place warrants 5 stars, and I am a bloody vegetarian! \n\nFirstly, if you go here, do not order the eggs, because, whilst they may be divine, you can cook them yourself, but if you had any semblance of common sense, you go to the \"End\" not for eggs, but a specialty. Like their two extraordinary salads, particularly their butternut squash salad- HEAVEN DIVINE- OR their meats, or the fish.\nEverything I ate was exceptional (I was even a bad vegetarian and tasted some cod- I allow myself a taste of fish annually)\n\nMy boyfriend initially took this place, because he was impressed with the menu. He ordered the burger, and could not believe how unreal it was. This he says ranks in the top 3 of burgers ever! \n\nSuppose He knows good food when he sees it, and this gem was no exception..\n\nIs it pricey, yes!\nIs it worth it? YES!\nThe marriage of flavours, you will not find repeated elsewhere, believe me we cook and eat almost every chance we get! We were impressed with the flavour palate, and seldom are we! \n\nI say try this place, and as usual order something special off the menu, otherwise go to a diner, and be content with a $10.00+ sub par omelette and fries.\n\nOh and to you Hockey Fans, if you enjoy the sport (and aren't caught up in one team), go to the bathroom, I was overjoyed!", "author": "Queen R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-15", "description": "Everything here is $1-2 overpriced but very good. The smoked meat burger, the latkes, and the poutine are all must tries. Really great brunch here too. They do the little things well - dark rye, sesame bun, and bagel are all perfect. The slaw and pickles are really good too. They have some really small format fancy beer but it's extremely expensive.", "author": "Ben W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-06", "description": "WHOA. Let's take a step back... what just happened?! After a large plea, I convinced some of my colleagues at Metrotech to not just run to Shake Shack for a Friday lunch but rather to venture to a new spot, Mile End. And while they were hesitant at first, complaining about the 10min walk and having to cross Atlantic Ave (omg, please) we finally made it and were able to get seated right away. \n\nI had the smoked meat poutine, while my two friends had the roast beef sandwich and the smoked meat burger with an egg. Addressing my friends' foods first, the smoked meat burger was downed in literally less than 5 minutes... not sure what my friends doctor would say, but wow, my friend didn't seem to care at all. The roast beef sandwich, though a bit slower to be devoured, was equally enjoyed.\n\nNow to the smoked meat poutine... let me repeat: WHOA. So many flavors and beyond filling. SPOILER ALERT: it starts with a bed of french fries, coupled with cheese curds, covered with gravy, and topped with smoked meat. Please don't be foolish like me -- Unless you're a world-class eater, stick with the small ($12)... I ordered the large ($16) and couldn't move for the remainder of the day (thank goodness for rolling chairs!)\n\nAll in all, this is a great place for a more relaxed lunch. Prices are from $8-$14 for most dishes and well worth it. If you're in the surrounding area and can spare an hour and fifteen minutes (including waking) for lunch, do yourself a favor and run in and enjoy!\n\nAlternatively for lunch, if you don't want the table service, you can order at the door and take it back wherever your heart desires!", "author": "Sam A."}], "servesCuisine": "Delis", "priceRange": "$11-30", "name": "Mile End Delicatessen Brooklyn", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "97A Hoyt St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/jL2-f-hVAwkXx5vELTD0RQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188527510"}