{"aggregateRating": {"reviewCount": 747, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-05-31", "description": "I was craving a good old Montreal Poutine,\nWhat a disappointment !!! For such a high price the large should be à Montréal large, not a yuppied-out new Brooklyn portion. \nThe fries are fries they're ok.... the cheese curds were all stuck together (which made me think they are not real cheese curds, or maybe a cheap version)  the gravy on the side was thick and pasty like the industrial Heinz gravy you buy from the. Ideas or family dollar. \nNever again !\n\nUpdate: I took a small Poutine to go for my wife for her to have for dinner when she came back home, she told me she couldn't even eat it, it was gross (and she's a real Poutine lover)", "author": "Ludovic A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-07-20", "description": "I ordered the smoked meat sandwich after all the hoo la... every one seemed to suggest it was to better than pastrami. but am guessing they have not tried the katz pastrami sandwich, which was definitely more moist and tasted better than Mile end.\n\nSo not sure why so much hype around Mile end.. maybe u can check it out if u happen to be in the neighborhood. But if u want to travel for a good smoked meat or cured pastrami, u might as well go to Katz.. though it's few bucks more than Mile end.", "author": "Deovrat B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-04-11", "description": "Not sure what the fuss is all about. Overpriced, and the smoked meat sandwich is pretty blah to me. I actually thought the meat's flavors were way too strong, and the mustard had me thankful that I had a whole pitcher of water to myself.  \n\nFor $14, I'd rather go to Katz's, pay $19 for double the portion any day.", "author": "Elizabeth L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-01-14", "description": "I hauled my butt all the way from the Upper West side to Brooklyn in order to go to Mile End and try their poutine, since it apparently got great reviews on Yelp.\n\nSince it was the first time my friend and I had gone to Mile End, we didn't know what to expect. The establishment itself was smaller than we thought it would be and the atmosphere was very romantic yet hipster. Scratch that. It was very hipster with mood lighting. When we entered, we weren't shown to a table, and for a couple of seconds, my friend and I had stood around awkwardly until a nice bearded hipster on his Macbook Air told us that we could sit anywhere that we wanted. I'm not even sure that he worked there.\n\nSitting down at a picnic table was kind of nice. The menu came after I had glanced over the drink menu (I was unimpressed with their alcohol choices), and the menu didn't seem to have much on it. Their \"famous\" poutine was listed all the way at the bottom, which made it hard to find. But anyway, I decided on the duck sandwich and my friend got the poutine with roasted meat.\n\nThe poutine was pretty good, I'd say - but I wouldn't know, because I've never had real poutine. But then again, you can't really go wrong with cheese curds, gravy, and french fries. When my sandwich came out, I was a bit disappointed at how small it was. Since I was really hungry and I wanted to try this delicious food, I just dug right in. The \"duck\" was really salty - it was only after my friend and I had left that we realized they messed up my order and gave me the roasted meat sandwich, which was really salty.\n\nOverall, while the poutine was good and the sandwich was okay (even though that's not what I ordered), my experience wasn't too bad. I probably wouldn't venture out all the way to Brooklyn just to eat at Mile End ... in fact, now that I've tried it, I don't think I'll be going back there.\n\nThe food was way more expensive than it should have been, in my opinion, given the portion sizes. Oh, and I'm pretty sure that our hipster waiter was high - he also smelled like a hobo. But hey, its all about the experiences, right?", "author": "Pam K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-04-21", "description": "4 star sandwich but overall 3.5 stars bc of the fries. \n\nSmoked brisket sandwich: delicious and moist. Not cheap at $14, but filling. \n\nFries are just ok.", "author": "Giacomo C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-30", "description": "Tried some new items today with mom and steph.  Their first time here my second. Last time had the lamb merguez sausage which was flavor packed and delicious. This time we split the potato latkes with sour cream and smoked salmon, Reuben sandwich, and half sour pickle. The latke dish was fulfilling and the smoked salmon was a nice touch.  The Reuben with kraut and Russian dressing had a good taste to it though some of the meat was a little too fatty for my mom.  The matza ball soup was good according to steph but the broth was a little too salty. The service was great and we were lucky to get seated quickly.  I think the lines can build up since there are only four tables for four, one table for two and five seats at the counter. All in all it was a nice meal with my girls.", "author": "Mark N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-02", "description": "I love this little place. We've been going here for a while on mornings and weeknights when it's less busy. Food is always delish! The smoked meats, poutine, and bagels from black seed are reminiscent of the streets of mile end in Montreal. They're a small place so if you have a baby, you have to hold them and keep their hands busy with bagels (which they given us freely) and hold them cause they don't have spaces for high chairs but we still made it work.", "author": "Ruth N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-04", "description": "I snagged a quick Saturday brunch over the weekend since my two girl friends and I were already in the neighborhood.  I'd been eyeing this place for quite some time since its name is splashed all over the foodie blogs that I read.\n\nFOOD: I ordered the Smoked Meat Deluxe (smoked meat sammich, pickle, slaw \u0026 frites). If you place this order, I recommend you split it with another because it is a large sammich. Or eat it all yourself, fatty.\n\nI also ordered a side of poutine frites with smoked meat on top.  The fries were surprisingly delish!  Thin cut and crispy.  However, the combination of the cheese and meat overpowered the fries a bit.  The amount of fries was not proportional to the amount of toppings, but this is a personal preference of mine.\n\nSERVICE: really, really friendly waitstaff who are on point with the estimated wait time.  They checked on our meal a couple of times and never rushed us to leave, even though it's a small space, thus requiring a fast turnover.\n\nLAYOUT: open kitchen, which I LOVE because I get to watch the chefs in action. Wood paneling, industrial lighting.\n\nWhat's not to love about this place? It's pretty amatzoballs.", "author": "Teresa L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-12", "description": "+++\n- Excellent place for lunch, pretty empty around 12:15. It was filled up, though, by the time we left a little after 1\n\n++\n- Smoked meat sandwich was tender and not too large, filling but not engorging like Katz or Second Avenue Deli\n\n+\n- Poutine was good\n- Fried mackeral sandwich, enjoyed by the wife\n-\n- Smoked meat; not really fond of the title (Is it pastrami? Is it beef? Is it is pork? Is it 'mystery?'", "author": "renje g."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-04-13", "description": "Today's burger was awful. A salty disaster. The problem is back here. No consistency in smoked meat production. When they get it right the smoked meat burger is the best. But I can't keep coming back and trying my luck here.", "author": "Hungry K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-22", "description": "Tuesday's decadence \nOf a smoked burger, poutine \nAnd drink- mind blowing!", "author": "ReviewHaiku F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-20", "description": "OMG where have you been all my life? The egg salad is the best - I need my poppy seed bagel with tomato and egg salad. This place is soooo good! Had bacon with scrambled eggs, tried the latkes, amazing! My new breakfast place. And my new lunch place. Ok and I have to try dinner. Cute relaxed space. Very nice and friendly Team.", "author": "David M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-19", "description": "We walked in and were warmly greeted. The order for a smoked meat, fries, Cole slaw and the perfect pickle. The meat perfectly spiced and tender served on Orwasher rye. The fries tasty, salted just right and not a bit of grease. The Cole slaw shredded on the fine side with just a touch of vinegar.  My wife's fried chicken samdwich on potato bun with lettuce and asian spices could not have been better. A German heffenwieser cold and delicious and a Dr. Brown cream soda all had to be walked off. The chef Tony and the two waitresses could not be nicer.", "author": "Frank G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-14", "description": "So I wasn't expecting much when I read about this place on the NYT top restaurant list. Really?!? A deli? I was picturing a hole in the wall place with a butcher in the back and sausages hanging from the ceiling. Well don't be fooled - it's more of a small chic little restaurant that does cool things with poutin (even after I had a poutin overload in Montreal a month before) and other meat sandwiches. We had duck confit poutin (never found anything like that in Montreal - delicious!) and I had one of the tastiest Reubens I've had in a long time. Silly of us not to notice the big bottles of beer on the wall or the shelves filled with wine bottles - yes the deli does serve alcohol, which should've been painfully obvious to me if I hadn't been so ravenous that I didn't notice the mini alcohol menu in the center of our communal table. Lovely staff. The term Montreal deli seemed mysterious to me - well, whatever visuals it may conjure in one's head - this place is a fine representation of what one of those would be!", "author": "Jaime S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-11", "description": "Great lunch option. \n\n Their smoked meat is way juicier and tender than Katz's, just as good as Schwartz in Montreal. \n\nAlso enjoyed their special Fried Mackerel on a bialy with aïoli and red onions. \n\nWarm service. Reasonable prices.\nVery small space, so it's better to come early for lunch.", "author": "Annie T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-30", "description": "Awesome classy diner/delicatessen on Hoyt Street...true Brooklyn magic. \n\nThe Fried Artichokes are amazing...do not miss them. And I really enjoyed the Smoked Meat Burger, as well. My friend and I sat at the counter late on a Sunday evening, and though it wasn't too crowded in the small restaurant, there were a few other patrons at the tables along the side wall. \n\nI will definitely be back! This is a great place for a low key dinner date or lunch with friends.", "author": "Krista J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-19", "description": "My favorite Jewish deli. Period.\n\nNothing is bad. The smoked meat, done in the Montreal style, is absolutely amazing. \n\nThe staff is always very friendly and the food comes out hot and quick.\n\nThis gem is quickly becoming an icon. A must visit for everyone in the NYC area.", "author": "Travis M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-02", "description": "Eating poutine for breakfast at Mile End kind of made my day. Sifting through the comments here, it seems there is some contention as to whether it's \"authentic\" Montreal style, but long story short, I was really happy with what I ate. The fries were delicious and crispy, the gravy savory and kind of understated, the cheese curds satisfyingly salty, and the fried egg absolutely perfect. The icing on the cake was the house cured bacon. Mmmm. A special they had going also looked excellent and I nearly chose that over the poutine- it was turkey with eggs and biscuits.\n\nThe coffee was also really wonderful and high quality. I don't know what they brew there, but it was great. Roasted perfectly- you could tell.\n\nOne thing I wished was different was the seating. The place is TINY. We did come at peak brunch hour, and were incredibly lucky to get a table with only a 5 minute wait- we were seated right in the window at this little 2 person table, and it was totally charming and sunny with the window. But I honestly felt pretty squashed in there. It's winter so we all have bulky clothes on, and I could barely cut my bacon because my left elbow kept hitting the brick wall right behind me. So claustrophobic! \n\nBut delicious.", "author": "Emmy M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-10", "description": "Been here quite a few times and always had the brisket... Today I had the chicken sandwich, yes it was $15 BUT it was the best damn chicken sandwich ever!! There I said it, ever!! Delicious!!", "author": "Danny S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-03", "description": "Tuesday $19 burger, beer, Poutine special is a great deal. Though I regretted the calories the next day", "author": "Laila D."}], "servesCuisine": "Delis", "priceRange": "$11-30", "name": "Mile End Delicatessen Brooklyn", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "97A Hoyt St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/jL2-f-hVAwkXx5vELTD0RQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188527510"}