{"aggregateRating": {"reviewCount": 747, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-31", "description": "I had a darn good time at the Mile End Deli. We came for the poutine which was so good we got SECONDS. I also had the falafel burger which was so flavorful and perfectly spicy that I can't wait to make the trek back for more. I didn't even want to let anyone taste it. Service was great. Beer was cold. I love this place.", "author": "Caitlin M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-05-28", "description": "This place is ok, nothing special in my opinion.\nIf the prices would have been more reasonable I would of gave 4* instead of 3*\nI ordered a Reuben sandwich, it was good but I don't think it's worth $14, it came with no sides!", "author": "Jonathan R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-30", "description": "On a Wednesday night, there seemed like there was one guy manning the whole place. And he did it well.\n\nThe small regular poutine was good though I found the ingredients weren't melding with each other. The fry, cheese curd and gravy felt like different entities. The fried artichokes were great. I wish there was more of it... I enjoyed the low key, chill, cool vibe this place exuded.", "author": "Pam H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-29", "description": "Had the smoked brisket sandwich just now and it was pretty dang good!  I'm not a picky eater when I'm not trying to eat healthy, so I can see how some people won't like this place; however, the brisket was tender and moist enough; the rye bread actually tasted like real rye; the mustard was evenly spread and not too strong.  Blend all of these flavors together and it made my mouth water for more. \n\nI only went through the take out line, but the place looked trendy inside.  Definitely cool for a relaxed weekend lunch. \n\nPortions are relatively small, but the flavor outweighed that and the price.\n\nFor those of you who would like better value, this is probably not your place.  Sometimes you pay for trendy hole in the wall places -- i don't think many reviewers appreciate this. \n\nThere was a little bit of a wait in the take out line, but who cares?  The area looks nice, so enjoy hanging outside while you wait for your food in the nice weather!", "author": "Walter K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-04", "description": "Smoke meat burger is 5 stars!!!! Amazing!!! Poutine was amazing also.....I recommend highly", "author": "Leafar S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-12", "description": "They say that it is a \"Montreal Style\" deli. While it is not quite that (I mean does Montreal have good New York pizza?)it still is good and I would have given them a 5 had it not taken longer than expected for the waitress to come and ask for our order. In all fairness to her, she was the only waitress and was serving all the tables as well as handling some take out orders. Also after we placed the order, it was at our table rather quickly.", "author": "Mike K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-01-14", "description": "I wanted to really love this place. The main component of the 2 dishes I've tried contained smoked meat and it was soooooooo salty that I couldn't even enjoy my meal. I decided to add this on to my order of poutine, which was really good by itself but ruined by the addition of the meat.\nThe service was good but I don't think I'll be traveling out to Brooklyn for the food again.", "author": "Rita C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-10-02", "description": "Frites and beer have never been something sexy to me. Seeing these two words on the menu will trigger somewhere in my brain to have a image of people with acnes and big bellies. But at Mile End, I feel like I can sit down, talking with friends, eating frites while having beers forever. \n\nThe frites here smell so good, like a hot chocolate in the winter. WIth smashed potato sauce on the bottom and melting hot cheese on the top, these frites will win your heart with all the senses. \n\nSmoked meat sandwiches and bagels are good for a try too! There are not many places in town for a taste of Montreal Jewish food. \n\nHowever, the chicken soup at this place is something I will never recommend. The soup is a coffee cup sized. There are one piece of chicken, two sticks of carrot and celery in it. That's it. The carrot and celery taste like they are still frozen. It's a pity.", "author": "Cecille C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-31", "description": "poutine!\noh yes. and the beauty. i talked about it for days after. i love me some lox and cream cheese and this is the best in town. \nstumptown coffee. \nsmoked meat. \nthis place is perfect.", "author": "Maia D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-11-09", "description": "Unfortunately, the images shown no longer depict the food at mile end. The service is friendly, but pricey for what you get on a small plate. \n\nGo to Katz\n\nSoggy poutine chips ....and what ? No Montreal bagel? Kidding me", "author": "Bcritic P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-02-04", "description": "Step right up and have the $20 French Fry special masquerading as poutine. Having had this dish in Montreal I had high expectations for this place but was sadly disappointed. There was little if any smoked meat on the dish and enough fries to choke a horse. All for $20. Don't know what the attraction is here but I know it was overpriced for what I received !", "author": "Steve M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-06-23", "description": "A tiny bare-bones storefront with pickles in the window, Mile End serves good smoked meat but that's about it. \n\nThe pickle was soft, unevenly spiced and not very appealing. The red coleslaw was over-vinegared without much nuance beyond that one-note hit. Fries were run-of-the-mill decent greasy fries. \n\nThe smoked meat itself, though, is good. Very lean and features an interesting light smoke flavor. Pastrami is either deliciously soft and fatty or rubbery and chewy. Smoked meat was neither----it was flaky and medium-soft and very salty. \n\nI must have got the D team because service was awful. There were two servers, two guys behind the counter, only one table with customers, and no one seemed to know what to do except look at each other nervously. I asked for extra mustard and received one small mustard. The food sat on the table for a while as the server stared out the window before the counter guy packed it up for my to-go order. It's also quite expensive here. A small sandwich, pickle, and fries will hit you for $19 with tax.\n\nVery secondary to Katz's or 2nd Avenue Deli, but a notch better than Stage or Carnegie. Worth a visit. My advice is get a plain sandwich for $12 and move on.", "author": "J B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-17", "description": "I was vegetarian for about 2 years and decided to get back into the meat game. Heard about Miles End and their smoked meat poutine and just had to give it a try.  It was undoubtedly delicious but is it really worth $14? Eh!\n\nApart from that, I had The Ruth Wilensky Salami Sandwich. It was pretty enjoyable but again a bit overpriced for what its worth and I don't think I'll ever be a regular here, spending $26+ on lunch just doesn't fit my daily budget.", "author": "Gregory C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-14", "description": "Absolutely killer. Had the brisket sandwich, matzo ball soup, and a garlic knish, and I will be having this again again again and again.", "author": "John W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-09-18", "description": "Tried the smoked meat sandwich. Tasted like dry pastrami. Had tried the Katz pastrami a few days earlier. It was so much better, moist, fresh tasting and twice the meat for only couple bucks more. The real kicker is being charged $3 for a canned coke. Don't know what all the hype is about this place.", "author": "Guy P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-02-22", "description": "So I'll have to say that I'm not usually into diners.  Since this is what they are billing themselves as.  Well maybe not so much a diner but a deli.  So so so so far from a deli.  Its a truely wonderful neighborhood gem.  Really what restaurants SHOULD be.  Small, friendly and the quality is very well controlled with a small menu that isn't overwhelming, but at the same time I WANT to order EVERYTHING.  \n\nI had:\n\n the pickle plate.  it was good but could have passed\ntongue was to dye for!  yum yum\nliver out of this world...didn't care for the pletzel...\nmaspucha soup...done with such care that it was like momma made it\nbrisket 7oz--perfectly smoked and schmeared with mustard\n\nyummm\n\ni'll go back for sure.  my only complaint is that the maspucha soup is only available for 2 minimum  and it is a LITTLE on the pricy side at 12$ per person...maybe 9-10 would be better, but it is WELL done!", "author": "Tim W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-07-31", "description": "I felt like hitting myself on the head for coming back here.\nYes, everyone deserves a second chance and that's why I went in here on a Tuesday morning.\nThe folks were inefficient and painfully slow.\nIt took them almost 20 minutes to give me my bagel with shmear.\nHalf of that time I was just standing there watching my already made bagel sitting on the counter while the unkept jittery and really slow cook continued applying cream cheese to other bagels....clearly multi tasking and serving what is ready is not something the staff is capable off. \nAll the while the girl at the cash register was just staring at the rows of bagles being shmeared and not once did she say \"hey dude, you are being slow let me help instead of staring vacantly\".\n\nThe only redeeming thing was that the bagles were fresh. I hope the folks at Mile in Manhattan are doing a better job.", "author": "Avantika B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-19", "description": "Holy geez the poutine is amazing.  Smoked brisket on crisp fries topped with creamy cheese curds and a generous ladle of thick gravy!  The bi bim bop was just ok even though it also contains the delicious smoked meat.  Stumptown coffee finishes everything off in splendid fashion.  I'll be back in on each Brooklyn trip", "author": "Ryan P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-10", "description": "Stopped in for lunch and had a very tasty corned beef Reuben. To help digest this meaty cheesy goodness there was excellent coffee from Stumptown and some fine music playing. Further visits will be required to try some of the other smoked meats on the menu.", "author": "David I."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-22", "description": "Nicest server.  I had a craving for matzo ball soup so we came here.  The matzo ball soup is very flavorful and peppery. I also tried poutine (for the first time).  The smoked meat was really tasty.  Gravy is perfect.", "author": "Christine B."}], "servesCuisine": "Delis", "priceRange": "$11-30", "name": "Mile End Delicatessen Brooklyn", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "97A Hoyt St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/jL2-f-hVAwkXx5vELTD0RQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188527510"}