{"aggregateRating": {"reviewCount": 747, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-06-20", "description": "Things you need to know about Mile End:\n\n1. It is small. There aren't many tables and only a handful of seats at the bar so it fills up quickly.\n\n2. Check their twitter before you go to make sure they have meat!\n\n3. Things aren't as crazy as they used to be! Now that they are adding dinner (weds thru Sunday it looks like) service, they seem to have meat later in the day. \n\n4. Come at off times and get almost no wait! went later in the day around 4pm on a Sunday and it was not busy at all!\n\n5. Poutine rocks!", "author": "David W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-06-21", "description": "Sandwich is amazing. Service at pop-up in Dumbo under the arches is horrible. I (along with countless others) waited in line for 20 minutes, only to be told we were waiting in the line to pick-up and needed or order separately and get back in line. Signage is undervalued in today's society. Sandwich is amazing but experience left a horrible taste in my mouth.", "author": "Michael J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-07", "description": "I had an urge for hot dogs one night and seamless didn't offer may options in Brooklyn Heights so a went outside my usual area and found Mile End. Heard they were good so I was excited to give them a try. Delivery took forever and the hot dogs were not very good. I was so disappointed. Recently, I felt like something different and decided to give them another try. Glad I did. The brisket sandwich was exceptionally good, the chopped liver was a major standout, the bread it came with was excellent and I even loved their pink cole slaw, if that's what is was. I'm a regular now! Just wish they had a bigger menu. And a bonus for the ladies and the gay guys, Mile End's delivery boys are the cutest you'll ever see!!", "author": "Matt C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-04-03", "description": "We were looking for a jewish deli and found Mile End after reading a few online reviews.  It wasn't quite what we expected. The menu was limited and the deli itself was very small.  There were three long picnic tables and a few seats at the counter.  The wait was over an hour and would have been cutting it close for us as we had to be back in midtown to head back home.  But, we noticed they had a take-out window so we ordered our lunch and took it to a park nearby.  The food was tasty.  I had the breakfast sandwich - very tasty, crispy bacon, egg cooked just right, toasted rye, delish.  Two others in my group had the classic Rueben with corned beef - about what you would expect, juicy and flavorful - and one other person had the smoked meat sandwich - very tender and flavorful.  We also had some sides - coleslaw, potato salad, French fries and a pickle platter.  Total was about $75 which is a bit pricey and I don't know that I would go back.  But, overall, we had a great experience once we found Nicholas Naquan Heyward Jr. Park around the corner.  We had a yummy lunch on a beautiful, sunny spring day.  Glad we didn't wait for a table inside!", "author": "Liz O."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-04-06", "description": "Just as Canada did against the United States in South Park: Bigger, Longer, \u0026 Uncut, recent Canadian entries Mile End and M. Wells have held their own against the rapaciousness of the NYC dining scene.\n \nM. Wells was like the Lawrence Taylor of NYC Dining 2010: it slipped past the offensive line of dominant food critics and became a disruptive culinary force that blurred the lines of diner food and fine dining. Mile End was as celebrated, if not more, for its take on in-your-face Canadian Jewish dining. I've been to this location for both lunch and dinner, and despite my thankfulness for having a very good Jewish deli in my neighborhood, it ain't Katz's, it ain't M. Wells, and its reputation is probably more vaunted than the actual food. \n\nThe smoked meat and the Ruth Willensky have been much reviewed. The smoked meat that I had on several occasions was smoky and dry, but lacked the necessary moisture to bind the spiciness and meatiness of the brisket together. The Ruth Willensky was my favorite, but I am a sucker for pungent meats like salami, and condiments like onions and mustard, layered together.\n\nOn a rainy night, I snuck in as a one-top for dinner. Instead of ordering from the entree section, I decided to order a quartet of appetizers. The pickle platter might be the best appetizer for $6 in the entire city: it was like a Celine Dion tribute to acidity, with the medley of pickled new and sour pickles, mushrooms, fennel, red peppers making my heart go on about the miracles of brining.\n\nPea leaf kreplach was solid: fried dumplings filled with ricotta and pea leaves smothered with creamy onions, mint, and chili went well with a Sixpoint Harbinger Saison. The onions smothered the fried pastry nicely, but a larger contrast between the pea leaves, mint, and chili would have significantly brightened the dish.\n\nThe sweet and sour lamb's tongue was unfortunately buried in field blend of chopped cabbage, sliced carrot, and a thin slick of sweet and sour sauce. The lamb's tongue tasted like funky salami chopped into small antipasti-like pieces, but the crop of offal was overgrown by the C\u0026C combo. Chopped liver with onion relish and chopped egg white was really disappointing with its lack fo schmaltziness, although the stir-fried vegetables provided a garnish to the pletzel triangles served with the dish.", "author": "Jonas M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-15", "description": "A friend had told me about this place and as we happened past with the family in tow, we took the opportunity to visit for brunch. FANTASTIC! Great, no fuss design, the front of house guy was charm personified and the food was delicious. I'll definitely be visiting again.", "author": "Kate D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-25", "description": "I'm torn!\n  \nDo I write a rave review of this place, because they totally deserve it?  Or do I ignore it, hoping no one else will discover it?\n\nWhile headed elsewhere for lunch with two buddies, we passed \"Delicatessen,\" and instantly agreed, Let's go!\n\nThe second we walked in, the savory aroma of smoked meats took over.  \n\n\"What's that amazing smell?,\" We asked.  \"What is that?,\" pointing to a beautiful cut of beef on the butcher's block.\n\n\"Smoked Meat,\" she said dryly, surprised by our enthusiasm.\nFollowed by, \"It's like Pastrami, but more fatty.\"\n\nSold.\n\nThree of those please, two Pomme Frites, and three Six Points Ales, (my favorite local beer,from Red Hook).\n\nEverything was delicious!  Mouth wateringly good!  Perfect fries, ice-cold beer, delicious sandwiches, and bland but good service.\n\nI should have started with the interior, because it is so simple and elegant, we couldn't walk by without stopping.  \n\nThe ambiance is very open and airy, with pressed plywood tables, and dim lamps extended from the walls on horizontal scissor hinges.  \n\nThere is a semi-exposed kitchen and counter, and the entire front is open to the street. It has the same feeling of being in Cafe Gitane, or Cafe Habana in Nolita.\n\nAfter a few bites of the simple smoked meat sandwich on Rye, with a bit of mustard, my friend said, \"When it came, I thought it looked a little small.\"  We all agreed and laughed, but on my third bite, I was wondering if I'd ever make it to the second half.\n\nNeedless to say, we were all very pleased, and more so, when the total bill amounted to about $60!\n\nIt might have been a better idea not to review Mile End, as they have maybe three tables and a handful of bar stools.  I'm positive I will never get in again!", "author": "Kimi R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-11", "description": "Smoke meat special, on a sammich. Dope.  Poutine.  Not as amazing as expected, but nothing bad can come of deep frying a potato.  Bitter Americans to drink. Chopped liver was dope. Lamb sausage was the low point.  Tiny and intimate, elevated bench seats.  Nothing bad can happen here, really.", "author": "Sasha H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-03-28", "description": "Amazing. This deli is really busy and really something special. Their special \"smoked meat\" is custom-cured somewhere in Williamsburg... and is delicious. They run out of meat daily. They have Montreal bagels, which I didn't try but am meaning to. I had the smoked meat hash, wthich is a kind of brunch, and to be honest, it was too greasy. I forgive them... I still love the place. The poutine was FANTASTIC. Gotta try it! Poutine is a  fast food kind of dish from Quebec. Fries, gravy, cheese curds, YUM.\n\nThe staff is friendly and funny. They brought me a check with no numbers on it. I said \"what, do you expect me to barter?\" The response \"yeah, that shirt will do!\"", "author": "Jason G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-07-05", "description": "Smoked\nBrisket \nAlong with\nCanadian \nApproved bagels and some Stumptown coffee.", "author": "Justin L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-31", "description": "Now this is my jam.  Went at 10pm after a concert at BAM.  Snagged a seat for 6, but we were only 2.  Ordered classic poutine (my first) and a hot dog.  Everything was good.  They even have rainbow cookies and cater Passover.  I'm a Jew in love with Canada now.", "author": "Allison H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-19", "description": "i love the attention this place is getting.\nwell deserved!\n\nso my boyfriend and i stumbled in a few weeks ago.\npost YELP reviews and my love for soup we decided on the following.\n\n-matzoh ball soup (fluffy balls my bubbie would be proud of) could definitely do without the al dente veggies though. i mean, i see where they are going with it, just not necessary.\n\n-beef on weck. (oh hell yeah- this sandwich was out of control)\nlarge and in charge but so flavorful.\nthe roast beef was super juicy and tender\nthe au jus was perfectly seasoned\nthe salted bun complimented it perfectly.\n\n-poutine with smoked meat (classic)\n\n-smoked meat sandwich (no words for how delicious this thing was, but there's a story to accompany it)\n\nwe sat at the bar area, bc let's face it, best seat in the house.\nman at the end of the bar had sat down same time we did.\nhis food came right after ours.\nin the midst of us shoving our faces off, we hear...\n\n\"THIS IS THE BEST SANDWICH I'VE EVER HAAAAAAAAAD!!!! THIS IS WHAT KEEPS THE CARDIOLOGISTS IN BUSINESS!!!!'\n\nsuffice it to say, this man made our meal all the better.\n\ndefinitely get the pickles!\nsuper delish. \ngreat spot, love that its a short 3 block walk.\nalso, celebrity sighting -- anne hathaway (her fiance lives in the hood)", "author": "Krystal F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-06-16", "description": "Great gourmet sandwich shop. Can't really say much about as we ordered online. I got the smoked meat sandwich and found it a little small, but the meat itself was very tasty. Not a huge sandwich person, so probably won't be back soon, but if that's your thing it's definitely worth a try.", "author": "Ceasar B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-07-21", "description": "I can tell this place is a head above the rest!   Super tasty, and fresh.\nTry the Brisket platter and the pickles and beets you will not be disappointed!", "author": "dave g."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-02", "description": "Great food! I came here for an early lunch on a Friday and there was luckily no line and my coworker and I got a table right away. We split the smoked meat samich, the chopped liver samich and the classic poutine. All were great! The chopped liver was probably the best I have had. It was served alongside these toasted salty triangles of bread that went perfectly with it. The chopped liver was also topped with egg and pickled cabbage...so delish! The smoked meat sandwich was the best my coworker said he ever had. The meat was melt in your mouth awesome. Finally the poutine was very good and worth trying once, but we were so full I had to waddle back to work. Definitely a great meal.", "author": "Cynthia M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-09-29", "description": "ALL of their smoked meats are delicious. Great place for lunch - I'll definitely be a repeat customer!", "author": "Kristin P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-01-06", "description": "skip it, had a dry brisket sandwich on stale bread with tasteless slaw and a mediocre pickle for 24$$$$? service was nice and the fries were good but clean the kitchen guys its dirty and its open, wont be back", "author": "M M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-14", "description": "This place was on the top of my restos to try list for the past several weeks, so I was happy to have time during the day to go. My wife and I arrived around noon on a Sunday for brunch and waited about 15 minutes to sit. I'm not a huge fan of communal tables but it's either that, get lucky and get one of the few seats at the counter or take out. \n\nI ordered the smoked meat hash, which was amazing - tiny bits of meat mixed in with diced potatoes and a perfectly fried egg on top. My wife ordered the cheese bagelach, which we thought was going to be like a cheese blintze, but turned out to be a flaky cheese danish, served lukewarm. My wife asked for a little more heat on the bagelach and it came out about the same temperature. I liked it more than she did. We split the poutine with smoked meat, which had great cheese curds and lots of meat, but too much gravy, leaving the fries soggy. I wouldn't recommend the poutine for take-out for that reason. \n\nStumptown coffee was delicious, but no decaf option for those who prefer it. Service was slow but friendly. We took out a pickle, which was great (sour with a hint of sweetness) as well as the cole slaw (pickled red cabbage) which was pretty good too. St. V bagels were available for purchase to go, which was a very nice touch. I asked the gentleman ringing me up why they serve St. V as opposed to Fairmount and he didn't know. Next time I hope to get the answer from the owner. \n\n3.5 stars but I rounded up because of how great the smoked meat was.", "author": "Lee M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-30", "description": "Best. Deli. In New York. Get the smoked meat sandwich. They make their own rye bread in house. I think they make their own bagels. Everything is good here.", "author": "Adam B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-15", "description": "I've never eaten smoked meat in Montreal, but I thought Mile End blew Katz's and Second Avenue Deli out of the water.  My three year old, who is usually a bagel fanatic, went straight for the smoked meat and couldn't get enough of it.  The bagels are also quite good, and I'm a big fan of traditional NY bagels.  Only downside is it does get very crowded, and there can be long wait times.", "author": "Autumn K."}], "servesCuisine": "Delis", "priceRange": "$11-30", "name": "Mile End Delicatessen Brooklyn", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "97A Hoyt St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/jL2-f-hVAwkXx5vELTD0RQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188527510"}