{"aggregateRating": {"reviewCount": 747, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-02", "description": "This place rocks.  Plain and simple.  Don't believe any of the bad reviews.  Whoever writes a bad review of this place doesn't know anything about food, and what it costs to run a small business.  Yes, it is expensive.  High quality ingredients cost more.  You want to eat pay less? Go eat inferior quality elsewhere.  The costs of running a small retail food business are extremely high and adding the high cost of quality ingredients and labor of doing it all from scratch naturally adds to the cost.  Secondly, Mile End is a small operation.  They do run out of items at times.  And, the wait can be a while.  But, that is only because they are small and popular,  Before you go on yelp and trash a business, consider that there are hard working individuals who put their life's work into serving you.  Bad reviews are bad for business.  And, Mile End deserves great reviews.", "author": "Peter S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-06-27", "description": "The food here is good.  It really is, but it deserves one star because the owner and at least one employee are a**holes.  When I had the audacity to good-naturedly question their prices, they basically told me to go F myself because they didn't need my business.  That kind of arrogance should not be rewarded.", "author": "ann t."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-18", "description": "The first time I came I was extremely disappointed with the quality of the smoked meat sandwich visa-vie any pastrami that I've ever eaten in a good NY deli. Nevertheless, I decided to give it one more try. Yesterday I picked up a $5 smoked meat sandwich at the Brooklyn Flea in Williamsburg and now I'm hooked. The meat was as moist and tasty as can be and blew away my taste buds. I'm sure that I will be back with lots of lipitor every week.", "author": "joshua k."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-19", "description": "Is there a better smoked meat sandwich on the planet? I don't really think so.  But don't let Mile End's signature dishes distract you from other excellent choices on the menu - in particular the matzo ball soup and the Vistula Cafe worthy borscht.  Best borscht I've had anywhere in the U.S.  Great atmosphere and nice little beer selections.  I love the Mile End.", "author": "Macy W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-17", "description": "I've been to this place several times and always get the same thing, the smoked meat sandwich and poutine! You can get the same smoked meat sandwich that's served during dinner at lunch for a cheaper price, so I recommend coming here for lunch instead. For those of you who don't know what poutine is, it's french fries with cheese curds drowned in gravy. That may not sound very delicious and the first several times I came here, I refused to eat it because it sounded unappetizing. But during my third visit here, I got off my high horse and tried it and boy was it delicious! Don't be scared of poutine, it tastes like cheese fries but better! \n\nThis place is tiny so if you are only a party of 2, chances are you will be sharing a table with strangers if you are unable to get seated by the counter. But sitting next to strangers who are probably just as much of a foodie as you are has lead me to meet some of the nicest people and have some of the most interesting conversations.", "author": "Cindy X."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-09", "description": "The quality of Mile End is hard to compete with.  My only question is why are all of the 'classic' jewish delis not of this quality themselves?  The pastrami here is honestly some of the best I've ever had.  The poutine is fantastic - better when you eat in rather than take it to go, in my opinion.  They also do a smokey burger night every Tuesday with some drink pairings and it's highly recommended.", "author": "Terry D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-02-05", "description": "This place rocks the kasbah.  My husband and i have been here so many times we have lost count.  Brunch is amazing. Everything is so fresh and tasty. I have had the mont royal, the mish mash, breakfast sandwhich, ruth wilensky, pickles, etc. Everything is so tasty!  I would say its somewhat like katz's in that it is a jewish delicatessen but its more unique and intimate and they have superb brunch! Love this place!!!!", "author": "Katie P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-12-07", "description": "Mile End Deli is unfortunately a rather big disappointment. Don't get me wrong, they serve decent food, in a nice setting with polite and professional employees. The problem is that they overprice and pretend to be something they are not. The food is good, but nothing special. It is yet pricy, very pricey. The portions are small, very small. The combination small servings and OK food, is therefore not a good combination, neither quantity nor quality. I have been here a couple of times and I have tried to like it, parly because of the Canadian Jewish experience, partly because of the fact that it is a different eating experience in the neighborhood. Every time I leave, I leave a bit disappointed. My advise: lower your prices or increase the quality on the food. When someone needs to spend 30 dollars on a lunch, we are not talking deli or diner anymore, rather restaurant, and that, I can assure you, this place is not.", "author": "Alexander R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-04-20", "description": "Mile End is seriously delicious. I am an eater of sustainable meat and you can't get much better than this place. The meats are cured perfectly, their turkey sandwich is the best I've ever had and their pastrami is incredible. \n\nThe sandwiches are the perfect size, you're not going to walk out of here feeling like you just ate a whale. And the coleslaw! The coleslaw! \n\nYou MUST go here. Now.", "author": "Brit L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-09", "description": "This place is an amazing weekend brunch spot.  The food (and coffee!) is fantastic.  I usually get the Beauty but the Smoked Meat sandwich is also really good.  When I have a friend that is willing and able, I also love adding an order of Poutine (w/ Meat) to split!\n\nOnly thing keeping this from 5 stars is the mandatory 45-60 minute wait every time I go.", "author": "S J."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-08-23", "description": "Came here to try the Ruth Wilensky (fried salami pressed into an onion roll, #5 on NY Mag's Top 51 NYC Sandwiches list) and the Smoked Meat (uh, smoked meat, #11), as part of my quest to eat my way across that list (which may or may not be healthier than my other current quest, to have watched every Nic Cage movie ever). And in doing so, I think I learned something about myself: much as I looooove meat, and always appreciate an onion roll, I think I can only find a sandwich that consists of almost nothing but meat to be so amazing. Veggies, along with every other non-meat food, to me, were put on this earth solely to provide contrasting flavors and textures to all the meat you're eating, and without them, food just lacks the complexity required for me to, say, rank two sandwiches as high as #5 and #11 on a list of sandwiches. I mean, these are two very good, delicious items, using high-quality, tender meat, but ultimately, I didn't find them breathtakingly awesome or anything. \n\nWe also got fries--as we often do--which came with a generously sized takeout cup of ketchup, a real surprise since America quietly moved to a stingy-ketchup-allocation-based economy a few years ago. (I mean, two packets, burger place by me at work? My ass.)\n\nSpeaking of, in full disclosure, I did take these sandwiches to go, eating them back at home after a 10-minute bus ride, and I do suspect the Ruth Wilensky at least would've benefited somewhat from cramming it down immediately. Of course, I only took them to go because the restaurant is one of those obnoxiously small and un-air-conditioned places where you have to wait 17 hours just for the privilege of being seated so close to strangers that if anyone so much as sneezes it will probably overwrite your genetic code, so the store's not entirely blameless. Anyway, sometime I'll have to (go at an off-peak time and) give them another try, but for now: good stuff for what it is, but not quite worth the hype, and not quite what I was looking for.", "author": "Galvin C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-06-09", "description": "Excellent Deli. Food, atmosphere, service, and location are fabulous. Enjoyed the Smoked Meat, with fries. First, the sandwich is not outrageously large like other NY delis, it is the perfect lunch portion. The smoked meat is delicious, perfectly tender, well seasoned. Fries, better than average. \n\nThe Physical space is also excellent. Great decor, small space creates great feel. Food is delivered fast, service inside is casual, but on the ball. Boerum Hill is a lovely neighborhood, easily accessible by Subway(Hoyt-Schemerhorn).\n\nOverall, excellent experience. While they are good, skip the often overcrowded, tourist laden Katz and Carnegie, and head to Mile End, which is just as good, and hopefully will be around just as long.", "author": "Joe D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-27", "description": "The place is authentic and the food is flavorful.  Nice, down to earth wait staff.  Nice little touches, like the carmelized onion on the chopped liver, the cloth napkins, rockin music, the just unique enough drinks, the seeded bread with the chopped liver.  \n\nThe 4 stars are because the dinner menu was just a tad bit too limited, the brussel sprouts were too oily (but so so flavorful so I forgive them), and the meat was too fatty (but again, so flavorful).  Although the orange topping on the babka was nice, it still was a bit too dry for my taste although the others in my party enjoyed it.", "author": "Jessica H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-20", "description": "ordered the pastrami poutine and a pickle plate.  the pastrami was tasty, the gravy was good, and the dish was delicious.  the pickles cut through and were a nice change.", "author": "david l."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-02-19", "description": "Very disappointed. It was way over priced. No.variety on the menu and no accomodation for the customer. I thought it end a bunch of hipsters trying to play chef. I think in a city of deli and dining this place leaves a lot to be desired.", "author": "Paul H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-12-09", "description": "Food is still good, but now that I've eat there more times  - IT'S WAY TOO EXPENSIVE. They need to halve the price of many items. Matzoh ball soup was tasty, but should cost $3.50, not $6.50.", "author": "Audrey S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-07", "description": "I've been to Montreal before and have had their bagels and their smoked meat, so I was very excited/intrigued to hear about Mile End.  I'm happy to say that ME doesn't disappoint in providing the same culinary experience.  I've had their smoked meat sandwich (mouthwateringly excellent! not necessarily the biggest sandwich you've ever had but just the *right* amount, and high quality meat as well), the Mont Royal (also superb--salmon and creme fraiche on a chive latke), and of course the St. Viateur bagel.  Added bonus: a very generous cup of Stumptown coffee.\n\nBe warned, it can be crowded (it's small, it's really good and the secret is out) and can become a bit of a wait/clusterf*ck (in which case, just get it to go) but stick with it and your patience will be rewarded...don't wait too long though, as they run out of food by 4 or so and you end up feeling like an idiot for not checking their Twitter feed/site, which lets you know when this happens.    \n\nI'll definitely be back, but am wondering how I'll fit the poutine into the mix...", "author": "Ben K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-02-16", "description": "I had to try this place after all the good Things some people had to say and what I Could say is Please please dot ever think of giving this place your money !!!! Absolutely the worst food I have ever had!! They give this style of food a bad name!! The soup was so salty and the matzoh ball was the worst I have ever had !!!  This is the most truthfull I can be all the food sucked except the chopped liver and the smoked meat itself but the portion size was a joke the smallest peice of rye bread and less meat then a corner store would have given on a sandwich ! The duck pastrami was a total waste of money and the brisket was full of fat served with the deckel which is the fatty layer in the middle of this cut of meat. The hanger steak was served raw and not medium rare like ordered!! These cooks need to tast what there cooking and serving !!! Don't waist your time goin here your better off goin to Montreal !!! People that eat here and think this is good food need to have there head examined!! Never in my life did I ever have that much salt In my food !!", "author": "Matt E."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-01-05", "description": "\"UNSANITARY\"  I was outside waiting to buy dinner to bring home at 5:14pm Jan 5, 2011. They open their doors 5:30pm. One Chef was on standing on counter with his socks writing on the blackboard above. As he walked along the counter to write on the board, he was wiping his nose and rubbing his face. He jumped off the counter and put his shoes back on.  He  never washed his hands or counter where he stood. He took out a piece of meat and was picking at it with his hands and place it on the counter where he stood in his socks and proceeded to cut it up.  How disgusting and unsanitary! What if his feet has a fungus? Just think of all the folks that have eaten there. I am so disappointed. I am going to tell everyone at work not to go there.", "author": "Creative R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-23", "description": "My first experience with this spot was so positive that this review might not be a very objective one. Mind the twenty minute wait for brunch. My opinion might have been swayed by their cherry-almond after-breakfast sweets, so make sure to try one of those.", "author": "Dareen S."}], "servesCuisine": "Delis", "priceRange": "$11-30", "name": "Mile End Delicatessen Brooklyn", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "97A Hoyt St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/jL2-f-hVAwkXx5vELTD0RQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188527510"}