{"aggregateRating": {"reviewCount": 747, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-15", "description": "As a montreal-born new yorker, I was ecstatic to hear that a Montreal deli would be opening so close to my friend's apartment. For 2 weeks I looked forward to trying Mile End. \n\nThe service was very unfriendly. I asked for no mustard (since I don't eat the stuff) and was given way too much attitude. I know the whole story behind the 10 cents extra, and I'm totally fine with paying that. I'm not fine having to argue with the watiress about it and having her tell me \"i'll write 'no mustard'  but can't guarantee that it will come out that way\". I actually had to tell her that if my sandwich has mustard I will leave it and walk out. I later found out that the waitress was the owners wife and thought that made the whole situation even worse. \n\nLuckily, my oh-so difficult special order came out correct and I was able to enjoy the Montreal smoked meat that I have truly missed. The sandwich was delicious and a very fair price, in my opinion. I didn't try the poutine this time, but plan to in a future visit. \n\nI also grabbed 3 Montreal bagels to-go and left brooklyn a full and happy Canadian!", "author": "Jen G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-07-21", "description": "Haven't had a Montreal bagel since we made our trip to Montreal back in '06, so what a delightful surprise to run across a Montreal deli here in Brooklyn!  Yummy wood-fired oven baked bagels driven down from Montreal itself; a handful of good breakfast entrees; and delicious cold-brewed iced coffee courtesy of our Stumptown friends.  Haven't had a chance to try the smoked meat burger (how awesome does that sound) but it is definitely on the list.  A great resource when in Carroll Gardens/Boerum Hill.", "author": "Katy M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-04-09", "description": "I always loved Mile End and never had a complaint...until today. I got a Smoked memat sandwich which was great as usual. I also got a lamb sausage sandwich that was inedible. Not only did it not taste at all of lamb, but it had a strange chemical flavor, not unlike Comet cleanser. It came with eggplant mayo, which was tasteless, and harissa slaw. The slaw was meant to be spicy so I got it on the side--it, too was tasteless. No vinegar, no salt, no heat, nothing. I took two bites--just to make sure it was as bad as I'd thought. It was. I also noticed that they were serving 5 day old chicken salad. That didn't help. I'm sure I'll go back for the smoked meat but I'm not excited about trying anything else.", "author": "d j."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-07-20", "description": "AWwwww hell yeah.\n\nLook -- the Ruth Wilensky is the bomb. I have had an affection for onion rolls since childhood and this kicks my ass. Sooo happy they're open til 10 now, especially since the place is empty around 9 for a little late dinner.\n\nThey've got a bomb soda selection too.", "author": "caitlin o."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-06", "description": "Had the mishmash this time - terrific.  And the Beauty again - still trying to deconstruct those bagels from Montreal.", "author": "Danielle G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-21", "description": "Fill your yearly lox quota here, yum! I learned that there's definitely an art to making good lox, and they know the secret. Had to wait a little bit, outside for seating, so be prepared for low capacity seating inside. But it's well worth the wait once you're inside. I'm in love with New York cafes and they're tendancy toward atmosphere, finally utilizing installation artists and decorators to create amazing space for their patrons. The great food matches the atmosphere. Only thing I didn't like was the coffee, but tea with cream and sugar tends to do me better anyway. Cinnamon roll, hell yes. I really could be a regular here.", "author": "Kat Marie M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-09-10", "description": "Solid smoked meat and they try to pull off the poutine but for someone who goes to Mtl all the time, it's no Schwartzs or Snowdon Deli caliber.  Also, a 20$ dozen Bagles makes no sense to me.  Yet, if you are in the are and craving a pastrami like sandwich for $9, this will work.", "author": "Jonathan T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-06", "description": "i was intrigued by this new \"jewish deli\" and came with a friend a while back. we ate like we hadn't in years. food is hearty, portions are huge, all reasonably priced. i wanna go back soon.", "author": "L P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-14", "description": "I was closer to 3 1/2 stars.  First time there, decided to keep it simple and classic.  Matzah Ball soup was delicious -- flavorful without being overly salty.  Sorry to say it, but the Smoked Meat sandwich was just OK, really nothing memorable.  Virgil cream soda was excellent and the service couldn't have been friendlier, but all in all it was pretty pricey for what it offered.", "author": "Cliff G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-05", "description": "As a Montrealer who moved to Brooklyn ten years ago, this deli is the joining of my two favorite worlds: Montreal food and breakfast in Brooklyn. The food is authentically Montreal, with smoked meat, and of course the authentic St Viateur bagels. For Saturday brunch,  I  had one if their delicious chive latka lox plates and shared a bagel with my husband. My husband loved the smoked meat hash. He says he even prefers Montreal bagels, despite being born and raised in New York. I hear it is the way they used to make them in NYC a hundred years ago. Ah, I have missed them! And I am so glad to know of a place where I can eat them without having to make the long trek home.\n\nThere are a few familiar items on the menu : the Mont Royal, and the Beauty...two all-too familiar names to a person who spent years hanging out in the Plateau area of Montreal, which is just south of the Mile End neighborhood, where Montreal's Hasidic community shares its blocks with artists and cafes and lovely tree lined streets.   \n\nThe atmosphere is quaint,  though small. The decor is very tastefully modern and cozy.  We met some other Montrealers while sipping their yummy coffee at a family style table, which only added to my joy in eating  and being there. \n\nOne thing that was sadly too true to Montreal was the not-the-best service. Though the people behind the counter seemed friendly, the wait staff lacks a degree of warmth and attentiveness - and this is my only reason for not giving it five stars. But I am a stickler for friendly service, so maybe it won't bother another less picky client.\n\nI am looking forward to going back for some poutine. And then again for an old fashioned smoked meat sandwich, and the great coffee. And the memories of home.", "author": "Megs C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-01-28", "description": "Ok so I read the menu and based on reviews my co-workers and I decided to try this place. Yes the brisket is good so I think. The sandwich was not even enough for my coworker that eats like a bird. \n\nThis place is way too expensive for the tiny portions they give. Let's not forget the extra $1.50 for a tiny little sweet jerkin. Well guess we were the ones jerked. \n\nIf you not hungry and want a small over priced snack that will taste good then go here.", "author": "Glen O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-12-02", "description": "The food was delicious.  Blend of flavors that worked really well together.  Had the veal sweetbread and Trout Bisque.  My friend has the Hoyt dog, which was also amazing.  Anything with the brisket in it is worth trying.", "author": "Hannah B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-12-29", "description": "I love it. In response to some of the other yelpers, it's not exactly a Montreal deli, but it's a great restaurant, that like other restaurants, takes inspiration and makes something wonderful. My favorites are the matzo ball soup (only place I'm know I can reliably find it), poutine (which my veg better half usually steals most of), and the Ruth Wilensky. Very few tables, so I usually get to go and bring it home. They were impacted by Sandy and have been closing early, so get there before 4.", "author": "Rebecca F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-14", "description": "A pivotal juncture; eat a 7:40am breakfast at a generic deli or wait 'til the (ridiculous) 8am opening of some Montreal bagel joint. Having staved off my hunger long enough, I ordered from the window and dined in. Situated rather ambiguously yet fittingly between Pacific and Atlantic, Mile End (I'll spare you the mention of omnipresent joggers) is a cool little joint with a takeout window and some rustic wood tabling to boot (but damn was it hot in there at the advent of business @ 8am). I punked over $3.81 for a cream cheese bagel laden with tomatoes and onions, anticipating the Montreal style and fully expecting to pummel it wholeheartedly. It was absolutely sweltering in the place, so they graciously brought over some water for me, the lone patron in the 15 or so minutes I spent there. The bagel, an infinitesimal toasted creation topped with sesame seeds and borderline-melted cream cheese, was one of the smallest and priciest bagel per square inch, perhaps an homage to the housing in the borough across the way. It was, admittedly, one of the most impressive non-NY bagels I've haad the pleasure to enjoy; Canada's finally onto something here.\nIt's essentially a 5 - 1.5 because the 8am opening time is just unacceptable and nearly laughable, it was sweat-inducingly hot, and they're not NY holed delights.", "author": "George C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-07", "description": "Mile End is worth the somewhat inconvenient trip - since this place keeps early hours and often runs out of its signature Smoked Meat, it can be a little troublesome to get to, but I was pretty happy about it when we finally made it.  [EDIT - apparently they are all stocked up and never run out of the smoked meat anymore; the first time I tried to go here, when it just opened, I was turned away, but that only made the return all the more triumphant.]  The house-pickled cole slaw was tasty and light, the coffee was great, and the smoked meat poutine was exactly what you want in an overwhelming comfort food.  Good coffee, too.\n\nMy only complaint would be the unbelievably small table by the window where we were seated, but that wouldn't bother me much on a cooler day.  I'll definitely be back for some mid-winter warmth.  \n\nTL;DR:  Mmm, Smoked Meat Poutine.", "author": "grizzzly b."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-09-04", "description": "After having first tried poutine a few months earlier in Montreal, I was on the hunt for that same artery hardening delight. I had read about Mile End and their practice of importing bagels from Canada and was admittedly a bit turned off (they aren't even that good!). I went on a beautiful Saturday afternoon ordered the smoked meat poutine from their to go window. it looked super cramped inside. It was ready in about 10-15 minutes and survived the trip over to Governor's Island without getting completely soggy. It tasted just like I remembered, squeaky squishy cheese curds, salty gravy and well cooked fries. I'm not usually a fan of beef but the smoked meat was also delicious.", "author": "Emily C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-12-11", "description": "This is a tough one b/c I was expecting AMAZING pastrami and what we got was okay pastrami on a teenie weenie sandwich for $15.   Don't believe the hype, this place is good not great and there is much better to be had in NYC.", "author": "A. W."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-06-07", "description": "i had the brisket sandwich and pickle at mad park eats and it was not delicious. when i saw the man making the sandwich trim ALL the tasty flavor (read: fat) off of the pastrami i wanted to scream \"What, Sir, has this brisket done to you that would make you mutilate and disrespect it in such a cruel, inhumane manner?!?!\" no brisket deserves to be treated like this. needless to say, the sandwich was dry and very, very sad- no amount of mustard life-support could have brought it back- it was dead :( .  then there was the pickle- a green dagger to my heart. it was unnaturally sweet and had a strange, rather unpleasant after taste. i would have given anything for a traditional half sour to swoop in and save my lunch. i will never make the mistake of canadian kosher again.", "author": "Annette M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-10-24", "description": "I wish I could give this 4.5 stars.  The only reason it is not a 5 is that they need a better option for non fatty meat eaters.\n\nOther than that the staff is unbelievably friendly and the menu is fantastic.  They also put up my my pop, who is an avid pastrami lover", "author": "Noah S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-10-22", "description": "I was very excited to hear about Montreal smoke meat and Poutine right here in NYC, I fell in love with it in Montreal Canada. I ordered the smoked meat sandwich and a large poutine, I was very disappointed with the portions. The sandwich cost 15 bucks and barely had any meat in it. The meat was cut thick, it was chewy and dry. The rye bread wasn't authentic Jewish at all, the slices where too thick and too spongy. Very different from the way Jews make their smoke meat sandwiches in Montreal at Swartz. What made me even unhappier is the fact that they didn't even serve me any pickles or coleslaw with my sandwich, you have to pay an extra 7 bucks for a pickle and coleslaw??? The poutine was also small for 13 bucks, don't get me wrong the fries were very good as well as the gravy but the poutine only had 8 or 9 pieces of curd cheese, no generosity at all. My bill ran me $30.49 and I wasn't satisfied at all. I love poutine and smoke meat but I will never go to this place again.", "author": "John J."}], "servesCuisine": "Delis", "priceRange": "$11-30", "name": "Mile End Delicatessen Brooklyn", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "97A Hoyt St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/jL2-f-hVAwkXx5vELTD0RQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188527510"}