{"aggregateRating": {"reviewCount": 747, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-12-19", "description": "$5 fries lol. Pretty much all sides and drinks (like sodas, coffee, tea) are overpriced, bunch of ice and no refills. Yea you'll feel pretty much ripped off unless you just don't value money I guess. Service is meh and too cool for school. Fwiw, the sandos I used to enjoy the reuben and the chicken salad sando. But, imo not worth it since the quality can vary especially with the reuben.", "author": "Andrew K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-08", "description": "My fave restaurant in all 5 boroughs. Excellent food and the price is nice. The beauty - bagel with salmon, capers, cream cheese and onion - is $13 but IMHO the best in the city. If you love Montreal style bagels and poutine, you'll be very happy here. I sure am.", "author": "Andrea N."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-22", "description": "Do not order from these guys online or from an app like seamless. They run out of meats and breads constantly and charge for substitutions and don't offer refunds when they run out or make mistakes with orders. Restaurant employees are nice but management and the owner do not care or take responsibility about making sure customers orders are fulfilled properly. I have ordered from here for personal orders and work lunch orders and I have had nothing but issues. Food is good, service not so much. Taking my business to other restaurants in the area instead.", "author": "Brian F."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-09-09", "description": "Very disappointed... Nothing like we expected from watching this deli featured on Michael Symon's BBQ Brew show on the food network channel.  We drove all the way from Staten Island to eat... Matzo soup (tasteless and cold), burnt chicken sandwich (chicken schnitzel), and cold smoked meat poutine. We can't believe we spent over $60 on something that was horrible. We ended up going back home to pick up pizza for us and the kids because we were all hungry.  Save yourselves the money and time.", "author": "Monica C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-09-06", "description": "Horrible overrated/way overpriced and very very rude obnoxious staff. I will not be returning to this horrible place.", "author": "Jack C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-18", "description": "I've only been here once before and I remember it being good but my experience last night was memorable enough for me to actually write a review. \n\nMy boyfriend and I went here last night not realizing it was poutine week, and the food was amazing! We really went all out and got the duck confit poutine, the smoked meat burger, latkes and the knish. The garlic knish was $5 and my mouth is watering just thinking about it. The latkes are thick, and perfectly crispy. The duck confit poutine was amazing, I couldn't stop eating it. The smoked meat burger was also delicious although it was kind of over-shadowed by how over the top delicious our three other dishes were. I'd still recommend it. It was like a bacon flavored burger! \n\nI'm really surprised by the few reviews about bad service because our waitress was so wonderful that my boyfriend and I were talking about how we wish more people were like that our whole walk home. She was attentive, funny and pointed us in the direction of an amazing IPA (Grimm, Lumen IPA, so good). \n\nI've worked in the neighborhood for 4+ years (everyone I work with also loves this place) and lived in the neighborhood for 2+ years and I'm kicking myself for not going back here sooner.", "author": "Erin S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-10-16", "description": "Mile End has gone so far down hill, it's laughable. They used to take thoughtful pride in the quality of their food. No more. The cooks have become lazy, the wait staff tired and clearly bored with their jobs and their customers. Take one simple dish as an example: matzo ball soup. It used to be stellar here. A rich, delicious broth with a giant, firm and tasty matzo ball floating in the dead center. What I got yesterday was hot dog water with an overcooked smushy mess of a matzo ball breaking apart into a million little pieces. Get your act back together Mile End!", "author": "Matt M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-09-17", "description": "This place should post a sign that says \"If you have a baby - or have ever been a baby - stay out.\" Despite the fact that the place was half empty, there was plenty of room available for us, and we offered to fold up our stroller, the staff member turned us away and did not permit us to dine in because we had a baby with us. In no unclear terms, she told us we could not come in with a stroller. I responded by saying that we would thus take our business elsewhere, and she encouraged us to do so. I in turn will encourage all of you to do so. We were all babies once and it makes no sense to turn away customers because they have a (peacefully sleeping) baby in tow. I suggest avoiding a place with such exceptionally poor customer service.", "author": "Carrie G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-25", "description": "Typing while chewing... Delicate morsels of corned beef gently held together by melted Swiss and Russian dressing between two slices of pumpernickel bread.\n\nBest Reuben ever.  Mind blown.", "author": "Danny L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-01-30", "description": "Well let me tell u this place is over rate they charge u a arm and a leg for meat that's not even worth it like 6 slices .. got two sandwiches and cost me 40 bucks will never go back and never recommend it ...", "author": "Jeanine S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-31", "description": "This was a great find!  It's kinda of a small place but I was early so there wasn't any crowd. But by the time I finished it had filled up. It was easy to find within easy walk of The Barclays. I had poutine and a pastrami reuban.  It was pretty good. The staff aren't the most cordial or inviting bunch but it's probably because I walked in right at opening.", "author": "Steve R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-02-26", "description": "3.5 Stars! \n\nWe came here because we were craving for some poutine. The poutine here were decent. It's not good or bad, nothing special, definitely not as good as the one we had when we were in Montreal \u0026 Quebec. The portion is somewhat small even for a large one. \n\nThe place is small but still somewhat spacious \u0026 comfy. We were there around 5pm on Wednesday. There were some other customers but it wasn't busy. Our waiter were friendly. Overall, the service was good. \n\n$12 for a large poutine\n\nOverall, this place is decent. It's definitely worth trying.", "author": "Mr F G And Mrs M S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-09-11", "description": "I remember hearing good things about their Manhattan location and Time Out was showing them lots of love some years ago. On the strength of a recent suggestion from a friend, I decided give them a try. Got some take out consisting of their brisket sandwich and went for the smoked meat poutine with the deluxe option. Neither the sandwich nor the poutine were bad and they held up pretty well to my trek back home but I wasn't blown away. Wouldn't have minded the meager portions of food if the prices were more reasonable.", "author": "Roberto L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-01", "description": "Nice place for a good smoked Reuben sandwich! The bread was especially good. Seating space is limited.", "author": "Becca R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-05-15", "description": "Tiniest table I've ever sat at. I had a very mediocre and dull-flavored smoke meat hash and a fairly decent buttered bagel. Service was a bit grouchy. My mother's bacon was undercooked in some spots but burnt in others, and her eggs and rye toast were mediocre.", "author": "J. L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-12-07", "description": "I'm from Montreal, so I was pretty excited to try Mile End while I was in Brooklyn. Cool place/vibe, but the bagels? Well, they are definitely better in Montreal (but I will say, better than those bready, lame ones in the rest of NYC, there, BOOM, I said it: let the bagel wars commence!)\n\nLoved the coffee, the open kitchen, the staff, the prices and the lox. The poutine though is nothing like in Montreal and the annoying people that get coffee to go and refuse to shut the take away window, brrrr for those of us sitting at the bar.", "author": "Janine T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-25", "description": "Great service, great iced coffee (from Stumptown), love the atmosphere and food portions.\n\nA buddy and I shared the smoked meat sandwich and the beef on weck. The smoked meat sandwich was a little dry, but the beef on weck was delightful. Both of them had random sea salt sprinkled in them, which was a bit odd and surprising when every other bite was unnecessarily salty. But still good.\n\nGreat place to come on a weekday for lunch if you're available!", "author": "Kenny C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-08-23", "description": "Was good when it opened, now sub par.  Much better food at better prices in the neighborhood.", "author": "Daniel C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-10-22", "description": "I asked up front if they could do egg whites because I have high cholesterol. Lady assured me they could. I then ordered an egg white sandwich to go. Waited about 30 minutes (why so long? No idea) and then when she handed me my sandwich she said \"sorry, the egg whites were a no go can I give you a free coffee or something?\" Unbelievable! She could have told me when she found out ... then I could have ordered something else! Also, it didn't even come as a sandwich, just came with 2 pieces of bread on top of the (soggy) eggs. 1 star... food is mediocre, service is worse, and price is insane. Don't come here.", "author": "Robert G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-12-28", "description": "Came here for breakfast and ordered the Smoked Meat Hash and the duck sandwich (forgot the name of it but it had maple syrup..). The hash was rather bland, could use a bunch of salt \u0026 hot sauce. The duck sandwich was wayy too sweet. The bread was drenched in syrup, making the bread quite soggy and too sticky/sweet with the duck. The duck was very fatty, but overall good flavor that I wish was also translated to the hash.", "author": "Carol H."}], "servesCuisine": "Delis", "priceRange": "$11-30", "name": "Mile End Delicatessen Brooklyn", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "97A Hoyt St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/jL2-f-hVAwkXx5vELTD0RQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188527510"}