{"aggregateRating": {"reviewCount": 747, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-11", "description": "Be prepared to wait a while to get a seat at this busy but excellent Brooklyn deli. However the wait is well worth it. \n\nThe cooking process behind their cured meat hails from Montreal as does the restaurant owner. The taste of the meat is simply sublime, making this Montreal style Jewish deli another must visit for New York's Deli afficianado's.\n\nMy recommendation would be the 14oz. smoked meat sandwich on Rye.", "author": "Adeel K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-03", "description": "Their beef poutine is out of this world. I went in for lunch not really expecting much...it was probably one of the best lunches I've ever had. I got the small portion which was 13$ and it was definitely enough. So, so, so damn amazing. Definitely worth the price!", "author": "Faith B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-03", "description": "When I first heard about Montreal smoked meat, I confused the phraseology with an awkward camp caravan to Montreal when I was 15 and we went in the wrong door of a place and...well, you get the picture. This was a happy surprise to that visual.\n\nMile End is tiny, but potent. There are three long 4-person communal tables and one tiny 2-top jammed in the window. There are also seats at the counter where you can be served smoked meat. It's just all about the smoked meat. I actually overheard the guy telling a to-go customer on the way out, \"You are the proud owner of a smoked meat sandwich. Enjoy.\" That was awesome.\n\nI ordered the brisket (smoked meat) which comes on rye with mustard. It came out smelling like brisket heaven. One issue is that this sandwich comes on a tiny plate. I like a small plate, but the problem here is that the meat is so tender that it falls off the sandwich and when it does it skips off the other piece of bread and onto the table because there is little room for fallen meat. I actually found the sandwich to look small, but there is a lot of meat on it. I think the $8 for the sandwich is very fair.\n\nThe flavor was phenomenal and the texture was moist. Some of the pieces had tiny bits of fat on them that were so good. The crust of the rye bread was soft enough to not create an impediment, but the sandwich is a little messy. Luckily, you can just use a fork to scoop up the leftover smoked meat. OK, the ones that fell on the table somehow found their way back onto my fork - that table looked clean.\n\nI washed the brisket down with a Virgil's root beer which was really good. The service was attentive and very friendly. I really like when places are appreciative of people checking the place out and the server asked questions about where I heard about it and was so nice in general.\n\nMile End is worth a mile walk and then some. Special thanks to Deanna W. for getting the RotD for her review of Mile End, it tipped the scale to make me go and I am so glad.", "author": "Jonathan G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-03-31", "description": "Ok....this place wasnt awful...but it wasnt great.\nI was born and raised in Montreal. I've lived there for the first 20 years of my life and grew up eating poutine and smoked meat. I go back home every couple of months and make sure that I eat them both. NYC just cannot get this right. It drives me insane!! The owner is from Montreal, he should know what he's doing. I thought that the food wasnt bad...but only compared to what I have eaten in NYC. If this place was in Montreal it would have been closed by now for sure. \n\nMeat has a different flavor. Sandwich is small. Not terrible,,,but DEFINETLY not Montreal.\nPoutine: Fries were good. Cheese was good. Gravy was not. Who uses turkey gravy on a poutine? killed it for me.\n\nPomme frites and T-poutine are garbage. So I would say this is the best poutine I've had in NYC. But i just heard about Corner Burger in Park slope that serves poutine now. And i heard it was really good.", "author": "Mike M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-07-06", "description": "Mile End, I love you.\nThese warm n' friendly Montréal expats serve up a hearty helping of piping-hot poutine, topped with luscious hunks of their slow-smoked brisket. This plate pairs well with a coffee or a beer, and it takes me back to my favorite Fall days in Ottowa.\n\nUntil now, I'd had to schlep to Manhattan to get my póm frit fix; I'm lucky these folks opened-up 'round the corner!", "author": "Benjamin C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-11-23", "description": "Excellent Food!\n\nI ordered the lunch combo which was a corned beef sandwich on nice rye, great fries with poutine and gravy, a pickle and slaw.\n\nThe corned beef is excellent.  But the French fries are simple amazing.  Some of the best I have ever had.  The gravy was ok-I thought the fries were much better plain with the cheese or with ketchup.  The slaw was bland.\n\nThe portions are great but the prices are steep.  Quality food but high prices for the restaurant.", "author": "Alex R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-02-12", "description": "I'm in bed, but I can't sleep.  Maybe it's because my stomach is still hating me and getting over how stuffed it feels or my brain is still savoring the mind-explosion of deliciousness that was the food from Mile End.  Either way, it benefits you because I'm here writing this.  \n\nIf you've ever visited Montreal, you've probably been directed to get some poutine and thought it was magical.  Well with Mile End you don't have to wait until your next trip there nor do you have to settle for less-than-magical poutine.  I came here with two others and we ordered two appetizers, but each had poutine for our main courses.  The classic poutine came with mozzarella curds, mushroom gravy, and perfectly cooked and salted fries.  Someone in my party got the one version with smoked brisket meat, and it added a whole other dimension of deliciousness.  I regretted eating it, but I also couldn't stop because it was just too damn good.  \n\nWe ordered the chopped liver and knish for appetizers.  The chopped liver was a spread with egg and onion relish.  It came with a risen pletzel which was airy yet solid.  The chopped liver was great, but I could have passed on the knish.  \n\nWhen Zach, our waiter, came back and asked us if we wanted dessert, all of us said \"no, we're full.\"  When he left to get the check, we started mumbling that we wanted to try the dessert.  Zach came back and we told him that we changed our minds and he suggested the honey cake.  Let me tell you, the honey cake was damn delicious.  \n\nI think this might be my new favorite find in Brooklyn.  Definitely a great place that knows what they're doing and does it well.", "author": "Christopher T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-07-19", "description": "...Not overly seasoned, this is a deceptively light yet filling sandwich, with its unique flavors and textures--pliant pink slabs of meat with tongue-teasing, slightly burnt edges--it needed nothing more than the reliable platform of two slices of untoasted rye bread and a \"wink\" of mustard to shine....", "author": "Kerry C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-02-25", "description": "Best smoked meat sandwich I've had in the NYC area-- better than Katz's.\n\nBased on one sampling, I'd have to say that Schwartz's is a little better. \n\nMile End uses 'natural' (free range, no antibiotics, etc) meat-- a big plus--, while Schwartz's uses industrial grade. However, I found Mile End's meat a little drier than Schwartz's, a tiny bit over-salted, and the peppery/spicy flavor profile a bit overpowering, masking the taste of the meat itself. \n\nAlso, Schwartz's let's you pick the level of fattiness-- lean, medium, fatty-- whereas Mile End didn't provide this option. But this might just be because the waitress forgot to ask.  \n\nThe sandwiches, by the way, are a little small for the price (smaller than Schwartz's and other comparable delis)-- especially since they don't come with anything on the side. \n\nThe coffee was very good, coleslaw very good, fries okay. \n\nMy friend and I went on a Thursday during lunchtime. Nice, pretty, simple space with wooden tables, relaxed atmosphere, much more laid back than the always overcrowded and frenetic Schwartz's. The black Kafka-esque lamps extending from the walls are a little weird, a little too close to one's head, and potentially block the view of the person across from you. Coat hangers above each table a nice, convenient touch. \n\nOverall, the best smoked meat-style deli in New York, I'd wager. The space is pretty small, so I wouldn't be surprised if it becomes very crowded, with long lines waiting outside, within six months.", "author": "Svend E."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-10-22", "description": "Pains me to have to write this because I used to live in the hood when it first opened but this place has gone downhill.  The portion sizes don't fill you anymore, the prices have shot up and there isn't care with the food anymore.  I also went back last month and they had been shut down by the health department.  yikes!  get it together guys.\n\nTo top it off they get in flame wars with their customers on facebook and are charging more after the hurricane", "author": "Samson G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-26", "description": "Look, I'm only giving this four stars because I can only come here on Fridays when I'm home.\n\nThis place just about replicates Schwartz's (a Montreal deli which this place aspires to be), right down to Virgil's sodas. Truthfully, the smoked meat (a must-order when you come here) may even be better than Schwartz's - no small feat.\n\nI'm told by Noah, the proprietor, that they're looking to expand - at least so they can smoke more meat so they can stay open longer than 2-4 PM. As of right now, they never make it to dinner. Once they do, all of Brooklyn will swarm this place.\n\nDelicious.", "author": "Dave M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-25", "description": "I got in really fast as I was alone and sat at the bar. I wanted the breakfast sandwich, but I was hesitant because I always get breakfast sandwiches. The server assured me it was delicious and even better on a bialy. So I got that and it really was incredible. The cheese was just oozing out everywhere but it was soo good. However, I am disappointed to see when I received my bill, the bialy was an extra $2. Thanks for not telling me that server, or else I would not have gone with it.", "author": "Michelle S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-28", "description": "They have poutine! It is delicious, as was my burger It is a nice, different little neighborhood restaurant, definitely worth the trip. \n\nNote: They have little to no dessert options.", "author": "Mandie C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-11-08", "description": "This is a place you have to try. They smoke their pastrami, giving it a hint of that Texas flavor mixed into it. \nThis was one of my top three sandwiches in the NYC area. \nWhile you are there be sure to order the smothered fries, WOW!", "author": "Jason P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-01-16", "description": "Overall we thought the food was good, but not worth the money. We went here looking for a deli, and thought we would get some old school, large, delicious, fare! For about $25, we got one potatoe latke and a small brisket sandwhich...thats it. No pickle, no slaw, no nothing. The quality of the meat was good, but I thought I would be more impressed based on the great reviews I saw on here...I would not make a special trip here, too many better options around. Its also a tiny place, so if you do go and don't want to wait - off hours!", "author": "ZZ K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-03-06", "description": "Cool atmosphere (quite small). Nice people. Great food. Went on a Sunday afternoon and ate from the brunch menu. We had Pickles, Coleslaw, Matzo Ball Soup, Poutine, the Ruth Wilensky (smoked beef salami, mustard on an onion roll) and a Smoked Meat Sandwich (cured and smoked beef brisket and mustard on rye). Everything was fresh and served as soon as it was prepared. My favorite was the Smoked Meat Sandwich, in fact it was so good we got another one to take home. This place is straight up solid. They have a simple menu and do it right. Highly recommended.", "author": "Korye L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-05", "description": "This place is such a pleasure. I recently went to Montreal and became a poutine fan. Upon returning to Brooklyn I decided to search for some local versions of this classic Quebec dish. As far as I'm concerned this brooklyn poutine is more of a gentler , classier cousin to the late night sleaze bowls you can find at Frites Alors or La Paryse in Montreal.  The smoke brisket is made with care and it is an excellent topping for your poutine journey. If you don't like gravy, this place will most likely change your mind. \n\nIt's a bit small, so I would refrain from going with a party of 5 or more, otherwise you'd have to settle for some awkward seating arrangements.\n\n\nFood:\n\nSmoked Brisket poutine - $11 and excellent for two, even three people\n\nKnish - $7ish ? and comes with a side of excellent deli mustard\n\nSmoked brisket sandwich - can't go wrong here, same brisket and mustard , and it's seriously delicious/", "author": "Ken K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-04-07", "description": "Katz who? You no longer need to go into the city to eat at a good deli (unless you want tongue, chicken liver, or knishes) - Boerum Hill can proudly say we've got one of the best deli's in town!\n\nI've been there twice and was blown away by everything I tried, and since on my second trip they no longer had smoked brisket, it gave me a chance to try the fried salami and smoked turkey which were both truly delicious. \n\nFood, ambiance, staff, and value are all excellent - FIVE Stars!", "author": "Brodi B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-24", "description": "I have my friend to thank for taking me to this gem of a spot in Boerum Hill. Never heard about this place before and was excited to try it because they serve dishes I am very familiar with such as borsch and chopped liver (I am Russian Jewish). \n\nI'd like to start off with their matzah ball soup. It is the BEST soup I have ever tasted. Seriously. It was fresh, hot, and unbelievably delicious. I thought I was at home having my grandmother's soup, but this one was even better! Oh yea, it's that good. Their Borsch is good as well, but not better than my mom's - sorry. \n\nWe also got the Putin dish - fries with gravy and cheese curds. Omg, soooo good! And their smoked meat sandwich is also to die for. Basically, this place is rockin. Waitress was super friendly and cool. I'll def be coming back.", "author": "Helen B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-03", "description": "Canadian or not Canadian enough, Katz's or not Katz's.. I don't care!\nThis place is awesome.\n\nWent yesterday for a post New Year's recovery brunch and had a great meal.  The wait was about 20 minutes for a party of 2.  Once inside we were seated at the counter in front of where the smoked meat gets prepped into sandwiches, etc. (Extra hell yea for that one). \n\nWe ordered 2 sixpoints, 2 smoked meat sandwiches, 1 scone, 2  pickles, order of frites and an order of smoked meat hash...  As I write this, I'm contemplating saying eff work and just head down there.", "author": "Evelyn N."}], "servesCuisine": "Delis", "priceRange": "$11-30", "name": "Mile End Delicatessen Brooklyn", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "97A Hoyt St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/jL2-f-hVAwkXx5vELTD0RQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188527510"}