{"aggregateRating": {"reviewCount": 747, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-19", "description": "I really enjoyed going to this deli the first summer heard about it was on a munchies television show 6 years ago. I've been going there ever since I've heard about it. There corn beef sandwiches are to Rave for. I will definitely keep on going as long as my family lives in Brooklyn! \n\nDon't let the haters on yelp tell you otherwise but this place is phenomenal.", "author": "Sam A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-02-17", "description": "The food here is WONDERFUL. Love the matzoh ball soup and all the sandwiches. Truly wonderful and worth a reasonable wait. Definitely try this place out.\n\nHowever, gotta take a star off for the horrendous waits for weekend brunch (1 hr+ with no waiting area or texting system - unpleasant in the heat and cold). Space is small with very few tables - there are a lot of inefficiencies that could speed the wait up. Will for sure keep coming, just never again at peak.", "author": "Rose B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-05-29", "description": "We ordered take-out from Mile End and I was disappointed in my order. I had the Turkey Reuben and found that the sandwich was very bland..lacking in that \"punch\" that usually accompanies a Reuben-- turkey or corned beef. The sauerkraut was skimpy and didn't add a whole lot to the sandwich. The side of Cole was was dry and very bland-- and again, hardly generous! The potato salad was the same..very little flavor. I have had really delicious deli potato salad in other delis..this one was definitely sub par. The side green salads were tiny and definitely overpriced.. barely dressed and could be finished in about three forkfuls!\nDefinitely not going back.", "author": "Judy F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-01-13", "description": "This place is good, small, and cute inside. We were lucky and didn't have to wait to be seated. We got some of the classic sandwiches on the menu which were definitely satisfying. \nNot sure if I would recommend over other delis in New York, but the staff was helpful and friendly and overall experience was good!", "author": "Paige D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-23", "description": "I haven't seen my brother in years since he met his bitchy girlfriend so when she was finally out of town for once, my brother and I met up. We got high and decided to go see a movie but before showtime he took me here for lunch. We shared an order of Brisket poutine and the Big Jewcey. It was amazing! Definitely would come here again. 5/5 Stars all the way, as for my brother's girlfriend I'd give her 0 stars.", "author": "Phillip L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-24", "description": "Mile End is a cozy but unique establishment in Boerum Hill with Canadian influences, which I recently dined at for the third time.  My first experience was a bit on the disappointing side, although the latter two have more than made up for it. \n\nAs a big sandwich fan, I felt it appropriate to order the 'famous' Smoked Meat sandwich right off the bat. Frankly, the brisket did not taste fresh, nor did the sandwich fill me up. For $16, it was a letdown and quite boring. Fortunately, my girlfriend convinced me to give Mile End another shot, which is when everything changed.\n\nThe second visit we ordered Hoyt Dogs in a Blanket, Matzo Ball Soup, and Chopped Liver. All three of these items were tasty, although I took a particular liking to the Hoyt Dogs, which were a simple but delicious snack. \n\nThe most recent visit we went for breakfast, and finally gave the Larry David sandwich a try. While not exactly as described in the famous Curb Your Enthusiasm episode, the sandwich comes with Whitefish, Scallion Cream Cheese, and other ingredients on a bagel of your choosing. I personally really enjoyed the flavors, and would totally order this again. We also ordered the potato hash for $4, which were crispy and a nice side. The Arnold Palmer drink was very refreshing as well!\n\nWe'll definitely come back to Mile End in the future. I just hope that the other sandwiches impress, and that the first encounter was merely a fluke!", "author": "Rich B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-25", "description": "A Jewish Canadian deli?! Sign me up! I am a fan of the Montreal decor hung around this place, as well as their unique menu. Sitting at the bar is my personal preference - I love seeing all the dishes being prepared, as well as seeing the finished products.\n\nMy main complaint about this place would be the portion sizes. The pastrami sandwich my boyfriend ordered cost as much as Katz charges, but was not even half as big as their gigantic sandwiches. Unless Mile End either pumps up the size of their portions or drops the prices, they are really only hurting themselves - majority of negative reviews are all complaining about the tiny portions for the price and feeling ripped off, which I agree with.\n\nMy $60 order got me two glasses of wine, matzo ball soup, chopped liver platter, and pigs in a blanket, which actually ended up being enough to satisfy two people. The soup tasted fresh, the Hoyt dogs were fluffy and flavorful, and the chopped liver reminded me of my grandmother's recipe (hers is better, but Mile End's is actually quite decent too). Again, way to pricy for appetizers made out of such simple ingredients, but still tasty nonetheless.\n\nI still haven't gotten around to the Larry David sandwich, but it is a must the next time I'm here.", "author": "Nataliya M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-25", "description": "Mile end deli is a bit expensive, but an absolute necessity. Bagels and lox in a convenient spot between Boerum Hill and Downtown Brooklyn, it's the spot for breakfast. \n\nIt's a very small spot but there's a takeout window so you can just grab a bagel sandwich and eat it outside on one of the few chairs or bring it home.\n\nPics of the sandwich I got: https://instagram.com/p/BmYlQv2nljF/\n\nI also tried the Larry David - whitefish. Also super decadent and amazing. \n\nIced coffee is solid as well.", "author": "Mary A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-03-10", "description": "The food was quite good and the service was quick and friendly.  However, the place is very small and cramped so I'm glad for the efficient service so I can literally eat and run.  I saw the restaurant on one of those food shows and it got me excited. Not worth the commute for me but if you're a local, you should definitely stop in and try to avoid rush hour as you won't get a seat.", "author": "Catherine Y."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-03-06", "description": "The food here is delicious - I've had 6 experiences with their Classic Reuben Sandwich and I've been blown away 6 out of 6 times. Mile End is another neighborhood staple that should never go away. I can't speak to the wait times, as we've only ever ordered delivery - but having walked past it hundreds of times, I can vouch for the fact that this place is tiny (so definitely expect a significant wait if you're going for brunch). And as other reviewers have noted, it's pricey - but not any worse than Katz's Deli down in Dekalb Market at City Point. If you're jonesing for some Jewish comfort food, this place won't disappoint.", "author": "Faisal S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-30", "description": "My hubby used to work in NoHo area and we used to go to Mile End in the city very often. Now we live in BK and found Mile End in our neighborhood. BK location is very tiny but same great smoke meat dishes. My favorite is smoke meat hash.", "author": "Takako K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-03-26", "description": "Really good breakfast. Had the hash and eggs. Service was quick and friendly. I would for sure come here again.", "author": "Lin W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-20", "description": "This place is great and hit the spot! There was a bit of a line when we rolled up for Sunday brunch after a rough St Patty's evening, but we got seated within 10 minutes.\n\nThe host gets 5 stars for pleasant attitude and the open kitchen crew also deserves mad props for cranking out our order in 10 minutes. We were so hungry and really craved the Montreal style bagel. So good. \n\nThe dudes next to us ordered the poutine of the day and it was pretty awesome looking, so much so that I wanted to take a picture with my zoom lens on 2x, but deep down inside I knew it was unethical to post something I didn't order or try, so I will be ordering it next time when I come with more friends because its size is quite substantial and it is a thing of beauty.\n\nPortions are great, price is right, and above all, its delicious. We got the classic bfast and toast and the Larry David bagel. Bomb dot com.", "author": "Howard C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-11-18", "description": "This is a 3.5 star review.\n\nI keep trying the poutine and I keep being disappointed.  The smoked meat smells like it will be delicious - instead, each and every piece is fatty and tasteless, which doesn't even seem possible, but it is.  Matzoh ball in the matzoh ball soup was exemplary, and the broth was rich and good.  Still, the smoked meat is what its all about.  Give me a half of pastrami sandwich at Pastrami Queen any day.", "author": "Jessica D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-29", "description": "I am currently sitting in my car enjoying the hell out of a juicy, meaty, smokey brisket sandwich from Mile End in Brooklyn. DANG! It's moist without being a mess. It's not too lean. It's not to fatty. There is no overwhelming smoke flavor that overpowers the flavor of the meat. It's a really nice well balanced sandwich. \n\nThe bread is also perfect. I like a soft rye but it should also be able to hold up to the sandwich pressures. I also can't stand a dry and crumbly rye. This is perfect. I had to run but had I the time to sit in the restaurant id have added a touch more mustard BUT that is personal preference. It's no reflection on the sandwich. They also put mustard in both sides of the sandwich which I love. Not a big glob on one slice but two moderate amounts in both sides. Way better flavor balance.\n\nI knew the sandwich would be huge so I didn't get chips. I wanted to enjoy the sandwich. However, I had to get the sour pickle. Again...perfect. Great flavor and great crunch. I hate mushy pickles. These were perfect AND you get a whole pickle. Not just a slice. \n\nAll in all I would highly recommend going here. Can't wait to come back. Also, as an FYI - I had a black coffee this morning and it was good as well.", "author": "Peter D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-12-28", "description": "Location: Mile End Delicatessen has another spot at Brooklyn! I have never been to the one in Manhattan but I assume that this one is as small as the other in Manhattan. It seems like a jewish cuisine place.\nThey have an open kitchen and you can order to-go at the counter.\n\nFood: I had the chicken xxx BLT sandwich. It is pretty tasty: chicken is crispy, sauce is delicious, and the bread is great. The only bad part is the sandwich is very dry.. I have to eat it with water or I think I might be choked. \n\nPrice: 15+ for a sandwich. It is expensive tho.\n\nService: great!\nOverall: I think it is a great experience for some Jewish Cuisine. 3.5 stars.", "author": "Tina W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-04-30", "description": "First things first: The Poutine was delicious. For you Americans out there, it's basically an all american meat and potatoes meal, but in a blender. Really though, tasty, and with a nice $4 Labatts to each it down I felt almost in Canada. \n\nIt's a tiny place, doing mostly a lot of take out business on the weeknight i visited. I got the feeling that they didn't fully have their act together. They were out of the monthly special even though the place was empty, the cashier/waiter seemed a little flustered, and the music felt like some bad Pandora mix. It had a bunch of new hipster stuff that nobody recognized, but then some classic rock, mostly softer stuff like Paul Simon and George Harrison. Seems like they could add some good ole Doobie Bros and the place would be improved.", "author": "Tom J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-19", "description": "I had lunch in this tiny Jewish Deli eatery on a recent visit to Brooklyn. It was all good. I had the ruben on pumpernickel (yum) with a side of poutine. In 61 years, I had not ever even heard of poutine, so that was something different. Poutine is french fries with gravy and cheese curds-- apparently thats a Canadian thing? They were good, but I would probably stick with regular fries in the future. The pickle on the sandwich plate was extra good. The ruben was top quality--very tasty. Decent service. The bill for three of us was in the $40 range (the ruben was shared).", "author": "James S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-10", "description": "These were some of the best latkes I have had in quite some time and smoked meat is hard to come by outside of Montreal. \n\nIt's small, but that is part of what makes it great. I want to go back and try all the things. I'm conflicted because I also want to have exactly what I had today over and over.", "author": "Lilly N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-03-19", "description": "Love the vibe here. Got the smoked meat poutine which is the ultimate comfort food. I just want to move into the neighborhood and get a dog and eat at Mile End all day everyday.", "author": "JW D."}], "servesCuisine": "Delis", "priceRange": "$11-30", "name": "Mile End Delicatessen Brooklyn", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "97A Hoyt St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/jL2-f-hVAwkXx5vELTD0RQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188527510"}