{"aggregateRating": {"reviewCount": 747, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-08", "description": "Had an early lunch here while I was shopping on Atlantic ave. The space is beautiful and bright--the perfect morning stop. I had their basic bagel and lox sandwich which was really nicely balanced. I sometimes find the Russ and Daughter's bagel sammich to be a little too heavy on the bagel. The Montreal style bagel here with the ample sesame seeds was light and flavorful, but really let the lox, cream cheese, and capers do the talking. I convinced my friend to get the white fish salad and it was almost gone before I got a chance to try it. The service is fast and friendly. Also, stumptown coffee--delicious!", "author": "Ceda X."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-06-04", "description": "POUTINE. This one dish from Mile End made me seriously contemplate packing up my bags and moving to Brooklyn. The smoked meat was incredible, and matched well with the crispy fries, gravy, and cheese curds. We also ordered the white fish salad - which was also out of this world. The one downside to this place was the wait - we arrived around 3PM on a Sunday and there was still about a 30 minute wait (others right before us had waited up to an hour). That being said, the to-go line seemed to move fairly quickly! Will definitely return - even if it requires dragging my lazy ass out to another borough.", "author": "Anne L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-04-24", "description": "I love Mile End in Brooklyn. I love delis and pastrami and french fries and cute, friendly servers and staff and awesome bathrooms and communal tables and mom and pop type shops and this place has it all. \nMile End is a Montreal style Jewish deli; they don't have pastrami, they have smoked meat. It is just like pastrami; big bold flavors, crusted with pepper and smoked, served on rye bread with mustard, it is a fabulous sandwich! They also have the best poutine I've ever had. Poutine is a French-Canadian thing; french fries with gravy and cheese curds. The Mile End version is killer, house made gravy, with salty cheese curds and perfect french fries. They do a poutine with smoked meat in it, I'm getting that when I go back. \nAlso had the chopped liver and I gotta say it spoiled me, every other chopped liver pales in comparison. It is perfection. \nI have only been here once, but its the kind of place where you just know everything they do is with love and passion. I cannot wait to move to Brooklyn and be a regular here.", "author": "Ricky R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-23", "description": "LOVE this place!!! We went during Superbowl which was brilliant as there were free tables for a change as this place is always packed. I ordered the borscht soup with a side of sprouts and my friend had the matzo ball soup, liver-concoction (which was apparently good) and a side of pickles. I can only testify for the vegetarian options which were all divine and apparently the carnivorous plates were equally good. We sat at the counter which was great as we were able to see the chefs preparing the food, including the meatastic sandwiches which looked amazing. I'm glad this place is in the neighborhood as the staff are lovely, the food is delicious and it's so cosy. We have a WINNER!!", "author": "Lisa C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-03-15", "description": "Okay I had no idea that Poutine existed until I heard about \"Mile End\". Almost 50 year's and I've been missing out on the most amazing( \"Holy Crap\" as my daughter exclaimed when she saw the texted pic) mess of fries swimming the backstroke in mushroom gravy, with chunks of cheese curd melting it's way through making for a gooey delicious extascy. Now wait let me just say here I normally don't eat beef or pork, haven't really eaten either in the last 15 years. But well....on occasion I will indulge on the one thing I really miss Corned Beef (if it's really cooked right and worth it, which isn't very often) So I hear this place cures it's Brisket for 12 days then slowly smokes the meat. Okay I'm gonna have to make an exception because not to try their smoked meat is a crime. \nSo we order the Poutine with Meat for the two of us and then each have a bowl of Matzo ball soup. The soup was good, but I've had plenty of Matzo ball soup. \nThe Poutine with Meat that's what I'm talkin' about! Hello Lover! That meat is so tender and smokey in flavor it just melts in your mouth and those fries with the skin just dripping with mushroom gravy and chunks of melty cheese, well I just died and gone to heaven (could be hell for that's a Cardiac disaster and I work in a Cardiac Unit) but who CARES! EAT THEM! LOVE THEM....I also scoped some dude's meat sammie and it was super sky high with meat and looked damn delicious. The place is small and my husband and I got lucky and were able to share a table with another two women. They have a clean bathroom (score!). And the service was great!", "author": "Susan D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-23", "description": "A better version of Katz Deli without all the tourists. This place is tiny though, so I don't know how crowded it can get. Went with the smoked meat sandwich (brisket) + pickles and coleslaw on the side. Nothing else was needed and I was satisfied for the rest of the day. I now dream about this sandwich.", "author": "Heather F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-10-10", "description": "This is a great establishment. It's always such a pleasant walk and service is friendly and quick. Delicious brunch options-- get the whitefish salad! It reminds me so much of Schwartz's in Montreal- which is wonderful! My only complaint is the super super long wait...", "author": "Jennifer C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-12-28", "description": "This is not a deli - its a restaurant, and it's not a real restaurant at that.  Its kind of like judeo-canadian fast-food.  At Mile End they serve you in 2min, you can watch them prepare the dishes as you wait because of its limited ambience, a Taco-Hut sized single room that serves as both entrance, kitchen AND dining room. Everything is pre-made, pre-smoked, pre-brined and pre-schmaltzed and a lot of the items are served cold.  I saw them take my soup out of a can, but not in the way they do it with the canard en conserve at Au Pied de Cochon, the way a lunch lady who looks like Jonathan Schwartzman would do it.  I tried to alter the salad I ordered, switch this for that. It was no-go, they only have One s*l*d on their menu and unfortunately for me that salad was \"Poutine-ized\", it came in a bowl with warm butternut squash soup poured on top. Beware, their menu is extremely limited, look it up before you go.  When I asked the lady at the register who took our dinner order if I could order an additional dish, she flatly told me \"I don't work here anymore.\"  I guess her shift was over.", "author": "GgMonkee S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-10-29", "description": "I had read about this place frequently so I finally made the trip. The food was very good. I had the salami on an onion roll. I thought the sandwich was a little smallish for nine dollars, so I'm glad I went with the fries to go along.  That being said, the sandwich, fries and pickle was filling enough. Overall I was pleased and the service for a busy lunchtime crowd on a Friday. I was seated at the counter and watched them make the brisket in front of me, so maybe I'll get that next time.", "author": "Larry F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-02", "description": "Just ate here two days ago, and I'm ready to go back.! A perfect meal (almost). Start out with the red cabbage cole slaw,  a sharable platter of poutine (fries topped with brown gravy and cheese curds), an absolutely delicious and tender smoked brisket sandwich (7 or 14 oz.) and wash it all down with $3 bottles of Labatts. Only quibble - $9 for a side order of golden beet(s) with leeks? Seemed to contain only one beet. Is it real gold?\nGreat, friendly service. And you can actually find parking space on Hoyt Street, at least on a Sunday. Small place, go early or late, but go!!", "author": "Cliff L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-07-29", "description": "I found brisket in BK!!!!  The brisket sandwich with mustard was great.  The matzo ball soup was fine, you could tell it was homemade but too salty, so beware.   I was alone so I didn't try the Poutine (fries with cheddar and mushroom sauce), but it looked damn good.   Lastly, a $3 Labatt  and I was all set.  I'm definitely going back to try more of their smokes meat sandwiches.", "author": "Bram D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-28", "description": "LOVE the poutine. Smoked meat here is phenomenal as well... smoked meat poutine is heavenly. But unless you're training for a heavyweight bout you probably won't be able to polish this off solo. Bring a friend with you to share, especially if you didn't make reservations because if you didn't you'll be waiting at least a half hour on weekends.", "author": "Chris P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-23", "description": "yum yum yum. I love this place. I wish they had a bigger seating area so could come everyday and bring all my friends. The chicken salad on challah is a must have! Seriously, it's so good. I interrupt my daily activities to think about it sometimes. The grandpa sandwich, which was recently featured in New York magazine, was also good, but a bit on the dry side. That's turkey for you. But seriously go for the chicken salad.\n\nI still don't know how I feel about poutine so I don't know if I could be a fair judge on Mile End's version. I find myself pushing away the curd to just get to the fries and gravy, and I know that's not the point. The fries are definitely crispy and perfect, so at the very least, be sure to get a helping of those!", "author": "Marianne S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-01-25", "description": "As a former Montreal resident living in the states for several years, I'm happy that I no longer need to reach for my passport when I want one of the best bagels in the world. \nYou, your bagels and smoked meat are a very welcome addition to Brooklyn.", "author": "Lady B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-04", "description": "This is the smoked meat sandwich of my dreams. The meat is hand-carved to order and piled high, with lots of love from the owner. And the poutine, well, who doesn't like poutine? This is the small neighborhood eatery that you can't help but cheer for. Yay for delicious and copious amounts of tender smoked meat! It's most definitely worth the trip out to Brooklyn.", "author": "Kim T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-04-11", "description": "A brisket sandwich with pastrami sensibility.  The poutine was poutiney as can be. Only downside was the hour wait and the pickles were almost too salty. . .even for pickles.  Over all, an fine meal. The guys at Epic Meal Time would dig this joint.", "author": "Bryn W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-11-18", "description": "The smoked meat is pretty good. In fact, I like ti better than the smoked meat I had in Montreal. It has that backyard, Weber Bullet Smoker taste that I like so much. Plus, it's juicy and has a nice layer of fat on top. Their in-house salami is decent as well. It's (if I remember correctly)made from chopped and pressed smoked meat and roast beef and is speckled with coarse black pepper. I suggest that if you get it on the onion roll, you get it plain rather than with mustard, which seems to over power the sublime taste of the salami. Skip the pickle, unless you like them sugar-sweet. The coleslaw is okay, it has a strong vinegar base mixed in with the red cabbage.", "author": "David B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-04", "description": "I came here for lunch yesterday about 2:30pm.  There were about 5 parties waiting in front of me.  The place is small but quaint.  The menu is short but everything smell really good.  Portions were generous and actually it taste really good.  I've been a huge fan of the way they made smoke meat sandwich in Montreal but I haven't tried anything comparable in NY.  I ordered the smoke meat sandwich here and surprisingly it was up to par.  The poutine came with heavy gravy and smothered with cheese.  It was a bit on the oily side but still very good.", "author": "Chupah C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-03-12", "description": "This place is a sham.  First off, the St. Viateur bagels trucked in from Montreal are about 3 days old and stale.  You can ask for a non-toasted bagel but, because they are stale, you are told to get it toasted so you don't taste the staleness.  You can't buy a bunch of bagels and take them home either.  The poutine is not very authentic either.  The space is cramped and totally not worth the bother or wait.  The prices are way too high for a dump like this.  NEXT!", "author": "John P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-01-26", "description": "I speak from experience after having lived in Montreal for 3 years and eating at Schwartz's 3 times a week or more.  Mile End is on the right track but needs some work.  The meat was good not great.  A lot of that has to do with the slicing.  Pieces where too thick and tended to fall out of the sandwich.  \n\nThe place the most work is needed but can also be easily remedied is in the mustard department.  Their homemade mustard was AWFUL.  Very coarse (almost like chomping on seeds) with little flavor.  A true Viande Fume (smoked meat sandwich) goes best with a basic yellow mustard.  I love coarse and spicy mustards as well but their house option just does not cut the ....\n\nFries were good but pricey ($5) and they don't have pickles or pickled tomatoes yet.\n\nLooking forward to going back once that mustard issue is resolved.", "author": "Jeff G."}], "servesCuisine": "Delis", "priceRange": "$11-30", "name": "Mile End Delicatessen Brooklyn", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "97A Hoyt St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/jL2-f-hVAwkXx5vELTD0RQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188527510"}