{"aggregateRating": {"reviewCount": 747, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-01-27", "description": "Finally a place to get my Montreal bagel fix in!!  I definitely recommend the delicious bagel with cream cheese, sliced tomato, red onion, smoked salmon, and capers.   This place is a little Boerum Hill gem.  I can't wait to try the meaty goods next time around.", "author": "Katie L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-10-11", "description": "great smoked meat-tender, peppery, moist. a real sour pickle-not for the faint of heart. tiny seating area and the staff is a little overwhelmed, but the meat makes up for it.", "author": "michael s."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-24", "description": "everything about this place is nearly perfect.  the space is small but designed cleanly and efficiently.  the menu is interesting, the food is great, the service is friendly and smart.  matzoh ball soup and borsht is awesome.  a great addition to the neighborhood.  the only weakness is the coffee situation - often its crowded by the coffee window and it seems a bit disorganized.  but that would never stop me from coming in every weekend.  nicely done Mile End.  I hope you stay for a long time.", "author": "Lee T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-06-16", "description": "great sandwiches from some really nice guys (an ex law student i think?).  got a lox bagel at the brooklyn flea and headed over to their joint later that night for the smoked meat.  both are good", "author": "Marks J."}], "servesCuisine": "Delis", "priceRange": "$11-30", "name": "Mile End Delicatessen Brooklyn", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "97A Hoyt St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/jL2-f-hVAwkXx5vELTD0RQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188527510"}