{"aggregateRating": {"reviewCount": 23, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-09-14", "description": "Hua Long wins the award for Most Improved Chinese Restaurant in Fort Greene. Usually once a Chinese restaurant's built it will stay the exact same for however long it exists, and Hua Long used to be the saddest, grimmest, grossest Chinese place in the neighborhood, at least since Best Wok closed five years ago. It was the type of place that was so bad you'd feel legitimate pity for anyone you saw eating there, or even working there. Sometimes I'd walk past it, seeing it open late at night, manned by a single severely pregnant lady squirting orange sauce into a baggie of fried chicken, thus constituting one of the more vaguely depressing sights I've seen in my life. I tried the food a couple times, and that was enough to make the easy decision to never eat there again.\n\nHowever, at some point, Hua Long had some significant renovations done to their store, and improved the food right along with it. Whereas once it was grimy, gray, and dim, the store is now very well-lit and possibly the cleanest Chinese takeout place I've ever seen (for what that's worth). The transformation was so significant that I decided the food deserved another shot. And overall, it really is an impressive improvement--everything's much less greasy, and is just plain better made, leaving me with only nitpicky complaints. The General Tso's could've used a bit more sauce, but what was there was pretty tasty. The fried dumplings are almost comically big, but not bad, and while the chicken w/ black bean sauce was a bit too water-chestnut-heavy (bleah) for my tastes, it too was pretty good. Ultimately, it is still, y'know, cheap Chinese takeout, but Hua Long is now actually a legitimate option for such food in the neighborhood, instead of being that disgusting place you hurry past and kind of wish would close down and be replaced with a yet another bodega or something. It's as if this restaurant saw the big speech at the end of Rocky IV and said to itself, you know, that sweaty Italian midget with the broken jaw mumbling about change is right.", "author": "Galvin C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-07", "description": "Good chinese food in my opinion, I've never been disappointed.  By the way folks It is chinese fast food after all, not a true reflection of traditional chinese cuisine and it's take out.....not Cipriani, Masa, Babo...etc.  With that said I like Hua Long.  I personally have tried other chinese restaurants in the neighborhood and I prefer this place.  I also have lived in Ft. Greene for about 8 years so I would know.  They are fast, convenient and the food just taste's better than other chinese restaurants I have tried around this neighborhood.  The main reason that I will give this place 5 stars is because the people are really nice and warm.  Good customer service always wins me over.", "author": "Amy M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-09-13", "description": "Can't complain about this Chinese take out place. Pretty standard fare. Friendly service. Mostly just take-out. There are two small tables with four chairs each.  Sometimes people sit down to eat, but most of time they're just waiting for their food.", "author": "Alexis A."}], "servesCuisine": "Chinese", "priceRange": "Under $10", "name": "Hua Long Chinese Restaurant", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "706 Fulton St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/Szz3rZKfyTf8HNKqo_mc7Q/ls.jpg", "@type": "Restaurant", "telephone": "+17188755362"}