{"aggregateRating": {"reviewCount": 23, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-06", "description": "Had a date..,and we went here for a quick bite.\n    Great service,  and you can sit in the chairs..,and people watch while you eat.,looking out on Fulton Street.  They make adjustments for most of the foods...,and the PRICE is worth it. \n      I'd definitely come back!\n     It would be great if they sold some Asian Beer..,or a few American selections. \n\n      Size portions are great for the price as well.\nService = 9\nAmbiance = 8", "author": "Judah H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-05-26", "description": "DONT ORDER ANYTHING. These guys should be embarrassed to call themselves a Chinese restaurant. Ordered chow mien, which is fried noodles and literally translates to \"fried starch\", but contained no noodles. Everything else was shit too.\n\nYour parents are disappointed", "author": "Julian C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-05-25", "description": "I ordered chicken chow mein and got a chicken with vegetables. With no NOODLES. The worker had the audacity to tell me that chicken chow mein is chicken with vegetables and no noodles. Then told me I should have ordered lo mein because that has noodles. PLEASE GOOGLE CHOW MEIN.", "author": "John P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-04-24", "description": "Called and ordered 4 separate orders of shrimp dumplings for lunch and received dough filled dumplings with no meat or vegetables. Will never be ordering from here again.", "author": "Kaniz F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-10-05", "description": "I was in the area and wanted to grab some food that wasn't just a small bite. I remembered this Chinese spot from when my husband whom was my boyfriend at the time worked around the corner. I came to visit him one day and of course got hungry and he told me to try this place. I really liked the barbecue rib tips with fried rice and their french fries. Although I do not frequent here when I am in area it is still a good place to go for decent chinese.", "author": "Serina J."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-25", "description": "Walked in, pleasant service, order and food arrival both quick, appreciated the free cokes. Food was a mixed bag, some good, some not so much. Liked the wings and black bean beef, fried rice not bad. Shrimp rolls filling was nice but the pastry needs work. Sweet and sour chicken was dry and sauce was plain and too sweet. Would go again for rice with black bean beef and give the rest a miss!", "author": "Mews C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-16", "description": "This restaurant have been around for a very long time their food is fresh and delicious. Always a pleasant experience. The dumplings are yummy and so are the chicken wings and rib tips. Pretty much everything is good here.", "author": "Julie J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-21", "description": "I need to bring up the average rating of this place! We walked in on a Friday night and it was almost midnight, but they still took our orders anyway. The counter guys were v pleasant and smiley. Got the Dragon and Phoenix combo to go ($14), came with white rice and a spring roll. The combo consisted of sweet and sour pork and a broccoli/shrimp stir fry--great for two not so hungry people. Not too salty, not too greasy. The spring roll was shockingly tasty too; the filling was actually edible and fresh!\n\n I've had a lot worse and Hua Long is def one of the better Chinese food places I've had. Cash only of course.", "author": "Annabel T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-07", "description": "My go to. They're always so nice, always so friendly. While some of the food may be under seasoned I've had a few of their vegetarian/vegan options and I couldn't complain. Fast delivery and hot food. The only reason I stop ordering for long periods of time is because of diet but oh boy, just like mom jeans - I always come back.", "author": "Lola C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-19", "description": "There attitude sucks. They completely messed up my order. They also sont serve most people. The food is nasty. I asked for a simple order from them. They act like they do not want to take the order. \n\nThey also snatched the money you give them, and they completely roll their eyes. \n\nA friend of mine told me also, they did not want give him his change from his order. And they demand a tip.", "author": "Mark S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-10", "description": "Idk what it was like before because I never went in until (long after?) they reopened but Fort Greene is really lacking when it comes to Chinese take-out and this is my go-to place. I have a refined palate so I get the same thing every time- fried chicken and broccoli with brown sauce. They don't disappoint. It's less likely I'll try anything else but I think the food is good and very reasonably priced. If this were a sit-down restaurant, I'd mix it up but with my palate, I prefer to play it safe. The other local Chinese place is overpriced and not very good. Plus the person at HL is very pleasant. I hope Hua Long is around for a very long time.", "author": "Lanie C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-22", "description": "I had a great meal at Hua Long restaurant. The prices were very reasonable and it tasted delicious! I was so happy to have carrots in my chicken and broccoli.", "author": "Bianca B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-18", "description": "This review is for the chicken fried rice, which I eat almost every day, and the staff.  Tasty, fast and hot food at a great price, served by friendly people.  Thanks!", "author": "Sara H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-11-12", "description": "When it comes to Chinese take out places, Fort Greene is sorely lacking. Hua Long is perhaps the best (and cleanest!) option you have this side of the neighborhood.\n\nI just had Bean Curd Szechuan style, which was cooked with carrots and peas. Was it bursting with flavor? No, but for $8.50 it was a very generous portion that can feed 3 people. And you know what? It wasn't that bad considering it was tofu[1]. And it was nice and spicy the way I like it.\n\nThe fried scallops with vegetable fried rice ($5) exceeded my expectations. The scallops (8), although not particularly flavorful[2], were fried well (not oily at all, although the exterior could have been more crisp). The fried rice was actually delicious: the grains were perfectly separated and had a nice chewy consistency; the peas were sweet and the bok choi nice and crunchy. Definitely the best part of the dish[3].\n\nTheir hot sauce is unfortunately mild. Skip that and use the Sriracha you have at home.\n\nThey're open until 10:45 pm Sunday through Thursday, and until 11:45 Friday and Saturday.\n--------------------------------------------------------------------\n[1] Not a big fan of tofu. Although stinky tofu....\n\n[2] Which, to be honest, is to be expected at a Chinese takeout place like this one.\n\n[3] getting all excited about fried rice... I am so hopelessly white :-(", "author": "Matteo R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-03-31", "description": "This use to be my favorite Chinese Restaurant in Fort Greene, but not anymore. They were closed for a couple of months and I have been there a couple of times for take out - since they reopened -and each time, the food got worst, not better.  I dont' know what's happening, this has to be the worst Chinese food I have ever eaten. I ordered Chicken with fired rice and the rice was gummy,  overcooked and tasteless. I called to complain and the person who answered the phone, just told me to add Soy Sauce to the rice and it will taste better. I did and it didn't make a difference. I am gonna miss Hua Long because it will be a long time before I go there for anything....So long, Hua Long.", "author": "Oswaldo C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-23", "description": "This restaurant just reopened after having been closed for quite  while  because of a fire.  \n\nThis is the best of the Chinese take out places in the neighborhood.  The food is fresh, pretty well cooked and pretty inexpensive.  Portions are generous. Special requests, such as less oil or salt,  are usually honored.\n\nGlad they are back.", "author": "Clifford F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-08-07", "description": "I was headed to a meeting I was pretty sure would have food but I was too hungry so this was the first quick place I saw.  I ordered a shrimp egg roll (my standby lately for a  quick Chinese snack)..  There was no one else waiting but perhaps they had some deliveries to make because I saw they were making a lot of food.  \n\nIn 5 minutes I got my order. I asked for hot sauce instead of the offered duck sauce and it was given to me.\n\nThe shrimp roll was nice and hot, lots of shrimpyy greasy deliciousness.", "author": "Suresh D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-06-28", "description": "As always, whenever I move into a new 'hood (even if it's a temporary move), I must try out the available mistresses in the area (aka: the available Chinese take-out spots which keep me warm on those dark, lonely nights in my apartment...). \n\nFor our temporary stay in Fort Greene, Margot G. and I opted for Hua Long after an extended Yelp search (seriously, what do you people DO for Chinese take-out because there didn't seem to be many options!). We opted for a full order of orange chicken, which came with white rice + an additional small order of fried rice. There's definitely nothing spectacular about the food, and it takes a little while to arrive via delivery, but it's definitely cheap and it does the job when you're looking for a fried/greasy food fix.\n\nI'll probably look around a little more for a regular spot, but in the likely event that I don't find one, this will probably be it for the next month or so.", "author": "Shea D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2007-09-16", "description": "This restaurant is right in my neighborhood.  At least once a week I stop in for the Lo Mein, fired chicken, or one of the combination platters to go after work.  \nThey are mainly a carry out/deliverly service.  This is a small family run business and the owner is very nice.  The service is friendly and the portions are very good.  All the dishes I have had has been very tasty without any MSG or other artificial stuff.  They make food right to order, even if is not something on the main menu.\n\nOne day I was a few cents short on my order, the owner let me make it up the next time I was in.  This was kind.  But I know he would only do something like this for regular customers.  \nSo if you live in the neighborhood or even just passing through, you may want to stop by this place and give them a taste.", "author": "Catie L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-08-28", "description": "Probably the most decent Americanized Chinese takeout place in Fort Greene.  It is inside, open late and the food taste ok.  I had a Bean Curd Szechuan Style ($8.50) and it has some spice and went down easily.", "author": "Kevin G."}], "servesCuisine": "Chinese", "priceRange": "Under $10", "name": "Hua Long Chinese Restaurant", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "706 Fulton St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/Szz3rZKfyTf8HNKqo_mc7Q/ls.jpg", "@type": "Restaurant", "telephone": "+17188755362"}