{"aggregateRating": {"reviewCount": 485, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-20", "description": "We stopped by after helping my sister pack up her apartment. The food was good, but the soft crab shell sandwich was supreme. I did feel it was slightly overpriced. For the Gilmore Girl fans, think of it as a step up from Luke's Diner.", "author": "Krys J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-12", "description": "Great food and got a table for two within 10 minutes on Saturday at 11:30am. Service was friendly, and the eggs benedict on point. Classy decor, will definitely visit again!", "author": "Faiza C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-11", "description": "This is our new \"local.\" Just a 15 minute walk from our place, have been twice now with my husband, and the service is consistently great as is the food. The first time we had the artichoke dip, the grilled octopus, the deviled eggs and the burger plus a few glasses of wine. The artichoke dip is a must - chunky artichoke smothered in pepper jack cheese and grana padano with perfectly toasted crostini. The only drawback is you'll like this so much that you'll eat too much and get full before the other yummy food comes! The octopus and deviled eggs were good but not memorable, but the Walter burger on a brioche bun with friends that are skinny and crispy and just the right amount of oily served with ketchup, mustard and mayo is a must. The second time we returned (all within one month, rare for us!) and got the artichoke dip again, the baby back ribs with red cabbage cole slaw (personally would skip this) and the grilled bar steak, also served with the same delectable fries and with horseradish cream and chimichurri. There's no question about whether we will return - the only question will be steak or burger, and you really can't go wrong with either. Definitely make a reservation (taken on Resy for dinner but not brunch) and given the tight quarters probably best for groups of 4 or smaller.", "author": "Alice C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-08", "description": "Our entire table had the chicken and waffles. Really good!! Tried the fresh lemonade but it was too too sour and we didn't even finish it between 2 people.", "author": "Emily K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-14", "description": "This place is a local staple. The menu has plenty of snacks and very suitable meals. The cocktails are inventive yet known to all. It's a great space. Try to get Kevin at the bar. His service is superior. Till next time...", "author": "Beer S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-27", "description": "had a fantastic brunch here, both for the food and the overall experience. we got there on a busy sunday morning but were able to get 3 seats at the bar within about 20 minutes. there are a lot of great menu options and i was super excited that there was a breakfast sandwich  with sprouts and goat cheese, and they were willing to serve it with an english muffin for me, rather than brioche. i appreciated that he did did warn me it might fall apart, so i was happy that they allowed the substitution but with consideration for how it might impact the dish so i would not be disappointed.\n\nthey also have kir royals which are my favorite, served with a lemon twist garnish. a notable experience was that when i was partway through my drink, the bartender accidentally knocked it over. not only was he extremely apologetic and good at cleaning it up, he remade me a new one AND gave our group a whole free round (3 of us) following. the bloody mary's were also spicy and delicious.", "author": "Jamie H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-11", "description": "Went here on Saturday jul,8,for brunch on my boyfriends birthday we both had egg Benedict with hash potatoes and salad,I had the smoke salmon,he had the steak ham,I must say it was the best egg Benedict I ever had,I must say i was very happy with this place and their deli ious food,every time we drive past this place it's always people waiting,we had prepared ourselves for a long wait but we went later on in the day,so we got seated right away,the waiter was so attentive and nice,small place,but I loved the atmosphere,I would definitely go again", "author": "Monique B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-22", "description": "As a good friend once told me, you can really make a meal at Walter's what you want - there are options to stay on the cheaper side or you can ball out with fancy cocktails, oysters, and steak. We went with the latter. For dinner, I highly recommend the steak. It was cooked perfectly and seasoned well - a bonus is that it is served over a huge plate of salad and crisp french fries with a tangy chimichurri sauce and a delicious horseradish sauce. I wish I could eat this steak every night. It's that awesome. \n\nI've been for weekend brunch, as well, and enjoyed it just as much. The blackened catfish and cabbage slaw on a kaiser roll is delicious and dripping with spicy tartar sauce. Also good is the shakshuka and the eggs benedict. I really do not think you can go wrong at Walter's. Great food, a well-decorated and lovely setting and nice service. I've always enjoyed it and never had any problems!", "author": "Sol C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-01", "description": "First brunch then dinner\n\nMini muffins served with brunch. \nChicken and waffles is superb!  The chicken is crispy on the outside and moist on the inside.  Dip in the syrup or hot sauce. Waffles are pillowy.  My cucumber mint lemonade was more sour than cucumber of mint. \n\nArtichoke dip is cheesy with a tiny little kick  toast points are crispy and dip helps it all become gooey goodness. Duck buns are more with shredded meat but still warm and delish. Husband burger was plump and moist but outside was just a tad burnt. Fries are always excellent \n\nChocolate banana bread pudding was warm, soft, moist, and delicious!", "author": "Thy L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-09", "description": "Wow,wow,wow!! Walters was amazing. I started with the honey suckle, so delicious- white rum, lime and honey!! Light and not too sweet (my main\nproblem with most cocktails), the boneless ribs were so tender and the flavors exploded in my mouth! The French fries were hot and perfectly salted, carrots were seasoned with a hint of lime, and the salmon with kale was grilled with cherry tomatoes, kale had just the right amount of lemon. I have to go on...flourless chocolate cake was so delicious! All of this food was under $100, AMAZING SERVICE, food came out steaming hot, perfect timing, amazing staff. I am not easily impressed. Walters was the best dining experience I have had in a LONG time. Recommend 100%.", "author": "Sandy A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-07-04", "description": "tl;dr: decent brunch options, variety of interesting brunch cocktails, but food lacked in flavor and prices are steep!\n\nWent to Walters with a group of friends and had some cocktails while we waited for the last member of our party to get there. The Gin Fizz was light and refreshing, I would definitely recommend it, although the price was a little steep (around $11+).\n\nI ordered the huevos rancheros, which was altogether mediocre. Decent helping of guacamole on top, but overall the dish seemed to lack seasoning and the entire plate itself was lukewarm in temp. Hubby ordered the french toast, which was rather on the drier side. However, the maple syrup was citrusy and delicious and the accompanying fruit was tender and savory, so we did enjoy it.\n\nOverall, I thought our meals were fine, but nothing that would make me eager to come back. Also our bill ended up being $62 between the 2 of us for two brunch entrees and two cocktails, so a little steep in our books.", "author": "Cecily S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-05", "description": "Oh the chicken \u0026 waffles are so worth the sometimes long line. Flavorful, crispy,  golden brown, served with fresh waffles \u0026 maple butter....YES...YES!! However today, was all about the body mary. Perfectly fresh, perfectly spicy \u0026 in this case one, was enough to create that nice little buzz. The bartender was friendly with out being in my space. \nIf you like Sunday Bloodys...this is a place to try.", "author": "Lisa B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-14", "description": "One of my very favorite places in all of New York. The food is always excellent, but what keeps me coming back (nearly every week) is the warm and friendly atmosphere and the excellent staff. Walter's is truly one of the gems of Fort Greene.", "author": "Hannah R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-09", "description": "I had only come in for brunch previously but went here for dinner last night and sat at the bar with a girlfriend. Brunch has always been consistently fantastic (paired of course with a wait to get in). \n\nBut last night I was pretty blown away with the French Dip. Holy shit. It was so good. Like for reals. So.Fucking.Good. And it came with shoestring fries. The asparagus we ordered on the side was also pretty perfect.\n\nThe service has always been good here. Femi was our bartender last night. He was friendly, had strong conviction we made the right choice with the french dip, and went above and beyond. Truly exceptional service. Thanks Femi!\n\nI will keep coming back for ALL the reasons. I need more of that French dip in my life. No joke.", "author": "Leilani L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-03", "description": "Dined here for brunch. We ordered the chicken and waffles and veggie breakfast sandwich with a side of sausage on a bagel and hash browns.   We were greeted and served right away and our food \u0026 drink orders arrived promptly.  The chicken was excellent fall off the bone crispy and not overly greasy.  The brine they use really tenderized the chicken. Our waffle portion was equally as good the batter was flavorful and the texture of the waffle was light and airy. The breakfast sandwich had a generous amount of avocado and sprouts but the bagel used was well past its freshness date. Hash browns reminded me more of smashed potatoes than hash browns but they were tasty. Next time I would order it on a brioche instead.  Service was excellent and our mimosas were nice and bubbly. Would not hesitate to recommend or return.", "author": "Paula S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-19", "description": "Very cute place , very good service but not enough options for me , came here for lunch on Friday afternoon and they had only a small menu specifically for lunch. My friends came here just for the chicken and waffles we saw on yelp but they said they only offered it on Saturday lunch which is a minus for me , I don't think it's difficult to whip something up in the kitchen that a client requests. Otherwise everything was good , the food was good and drinks were delicious", "author": "Marina K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-19", "description": "Walter's came as a recommendation from another Brooklyn business owner.  We almost missed it walking by, as the exterior is pretty low profile (which I love), but once inside, the place was PACKED!  Closely spaced tables and bar seating, made the place feel cozy and inviting on a very cold, December day.  \n\nOne thing I would definitely commend, is the swift service!  Even though we arrived at the busiest time of day, we were sat quickly, served courteously, and were eating within a few minutes.  Very impressive!  We ordered Eggs Benedict and the house Burger, and both were delicious.  The burger was cooked perfectly, medium rare.  The hollandaise sauce was heavy on the lemon and generous.  The eggs benedict is served with hash browns that are shaped more like a latke, slipped beneath each muffin.  The crisp, saltiness was really tasty and I liked this type of plating.  Also, loved the shoe-string fries with the burger.  I would definitely recommend this place if you're passing through Brooklyn!", "author": "Amy J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-27", "description": "Recommended by friend to come to this restaurant, service was great and people were very friendly!! I had the roasted half chicken, smashed potato was GREAT, and the chicken tasted really good.. love it! BTW, the octopus was fresh and they just cooked right and very good!", "author": "Reb Z."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-04", "description": "Cute little brunch spot. \n\nNot a fan of the Bloody Mary's. Ordered chicken \u0026 waffles but still think Pies \u0026 Thighs' chicken \u0026 waffles are better. \n\nWould come back and try something different though.", "author": "Jade B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-02-08", "description": "Have you ever had a hot date lined up that you're all super excited about?  You get there and she's sitting at the table in dimly lit romantic lighting, looking fine as hell.  You can't believe your luck.  This is going to be the best night of your till now meaningless life.  And then, she speaks, and all you hear is Fran Drescher going \"Oh. My. Gawwwd.\" ††\n\nThat's what dinner at Walter's felt like.\n\nAt first, we felt like we hit the jackpot.  When we walked in, it was pleasantly buzzing, sexily lit, and felt like it had the right mix of cool and laidbackedness. †††  The staff was pleasant, the crowd was at the right level of hipness and age... everything felt just right.  And then, sadly, the food came...\n\n1.  I have never tasted a more bland duck bun\n2.  The duck wings tasted like burnt, crisp nothing.  The serving had 3 wings, for a party of 4, and one was left back.  At this point, they need to give up on duck entirely.\n3.  The charred octopus was not really charred.  It seemed like it was breaded and fried or something.  Definitely.  Not.  Charred.\n4.  The flourless chocolate cake crumbled and tasted like dust.  Tip: if it keeps coming out this way, use flour.\n\nThe saving graces were the mains.  The fried chicken was decent... points there.  Moist, flavorful... however I was not a fan of the dipping sauce on the side, whatever it was.  The chicken was good enough on it's own.  This dish literally saved the meal for me, and I clutched to the memory of it for dear life as I picked my way through dessert.\n\nSo in the end, points for atmosphere, scene and fried chicken... that's 3.  But if you want my opinion, walk an extra 10 minutes and go to Marietta.  You'll be much happier.\n\n†† Yes I just aged myself right there.  I'm old.  Go youtube or vimeo or whatever it is you young 'uns do these days for references you don't get.\n††† I make up words when it suits me.", "author": "Ajay R."}], "servesCuisine": "American (New)", "priceRange": "$11-30", "name": "Walter’s", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "166 DeKalb Ave", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/L0O4V6Nl0qRG0YDX8HhcdA/ls.jpg", "@type": "Restaurant", "telephone": "+17184887800"}