{"aggregateRating": {"reviewCount": 485, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-04-23", "description": "Loved it! Went to brunch yesterday, pretty much stumbling upon the place (it was close to our parking spot). From the start, loved the atmosphere, the decor and the little details (the gasket-topped jars at the bar for the garnishes, bow ties, etc.) I really enjoy small menus so Walter's is def my kind of place. The menu was classic brunch fare which suits me just fine. Ordered the Eggs benedict with spinach. The hollandaise added just enough flavor without being too rich. It was perfect and I really loved the home fries and how carefully diced the potatoes were! Husband ordered the Walter's breakfast and was very pleased as well. Our drinks were superb, starting out with mimosas and then venturing into a bloody mary (loved the celery flavor in it) and the Asperal Spritz. Husband also commented on how fresh the celery stick was in his Bloody Mary. Will definitely be heading back.", "author": "R. H. J. S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-03", "description": "I'm sick of dining in restaurants that make me feel like I should be honored to eat there. Luckily, that ain't Walters! ZERO attitude and total warmth, pulled off somehow while juggling a room full of hungry, impatient Brooklynites (and their kids occasionally). Food is fresh, well-conceived and prepared; service is downright impeccable. It's always refreshing when someone understands the basics of this business. Welcome to the neighborhood guys!", "author": "Aaron M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-03-02", "description": "Walter's is a really pretty room, and our server was great, but the food we had was mediocre. Most disappointing was that I had stopped in early in the evening to check out the  menu and ask the maitre d' on duty if the chicken and other meats were organic, as the menu didn't say. I realized it was a stupid question as soon as I asked it, because every restaurant that serves organic meats indicates it on the menu, whereas Walter's had no information on the provenance of any food. The maitre d' said yes, and I said, really,it's  odd it doesn't say so on the menu. He said unenthusiastically that he would double-check with the chef, and returned a few minutes later saying that yes, it was \"all\" organic. When we returned for dinner later that evening, my husband asked the same question about the roast chicken, and the waiter went to check with the chef. She returned saying it was not organic, but \"antibiotic-free.\" As for the dishes we ordered:  Jalapeno grits in the winter-vegetable bowl were a highlight. The catfish, on the other hand, was in a muddy blend of spices (and over-salted). We couldn't taste the Morroccan spices supposedly flavoring the roast chicken, which just seemed like a standard diner chicken dinner (with mushrooms on the side, again over-salted.) An otherwise delicious and imaginative appetizer was unnecessarily muddied with what tasted like supermarket curry powder.", "author": "C.K. W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-05", "description": "The experience at Walter's in Fort Greene was outstanding - from the perfectly inviting ambiance to helpful and gracious service and finally a truly exceptional menu.  The duck buns, artichoke dip, brussel sprouts, fried chicken and key lime pie are not to be missed...  We left most pleased with the entire experience plotting our next visit before we had even left the restaurant.", "author": "Rigby U."}], "servesCuisine": "American (New)", "priceRange": "$11-30", "name": "Walter’s", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "166 DeKalb Ave", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/L0O4V6Nl0qRG0YDX8HhcdA/ls.jpg", "@type": "Restaurant", "telephone": "+17184887800"}