{"aggregateRating": {"reviewCount": 485, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-03", "description": "Great little spot right across the street from the park.\nIt's such a cute space. It looks almost exactly like my grandma's kitchen. \nThe Oyster shooters were delicious. A rocks glass with an oyster at the bottom and a shot of bloody mary - heavy on the vodka.\nThe bloody mary's are where my boyfriend and I have the divide. I LOVED THEM. So deliciously horseradish-y. Not heavy on the pepper.  Light on garnish - because who needs garnish if you have a great bloody mary? \nThe brioche french toast was lovely and the fried chicken is homestyle on the bone. So good. Again, just like grandma's. The waffles were a tad underdone and floppy. But the rest was so good that it was easily ignored.", "author": "Victoria S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-23", "description": "Officially a fan of brunch at Walter's after having their blackened catfish sandwich, which has set the standard for all other catfish sandwiches in the future. The fish alone was packed with flavor, and a little overwhelming without the bread and slaw, but together, it was probably one of the best sandwiches I've had in a really long time. And those (not quite) shoestring fries it comes with are equally as awesome - crispy and seasoned, you don't even need ketchup. Definitely worthy of face-stuffing.\n\nThe only downside is that if you're looking for someplace quiet for brunch, Walter's is the complete opposite. Think back to being at the bar the night before, where you're still sober, talking coherently, but you can't hear yourself. Now take away everything but the noise, put it in a cute like brunch spot across from Fort Greene Park, and BAM, you're at Walter's. Oh - don't forget the crowd. Walter's is cute, but cramped. You will literally be sitting on the bag of the lady sitting next to you, and there won't be anything you can do about it, unless you want to sit on the lap of the guy to the other side of you (which might be nice, but you'll probably need that drink from last night). So, in other words, good for friends who you like screaming with, bad for a first date.", "author": "SukMon C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-09", "description": "Went last night for dinner and upping review to 5 stars for consistency.\n\nFun, charming restaurant with delicious food and good service.  I'd previously only been for brunch but have always enjoyed.  Kind of a tight space but the waitstaff go out of their way to make it work.   The food's well-made but not precious which to me is spot on and I've never had anything that I didn't really enjoy.", "author": "Barry G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-08", "description": "Great place to hang out and enjoy great food! The staff always nice and friendly, the people are awesome in a very cool nabe, across the street from fort greene park and the farmers market on Saturday. Never disappointed. Highly recommended!", "author": "Ohad M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-03-21", "description": "The bar steak was disappointing as the meat was cooked perfectly to medium rare but the meat itself wasn't very tasty. It could have used a bit more seasoning. The chimichurri sauce was disappointing too since it was much too oily and didn't have a good kick of tang to it. The fried chicken was out of this world...juicy, tasteful and crisp to perfection over a bed of mashed potatoes.", "author": "Woody G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-02-06", "description": "Just okay. A neighborhood joint that's a bit pricey but friendly enough with a good crowd.", "author": "Brian T."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-02-02", "description": "This review is only intended about their brunch.\n\nI had a bunch of friends visiting recently and we decided to do a Saturday morning brunch, I heard good things about Walters, so we went. What a mistake.\n\nWe were sat immediately, which was great for a large party. This is where the good part of the review ends. When we asked about ordering drinks, specifically a round of oyster shooters, the server told us not to, because it wasn't good...um, thanks for the honestly I guess, but without telling us what IS good to order, not great. \n\nAnyway we ordered drinks, and then ordered off the brunch menu. When the food came I was SHOCKED, it looked awful! tiny portions on huge plates with no presentation. I ordered the \"walters breakfast\" basically I got two eggs slapped onto a plate, wheat bread and sausage all just thrown on a plate, and then charged 15$...I could have gotten better from a diner, in fact I HAVE gotten better at a diner in park slope. A couple of my friends ordered eggs benedict, and the eggs were WAAAY overcooked, just firm and more hard boiled than poached, DISGUSTING, and hollandaise? try a teaspoon of heavy cream, just BAD...\n\nDON\"T eat brunch here it is a HUGE waste of money...if you're in Fort Greene, try ICI, Olea, or Dino's for a FANTASTIC meal...that's what I'll do from now on", "author": "C G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-06", "description": "Amazing chicken and waffles. The waffle doesn't get soggy, the chicken is perfectly seasoned and fried, and the brown sugar butter, maple syrup and hot sauce on the side mix together into perfect deliciousness. We also had bloody Mary's and oyster shooters which were great! Not a long wait, and fun atmosphere for it being a bistro setting", "author": "Sarah W."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-10-17", "description": "Food is pretty good, but we were all just super pissed about the wait. We were told 20 minutes when we first walked in, ended up being an hour. Apparently the party that was at the table just took their time leaving but there's a polite way for a host to ask a party to vacate during the busier part of the day. It's very acceptable, and they should have done it to sit us more quickly.", "author": "Yoav E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-07", "description": "So, I stopped by on a Friday night at 9 pm and only had to wait 5 minutes- Nice!  The space is intimate and the mood is bright and lively. Good balance of ambiance and food. The bartender, host and waiters all took great care of us. The drinks were strong.\n\nI enjoyed the appetizers more than the main courses. We tried the duck buns- delicious! The buns were soft and melted in your mouth. Cilantro and juicy duck filled the inside. Next time I will not share it!  The charred octopus was also delightful. You get two very large long tentacles (that doesn't sound too appetizing- but it was!)  The octopus is very tender and the sauce was fabulous.\n\nMy friend ordered the pork chop and I had the catfish. I preferred the pork chop. It came on a big pile of mashed potatoes and was cooked perfectly. The catfish was pretty good too but I was pretty full and only had a few bites. It was heavily spiced and not quite my preference. I hear the burgers and the key lime pie are amazing. I will be back to try them out soon.\n\nOverall, I think this is a solid dinner spot and it is somewhere you can come back to again and again.", "author": "Saba F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-22", "description": "Its small and there seems to be a wait but it's worth it. Went to this place on Sunday July 20th for brunch it was delicious, I had the chicken and waffles so good. And the mimosas even better, love finding great places like this so close to home.", "author": "Jenn M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-22", "description": "Had brunch at Walters and loved the experience! Super friendly hostess, tasty food and complimentary mini muffins! We had the French toast and bacon egg sandwich - really good food and service, will definitely be back!", "author": "Sara H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-24", "description": "Atmosphere is great for a dinner date, cozy, exposed brick, warm, intimate, good background music. You will likely have to wait for a table because the place is small. Variety of people from different walks of life. Food was on point. I recommend ordering an app. \n\nCheers.", "author": "Solomon D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-03-12", "description": "This place was not bad at all. My girlfriend and I got seated right away even though it started to fill up pretty quickly after we were seated. So perfect timing. \n\nThe place is cute, a little small but the vibe made it easier to deal with it. We went during dinner time and the drinks were good and the food was tasty. I couldn't even finish all of my chicken because they gave you three huge portions. Not complaining at all! \n\nOverall, I can't really say anything bad about it. I had a decent experience for my first time going there. I will definitely go again and sample more food. To tell you the truth, the drinks had me sold to going back regardless.", "author": "Mel M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-01", "description": "This place is so sweet! The decor is very Williamsburg, with black and white checkered tile, a tin roof, and a dark wood bar. The service was super friendly. We got seated right away despite the restaurant being full around 2pm on a Sunday. The chicken and waffles was some of the best I've had in Brooklyn -- delicious syrup, hot sauce, and crispy piping hot chicken. Prices are average -- brunch ranges between $8 and $15. Bloody Mary was good but not amazing, and definitely on the spicy side. \n\nI'll be back!", "author": "Anna W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-19", "description": "So so yum. I'm finding solid brunch places are hard to find once you find your favorite few (The Farm on Adderley, Cafe Luluc, Five Leaves) ..walter's is joining the list. Their menu is not overwhelming but something good to find for anyone. \n\nEggs Benedict with the salmon were cooked perfect and home fries were tasty....French Fries as another side option were thin and crispy -- my personal fave\n\nFrench Toast was soft and hearty with a generous amount of fruits; i'm not even a french toast fan -- but id be back for these \n\nThe only mugh point was the pomegranate lemonade -- toooo sweet for me \n\nThey have a few booths, but overall not a place for groups unless you're willing to wait.\n\nDefinitely plan on giving this place a visit for dinner!!!!", "author": "Donna K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-05", "description": "Great service and food!! Bike parking out front and around the side, and close to a few subway stations.", "author": "Francesca C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-08-29", "description": "The food just isn't special. I'm sitting across from my partner who ordered eggs Benedict and the eggs have 0 runny yolk, they're almost completely hard boiled. I got the French toast and the fruit isn't fresh. Interior is great and staff is warm and friendly but food just is not good.", "author": "Jenna M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-31", "description": "We had an enjoyable meal.  Food was great.  I had the rib appetizer and carrots.  Nice cosmo.  Very lively.  Lots of college or grad students.  Very metrosexual. If your looking for a place with a low noise level, this isn't it but it's wonderful for what it is.", "author": "David H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-28", "description": "The review is for the hidden treasure Karasu behind the wonderful Walters Restaurant at 166\nDekalb Avenue Brooklyn. The food and ambiance is beyond ones expectations. The drinks are exotic and beyond awesome. The food is of the highest quality and the presentation is amazing. \nThe food is prepared by Chef Yael Peet who is beyond talented and creative. The owner and staff are wonderful. This is a place you must experience.", "author": "Leslie H."}], "servesCuisine": "American (New)", "priceRange": "$11-30", "name": "Walter’s", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "166 DeKalb Ave", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/L0O4V6Nl0qRG0YDX8HhcdA/ls.jpg", "@type": "Restaurant", "telephone": "+17184887800"}