{"aggregateRating": {"reviewCount": 485, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-26", "description": "Love the one in Wburg. \nLove that this one's closer.\n\nBrunch \nEggs benedict w/ spinach - slightly spicy hollandaise was excellent and texturally on point, eggs cooked beautifully, spinach was delicious, homefries were crispy and nice but could have used more onions and peppers. \n\nLooking forward to going for dinner.", "author": "Julia R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-20", "description": "A neighborhood favorite - the fried chicken continues to be one of the best in Brooklyn. Knowledgeable and friendly staff - we are very grateful for Walters!", "author": "Jack L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-10", "description": "Loved it.  Fried chicken was excellent.  Drinks were excellent.  Service was very good.  Happened to catch a table before the rush.  Loved the vibe!", "author": "K M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-12-07", "description": "Still amazing after one year.  A must in Fort Green.  The servers and bartenders are really amazing and so friendly.", "author": "Olivier L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-04", "description": "I had such a great time with friends here. The cocktails are great, the service was so friendly and fun. I will absolutely go back here and spend a lot of money again too! The food was the best thing about it, oysters were so good!!!!", "author": "Katlyn H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-04", "description": "We live a block away and my boyfriend and I love coming in a couple times a week and sitting at the bar and ordering a couple of drinks. Alejandro is the perfect bartender, he makes a marvelous cocktail and is prompt, efficient, and the ultimate dude - as a bartender myself I know the ins and outs of the job and he handles it with aplomb. I've come here for weekend brunch a couple of times and ordered their outstanding bloody marys and excellent Huevos Rancheros (not traditional greasy Mexican Huevos Rancheros - a more healthy, cheese-free version, so don't order this if you're craving grease). I've come once for dinner and had the decadent fish soup, which is expensive but marvelous - as I announced to my friend \"this broth will cure cancer.\" \n\nThe ambience is perfect, with big windows that look out onto Fort Greene Park, subway tiles, a huge beautiful wooden mirror behind the bar - very \"retro/now\" interior design.\n\nI'm taking one star off for the weekday lunch menu, which is limited, over-priced, and unappealing in just about every way. Skip lunch and go for Saturday/Sunday brunch or evening drinks! \n\nP.S. Their key lime pie is the best I've ever had!", "author": "Viola F."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-10-25", "description": "Food tasted good but I had severe intestinal problems after.  This explains the current DOH grade.  Ordered coffee at least 3 times and never received it.  It was still added to the bill.  We waited at least 45 minutes after being told it was a 10 minute wait.  Don't ever try the pomegranate lemonade.  There are so many better places.  But, if you want to be in a hipster place or a cool spot in the neighborhood then this is your place.", "author": "Greta J."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-10-08", "description": "I wanted to go there for the longest time. Very cute place, decor, nice staff.\nThe food was not good and expensive. The lobster salad had 3 pieces of lobster (maybe 4) lost in a mountain of greens, covered with cheese, CHEESE on lobster?!? The artichoke dip was good. $ 35 for 12 tasteless oysters  The fries were great, so was the mayo. The cevice was pieces of square white rubber and tortilla chips.. $200 plus tips, for two people, lots of money for such a disappointing, poor, weak, tasteless food. What a shame, I heard and read so many good things about this place.", "author": "Ma M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-05-03", "description": "I love that there is now a raw bar and martini place in walking distance of Pratt. Too bad I graduated years ago.But I was in the hood and decided to try it. It was very good. What really caught me by surprise was the soft shell crab sandwich with chipotle mayo (special). This was like a sandwich I have never had and a excellent use of soft shell crab.", "author": "Pete R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-29", "description": "The place is da bomb.  Great neighborhood place with a neighborhood feel and high quality food and service.  And they serve till 1AM.  Who woulda thunk it we'd have a late night place like this in the BK.", "author": "Michael L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-04-02", "description": "We had to wait about 45 minutes for a table on a Saturday afternoon. Our waitress was very friendly and helpful. I ordered the catfish. It was good but nothing spectacular. The fries were pretty good and crispy though. I also had the pomegranate lemonade... a bit sour but I guess that's what you get when you order lemonade. I probably won't be coming back unless I happen to be in the area and that's the only thing to eat.", "author": "Alix C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-13", "description": "I went to Walter's with two kids and their parents. The four of them had been there before and loved it each time. I must agree with them, everything about this place is fantastic. Good selection (and I'm gluten and dairy sensitive) of food and drinks. The drinks were excellently mixed and the food had such amazing flavors. All of the combinations worked well individually and when paired - such as the ceviche for an appetizer and the inside of the french dip with the PHENOMENAL brussels sprouts.", "author": "Alexandria H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-09", "description": "II went to Walter's last Friday for a much needed night out with the girls.  The place was filled with late night dinners and the bar was packed. We were pleased with the couple of bottles we selected from the wine menu. They were unfortunately out of the ceviche and the lobster salad, which appear to be fan favorites. We enjoyed our tasty dishes while we listened to the medley of old school hip hop. The staff was just lovely and we will definitely be returning to this trendy spot.", "author": "Kenya J."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-04-06", "description": "I wanted to like this place.  I came for dinner on a Saturday night with my boyfriend.  The service was decent, and our drinks were both alright.  I think it just felt more trendy than anything else...the place was packed with stylish Brooklynites, but the food was just decent, and the space felt really cramped.  It made me wonder why it's such a frequented spot.  A lot of it felt like paying for the trendy atmosphere, which isn't a bad thing, it's just not a place to go if you're looking for more than that.", "author": "Erica C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-25", "description": "Excellent neighborhood spot. Haven't made it in for dinner service yet but have frequented their nicer-than-your-average-lunch service since moving to the neighborhood a few months ago. Beautiful and cozy atmosphere, welcoming staff, and quality ingredients. Can't wait to do a proper evening here.", "author": "Jillian B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-10", "description": "My wife and I had such a great experience at Walters that we finally created a yelp account just so we could write a review of this place. \n\nWhen we arrived there was a bit of a wait so we decided to grab a drink at the bar. Thankfully 2 seats opened up and since the bar was full service we decided to stay there. We ordered the spicy deviled eggs, the raw bar sample platter and we split the fried chicken for dinner. Everything was absolutely delicious. The seafood was fresh and served perfectly. The portion was generous so we were a little full when the chicken arrived but it ended up being the perfect amount of food.  \n\nIn addition to the great food, the bartender was extremely helpful and friendly; exactly the reason this place will do well. He offered us a complimentary glass of white wine because he thought it was a great pairing for our oysters, and he was right. The service was phenomenal, the place was immaculate, and the food was delicious. We are so happy to have a place like this in Fort Greene and will happily continue to dine there.", "author": "Victor C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-04-21", "description": "This place is the BEST- Friendly staff, delicious food, amazing drinks, wonderful decor-- what more can you ask for?? I often will visit for dinner... and then brunch the next morning. Why fight it? You know you want to!", "author": "Lauren F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-01-04", "description": "This place is very average. Came here with friends for brunch. We all enjoy good food and found our meals to be mediocre. Not sure why there are so many 4 star ratings. It certainly does not deserve the same average rating as Olea which is consistently interesting and flavorful. Given the price, my expectations were higher. The food here is more like a 2, the service a 3, and the ambiance and location a 4. Perhaps dinner is a better option at Walter's than brunch.", "author": "D H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-07-06", "description": "good, friendly service\n\nprices are too high for the quality of both the cooking and ingredients, and there seems to be no care for portion sizes and presentation\n\nwould recommend to the management (owner) that they have a hard look at what they actually have to offer as there is a huge discrepancy between the appearance of the place and what is ultimately delivered on the plate\n\nwe had two of their most expensive dishes (seafood stew and fish of the day) and were really disappointed by the quality and disregard to execution and ingredients (seafood stew was clearly made with canned tomatoes and the fish was poorly prepared)", "author": "Gus M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-03-09", "description": "A fine place for a bite and drink before BAM, but in general I think Walter's is overpriced and somewhat underwhelming. My brussel sprouts were dripping in salty liquid and the oysters, while fresh and interesting, were very dear. I think I spent $16 on just 5 oysters.", "author": "Duck D."}], "servesCuisine": "American (New)", "priceRange": "$11-30", "name": "Walter’s", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "166 DeKalb Ave", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/L0O4V6Nl0qRG0YDX8HhcdA/ls.jpg", "@type": "Restaurant", "telephone": "+17184887800"}