{"aggregateRating": {"reviewCount": 485, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-18", "description": "Excellent food and service. The atmosphere is perfect. We had the raw clams, artichoke dip to start. For entrees, the Fisherman stew (delicious and a little spicy)  and the clam linguine (which i'm jealous my girlfriend had). Desert, the banana bread.\n\nIt was a great night all in all despite the pathetic loser next to us who was so rude to our waitress (Lauren was perfect the whole night). But what more can you expect from a 35 year old dressed like a homeless teenager and being the only guy in the place wearing a fitted hat, a BOSTON fitted hat.", "author": "David S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-10", "description": "This cheery neighborhood Fort Greene  Restaurant is well rounded. From Brunch service to Dinner service it does it well. Friendly Bistro like interior. It is fun to sit at the bar as the bartender is friendly but table is for those who desire it also. I've been here for dinner and brunch and pushes out food that is comforting and good.\n\nWalter's makes a spicy kicking Bloody Mary. The chicken and waffles are on par. Crispy and nice and juicy fried chicken(although the last time one was slightly undercooked). The Walter's breakfast is always a pleaser and as far as bacon side goes it not as good as some others but better than many.", "author": "David N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-25", "description": "I went to Walter's for my birthday this past Wednesday and it could not have been a better experience. They were incredibly accommodating of my group size and also very attentive. Our waitress Natalie (Nathalie?) got every order in our group of 9 right- and the back-waiter brought everything out correctly to each person. The food was also delicious (I really loved the artichoke dip and the French Dip).\n\nEvery person in my group commented on how great the experience was. I would go back in a heartbeat!", "author": "Kate S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-11", "description": "My go to spot when I used to live next door. Sometimes it's hard getting a table but it's always worth it. Fried chick and steak are a must. Also the oysters are always amazing. I think the best oysters I have had in NYC. This pace will always be my go to if I am in the area.", "author": "Hassan P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-19", "description": "Walter's is a brunch and dinner mainstay in Fort Greene, serving delicious cocktails, beer, and meals. Ambiance is casual, homey, yet clean and nice. Service is fast. Prices are fair, portions are good. Great for casual mornings with the family or friends, family friendly (although you may need to leave the stroller outside), and tasty all around. Prices are fair for Brooklyn.\n\nThe waits at Walter's can be quite long on a Saturday morning. But service is always efficient and friendly even though demand is crazy pants for them. The space is small and cozy, but they do have a couple of tables that can support larger parties of six or eight people. The booths are not super comfortable if you're carrying a lot of stuff, so try not to bring the stroller brigade. \n\nI've ordered: \nPomegranate lemonade - tasty and tart\nGinger beer - refreshing and spicy, served with lime for a squeeze of tart.\nShakshuka tomato stew - comfort food. Perfect winter breakfast melding rish egg yolks, a slightly acidic tomato stew, and lots of vegetables.\nChicken and waffles - the waffles are amazingly fluffy, with a fantastic maple butter. The chicken is super moist, tender, and has a fantastic crisp crust. \nWalter's Burger - classic great burger, cooked as well or rare as you like\nBlackened Catfish Sandwich - tasty, must if you like catfish\n\nIf you're willing to come early or wait a while outside, I'd definitely recommend.", "author": "Suanne L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-12", "description": "My favorite neighborhood spot! Cozy, always buzzing and no attitude. Food is always great, especially the roast chicken !", "author": "justine z."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-05-31", "description": "I really wish I could rate Walter's higher because the Bartender provided excellent service.  \n\nWe went there a few weeks ago because I was craving oysters and have heard that Walter's is the spot, in our local area, for oysters. Apparently oysters are their specialty. \n\nWe ordered a round of a dozen oysters - with all varieties to taste - and the pinot blanc wine - which was a nice pairing. We quickly realized that our favorite oysters were from the East Coast (From Virginia/Maryland area specifically). \n\nAfter that we ordered the Artichoke Dip - which was SO horrendous. That is why I cannot give Walter's a higher rating. Basically, the dish tastes like small artichoke bits (presumably de-frozen) surrounded with oily jack cheese that was microwaved. My spouse and I took one bite and looked at each other in shock. I think this is because we frequent Freeman's Restaurant in LES (in Freeman's Alley) and their artichoke dip is killer, unbelievable. So, we just could not believe the poor quality and ingredients that were used at Walter's. My spouse uttered, \"So they basically took artichoke, a bunch of jack cheese and put it in the microwave... We could have done this\". I concur with the assessment. \n\nConclusion: The oysters were good, but you can get the *same* East Coast oysters on Happy Hour at the Mermaid Inn for $1 each (!). So, next time I want oysters I will make the logical decision to eat at a locale where the oysters do not break the bank and the other menu items are also good, not Walter's.", "author": "Fazeela S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-10-09", "description": "Pretty much a mixed bag for me.  Pretty good food and drinks, despite the bartender being a little standoffish.  I had the watermelon and feta salad which was fresh and nice. The deviled eggs had a little bit of a strange synthetic aftertaste, but I think it was mixed with Sriracha to give them a little kick - maybe that did it?  My husband had the pork chop which was a little dry but those jalapeno grits are really good!", "author": "Rachelle R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-16", "description": "This was a lovely, reasonably priced brunch right on the corner of Fort Greene Park. I loved that they bring you mini banana chocolate chip muffins when you're are seated. The service is great, laid back and very friendly- there was a short wait and I appreciated that they recommended a nearby coffee shop instead of having us wait around at their own bar. The menu was small but varied, so there was still something for everyone... I wished my hash browns had been a little crispier and that the bagel of my breakfast sandwich had been a little toastier, but overall great experience in this sunny little breakfast spot and I would return in a heartbeat.", "author": "Helen L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-18", "description": "We've gone here for brunch many times, especially for the chicken and waffles. It's pretty cramped in there and not a good place for a large group of visiting grandparents. Perfect for two people", "author": "Alli D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-01", "description": "It was nice to get a table right when we walked in  on a Saturday but the service and food  was not that great unfortunately . We had VERY mediocre steak and eggs. Maybe it's just the brunch menu? Although Walters has a great and convenient location and the ambience is a perk. We just had to ask multiple times for basic items - so the table wasn't set properly (had to ask for salt and pepper, a steak knives to eat steak, etc.) then no one checked on the table and the servers weren't as warm as you would expect. Really wanted to enjoy it here - but will def skip for brunch!", "author": "Taneka S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-04", "description": "Great drink. Alcohol and non. Lemonade was amazing. The brunch was delicious and a great atmosphere for families.", "author": "S. E."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-07-22", "description": "Came here after seeing their food on Munchies, and thought this was going to be a great experience but was significantly disappointed. \n\nI have given this place many tries, and have ordered the burger, french dip, artichoke dip appetizer, wings, fish tacos, and the tuna melt.\n\nThe burger and french dip are the only things worth going there for, and the quality is not worth the price. All the other stuff is super overrated and way too expensive for the quality that they are.", "author": "Raymond F."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-06-24", "description": "We came here on Saturday morning and I ordered the chicken and waffles. They brought out 3 small half pale uncooked waffles and 2 tiny pieces of overcooked fried chicken. Also no maple syrup! Wth! Unfortunately I was too hungry to take a photo! So I just ate this. Hoping this is just an off day and that the food will go back to its normal level of decentness.", "author": "Josh C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-07-01", "description": "After reading the positive reviews on this place I decided to take a trip to Brooklyn from the Bronx with my husband and daughter. I really regret it. The hostess that sat us practically threw our menus that on our table and walked away rudely.I really wanted to like this place but the food was mediocre on top of us being treated like second-class citizens at a place where we were spending our money. I had dry ass chicken and waffles. My husband had an omelette with fakeass eggs. And my daughter was underwhelmed with her eggs and hash browns. The young lady at the door made me and my family feel very unwelcome and we will never be back.", "author": "Talia N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-11", "description": "I found this place doing one of my usual searches on Yelp. I was in the mood for brunch and since it's right in Brooklyn, I gave it a try.  Came with a friend. We both ordered the fried chicken and waffles. All I have to say is that God bless the hands and mind for the creation of this dish.\n\nI have had my few shares of fried chicken. The chicken was so succulent. Moist just the right crisp. The waffles, aahhh, so good especially with the butter. I had to slow down just so I didn't finish it fast. \n\nLet's just say after leaving, I still had the taste for it even after a week of eating there.\n\nIt's a MUST GO!!!", "author": "Antoinette C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-27", "description": "Had a great eggs benny with smoked salmon. The hollandaise sauce is amazing. Not too creamy and has a nice spice to it. Also shared the French toast which had a nice caramel sauce. The bartender was kind and the atmosphere easy-going. Would definitely go back :)", "author": "Olivia B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-07", "description": "Sunday brunch and what could be better than a beautiful summer afternoon and delicious food. \n\nChicken and waffles - the chicken moist and falling off the bone and the waffles tasty and just the right texture. An omelette with jack cheese and bacon - the eggs done just right, the bacon tasty and the cheese, while with a bite came nowhere close to being too spicy to overpower the taste of the eggs and bacon. \n\nThanks to Walter's for a fine brunch and to it's namesake!", "author": "Elliot P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-14", "description": "A cute brunch place with good food. The service was excellent and everyone looks so dapper in bow ties. Came around 3pm and there were a few tables empty. I don't know what it's like during prime brunch hours. \n\nNow onto the food and drinks. The bloody mary is strong and flavorful. The salmon benedict was one of the best benedicts I've had ever. They give you a good amount of smoked salmon too. Fried chicken and waffles were good but I've had better at other places. The chicken was juicy but not that crispy. Ask for it to be extra crispy because I saw some tables with raw middles. The waffle could've been more well done but it had good flavor and was still delicious.", "author": "Elizabeth N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-06", "description": "If there's a better burger, martini or dinner playlist than Walter's in all of Brooklyn, I've never been!\n\nLove that the mixologists (sheer geniuses) remember my palate, despite me frequenting the bar maybe 2x a month (hardly a true \"regular\").\n\nAs for dinner or brunch, it's good all day and every day, regardless of time or occasion.  The burger is literally mouth-watering, the pickled onions are bliss and the shoestring fries get fought over when only one of us orders them... Don't get me started on the duck buns, which my 3year old god-daughter requests often!\n\nHave the best service, conversations and key lime pie every time.  The ambiance is relaxed enough to wander in wearing jeans and sneakers, but still intimate enough to be the go-to late night drinks or date spot.  How it achieves the vibe to fit any and all is beyond amazing.  \n\nI bring every guest- friend or fam- who visits BK to Walter's at least once...that's all it needs to guarantee a demand for repeat visits. \n\na true gem, culture and character of ft. greene!", "author": "Kristin-Marie P."}], "servesCuisine": "American (New)", "priceRange": "$11-30", "name": "Walter’s", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "166 DeKalb Ave", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/L0O4V6Nl0qRG0YDX8HhcdA/ls.jpg", "@type": "Restaurant", "telephone": "+17184887800"}