{"aggregateRating": {"reviewCount": 485, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-06-10", "description": "Great brunch location and the food options certainly justify any wait. It's the casual diner feel with well thought out tasty menu that makes Walter's stand out, check out the fried chicken. Unfortunately someone in our party received lukewarm eggs Benedict which which is a slight negative.", "author": "A C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-25", "description": "I went to Walters for Sunday brunch and it seemed that everyone had the same idea. Every table was taken, but the host is on point. A table became available much sooner than expected. Once we sat down the french toast was excellent and our waiter was nice and attentive.", "author": "Michel L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-29", "description": "When visiting Brooklyn in September, my colleague told me that I had to stop by Walter's for dinner, one night. On that trip I'd been considering whether or not to move to Brooklyn from the SF Bay Area, and was really on the fence about it, until this random moment at Walter's...\n\nSee, my dad passed away from cancer about a year ago. About two years before he died, he'd finally taken up texting - I think he did so to connect more often with my brother and I after his diagnosis. When we didn't know what to say, we'd send each other our favorite animal- I'd send him a dolphin (his favorite) and he'd send me an elephant (mine). Through little moments like this, my dad and I were able to connect when there weren't words. \n\nSo how does Walters come into play? Well, on said trip in September, I'd gone to Walter's alone and sat at the bar for dinner. While eating, I contemplated whether or not to make the big move, when I looked up and saw a small dolphin figurine up on the mantle above the bar. Between the lovely experience I was having with how friendly people seemed to be in the neighborhood, the prepared-with-love tasty food/drinks I was consuming, and that little dolphin \"sign\" to top it all off... it was enough for me to feel like I was exactly where I needed to be. \n\nI've since moved to the neighborhood and Walter's is a somewhat regular favorite for me. I love dropping by before/after strolling around Ft. Greene. For brunch, I love the housemade ricotta and fruit, the breakfast sammo, and the chicken and waffles. Everything for dinner is good- but at the very least, I'd recommend starting with the artichoke dip. Mmmmmm.", "author": "Jodie B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-27", "description": "Perfect if you're looking for a very simple breakfast spot. I had a party of 3 and was seated immediately on a Sunday AM at 945AM.\nI had the Walter's Breakfast with bacon and eggs over easy. Bacon was chewy and the hash browns were nice and crisp! \nThe atmosphere was quiet and calm. Lots of natural lighting from outside. \nOverall a nice and simple breakfast spot in Fort Greene.", "author": "Brittany M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-27", "description": "This place is solid. Great cocktails, food, service and atmosphere. Went with friends last night and had an awesome time. 3rd time going and has been consistently good each time. Recommend the wings, oysters, deviled eggs, cauliflower, and French dip. Salad with beets was very good too. Coconut pie for dessert was among best I've ever tried. Service on point.", "author": "Chris W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-05", "description": "This restaurant is as close as it gets to Manhattan quality of food and ambiance. Amazing drinks and food, and surprisingly kid friendly (if you manage to get a seat). Was here the other day and was sitting next to Usher - does not get any better than that in BK! Happy hour is great too, half off everything including oysters, shrimp, lobster, etc.\n \nPS: Williamsburg location is not as good though.", "author": "Mike N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-04", "description": "The chicken wings were soooooo spicy but sooo good!! The ambiance is cool. Got the old school fancy feels.", "author": "Meredith B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-04", "description": "The place had a great brunch food and also good drinks selection. I found my favorite cider here. The waffle had corn break like texture which I love and the fried chicken was done well. Food is definitely great.", "author": "Mini K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-18", "description": "This is the type of place I don't want to tell people about. Like, I want it all to myself and the other 50 people who feel the same way about it but, sure, I guess that isn't a sustainable business practice.\n\nI came with a couple friends for a light dinner and drinks after hearing about this place through the grapevine. We ordered the artichoke dip, baby back ribs, brussels sprouts and spicy deviled eggs. Every single dish blew me away. The brussels sprouts were cooked in duck fat and rosemary with just the right amount of crisp, and just the right amount of kick to them. The ribs were fall-off-the-bone-type, covered with just enough sauce, and garnished with thinly sliced vegetables (think carrots/purple cabbage) that added a really nice crunch to each bite. The artichoke dip was delicious. Creamy, EXTRA cheesy and paired with crisp, buttery bread chips. Also, it was a really large serving. Even for three people it was a lot to eat. Lastly, the deviled eggs. Our waitress told us she was a huge deviled egg fan and these were her absolute favorite. We trusted her, because we felt like she wasn't like every other waiter out there, just recommending all the menu items since they work there, so we got some (one order includes two halves). They were *really* good. Really creamy, smooth texture, garnished with a vegetable slice (I don't think they need this) and dill (the dill really added something extra here).\n\nThis place is a cocktail place, and I really recommend at least trying one while you're here. Ask the waiter/waitress for suggestions if you're not sure what you'd like. Ours let my friend try the campari bitter since she wasn't sure about it, and she also helped us narrow in on options based on our tastes. I got the Bramble (gin, blackberries, lemonade), and my friends had the Diablo (tequila, honey, lime) and the Bitter Margarita (tequila, campari, lime). Mine was good, but I wasn't a big fan of the seeds getting sucked into my straw... I should've known better, but I just wanted to try something new. Either way, it was a good mix of flavors and you could tell they put a lot of care into making each drink.\n\nThe service was exceptional. Our waitress was quite possibly the best waitress I've ever had, and I hope I get her every time I come back.\n\nCan't recommend this place enough.", "author": "Kaley R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-29", "description": "Came here for brunch late Saturday afternoon and the place was packed even with the weather pouring outside. \n\n Our waiter was really nice. There service here is superb. We were a party of 6 and we sat at a booth in the back. A bit tight but doable. The food was good. The waiter gave us an order of fries free and when we asked if we can have another order cause we were 6 with no hesitation they gave it to us. \n\nI would recommend this place to others if you're in the neighborhood. Just be prepared to wait. I heard that there's a secret passage from this restaurant into another. I will try it next time!", "author": "Shirly S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-08-12", "description": "Food was just OK but service was even worse... Our server was pushing us with more appetizers even thou we ordered a whole bunch for the table and gave us some attitude. Considering there's better options in the neighborhood I won't be returning anytime soon. The drinks were spot on thou", "author": "Denise B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-19", "description": "This place epitomized my whole BK experience. I love that area and hope to move there soon. I went there with my boyfriend for brunch and the food was stellar. With mimosas. The place is pretty small but we were sat within a couple of minutes. Very friendly staff.", "author": "Diana W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-18", "description": "Really great food and nice staff! Good for brunch or dinner. Great menu options. Check it out alone or with friends.", "author": "Nortnic R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-17", "description": "So the first thing to note, is that space is an issue, the tables are too close together! You can hear everyone's conversations. The ambiance was nice for my date, dimly light by a candle on each table. Our server was friendly and our food came out quickly. We had deviled eggs, and the sweet and spicy wings for appetizers, and they were fairly tasty, but for the 2 wings in each order; they should at least be cut up and not sent out whole  (just my preference, I guess). It got better when the fried chicken and mashed potatoes came out. I found the chicken crispy, moist and tasty and the mashed potatoes where great as well along with then gray smothered over them. The dipping sauce I assume was honey based and I'm a fan of honey so it went well with the dish. \n\nThere needs to be more additions to the menu though, there were certain items I couldn't eat for religious reasons, and the only chicken dish I saw on the menu was the fried chicken.\n\nI do plan to return, maybe for brunch this time..", "author": "Wesley M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-28", "description": "This place gets packed on weekends!  We usually come around 10:30-11am and have to wait a half hour.  Food is pretty good (not the best in the area), but location is convenient and they are very accomodating to children, so this place has become a regular on our rotation.  No outdoor seating though.", "author": "Kathy W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-24", "description": "Pretty solid food. Oysters are a bit pricy but there's a good selection. Cute vibe. The salmon Benedict was yummy as was he chicken and waffles. Nice little spot we happened upon.", "author": "Lisa M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-22", "description": "We went here for brunch. The wait was a half hour. It was fine because we checked out the farmers market while we waited. The chicken and waffles were incredible because they have spices in the butter with cinnamon and sugar and other warm spices. We also had eggs Benedict which was good too. I would also recommend the ginger honey soda if you need a non alcoholic drink.", "author": "Carina P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-05", "description": "Several years in and still going strong.  Cool spot serving good cocktails. Menu is to the point and great.  Raw bar is a great start and there's an entree for every palate.  The grilled bar steak served with fries, arugula, horseradish and chimichurri is a standout amongst great dishes available.", "author": "Ben D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-02", "description": "My go-to spot. Some faves: burger, caesar, octopus starter, whatevers clever. Brunch can be a long wait if you go after 12pm on the weekends but coffee nearby and the park helps kill time especially if the Farmer's Market is going on...\n\nBloody Mary is a must too!", "author": "Julie N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-23", "description": "Great food! Great drinks. The ambiance is fun and casual. The burger is amazing and so is the fried chicken. All the drinks are very hand crafted. Great casual spot for drinks and apps.", "author": "Corey W."}], "servesCuisine": "American (New)", "priceRange": "$11-30", "name": "Walter’s", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "166 DeKalb Ave", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/L0O4V6Nl0qRG0YDX8HhcdA/ls.jpg", "@type": "Restaurant", "telephone": "+17184887800"}