{"aggregateRating": {"reviewCount": 485, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-01-13", "description": "i saw little humans at walters last week, we don't have little humans that late out in manhattan. walter was ok, nothing to write home about, your usual gentrified bar. apparently the place doubles as a sushi restaurant in the back, interesting, still not writing home about that either.", "author": "Augusto N."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-08-31", "description": "I came here for brunch with my boyfriend. A small plate of corn muffins come free with the brunch! Free food is always a plus in my book. We both had mimosas which were pretty standard. I had the shashuka baked eggs which I thought was really good. My boyfriend had the Walter burger which was okay, nothing fancy. Staff are nice and the food came out pretty quick. I would come here again, but probably not until after I've tried the other neighboring restaurants first.", "author": "Jessica L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-03", "description": "The food here was delicious! Shared the french toast, chicken and waffles, and huevos rancheros with two other friends. French toast and chicken and waffles were awesome! The rancheros wasn't the best I've had, but it was still good. Service was fast, friendly, and helpful. Only cons were that it was a bit cramped and very loud, but I would still go back!", "author": "Teema C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-01", "description": "What can I say about Walter's that hasn't already been said? I walked in high, I walked out drunk. Kisses to Charlie.", "author": "marcelo g."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-18", "description": "Great spot, nice lighting, great food. Had the Fishermans Stew on this visit and it is delicious, spicy and warm with great flavour and a hunk of bread on the side. Very tasty and perfect for a winter night.", "author": "Jack M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-31", "description": "The food and brandy were savory... If you are exploring the area this would be well worth a pause in the day.... Apparently the skirt steak is off the hook... Will be back!", "author": "Coffee G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-30", "description": "Rounded down from 4 1/2*\nI'm not sure if the near-magical bar dinner we had at Walter's was a non-recurring phenomenon or if this place is really just that good.\nFirst off, try not to be put off by the incredibly loud buzziness of the hipster assembled. And do try to eat at the bar where you can create an island of calm and a cone of audible speech between two people. \nChris was at the bar that night, and he really made a difference for us. Attentive, informative and entertaining. And then there were the tequila shots he laid on us (and shared with us--I love when bartenders do both those things).\nThe food was very nice, as well. The Rhode Island oysters were lovely. And the David Chang-like duck roll was excellent.\nWe ate some other things, and they were good, but I don't remember what they were.", "author": "Lira R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-29", "description": "How have i been going to Walter's for 2 years and neglected to write a review?\n\nHands down one of my favorite places in New York. Great drinks, great service, delicious food. And always a great atmosphere. I take everyone that comes to visit me here, to the point where I've basically created an out-of-towners Walter's cult. No lie, every person adores it.\n\nRecommend: bar steak, burger, catfish, spinach artichoke dip, oysters, linguini with clams, any of the seasonal salads to start... honestly though, everything is good.", "author": "Meg C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-10", "description": "What a great little bar/restaurant.  Feels very warm/old timey.  Just went here for drinks, but next time will come for the fried chicken and waffles.  All the bartenders were very nice and the vibe was cool and non-pretentious.", "author": "Madhu R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-06-17", "description": "Just when I think that waiters with nasty attitudes at awesome establishments are a thing of the past. . .  \n\nI popped in for a quick lunch with my 20-month-old around 1pm (06/17/15). Shortly after my food arrived, I noticed a short and fine strand of wavy hair on my plate. I never encountered a problem at this establishment before, so I swallowed the pill and just wiped it off with a piece of napkin. Gross. I know. Anyone with a toddler who refuses to nap and is beyond restless, while you are starving for a morsel of ANYTHING because you haven't eaten yet, should understand my predicament. \n\nAnyway, after the third bite of my burger, I noticed another strand of hair on my pickle. Honestly, I was in the denial for the first two minutes and kindly asked the miserable waitress, Lauren, if that was really hair. She looked at it and snapped, \"Well, I don't know where it came from because our cook is bald so, what? Do you want another one?\" Shocked and appalled? No. I was LIVID. I asked her if that type of thing happened often, because she was not the least bit phased by the NYC Board of Health worthy complaint. Her response: \"Well, no. This is not something that happens often. I just don't know where the hair came from. It could have come from anywhere it could be from a brush, I don't know. But our chef is bald so...\" Really, Lauren?  Good answer!  I do not care what type of hair is on my plate or where the hell it came from. It freaking HAIR!!!! And it's on my food! It should not have been there. \n\nThe entire time she spent spewing out that asinine response, she stared at my daughter's hair. I guess she was desperate to find an excuse to blame me or even my baby (who has very thick and curly hair, and not at all like the two strands of hair found on my plate) for their screw-up.  I told her that the hair did not come from my daughter's head and that she should stop looking to blame my baby in her next (asinine) response. She snapped out of her desperate gaze and then barked, \"Look! What do you want? Do you want another one? Do you want something different? What?\" Absolutely disgusting! I couldn't believe it!  I told her I didn't want anything. She walked away and as she passed the manager, she casually told her that I may want to speak with her. Wow! Asinine, Angry AND Ballsy! Walter's picked a nice one. \n\nWhen Monica, the manager, arrived at my table, I explained everything that happened. She was apologetic and wanted to make things right with the food. I was grateful for her professionalism, but she did not acknowledge or apologize for Lauren's disgusting behavior. And by that time it was too late. I was disgusted by the horrible service I received from Lauren. I was digusted that my food was ruined. I was frustrated that I was still starving!  Monica gave me her card and offered to comp my meal the next time I decide to eat there. \n\nIt's a real shame. When I dine out, my main expectation is to have a good experience. When I am cheated of a good experience, I lose interest. If I had shared my issue with Monica initially and received great customer service, perhaps I would consider going back despite the hair incident.  However, Lauren's bad attitude and unprofessional behavior has convinced me to cross Walter's off my list of local restaurants.", "author": "Naktastic B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-06-04", "description": "Excellent service - we had such a nice and attentive waiter.  And the ambiance is lively - Walter's attracts a good crowd that makes for a good ambiance. BUT, except for the deviled egg, the food doesn't leave a lasting impression. The dishes were bland at best and the flavor combinations of some dishes were just off - it wasn't just me, but others who felt the same.  And for the price, the dishes are small and don't come with any substantive sides. Certainly not worth the tab.", "author": "Errol B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-28", "description": "SOOOO SOOO good.  \n\nI can't tell you how excited that Walter's now has a branch in South Brooklyn.  I used to brave the hipster-ladden streets of bburg to go to its sister restaurant, so I couldn't be happier that Walter's in now closer than ever.  The food is well-executed at fair prices - I recommend the fried chicken and the steak.  Drinks are very good - including my personal fav the Gold Rush.  Service is swift - it was our waitress' first day but you would never know it!\n\nThe space does get packed and the wait is long, so be prepared to be slightly on top of each other - but hey, this is NYC, it aint good unless you're waiting and sharing tables!", "author": "Jenny M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-05", "description": "Visited Walter's after a late movie at BAM.  Great spot for late night eats in Ft. Greene. lots of small bites, appetizers, and delicious, slightly pricey, drinks.   \n\nA friend and I shared the charred octopus, sweet and spicy wings and popcorn shrimp.  The octopus was amazing. Crispy, octopus in a light dressing with capers and hearts of palm...  I wish I was eating it now.  The wings were very tasty too.. but beware you get 2 \"full\" wings (i.e. drummete and \"wing\" still connected).  The popcorn shrimp was tasty, but not what I was expecting.  It was more like shrimp balls than popcorn shrimp, and there was a strong bacon flavor.  I think I would have enjoyed it more if I wasn't expecting popcorn shrimp.  My mint julep was pretty tasty, but too much ice... and too little mint julep.\n\nReally enjoyed Walters. Definitely want to come back for more octopus and maybe some oysters.", "author": "Nana M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-04", "description": "I only have been to Walter's for weekend brunch, but both my experiences have been positive. The service is attentive (my coffee cup is always full), and the menu choices are healthier than elsewhere (a giant side of fruit, anyone?).\n\nThe location across from the park is great, and the inside is well-lit from very large windows in the front.\n\nTwo complaints: I wish some menu items (e.g., huevos rancheros) were spicy or offered spicy. The hot sauce they supply is weak. Second: The dinner menu (with 11 mains) doesn't have any vegetarian choices other than \"Winter Vegetables,\" which doesn't sound too appetizing as described.", "author": "Jacob B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-17", "description": "Music is great on brunch days! I picked the Fish Sandwich, after a great recommendation from our Server. She was great. Attentive and beautiful. She even cashed out and let us know we we're having a new server , and to stay as long as we wanted. \nShould have cashed out then, because the guy forgot about us. But other than that. Great atmosphere and service.", "author": "Mayra C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-18", "description": "I ate here for brunch with my sister and it was pretty good! We were given free blueberry muffins and they were delicious. I ordered the huevos rancheros and my sister ordered the french toast. The huevos rancheros came with corn tortillas, guac, black beans, fried eggs, and sour cream. They were okay, with everything nicely seasoned, but I probably would've enjoyed them more if I added hot sauce. The french toast was incredible! The fruit compote, which consisted of strawberries, apples, and bananas, was so bright and fruity with the sweet bread. The dish as a whole wasn't too sweet and it was really good. We also got a side of sausage, which my sister really enjoyed. Can't wait to come back!", "author": "Melody L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-21", "description": "I would definitely give this place 5 stars for the food and the excellent waiter Carlos (he was amazing).  But I give it 4 stars because of the horrible inhospitable attitude of the manager.  She proceeded to sit 3 people at a table meant for 1-2 people. We had no limited room for our food. When asked if we could have a bigger table she told us \"we've made this work before\"  I don't care what you made work. She then proceeded to sit 3 people down in a booth. Carlos saved our brunch and made it better, she almost ruined it.  Carlos I adore you.  They did try to remedy the issue with a slice of key lime pie.", "author": "Michelle J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-09", "description": "I went here for brunch after Martha's one block away wasn't quite brunchy enough for my friend. It was great. We were seated within ten minutes of arrival around noon on a Sunday. \n\nThe place is bright with daylight and a fair amount of booths for bigger parties. The menu is a standard brunch menu, with a few eggs benedicts to choose from, a standard two eggs any style and custom omelettes. I wanted to try the tomato egg bake but decided to go for a green salad instead of the toast and potatoes for my two egg combo and it was delicious! Fresh arugula and a creamy vinaigrette. The pork sausage links were on point as well.\n\nMy friend got the eggs benedict and loved it. It's served over home fries and they are made with red and yellow peppers in the hash which is a nice touch!\n\nThe coffee flowed freely and they have decaf coffee!\n\nI love this place. Solid, classic brunch spot.", "author": "Bevin B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-30", "description": "Love the fried chicken here. I always get the pomegranate lemonade but the last time it was a little off. It's a nice, cozy, intimate environment that's great for a date.", "author": "Josephine P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-30", "description": "You may recall back to my review for the Black Swan, wherein I compared it to a real-life Monk's Diner to my Jerry Seinfeld (okay, fine, George Costanza). Well, I moved two miles west and the title has now been transferred to Walter's, which is a much better restaurant in a much better location.\n\nI've been coming to Walter's since it opened, though only for brunch for the first several times, which earned it the fake honor of Best Daytime Restaurant. Even after a double-decker tour bus rolled by my hungover friend and I, sitting outside on the bench waiting for a table, the tour guide announcing over a PA to midwestern moms the sight of bleary hipsters waiting to feed on artisinal huevos rancheros, Walter's did retain the high honors.\n\nI also have found it worthwhile, before moving to a close proximity, to take a car service to eat here. Normally, I won't take a car unless I think I've done something to deserve it, but herding a hungry group of visitors that distance or settling for a closer, less good destination weren't what I felt were viable options.\n\nSo, back to the present. I actually think that Walter's excels primarily not as a restaurant, though it is an excellent one, but as an all-day neighborhood bar with excellent food. I like to pop in on a weekend afternoon and get a solo brunch at the bar (p.s., am I the only one that has discovered the brunchtime superiority of the Campari soda? not unique to Walter's, but try it.) or on a weeknight for a meatball snack and a hundred Manhattans. \n\nThe place is also very attractive and right next to the park, making for a convenient post-food constitutional. And no televisions!!", "author": "Steve C."}], "servesCuisine": "American (New)", "priceRange": "$11-30", "name": "Walter’s", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "166 DeKalb Ave", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/L0O4V6Nl0qRG0YDX8HhcdA/ls.jpg", "@type": "Restaurant", "telephone": "+17184887800"}