{"aggregateRating": {"reviewCount": 485, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-08", "description": "How have I not reviewed Walter's yet? We live in the hood, and have been here on a handful of occasions for weekday lunches and weekend dinners. Consistently enjoyed great service, great drinks and terrific food.\n\nI admit, we've now tried -- or had friends/family who've tried -- much of the menu. \n\nThe artichoke dip is fantastic; probably the best I've ever had and a big portion to boot.\n\nVegetable sides vary by season, and I've thus far enjoyed both shredded brussels sprouts and roasted asparagus with parmesan. \n\nMy boyfriend is a huge oyster fan, and consistently ranks Walter's oysters as top-notch in variety (they often have 6-7 different oysters available) and quality.\n\nLobster pasta and burger are both awesome...and the fries are out-of-this-world good. The little touches make a big difference here, IMHO. The burger, for instance, is served garnished with pickled onions. Not a huge thing. But tasty as hell. Good call, Walter's.\n\nService, for me, has been above and beyond. When our parents visited, we made reservations for the six of us on a Saturday night. They were slammed and we ended up waiting 20 minutes for our table. The manager offered up free drinks and a free order of artichoke dip while we waited at the bar. If only every restaurant was so considerate!! \n\nOf course, the place ain't perfect. If you have wealthy family members in town, this might be the spot to take them (assuming they foot the bill) because it is expensive. Like...$34 pasta expensive. We wish we could come more often, but the bill tends to be prohibitively pricey (also because, frankly, this restaurant brings out the glutton in us both).\n\nLayout and tables are kinda weird, and I think exacerbate the long waits that are inevitable during prime dining times. If they could only knock down a few walls and double the size of the dining room...we'd be all set.", "author": "Katie E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-23", "description": "Perfect location in Fort Greene for a drink and some great brunch. It gets super busy on weekends but the solid cocktails and amazing burger more than make up for the wait. It's super close to fort Greene park making it the perfect sunny summer day spot to hit then move on to sculpt the tan.", "author": "Matt R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-10", "description": "Never disappointed! Luckily this place is close to where we live. The people are great and the food is excellent. They always have great assortment of oysters. I tend to always get the bramble but their drinks are fabulous and great wine selection. I've had from Caesar salad to fisherman's stew. Everything is cooked well with plenty of taste! Happy to have found a place we can always count on for good service and food:)", "author": "Christina L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-06", "description": "The fried chicken is beyond. The brussels are beyond. The filet mignon dip was beyond. Delicious food, friendly service. Not huge portions -- just right. Makes you want to return ASAP.", "author": "Jon P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-01", "description": "This is our new local place for dinner.  Great cocktails and really good quality entrees.   The 1/2 roasted chicken was perfectly cooked and the catfish was excellent.  \n\nThe service we had both times we've eaten here has been great and overall a great atmosphere.", "author": "Anju R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-23", "description": "The first thing that comes to mind: Mad Men meets foodies. There is some serious styling going on here. But since the food and service matches up, it's all to the good. The menu offers homestyle classics straight up out of granny's cookbook, ie: Deviled Eggs, as well as some East Asian swagger, ie: Duck Buns. \n\nThe food - fantastic. Service: stellar. Ambiance: people from all over kreayshun. Granny's and hipsters. Red and Yellow.\n\nWalter's is a fabulous addition to the neighborhood.", "author": "Lans S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-12-27", "description": "We were super excited to go there with family for a holiday dinner and we tasted quite a lot of the menu.  Sadly, with the exception of one or two items, all of them disappointed: \n\nappetizers:\nduck buns - not great- and cold?\npopcorn shrimp - just plain weird.  unappetizing.  not good. \nbib salad - a bit heavy on the dressing, was just OK\nescarole salad - fine but rather boring. also wished the avocado dressing was tossed into the lettuce\nbrussel sprouts - they tasted almost overdone or fried \ncrab cakes - pretty good!\n\nentrees: \nburger - good, though heavy on the roll compared to the filling\nbar steak and fries - excellent all around, including the chimichuri \nlobster salad - refreshing and tasty \n\ndesserts: \nkey lime pie - delicious\nbanana bread putting - delicious\n\nwait staff were very nice, and the atmosphere was beautiful (though I agree with previous reviewer about the amonia/fish smell).  \n\noverall, there were way too many underwhelming dishes and i don't think we'll head back considering all the other tasty options in the area.  disappointing.", "author": "Brenda D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-24", "description": "This a great little place for food and drinks if your looking to party. Nice Booz selection. The music is loud. Service is great and food is delicious!!!! Not very big so it feels cosy.", "author": "Jeremy W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-12-03", "description": "I cannot say enough positive things about our first experience at Walter's. As a Ft. Greene resident, it comes at no surprise that new things keep popping up recently. This being said, Walter's is by far the best and most well thought out establishment that I have stepped foot into in our neighborhood. The atmosphere was calm and chill with a hint of hipster, but it was all worth it once we sat down.\n\nWe got one of the last 2 tops on Friday night @ 7pm. We were seated VERY close to other tables of 2, but it didn't feel cramped. The restaurant was packed and bar was hopping. The bartenders and waiters are all dressed in white with bow ties. This was a cute touch! The decor is simple, but very well thought out. This is a small restaurant, so whomever designed it used every inch in the best way possible. Well done.\n\nEverything on the menu sounded yummy and the raw bar was stocked. We settled on 2 very different entrees and a salad. Here is the run down.\n\n1) Bibb salad: bacon, chives, radishes w/ a lemon buttermilk dressing. \n2) Burger: comes on brioche roll with cheddar, bacon, onion, tomato, etc. + Fries.\n3) Whole grilled red snapper with olives and capers (this was a special)\n4) A side of shaved brussel spouts with hazelnuts, pickled red onion, and pecorino\n4) Banana white chocolate bread pudding\n\nAll of the food was perfectly prepared and delicious. The salad was perfectly dressed and the fish and burger were prepped with care and precision. The sprouts are a must and the fries were perfectly seasoned and crisp.The dessert was sweet and creamy and the perfect end to a great meal. \n\nThe only downside I can see is that this restaurant is one block from my home! Dangerous :) For all of those out there that think that this place may be out of your price range, please give this place a try. There are a few places in the neighborhood that charge about the same, but NOTHING compares to a nice night at Walter's. If you are spending the money, Walter's is a welcome addition to the date night rotation. I was hesitant at first when this place was announced, but now am eating my words and BOY ARE THEY DELICIOUS!!!", "author": "Pamela S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-16", "description": "I live on the UWS but am already scheming reasons to get back to Fort Greene just so I'll have an excuse to eat at Walter's again. Went for dinner last night, the octopus is great, I've had lots of octopus all over NYC but Walter's was surprising, a preparation I've never had. My mouth is watering just thinking about it. Also, if you are a brussel sprouts lover the side is eye bulgingly good... again prepared in a surprising and delightful way. Five stars easy for quality and creativity.", "author": "jamie f."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-20", "description": "I love the one in Williamsburg, and was excited to hear that there was a new one opening a block from my apartment.  We were told that the wait would be 15-30 minutes, and that they could call us if we wanted to go somewhere else while we waited.  We put our names down and walked home to chill until she called us.  40 minutes later, we called and she asked us to come back.  I thought that was a bit ridiculous.    \n\nWe went there the week after the opened, and my dish was delicious!  I had the lobster with pasta in a light creamy tomato sauce.  The pasta was al dente (just perfect), and the lobster was succulent.  \n\nWe shared half a dozen raw oysters to start, which are always fresh and delicious there.  \n\nMy boyfriend had the fried chicken and he was disappointed.  It was a bit too fried...almost burnt.  He is not one to complain nor is he one to send back food, but he just couldn't eat it.  The waiter took it back immediately and the manager came over to apologize.  \n\nReally great service, excellent food, and good drinks!", "author": "Emily L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-05", "description": "The food here was excellent and original, from the deviled eggs and charred octopus to the fried chicken and linguini with clams.  A surprisingly delicious side was the cold, shaved brussels sprouts salad with hazelnuts and pickled onion.  Service was very attentive.  The positives vastly outweigh the negatives, and we will definitely be going back.  That said, there is room for improvement in their reservations system (extremely limited), getting through to an actual person on the phone, and the limited menu (wish they would add a couple of more things in each category).", "author": "Amy M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-06", "description": "Always on point. Great drinks and bar vibes. Fried Chicken and Filet Mignon French Dip are not to be missed.  Excellent corner location across from Ft. Greene Park.", "author": "Sam C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-20", "description": "First up: we were waiting for a good twenty minutes to get seated. Not really the restaurant's fault, as a bunch of people decided to sit around shooting the breeze for about twenty minutes after their meal while a queue backed up out the door...grrr.\n\nNow for the good. Service was prompt and courteous. Our waitress was very pleasant and quick on the draw without being overbearing. For the meal, I ordered the burger...holy crap. The. Best. Burger. I. Have. Eaten. In. New York. Seriously. Puts places like Paul's and the Corner Bistro to shame. Absolutely delicious and cooked to perfection. This is going to have to be one of the places I bring guests to eat at whenever they come to visit me. Seriously, seriously good. I'm getting hungry just thinking about it.", "author": "Michael T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-12-29", "description": "I've had dinner at Walter's on a few occasions since it opened, and each experience there has been great. Walter's is located on a corner across from Ft. Greene Park, and as you approach the restaurant at night the warm glow of the interior (visible through large windows on both sides) offers an inviting preview of what's inside.\n\nThe menu feels both classic and up-to-date. Some of the best dishes I've tried: the bibb salad (crisp and delicious. The citrus in the dressing really complements the flavor of the bacon), the Brussels sprouts (awesome, and I don't even usually like hazelnuts -- tasting them prepared like this inspired me to try shredding them at home), the broccoli rabe, the spicy fisherman's stew (definitely the highlight of my first visit) and the lobster salad (I love that it's made with fresh mint). I've also had the bar steak (a frequent go-to order for me when I can't decide what else to get). I like that the emphasis at Walter's is on seafood but you can still get a very good steak, too.   \n\nOn another occasion I came in solo and sat at the bar after shopping at The Brooklyn Flea. It's nice to see a real-deal, serious bar in Ft. Greene. I ordered the smoked trout, which is served on a wooden board with toast points and a hard-boiled egg. It was a perfect afternoon snack, and I could see it also being great as an appetizer to share. Later a friend wandered in and wanted oysters. I like briny oysters, and she prefers them on the creamier side. The bartender suggested a good mix of both. My favorite touch was the mignonette duo: in addition to a classic mignonette, Walter's also gives you a version made with cilantro, which is a cool update. \n\nService has been very good on each of my visits. The servers are friendly, polite and attentive, and happy to correct any small mistake. Each time I've been in, the manager has stopped by the table at some point to make sure everything is good, even when it's very busy.\n\nI haven't made it in for brunch yet, but I'm excited to try it. Walter's is a great addition to the neighborhood!", "author": "Kevin G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-21", "description": "If I could give this a 4.5, I would.... not only because I like decimals (Come On, Playas!  Who don't like the dot?!), but because it is not quite a 5 and Definitely More than a 4!\n\nMy lady and I have eaten there twice and both times, the food was fantastic, all around the table.  So, I'll focus on some of my favorites:\n\nOysters on the Half Shell - Yup.  Slurp.  Scream \"Yum! Now that is what I'm talking about!\"  Repeat.\n\nThe Popcorn Shrimp with Bacon Mouse - THIS IS THE DISH THAT MAKES YOU SLAP HIGH-FIVE WITH RANDOM PEOPLE \u0026 then get into a Foodie conversation with them!  Crispy on the outside with some bite left on the perfectly cooked shrimp, inside.  Then you have the Bacon Mouse - WHAT?!  HUH?! YES!  YES PLEASE! - which is light and creamy (not heavy like some mouses... it almost has an aioli consistency) and smokey and bacon-ey.  It is the perfect outfit to compliment the hot body of this supermodel starter.\n\nSpicey Fisherman's Stew - Rich, hearty, stew-ey goodness.  Delicious!\n\nThe thing that would keep this from rolling into the \"5-Star\" bracket for me would be the two fish dishes I ordered (on two different occasions).  One was the Blackened Catfish and the other was the fish special.  Both were cooked perfectly - that was not the problem.  My issue with both dishes is that they were very, very small... too small.  In fact, they both could have been a large starter, and though they were tasty, neither was quite worth the price point.\n\nOn the plus side, the servers \u0026 bar staff were all well informed and excited to talk about the food. \n\nIn the fabulous foodie area of Fort Greene, Brooklyn, this has jumped up to one of my favorite restaurants!", "author": "Bob K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-15", "description": "The place gets crowded around 7pm for dinner. I had a failed attempt to go here a few months ago and my friends and I arrived closer to 8 and had to wait 45 minutes. Needless to say, we went somewhere else.  Most recently, I went here with my husband, and we arrived around 6pm and there were plenty of seats. We definitely started to see the place fill up around 7pm. \n\nOverall, I thoroughly enjoyed me meal! \n\n1. Cucumber Mint Lemonade - Tasted like a refreshing virgin mojito with cucumber. I started refilling the cup with water since there was so much cucumber and mint in my drink. \n\n2. Ceviche - sooooo good with the corn chips\n\n3. Buttermilk - Fried Chicken - was ok.  I think I'm too obsessed with Popeye's fried chicken to appreciate fancy fried chicken. My husband enjoyed his half chicken though. Apparently it was the best chicken he as ever had. lol\n\n4. Strawberry panna cotta - It was topped with pineapple shaved ice and blueberries. It was totally better than I had expected. I practically ate the whole thing! \n\n3 out of 4 were absolutely delicious and that isn't too bad. Next time I'll be sure to try the steak and the popcorn shrimp. However, my husband's plan is to eat all the appetizers (tapas style) because all of the appetizers looked so good!", "author": "Cathy C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-29", "description": "Great Waffles.   Good spot for breakfast on the weekends.   Ft. Greene park is right across the street so it's a good stop for families who want to bring the kids out after a great breakfast!", "author": "Sean L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-27", "description": "Laid back, fantastic drinks, dreamy decor. I've spent lots of time here talking with friends. It's a really nice spot.", "author": "Julia M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-10", "description": "Walter Foods in W'burg is one of my favorite restaurants in NYC, so I was excited to see they opened Walter's in my hood.\n\nI'm even happier to say that my experiences at Walter's have been on the same level as the W'burg location.  Food is good, solid and consistent.  My boyfriend and I generally sit at the bar because I think they have some of the best bartenders around.  \n\nA good friend of mine described the restaurant when it first opened as, \"The kind of place you go and saddle up at the bar for the night\" and I find that to be the perfect description.  It's relaxed, good atmosphere, friendly, tasty and i've never felt rushed.", "author": "Katie c."}], "servesCuisine": "American (New)", "priceRange": "$11-30", "name": "Walter’s", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "166 DeKalb Ave", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/L0O4V6Nl0qRG0YDX8HhcdA/ls.jpg", "@type": "Restaurant", "telephone": "+17184887800"}