{"aggregateRating": {"reviewCount": 485, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-20", "description": "Spent my last day in Brooklyn with the bae! Shout out to people in LDRs btw! Anyways we ordered the artichoke cheese dip!!! Omg this was soooo good paired it with some hot sauce and it was heaven. Thanks for having us!! I'll be there again when I visit back in a couple of m", "author": "Geno F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-14", "description": "I had the chicken and waffles and the cucumber mint juice. It was absolutely delicious. It's a young crowd with an old diner vibe. It's a small restaurant and has about a 45 minute wait.", "author": "Alexandra C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-13", "description": "I love Walter's! It's my favorite neighborhood spot, and meals are always delicious, especially the fried chicken, French dip sandwich, chocolate banana bread pudding, and deviled eggs. But, FOR THE LOVE OF GOD, please bring back the bucatini to the menu! Would like to see a bit more variation on the menu as well.", "author": "Lisa K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-21", "description": "Went for a work dinner. Service was fantastic. Food and drink were awesome. Fish, steak, roast chicken, pork chops, mussels were all amazing. Lots of apps that were flavorful as well. Would definitely go here and recommend to others. Small place, but its cozy.", "author": "Allison E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-22", "description": "We had late reservations for a Friday night (10pm) and although our table wasn't quite ready yet the staff was friendly and accommodating and set up a makeshift table for us while we waited.\nWe ordered drinks in the bar while we waited, and everyone was satisfied with their selection. Personally, it was the best Pimms cup I have had in a while, they are pretty hard to come by in the city and this rivaled the ones I have had in New Orleans. We ordered and shared the special salad which had watercress, and roasted winter veggies like beets and cauliflower along with pepitas and a cheese of which I was not familiar with. Since it was late I didn't want to order a full entree but ordered from the 'bar snacks' portion of the menu which was $5 each for wings (2 to an order) and boneless ribs (3 to an order). Both were delicious, hearty and satisfying, I couldn't finish either. The ribs were especially amazing with what I figure was a homemade BBQ sauce. The wings were good, unique with a sweet and spicy red sauce. \nOverall I had a great experience and hope to return soon!", "author": "Marisa L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-09", "description": "This place was amazing!  I know people always say \"Neighborhood gems\"  But this is one of them!  I've always been so curious why the place was always packed whenever I walk by but now I know.  The food is delicious!\n\nThere was so much on the menu that I wanted to try and it was just not possible to order everything!  To start of the night, we had cocktails because there's no reservations for 2 topper tables and the place was full.  We grabbed our drinks at the bar and waited patiently for a seat.  If you have 4 people in your party, make sure to make a reservation ahead of time.  I had the honey suckle cocktail and it was a light and refreshing drink! Nice balance of sweetness and sourness.\n\nFor our appetizers, we had pork fritters, charred octopus AND beet and fennel salad.  Everything was delicious and fresh!  You can taste the quality of each ingredient.  Dinner for me was Pork Chop.  It was really juicy and cooked just right.  Too bad I already stuffed myself  prior to dinner cause I had to take the food to go.  Oh well, tasty leftovers for me after!\n\nWIll definitely try to go back and try their brunch or I wouldn't mind going for dinner again.  Price point was good. Food better!", "author": "Marybelle P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-23", "description": "Brought my sister there for the first time and we left the place in a heavenly food daze like walking on clouds. We started off with the popular artichoke dip, lentil soup,  tuna salad, saigon sandwich, and finished off with their scrumptious key lime pie and flourless chocolate cake! All this was highly recommended by Riki + Charly whom are two of the very best servers I've had when eating at Walter's. Even the runner, Luis was specially attentive to filling up my teapot of hot water and our water jug.  Cutomer service's charming smiles  double the stars of the food! Sister and I left there very stuffed and satisfied! Will most likely bring friends there! ! :)", "author": "Life Enthusiast H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-31", "description": "We love LOVE this place. The hangar steak and greens (we do double greens) is out of sight. Burger is awesome. Seafood stew is tasty and hearty. Desserts are insanely good.\n\nFun place to come grab a drink too. The sunlight in the summer makes it a perfect day drinks place.\n\nWhiskey selection is good too!\n\nStaff is great and when something goes wrong, management jumps to resolve.\n\nWe're big fans of this and their other location.", "author": "Ron W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-13", "description": "LOOOOOOVE me some Walters!! The entire staff is so sweet, so warm and makes me want to come back just to have conversation with them. The spinach artichoke dip is one of my favs and I love the Fishermans Stew. I don't eat meat but have heard great things about the steak and fried chicken. My father is convinced that Walters has the best French fries in all of Brooklyn. I'm also looking forward to having brunch at Walters soon, seriously such a great restaurant!", "author": "Kayla G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-17", "description": "Ordered the Bucatini and the grilled Octopus... they changed my life. My wife is now pregnant because of it.", "author": "Glenn G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-06-17", "description": "The classic American cuisine was adequate but the service was horrible.  The bartender never greeting me, served individuals that arrived after me and never once tried to rectify the situation . After sitting for good while with the bartender passing me repetitively - i had to stand in front of her - to get my check. Good place horrible service.", "author": "Shernique W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-07", "description": "Love the food, drinks and atmosphere. Can get pretty cramped at peak times, would recommend off hours for best experience.", "author": "Marion C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-25", "description": "I have two words - and two words only - Are you ready...................... \"FRIED CHICKEN\"\n\nThe Fried Chicken here is out of this world. It is JUICY, TASTY, \u0026 CRUNCHY....... DELICIOUS!\n\nThe salads are SO GOOD - I also enjoy the omelet bar option. The employees are very Friendly - especially the Tall Guy who meets at the door - He is cute and quirky!\n\nWalters is the place to be for BRUNCH...... HAPPY EATING!", "author": "Nadia A."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-03-22", "description": "Decided to check this quaint place out for Saturday brunch and the I wish I could say I enjoyed the food as much as the atmosphere/diner feel. No bottomless mimosas but that's okay... if that's your thing. I tried the chicken and waffle and it was meh. Waffle was hard/cold and overcooked. I asked for a new waffle and they did replace it with a warm and fluffy waffle. The chicken was okay. They offer a cider syrup and brown sugar butter. Well in order to balance the cider syrup you need the butter. My butter was really cold and the waffle temperature wasn't hot enough to melt the butter, making it really hard to spread the butter and really enjoy the cider syrup. It was just too much. I'd suggest room temperature whipped butter and warm cider syrup. If done right the flavors would be amazing. Super tiny restaurant not great for groups but we managed. Nice spot for an intimate dinner.", "author": "Danielle F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-14", "description": "This is absolutely one of my favorite places in Brooklyn. Their cocktails are great and comparable in price to other places in the area. The food is always spot on and delicious. And the oysters... Oh, the oysters. \n\nReally love coming to Walters with a small group. Their bartenders make great drinks and they're always happy to make you something even if it isn't on the menu. The oysters are definitely some of the stars of the menu at Walter's and the variety of oysters they have here rivals any other place I've been in Brooklyn. There's always been at least 6-8 choices on the menu. The entree menu is regularly changing and while there are some longstanding favorites that seem to have made the cut over the past few years (yum, fish stew!), all of the new items are delicious and well put together as well. \n\nI would recommend Walter's to anyone who loves good food and drinks in NY. It is most certainly one of my favorite restaurants. Be prepared to spend a bit when you go here, but also know that it's worth it!", "author": "Chris T."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-02-15", "description": "Came here a while back after a game at Barclay's. \n\nI tried the clams, octopus, and fried chicken. \n\nClams had sand in them - not well cleaned - did not enjoy.\n\nOctopus was really oily... but not bad. It was pretty charred so it altered the texture a bit - making it more mushy than chewy. \n\nFried chicken was probably the best part of the meal. Came with mashed potatoes. \n\nThe inside was darker than a bar. Literally the only source of light was a tiny votive candle on the table for 6 people. We almost fell asleep. All in all, did not leave much of a positive impression. The prices are pretty high - but given the neighborhood it's in, it's expected. Cucumber water was a nice touch, I guess.", "author": "Sweenly L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-30", "description": "The drinks and the food options are awesome. They use top shelf liquor. The service is fast and friendly.", "author": "Brownskin C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-12-04", "description": "An enjoyable meal in a pleasant neighborhood restaurant. The cocktails and food are well prepared. Nothing was spectacular, but nothing was disappointing. A good option for a pre-show dinner and a short walk to BAM.", "author": "Alan L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-14", "description": "Love this place. Awesome menu and great drinks. The atmosphere is unique and cozy and there usually is not too long of a wait. I highly recommend eating here, particularly for brunch.", "author": "Mary l."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-02", "description": "I enjoyed late night drinks with my girlfriends here last week.  It was a week night, but the place still had a decent crowd for around midnight.  We ordered fries to share-- thin, yummy and perfectly fried-- and an artichoke dip which was very tasty.  The dip was served with this crunchy bread slices and let's just say, my girlfriends and I scraped the bowl clean.\n\nFor drinks, I asked the bartender, who was wearing a neat bow tie, for a recommendation.  My friends and I had just come from bar-hopping in the area and did not want a weak, fruity drink.  He recommended something I forget the name of.  I could tell the drink was well made, and yes it was potent, but for flavor it wasn't my favorite.  I guess I underestimated how \"bitter\" a drink could be, as that was the word he used.  But I did finish my drink and was all the more merrily for doing so.  \n\nI'd love to return for dinner very soon.", "author": "Maria M."}], "servesCuisine": "American (New)", "priceRange": "$11-30", "name": "Walter’s", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "166 DeKalb Ave", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/L0O4V6Nl0qRG0YDX8HhcdA/ls.jpg", "@type": "Restaurant", "telephone": "+17184887800"}