{"aggregateRating": {"reviewCount": 485, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-29", "description": "I found myself in the area and hungry, and thought about going home and making dinner. But then I remembered Walter's and parked myself at the bar instead. It was around 6 or 7 on a Saturday, so I was part of the pre-dinner group mingling in the restaurant. The bartender doubled as my waiter, and he was perfect--friendly and attentive but let me take my time ordering and eating. I got the burger, which is a safe pick, but this one was dressed up by the pickled red onions and came with the thinnest crispy fries. It satisfied my hunger pangs. Sitting at the bar was great as well, and I would recommend it for other solo diners. It started getting crowded as I was leaving, so come early to claim your spot.", "author": "Chey H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-12", "description": "OMG!!! I could not give this place enough stars!! We were a group of 7 (not all of us were on time..as usual) I sat at the bar and had one of the best dirty martini's EVER!!! We were then ushered to our seats by one of the most accommodating hostesses whose name I believe was Kaitlyn (after 3 martini's things started to get fuzzy..they were on point!).\n\nWe started out off with apps which were oysters and this phenomenal artichoke dip that was cheesy, spicy goodness in a bowl. We each tried to order something different and I'm soo glad we did because everything was amazing!! There was this fried chicken that was crispy on the outside and tender and juicy on the inside (garlic mashed potatoes side), a baked chicken that was so moist it was almost sinful! My sister had this French Dip sandwich that made you want slap somebody(with these incredible shoestring fries) and for the finale I ordered the steak (accompanied by horseradish and chimichurri sauce) that was cooked to perfection!! \n\nIf you haven't gone get your ASS there and if you have, try not to visit too many times so that I am guaranteed  a spot for my return visit!! Great job from the front of the house to the back...I'll see you all very soon!!", "author": "Catherine R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-06", "description": "The food is always dependable, the service is spot-on, but the music! Thank you, Walter's, for throwing me back to my twenties. As a woman of a certain age, hearing Blondie, the smiths, the cure, psychedelic furs, echo and the bunnymen, the clash, roxy music... well, it's a throwback to another time, and I love it. On top of the good food and service, I get to feel young again. Whoever is making your playlist??? Thumbs way up to that person.", "author": "Amy P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-12-24", "description": "The food was pretty good.  Went here with my girlfriend, she got the fried chicken and I chose to order a rib-eye that was off the Specials Menu.  So, overall the night went very well until I got the bill.  Here is the breakdown of it: \n\nWings- $5\nSalad- $12\nFried Chicken- $13\n\nBrace yourself... \n\nRib-eye- $57.00.  \n\nShould I have asked about the price upon inquiring about it?  Yes.  However, shouldn't the waitress have informed me that this dish was now almost $30.00 more than the most expensive dish on the menu?  I think so.  Should the restaurant have posted that price somewhere?  Yes!", "author": "Mike T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-12-30", "description": "Good food and nice ambiance but very loud. Hard to have dinner conversation unless you are borderline shouting. I would definitely come back to try more of the menu though- burger was good!", "author": "Annie D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-28", "description": "Walter's is a great neighbourhood spot near Fort Greene. I like it because it serves all the brunch classics- the chicken and waffles and eggs Benedict were delicious! The restaurant itself is quite small, so you might have to wait a little bit, but that only adds to its charm. My waiter was quite friendly. Although the food was tasty, I thought the eggs benedict were a little prices given the portion and neighbourhood.  \n\nOverall, this place is good and reliably tasty.", "author": "Matilda B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-19", "description": "went here with a group of friends last night and had a great time. to start we shared the wings and the fried green tomatoes- both were really great and the tomatoes came with this awesome dipping sauce. landed on ordering the French dip (caramelized onions and cheese added obviously) as my entree and loved every second of eating it. drinks were also well made and reasonably priced. the service was outstanding. can't wait to come back!", "author": "Kitty P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-05", "description": "The place was crowded but we managed to get a table for Sunday brunch. The service was fast, friendly and effective, and the food was just as amazing. We will definitely visit again if given the chance.", "author": "Artturi K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-16", "description": "The Good: I ordered the BLAT. Bacon, lettuce, avocado, and tomato on a slightly toasted kaiser bun with chipotle mayonnaise. It was divine. The bacon strips were nice and thick, and perfectly cooked. The other ingredients were super fresh. I paired it with an Arnold Palmer. \n\nThe Bad: My server was Bridget. I found this out when she brought me the bill. But I must use the term \"server\" loosely. Because she never brought me a menu. She never actually took my order. She never checked on me during my meal. Who did all of this? The busser and the manager Ruben. \n\nI offered the 20% gratuity tip to the busser, who truly deserved it, but he refused to accept it. Because I am not an asshole, I left it for Bridget anyway after telling Ruben about my experience.\n\nOverall, Walter's is cool. I do like the vibe, the menu looks interesting, and I definitely want to check out the bar. But if Bridget's ass is working, I do not want to be seated in her section.", "author": "Jay F."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-03-14", "description": "Well the food just isn't that good. There's really not much else to say. It almost seems as if they just don't care that much. Besides that place and get really obnoxiously loud when it's full because of the acoustics. Kind a looks cute from the outside and has a great corner location, but inside again it's like they tried when it first opened and now they just don't care.", "author": "Marco B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-09-03", "description": "Eh. Food is good but $12 for 3 tiny pieces of fried chicken with no sides? Am I still in Ft. Greene?\n\nChecked it off my to try list but won't be back for more.", "author": "Lana V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-10", "description": "An unbelievable meal, service was outstanding, management staff engaged with us making us feel welcome.  Anyone should make this and the secret restaurant in the back (find out for yourself) a destination.", "author": "Sean T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-27", "description": "Came here with my daughter last November ('14).  Don't remember what I ate but it was good. I do remember the Pimms Cup - delicious. And meeting Ted from \"Queer Eye\" \u0026 Food Network. Such a gracious person. \n\nWill definitely eat here again next visit to NYC. \n\nBTW I moved to LA last month \u0026 NYC beats it hands down. California is the land of the rude; the Capitol being Santa Barbara.", "author": "Susan C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-15", "description": "Went here on a whim for brunch and was so happy. The food is delicious. I enjoyed the huevos rancheros and my boyfriend loved his eggs benedict.\nThe service and atmosphere was excellent. I recommend eating here.", "author": "Veronica W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-30", "description": "Not only is the food finger licking good but its picture perfect!! Presentation is second to taste and Walter's perfectly achieved both. \n\nMy review is strictly based on my Brunch Experience.. the Staff was friendly and polite and the food couldn't have come out any quicker. \n I had the French Toasts which were DELICIOUS!!! My boyfriend ordered the Egg Benedict Smoked Salmon which he enjoyed... I was too full from the 2 of the 4 French toast to taste his food but it looked really good. \n\nWe will be returning to Walter's to try their other goodies.. Our friendly table neighbors recommended we try the omelets on our next visit but I'm already dreaming of being reunited with those French Toast!!\n\nOh and my leftovers tasted even better the next morning!!! \n\nI may have found my Brooklyn Brunch Fav", "author": "Talisa G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-03-24", "description": "We went to Walter's yesterday night with my husband.\nThe food was good, we had octopus as an entree and he had the fried chicken and I had the burger myself as the main. \nThe portions are big, so you wont starve and the quality is really good, food was very tasty, we enjoyed it a lot.\nThe service was good too, no complains here. Even though we almost didn't hear any of what the waitress tried to tell us.\n\nThe only thing made a difference (in a bad way) to me, is that the place is very very crowded and the acoustics is HORRIBLE. The tables are almost touching in between, I understand you want to sit as many possible people at the same time, but sometimes you have to provide with some personal space to people in order to offer a better/nicer experience, right? I kept on kicking the person in the other table every 10 minutes...\nWe've spent almost 90% of our dinner not talking and trying to concentrate regardless the person by our side was one of a loud loud speaker.\nI would give the place a 3.5 stars.\n\nAt the end of the day, if you are a sensitive person regarding sounds, I would say just walk away and find another spot (Martha's is much better in this sense).\nI would like to come back, maybe I will if I just walk by and it's almost empty, if not... forget it.", "author": "Lau G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-11", "description": "Had an awesome lunch here today!\nOrdered the BLAT along with a Pomegranate Lemonade.\n\nBLAT was their take on BLT + Avocado and was amazing. The bacon was delicious, smoked to perfection, and had a rich flavor rare in a traditional BLT. Fries that came with it were amazing, skinny, crispy and tasty. Pomegranate Lemonade was the real deal, tasted fresh, tart, and refreshing. \n\nAtmosphere of this place was super cute, trendy, and clean! Even the bathroom smelled nice thanks to a cute little candle. Love the weird tiling on the floors and the mismatched chairs throughout the place. Bar area looked interesting and offbeat as well. \n\nWill definitely be back!!", "author": "Natalie D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-20", "description": "I loved this place and will definitely be returning. We went for Saturday brunch just before noon and were seated immediately,keep in mind it was just two of us. Our server was kind and prompt and we sat in the front window which had a lovely view of the street and the park. The restaurant was clean as well as the restrooms.\n\nI ordered the breakfast sandwich and my friend ordered the chicken and waffles,both were delicious. I had a nice cup of coffee and she enjoyed a pomegranate lemonade which she said was \"so good.\" The food orders we saw around us looked great as well.\n\nOverall this was a great place for brunch, the atmosphere was nice and the food was great. It was a bit rainy the day we went but we will be sure to go back on a day where the sun is out so we can browse the farmers market across the street and take a walk through the park. I would definitely recommend this place.", "author": "Jasmine T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-03-08", "description": "I came here on a Monday afternoon with my mom for her birthday to realize the menu was limited at that time. No big deal, minor set back. I chose the fried chicken and my mom got the fish tacos. The fried chicken was very moist/juicy and it comes with a red cabbage dry slaw that is just ok, however the combination of the chicken and slaw on a fork works. The fish tacos were mediocre as well. I wished they had dessert items on the lunch menu, that way I didn't have to take mom elsewhere for dessert.\nI can't say this place wowed me but it's worth a try. I want to go back to experience the dinner menu.", "author": "Jenya W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-06-04", "description": "(3.5 stars)\n\nI've walked by Walter's a million times at night and it oozes sex appeal: beautiful people standing outside smoking and laughing and the whole deal.  I went for lunch a few days ago - it wasn't quite as sexy as the dinner scene, but the space itself, at least during the day, feels like a Parisian bistro which had its own charm.  Two quirks about lunch - first, the menu is pretty limited (we all ended up getting what they call the Saigon chicken sandwich, which is really a modified banh mi) and it certainly doesn't have many veggie options.  Second, at least the afternoon we were there, they only had one waiter who was doing it all - bartender, waiter, host, busboy.  He was super efficient, but it meant that the pace of things at Walter's was a bit slower than one might expect.  As for the sandwich, the faux banh mi was pretty good - the bread was harder than one would want for a banh mi, but the chicken was flavorful, and piled high with daikon and carrots and jalapeno.  I look forward to coming back for dinner and finding myself among the sexy folk.", "author": "Jennifer N."}], "servesCuisine": "American (New)", "priceRange": "$11-30", "name": "Walter’s", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "166 DeKalb Ave", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/L0O4V6Nl0qRG0YDX8HhcdA/ls.jpg", "@type": "Restaurant", "telephone": "+17184887800"}