{"aggregateRating": {"reviewCount": 485, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-09", "description": "Favorite Spot in FT. Greene. Feels almost like a second home, don't know if that is something I should be admitting to :) The staff is absolutely lovely from the superb bartenders to the courteous waitstaff. It really is the best place to go if you just want a great lunch/dinner and be absolutely taken care of. I usually sit at the bar and drinks margaritas and eat their AMAZING selection of oysters. However, their deviled eggs, fried chicken, fries and burgers are all fcking delicious as well. Atmosphere is an A+. \n\nOne thing I would say is that I wish they had a good healthy green salad option on the dinner menu... so that I wouldn't be constantly tempted to get the fried chicken...", "author": "Marykate M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-07-15", "description": "Was not bad. Come here for burgers and apps, and if you get that you shouldn't be disappointed in the least. \n\nOur waitress seemed to be upset with life. =/", "author": "IshaggedSpicoli K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-19", "description": "I came for the eggs florentine and stayed for the cute waitstaff dressed in bow ties.\n\nPretty straightforward place as far as brunch goes. Atmosphere is good, prices are fair. As I recall, they don't do any substitutions- however they did swap out my home fries for their delicious french fries. Sorry to all you home fry lovers, but they just don't do it for me. \n\nGive me deep fried or give me death!!! (You can put that on my tombstone)\n\nRIP. Death by fry.", "author": "Jessie M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-22", "description": "Yummy burger. \n\nWings are sweet and very spicy!\n\nHeard the chicken and waffles are awesome but only available for brunch. \n\nDrinks: Bramble was good. Hemingway daquari is okay. Opt for the Singapore sling. Best of the three drinks we tried.", "author": "Marjorie W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-01", "description": "We came here for brunch on a Saturday at 1:30. Definitely be prepared to wait around a half hour if you come with a bigger group. The staff was really friendly and the restaurant itself is very cute. The food was solid. I got the huevos rancheros and my boyfriend got the chicken and waffles. Not the best we have ever had of either but definitely very good. The brunch cocktails were awesome. Would definitely return.", "author": "Alyssa P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-22", "description": "I'm happy to say that I recently returned after a 8 month boycott and I feel we were warmly welcomed. The food was as tasty as I had remembered it ! I love the oysters and I am very confident that they are always fresh. I am very careful as to where I will sample seafood !\nI will once again make Walters a frequent dinner location ! I do feel we \"buried the hatchet\"...and I'm happy for that !!!", "author": "Anne B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-07-16", "description": "Went for brunch with out of town friends before heading to Brooklyn Flea. Thought it'd be perfect given the good reviews. It is a gorgeous space and we had a nice waitress, but the food was awful. It was cheap diner food at ridiculously inflated prices. The egg in the Benedict was rock hard and the Huevos Rancheros tasted like it came out of a can. The OJ was fresh, but that was it. Will look to check out Martha or Olea next time.", "author": "Hip M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-26", "description": "No review on the burger? Really? \nThis is the best Burger I've had in NYC. Period. Walters is a really great vibe, great food, great cocktails. Go for the orange manhattan.  \n\nStaff is ok. Some are great. Some could be friendlier. Bartenders are good. Some better than others, but I still have to rate them highly. \n\nAll in all, Walters is always a great experience!", "author": "David H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-25", "description": "Came here for a quick burger with my family. Very good! Nice decor. My family was really happy we found it. It seems like it is a very popular brunch spot. I've tried to get in once but the lines were too long. \n\nI hope to go back and try more of their food.", "author": "Sophie M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-20", "description": "Cool ambiance, good date spot, nice cocktails.\n\nAMAZING octopus.", "author": "Pan P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-21", "description": "Great customer service and great food? You win, Walter's.\n\nA friend and I stopped in here one evening for dinner and I was immediately smitten with the atmosphere of this place. Very classic and almost retro. We noticed that there wasn't a hostess so we approached the bartender and asked him if there were any tables available. He saw that there was just two of us and he quickly showed us to a nearby table. The waitress seemingly popped out of thin air with glasses of water (with slices of cucumbers inside, how cute!)  and informed us of the special for that evening. We decided that we both wanted to try the Walter's Burger and let me tell you...when I say this is one of the best burgers I've ever had...I genuinely mean it. The fries were on a whole different level, they didn't need any condiments whatsoever - they were perfectly fine on their own. Sometimes you eat something that just tastes so good that it's almost confusing, and this was one of those times. I didn't understand how french fries could possibly be that delicious.\n\nDuring our meal, our waitress politely asked us if they could move us to another table due to a reservation that showed up 45 minutes early and we obliged. Not a problem whatsoever. Our waitress then gave us a free apple pie a la mode at the end of our meal for being accommodating. So lovely!\n\nI HIGHLY HIGHLY HIGHLY recommend Walter's for lunch, brunch, dinner, or just to grab drinks. I love this place.\n\nxx MJ", "author": "Momo J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-25", "description": "Great neighborhood spot. Busy bar but they will squeeze you in if you're a single. Good vibes good food.", "author": "Paul K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-03", "description": "Oysters. Artichoke dip. Hangar Steak. Fries. the fries were sick.\n\nTiny tables and close quarters. A couple making out at the bar. Awesome service. Hip vibe - i felt like i should be skinnier and yuppier but the food was just power solid if that even makes sense. It just had a hoppin, almost pubby vibe but also had decor that sort of reminded me of that place on 9th and 3rd in gowanus - what is that place? Now that is going to bug me....", "author": "Victor L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-24", "description": "I've been a fan of Walter Foods in Williamsburg for many years, but only started visiting the headquarters this year. I have yet to be let down. My last meal was on this past Saturday evening.\n\nBeet Salad. A mound of sumptuous assorted greens with an amazing dressing, and goat cheese to die for. The beats are cut down into slim chunks, so they're easy to divide up across every glorious bite. I wish I had one in front of my right now.\n\nBlackened Catfish. I am astounded at how good this piece of fish is at $16. The hot pepper mixes so well with the cabbage cole slaw. The tartar sauce sat on the table next to my plate, completely unused. Why ruin such wonderful flavor? Catfish tasted light and not the slightest hint of brine. Outstanding, especially considering the price.", "author": "Kevin D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-27", "description": "I've been meaning to go to Walter's for about a year, and finally made it this weekend. I needed a brunch spot open early (10 am), which can be a tough thing to find, but Walter's delivered. The atmosphere was great. Good service, good food, good music. All-in-all an excellent experience.\n\nOf course, being open early means that there were a lot of kids. So if you're looking for kid-friendly, that's good. If not...maybe just stick to dinner.", "author": "Britton M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-23", "description": "AMAZING MEALS! We ordered the fried chicken, which was phenomenal, and the pork chop, which was one of the best I have ever had. And apparently, the waiter felt he took a little long in getting our order (we didn't think that at all), so he brought a delicious free key lime pie for us. Just make sure you make a reservation, the place is small and packed.", "author": "Greta S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-13", "description": "Amazing!!! There was a 20 minute wait, but it was well deserved. My friend had the fried chicken and waffles w/ cinnamon butter. The chicken was very moist and crunchy (perfect southern fried chicken). I had the special, which was the fried soft shell crab sandwich w/ spicy tarter sauce, fried green tomato, slaw, \u0026 a side of freshly cut shoe string French fries. Yassssss!!!! So flipping good!", "author": "Tiffany G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-01-22", "description": "Went here for the brunch and my food was eh ... kind of boring. \n\nStill I want to try again for dinner or late-day drinks and oysters.", "author": "Frances G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-04-14", "description": "Super fresh and delicious oysters but not shucked well at all.  I bit on shell in half of them.  Very good selection but for the price they should be pristine and clean.", "author": "Dominique A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-22", "description": "I live Walters!! I don't know why I like the one in Williamsburg better.. The bartender we had treated us a bit weird he was stand offish when I was with my husband then walked in with my girls and he was attentive .. That's silly because my husband is a big tipper.. Anyway the food is always yummy and the drinks are great! French fries are some of the best I. Brooklyn!", "author": "Fayo C."}], "servesCuisine": "American (New)", "priceRange": "$11-30", "name": "Walter’s", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "166 DeKalb Ave", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/L0O4V6Nl0qRG0YDX8HhcdA/ls.jpg", "@type": "Restaurant", "telephone": "+17184887800"}