{"aggregateRating": {"reviewCount": 485, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-05", "description": "Yummy side cars and on a good night I can eat 3 orders of duck buns! The burger beats any spot in the neighborhood!", "author": "Lala S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-02", "description": "I'd been eyeing up Walter's on my way to work for a while, and thought that with its large windows, big bar and nice doorway it looked like a pretty nice spot across from the park. Not being that local to it, I'd never got round to going, but with family in town we decided to finally check it out. \nI was a bit cautious, worried it might be all style and no substance, but we had a great time. Really tasty food with attention to detail (I didn't expect to get excited by an oily sauce I'd never heard of, but now I think chimichurri is the best thing ever), nice staff, decent prices for the quality of food we got, and a relaxed but buzzy atmosphere of people enjoying themselves. Also, it wasn't stuffy or pretentious - phew!\nNow I want to go back to try some more of their bar snacks, oysters, cocktails, appetizers, dessert, and anything else we didn't get to try on the menu.", "author": "S D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-10-04", "description": "First off I can't appreciate a place that sells fried chicken and doesn't serve  chicken wings. The host that greets you needs a attitude and personality check. The ventilation here was poor.  I came home smelling like food. The food was just ok it wasn't bad but it wasn't great.  My steak was cooked well but the broccoli rabe was bland and had no taste. Drinks were nice and strong. The price of dinner for what we actually got was eh. I was underwhelmed by my experience.", "author": "Oculus V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-11", "description": "I love this place.\nGreat food.  It's improved tremendously the past few months.\nSuper friendly staff.\nI love having  drinks and oysters at the bar.  The bar tenders are awesome!", "author": "Randi G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-28", "description": "We had the pleasure of eating at Walter's on Monday for lunch. Grilled cheese Tartine and their hamburger on sourdough bread. We also sampled the local Brooklyn brewed beers by SixPoint.  The food and beer was excellent.  We highly recommend it.  Great decor and excellent service.", "author": "Bill S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-11", "description": "Super friendly waitstaff. We waited less than 15 minutes around 8:30 on a Friday. The food was great, and the drinks were even better! The bartenders were very attentive (we sat at the bar) and talkative but not too talkative while we were eating, a good thing! Definitely recommend going here! Their reviews are real!", "author": "Devin O."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-05", "description": "Don't think I can go back to this place. I brought a few friends who were visiting from Australia. We had some really fresh oysters, knocked down a good bit of alcohol and ate an assortment of really tasty dishes. The artichoke dip was especially good. \n\nAt some point our waiter stopped filling our glasses.  And for the record, that dude was hilarious. Then one of the other workers came and cleared our table and the next thing you know we were being kicked out. Not in the polite way but the bartender was upset. Dude was talking major shit. I figured he just had a weird sense of humor. \n\nIt wasn't until we walked home (5 minutes away) that we realized it was four in the morning! We over stayed our welcome, big time and they were kind enough to accommodate us!!! We felt so bad. I mean, so very bad that I wanted to go back and tip double what I left but I was too embarrassed.  \n\nThere is something to be said about a place with such good atmosphere that 7 hours of eating, talking and drinking feels more like 2 hours. I highly recommend Walter's but you probably won't see me within miles of that place unless I'm in disguise... which could happen, btw.", "author": "Romany Malco J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-14", "description": "Just leaving a perfect valentines day dinner\n\nLobster risotto spectacular, and that takes a REAL chef. \n\nSuper props to an awesome waitress KAT\n\nawesome attitude and really made it special. Knew all the details, sold the specials and hooked up the oyster app! \n\nSpecial thanks to her and WALTERS", "author": "Jon A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-11-11", "description": "They turn the music up so LOUD at brunch. It completely rendered the social experience of eating brunch to everybody just shouting, until after a minute we stopped trying to enjoy each other's company and just sullenly sat there until the check came. In-between, there was forgettable food. The volume of the music was so excruciating that it's the only thing worth remembering. Honestly, when bars and restaurants turn the music up to 11, you know they're not interested in you having a good experience; they just want you to order drinks, pay your check, and GTFO so they can seat another table.", "author": "Peter N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-26", "description": "Had a fantastic time here. The charred octopus was so delicious. Loved the artichoke dip as well. Split the linguini with clams and the steak with friends. Linguini was okay but the steak was amazing! Served on a bed of shoestring fries, soo soo yummy! Cocktails were good but not amazing. Would definitely go back again with friends and split a bunch of things.", "author": "Aisling M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-20", "description": "Yesterday my Dad and i had a late Breakfast here. Though the place was full it was not too loud. It is a cute little place across from Fort Greene Park. The interior had a nice comfortable vibe to it with pictures of different walters along the wall. The waiters were very sweet and quick. \n\nI ordered the Waffles with a side of whipped cream. i found it particularly yummy to put the suger they give you in the waffles with whipped cream or maple syrup. either way its a great little cute spot to go with friends or family.", "author": "Immy M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-22", "description": "I've seen this place change hands three times and wish luck to Walter's establishing a longer business of this corner of Washington Park. Enjoyed. A breakfast and orange juice at the counter.", "author": "Bryan W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-09", "description": "Only had drinks but I can say that the bartenders are excellent. They were very attentive, knowledgeable and fast. I watched them make complicated cocktails with precision and speed. After 2 rounds the bartender brought over a 3rd round on the house. Lovely place! Will be back for dinner.", "author": "Laura B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-26", "description": "Everything I have had here is to die for....plus not to mention they have a great selection of decently priced delicious cocktails (pretty strong too).\n\nI love the brussel sprouts and all the salads, also the steak dish with chimichurri is soo good with a nice sized portion of meat (for those non-vegans in the area).", "author": "Brett C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-10-29", "description": "My favorite restaurant in Fort Greene, hands down.  \n\nThe food is always delicious.  There normally isnt a single dish on the menu that I wont eat.  And that isnt cooked perfectly whenever I order it.  The only negative food experience I've had has been overcooked french fries once or twice.\n\nCocktails are always delicious - and the staff is always wonderful, knowledgable and friendly.  Usually a long wait for a table, but.. understandable.", "author": "Kirk P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-08", "description": "Just had a fantastic dinner at Walter's! Ordered the Barnstable oysters (there were 8 varieties offered)-- which were super fresh, the charred octopus, the roast chicken (husband) and the fisherman's stew (me.) Everything was awesome-- simple but bursting with flavor.  There was also a nice selection of cocktails and wine.\n\nJust two complaints:\n\n- the fisherman's stew although big on flavor was sparse on shellfish-- just 3 mussels and 3 shrimp. With mussels @ about $2.99/lb, I think they could have thrown in a couple more\n- service was a little spotty. Not awful but not the best. Our waitress forgot to bring a water glass and our empty cocktail glasses remained on the table throughout the meal.\n\nAll in all, we had a great dinner and I look forward to going back!", "author": "Sarah G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-09-20", "description": "I feel duped and disappointed. Was craving fried chicken and fried chicken is listed in their lunch menu on here so I thought I'd try this place out. Wrong. No fried chicken at lunch. Only a breaded chicken sandwich which was unexceptional. Decor is the same 'ol new American style restaurant trying to look old and classic w tin ceilings and cafe chairs. Nothing original here. The hand full of patrons were all gentrifiers. The staff was fine. The music is pop radio. Again nothing special here.", "author": "Yobananaboy X."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-06", "description": "Ok, short and to the point...\n\nThis place has the best fried chicken of any restaurant I've ever been to...North or South.  The perfectly crisp skin with deliciously tender meat would've been enough, but the brilliant spicy honey that's served alongside just made it otherworldly.\n\nRibs and artichoke dip were tasty as well.  Glad we finally checked this place out.\n\nGreat vibe inside, as well...very chilled out and unpretentious attitude.  I wish they were around when I used to live in this hood.  Oh well, I'll definitely make the trip back!", "author": "Bryan M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-11", "description": "Everything. Done. Perfectly.\n\nIf I could afford it, I would eat here all the time.\n\nTry the fried chicken with syrup and mash potatos side. I didn't think anyone could improve something so simple.\n\nAnd, of course, the seafood is excellent.", "author": "Steven M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-24", "description": "Amazing food, friendly staff and fun atmosphere. Probably the best Caesar salad I have ever tasted and linguini with clam sauce.", "author": "Nicole L."}], "servesCuisine": "American (New)", "priceRange": "$11-30", "name": "Walter’s", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "166 DeKalb Ave", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/L0O4V6Nl0qRG0YDX8HhcdA/ls.jpg", "@type": "Restaurant", "telephone": "+17184887800"}