{"aggregateRating": {"reviewCount": 485, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-04", "description": "This place is my absolute favorite neighborhood spot. The weekday lunch menu is great. I love the Saigon sandwich and the fish tacos are also excellent. The dinner is fantastic although there is usually a wait. The bar steak is the BEST. I always eat all of it, which is not normal for me. The fried chicken is also great. Love the spiced honey that comes with it. And the cocktails are quite good. All in all, I've never had a bad meal here.", "author": "Lauren W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-05", "description": "Awesome place for brunch. Great food with actual flavor. Service was awesome. Prices were very reasonable.  Loved this place.", "author": "David K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-31", "description": "I have only been here twice, but if I lived on the block, it would be my go-to spot.  Most recently, stopped by for dinner after yoga nearby.  It was around 930 pm on a weekday, so easy to get a table.  Although the menu is a little pricey, the food does not disappoint.  We had the endive salad tossed in reach blue cheese, the french dip (the meat  to bread ratio should be improved, but the flavor was banging), and the linguine with clams, which were tossed in what may have been the best sauce I've ever had. No room for dessert.", "author": "Adria C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-24", "description": "I had a great brunch at Walter's this weekend.  Swift service and currently cash only.  The brunch was tasty, the chicken and the actual waffles were awesome. The chicken was definetly on the greasier side and I found it a bit weird that they don't honor request for dark/ light meat.  The waitress told me you get what you get!  The burger was awesome also, tasty and filling.  Everything came out fast and big portions.  A great brunch option in the neighborhood.", "author": "Alice E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-30", "description": "I had a lovely brunch here on a Sunday afternoon. The service was gracious, the food was delicious and arrived quickly. My boyfriend and I devoured the free mini corn muffins they serve as a sort of bistro-Americain amuse bouche. The granite top bar is beautiful and big windows let in lots of light filling up the airy, romantic space. A great Fort Greene standby.", "author": "Libby W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-08", "description": "Had a wonderful date here! Great atmosphere, food, and service. Bill was large  but we had 4 drinks a burger and a salad -- standard prices for a classy spot with good food and cocktails .", "author": "Babak G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-09-05", "description": "I gave Walter's another chance yesterday and unfortunately I was disappointed yet again. The food is good but it doesn't warrant the high prices. The drinks are tasty though. The service is very pretentious. \n\nFried Chicken is alright, nothing special for the cost. I suggest Night of The Cookers on Fulton. Shrimp cocktail is expensive for nothing special. The special Branzino was good. \n\nService was horrible. The hostess wasn't very warm. The waiter was very pretentious and became annoyed when I asked a question. The staff acts like they have better things to do and were not very welcoming.", "author": "Dina P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-05", "description": "Our friends who live in the neighborhood told us to join us here because they were new fans and wanted to share it with us. They did say that the service had been off in their two previous visits, but that they were giving them time to work out the kinks as they're new. \n\nThe design of the place is gorgeous. We went for an early dinner (6pm Sunday) and did not have to wait. By the time we left, the wait was 1.5 hours. I headed to the restroom first thing and there was no toilet paper or paper towels. Gotta improve on that. \n\nWe ordered 12 oysters to share between the 4 of us, artichoke dip, pico de gallo ceviche, and 2 French dips. The oyster and ceviche were great. The French dips came and it was clear that the waitress had forgotten our artichoke dip. We cancelled the order. \n\nIn my book, when you make a mistake like that as a waitress, particularly when you're a new business and you're building clientele, you send out a free dessert for the table. She wasn't apologetic at all and didn't do anything for the mixup. My standards for servers are high because I was one, and I think it's a job that should be done correctly. So that was my beef with her, but other than that, I will return and look forward to trying more of their yummy food. \n\nI hope that the service gets better and not worse, because this neighborhood could really use a 5 star worthy joint.", "author": "Karyn S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-02-26", "description": "Very, very loud on a (early in the) week day night. It's got the whole local, on-the-corner thing going for it, but the tables are too close together and I found every dish to be overdressed--salad, entree and side dish. So so service and wine list. Prices and menu item selection for a \"new\" American restaurant on par with every other place in NYC.", "author": "Juju J."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-03-14", "description": "You either have to be a midget or fetus to eat comfortably it's the size of a walkin closet. Tables are aprox 6\" away from the others. I cannot enjoy it", "author": "Michael C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-05", "description": "Nice place, food is solid, service is very good, gets hopping around dinner time. So if you're looking for a quiet place to talk, this may not be for you unless it's a slow night", "author": "Serge F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-05-31", "description": "Missed brunch and was very upset about it...Had a pre dinner menu it was ok cocktails were amazing...Service was ok. The manager and bartender was very helpful in the end. I will try again for brunch.", "author": "Janèa T."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-12-22", "description": "Really good is great, but the noise level is too high! I mean crazy high! My date and I are texting to talk! Take it down then serve dinner! 80 db noise!", "author": "Clare B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-03-10", "description": "One of my favorite brunch places in the neighborhood. Sadly, this weekend we went for late brunch right before they stopped serving. We asked the hostess if they were still serving and she said yes (it was a few minutes before the 4:00 end of brunch) and seated us. We already knew what we wanted so within a minute we attempted to order and were refused service on the grounds that it was too late. So we packed up and left. I looked at my mobile when we were back out on the sidewalk. It was 4:01.  \n\nI have waited tables for over a decade and I get it--you don't want to get stuck staying for a long time at the end of a shift. But the hosts and the servers need to be on the same page. If I'm sat, I should be served, especially if I'm ready to order at the moment I'm sat. \n\nVery disappointing. Ended up finding a newer restaurant just down the street (Dino) that was happy to serve us and was very good. It might be time to switch up my regular brunch place. Walter's had a good run but now there is so much other competition just in the immediate vicinity that they might need to step up their game a little bit.", "author": "Anna F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-18", "description": "I love this place. And the original in WIlliamsburg. Food is executed perfectly. Cocktails are amazing. (And full of pellet ice!!! It is a weird obsession I have.)  Steak is amazeballs, but the French Dip is my go to. It makes me think of meals my parents ordered in the 80s while my mom wore shoulder pants and my dad wore spirited golf pants. I love that restos are bringing the french dip back, and this one is one to relish. Oh, and the key lime pie rocks.", "author": "Ashley J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-11", "description": "Yet to find anything wrong here. The food for brunch, dinner, and drinks are always delicious, fresh, and a sense of mild sophistication without being stuffy. Great tunes playing. And the waitstaff is remarkably friendly, sweet, dressed nice and looking great. We always leave smiling, pleased, and full. A true neighborhood gem.", "author": "Josh A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-01", "description": "So I'm a reluctant fan of Walters.  I'm a clearly on the anti Fort-Greene-as-new-PSlope movement and Walters is clearly a solid signal of the movement's steady gaining momentum...that said though, the service, originality, decor and cool owners help Walters endear itself to even the most hardcore anti-FGS'r", "author": "Win L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-22", "description": "I was actually SAD when my meal was over, even though I was so full from my delicious meal that there wouldn't have been more space to put the food even if there was more to eat! We started with the kale salad - inventive, delicious and wonderfully garlicky. We had the octopus - bright, well balanced.\n\nI had the spicy fisherman's stew for my main course - it had the perfect balance of heat and sourdough was grilled perfectly. Friends had the burger, the salmon, the steak, and the vegetables - everyone was so happy with their dishes. Everything was light, fresh and well balanced. The brussel sprouts were unreal... we were fighting over the last bite!!\n\nWe finished with key lime pie (the best!!!), bread pudding (with a good layer of chocolate), and apple cobbler (yum).\n\nThis place is not to be missed. The chef is very talented! I'll definitely come back here.", "author": "Ryley K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-16", "description": "Awesome place, very hipster, ironic, diner, soda-shopesque bar ambiance...Amazing appetizers, cocktails, and entrees. I ordered skirt steak with french fries! AMAZING!!! Friend order French dip and she loved it! Sat at bar with 2 friends and had a great time for hours, didn't feel rushed. Only thing I'd suggest is having a bit more variety on the menu...", "author": "Jaclyn M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-02-10", "description": "After a disappointing brunch at Walter's, I've stopped by for the occasional drink given the quality of the cocktail menu and the close proximity to my apartment. However, last weekend was the last trip I will make.\nI've actually stopped in several times only to leave because there were no bar seats. This time, my friend and I decided to stay anyway. We each ordered a cocktail (average cocktail $12) and saw a couple people paying their bill and gathering their stuff so I walked over to grab the spot when they were done. As they left and I started to grab the bar stool, the bartender informed me that two people were going to be having dinner there. I looked around and saw two empty tables and stated to the bartender that tables were available, to which he responded \"are you eating?\". My point was that I could not sit at a table because I was not eating (fine, that's not unusual) but these patrons that are eating could take one of the available tables; why were they holding a bar spot when tables were available? I'm accustomed to a bar being first come, first serve. But I didn't get into it. I just walked back to my friend and continued with my drink. \nShortly after, several more seats opened up right next to me. (It must have been my lucky night! Oh, never mind.) Just as I was sitting, the bartender just had to say to me, \"You can have that seat. This party just needs one.\" I made some smart aleck response thanking him and continued to go about my night. Talk about a bartender on a power trip telling people where and when they can and cannot sit! He had no reason to say anything to me because the woman who was waiting got her seat. \nNow I've never done this before and probably never will again, but I was a few drinks in and decided to leave no tip. I wrote on the receipt that from my experience, bars were first come, first serve. Upon seeing this, the bartender continued with his haughty attitude and then asked if I would like to speak with a manager. I said that would be fine. While the manager was nice, he did nothing to change my mind (or my friend's), so we went on to one of the many other establishments in Fort Greene that knows how to treat their patrons with respect. I will not be returning (not that I'd be welcome).", "author": "Terry T."}], "servesCuisine": "American (New)", "priceRange": "$11-30", "name": "Walter’s", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "166 DeKalb Ave", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/L0O4V6Nl0qRG0YDX8HhcdA/ls.jpg", "@type": "Restaurant", "telephone": "+17184887800"}