{"aggregateRating": {"reviewCount": 485, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-09-29", "description": "I've been twice this year, once before a concert at Barclays and then after the opera at BAM. I came back because I remember loving the food - we ordered one of everything on the menu it seemed!  The food was great, the cocktails were great and the atmosphere is lovely.\n\nMy issue is the service is terrible. The first time it was quite busy but the service was slow so I gave them a pass.  The second time I went it was around 10pm on a weeknight and not nearly as busy.  Same crappy, abysmally slow service.  We weren't ready to order when the waitress came the first time, shame on us!   It was at least 20 minutes before she came back, drinks bone dry, all of us looking around trying to look like we needed attention without being too obnoxious about it.  Then the appetizers came, all was fine, everything was great.   When the waitress came back maybe 30 mins later we we're picking at the remains, but we're not ready for them to take everything away yet.   Apparently they took that as a queue to hold off on our entres?  I would have expected them to arrive shortly after, but instead about 45 minutes later dinner rolls out, and now it's pushing 1130.  We're sitting there as they're putting up the chairs, no food food in the table and no drinks,  We ended up leaving the restaurant at 1230, 2.5 hours later. \n\nI love a nice long leisurely dinner, but this wasn't the case.  The staff is completely lazy and inattentive. I realized early into the experience I had to be constantly on the lookout for the staff to get any level of service, a water refill, a drink refill, anything really.   But even that didn't work since they would completely ignore us.  Even more annoying I noticed the waitstaff in clusters of two and three having a great old time, so it's not like they were overworked.  I would have willingly spent more money on drinks if the staff had bothered to come by for my order.\n\nReally disappointed.  Get it together guys!  I won't be returning.", "author": "James W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-04", "description": "Got there early on a cold Monday night and had a cozy table by the front window. The deviled eggs were delicious bite-sized starters: creamy and flavorful with just the right amount of heat. Lobster buns followed--cold lobster salad on an Asian style bun. It was good, but I have to admit I was expecting something epic based on the menu description. Then came the incredible Fisherman's stew (which we actually didn't order--the server mistakenly punched in the wrong entree). When the stew came to the table and she realized the mistake, she offered it to us on the house since we then had to wait for our actual entree to be made. We took her up on it and were glad we did. It was a fresh stewed tomato base with mussels, shrimp and many other delicious bits. Simple and sophisticated. My favorite part of the meal. Last was the roasted chicken entree, which was so tender and juicy. Loved the food, the vibe, and the friendly, professional service. One of my favorite neighborhood spots!", "author": "Megan O."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-05-05", "description": "Came here for brunch, and we enjoyed ourselves. The food didn't feel as unhealthy and greasy as a lot of other places serving breakfast styled food, but i felt like my food lacked a bit of flavor and one of my two eggs were too done. Would be happy to come back however because the place is cute, service was very good and the overall feeling of the place is great.", "author": "James M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-29", "description": "I just went there once for lunch, so this is a first impression. This is a new restaurant in what used to be Rice. They really improved the layout and aesthetics of the space. The service, which seemed a little clumsy at times was friendly and I think will be great once they are settled in. There were a lot of complaints about the service at Rice so I hope they somehow take note of that. For lunch I had the pulled pork sandwich which was great, and my dining companion had the saigon sandwich which she really enjoyed. Partly because I enjoyed the lunch here, I went to Walter Foods in Wmsburg and enjoyed that as well. I plan on coming back her to try dinner sometime soon.", "author": "I. R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-01", "description": "What can I say? Walters is awesome! The chicken and waffles are definitely on point, the French toast is awesome as well. Service is great and friendly and I'm always ready to go back. Definitely a must go if you're in the Fort Greene area.", "author": "Sonny A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-01-11", "description": "I usually go here for drinks but I've had dinner here once. Food was pretty good. The day boat fish was awesome! Very fresh and spiced just right artichoke dip was way to creamy though! I want to try this place for brunch it seems like it would be cool. Now for the service: is it just me or do some of the waiters have a bit of an attitude? The guy with the Pennsylvania tattoos is cool but the rest need to take a chill pill!", "author": "Yara C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-10-14", "description": "Mediocre food. Poor service. That about sums it up. My husband ordered the bar steak which we sent back twice because it was literally cold. I guess, but don't know, that it is pre-cooked and given a shot of heat before serving. The fish stew a bit skimpy on fish and flavor. Staff gave accommodation on price of bar steak. But pretty indifferent about the whole thing. No reason to give it a second chance", "author": "Diana D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-15", "description": "A-mazing! Such good food and great location right across from the park. Get the brussel sprouts pretty sure they were cooked in bacon grease..yum. Everything from the water served with cucumber slices in it (my fav) to the key lime pie is a great choice! I will be back again.", "author": "Amanda B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-21", "description": "Although it is always super crowded, they do their best to make you comfortable while you wait.  the food is consistently very good if a little expensive.  and the bartenders know how to make good, classic cocktails.  Its my neighborhood go-to besides DSK", "author": "rebecca p."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-27", "description": "love everything about this spot, from the kick-ass bartenders to the portraits of the various walters splattered throughout the establishment. then you've got your food- my personal faves are deviled eggs, spinach artichoke dip (if you're feeling naughty), the french dip sandwich, and fresh market oysters. the kitchen stays dear to my heart by remaining open until 1 and the bartenders never cease to rock my world with the timeless classics they mix up (both in cocktail form behind the bar and in beat form comin' out the speakers). hands down the best local cocktail joint in the area. ask for alejandro or tommy and tell him katie sent you...he'll know what to do.", "author": "Katie B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-31", "description": "I live down the street.  Every time I come here for brunch, dinner, or apps and drinks I have a wonderful time! The food, atmosphere and service are completely right on.  It embodies timeless and tasteful atmosphere.  The food is comfort food done right.  Get the honey fried chicken, I haven't had any so good since living down south! The drinks alone and the apps, artichoke dip, are all done with the utmost care.  Attention to all details is clearly taken into consideration, for an evening out worth taking! So happy I don't have to trek far to get here.  But, totally worth a commute from the City if you're looking for rustic, Brooklyn, artisanal flare done right!", "author": "Esther T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-02", "description": "Cool, intimate space with a nice bar. Good date destination. 30+ crowd. We shared two appetizers - asparagus + parma (good) and mashed potatoes (too mushy for my taste). I had the catfish + coleslaw which was tasty and my friend had the fish stew which she enjoyed. Total tab before tax/tip was $80", "author": "Will S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-24", "description": "This place has an incredible French Dip and the Aviator cocktail complements it perfectly. The service is professional and friendly and loves their regulars, which is nice in such a tight-knit neighborhood like Fort Greene. The grilled octopus is also pretty much perfect, as well as the roasted chicken with mashed potatoes. worth every penny.", "author": "Gwen S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-27", "description": "AMAZING AMAZING AMAZING! I live right down the street from here and I'm upset I havent come sooner. This place is ALWAYS busy, so I knew it had to be good. The times when it is busiest are during brunch on the weekends, but I can see this place getting packed on a daily basis once the word gets out. This is a sister restaurant to Walter Foods in Williamsburg, and from what I can tell, has exactly the same menu. We came in for lunch, so we didnt get a whole lot, but we split the Pork fritters which were basically fried pulled prok...crispy on the outside, shredded/pulled pork on the inside, served with a bbq sauce, this was very good, the wife thought it was just ok. We then moved onto our entrees...I got the French Onion Dip (I had beenc raving some Au Jus), and the wife got some sort of roasted chicken with rosemary. The sandwich was exactyl what I wanted...Sliced, perfectly cooked filet mignon, a whole bunch of horseradish sauce, sandwiched in between some kind of amazing panini bread. It came with an au jus to dip in, and I was in heaven. It runs about $18, but is worth every penny. Next time I will be trying to fried chicken with the spicy honey sauce, I didnt get it this time because I had eaten fried chicken across the street at General Greene the day before. To finish it off, we had the key lime pie which was reccomended to us from our waitress, it was good and tart, but Im not much of a KLP person, so I could do without it...next time I'll try the banana bread pudding thing which she said was rich, but sounded delcicous. We will be back, and I'm glad I live literally 3 blocks away", "author": "AJ K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-01", "description": "I love having this restaurant diagonally across the street. I missed Rice, until I headed into Walters one evening. Amazing fries! The best I've ever had, and the oysters are also great. One thing to know is that the lobster salad has barely any lobster on it- I don't eat lobster but my friend was a bit disappointed. Also, their desserts are reheated in the microwave, which is a funny thing for a restaurant of this caliber. Aside from those points, I love the place. Amazing fried chicken and waffles, great drinks, and incredibly good service. A fantastic addition to our neighborhood!", "author": "Zoe T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-24", "description": "Excellent in almost every way.  Excellent food and attentive and friendly service.  Good wine and drinks list.  Only problem is that it's too small to accomodate the many people who want to eat there.  Expect a wait, it's so popular. Oh, and we've been so often we've had everything on the menu!  It's not the cheapest meal but for the high quality, it's well-worth the money.", "author": "Steven R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-05-02", "description": "Such a welcome addition to the neighborhood. Fantastic food, excellent cocktails (for real, thank god) and raw bar. Plus, awesome service and very friendly staff. Can't recommend it enough. I hope to be a regular in 50 years when I am old and in the back booth with my husband at 5:00pm.", "author": "Julia J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-17", "description": "A lovely spot that's worth the walk-in wait. Pimm's Cup was strong, but not extremely muddled- kind of a giant cup of tasty detritus.  We ordered delicious Virginia oysters which were a bit on the sloppily-shucked side, making them messy and we had no explanation of our mignonette and other sauces.  These things must be implied in Brooklyn. I wouldn't know, as I'm from California. Duck buns (served as a pair) were a great representation of what I've heard about what Chinese style buns are to NYC. The Bibb salad was subtle and had perfect buttermilk dressing--reminded me of a homemade French dressing. Lobster buccatini (my favorite drunkish noodles) was great-- we split everything 4 ways and finished with the apple crisp and my new favorite Gruner white wine from Austria.  I highly recommend this spot for it's laid back service and as a good introduction to the local Brooklyn fare... luckily sans the hipsters.", "author": "Tyler A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-17", "description": "Great to have a classy joint in the neighborhood. The raw bar is fantastic, as was the burger. It was very busy, but we had no trouble getting a table for two. Excellent wait staff. Nice to not have to venture outside of ft greene for a decent meal.", "author": "Ben F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-02-21", "description": "First the food: do not miss the brussel sprouts with hazelnuts, the marriage of tastes and textures like Bogie \u0026 Bacall - ludicrously satisfying. The exquisitely calibrated lobster salad made me feel decadent like Edie slumming it with Andy, filling but light, leaving room for bites of my mate's very tasty cheeseburger. The fries are phenomenally good which is very important because a milquetoast fry can ruin a dish and these are darn perfect, robust and crunchy at the tips. I was very impressed with the fried chicken, moist yet grease free, nice seasoning. The broccoli rabe in anchovy vinaigrette was like a tepid bath on a cold winter morning, the only blemish gustatory-wise. Both the key lime pie (zingy and not too sweet, could've had two) and the chocolate bread pudding were solid finishes. \n\nThe overall experience at Walter's is akin to drinking one of their bourbon cocktails: pleasant, vaguely sexy, and over much too soon. I'm perennially ravenous so you'd think I'd be over the moon to blink and find my food before me but it comes so fast I wouldn't be surprised to find Rosey in the kitchen flinging out dishes from a Food-a-Rac-a-Cycle. The actual food doesn't suggest 'instant' nor do the the warm aesthetics from the dandyish decor to the very friendly waitstaff -- you want to linger a little and the lack of lag time between dishes sort of made me feel like a mere $ 'gotta turn the tables get more customers in'. It seems incongruent with the ethos of the place. I mean, hell, one look at the bar set up and visions of a boozy afternoon of oyster clam claw chowing to a handsome soundtrack (Eric B \u0026 Rakim to Joy Division) ensure my return, so it's a shame I can't at least imagine doing the same at a table. \n\nIf you're hungry and not in the mood to wait go very early or after 9:30.", "author": "Saul T."}], "servesCuisine": "American (New)", "priceRange": "$11-30", "name": "Walter’s", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "166 DeKalb Ave", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/L0O4V6Nl0qRG0YDX8HhcdA/ls.jpg", "@type": "Restaurant", "telephone": "+17184887800"}