{"aggregateRating": {"reviewCount": 485, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-07-07", "description": "Where shall I begin, ok so let's starts with the service or should I say lack there of. The service consisted of taking our order and giving us a check. I don't need a lot of attention but just once would have been nice if they checked that everything was ok.\n\nThe restaurant is small which is to be expected so you get close to the table next to you. But it would be nice to have a chair that was not so wobbly that I thought if I made any sudden movements the leg would break off.\n\nThe brunch was just ok.  I ordered the catfish sandwich. There was more bread than fish. If you going to give a small piece of fish give a small roll.  They gave tons of string fries which were decent.\n\nAll in all this place was ok. The lunch menu looks good but only offered during the week.  I guess brunch is what the neighborhood wants on the weekends.  Oh and last thing it is pretty expensive.", "author": "Carla G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-14", "description": "GOOD Bar , AMAZING hamburger,  waitress very friendly and professional.  At the moment is my favorite hamburger place ! only one negative thing... limited seating", "author": "Francesco C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-15", "description": "Walter's did not disappoint. My huevos rancheros were delicious! The restaurant is so charming and the service is spectacular. Looking forward to returning soon ;)", "author": "Sam S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-16", "description": "Soo good. Glad I tried it, the blackened catfish is amazing. The sauce for the fried chicken is great too. Great friendly staff", "author": "Judy F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-27", "description": "Tasty tasty tasty brunch. Great chicken and waffles (juicy chicken! Honey butter!) and shakshouka. Affordable ($36 for the two with coffees) and cute place with bowtie wearinf bartenders.", "author": "Nora X."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-03-07", "description": "It's hard to rate a place on the basis of their weekend brunch, when there are crowds and kids and lines out the door.  That said, on first visit, I found this place to be way under par.\n\nWe waited for our table at the bar, where we were forced to deal with a bartender who may have been trucked in from the Williamsburg flagship, replete with the standard issue tattoos and surly attitude. We were welcomed with dirty looks and sarcastic responses to our questions before we took a hint and waited meekly for our table.\n\nAlso a seeming carryover from Williamsburg is the fascination with all things meat, mainly pig, with an overt middle finger to vegetarians.  I ordered the standard breakfast -- eggs, potatoes and toast -- but, could I please substitute something for the bacon or sausage? Nope. Really? Not some fruit or a side salad? Nope.  You get meat or you get nothing.\n\nThe eggs were what one might expect at any diner -- no care in them, no flash, no love. The toast came cold and dry, with nothing to accompany or freshen it up a bit (i.e. butter, jam, something?). One bite was one more than enough.  OK, the potatoes were pretty good, but man...I expected more. This meal would have cost $4.99 at the local diner. Was my $11 buying me exclusive access to hipster foodie cred? Fuh. Keep your cred. I'd take Denny's over this nonsense.\n\nOn the bright side, the service (once we got away from the bar) was excellent, the afternoon light was pleasant, and the music, though loud, was at a reasonable enough level that my friend and I could still converse without shouting. Let's be thankful for small favors.\n\nSkip this place.", "author": "steve c."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-24", "description": "I give this place 5 stars because all of my experiences have been good. It's not exactly cheap though, I wish it were cheaper. I would like it more then, I suppose. Maybe that's because I came here and had a cheap steak but ordered 2 bottles of wine and paid for dinner too which ended up being kind of nuts. IDK. I had a grilled Caesar salad here which I thought was pretty cool. Grilled romain gives a smoky Caesar quality which is pretty nice actually. Steak was good, too. Good fries. No beer on draft is annoying I think but whatever can't diss a place for everything.", "author": "Gene K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-06-01", "description": "Came here for an early dinner with friends.  The ambiance of Walter's is quite nice, right across the street from a park and a low key crowd.  What I wasn't very impressed with was the food, but I probably should have gone with our waitress' suggestion of ordering something off the specials menu.", "author": "Michelle R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-02", "description": "We went there for brunch, we ordered eggs Benedict and french toast. The french toast i had, was brilliant :P super delicious. It has a friendly atmosphere. Their iced tea can get better. I will definitely put that french toast in my top three list!", "author": "Shahandeh O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-15", "description": "Love this place for dinner. Wasn't a huge fan for lunch though. Get the spinach artichoke dip. It's so worth it. The catfish is AMAZING. Get it and enjoy every bite. Also had a ceviche here with delicious chips. Can't go wrong here for dinner.", "author": "Calee P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-05-13", "description": "The food was good, the drinks were well made - but the place is far too crowded. My experience would have easily gone from a 3 star to 5 if there were, say, 2 less tables in the joint. \nI know that they want to be able to accommodate as many as possible, but there is a point that it just interferes with the meal. I had to focus hard to ignore the conversations on either side of me, and felt uncomfortable going to the restroom because I would have had to move the actual table in order to get out.\n\nPlease, just consider cutting down a bit - I think it will be better for everyone! (And I promise to buy a couple extra drinks to make up for it)", "author": "J Cliff G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-02-15", "description": "I went and the menu suck mon-friday only  lunch and dinner No brunch. I was looking forward to having some chicken and waffles and to top it off the waitress wasn't very friendly.I live in the neighborhood I do not plan on eating here ever again. Maybe I came on the wrong day.", "author": "Mercedez M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-08-17", "description": "I came here specially for their fried chicken and waffle. It was completely overrated. I've definitely have tried better around Brooklyn.", "author": "J. C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-01", "description": "The setting is dark with dark furniture like it should be a romantic-date kinda place but it was loud like a typical hipster bar.", "author": "A D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-02-03", "description": "I was excited to check out Walter's after hearing a lot of positive buzz but I wasn't very impressed. We ordered:\n\n2 cocktails\nThe meatballs\nEscarole salad\nBrussel Sprouts\nSteamed duck buns\n\nHere's how it went down:\n\nOrdered cocktails, the waitress forgot to bring them until the end of dinner, they were getting room temperature.\n\nThe meatballs and brussel sprouts were fine, nothing mind blowing. \n\nThe escarole salad was over dressed and the escarole was limp/mushy.\n\nThe duck buns were approaching cold and rather dry.\n\nI'd go back again to give them another shot, but this experience was not very encouraging.", "author": "jason m."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-05-25", "description": "I've been to Walter's for drinks twice.\n\nThe first time was great--perfectly mixed drink and super friendly bartender.\n\nThe second time it was another bartender, he was not friendly, the drink tasted off and then he seemed to try and gip me out of 10 bucks.  After trying to get his attention for a while--I asked for my receipt back since something seemed up with my change and instead of doing so he handed me another 10 dollars. No apology or anything. Awkward.\n\nThe hostess here is always sweet and the food looks great but I will bypass sitting at the bar if I see bartender #2's workin.", "author": "Rebecca L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-04-23", "description": "I went to Walter's last night on a first date. We walked 15 minutes in the pouring rain to get there and the whole time I just had to trust that the food would meet my very high expectations and prove to my date that I had exceptional taste, even if I had exceptionally bad timing for planning. Unfortunately for us, there is no real direct route from Park Slope to this part of Fort Greene.\n\nWe arrived to Walter's and there was about a 20 minute wait but we said we'd eat at the bar instead. The cocktail menu is part of why I came and I was so pleased with my Pimm's Cup and my date pleased with his drink (I think it was the Fig Side Car, or something with rum and figs.). The bartender was so busy making cocktails but half the fun of sitting there was watching him in action. Really great, classic cocktails but made with such care and precision. \n\nTo start we had the deviled eggs and duck buns. I can't even really say anything more about them other than they were amazing. The eggs had a chipotle aftertaste, though at first it struck me as cayenne. Whatever the seasoning was, it was spot-on. The duck buns were fluffly and rich, topped with scallions. The flavor was light and as far as I could tell, the seasoning was designed to bring out the flavor of the duck and not mask it. I was pleased with the tender meat and would have eaten just that. \n\nI ordered the French Dip - which is what they are known for. I can't say enough about this dish. The horseradish sauce was spicy but not overwhelming, the meat was incredibly tender and well-sliced, the baguette wasn't too toasted (other people will probably want it to be tougher but I hate toasted bread usually), and the au jus was perfect - not overly salty like they can sometimes be. \n\nMy date had the Fisherman Stew, which he loved. I'm not usually a fan of so many seafood in one dish, but it was pretty tasty. He would have liked it to be more of a stew and a little thicker, but was pleased with the overall experience and the bread they served with it.\n\nFor dessert, we had the key lime pie. The whipped cream was so fresh. I wish I could make it myself. \n\nThe decor of this place is so New England and New York at the same time, if you can picture that. The black and white tiles, simple monochromatic color scheme are inviting and just elegant. The owner was so kind to us and I had to thank him for constantly checking on us. It says a lot about a place to have such incredible service.\n\nNeedless to say, I will be back. I hope very much with the same date, and I hope to try everything else on the menu.", "author": "Brianne S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-22", "description": "When I die I hope Walter's is the waiting room. A picture perfect, little corner spot across from Fort Greene Park in Brooklyn. You'll be challenged to leave on days / nights you're able to score a window spot, as the people watching is as divine as the comfort food. We're talkin' old school bow tie service mixed with personality fueled barkeeps that know their way around the booze without the pretension. You're gonna wanna come back.", "author": "Ember B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-14", "description": "Great service, atmosphere and food - an all-around win! For dinner I had the salmon - which was wonderful, loved the change up with the grilled corn/potatoes and the salsa. My partner had the fried chicken and was definitely happy. No dessert or apps this trip - but I'll definitely be back to check them out. Solid neighborhood pick.", "author": "Mandy G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-09-11", "description": "Went for an afternoon snack. They have a limited menu. My GF got a lemonade which was probably 3-4 sips in size. The rest was ice. I got a beer. Nothing on tap. This was disappointing for a place of this stature. Honestly you are paying for looks here. If you want quality then keep walking.", "author": "Eric N."}], "servesCuisine": "American (New)", "priceRange": "$11-30", "name": "Walter’s", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "166 DeKalb Ave", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/L0O4V6Nl0qRG0YDX8HhcdA/ls.jpg", "@type": "Restaurant", "telephone": "+17184887800"}