{"aggregateRating": {"reviewCount": 485, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-19", "description": "Great food, service, and atmosphere. Start your meal with some oysters, share the lobster salad (or any salad) and then indulge in the friend chicken. Sit at the bar and you will really have a great time talking to neighbors and the bartender as well.\n\nThe one dish that disappointed was the smoked trout plate. Besides that everything was very enjoyable.", "author": "Leslie S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-04-17", "description": "Walter's has no vegetarian options on their lunch menu.  Still a nice place, but vegetarians and vegans are only welcome for brunch or dinner, apparently.", "author": "Sameer A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-14", "description": "Very nice food, although it is a bar and it is loud, especially with kiddies.\nService was terrific. We had great meatballs (you get three of these beauties with red sauce in a bowl) and a so so salad, which probably spent hours in the fridge before being served. For mains we each had the special app, which was a hangar steak cooked medium rare with tomatoes and arugula. It was terrific. Dessert was a great key lime pie with a true graham cracker crust and whipped cream on the side.", "author": "james h."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-08", "description": "I'm lucky to live a short walk from Walters.  the wife and I have eaten here about 5 times... consistently great food and service.  its just your perfect neighborhood place.  not pretentious, but casually elegant.", "author": "David B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-20", "description": "I have this thing for juevos rancheros. . . and their's are pretty good. The bloody mary is pretty tasty as well. The only issue is that if you are brining 'bigger' people, like my cousin, who is 6'3\", it's pretty tight. He also had trouble holding the mini coffee cups. Basically, he looked like a giant in the place and he wasn't that comfortable. But the food is good, and the service is pleasant. I just have to bring my smaller counterparts.", "author": "Christine B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-27", "description": "cute lil corner restaurant overlooking fg park.  tons of windows to people watch . menu is pretty simple but seemed to be good quality. I liked the shoestring fries better then my burger which was just good but nothing to brag about.  I would go again to try out more items on the menu. heard the cocktails are also good there. service was friendly as well.", "author": "Nicole K."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-05-09", "description": "Came here for a casual lunch on a friday afternoon, only a few tables in there. Took 10 minutes before the server (who was just hanging out behind the bar) to take my order, and then the salad I ordered took 25 min, with no acknowledgement from anyone that this was an issue. \n\nAll I had was the smoked trout salad, which was quite nice for the price (11$) so the 2 stars are acknowledging that the 1 item I had was very good, but it was a cold plate that in a mostly empty restaurant shouldn't have taken that long to make. I am willing to try again because the menu and ambience have a lot going for it, but the lunch service was awful.", "author": "Rory K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-21", "description": "Until this place opened, I had a hard time naming a favorite restaurant in my neighborhood.  There was just nothing special about any of the places in FG.  \nI have been to Walters for many dinners and can not say a bad thing except that it can get crowded and noisy.  I love the steak and French dip sandwich and the oysters.  The French fries are really well done here also.  Food aside, what really impressed me most about this popular and busy restaurant was how accommodating the host was for our large dinner party when some people in our group were stuck in traffic.  We were allowed to be seated and start ordering oysters and drinks while we waited for the late comers. This is not typically allowed in busy NYC restaurants and we really appreciated the host and wait staff being so flexible and reasonable.  This type of service goes a long way to building loyalty with your customers and reminds me of a time when good service was the norm and what it means to have a neighborhood place.  The food is great but the service and attentiveness of the host/waitstaff makes the place really special.  Keep it up!", "author": "a k."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-05", "description": "I don't normally write yelp reviews (because my boyfriend and I are in the biz) but I really feel the need to say something about this place.... We stumbled upon it as we were walking down DeKalb trying to find a place for dinner for my birthday (great planning, I know) and I realized I'd been here before, several years ago.  It was super busy but we decided to withstand the wait, partially because Katie, the manager/hostess (?) was so friendly and welcoming and convinced us to stay and have a drink in the other, hidden restaurant within the restaurant... I know, right?  She checked on us consistently, kept us in the loop and got us sat as quickly as possible.  And that was just the beginning.  Long story short, the meal was amazing, service was amazing and it was the best birthday dinner this girl could ever have asked for.  Thank you Wael, Katie and our amazing server for a spectacular eventing.  It was worth the wait.  You guys do it right.  We will see you soon.", "author": "Meghan W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-05-26", "description": "More like 3.5 stars, but the extra half is just for the music selection. Attentive staff. There is a theme here. I won't spoil it for you. The octopus was decent, but not the best that I've ever had. The steak was... eehhh. The fries were more exciting. All in all the place didn't leave much of an impression, good or bad. Hence the 3 stars.", "author": "George D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-22", "description": "Best oysters in the area. Always good service although it can be really crowded. I guess I'm not the only one who enjoys it here!", "author": "T S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-24", "description": "D E L I C I O U S N E S S. \n\n\n\nAs good as Walter Foods in Williamsburg ...maybe even better. :) \n\nsuch a wonderful location as well.", "author": "BethAnn F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-22", "description": "I love this place. It's a neighborhood joint with a reliable raw bar and super friendly staff. The food isn't going to win any awards, but it's a Fort Greene institution for a lot of us. The oysters are well-curated, and the artichoke dip is great. Get snacks and drinks. Have fun.", "author": "Chris Z."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-27", "description": "holy sh*t -- the BEST BELLINI i've ever had!!! they must use fresh peach juice, because it was a to die for. and trust me, they aren't filling that bellini up with andre. they use good quality prosecco!! brunch was fine, it was good. i'd like to come back for lunch or dinner, but for sure i am getting that bellini!! seriously everybody get the bellini!!!!\n\np.s i loved the decor too!\n\n5 Stars for the Bellini\n4 Stars for everything else", "author": "Luv2 L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-01-04", "description": "I went for brunch with my brother.  The food was decent but we felt that both of our meals could easily be made in our own kitchen.  Basically, there was nothing \"special\" about the flavor/taste of the food that would make us want to come back.  There are better brunch places in the Ft. Greene area in my opinion.", "author": "Ross D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-29", "description": "I came here for a nightcap of champagne and dessert.  The chocolate bread pudding was good, if you're into that sort of thing.  The apple pie a la mode was amazing, whether you're into that kind of thing or not.  The drinks are kinda pricey.  The dessert plates are huge.  The staff is polite and attentive.  There's something classy and romantic about Walter's, so take a date there if you want them to think the same about you.", "author": "Caitlin M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-30", "description": "My girlfriend and I found Walter's randomly when adventuring out in Fort Greene without even knowing Walter Foods had a sister restaurant there. It was ridiculously stellar. We got asian style wings which they do not have at the other estabslishment which were bomb, the green herb salad or whatever was incredible. I got the fisherman's stew which blew me away as one of the best things I ever ate. That toast, dipping that shit!! so good. And then Jeffrey Wright the famous incredible actor rode up on his bike and walked in and chatted with people at the bar. It was a unique restaurant experience.\n\nIt's also beautiful designed with an absurdly gorgeous bar.", "author": "Argot B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-25", "description": "Got a same day reservation at Walter's for 9:30 pm for dinner - late but what can you do when you don't plan in advance? We arrived at 9:15 and were promptly seated even though the place was packed. The atmosphere is very comfortable, a little loud but not over the top, with excellent, fast service.  I had the french dip (filet mignon on a soft baguette with au jus on the side) but ordered garlic mashed potatoes instead of the fries. Sandwich was awesome, mashed was good but a little cold. My friends got the grilled bar steak (strip steak) \u0026 spicy fisherman's stew (really spicy) for entrees and for appetizers ordered the octopus, artichoke dip and crab. I didn't try the crab or octopus but the dip was delicious. They all raved about everything they tried so Walter's is a definite new dinner spot for us.", "author": "La La J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-13", "description": "This is far and away the classiest restaurant in the neighborhood -- Manhattan-grade dining in the heart of Fort Greene. Walter's features a carefully-designed menu, consistently professional service, a serious cocktail menu, and prices to match.\n\nAt dinner, the bar steak and the fried chicken are routinely very good.  \nBrunch is high quality and a little less expensive than dinner.\n\nWalter's also offers a full menu later at night than most of its neighbors.", "author": "Andrew J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-28", "description": "This place is fantastic.  We tried a sampling of half the menu practically:\n\nSpicy Deviled Eggs - good\n\nArtichoke and Cheese Dip - Excellent -- was less cheesy than many restaurants serve it and more fresh artichoke, which I liked. I would have preferred a different bread to accompany it.  It was served with Melba Toast - not bad, but not my fave.\n\nPork Belly Fritters - very tiny serving even for an appetizer, but the taste was worth it.  The pork is smoked to perfection.\n\nFrench Dip Sandwich with Frites - words will not do this sandwich justice and the frites where the thinnest sliced pieces of heaven.\n\nSpecial of the night - Gumbo - very nice and authentic.  a burst of different flavors well blended.\n\nWe tried all three deserts apple cobbler (so-so), key lime pie (good, but a bit more tangy than I'm used to or like), chocolate banana bread pudding (delicious).\n\nAll and all our savory food experience was divine (5 stars)  and dessert left more to be desired (3 stars), and service was terrific.\n\nA new favorite in Ft. Greene.", "author": "Fun L."}], "servesCuisine": "American (New)", "priceRange": "$11-30", "name": "Walter’s", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "166 DeKalb Ave", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/L0O4V6Nl0qRG0YDX8HhcdA/ls.jpg", "@type": "Restaurant", "telephone": "+17184887800"}