{"aggregateRating": {"reviewCount": 485, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-23", "description": "this was a great addition to fort green and is hands down the best food choice in the neighborhood. \ni love their drinks, their salads, dips and oysters. \nit gets packed on the weekends - beware.", "author": "Maia D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-18", "description": "I went there for brunch. It was good. I tried the eggs benedict on crab cake and I wasn't disappointed.", "author": "Aissatou Marie B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-10", "description": "Quite possibly the best fried chicken I've ever had. We made a reservation for 4 adults and 2 babies on a Saturday night at 5:30pm. The place was packed by 6pm. What happened to New Yorkers eating at 9pm? Oh, I know... everyone wants to eat at Walter's so they eat early to avoid the REAL chaos at 9pm.\nVery baby friendly restaurant. They had a nice highchair for our very social 17 month old. The wait staff entertained her each time they walked by. \nIt's pretty loud inside. Definitely more of a \"happenin\" kinda place. If you're looking for intimate and quiet, then this place isn't for you.\nAll in all, it was a great experience. The only reason I'm giving 4 stars instead of 5 is because the food took a VERY long time to come out to us. Sitting almost an hour with a toddler in a restaurant is never ideal.... but that fried chicken was worth the wait.", "author": "becky w."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-05", "description": "Best dining experience I've had in Fort Greene in quite a while. I love Fort Greene, but I always feel like the restaurant offerings are a bit underwhelming--No. 7 not withstanding. Nevertheless, I almost always dine out locally in support of the businesses that seem to be making their best effort.  Enter Walter's...\n\nWhat a breath of fresh air. The night my friend and I went it was totally packed and quite chilly outside. Everyone greeted us warmly--the restaurant owner was there and could not be a more humble and attentive host. We lingered by the bar as we waited for a  table--where I had the most delicious Tom Collins in my life! We opted to sit at the bar when space came up. The Bartenders were incredibly attentive through the whole dining experience. \n\nThe food was AMAZING. We shared the brussel sprouts, roasted chicken and artichoke dip (and let me not forget to mention the deviled eggs we had as a pre-dinner nibble!). I am going back for more tonight as a matter a fact. SO GOOD. \n\nI have to admit. I was there for brunch and was not as floored though the service was just as warm \u0026 inviting. Maybe the brunch menu could be tweaked but I hope they don't touch the dinner menu for a looong time.", "author": "Mil S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-17", "description": "Came for brunch on Sunday. 10-15 minute wait at 1:00, and no space to wait inside without annoying sitting customers, so be ready to stand outside for a few. Not a big deal. Couldn't decide what I wanted because all the food looks great, but I went with the popular fried chicken and waffles. Not mind blowing, but still very tasty. Especially the butter that comes on the waffle. Our waitress was very friendly, but not invasive. They give you a lot of food. The drinks are good. If you're a lemonade fan, I recommend the cucumber mint - the cucumber adds a good kick.", "author": "M E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-12-29", "description": "This is definitely one of my new favorites. Ate here a couple of weeks ago and the food was excellent -- I had meatballs and the fisherman's stew. Saw A LOT of things I want to try next time too.\n\nThe room was probably my favorite part -- big windows, cool booths, beautiful bar, etc. Someone here paid attention to the smaller details too, which makes all the difference. \n\nReally fun, happy, low-key dinner experience. Highly recommend.", "author": "Peter A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-23", "description": "Just had dinner there and loved the place.  The food was excellent, simple and tasty.  We had the crab cake, bibb salad and artichoke dip to start, all were winners.  The Brussel sprout side was really special, it is a must have.  The server mistakenly brought our a lobster salad and we politely explained it wasn't an appetizer but a main course.  The server took the dish away but the manager returned with it immediately and told us rather than throw it away he would let us have it on the house and to enjoy.  We didn't ask for it and it was no problem, but him going the extra mile was incredibly nice and indicative of the great attitude in the place.  His counterpart also stopped by to make sure everything was okay, great attention to detail and really greatly appreciated. \n\nThe mains were equally as good, we had the steak, roasted chicken, lobster salad and everyone was more than happy.  The place had a great vibe and it is clear they really care about the entire experience.  Enjoy the homey great food and friendly neighborhood place.", "author": "Hungry Brooklyn Mike C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-12", "description": "Came here early on a Thursday around 4pm or so, that amorphous nether world betwixt 1st and 2nd shift wherein the service and the food can, in some restaurants, be suspect. Lucky for me, I was blessed with being taken care of by Tommy, the bartender, who not only served up the perfect Negroni, but was nothing if not incredibly friendly and accomodating. And the kitchen? On their game..deviled eggs, wings, lobster, shrimp, and around 5:30pm, the skirt steak, cooked to perfection. So now, if its Fort Greene, its either Romans or Walters, depending on what I'm in the mood for.", "author": "Adam G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-10-12", "description": "Walter's Punch was an amazing drink. The bartender was fabulous and helpful.\nThe lightening is perfect, atmosphere and decor is very nice.\n\nI can't say the same about the waitress.  She was not very intuitive or just not a good waitress. \n\nThe Cat fish was SUPER salty to the point I couldn't finish it and I always finish my food!! My friend's fries that came with her burger were also very salty!\n\nEasy on the salt Walter!", "author": "Fahmida A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-21", "description": "I was so impressed after my first time at this place.  great music.  good food.  and the bartenders are always friendly.  the artichoke dip is yummy, as well as the catfish, bar steak, and fishmerman's stew.  take your pick.  they're also open late, so you can't lose with this little gem.", "author": "Quinn B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-08-19", "description": "Good food and house cocktails, just a bit pricey and the service tonight was a somewhat uninterested.", "author": "Mike R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-03-12", "description": "By far the worst service I have experienced in a very long time. The \"Ralphy\" from christmas story looking hipster who was serving us spent more time awkwardly placing our cutlery than listening, taking our order, following up, or even cleaning up and billing us.   The food was OK at best, but not when the dishes have been sitting in front of you for over 20 min..The prices were not to bad, but you might as well ask for the bill when you order because Ralphy will forget you exist. \n\nFire the hipsters and learn how to treat customers.  You could not pay me to go there again..", "author": "Justin B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-12-03", "description": "I had planned to take my boyfriend to Martha Brooklyn, because I've been bragging about how amazing it is, and wanted him to see that it lived up to its rep. Instead, Martha was closed (!) on a Monday night at 7:30!  Very disappointed, we headed to Walter's, which we've eaten at a few times before, for brunch and dinner.  Luckily, it didn't disappoint; we ordered the fried chicken with mashed potatoes, and the blackened catfish with coleslaw.  We also split a side of the brussell sprouts special, which was fantastic.  My fish was pretty good, and seemed on the light side which I appreciated post Thanksgiving.  The fried chicken was the real hit, however, and I can't wait to come back and order it.  I've been for brunch a few times, and they make a great bloody Mary too.  Also, our server was great; I ordered the salad special and really didn't care for it (mostly my fault, because it was kale, and I don't like kale unless it's cooked or prepared with a lot of dressing); she comped it from our bill, which wasn't necessary but was very appreciated.", "author": "Maeve M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-10", "description": "New Favorite resturant I wish there was one in the hamptons. The manhattens are yum yum yum, the food is awseome and the staff is super nice even though this place is always packed.", "author": "Jackie P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-03-31", "description": "Dear Walters,\n\nWhen you first opened we had such high hopes.  Now, after a year I'm afraid your settling into a bland mediocrity that seems to take hold in so many Fort Greene restaurants.  Your menu has barely changed since you opened.  It was a fine starter menu but its time to step it up.  Our most recent brunch included store bought oj, drippy and flavorless huevos rancheros and old arugula in the side salad. Recombining the same ingredients you have in every other egg dish to make a breakfast burrito 'special' is not so special.  The two stars are because your location is great and the vibe is nice.  You need to put more quality and care into the food if you want to remain a go-to spot for locals.", "author": "Pan C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-19", "description": "Argh, this place is so f-bombing good.Where do I start? The meatballs, the artichoke dip, the deviled eggs, the fried chicken, the french fries, the burger, the oysters? The oyster shooters??? What?  Come on man. Is this place real? Eat here. Be satisfied.", "author": "R. Amir J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-05-08", "description": "Went in search of a chill lunch place to eat and do a little work and decided to try out Walter's. It was almost totally empty at 12 pm on a Thursday, which was perfect for me. The atmosphere is great-- welcoming and airy. I love the giant circular bar, good addition to the space. I ordered the pulled pork sandwich with fries, and both were excellent.  The fries were perfectly crispy and salty, and the pork had a great sauce, which paired well with the pickles and slaw it came with.  I was totally stuffed afterwards, and at the lunch prices, it was a pretty good deal!  The servers were very attentive and easygoing.  I'll definitely be back!", "author": "Mandi W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-08-05", "description": "The cocktails are awesome and they have an delicious selection of beer and wine. Oysters are awesome. French fries are awesome. Food is awesome and there are always seasonal specials. Waitstaff is awesome. Nice atmosphere. I live in the neighboorhood and I love it!  Thanks guys.", "author": "marisa p."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-04-13", "description": "So mediocre! Typical of a brunch spot in the middle of an area with no other decent brunch spots. In Park Slope this wouldn't even get a second look, but in the brunch desert that is Fort Greene, this is your mirage. Unfortunately we went in with high expectations, because this place is always packed when we walk by. We headed over early and were on the the first patrons. The service is excellent. The staff is welcoming and friendly. The ambience is lovely. The two small complimentary muffins they gave us to start  were delicious. The coffee was god awful. I get the \"concept\" of bad coffee in a brunch spot that is selling that \"old school diner \"feel, but it just seemed sloppy here. My girlfriend had the smoked trout salad, which was great. I had the Eggs Benedict, which was mediocre. The potatoes, which were served under the eggs benedict were pretty bad. In sum, Walter's was disappointing, but we did go in with high expectations. Not so bad for a pretty brunch spot across from the park. We will try it again.", "author": "Jacob G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-20", "description": "Great service and even better food.  The oysters are fresh and the drinks are creative.  Great beers on tap and the service is stellar.", "author": "Cosme H."}], "servesCuisine": "American (New)", "priceRange": "$11-30", "name": "Walter’s", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "166 DeKalb Ave", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/L0O4V6Nl0qRG0YDX8HhcdA/ls.jpg", "@type": "Restaurant", "telephone": "+17184887800"}