{"aggregateRating": {"reviewCount": 485, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-04-06", "description": "Unfortunately I didn't have the pleasure of eating here. My friend and I left after asking for menus after watching a table that walked in after us recieve menus. When we asked for menus we received an attitude from the waiter. To keep from popping off I just left. I'm sure the food may be delicious, but that waiter definitely left a bad impression.", "author": "Ebony C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-28", "description": "So glad to see walters going strong. This is one of the very few places we are regulars at. When we need our shredded duck bun and artichoke dip fixes, nothing else will do. Big up to walters for keeping what comes out of the kitchen consistent for the 3 years and change ive been going there. They also have an amazing burger that is not to be missed. Love this spot! Service is always on point too. Definitely tops amongst its cuisine/price peers.", "author": "Estilomina P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-02-28", "description": "$16 for 6 shrimps? Are you guys serving some world class shrimp cocktail?\n\n\nCrappy waitress service. Bitchy attitudes shown by both owner and the waiter. Apparently trying to make a block sign for a check by grabbing someone's attention is considered as rude.", "author": "John C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-02", "description": "What a lovely find. I saw the restaurant in passing, and it was fairly busy for a Tuesday evening, so the following week, I made it a point to give it a try, particularly with the great Yelp reviews.\n\nWe arrived at 7:15 and already the place was nearly full. But there were still a few tables open, so we were seated right away. I decided to cheat on my diet and order the fried chicken, and switched the fries for the mashed potatoes. JUST HEAVEN. My husband got the grilled bar steak, which wasn't quite medium rare, but still tasty. \n\nFor dessert, we enjoyed the tiramisu and key lime pie were VERY VERY good. \n\nIt's a short walk away from our apartment, and most DEFINITELY a restaurant that we plan on being regulars of. I love everything from the food to the service to the ambiance -- they are doing it all right!", "author": "Shu Jin S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-09-24", "description": "I only dined here once or twice, the food is good but they rush you out and the tables are too close for comfort. Awkward experience, but good food!", "author": "Stacey M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-27", "description": "Walter's in Fort Greene is a nice spot - busy and engaging on a beautiful fall evening recently.  My g/f and I have a nice meal at the bar - I had a fish special (Hake) and she had two apps as a meal (meatballs, and octopus).  All were yummy, and arrived quickly.  Lots of flavor and well-presented simple meals helped.\n\nOne point about our spot - we were near where lots of cocktails were made, so we would often get the aroma of muddled mint, or lime, or whatever else they used.  While nice, it did interrupt our food smells, which were pleasant by themselves.\n\nService was good and attentive.  I had a nice Six Points beer/lager.\nFor the meal and good tip for two, I paid $85 (special, two apps, and a beer, all plus tip).", "author": "Liam R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-11", "description": "Amazing food, adorable corner spot, great people!  Awesome brunch!", "author": "Amy L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-20", "description": "Cozy restaurant with a great brunch...cute atmosphere and attentive wait staff. I will definitely revisit to try their chicken and waffles for sure...", "author": "Ashti D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-18", "description": "The place is very cute and a nice atmosphere (especially since they were playing gangsta rap in the background...luved that!!!!) great for a date or just late night viddles:)\n\nHonestly the food was good but the portions are just to small for the price, but it was tasty!!!  I think if your looking for a hungry man or girl meal this is not the place....BUT if you just need a quick \"light\" delicious bit of eddibles for a pretty penny then stop on in!!!  The drinks are just like the food tasty but a pricey.\n\nOur server was actually really good a cute girl from Georgia (sorry cant remember her name) who was very attentive and nice, made it better:)", "author": "Nicole B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-13", "description": "Great food. I love that the kitchen is open late at nights and you can always go late and enjoy the good food. The charred octopus is to die for.\nThe only downside is that it is very loud and always crowded. They do not take reservations so it's luck finding a table.", "author": "Rose G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-16", "description": "I really enjoyed my dinner I had here the other night. My bf and I are new to the area and decided to give this place a try. I had the spicy fisherman stew and he had the pork chop. Both were really good. We also tried some speciality cocktails and ended dinner with key lime pie. Everything was really good. In plan on trying this place for brunch next.", "author": "Brenna B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-12", "description": "Came a few weeks ago for a Sunday early dinner. The place was packed but the hostess and bartender kept an eye out for seats at the bar. Me and my guest were seated within 15 minutes of entering the place. \nThe service was great. I had the deep fried pulled pork fritters as my appetizer and pan seared catfish and red cabbage for my entree. I wasn't a fan of the fritters as they were a bit bland and a bit too much for me to eat. The catfish was marinated perfectly and was delicious.\n\nI will definitely be back.", "author": "Nikki H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-22", "description": "Yum and cool. 20 minute wait on a Saturday was expected but we took seats at the bar to get in early. My wife and I both had eggs Benedict, I had the smoked salmon she had the traditional .Bother were delicious. The bloody Mary was very good. The coffee was good, nothing exceptional but did the job. Ambiance was killer ,a very cool spot and everyone knows it. So, if you are in the neighborhood check it out. I have been told there is another location Williamsburgh,", "author": "Tom H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-11-18", "description": "This is a solid five-star, crush-worthy restaurant in all sorts of ways. The service is stellar. (How do the servers memorize the names of six oyster varietals and their various flavor attributes?) The decor is charming. The value is good. The food is creative and it definitely hits that mark of accessible dishes just beyond your reach as a chef: Really great ingredients prepared with creativity, skill, and thoughtfulness. \n\nWe shared:\n\n8 oysters (four each of two varietals so we each tried two oysters of the same variety so we could really, really taste all those attributes)\nBar steak with frites: This is a skirt steak, marinated tender, perfectly prepared, and served atop a small, dressed arugula salad. It was a contemporary successor to what Sammy's Romanian served decades ago. \nKale Caesar Salad\nBrussels sprouts: flash deep fried and server in vinegar-based \"Vietnam\" sauce that probably included some sriracha and aleppo pepper.\nApple-cranberry cobbler: We couldn't find the cranberries but we loved, loved, loved it. A delightful dessert in a cereal bowl served steaming hot and topped with what tasted more like a biscuit or scone dough than one usually used for cobbler. \nTwo glasses of sauvignon blanc brought the bill to $100 before tip. \n\nBONUS: Frites condiments include mayo and mustard in addition to the classic ketchup. \n\nBONUS: Amazing oyster sauces! Strategically, we ate our oysters just with lemon to get all the flavors, and samples the sauces alone.", "author": "Steve N."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-12-18", "description": "Wow what happened though? \nFood was terrible*, drinks were \nSub-par**Huge bummer\n\n*\"pork belly\" was an over cooked pork chop \n**fix your martini olive game ASAP", "author": "ReviewHaiku F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-29", "description": "Popular little brunch spot in Brooklyn. The fried chicken and waffles dish is yummy and the decor and bar area are cute. The only complaint is that there is usually a wait for a table and the space is quite crowded and noisy.", "author": "Abby F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-10", "description": "I took my very pregnant wife out for our last meal before our baby was born to a nearby Italian restaurant, my wife was not having it. So we proceed to dinner number 2: Walters in Fort Green. Walters has been my favorite watering hole for in Williamsburg for a few years now. So right when I walk in, I was delighted to see the same Latin American gentlemen that has been treating me well in the OG spot for two years. I've watched with this server since he was a pup; and I'm so happy to see him now as a seasoned pro. The two other servers were also on point. One seated us while the hostess was busy and the other gentlemen took my wife's burger away to be cooked for 3 more minutes. Long time fan of the other Walters. Glad to see fort green brought the heat and made our last date night without diapers a pleasure...", "author": "Jason K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-04", "description": "Wow!! What a lucky find!! Walters is all you can ask for!! Great ambience,  personable  bartenders,... Alejandro and Ruben, AMAZING food!! We started with the raw bar!! Fresh, cold, delicious!! Then we had the charred octopus... Perfection! The meatballs were out of this world!! Moist, flavorful , delicious in a red sauce. Lastly the tomato salad was the right blend of sweet and tart! And... We had the salmon... Cooked to perfection ! Do I sound enthusiastic ?? I am! The only downside is to learn Walter, the American Bulldog, who the restaurant is name for, passed away .... You should be proud Walter!! Your restaurant is fantastic !!!", "author": "Karin M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-28", "description": "**came here with family for late brunch was seated quickly the mimosas were kicking i must say but over priced \n\nthe greats:\nfrench toast, home fries. bacon,\n the chicken and waffles \n\n.....and the cat fish sandwich was alright\n\nlove the music the restaurant played and the food taste better then good \n\ndefinitely will be back \n\nsigned\ni love to eat \u0026 i do it consistently \n\nmr.von teese and family", "author": "Tyshawn V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-19", "description": "Man, I really wish Walter's didn't get bananas crowded on the weekends. Kills me that we have to default to another option one out of every three times because of how long the wait is. \n\nThat said, some aspects that they just do exceptionally well: the bar steak sets the bar for what a nice steak dish should do. Quality meat, outstanding horseradish cream on the side, and the fries are always cooked perfectly crispy. The sazerac is the perfect sidekick to that steak. \n\nHaven't ever been disappointed going here and always leave full, happy, and really glad that Ft. Greene has a restaurant that always will leave you smiling when you leave.", "author": "Riley B."}], "servesCuisine": "American (New)", "priceRange": "$11-30", "name": "Walter’s", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "166 DeKalb Ave", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/L0O4V6Nl0qRG0YDX8HhcdA/ls.jpg", "@type": "Restaurant", "telephone": "+17184887800"}