{"aggregateRating": {"reviewCount": 485, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-01-23", "description": "Sat at the bar for brunch and ordered the crabcake benedict for $14.  It came with one egg and one crabcake and no muffin but rather sat on a bed of dry potato hash.  When I asked about the second egg and crabcake, I was told its the crabcake is already too big for them to offer two.  Annoying but fine.  \n\nThen when I asked about the english muffin I was told it did not come with an english muffin.  \"So why is it mentioned on the menu?\"  Their response, \"its not.\"  \"Um, yes it is and then you list the possible toppings?\"  To which he responds \"sorry but no\" and proceeds to bring a menu to help me see the error of my ways.  When we read the words \"english muffin\" aloud together he then tells me that the wheat from the flour in the crabcake is more than enough and the english muffin would just be too much.  \n\nAside from both the bar tender and the manager rudely treating me like an idiot, I was annoyed by the disappointment of not having an american classic for brunch.  In the end I was too mad to eat and sent it all back to the kitchen before leaving.  Oh, and yes, I did taste it and it was not worth pushing through to finish the meal.  The crabcake at Del Friscos is far superior on only $3 more.\n\nSo many restaurants forget the most important ingredient to great dining is the experience.  And that proper communication always makes a good relationship.  Am I so pissed to say I will never go back, no.  Will I go back?  Maybe.  But I will always be left with the bad taste of this first visit.", "author": "Dara M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-13", "description": "Great food and really wonderful service. The steak is really solid and the fries are very tasty. Their Key Lime Pie is one of the better ones I've tried. The only reason I'm not giving them five stars is that I wasn't completely blown away by the food. They are however quite worthy of a dinner visit. Come early as they tend to get busy even on a weekday.", "author": "Zdravko R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-07-29", "description": "Overrated... I walk past this place everyday on my way home from work and it's always busy so I decided to finally give it a try last night.  I'm a vegetarian and there wasn't an entree option for me which was a bit of a let down so I ordered an app and some sides. The artichoke dip appetizer was really salty but was pretty good overall. The spicy deviled eggs weren't spicy at all.  There was a slight hint of heat but to be honest there wasn't anything to set these away from a plain deviled egg. The mashed potatoes and grilled asparagus were good. My friend had the short rib burger and said she was expecting something a bit more tender and not a patty. The atmosphere was a bit crammed and extremely noisy. I imagine this is form the tiled floor and the loud music. We were practically yelling at each other the whole time. The service was slow and overall not up to scratch.", "author": "Chris D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-02-18", "description": "My husband and I have been here three times in the past month, (the atmosphere and bar are rather nice). After this last time, we are convinced food was an afterthought for these guys when they opened this place. First time we went, we had the fish of the day, (which has been branzino every time), and it was very good. The next time, we had catfish and the seafood stew. Fine, but nothing special. This last time, my husband and sister-in-law had the deviled eggs, which were runny. My sister-in-law said, \"If I hadn't known this was egg, I would have just  thought this stuff was mustard.\" I ordered the $23 lobster salad - expecting a very well-composed, clean, nice dish with plenty of lobster meat for that price. I was given a glorified Applebee's-esque entrée salad - tons of chopped lettuce, browning hunks of avocado, about enough meat to fill a lobster claw, with some mint and grapefruit to \"elevate\" the whole thing. My husband's burger was not cooked to medium-rare - which is how he ordered it - and we concluded there are many burgers better than this one in the neighborhood. \n\nMy feeling is: atmosphere is quite nice if you just want drinks and oysters. As far as the kitchen goes, however, with such a \"classic\" menu, it better be the best in the 'hood, and it certainly ain't. Food standards here are sub-par at best.", "author": "She-Ra P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-04-07", "description": "The Host was awesome and told us there was a 30 minute wait. My husband and I got a cup of coffee and waited patiently and not 20 minutes later our table was ready.  The reason for only 3 Stars is my French Toast was burned on one side, the bread with my husbands poached eggs in tomato sauce was burnt and the potatoes in his dish were uncooked.  Great location, Great Vibe but some attention needs to be on the food coming out of the kitchen", "author": "Melonee G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-06-19", "description": "While I'd like more veg options, the salads are good. And the cocktails are delicious, nearly worth the $12.", "author": "Peter K."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-01-30", "description": "Wow. I came here with bated breath. It's been a while since my best girlfriend and I visited Walters for a Singapore Sling and some gossip over an artichoke dip and then some.  The food was amazing.  The oysters were succulent and delicious; the fried chicken with garlic mash was consistently with its crispiness and deliciousness. It was the wait staff that made my friend and I feel as if we were spending monopoly money. We dined at the bar; because thats our thing; You would think that we were invisible. We had to ask for a drink, we had to ask to place our order, we had to ask for a second drink etc...... I thought that maybe the wait staff was inexperienced, but  I noticed when different colored patrons arrived they got different treatment.  Their drinks were replenished before they finished; they were asked repeatedly if they were ready to order; they got shots on the house!!!! I thought for a minute I was in the South in the 60's with the exception of black men behind the bar. That was really weird to me and made me feel uncomfortable.  NEVERTHLESS, I enjoyed the food and the drinks and for that alone I tipped 20% on my entire bill; probably way more than the people who they were catering to who were drinking the house wine and draft beers.  And I adore Walter's but you will respect me and my money and for that you get 2 stars and I probably won't be back again.", "author": "Moni T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-20", "description": "The fried chicken is super. Actually everything here is really good. My only complaint is that the oysters are overpriced ($3.75 per oyster?? That's like $45 a dozen) and were not shucked cleanly when I had them.", "author": "Paul E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-19", "description": "The food is amazing here.  My friend and I had the steak, meatballs and some oysters.  They get quite a bit of people at the bar, so it can get a bit cramped.  I'm guessing on weeknights it's a bit better.", "author": "Thomas H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-12-24", "description": "We made a reservation for Christmas Eve. We arrived, the place was 60% empty. It smelled like ammonia and/or fish. We waited 5 minutes until waitress slouched over. She was rude and  rolled her eyes at us,  when we asked to be seated away from the door, she explained that they had mapped out their table arrangements earlier in the day and she couldn't be asked to change them even though there were at least 9 other tables and we had a reservation.\nWhen we again asked for a better table she refused. This type of attitude is not welcome in the neighborhood. Take it back to Williamsburg, and leave a perfectly nice spot for a restaurant that is interested in being a friendly neighbor with good food.", "author": "Meaghan P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-28", "description": "Perfect for brunch. Sophisticated menu. Not over whelming. Your boyfriend will like it.", "author": "Alicia F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-05-16", "description": "Delicious popcorn shrimp. Great artichoke dip. Tasty deviled eggs. Amazing fried chicken: spicy honey side sauce and moist meat and crispy on the outside! Great cocktails. Good atmosphere.", "author": "G Z."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-03-26", "description": "Walter's, I live right across from you. I was excited the entire time during construction. I was saying to myself, the second that restaurant opens up I am going to go there every night, and every brunch. \nBut no.... your food was SO disappointing!! \nLOBSTER SALAD: For $23 i got a mound of unexciting greens with a couple lumps of lobster (maybe a little less than a claw). Bland, boring, scam.\nFISHERMAN'S SOUP, $23: just... meh. Bland and unfilling. \nFRENCH DIP: For $18 this was probably the best deal but it still wasn't that good. I remember the one from Houston's being 10 times tastier.\n\nI guess the waiters are hip and trendy and all, but something like this might work in Wiburg but in Fort Greene I expect a little more substance and reasonable pricing. I REALLY wanted to love you... and become your best customer. But I don't think I'll be walking across Cumberland into your restaurant again.", "author": "Say M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-26", "description": "Great food, service, and vibe. Friends and I all ordered different menu items, and all  enjoyed. From burger to fried chicken to pasta w/clams to grilled fish, everything well-prepared, timely, and delicious. Spicy honey sauce that comes with fried chicken is a unique treat.", "author": "Brooklyn X."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-06-25", "description": "Went back again. Had a Caesar salad that was straight up gross. If you blindfolded me, and fed me this salad my first guess would have been pre made 7-11 freezer section salad. My second guess would have been complimentary salad at the Delta First Class Lounge, my third guess would be correctional facility, and probably my 340th guess would have been trendy and popular Brooklyn restaurant owned by successful and uber cool restaurant group. The prices for this experience are ridiculous. The service is very nice. Still. And the decor is quite nice. Maybe I am constantly ordering wrong, and I need to treat this place like an Applebee's and get something that's fried.", "author": "Sir M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-23", "description": "Truly a 5 star experience.....  Steak, fish and fried chicken were superb ...   We also were in heaven with the desserts.....  Def. a must go....", "author": "Kennia S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-01", "description": "Walter's has got it so very right.\nWe just had New Years Day brunch there and spent 3 hours sitting at the bar, making friends, and loving every second of our first meal of 2012.\nWe got the huevos rancheros and waffle + fruit and both were absolutely delicious and the perfect amount of food.\nThe decor is the best I've seen in a while and the owner, Danny, and his staff could not be sweeter and more accommodating. Tommy the bartender is especially wonderful and it's a treat to be served by him.\nThank you Walter's for coming to our neighborhood and we'll see you again real soon!", "author": "Mollie L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-26", "description": "Went here for Sunday brunch and really enjoyed it. The rad looking bartender fixed me a gin fizz. It was very good if you are into gin fizzes. The French toast was amazing. Even better than the chicken and waffles my friend had. I love the atmosphere here. Reminds me someplace that should be in the Bay not Brooklyn. I will definitely go back.", "author": "Ola F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-04", "description": "Overall, a good brunch spot. Nothing spectacular but good food in a relaxed atmosphere. The service is very good I must add!", "author": "Ashish G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-04", "description": "Pricey, but good.  Love this area of Fort Greene and Walters is a cool spot. I like bringing people from out of town here ... get the oysters! Fun vibe and good drinks.", "author": "Jenna K."}], "servesCuisine": "American (New)", "priceRange": "$11-30", "name": "Walter’s", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "166 DeKalb Ave", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/L0O4V6Nl0qRG0YDX8HhcdA/ls.jpg", "@type": "Restaurant", "telephone": "+17184887800"}