{"aggregateRating": {"reviewCount": 485, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-25", "description": "This restaurant was  just what we needed.  Bright and airy with attentive staff. Food  came quickly and everything was delicious.  I had the catfish sandwich which had a tasty slaw  and came with French fries. My Bf had the waffles and fried chicken. Both were enjoyable.  The Bellini was good.  The mojito was ok - a bit sour  and full of ice.  I would recommend it and would  return.", "author": "Linda M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-08", "description": "I just left Walter's with my husband and 2 kids under 4. While its not our first choice for taking our kids but it was our best choice!  From the moment we walked in the door.  The hostess was busy and the bartender immediately greeted us.  The Hostesses came up and was very accommodating.  We had to wait 15 minutes or so, but the food for the kids arrive less than 5 minutes after we were seated.  It was delicious and great! Very Quick and prompt service!!!  Definitely will visit Walter's again!  And we own an English Bulldog just like the owner!  Love the pictures of all \"Walter's!\"", "author": "Caroline L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-09-03", "description": "Grilled octopus was very good, but Walter's is too noisy to enjoy. I wish when a restaurant is crowded \u0026 noisy they would turn off background music. I asked, they didn't. Tin ceiling \u0026 tile floor, tables really close together.", "author": "Katherine P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-18", "description": "We enjoyed brunch at Walter's and had the french toast and a smoked salmon benedict. We are determined to go back enough times to try everything on the menu. You will probably encounter a little wait if you go during the normal brunch hours, but it's worth it. The service was great and the location is awesome.", "author": "Steph G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-09", "description": "Loved this place! Needed a late night spot for dinner last night and Walter's did the trick. Their kitchen is open until 1am. We arrived at 12:40 and they were more than happy to seat us for a full meal. We started with the shrimp cocktail and watermelon salad which were delicious. We both ordered the pork chop which did not disappoint! Excellent drink menu too. We will definitely be back. Great spot for a date. Music was a nice change of pace too. Johnny Cash came on a few times to give you an idea.", "author": "Laura Q."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-16", "description": "I don't give too many places 5 stars, but I definitely think Walter's earned it because of the amazing chicken and waffles I had here last weekend. \n\nI was in town for Governor's Ball and wanted to get some brunch with my host and my bf before heading to the festival. My friend lives close by to here and suggested this place, so we walked on over and were immediately sat down, no wait. \n\nI expressed my love for waffles and my friend suggested I order the chicken and waffles saying that it's amazing so I listened. The pumpkin waffle was soft but not too soft and yummy. The fried chicken was delicious and flavorful. The maple syrup that comes with it was not syrupy- it was thinner but I liked that. It wasn't too sweet so I was able to use more of it without feeling like I was consuming 15 lbs of sugar like regular maple syrup makes me feel. It also comes with a delicious hot sauce that I was in LOVE with. I wish I could put that hot sauce on every piece of fried chicken I ever eat from here on out. It was that good.\n\nMy boyfriend ordered the Walter breakfast, which comes with eggs, hash browns, toast and sausage. He ate it right on up, so I'm just going to assume he liked it lol.\n\nThey also asked us after we were done eating if we didn't mind moving from our table to a smaller one, given that there were only 3 of us and they were trying to sit a larger party. Of course we didn't mind, we had finished our food and were just working on our drinks and waiting for dessert. I had ordered the tiramisu. They sent over complimentary mimosas for agreeing to switch tables which I thought was awesome of them. My bf doesn't drink much, so that meant 2 mimosas for me! :)\n\nI enjoyed my brunch here and would definitely stop by if I'm ever in this area again. Chicken and waffles, I miss you!", "author": "Sandra N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-05", "description": "The brunch here is good fare. Examples are the Walter Breakfast, French Toast, and Chicken and Waffles!! Good atmosphere, good food, good service, good times!! Couldn't ask for much more!!", "author": "Gregory F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-08", "description": "This is my goto neighborhood brunch spot. I've had what could possibly be the best breakfast sandwich here. They're bloody Maries are on point. Everything I saw looked amazing. Recommend.", "author": "Trevor L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-03", "description": "The food was yummy, although I wasn't a huge fan of the Bellini that I order thus the star demotion.\n\nI had their burger with cheddar and bacon. It was excellent. My husband had their chicken and waffles. He gave it an 8 on a scale of 1 - 10. We even bought our two young daughters with us and the vibe was family friendly. \n\nIt was really cute/sweet when the waitress gave my two and four year their own menus to look at which made them feel important/acknowledged despite the fact that they couldn't read it. We ordered the two egg and bacon breakfast for them, but were nervous because they are picky eaters (we often end wasting money ordering them food at a restaurant). They ate everything and gave it two thumbs up! We will definitely be back.", "author": "Tara C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-09-02", "description": "was expecting some dark -lit bar when we walked in for brunch. Very surprised by the bright decor. It felt like a cozy diner. Still small...tables very close together. Since we came in early (11:30am), we got a seat right away and started ordering. \n\nI had the classic egg Benedict with ham steak (not the best I've had but still flavorful) while the hubs got the fried chicken and waffle (small anorexic  piece but nicely done). The cucumber mint lemonade and ginger beer were both very refreshing.\n\nWe were done eating in under 45mn.  OK food...but not worth the $$$ price.", "author": "Annie T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-28", "description": "What do you call a cow head on a fish's body? Mer-cow? Mer-moo? I'm sure it's a popular bar conversation starter because it's their logo and I'm always a big fan of getting to know the restaurant background better.\n\nI came here with my gf for a late brunch and sat at the bar with the cool breeze on my back. It was bustling, but I somehow felt at peace with a somewhat nautical theme. I was feeling like it was one of those boozy brunch afternoons, so we shook the bartender's hand and began our adventure.\n\n* Bloody Mary - Pretty decent. I like how they use the Icelandic vodka. It's a good amount of spicy and cures a hangover like no other.\n* Bellini. They use this peach concentrate on the bottom that causes it to fizz up, so be careful when stirring.\n* Oysters - East and West coast. I actually really enjoyed the East coast ones more. Fresh and some great sides.\n* Huevos Rancheros - An interesting mix for this one. Loved the poached egg on top, but it needed something more. Great flavors from the guac.\n* Salmon Eggs Benedict - Loved the combination of the hollandaise sauce with the salmon. I think the English muffin could have been crispier, but it all came together nicely. I'd recommend this over the huevos rancheros.\n* Oyster shooters - this was a nice surprise. The bartender, Tim, gave this to us because they forgot the oysters. It's basically a bloody mary with an oyster and some brine inside. I recommend not drinking it like a shooter and actually chewing the oyster (e'hem).\n\nOverall, I truly enjoyed that brunch and I'd do it all again exactly the same. Great company and great service. I'll be recommending it to my friends. What a cute find on a beautiful spring day stroll.", "author": "Clemens W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-12", "description": "Excellent chicken and waffles! Great atmosphere and attentive staff. Highly recommend!", "author": "Andrew R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-20", "description": "I came here for Sunday brunch. The wait is long but the food is tasty. The space is kind of small which contributes to the wait, of course, but also means you're nearly elbowing your neighbor as you try to eat your food, which is unpleasant.\n\nAlso, I'll never be ok with paying $10 for a mimosa. Come on its 2 ingredients and minimal work to make. I would give it 3.5 stars if I could.", "author": "Renee H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-08-21", "description": "Decor is very cute. We only had to wait for 5 mins before we sat - which was great. Fried chicken and waffles were tasty. The chicken component is crispy and well seasoned, the waffles are light and almost delicate. I also tasted the trout salad which was serviceable. The Bloody Mary was nearly undrinkable- it was extremely thick and sour. Service not the high point. Everyone was friendly, but our cucumber-mint lemonade took 20 mins to arrive, we had to ask for it 3x. The server also gave us incorrect change (shorting us $10) and was unapologetic.", "author": "Molly P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-11-14", "description": "My wife and a friend sat down for dinner around 6 on a Saturday night. Since the restaurant features cocktails and oysters and it was relatively early, I thought it would be appropriate to order drinks and food as we desired them as opposed to ordering more traditionally. Unfortunately, the passive aggressive behavior of the server indicated otherwise. Over the course of an hour and 15 minutes we spent $120 dollars on drinks and food, but the fact that we didn't follow the social norms of ordering led the server to place salt and pepper on our table, then \"realize her mistake\" place it on our neighbors table and comment \"oh- they're not even eating.\" We endured painfully fake smiles, and the rather obvious complaints to the manager who seemed to be encouraging the gossipy, passive aggressive vibe. On one of the harassingly frequent visits to our table to \"check in\" my wife touched the server on the arm and asked \"is everything okay.\" \"Oh! Of course! Of course!\" This attempt at an adult intervention failed and sent the server back to the manager for more glances and comments.  \n\nOverall, I found the behavior of both the server and the manager to be bizarrely irrational. There was no one waiting for our table, we were polite and direct, and simply wanted to order as we felt the need to drink or eat. Perhaps Walter's should lay down some linen tablecloths and hire old-timey, mustachioed cartoon servers who might more clearly enforce the social norms of the restaurant. \n\nIf I know there are rules, I will gladly follow them. But this kind of irrational, passive aggressive behavior is not fitting an adult in any setting. I shouldn't have to \"take the high road\" with a server and we still left a good tip, but I definitely wouldn't encourage any friends to eat there and I've been dining on Dekalb for at least 15 years.", "author": "Alexios M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-07-10", "description": "The menu and reviews for this restaurant are so good that we met friends there for dinner. \nPros: staff is attentive and accommodating and the food is delicious.\nCons: Very noisy. Portions are minuscule and side dishes are not included.  Prices for the amount of food are outrageous.  I ordered soft shell crabs.  I got one crab with tartar sauce no sides included. As a result, I also ordered asparagus which were the skinniest stalks I've ever seen. My husband ordered the fishermen's stew which, while delicious, was not nearly enough food.  We left the restaurant still actively hungry. I don't expect or want huge portions, but if I'm going out to dinner, I do expect enough food to satisfy my appetite.  We wont be returning.\n\nFood: Tasty\nStaff: Really good\nSetting: barely comfortable\nPortions: small, skimpy\nValue: terrible", "author": "Julie S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-20", "description": "Fried chicken and waffles so good it's with the loudness and the wait, even with a small child, who they were very accommodating of. Totally worth it.", "author": "Sydney K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-17", "description": "Good ol' Sunday breakfast noms. The flourless chocolate cake is amazing and made without flour... It's really crumbly but also rich and creamy - I would highly recommend it for your daily chocolate fix, 'less you hate all things chocolate and don't have a soul.", "author": "Jeffrey C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-02-05", "description": "I get so excited when I learn about a new restaurant that has opened up in my neighborhood! This restaurant takes the place of the terribly pathetic Asian fusion place Rice Bowl. Thank goodness we have Walter's now!\n\nI have tried to come here twice before and could never get a table. The wait is always atrocious and I never had the time for it, until this past weekend.  My cousin was visiting me in Brooklyn and so we decided to have dinner here this past Saturday night. \n\nWe arrived at 6:45pm and already there was a 45 minute wait. We decided to wait it out and went over to Madiba's for some cocktails.  In 25 minutes, the hostess called us. Score, we got seats in less than 30 minutes!\n\nThis is absolutely hipster central. You will see handle bar moustaches, urban woodsmen, women that look like fairies.  It is a sexy place,dimly lit and perfect for a date. \n\nHere is the run-down of what we had:\n\nOysters from Seattle, Washington - EXCELLENT\nArtichoke dip - Tasty but nothing out of the ordinary. You can't screw up artichoke dip. \nCrab cake - A good cake but not the best I have ever had.\nBlackened catfish - The fish was tender and blackened appropriately.  Nothing too exciting. Good accompanying coleslaw bed. \nFrench dip - My cousin said he has eaten better\n\nOverall, the food is just A-OK. Nothing that stood out, but everything was good and decent.  If you're looking for a solid meal in the neighborhood, this place is a good choice. If you want unique, this is not it. I will have to say that the service was impeccable and everyone working here was extremely pleasant and friendly.  That is just the norm for Brooklyn. They also were playing awesome 80s music. I was bopping along to Lionel Richie's \"Al Night Long.\" \n\nGood clean fun, this place won't get you in trouble. No surprises and that can be good sometimes...", "author": "Vivian H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-06-01", "description": "Came here once,  NEVER AGAIN. They apparently have different menus for Breakfast, Lunch and Dinner. I was looking forward to getting the pasta with clam but it wasn't available at the time which was highly disappointing. So I went with a sandwich my waitress suggested which was mediocre, my bread was so hard I had to eat it as an open faced sandwich . The only thing I enjoyed was my fries and even that was a bit too crispy. The food may look good but it certainly doesn't taste it.", "author": "Sarrah T."}], "servesCuisine": "American (New)", "priceRange": "$11-30", "name": "Walter’s", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "166 DeKalb Ave", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/L0O4V6Nl0qRG0YDX8HhcdA/ls.jpg", "@type": "Restaurant", "telephone": "+17184887800"}