{"aggregateRating": {"reviewCount": 485, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-12-03", "description": "Definitely over priced for small portions. Our entire party went home still hungry. I ordered the Omelette Bar, a small-ish omelette with a bit of salad and hash browns. Was charged $3 extra for egg whites, but was never told about the extra charge, only noticed it when we got the bill...", "author": "Marissa S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-02-26", "description": "Will not return.\n\nHad huevos rancheros. Bland, uninspired and not filling.\n\nHubby had chicken and waffles. Butter and waffle were tasty but he joked that it was a child's portion.", "author": "Diana B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-01", "description": "Walters is very convenient to where I live but, despite that, I rarely eat there. Today, however, I was feeling lazy, so it was perfect distance to walk for Saturday brunch.\n\nIt has received a ton of positive reviews, so my expectations were high. The ambiance is fun and relaxed, the location (again) is convenient, and the service was good. The food, while also good, wasn't particularly outstanding, but, for the price, it is not worthy of complaint either. \n\nIn short, Walters is a viable dining option for those spending a weekend in Fort Greene, and looking for a quick meal. Note that there were quite a few children while I was there, so it's a cool kid-friendly place, too. I can certainly see myself returning.", "author": "Chi M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-18", "description": "This is a nice quaint place to go to that is hidden in Fort Greene. I took my mom here and we enjoyed a watermelon salad. It was very refreshing for a hot summer day. I also enjoyed the shoestring fries that paired well with my sandwich, which I partially took home as it was a lot of food.", "author": "Deirdre L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-15", "description": "I came here for Saturday brunch. The wait wasn't bad at all. I got here around 2 pm and waited 20mins for a table for 4 people. I got the egg Benedict with ham. Honestly, nothing can go wrong ordering that right? The egg was runny just the way I like it. It was the English muffin that was annoying. It was hard to cut with the knife they provided. I also got to tried the chicken waffle. It was delicious. They gave you maple butter. The chicken has a hint of spicy. It was a great combination. Overall, I enjoyed the food there.", "author": "Cristina L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-04", "description": "When I moved to Brooklyn, I started to frequent Walter's for brunch.\n\nYou can count on it being PACKED. Clearly a testament to the quality! We grabbed two seats at the bar, which are first come first serve. If you are going with more than one other person, I would count on a little wait time, but the food is worth it. We usually always find ourselves at the bar.\n\nI had the spinach benedict- so good! LOVE the hollandaise and potatoes. My friend had the breakfast sandwich with goat cheese, egg, and avocado on brioche. Also delicious!\n\nI ordered a virgin Bloody Mary, and I wouldn't suggest it. It tasted like just hot sauce, no real tomato flavor at all. I can't imagine vodka would have made it any better.\n\nThe prices are fairly good as well if you aren't drinking alcohol.", "author": "Ashlee S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-28", "description": "We've enjoyed eating at Walters on several occasions. The fish stew was delicious. The steak was really good. The fried chicken with the wasabi sauce was terrific too. A great spot with a secret other spot in the back room (shhhhhh)", "author": "Andrew E."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-03-12", "description": "Please bring back the skinny fries with the bar steak! \nSo disappointed to see they\nhave changed their menu. The two best items on the menu, the bar steak and the pork chop, have both changed in recent months. My boyfriend and I come in at least once a week for the bar steak with skinny frites. Now they are thick and bland and overly salty. \nThe pork chop entree also previously had an amazing cherry chutney that has been changed to a so-so sautéed apple topping.\nI live in the neighborhood and Walter's was always our top choice for dinner. With the menu changes, i'm not so sure anymore.\nThe service and ambiance are still great.\n3 Stars for now for less tasty menu. \nPreviously 5 stars", "author": "Monique B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-18", "description": "This place is awesome. Food is delicious. Service excellent. Sometimes a wait but totally worth it.", "author": "S W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-30", "description": "Update! Finally got back here for dinner. Split the duck buns (tasted like chicken salad sandwiches somehow- but delicious regardless) and the pork rib bar snack thing (which was BOMB) for appetizer. Also sipped on the \"gold rush\" cocktail (whiskey, honey, lemon) which was delicious and ice cold. \n\nFor dinner I had the fried catfish with slaw \u0026 some type of chipotle mayo dip, yum, with a side of the Brussel sprouts (they were decent but had a ton of pickled red onion slivers in there- not my favorite thing ever. Wanted more savory). My friend ordered the burger with fries and more or less cleaned his plate. \n\nAmbience: dark, candlelight, great service, and great music (90s hip hop mostly) playing softly in the background. This place genuinely doesn't disappoint (was packed on a MONDAY night at like 8pm) and I will be back again and again. \n\nSalute, Walter's!", "author": "Raven C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-08", "description": "This place is really good Brooklyn definitely has a specific vibe and I would day that this place fit it quite a bit. One thing I notice is that people were making a lot of eye contact with me and it felt like in a good way different from Boston (which is were I live lol i don't know for the people who just follow randomly and don't know me if you even knew that). I had the chicken and waffles and it was very good and I had a cappuccino and it doent take much to impress me as far as those go so it was good to. Our waitress was nice and so was the guy who took my syrup (asked if he could). Definitely this place would be good for breakfast can't speak to other meals. It was fun to catch up with my friends", "author": "J H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-02", "description": "I do enjoy grabbing a dinner, quick snack, or breakfast here at Walters when I visit New York. \n\nThe food is absolutely delicious! Their fried chicken is the best I have ever had! Not really a fan of the eggs benedict, even though my sister loves it. I'd come here for the oysters anyday. They have some delicious deviled eggs as well.\n\nThis place has a Speak Easy/Prohibition feel to it with the decoration, and I've never been disappointed with the customer service, behind the bar r at the tables. Their customer service is beyond none, almost as good as their food! The waiters and the bartenders always have a great recommendation or make an amazing drink for us. \n\n\nThe only thing that prevents me from giving them a five star, is I just feel like the space is so cramped. It's so popular here that they want to seat as many people instead of making them wait  (which I absolutely love) but it just means you are suffering elbow space and often conversation with your neighbors. \n\nOther than that you should definitely head to Walters! If you don't you are missing out on a truly amazing experience both culinary and personal.", "author": "Nahid D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-13", "description": "This is the perfect place for weekend brunch. It's like something out of a Nancy Meyers movie. The food is standard brunch fare done very well. The location, decor and service are where it's at. The PERFECT place to start your weekend.", "author": "Geoffrey L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-02-14", "description": "Just finished brunch:\n\nGreat atmosphere, attentive service, good music.\n\nNow to the food:\n\nBurger - excellent!  Juicy with a lot of flavor.  Meat lovers rejoice!\n\nShashuka - good but nothing special.", "author": "Rene B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-28", "description": "As with all brunches, we had to wait for a table when the weather was cold and windy, but my mood was lifted instantly by the fried chicken and waffle.  The chicken was so crispy yet juicy.  The bad part was I had a cut a piece to share with my friend.", "author": "Juan J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-09", "description": "Solid brunch place with friendly service and a damn good burger and fries. \n\nPrices seem a little on the high side ($11 Bloody Mary = Jake not boozy brunching here anytime soon), and some of the breakfast options were underwhelming (I'm looking at tu, huevos rancheros) but overall a decent neighborhood spot.\n\nHaven't checked out the \"hidden\" (name was on the sign) sushi place in the back yet, but it's on my list.", "author": "Jake D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-31", "description": "Great food and very friendly and attentive staff!", "author": "Alex G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-16", "description": "Right around the corner, took me awhile to check it out.  First thought is pretencious overpriced brunch, which I feel is all too common in NYC.   Par for the course though.  Took a little awhile but when the food arrived... WOW!  Steak and Eggs, the steak as a super legit skirt steak, but the eggs.  Best ever!  I was blown away by the texture, flavor and layering of something as simple a scrambled with cheese.  I rarely order my eggs like that, but im so glad I did.\n\nEverything else was great, but the eggs over shadowed them all.  --  Often my daughter doesn't finish her food and I may have a taste.   She had the french toast, and as someone with not much of a sweet tooth I found them completely and totally flawless.  Lightest french toast ever, with an amazingly toned syrup.   Fantastic!  Highly recommend.", "author": "Mo H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-08", "description": "The IPA here is amazing.\n\nThe Bucatini here is amazing.\n\nThe Pork Chop here is amazing.\n\nThe Bibb salad here is delicious.\n\nThe female server here is amazing.\n\nThe new chef here is much appreciated! Looking forward to trying more of her pastas as the weeks go by.\n\nWe come here twice a month, and it just gets better with age.\n\nThe perfect weeknight dinner spot. Yum!", "author": "Joshua F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-30", "description": "Food and drinks were awesome. Loved the comfy, neighborhood vibe of this place. Fried chicken, steak,and brussels were fantastic. Service was super friendly although a tad slow, but then they brought us free dessert to compensate, which more than made up for it. Will definitely be back!", "author": "Elena S."}], "servesCuisine": "American (New)", "priceRange": "$11-30", "name": "Walter’s", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "166 DeKalb Ave", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/L0O4V6Nl0qRG0YDX8HhcdA/ls.jpg", "@type": "Restaurant", "telephone": "+17184887800"}