{"aggregateRating": {"reviewCount": 485, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-25", "description": "Truly had a great experience a few years back at this quaint restaurant! It was one to the the first that got me into the whole brunch fad! Service, speed, taste-- all superb! Next time I'm in the city, I'll be there!", "author": "Crystal C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-06", "description": "Accidentally ended up there on Sunday and was pleasantly surprised. After speaking with one of the nicest hostesses ever, I decided to try the fried chicken and waffles. While the chicken was perfectly flavored and cooked and the brown sugar butter delicious, the waffles were soggy and not really too great. I nevertheless enjoyed it, but I would high recommed they make better waffles.\n\nThe real winner for me was the cucumber mint lemonade. It was one of the best drinks I have had, it was so refreshing and the right amount of sweet. It would be perfection on a summer day. \n\nThe restaurant itself had a very retro vibe and decor which I loved. It has a large bar area and the tables are very small and close together, but it was very charming. I will definitely be back!", "author": "Holly M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-22", "description": "Tried the French dip, fried chicken and gem caesar. All were great! I was a little tipsy and it was pretty dark but I remember everything being delicious!", "author": "Diane Z."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-19", "description": "Distance only made my heart grow fonder! \n\nWe still live relatively close to here (about a 15-20 min walk) but we used to live a block away. Soooo, now that we can't just pop in whenever, I find myself actively MISSING Walter's a lot. \n\nEspecially the chicken and waffles. Ohhhh, the chicken and waffles. Please hurry over and get their chicken and waffles, available for brunch on the weekends. The chicken here is so crispy, so juicy, so delicious. Even the white meat is juicy, which is impressive (each order comes with one piece of dark and white meat). If you can't make it for brunch, they do serve the fried chicken as an entree for either lunch or dinner. The waffles here are really yummy as well - they aren't exactly super crispy but are a little more on the cakey side. This makes the waffles PERFECT for holding the maple syrup and hot sauce. By the way, Walter's serves the chicken and waffles with an apple cider butter and a side of tangy hot sauce. Pro-tip: ask them for their other housemade hot sauce as well - it's smokey and more mild but a nice addition to the other flavors.\n\nThe most recent time we went, we had Bloody Marys with extra olives, which were very tasty. There was a nice heat to the Bloody Mary that I appreciated. Their (I believe housemade) mix is SO flavorful and not watery at all. I really enjoyed it.\n\nFor brunch, you may end up waiting up to 45min or maybe even more - it gets PACKED cus it's awesome. It's totally worth it though! So, I say do it!", "author": "Sahar N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-09", "description": "Best brunch in Fort Greene. While I am a regular at their sister location in Williamsburg, I do love swinging by this Walters when in the neighborhood. If reservations are full on Opentable, more likely than not you will wait for a table during any meal here on the weekends. Luckily there is a fully equipped bar with anything you could imagine or you can step outside and do some quality people watching until your table is ready. \n\nWhile I enjoy any and all meals at Walter's, most recently I came by with a friend after a brunch down the street for some sensible post-brunch drinking. The hostess was very accommodating and given that it was the tail end of brunch there wasn't too much of a wait. After a Bitter Margaritas we gave in to the early evening menu which featured a few small bites (we opted for the fries and deliciously spicy dry rubbed chicken wings.) It was such a fun (and admittedly indulgent) way to spend the afternoon, with the beautiful apartments along Cumberland Street as our backdrop as the sun went down and the dinner crowd started filling in. We were there for quite some time and the waitress was lovely throughout, at no point making us feel rushed. All good things must end, however, as did this trip to Walter's but I will definitely be back very soon.", "author": "Ariella G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-13", "description": "Not great for kids. Don't bring a stroller. No space. \nFood is great, and so are the drinks. The server which wasn't our waiter didn't know where the food went, and we watched him multiple times try to deliver food to the wrong table.  Not sure how that works or gets screwed up.  Maybe the restaurant doesn't have a system in place. Loved their old fashion, and my friend loved their side car. We both had steak and porches eggs. The eggs were slightly over done, but it was her preference anyways. She preferred a more cooked inside, and I wanted the yoke runny. C'est la vie.", "author": "Dililah S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-20", "description": "Came for raw bar . So fresh and delicious. Cute little spot casual but intimate. Drinks were on point and quick service. Totally worth it ! Will be back for full menu", "author": "Lee J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-14", "description": "Excellent local restaurant/diner.  Great bartenders and servers.  They make good recommendations and all the things we tried on the menu were tasty.  Of special note The French dip sandwich(get it with cheese and grilled onions), the fried green tomatoes, pork belly and spicy wings.\n\nLike JavGuz says, if it is on a corner it has to be good.\n\nThey also make excellent drinks.", "author": "Juan C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-03", "description": "Came by for drinks and some oysters, so that's all I am basing this review on. \n\nHad a lion stout. They give you a can and a cup. Thought they would be draft beers. My friend had the cucumber honey lemonade with a shot of gin, and that was really good. \n\nAlso had 5 oysters. When it comes out, the waiter tells you which order to eat it in. It comes with a lemon wedge and an assortment of pickles onions and cocktail sauce. They go well with the oysters. The oysters are fresh and meaty and delicious. \n\nPeople around me seemed to be enjoying their food and would come back to try their entree items. However, I noticed that the menu is $$$ so don't come here if you're on a budget.", "author": "Jane M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-01-15", "description": "Average spot for brunch - none of the dishes stood out but it is children friendly (they had a high chair available for my gf's kid).", "author": "Wendy L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-03", "description": "I've been meaning to visit Walter's for a while. But there's always a line out the door for dinner, and they're really popular for brunch.\n\nMy getting to Walter's was actually the result of a bit of happenstance. I was up at an ungodly hour due to hot wing eating contest-induced heartburn (long story), and found out that my friend also had problems sleeping. So we made plans for brunch at 9:45am (though I guess that's bordering on breakfast). The place we originally wanted to go to was closed for renovations, so I gave Walter's a call, found out there was no wait, and that's how we ended up having a great meal.\n\nWe got a table by the door and ordered some much-needed coffee (they get theirs from Oslo, so pretty damn good). I decided 10am was a little too early for alcohol. What have I become?\n\nOddly enough, I actually have been to their sister restaurant Walter Foods in Williamsburg before, but never to this location, which is walking distance from my apartment. I enjoyd my meal there as well.\n\nLuckily, their famed chicken and waffles are available at both locations. I convinced my friend to order the chicken and waffles.\n\nI ordered their smoked salmon eggs Benedict, and we split the two.\n\nThe waffle was super fluffy, and the chicken was crispy, juicy, and everything you want from your fried chicken.\n\nThe smoked salmon was also really good. Served on an English muffin and over a bed of hash browns, which was delicious. Super runny poached eggs completed the package.\n\nSo. Good.\n\nService was great. Food was excellent.\n\nI'm glad I finally made it to Walter's!\n\nReview #2300!", "author": "Kenny C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-02-18", "description": "Walter's\nNY BK Fort Greene\n12pm Saturday 11th February 2017\nThree Stars\n\nSaturday Brunch with friends started with a 45 minute wait for a booth with a crooked table. The service was overall good. Two servers brought out our 4 coffees at the same time. The food was okay. I had the Eggs Benedict. The English muffin was a bit soggy, the poached eggs were perfect, the hollandaise was barely holding together, and the large grilled ham steak was tasty. The \"hash browns\" were closer to mashed potatoes or puréed home fries. It had no browning and no crispiness. The price was reasonable but wasn't worth the wait.", "author": "Leonard L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-31", "description": "This place is so on-point! What a great find!\n\nDropped in here with my gal after seeing a show at the nearby Irondale Theater a few nights ago.\n\nFood, music, service, ambiance. Just right. Nice spot for a tasty dinner and the kitchen was open late so we scooted into a booth to feast.\n\nFried chicken, grilled salmon, cauliflower side, and a complimentary slice of key lime pie for dessert.\n\nPerfect late night dinner. Heaven.", "author": "Phil H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-14", "description": "What to do for an anniversary dinner when one of you isn't a foodie and \"just want[s] a burger\" and the other one can never make up her mind, always wants to try something new, definitely did not want a burger, and hates bad food experiences? Well, you take a chance on a new place of course hahaha\n\nI would really give Walter's 3.5 stars but unfortunately that's not an option. Parking isn't fun by Walter's but the place itself probably makes up for it. The atmosphere is vibrant; though it may seem romantic (soft candle lighting and all), it is quite loud and the fact that you have to scream to your date (since chances are he's sitting across from you and not next to you) does take away from the romance factor. \n\nGood drink options, but we didn't get too lucky with the beer - they came back three times since every time my husband chose a new one, it turned out they sold out.  Option number four was ok but I'm having a difficult time seeing how it justifies the $12 . I did enjoy my negroni.\n\nThe food didn't disappoint - can't tell you how happy I am about that. Grilled octopus was good (yes I've had better but...) it had a nice flavor and wasn't too chewy. The burger was good (I'm told) and the fries were just awesome (the highlight of the meal and that's not a bad thing lol) I definitely liked the rigatoni with oyster mushrooms and pine nuts - great flavors, just enough of everything.  Was too full for dessert but doesn't sound like I missed too much. \n\nThe service was friendly (for the most part). It seems that at some point the waitress got a bit frustrated with hubby's indecisiveness about beer - can you blame the man when you keep saying you've sold out of all his options? Hahaha \n\nAll in all, a success! Thanks for not disappointing! !", "author": "Tatyana R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-19", "description": "Stopped in with a friend for some oysters and cocktails a few weekends ago and was pleasantly surprised. Very cute little place with a great vibe. The cocktails and oysters were excellent.", "author": "D E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-15", "description": "We had breakfast at Walters cafe, they asked how many we wanted to seat and when I let her know we had a party of 11 she immediately jumped into action. She was even nice enough to ask a couple if they minded scooting over to seat 4 of us. They were friendly and ready to serve, the hostess was great. On the downside the waiter never introduced himself finally I asked him his name and he said his name was Luis, he seemed as if he didn't care to be at work today. I could've done without him. The food was good and moderately priced, the atmosphere was friendly and upbeat and then IT happened. 2 of the 11 plates ordered had hair in the waffles . The hostess apologized repeatedly and said they were looking into it. She comped us for the waffles and the waiter gave us a complimentary key lime pie.", "author": "Jasmaine D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-28", "description": "I had been craving a good french dip sandwich for months and Walters did not disappoint! The drinks are a little expensive for me but I will still definitely come back!", "author": "Kelsey W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-15", "description": "Came here for brunch on a Saturday, around 1130am with my bf. Restaurant was busy but we got seated immediately. There was a group of 4 in front of us who had to wait though. \n\nFood is good here. We ordered the chicken waffles and the salmon benedict. The chicken was warm and tender with a nice fried crunchy coating. The waffles were warm soft and fuffy. Bf said it's probably one of the better waffles he's had on a chicken waffle dish (and we've tried many, since I'm a chicken waffles freak). The salmon benedict was tasty too. Good flavors, although my egg wasn't as runny as I would've liked. \n\nWe ordered the cucumber Mint lemonade and the pomegranate lemonade. They were so sour...in particularly the promegranate. I did not enjoy them at all.", "author": "Ada W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-12", "description": "Overlooking Fort Greene park is awesome enough, but wait until you get inside this corner \"bistro.\" Everything about the lighting and decor makes you want to settle in for a few hours. We went for dinner on a Wednesday night and despite the crowd and lack of reservation, we were seated promptly in a back booth. The service was on a level reserved for much fancier establishments. Our server was attentive and catered to our requests with pleasure. As we enjoyed our conversation, eating like snails, staff continually passed by our booth dropping glasses, POS pads, silverware and napkins. I looked to my date wondering what kind of juju we were giving off. It made for a few laughs in between bites of burger, matchstick thin fries, garlic mashed potatoes, and balsamic dressed Swiss chard. It was a small plate kind of night for me for health reasons. I really wanted the roast half chicken and deviled eggs!! There will be at least two more next times here - a proper dinner and a taste of their legendary brunch food. I can't wait to chew!!!", "author": "Julia F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-06", "description": "I'm a super sucker for an old school New York style restaurant. Leave it to Brooklyn to deliver this small, quaint, really good gem of a diner. \n\nWalking into Walter's is like walking into Dempsey's in the 1940's (I'm not that old but scenes from Godfather Part 1 look like Walter's san the neon signs):  Bar in front, tables lining the windows with booths in the back. Wow, I love this stuff!\n\nThe menu is \"Comfort Food\" central. Fried chicken, Steak and frits, Caesar salad, stuffed Deviled eggs, French dip sandwich, hot Chicken wings and so much more. BTW we had all of the above and it was all excellent. The bar is generous, the prices are reasonable, the service is friendly and the ambiance is ridiculously good (see above).\n\nI loved coming to Walter's. It made my first night in New York, really feel like my first night in New York.\n\nBRAVO Girls and Guys!!!!", "author": "Sidney Z."}], "servesCuisine": "American (New)", "priceRange": "$11-30", "name": "Walter’s", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "166 DeKalb Ave", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/L0O4V6Nl0qRG0YDX8HhcdA/ls.jpg", "@type": "Restaurant", "telephone": "+17184887800"}