{"aggregateRating": {"reviewCount": 485, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2019-05-19", "description": "I came here with my friend on a Saturday afternoon for brunch, and it was packed! This place is super popular, which makes sense since it's right across the street from Fort Greene Park BUT ALSO because it's delicious and the service is great!\n\nThe hostess kept checking in to see if our party was complete because she was holding our table, which was really nice of her and I appreciated that. I ordered the Walter's breakfast - really clean and simple, and the flavors were nicely matched. My friend got the chickpea and tomato stew - she seemed to enjoy it.\n\nThe staff is very friendly and accommodating, and we left full and happy without breaking our wallets.", "author": "Kristen L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-31", "description": "Brunch restaurant in front of Fort Greene Park. The wait on a Saturday around 1:30 was real 20/30 mins. Me and my friend were seated right then and served by a really polite and smily server.\nAs soon as you are seated you are served with complimentary small muffins. A really lovely touch. \nThe place is small and cozy, and at the same time elegant. We had a two of their brunch specials and they were both delicious. I enjoyed very much my omelette with a side of salad and hash brown, while my friend had their burger with a mount of crispy and thin French fries.", "author": "Martina C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-03-21", "description": "Offering brunch oysters is almost bribery. Little Shems \u0026 Wellfleets made my freezing cold morning that much happier. Oysters come with cocktail sauce and two mignonettes, all of them are low key, the oysters shine. \n\nI ordered black tea and an omelette with andouille and pepperjack, it comes with a hash brown and lightly dressed greens. The hash brown was delicious, crispy on the outside and softer on the inside. They also serve their omelettes French style, meaning the fold of the egg is thinner, much more delicate, and there is no browning. I think this is the superior way to serve omelettes :) \n\nI will say the seats by the door do get cold in the winter. They have two doors and a thick curtain, really there's only so much you can do when it gets as cold as was the day I came. Luckily they have hooks for all your winter spread both at the bar and along some of the walls.\n\nThe painted white tin ceiling and beautiful floors give the impression that the space has been here awhile and is being well cared for. Great atmosphere, friendly, attentive service even when it was busy!", "author": "Luci B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-15", "description": "I've never met Walter, but I have to assume he's a great man. In fact, I'd vote for Walter for president (he might be the only one not running right now). \n\nYou heard it here first. I'm throwing my support behind the Walter/Fried Chicken ticket for 2020. \n\nPolitics aside, this is the restaurant that I would aspire to, if I were ever to own a restaurant. They offer American staples that are well-executed and flavorful; the food is beautiful because they are hearty portions that are unpretentiously delicious, not because they were plated with tweezers. \n\nIt is both classic and classy, and still casual enough to be a good choice for any occasion. Walter's is the ideal place for a lazy brunch, an oysters/cocktails/deviled eggs date, a celebratory dinner, a weekday lunch with someone else who is blowing off work, and just about anything else I can think of. \n\nThe menu has enough on it that everyone can find something they are excited about, but limited enough that I'd eat anything on it, and I haven't had anything bad through quite a few visits. \n\nThe burger is nearly a half pound (none of this thin patty nonsense going around - although I like those too), cooked correctly, with all the things I want on a burger. They pickle their onions because it tastes good, and because they know I want onion on my burger but I still want to have friends after dinner. \n\nThe fries are perfect. I don't say that lightly. \n\nThe fried chicken comes with hot honey, as it should, and it satisfies every craving you've got. If I'm feeling healthy, there's always a tasty fish on the menu (steelhead trout, black bass, etc.) and vegetables if I'm in a cruelty-free mood. Pasta, if I need some gluten in my life. All of this is properly cooked. \n\nThe cocktails are excellent (including the bloody at brunch), the hash browns are why you go out for food you can't cook at home in good conscience, and the egg dishes are done right. \n\nIt's not amazing for kids, but it's not so bad either (the tables are tight, so leave your stroller at home though). The staff is lovely in general, and was so sweet and helpful with any of our baby needs...if that's just because my kid is the most adorable child in Brooklyn, that's your problem, not mine.\n\nThis is the neighborhood restaurant I wish was a little bit more in my neighborhood, but I don't mind walking a little bit farther for. \n\n#Walter2020.", "author": "Peter D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-03-17", "description": "GREAT SPOT. It has that decor that never fails, the sort of classic, dark wood white tile, almost minimalist thing that some bars and restaurants have (i.e. The Smith). High marks on that end, can't go wrong.\n\nThe bathroom situation is bad. Only one. Always a wait.\n\nOur waiter was the nicest guy ever. Super personable, never intrusive.\n\nWe split the smoked trout, which was great with the onion and capers mixed in. And the eggs benedict (with smoked salmon) was awesome. The bread was perfect, soft yet crispy, easy to cut. The eggs were cooked perfectly, sort of well done so not too runny.\n\nThe blood mary wasn't too impressive, but what are you gonna do?", "author": "Fred A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-05-28", "description": "Love my neighborhood  spot! Went there yesterday for brunch!! Was welcomed as usual. All the love. Then my waitress told me she needed a minute to get me coffee because she was so busy. Never happened before. After that we were fine. Food was great! Then I was asked if I wanted to box my food while I was still picking at my fries. I said sure. Waitress took my plate as I was still eating. Thanks... box it. Thank you, followed by an aggressive would you like anything else. We asked for the check. She reached over our coffee to get the signed copy before we got up. Walter's you've done better than this. Please tell your staff not to make us feel like we have to leave. We only really had time to eat", "author": "M M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-12-18", "description": "Great service! Even though we made a reservation and had to wait, the host had excellent service. He asked us to sit by the bar while waiting - first round of drinks was on him and add on and get a little snack. We got the fried chicken. The fried chicken was decent - nothing crazy. The wait was kind of long, not going to lie but at least the host kept checking in on us and made sure we were accommodated. When we got to the table, we also got a platter of grilled mushroom and savory egg custard. The egg custard was amazing, highly recommended it! We also got the Japanese style chicken cutlet, packed with intense flavor, juicy and crunchy - highly recommend it! \n\nThis place is pretty cool, the actual restaurant was behind the door at the back, felt like I entered a speakeasy concept. Super comfy and cozy!", "author": "Joey R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-05", "description": "Really liked Walter's! Went in for brunch and sat at the bar. The bar tender was perfect. He conversed with us just the right amount and was quick in getting orders in and getting the food/drinks out. I had the meatball sub and it was delicious. It is a bit messy but that's what you sign up. My gf had the shaved Brussels sprouts and kale, and loved it. The place is great for vegetarians. I would be remiss not to say that the bar was great. We only had beer but the bartender looked very capable mixing some nice looking brunch cocktails. I also really liked the old time vibe to the place. The white brick and fans really create a relaxing, laid back atmosphere for a quiet Sunday lunch.", "author": "Aditya R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-19", "description": "Great place for brunch! It's tiny so you'll probably have to wait for a table, but it worth it! The service is really good and the food too, they even give you some free muffins for start, and unlimited coffee refill. Huevos rancheros were very good.", "author": "Julia S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-01-22", "description": "We stopped by for brunch due to the 4 stars ratings on Yelp. The wait was 10-15 mins for weekend brunch after 1pm. Perhaps it was the cold weather hence not a lot of people were out and about. \n\nThe cafe was packed with hipsters and a few young families - relaxed vibes. We like the big windows which brought in a lot of light. The food was a big disappointment. We got the eggs with sausage and toast; the toast was burned and the edges of the eggs were also burnt (you can see the photos). Furthermore my frittata was a sad small piece of pie and a glob of hash brown. Not visually appealing or appetizing to say the least. Suffice to say, we were surprised this cafe had such a high ratings considering the food was bland and mediocre. The burger and fries were the only highlight from this experience.", "author": "Vivian L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-28", "description": "Came here for dinner with my wife on a weekday. The restaurant initially was a bit quiet however after 7 the restaurant was packed. Happy hour deal before 7, include house cocktail for $7 and half of raw bar. The house cocktail was gin based and awesome. We had the octopus appetizer which was surprisingly good, poached and grilled cooked perfectly, not chewy at all and super tasty. We had fried chicken and French dip for entrees. Fried chicken was our favorite with hot honey dipping sauce. Our server was super attentive and professional. Overall had an amazing time and will be coming back.", "author": "Robby A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-12-11", "description": "Perfect spot for weekend brunch and catching up with old friends. Located right on the corner of Fort Greene Park, you can drop by the farmers market or go for a stroll afterwards. It is small restaurant with a few booths and room to sit at the bar. They take reservations for dinner only, but we didn't have to wait long for a booth around 11:30 on a Saturday. The booths area actually pretty spacious so it feels comfortable and not crowded, despite the restaurant being so small. \n\nMenu for brunch is pretty standard, nothing too unique. The serve you yummy mini muffins to start. I tried a spinach and goat cheese omelette. It was good, but not extraordinary, other than the huge amount of spinach it was filled with. Definitely the most spinach I've ever had on an omelette, it was almost too dense. \n\nBesides the atmosphere and friendly service, other pluses were the large portions at a reasonable price. We all left stuffed.", "author": "Natalie H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-06", "description": "This place is a really nice local spot with a real relaxed non pretentious crowd. My friends and I sat at the bar, and the staff, was amazingly attentive\nand paired wine that matched our courses perfect!! We selected more of a tapas like selection of a few appetizers. Each one was better than the next. We had oysters on the half, from about 4 different places in the United States, Canada, and Europe. Fried green tomatoes, grilled Portuguese octopus which was to die for, and lastly deviled eggs which had a really spicy kick. Overall, I really enjoyed this place.", "author": "Jennifer N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-19", "description": "I really like this place from late night drinks to Sunday brunch--this place is versatile. It's a great location, easy to get to but also far enough away from Flatbush not to feel too hyped or rushed. It's a small place so it can feel a little cramped, but ultimately everyone is sweet and attentive. The food is a little pricey, but on par with the neighborhood and it's good quality.", "author": "Sarah B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-11-04", "description": "I can see the appeal of Walters and I'm sure on a different date we would have had a great brunch experience. However on this occasion the bar ran out of bloody Mary's at the start of the day and we dined at the counter with a bartender who did not want to be there. \n\nGiven the weird bar service we were getting I was hoping the food would be the star. Some of the brunch options were okay but I tried an underwhelming BLT which inspired this review.\n\nHopefully you have a better experience in this well placed neighborhood bar.", "author": "Laksen R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-18", "description": "I walk passed this place every day in my neighborhood and have always wanted to try it. The perfect location right next to fort Greene park. Finally was able to come here one night for dinner with a friend before catching a movie at Alamo drafthouse. We ordered the oysters and Cesar salads both very good and we also had some awesome cocktails. Definitely will be returning in the future!", "author": "Alexandra A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-05", "description": "It's still 5 stars solid. Full 5.  From service to food to atmosphere. If only we lived closer.", "author": "anthony r."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-17", "description": "Came here with my family (4 of us) on Friday for lunch.  We were seated right away.  The seating and placement of tables along the window are a little cramped but it wasn't uncomfortable for us since the restaurant was only half full.  \n\nI got the Walter's Burger - the portion is big! I liked how they put mayo and ketchup on the side for you.  The burger was good - wasn't out of the ordinary amazing or anything.  I asked for medium but it was well-done.  The fries were REALLY good.  They were almost as thin as shoe-string fries and were very crispy.  That was the highlight of my plate!", "author": "Candace H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-24", "description": "I came here with my friend for brunch this past weekend, as I had heard good things about it. We were able to get seated right away (we did come pretty early on a Sunday), but I can imagine there being a wait here as it's a pretty small restaurant with a handful of tables and a few seats at the bar. \n\nThe menu had a lot of delicious options on it, and we ultimately ended up ordering items that we both really enjoyed. The service was great and the restaurant itself had a very warm, causal and neighborhood vibe to it. I would definitely come back here again for brunch or to try out dinner.", "author": "Alexis S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-19", "description": "Hidden off to the side of the Walter's menu, in the \"bar snacks\" section alongside some good fried green tomatoes and better deviled eggs, are the best wings in NYC.  This is not hyperbole.  These aren't the standard gloppy sauced wings, they are instead covered in a spicy/salty dry rub, allowing them to remain perfectly crisp.  They usually come eight to a $10 order.  They're incredible, and yet they're easy to miss when looking over the menu.  Don't.  You'll regret it.\n\nThis isn't a knock on the rest of the menu, because it's generally excellent.  Basically everything we've tried has been good.  The cumin roasted carrots \u0026 ricotta is another excellent appetizer, and the fried chicken, the burger, and the bar steak are all great for entrees.  I also like the seafood stew on a cold night, but it's comparatively insubstantial for the price (the most expensive entree on an otherwise very well-priced menu).  The entrees aren't anything particularly new or interesting, but they're all well-executed with good ingredients.  \n\nThe cocktail list is extensive and full of old favorites, but be warned that they are extremely strong (one old-fashioned is plenty).  The beer list is decent but nothing special.  The service is friendly, but can be a bit slow if they're crowded (which is often, and it can be a tough reservation), and the seats by the door are freezing in the winter.  \n\nWalter's would be our neighborhood spot if we lived nearby...yet despite the distance we still make it here once a month or so.  To circle back to the original point, though:  ORDER THE WINGS.", "author": "David M."}], "servesCuisine": "American (New)", "priceRange": "$11-30", "name": "Walter’s", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "166 DeKalb Ave", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/L0O4V6Nl0qRG0YDX8HhcdA/ls.jpg", "@type": "Restaurant", "telephone": "+17184887800"}