{"aggregateRating": {"reviewCount": 485, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-05-18", "description": "Here's the thing: Walter's lacks a basic grasp of physics or mathematics. I refer herein to the concept of \"whole lobster,\" which their menu claims is what you'll get in their lobster buscotti or whatever it's called--you know, the dish that says you get a \"whole lobster\" baked with tomatoes or whatever with some something-or-other-ini pasta. \n\nSee, me, when I order a \"whole lobster,\" I expect a few things. Say, a matching set of claws. A matching set of eyeballs. Perhaps a pair of antennae. These things excite me in a dish, because their symmetry implies a baked creature in its entirety. \n\nWhen a dish arrives and it lacks two antennae, two eyes and two claws, my suspicions are provoked. My suspicions likewise sharpen when the dish lacks even one eyeball, one antennae, and absolutely zero little scrabbly subclaws--you know, those things you suck on like lobster pixie sticks.  \n\nI gesture the waitress over. I say, Is there a whole lobster in here? Is it, like, hidden somewhere? She says no, it's a half lobster. I say, O. Well, it says whole lobster in the menu. She looks a little lost and asks me if I don't want it. As if it's perfectly acceptable to purvey culinary fractions.  \n\nI don't  bother to tell her that it's less than a half lobster, given the lack of eye, antenna or pixie sticks. It's more like the lobster you get as a 99 percenter after the 1% has taken its share. It's meager, is what I'm saying. \n\nI returned it and got the catfish. It was OK. Just OK. Not \"oh boy there's there's fabulous new place in Brooklyn\" OK, just competent OK. \n\nThere's also the issue with the music. Now, I love the Black Keys. The Rolling Stones are fine. But there are times and places for this kind of music. Blasting it out of speakers over diners' heads when they're trying to enjoy an overpriced meal is, I would argue, not an appropriate context. \n\nThe salad was nice, though. The bibb salad with the lemon buttermilk dressing, radishes and bacon was really tasty. I wish I had it at the end of the meal instead of at the beginning, because then the meal's trajectory would have been up instead of down, inexorably down, into the land of miniscule lobster portions and acoustic bombast.", "author": "lisa v."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-08", "description": "Have been to brunch at Walter's twice now, and I am hankering to try their dinner!  \n\nThe omelettes are perfectly cooked!  Soft eggs with delicious fresh ingredients, and generous sides.  The smoked trout special was special and tasty, had a lovely sauce.  The fried chicken and waffles is very good, although the chicken was a little dry the time I ordered it.  I would definitely give it another try another time since people rave about this dish.\n\nFriendly, attentive service and great ambience.  Definitely prefer Walter's to some new places in the neighborhood that have serious attitude.", "author": "Dee S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-06", "description": "Lobster salad.  Yup.\nSpicy Bloody Mary.  Yup.\nFabulous brunch atmosphere.  Yup.\nFried chicken outstanding too!!!  mmmmm.\nDefinitely going back.", "author": "Bianca R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-10", "description": "Went twice in the last few months. No reservations on Saturday nights. They were able to seat us with minimal wait time, both times.  The hostess and waitress were lovely. Top notch.", "author": "Michael V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-24", "description": "A sweet fort greene spot. Came for dinner around Christmas time, so the place was adorned nicely. Very cozy, love the space. So much that I was thinking it would make a great apartment. \n\nAs for the food, everyone got something different. I opted for the roast chicken with roast veggies and mashed potatoes, which was prepared perfectly. My husband ordered the fried chicken that came with a maple mustard dipping sauce and mashed potatoes-fantastic! I stole half of his off his plate. The dipping sauce was great and the fried chicken was moist on the inside and perfectly crunchy on the outside, without tasting oily or fatty. Will be going back soon to get the friend chicken for myself!", "author": "Sara K."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-05-05", "description": "24 clams I threw down\nfor a fisherman's stew. \nT'was chock full of onions, garlic, \u0026 tomatoes - that's true. \nThough I don't want to whine or to kvetch or to rant,\nthe fish in this stew, at best? It was scant.", "author": "Dan C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-10-23", "description": "They changed the once-great brunch menu! My two favorites, the breakfast sandwich and shakshuka, are now gone. French toast is different now, as well. Overall it feels like a change for the worse, unfortunately.", "author": "Jason T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-24", "description": "My wife and I stumbled in here a few Sunday's back and were able to grab 2 stools at the bar without wait.  What a cool little spot with a nice menu and good prices.\n\nMy wife had a tomato bake with some eggs on top which was served in a little bowl straight outta the oven and was quite good.  I had the smoked salmon eggs benedict and it was good.  To be honest the benedict wasn't that spectacular, just average, but the drinks were so good, the atmosphere and decor so nice and the price right so it gets a 4* review from me.", "author": "Niko P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-02", "description": "Met a friend here for dinner. First timer but the menu drew me in so I was looking forward to trying it out. Friendly service. Dimly lit and cozy, nice place for meeting friends or a date. I had the highly recommended fried chicken and mashed potatoes, which did not disappoint. I must have been really hungry because I wanted more but the portion size was sufficient. Also loved the spicy deviled eggs as an appetizer. And my Hemingway Daiquiri was a light, refreshing drink. Lastly, the music was great, I loved the mix of classic 70s and 80s jams. Will definitely be back, for more fried chicken and more.", "author": "Vonetta D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-06-05", "description": "Food was good, service was good. Kinda pricey and portion was kind of small. Decor was nice. Them $10 mimosas doe....", "author": "Wilson Z."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-03", "description": "Great place for a meal. The service and food are fantastic and the atmosphere is very endearing.   Prices aren't too bad for what you get.", "author": "Christina N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-30", "description": "This place is pretty much on par with its Williamsburg location. The bartender was very friendly and offered tastes of the bourbon collection we were admiring while we waited for our friends at the bar. We declined because we were already enjoying what is arguably the most delicious Bloody Mary around - a perfect combination of spice and horseradish.\n\nThe brunch menu offers a nice selection of salty and sweet foods, and having tried the chicken and waffles in Williamsburg I was very tempted to get the same here, but decided on the huevos rancheros. If I could do it over, I would have just gone with the chicken and waffles - the huevos rancheros were quite bland, and I was expecting much more. On the bright side, they really do know how cook an egg.\n\nMy husband got the tuna melt special, which was really really freaking good. So, scratch my chicken and waffles, if I could do it over, I would have gotten the tuna melt. The fries - THE FRIES! So crispy and delicious. Maybe with a side of chicken and waffles... Mmm louisiana-style hot sauce.\n\nOur server was very pleasant and the starter mini muffins are addicting, providing an all around Walter-riffic experience. (Yeah, I'm lame). I really need to return for the raw bar.", "author": "Tanya T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-02-21", "description": "Walters is a fine little spot. The restaurant itself has a nice neighborhood vibe to it. The selection of wines by the glass isn't great but offset by a a small number of well selected beers, arguably a better pairing for the food. Our table had a curry soup, octopus and crispy pork terrine as starters. The octopus was really tender, the terrine decent. Fried chicken and beef dip were the selected mains. The fried chicken was pretty good; very crisp and moist. It wasn't the best ever but still pretty good. The beef dip was a nice high quality sandwich.\n\nWalters is somewhere between 3 and 4 stars, with 4 stars supported by reasonable prices. I will review on the basis of the food and beverage, so three stars; still good enough to return and recommend.", "author": "Rob B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-03", "description": "Walter's is located in the spot that was vacated by Rice way back when I used to live in Ft. Greene and get Jack's stir-brewed coffee on my way to the Q train. I'd almost be nostalgic if that walk wasn't so long. \n\nAnyway, I was happy to see a classy joint in it's stead. And classy certainly describes nearly everything about Walters.  For real. The bar staff wear bow ties and all look like they visited the barbershop before coming to work. \n\nI'm not gonna lie, I barely skimmed the menu because the couple sitting next to us at the bar ordered a smorgasbord of seafood that distracted me. We got shrimp cocktail, 1/2 chilled lobster and three types of oysters on the half shell (every time I read this on a menu I sing the Ninja Turtles theme song to myself). Even though cracking lobster isn't my strong suit, my dinner companion had it covered. Turns out she brings more to the table than great hair. \n\nThe rundown: there's a good feel to the place, it's in a great location across from Ft. Greene park, and you'll eat yummy food. Pretty expensive... actually, really expensive. Somehow I was okay with that.", "author": "Lachelle F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-11", "description": "Nice neighborhood spot, though not a place I would make a special trip to. \n\nI tried the bibb salad, spicy fisherman's stew, and fried fish special (can't remember what kind of fish!). \n\nBibb salad was yummy, although a bit heavy handed with the dressing. I also wish the bacon was more on the cirspy side to add more texture, but maybe I felt that way because there was a bit too much dressing. My dining buddy had it a different night and said the dressing then was just right.\n\nFisherman's stew - Delicoius bowl to satiate my appetite especially on a chilly night! I love that there were chunks of tomatoes stewed right in and I also love the spicy kick. I also enjoyed that it is served in a large bowl with a hunk of toasty bread on top - the perfect companion to dip and scoop! MMM I will be craving this in the winter time.\n\nFried fish special - I only had two bites of this, but I recall the fish was done just right and the flavor / texture a nice complement.", "author": "Jessica T."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-03-02", "description": "Yet another haven for the pretentious newbies moving into the neighborhood...meh.  \n\nThat said, food was good though way overpriced.  I think the fisherman stew is actually much less substantive than it sounds, especially at a whopping $23...I mean, it really is just soup.  Another example of exuberant pricing---the crabcake. Just ONE, small lonely crabcake for $14 (though good). \n\nI am not prepared to extoll the virtues of this place just b/c its from the same ppl who brought us Marlow \u0026 Sons and signals Ft. Greene's descent--oh, I mean steady progress towards becoming the new Park Slope or BK Heights (God forbid).  Call me crazy, but I expect to leave a restaurant satiated (which isn't hard at my size), rather than planning my next meal for night.  This place just doesn't offer much in the way of value.", "author": "Peace L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-14", "description": "This was the first restaurant I visited when moving to the neighborhood, and the staff was so kind in giving a gift card after messing up the bill. Fine oyster selection and cocktails, plus the main dishes are quite good.", "author": "Andy C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-19", "description": "Great brunch spot! Great food. Good atmosphere. Good service. Huevos Rancheros is thee dish to get! The only thing is they need to up their drink menu!", "author": "Eirene Joy C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-17", "description": "The place is very lovely, right across the park with large window. The servers were very helpful, and the food was great and reasonably priced. We had 2 appetizer, main dish for each, a bottle of wine and a dessert to share, the total bill was about $ 45 each. I would love to go back.\n\nWe (group of 4) went there for dinner on Saturday around 6 pm, and it was already busy and we were told it would be 40 minutes wait. We left name and walked around, it was totally fine.", "author": "Hiroko N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-05-01", "description": "I have been going to this place so much lately with my boyfriend because he and we have been $$$$ these days. My favs are the oysters, the ceviche, the lobster salad, many more and the bread pudding. The cocktails are also very good. The staff is so friendly and treat you like kings!! MUST GO\n\nThis is NOT  A PLACE TO GO IF YOU EXPECT TO GET 15 CRAPCAKES WHEN YOU ORDER THE_CRABCAKE. Or like a 23 dollar fishermen stew soup and expect to get punch-bowl-sized soup -- instead u should maybe try chez LoLa, and theres plenty of Chinese (eg. Kum Kau, Yummy Yummy Chinese Restaurant, etc.) where you can get Sea Foods for wan doller.", "author": "Valeriana S."}], "servesCuisine": "American (New)", "priceRange": "$11-30", "name": "Walter’s", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "166 DeKalb Ave", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/L0O4V6Nl0qRG0YDX8HhcdA/ls.jpg", "@type": "Restaurant", "telephone": "+17184887800"}