{"aggregateRating": {"reviewCount": 485, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-18", "description": "Loved Walters! In the mood for a great low-key date place in the heart of Fort Greene Brooklyn, then grab a seat at the bar, enjoy some great cocktails and service, and have access to an outstanding food menu. But  it's also perfect for a dinner date with great, lively ambiance, service, and exceptional food! For appetizers, we enjoyed the lobster tail and shrimp, both fresh and delicious. My lamb shank was simply, oh-so devine! Our servers checked on us frequently. The price tag was high but worth it for an occasional dinner treat to self!", "author": "Fam L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-05-29", "description": "Huevos Rancheros.. reasonable.. Nothing mind blowing. Served fairly dry I think the salsa was missing.. when they bought me out a side of salsa it made the meal sing. The burger looks amazing.. I'll try that next time.", "author": "Steve A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-12", "description": "Very good bar, excellent raw bar, great for brunch, lunch, and dinner. Celebrated my husband's birthday there and we had a ball. Desserts are also fantastic. Highly recommend it.", "author": "Anna R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-10-23", "description": "First of, this place is super loud \u0026 noisy so it's not the best place to go with a group for conversation. The drinks were ok, overly strong which isn't necessarily a bad thing, but nothing unique or tasty about them. The food was extremely oily and WAY too salty! Excess use of oil is not the sign of a good chef, quite the opposite. The blackened catfish was so salty and greasy it was almost inedible. The fish stew was sent back- due to the fact that there were 2 shrimp, 3 mussels, and the rest all broth in this dish! For 24$, I was shocked that they even sent it out like this. When I spoke to the manager about the stew, she asked if I wanted something else, instead of correcting the dish I wanted. She should have taken the dish back and added adequate fish to it for the price point, I would have been happy. The waitress was also unattentive. In summary, it was mediocre and low quality service and cooking skill, and an attitude as if they're top shelf.", "author": "Michelle T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-30", "description": "OK so the pan seared octopus is amazing best i have ever had. The pork chop was cooked to perfection and huge, the mashed potatoes to die for BUT the spicy seafood stew sadly only had 3 shrimp and 2 musicales and a bunch of tomato's, it was a bit pricey for the portion however everything else was just amazing.", "author": "Ilona O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-13", "description": "What a great find. Came in for brunch on a Saturday around 11am. We didn't have to wait for a table (of 2). Staff was friendly and quick (without pushing us along). Food was terrific, great menu. Really cool vibe of the restaurant. The also accepted credit cards / AMEX. Haven't been at night yet but will absolutely come back to check it out.", "author": "Craig C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-04", "description": "This place is so, great. Some colleges and I went there this past weekend. We had the choice of many oysters from the Atlantic, and also the shrimp cocktail for starters. The wine was an excellent choice for start. I had the fried chicken and mashed potatoes. The gravy was off the hook. Excellent service from the staff of waiters. We were never rushed, and had the cobbler which probably had a little too much bread but was really really good. Was stuffed by the time I left and went on to my show at the bam. This place is well managed and the staff were so helpful. Thank you for the great experience .", "author": "Benjamin W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-17", "description": "amazing, amazing, amazing!  A small, bright place that does everything right.  The service is fabulous, the food is delicious and the location is perfect.  I came for a Sunday brunch and ordered the fried chicken and waffles and was super impressed.  I also tried a sisterpoint oyster-extremely fresh, absolute perfection.  Right across the street from Fort Greene Park.", "author": "Anny C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-12", "description": "First time here \u0026 can't wait to return! Dinner was delish! Duck Buns \u0026 Octopus starter--Yum!  Steak was tasty \u0026 fries were pure perfection. Brussel sprout side order is divine and Bow tie pasta w/shrimp \u0026 pesto sauce was really good.  Blueberry cobbler was a nice way to end a great night of food with great friends.  Getting hungry just typing this. Can't wait to try other items on the menu.", "author": "Thomasene B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-02-20", "description": "HELL NO!\n\nI understand that you want to cash as many people as possible, but consider opening up a bigger restaurant instead of pushing people out just because they already ate...\nHere:\n5 of us got in. Big table in the back, wine (definitely not so special) and overpriced dinner (portions are so small for these prices!). \nFood tastes ok, but portions are really small and there are many other places around the neighborhood where you can eat much better for same money.\nWe had drinks, then appetizers and main courses. After dinner our waitress came up and asked if we want more drinks. With our glasses still half full, we said thanks we're good for now. Then some tall dude showed up and informed us that we need to move to the bar because they need our table. \nMy friend said \"but buddy, there's no room for 5 people at the bar\" \nAnd he's like \"you'll make it, we really need this table\"\nWe paid, left, and I am never going back. Thank you.", "author": "Michael W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-01", "description": "I went back again on Saturday, had to wait a little longer because the fair weather drew more people out of their winter caves.  Five stars for the Pimm's Cup cocktail (and loved watching the bartender do his thing) and for the grilled octopus.  Loved the wine I had with the steak.  The steak was good, solid, but not my all time favorite bar steak--a little thin.  It's no Raoul's.  But I'd order it again.  The fries were good, the arugula underneath tasty if not swimming a bit in it's dressing.  Service is excellent, very professional.", "author": "petranna j."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-09-07", "description": "OK, I like the space and general look, but the food is mostly meh and the prices are wowzers!  I've been here a few times since the first week when you opened the Ft. Greene location. No drink specials (EVERYWHERE in this neighborhood has drink specials and it wouldn't hurt when you're empty during the week) and basically just generally bland, overpriced food.  I live soo close to you and REALLY, REALLY want to like you and there are a few dishes I enjoy, but at these prices, I just can't.", "author": "Mimi D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-16", "description": "Delicious food, great service, delicious cocktails (and a YUM bloody mary!), delicious brunch, delicious oysters, and reasonably priced. Will definitely be eating here many many times. :)", "author": "Amber E."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-03-30", "description": "Prior to going, I had read about this place and had been optimistic...and then I walked through the door. \n\nMy husband and I were greeted by none of the three employees we encountered and walked slowly to the bar hoping someone would acknowledge us and direct us towards the sweet little two seater by the window but, alas, the bar it was. \nTerrible, and unaware service. Extremely disappointing food and a bartender who didn't know his ass from his elbow seemed to be the norm. If the effort he put into flirting with the hags at the end of bar was put into the old fashioned, perhaps it would have included the bitters soaked sugar cube and tasted slightly like a cocktail worthy of payment. \nApparently steamed duck buns, at Walters, translates to some odd calamity of duck and mayonnaise mixed together on a cold sad bun. We were starving and I refused to allow us to eat it on sheer principle of not consuming shit food dressed in a fancy setting. And we won't discuss the fried Brussels sprouts that were unceremoniously dumped on top of a bowl of oily vinegar. \n\nI could not have exited hastily enough,  and was further perturbed by the fact that the bartender was still trying to score at the end of the bar while we were trying to pay.\n\nThank you Walter's, for your sad food and uncaring servers. At least I have one more place to never want to go to again.", "author": "Amy F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-05", "description": "1930s style speakeasy....very hipster spartan design..to a retro hip hop soundtrack...dark and atmospheric...wait staff were friendly and warm...made menus suggestions....I had a very tasty burger with nicely done fries...and was recommended a German beer that would compete the meal....excellent...the key lime pie was a great dessert...perfect crust and the right balance between tartness and sweetness... Walters, a cool little corner in Fort Green on Dekalb...I'll return next week no doubt.", "author": "greg j."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-07", "description": "Solid from the moment we arrived We made a reservation and were seated right on time.  Great dinner!  We had a variety of dishes.  The ceviche and octopus apps were my favorites.  The only thing I take issue with is not really a problem at all...more of a disclosure. The fried chicken was very much shake n' bake like.  Flavor was great, it was moist and all but....  Great staff, solid drinks.  I'll be back for sure.", "author": "Jonathan A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-12-04", "description": "Walter's in Fort Greene is a must visit and visit again and again and again. \n\nSince they just opened, we were a little nervous about what to expect but took a chance and popped in around 7PM on Saturday.  There was a bit of a wait, which is to be expected around prime time, so we left our name and number with the host and went a block up to grab a drink.  She called exactly as promised and we were promptly seated upon arrival. \n\nEverything about the meal, the service, the decor and ambiance was wonderful from start to finish.  Our starters included shrimp cocktail (love the cocktail sauce) and the ceviche with pico de gallo, lime, lemon and homemade corn crisps... we shared the bibb salad with bacon (nice addition!), chives, radishes and a lemon buttermilk dressing... and wrapped up with the bar steak with chimichurri and fried chicken, both cooked to perfection. \n\nThe nicest touch was when the owner, Danny Minch, came by to introduce himself and see if we were enjoying our meal.  He thanked us sincerely for waiting to be seated, for which really there was no need (though appreciated). Danny, we will definitely be back. Welcome to the neighborhood!", "author": "Jennifer F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-06", "description": "Saturday night was my first time at Walter's and I really didn't know what to expect.  I've passed here a bunch of times but was never inclined to try it out.  But it was my Mom's birthday and one of my sisters previously tried it out and loved it.  Needless to say, I was pleasantly surprised.  The host was super friendly and seated our party right away (about 6 people) even though we were still waiting for two people.  Our server was equally as friendly and was great about answering all our questions about the menu.\nA few family members had oysters (YUCK...not my thing) but could not stop raving about them.  We also shared an order of the artichoke dip which was divine.  We wiped that bowl clean!!  The toast points were wonderfully crispy!  \nFor my entree, I decided to order the steak and I was so happy I did.  OMG that chimichurri sauce!! WOW!!! There was an additional sauce served but I can't remember it but it was just as delicious.  That steak was so delicious and moist.  I would absolutely have it again.  \nAs far as cocktails went, everyone had a little bit of everything: beer, wine, house specials and there were no complaints.  I ordered Walter's Punch which is their version of a rum punch.  It was strong and smooth not overpowering at all.  YUMMY!\nWe didn't have dessert since we had a birthday cake waiting at home for Mom but overall it was a great night.  Mom was happy and so was my belly :-)", "author": "Melissa C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-20", "description": "I've been here about 5 or 6 times since my last review and I have always been pleased, bordering on orgasmic.  I just love it--the food couldn't be better, the service couldn't be better, the atmosphere couldn't be better.\n\nSome recommendations:\n\n1) talk to your server about the oyster selections in detail--I had some that I never would have tried (from Virginia!) and they were sensational\n2) maybe you think you don't want the meatballs, but YOU DO\n3) if you are hungry, the fried chicken is huge and every bite is heavenly\n4) the escarole salad is still among my favorite salads on the planet\n5) the french fries may only be french fries but they are outstanding\n6) yes, deviled eggs!\n7) sazerac!\n\nI suggest just accepting the fact that you're not going to get a 9pm table and come earlier or later.  The last few times I've been here it's been around 11:45 when we arrived (on a Friday or Saturday) and we got seated within 15 minutes (groups of 2 or 3).  Once, they wanted to give our table to some other folks, so they bought us a round in exchange for moving to the bar--yes!  \n\nCount me among Walter's' biggest fans.", "author": "E L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-25", "description": "I love this place. It was actually our last dinner before my wife gave birth. We've been a few times and mostly loved it. The food is generally very good, and the service attentive and warm. The fried chicken for brunch is definitely one of the better fried chicken plates in the City, but 15 bucks for a tiny leg and breast is just short of extortionate. The flavour saved it, but you'll certainly need a side dish. The benedict is, well, a benedict. From the dinner menu, the devilled egg is well executed and the duck buns are phenomenal!! Smoked trout is deliciously smoky and flavourful, but the toast is tooth crackingly hard! Love the blackened catfish, the fish was nicely charred with a smoky, caramelized flavour. Our last evening, our server got me excited about a grass fed New York strip with marrow butter, which I ordered. She came back a few moments later to tell me they no longer had it :(, so  got the bar steak. I wasn't that enamoured with it tbh, I prefer a thicker cut of meat.\n\nAs with most NY restaurants, avoid at peak times and you'll have a great experience. We're looking forward to getting back there soon!!", "author": "Damien G."}], "servesCuisine": "American (New)", "priceRange": "$11-30", "name": "Walter’s", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "166 DeKalb Ave", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/L0O4V6Nl0qRG0YDX8HhcdA/ls.jpg", "@type": "Restaurant", "telephone": "+17184887800"}