{"aggregateRating": {"reviewCount": 61, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-28", "description": "I had the honey chili pork plate at Afropunk last night and it was amazing! I was considering getting the chicken but someone in line recommended the pork-best decision ever! The balance of the sweet and slightly spicy flavor of the pork belly on the bed of jasmine rice was everything. A sixth star for top chef finalist, Lisa serving it up! Can you come to the bay though?!", "author": "Temi A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-05-14", "description": "I order the pork belly, mango salad, and jasmine rice ($10) the staff were very friendly in the food truck on Hanover in the FiDi. Unfortunately I had to give them 3 stars because while the pork belly and mango salad were tasty the jasmine rice was a disappointment. I eat jasmine rice on a regular since this is the rice I cook at home so I will admit my expectations were a little high. The jasmine rice served to me was what we Latinos call \"con-con\" aka the bottom of the rice pot where the rice is crispy on the verge of burnt. While I do know many ppl who love this kind of rice, I am not one of them. Perhaps it's because I ordered close to 2pm, though I do not think that is an excuse for con-con to be served by any food establishment unless requested. I would have much rather have had 2 servings of mango salad in replacement of the rice if it was running low.", "author": "Lissette C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-22", "description": "We got one beef and one chicken. One of the orders had the mango slaw and the other had the papaya. The beef was the hit. \n\nThere was no one in line when I ordered, but a lot of people were waiting for food. It's worth the wait though.", "author": "Bee C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-04", "description": "Beware, you might get addicted.\n\nI usually go for the Honey Chili Pork and Bean Sprout Salad. The combination of sweet and spicy flavors and the crispy pork is absolutely perfect. Every time I place an order I get kind of sad that it doesn't look like much, but by the time I'm finished eating it I'm happily stuffed. I've also had the Sriracha honey fries and coconut chili rice cakes, and let's just say it's probably a good thing that they don't always have those because I'd definitely be about 15lbs heavier if they did.\n\nThe truck used to come by our office every Friday which I'm pretty sure led to a full on addiction. Once they stopped I actually created a Wun Wun account to have someone pick it up from the South Street Seaport and deliver it to my office for me.", "author": "Kim M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-27", "description": "I really, really enjoyed my meal here. From reading reviews, I knew the food was going to be good but I was surprised at how much flavor was packed into everything. I ordered the honey chili pork with the green mango salad and a fried egg on top. I've never had jicama before I was glad that it was featured on the salad because I loved the crunch and it mellowed out the spice which made for a great contrast. I knew that going with the fried egg on top was a great choice because fried egg makes everything better and it really brought the flavors of the pork and the chili together. I was also pleasantly surprised at how much pork belly is given. They platter makes for a very filling lunch. \n\nWhat really surprised me about this truck was how well everything was made. They just had so many different textures and flavor profiles happening at once and I loved that I was able to get a great tasting dish from a truck. The price is a little higher than average food trucks but I think it's completely worth it because you get a good amount of food and a great tasting dish.", "author": "Jess P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-04-05", "description": "I guess this place is a departure from traditional Thai or Vietnamese restaurants. It doesn't scream Food Network culinary excellence by any means. It is what it is; food from a truck.\n\nThe meat I got was kind of salty, but it was ok. I hoped the bean sprouts would drown out the saltiness. They tried their best.", "author": "Mike C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-15", "description": "This is one of my favorite meals ever. I absolutely love the flavor of the tofu and really enjoy the delicious mango salad. I get this weekly without fail. I don't get very adventurous with my food usually, but the flavors are so spot on that I immediately became obsessed with first bite. It's great to have a delicious vegetarian lunch option like this. I rave about this place to my entire office and cannot recommend it highly enough!", "author": "Jennifer P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-05-12", "description": "Perhaps I shouldn't have expected authentic flavors.\n\nI had the chicken and green mango salad, the chicken was served room (truck?) temperature and the sauce tasted like Asian food for Americans (overly sweet, ketchup like).  Their website has a quote from the owner/chef re: the sweet chili sauce \"I've been known to dip french fries in it too!\"  So seems my ketchup comparison isn't far off...\n\nThe salad was inedible...tasted like it was soaked in lemon lime soda.\n\nOverall: left me disappointed and hungry.", "author": "J M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-29", "description": "I had the honey chili pork belly with cilantro and sriracha. Green mango salad with jicama, chili salt, and nuoccham (sweet, sour, salty, spicy Vietnamese sauce).  \n\nIt combined so many of my favorite things (pork belly, sriracha, crispiness) with some things I hadn't ever heard of or hadn't recently had. Everything was amazingly delish, and I have since dreamed about the pork belly (no lie).\n\nFull review with pics: http://bit.ly/SweetChili", "author": "Alex L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-20", "description": "WHOAH!....\n\nI was so excited to leave a review - and when I didn't find them on yelp - I emailed them IMMEDIATELY....... and within an hour - here they are.... love it.\n\nI don't hand out 5 star food truck reviews often - but I guess when you eat from Chef Lisa -  who was also a finalist in Top Chef - Chicago -  5 stars comes easily.\n\nI cannot tell you how amazing this meal was...\n\n$9 bucks for some KICK ASS BEEF  - that was marinated so well - and it was sooooo tender.... Lisa was moving batches from one area to another - and I had to yell - WHAT IS THAT ?! ---------I WANT THAT!... The smells permeating from the truck were just so freaking good.... I couldn't wait to order.........She admitted that she does this regularly to reel us in......lol......and boy does it work.....\n\n--- Kick ass beef marinated in Thai basil \u0026 coriander - with some Siracha on top\n--- One scoop of  Jasmine white rice..........*Upon further investigation - I need one more scoop\n----I went with Green Mango Salad *amazing... cool and crisp heat galore\n\nMy mouth and tongue were tingling for about 25 minutes after the meal....\nAnd that my friends... is a very good thing..lets call it the \"after glow\" for spice foodies.\n\nAdd in the loyalty card which came with 2 stamps for being apart of the first 1000 people.... and some sweet Thai candy.... they got me.. they got me good.\n\nCant wait to see Lisa next week..\nMy new best friend..\n\nI'm SOLD.", "author": "Alysha R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-11", "description": "One of the nicest food trucks in town--I mean personality-wise of the people who work in there.  They were very pleasant, asking me how spicy I like my beef and all hopping to work on my order.\n\n-Heavenly Beef (coriander marinated sirloin beef with sriracha and thai basil): wow it's incredibly juicy and so far from being tough. The sauce is quite spicy with the sriracha but there is certainly a sweetness to it.  I also taste a bit of a green taste to it--like it was dipped in a garden (surely from the basil).  I love that they cook it when you order instead of having it pre-cooked. \n\n-Green Mango Salad (jicama, chili salt, nuoc cham): also very delicious.  I really like jicama (it's nice and crunch).  It doesn't taste much like mango but just very spicy and tangy.  \n\n-Jasmine Rice: it's perfectly warm and sticky--just how I like it\n\nFINAL VERDICT: They have good and high quality food so I would certainly return.", "author": "Alexandra K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-25", "description": "sweet chili truck are pretty new in the food trucks business but it is very good\u0026 must try if you craving asian food!\n\ntruck stop by at LENT space near my apartment on Varick st. and after check their website i decided to try it.\n\nyou can get 1 food item with choice of salad and one scoop of rice @ 9$\nwhat i like about it is that it's fill you up unlike taco or dumpling trucks.\n9$ bucks got you the meal! \n\nso far i've tried beef ,pork and chicken - i would recommended the beef but honestly everything is pretty much really tasty~~ \nthe salad both papaya and mango salad are goes really well with the proteins.\n\nthe coconut candy 3$ is pretty sweet- it's a coconut shreaded in caramel\ni would suggest to put the stick into coconut candy cos it's a lil bit difficult to eat.\n\ni believed they will be on corner of varick st\u0026 canal st. every tuesday and friday from11-3pm", "author": "Em K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-09", "description": "So I tried sweet chilli food truck for the 1st time, Tofu for the second yesterday and it was so good that I thought about it today lol. I ordered the silken miso tofu ( I probably got the name jumbled) with the mango salad and held off on the rice since I'm not eating bread, rice or pasta and I was full and my taste buds were fulfilled. Will eat there again.", "author": "Ellie M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-16", "description": "This is by far my favorite truck that stops at the DUMBO food truck lot. Why? Because Chef Lisa Fernandez's food is consistently awesome! My favorites are the tofu with the bean sprout salad. Sometimes, I switch it up and get pork belly, which is crisp and flavorful. The chicken and the beef are also good, but no matter what, you need a fried egg on top. Seriously. It's so good, you have to just try it.", "author": "Vania M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-21", "description": "Good thing I tried the heavenly beef before the sweet chili chicken, because if it had been the reverse I probably would not have sought this place out a second time. I'm keeping the four star review up, but sadly the chicken dish pushes Sweet Chili down to a 3.5. \n\nIt's a shame, because the flavors of the meat are definitely on point:  A little heat, a little sweet, and a ton of yum. But the meat cookery was a tad inconsistent in the beef dish, and just plain all over the place in the chicken dish. The chicken was also super fatty in spots and I kept getting random hits of salt (which may have come from the mango salad, but I can't be sure). \n\nI've now tried both the papaya and mango salad and neither is particularly inspiring, though the papaya is decidedly better--the addition of the peanuts gives it that extra texture kick and saves it from the sogginess problem plaguing the mango mush.... \n\nI was excited for this to become a once a week go-to truck, but after my sad chicken experience, I may wait a bit before trying the tofu or pork belly or going for a beef repeat. Especially considering the $9 price tag for the relatively small food portions (compared to the rest of food truck land), I'm not in a rush to return.", "author": "Erica I."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-05-14", "description": "I ordered the Honey Chili Pork with the Bean Sprout salad, which came with jasmine rice. It was tasty and the flavor of the pork was akin to a spicier revamped version of General Tso's Chicken. Though the food was palatable and well-seasoned, the portions were small for the price. Summary: Tasty, but overpriced. If you're trying to impress someone with fusion food, this is certainly not the place. I suggest you keep on looking.", "author": "Kimberly W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-26", "description": "This food truck makes all the others weep because it kicks ass. Seriously, get food from here and be happy...", "author": "John D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-20", "description": "It's pretty good.  Nothing amazing.  I honestly came in with slightly high expectations since the owner was on top chef.  It's pretty simple Viet/Thai food.  I had the \"Heavenly Beef\", green papaya salad with a fried egg on top of the jasmine rice.  Everything was pretty flavorful although not as spicy  hot as I would have liked.  I would have liked the egg to be runnier but I guess it might have cooked some more in the trapped steam once the lid was closed since it was still a little runny.  Portion was just okay, I gotta say I wanted a bit more for the $11 I paid but this is the financial district after all.  I would try again.  Next time I'll ask them to make my egg extra runny and to make it spicier.", "author": "Ladislao B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-15", "description": "The pork, the pork, O...M...G...the pork. Can't speak for the beef or chicken option, as I'm absolutely addicted to this sweet and spicy pork. I HATE SPICY FOOD. I'm known for it. But I can not get enough of this pork even at $10 a plate. Don't care for srirracha...USUALLY, but mixed with cilantro with THIS HONEY CHILI PORK. It deserves accolades. It leaves my lips and gums pleasantly on fire and I'm cool with that. And any cart that draws Hey Arnold in chalk in front of them on the sidewalk has my heart. I can't recommend this stuff enough. With a tall glass of water on the side. So the cook was on Top Chef? Well this stuff certainly tastes like it. :) Thank you, for leading me into a fiery realm I've never gone before. This is how cart food is meant to be. I'm sitting here eating leftovers from yesterday, re-heated, and it still ROCKS.", "author": "Quandra T."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-09-23", "description": "I have to agree with most of the other folks that tried the caramel pork, the flavor was good, nice amount of spicy and sweet, and the sauce was delicious on the rice, but the pork itself was way too tough, it almost felt like they used thick cut bacon (had that smokiness as well) instead of fresh pork belly. Definitely need to work on the tenderness factor.\n\nThe bean sprout salad was awesome, but I wish they'd been more generous with it! It irks me when vendors are stingy on such a low cost item. Overall I'd probably go back to try the beef, but for $9 I was expecting a larger portion and better pork.", "author": "K B."}], "servesCuisine": "Thai", "priceRange": "Under $10", "name": "Sweet Chili", "address": {"addressLocality": "New York", "addressRegion": "NY", "streetAddress": "", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/jrLVsouUDy266d6FI8BM1w/ls.jpg", "@type": "Restaurant", "telephone": "+13476697385"}