{"aggregateRating": {"reviewCount": 61, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-23", "description": "I tried the pork belly dish with mango slaw and rice today at the Tanger Outlets on Long Island... It was amazing, perfectly cooked.  Also had a Vietnamese iced coffee which added the perfect sweetness to balance to the dishes spice (which was not too spicy).  Overall a very well put together meal, quick and bargain priced.", "author": "Jeffrey R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-09-05", "description": "$14 WOW over priced the food is good but for $14 they need to double the portion. Very shocking to pay $14 for half a meal.", "author": "Robert N."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-07-07", "description": "Pretty decent stuff, but not enough quality OR quantity for $10.  Just finished my lunch and I feel pretty ripped off.", "author": "Peter A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-01", "description": "I've been eating Sweet Chili food since June 2013, and it's only been great!  I've tried everything on the menu!  Every time it has never missed.  I am a frequent buyer card member and I have earned multiple free meal rewards!  So glad they have a program that rewards their loyal customers!\n\nThe Chef is Lisa Fernandes and she was a Top Chef finalist in Season 4 Chicago.  Her food is so deliciously balanced!  Every bite of every platter has so much going on!  Spicy, sweet, tart, or nutty, and all with heat on the back end!\n\nI love that all her dishes can pair with any salad.  As a loyal frequenter, I love having options.  Every food truck has a signature dish, but this truck has a signature MENU!  You can combine any protein, with any salad to your tastes' desire.\n\nLet's start with the Heavenly Beef.  Richly marinated coriander beef finished with Thai basil!  It can be made spicy or non-spicy.  Personally, I love how it pairs up with sriracha sauce.  Sriracha can overpower, but this marinade marries itself so well to it.  Chef Lisa lets you pick how spicy you wan this protein to be.  I go for the triple XXX.  It's crazy spicy, but thank God for the Jasmine rice to balance out that salty, spicy eruption of flavor.\n\nAnd it gets better!!!  You can add a fried egg to any entree!!!  It all works!!  Genius!!!  A perfect, crispy egg white, oozy, yolky deliciousness that runs over the salad, rice and protein, to bring it all together.\n\nThe honey sriracha pork is their spiciest protein.  Crispy lardons of pork belly slathered in a honey sriracha sauce.  Need I say more?  Poured over rice, I enjoy the tart, green mango salad with this.  Nuoc Cham dressing is pretty awesome, I must say.  I also love the finishing chili salt on this salad.  Need to find this stuff for myself.\n\nThe Sweet Chili chicken is the medium spicy option.  Crispy thigh meat (Thank God, there's no white meat in this), with their signature Sweet Chili sauce.  I don't know what this stuff is, but it tastes awesome over my rice!  It's like a spicy chicken stew!  It goes great with any salad as well.\n\nLastly, there's the tofu.  As a meat lover, I never try to have this, but I shared some of my vegan friend's dish and it was by far the best tofu dish I've ever had.  (I don't know how much this is really saying...)  The miso glaze is very nice over the tofu, but I love the pickled peppers and eggplant accompaniment.  This tofu would make me Vegan.  As a Vegan, I would be glad to be a Vegan eating this for sure.\n\nIn regards to the salads, the bean sprout salad and green mango salad are home runs!  I have never had anyone make bean sprouts, sprout to life for me before but I love it!  It's spicy, herbalicious and citrusy.  I love the combination of mint, thai basil, and cilantro activated by the oranges in this salad.  It's crazy good.  I would buy this stuff by the jar if I could!  Per the green mango salad, see above.\n\nIf it wasn't for my peanut allergy, I would recommend the green papaya salad.   Sweet Chili was very nice in acknowledging my allergy and left the peanuts off. I even saw the salad guy switch gloves so as to make sure no peanut oil would find its way near my dish!   Pretty impressed by the professionalism exemplified by this little truck.  But, it tasted really good with my chicken dish.  I imagine the texture would have been even better had it had peanuts on it...\n\nThey offer great Vietnamese coffee.  I've never been to Vietnam, but this stuff is pretty potent.  I like how it's mixed with sweetened condensed milk.  \n\nI like this truck because this truck is for people who are genuine food enthusiasts!  The bar has been raised tremendously with this truck.  People who genuinely want a journey or experience, more than just a lunch hour.  People who want more than tacos!  People who are tired of mayonnaise on their food!  I am so sick of taco trucks.  Especially, the Korean taco trucks in NYC.   I'm talking to you Korilla and Kimchi Taco!  I'm Korean and your food makes me sick.  It's an insult to Korean people to call your food Korean.  You make me want to be Thai.  \n\nI think the pricing is fair because I have no idea where you can find an elevated pork belly or quality beef entree for $7 or $8 in Manhattan???  (It honestly blows my mind that people think this truck should compare itself to taco truck prices.  MEALS are being made here, people.  Have you ever wondered how cheap it is to make a taco??  Yet, I indulge in steak, pork belly, papaya or green mango salad as my options...  Perspective people, rather, proper perspective is needed here.  You can't compare apples to oranges, or in this case, tacos, to green mangoes!\n\nThese guys are fast too!  I've waited from 30 seconds to 2 minutes for an entree.  They are really considerate of people's time and are fully aware that they are a food truck serving people food outside.  Rain, cold, snow, or hot summer, they don't make you wait long at all.  THEY TAKE CARDS!  Score!", "author": "Greg J."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-06-18", "description": "Currently waiting for my food to be done and this is the longest I have ever waited for food truck food in my life. Has been 20 minutes and no sign that I might actually get something before my lunch break is over. \n\nThe truck seems crazily understaffed, with two women frantically cooking and taking orders while the 'cashier' sat calmly in the front of the truck, only taking payments every few minutes. Surely there is a better system that would ensure that people actually get their food before they have to get back to the office. I would have left a long time ago, but then I would have invested all this time and then end up with no lunch. I heard the food is good, but NOTHING can be worth this wait.\n\nUPDATE: got food and the 'silken' tofu is deep fried and dried out. Papaya salad is pretty decent. The wait combined with the tasteless tofu still gets this place a 1. Disappointing.", "author": "Anne P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-18", "description": "Caught this truck in soho this afternoon. Staff was nice and the wait wasn't long at all and the portion wasn't bad either. Only complaint is that the food was so overly spicy I couldn't really taste anything but spice. I may just be a whimp but I was expecting more new and interesting flavors and not molten lava. Might stop by again to try something else", "author": "Tiana B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-07-16", "description": "When I first read that a Top Chef finalist had opened a food truck in NYC on Midtown Lunch over a year ago, I was very excited to try it. Sadly, the trek to Brookfield Place wasn't worth it. I gave the truck another shot today at South Street Seaport, but my evaluation hasn't changed.\n\nBoth times, I ordered the Miso Glazed Silken Tofu. I opted for the Green Papaya Salad today (I don't remember what I had the first time). The tofu was tasty, but nothing out of this world, while the papaya salad was inferior to what I get at my neighborhood Thai restaurant. Portion size is small for the price, despite the healthy serving of rice.", "author": "Deepyaman D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-07-04", "description": "Wow, maybe we went on an off day, but this was definitely one of the worse food trucks I've tried.  \n\nMy friend read that Lisa's fave item was the spicy caramel belly, so she tried that and it was so chewy and tough that she had to spit out most pieces.  I tried a piece and it tasted good, but the texture was horrible.  The sweet chili chicken that I got was very good, but a tiny portion.\n\n...which brings me to my other issue - the price is $9 for a little container with jasmine rice, a protein, and a small bit of salad.  This is way overpriced, even for a food truck.  There are 3 drinks to choose from, but nothing else on the menu.\n\nThey give you a gummy candy with your meal though and that was my favorite part.  Not worth $9 though!", "author": "Phillip L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-08", "description": "I really enjoyed my chicken with papaya salad and rice from Sweet Chili.  The service was very friendly.  It says a lot about a food truck when they are the only one with a line on a day when the temps are in the single digits so close to the frozen Hudson.", "author": "Kerry F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-07", "description": "Holy crap, I just learned that the owner/operator is none other than Lisa Fernandes of Top Chef fame (Season 4 runner-up) !  She was the one who served up my meal and was so sweet! :)", "author": "Cece Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-20", "description": "The best!!!! I have been going to Sweet Chili at least once a week for the past year and sometimes travel over an hour to get to the truck because it is so amazing. The staff is friendly and caring and takes very good care of me even though I'm a vegan and very picky. The owner, Lisa, is the reason I started to love food. I literally crave the spicy tofu, ricecakes and brussel sprouts every single day. So happy Sweet Chili exists!", "author": "Rose R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-13", "description": "This truck kicks ass. They come to dumbo every Tuesday. I've had everything except the heavenly beef, but I have it on good authority that it too is something to look forward to. My favorite is the pork. Walks the line between spicy and sweet. These guys are awesome.", "author": "Will K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-07-23", "description": "Tried the chicken with jasmine rice and papaya salad today.  At $9 a meal...it's pretty expensive for a food truck.  The chicken was seasoned well but a bit chewy.  The Papaya salad was pretty basic...nothing too special.  I wasn't too impressed since I expected to get more food for $9.", "author": "Minto S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-20", "description": "Amazing new food truck that has been parked on Varick and Grand lately.  Their food is Thaietnamese, a mix of Vietnamese and Thai.  I had the Pork with papaya salad.  A perfect amount of spicy.  I can't wait to go back!!!", "author": "Lauren F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-07", "description": "I have two words for you... Sriracha Fries! To die for! And it only starts there. Everything I've had from this truck (and I've had most of the menu) is amaze-balls! It's a creative fusion of Thai and Vietnamese and Awesome. This is such an underrated spot AND it's run by a top chef finalist! C'mon people, get on this. You're missing out! Can't get enough", "author": "Andy C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-11-22", "description": "Dissapointed. Got a shrimp radish cake. It was served with an egg on top, the egg was almost black covered with frying greese. There was no shrimp in the container the cake dint taste like shrimp either. Also got a papaya salad, it was mediocre. I consider my $10 wasted.", "author": "Lisa L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-07-01", "description": "These guys used to be good. In fact when Lisa still ran the truck they were great. However, the service here is garbage and neither me nor any of my coworkers are going back here. They've lost the business of 15+ people because of their operational procedures. We waited for 45+ minutes to get our food. When I finally went up to get my food, which I saw sitting right next to the guy, he refused to give it to me stating that he must follow an order. He was sitting there for a good 5 mins without calling a name and the 3 people in front of me hasn't picked up their food yet. This was the reason why I couldn't get my food. THAT'S THE DUMBEST THING I'VE EVER HEARD! I am ready to eat my food. My food is ready to be eaten but I can't get it because the 3 people in front haven't picked up their food yet. What really pisses me off is that my food, all our food, has been sitting there for 45 mins because everything is pre-made! So by the time we finally got it, our lunch break was almost over and our food was cold. \n\nI am not going back there period. They need to get their shit together.", "author": "Andrew A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-29", "description": "I had the beef and green mango salad for lunch today, and it was pretty good. The beef had great flavor and texture, though the rice wasn't anything special, and I only chose the mango salad because I don't care for bean sprouts or cilantro. They lost a star for service (waited ten minutes when there wasn't even anyone else on line) and for portion size (for $10, I think the meal probably should've been about 10-20% larger). Looking through the pictures posted here, I definitely received less food in my meal than what other people seem to have received. It was probably a 3.5/5, but I'll round up for the beef.", "author": "Wylie W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-07", "description": "I eat here about once a week. The heavenly beef and pork are both excellent (the beef is juicy whereas the pork is more crispy, so differing flavours). However, the chicken is not good so would say definitely give that a miss.\n\nThe green mango salad is really interesting as well.. very non-salad like, but I like it. \n\nHighly recommend for a $9 lunch.", "author": "K K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-03-20", "description": "Update: Received a clarifying and apologetic email from the owner.\n\n[Short version: Terrible experience. Make sure the cashier guy doesn't scam you. Check your bank statement.\n\nLong version: I had food from elsewhere. I ran into my coworker, who had ordered Sweet Chili but needed to go to a meeting. I stood in for him and waited for his food on his behalf. He had told me that he had already paid. His name was called and I go up to the cashier up front. Cashier guy tries to charge me $12. I say my friend already paid. 2 minutes later after futzing with Square, he tries to charge me $11 (? okay), saying that he only paid $11 out of the $22 charge. Apparently my friend had ordered two meals. Don't know how he \"paid for only half of it,\" but ok. I'm charged $11. Otherwise I'm not able to bring back both meals. I bring to my friend after his meeting. He had paid $22. On the way back to complain, he sees on his bank statement he was charged $22 twice. We had collectively paid $53 (+ my friend's generous tip) for a $22 order. Cashier told him that his issue was a bank issue, because it shows up as one charge on their Square. But I was refunded my $11. No apology for the mistake.]", "author": "Ryan B."}], "servesCuisine": "Thai", "priceRange": "Under $10", "name": "Sweet Chili", "address": {"addressLocality": "New York", "addressRegion": "NY", "streetAddress": "", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/jrLVsouUDy266d6FI8BM1w/ls.jpg", "@type": "Restaurant", "telephone": "+13476697385"}