{"aggregateRating": {"reviewCount": 61, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-09", "description": "I think I'm in love with this food truck. They're at the DUMBO food truck lot Tuesdays and Fridays. Their portion sizes are ridiculous (note to self: slow down while eating), and of course, the food is great.\n\nIt's advertised as Thai/Vietnamese fusion. How it works is you order a protein and a side salad, and it comes over rice. I did the honey chili pork with green papaya salad. The pork butt (it used to be pork belly) was so crisp and had some great kick to it. The papaya salad was a great contrast, and I especially liked the peanuts and tomatoes.\n\n$10 for what's probably more than one meal! Definitely worth it if you can find them!", "author": "Kenny C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-05-11", "description": "I may have had it on a bad day... but I was really disappointed with the quality of the ingredients in the food from this truck. The price was fair for the portion size, the service was fast, but the quality of dry inedible meat in my chicken platter was pretty unpleasant. It was mostly chunks of fat with dried out meat in between on top of cold white rice that had hard inedible pieces in it.\n\nDon't know if I got the tail end of service at noon or last weeks leftovers, but I was really let down. With the limited food options in DUMBO, you'd hope that the few that exist would be worth it, but this experience left me disappointed.\n\nConsidering how many great reviews there are, maybe I chose the wrong meal?", "author": "Ian J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-12", "description": "Sweet Chili is a great food truck. I've seen them before at Governor's Island and some other events around the city, but honestly forgot about them until they began making a weekly stop in LIC by my office. and now I'm hooked, Jerry, I'm hooked!\n\nI usually get a green papaya salad and either the chili chicken or spicy pork belly. both of these meat choices are great; the \"heavenly beef\" wasn't bad, but I prefer the chicken or pork belly. the chicken and pork tend to be a bit more tender and flavorful. for an extra buck I top it off with a fried egg for a protein boost.\n\nof the trucks that camp out here, they seem to move the lines the fastest. I appreciate that.", "author": "Mike B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-07", "description": "Stopped by the first time after getting out of school early (they close at 3) and happened to walk by the truck on my way to see grandma (not my hood). Impressed by the unique menu, flavors and friendly service - returned again today hoping to try their taro purple rice pudding (they were sold out last time!). \n\nLoved the crunchy slightly salted taro chips over the warm creamy coconut purple rice pudding combo. It can use a little bit more sweetness (perhaps slices of mango? yumm) but it was the perfect comfort food on this freezing afternoon. \n\nI also really enjoyed the coconut rice cake - very unique Asian spice - def don't forget to add a fried egg! I wasn't as big of a fan for the shrimp radish cake however - the red dye? Flavor was a bit off. And I didn't really see any pieces of shrimp? But for $3-4 dollars, these dishes were the perfect snacks! \n\nSuper sweet chef and cashier (she gave me a new loyalty card with my previous stamps after I casually told her I misplaced my last one). If only they stay open a bit later, I would def return to try their platter and desserts!", "author": "Wing C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-24", "description": "PEOPLE. Since starting my job in Midtown last year, one of the greatest joys was when the Sweet Chili truck would visit us by Bryant Park once a week. They came by the UN a few times too. They said they weren't making much money to be sustainable up here and have since left... I miss them so much... I also miss the heavenly beef with a fried egg on top... So heavenly... \n\nIf you are near this truck, please order one in my spirit. Order two. I used to do that, so I'd be able to have it the next day for lunch. Sweet Chili, Midtown misses you :(", "author": "Aysha S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-23", "description": "My usual go-to place in my neighborhood...Dumbo's food truck area (usually there are two to three food trucks in the parking lot during weekday afternoon till 3/pm).\n\nRelatively quick service and amazing flavor. I usually get the heavenly beef or the pork belly(both can be spicy for folks who are not used to it) with mango salad and a fried egg on top. One day I should convince myself to be vegetarian just for a few hours and try the tofu one as I've heard good things about it too.", "author": "John C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-07-11", "description": "So much potential, so much flavor, and a poor execution. Really a shame. \n\nThe menu is pretty enticing with various spicy and slightly sweet proteins (pork, beef, chicken, tofu, etc) served with a spicy salad and jasmine rice for $9. \n\nI opted for the spicy and sweet pork with the mango salad. Upon opening the container, I look down and it's not generic pork, its thick, layered, pork belly. From a food truck? Man, am I excited. Then I take a bite and two things jump out at me: 1) the favors here are awesome. The sauce is bleeding over to the rice and its delicious. 2) the pork is just not cooked well. It is over done, and tough bordering on rubbery. Such a shame to use a quality pork and cook it to badly, especially with the accompanying favors. The salad also was a great combination of sweet and spicy. \n\nWill I come back here again? Yes, definitely because the favors were spot on, but I will not be ordering the pork again.", "author": "Dave F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-16", "description": "The miso glazed tofu is so delicious that I have ordered it every time despite wanting to try other options. \n\nFor $11, you get a to-go container filled generously with rice, a handful of delicious tofu cubes and your choice of greens - I always go for the papaya salad. If you don't mix the sauce from the tofu in with the rice you're not doing it right, it's delicious that way.\n\nOnly gripe I have with this place is that they aren't very consistent with the amount of tofu you get. I've had a few times where I got a decent amount of tofu - although there was a bit too much rice for the amount of tofu - but other times I've gotten maybe 4-5 little cubes of tofu with a mountain of rice. Would also love if they did less rice and more salad - you get probably 3-4 forkfuls of salad with the meal.", "author": "Kerry M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-28", "description": "Not many times do I get surprised by a food truck, usually I don't even write about them, but this one was different.\n\nI was just walking by, being myself, having fun. I started talking to these 2 girls in this truck, they were alot of fun, so I ordered some food, The Heavenly Beef and some papaya salad, walked away. Got a block away, started eating: THIS STUFF WAS REALLY GOOD!!! I literally walked the whole Atlantic Antic Street Fair, ate gyros, meat pies, overpriced crappy lobster rolls, blah, blah, blah. I'm a big guy, not fat, BIG.\n\nNothing compared... Nothing. I couldn't get it out of my mind! I stopped by the truck one more time to compliment Lisa... AND SHE GAVE ME A FREE KRONUT!!! (Never had one before...lol) The kronut was pretty good, but I'm a beef guy, and that beef was delicious!!!", "author": "Luke C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-25", "description": "A wise New Yorker once told me \"If you see a line, get in it because you know whatever it is it will be good!!\" This is exactly what I did for the sweet chili truck in DUMBO- uber long line but everyone seemed pumped.\n\n The chef was taking orders. She was very friendly and excited for each customer. I got the pork belly and papaya salad with rice ($10) and additionally checked in for 10% off! The workers were quick considering the amount of people lining up.\n\nThe pork belly is glazed, realtively sweet, but too chewy and crunchy for my taste but I'm no pork belly expert. Looks like she carmalizes it as well. The rice is soft pretty standard. The papaya salad is pleasantly tangy and crunchy! That was my favorite part of the dish.", "author": "Caitlin M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-10-18", "description": "Firstly the food was great, however, the only word I can use to describe the service is 'diabolic'. Myself and two friends ordered the chicken and were told they didn't have enough for all three off us. Not a problem, it all sounded great so we just said to give us a mix of meats. We then decided we'd order the dumplings, rice cake and shrimp cake. This is when the service became awful. After asking for the extra sides the woman serving us was clearly unhappy and muttered (quite loudly) the words \"Jesus Christ\" and rolled her eyes up to heaven. If it had not been for the other two staff members cooking our meal we would have walked away, but we did not. To add to the rudeness, they forgot our rice cake. All in all, great food (hence the 2 stars), horrendous service from who I believe is the head chef.", "author": "Conor G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-14", "description": "I visited this food truck last week at Governers Island. How they seem to make such good VIETNAMESE food inside a food truck seems to amaze me. I don't seem to understand how they are able to make that happen. I'm giving this plave 5 stars hands down because there food is out of this world with LARGE food portions. I had sweet chilli beef with white rice and beanprout salad. Yo! that food was amazing. If they had a sit down spot and more locations other than Manhattan this store would become my go to spot. \nHands down I support this place. This place is the truth!", "author": "Nwade O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-08", "description": "I finally tried Sweet Chili a few months ago on Governors Island and I'm absolutely hooked. I've eaten at the truck probably a dozen times this summer. My review is way overdue. Lisa and her staff are a great group of welcoming, funny people. I was constantly asking on Facebook where the truck was located and still beg them to come back to Williamsburg. Somehow they put up with me. \n\nThe Coconut-Chili Rice cakes are perfect with an Egg. They make a great mini brunch. Only $4 bucks. I'd seriously pay double. \n\nIf you leave there without the Sriracha Fries you've made a mistake. They are topped with the most amazing creamy, spicy - sweet sauce. The truck is closed most nights, and I'd often trade my dog for an order of these fries. \n\nLet's end this with the Honey Chili Pork. I like it with the Mango salad but it would taste good on a dirty sponge. This shit is life changing. If you're planning on going to Governors Island Sweet Chili is a must.", "author": "Michelle F."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-10-22", "description": "Chicken seemed like it was reheated. Small portions. More like an appetizer. Not the amount of meat shown in Their pictures. Should have been $5 not $10. But I still wouldn't go back for $5 either.", "author": "Andrew u."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-09-20", "description": "I had the chicken with mango salad. It was just meh. There was a long line, but that's more due to the lack of good options nearby. They do give you a lot of food, though.", "author": "Casey L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-12", "description": "You know that feeling... what to eat for lunch?  I have this question everyday.  Well I no longer have to on wednesdays (when the Sweet Chili truck is located by me - changes locations daily, so check out there website!).  \n\nThey don't have many dishes, but each dish is amazing.  It's a fairly simple - Choose a salad, choose a meat and all comes with jasmine rice.  You can add a side of fried egg or pork dumplings.  They have coffee (hot in the winter, iced in the summer).  And sometimes they'll have a specialty dish - always look for the chalkboard listing. \n\nMy favorite though is the Heavenly Beef and I usually get it with there pork dumplings.  Flavor just sticks and you just have that great taste even after you finished your bite.  Savoring and looking forward to it every time.\n\nBeen hitting this truck every wednesday since I found it.  \n\nStaff is very friendly as well.  I'm surprised there isn't a longer line - but then again, the service is very fast (wait time is no longer than 2-5 minutes).", "author": "Rich R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-09", "description": "Sweet Chili parked outside of my office today for the first time, and something about their description of the cuisine as \"Thaietnamese\" on the back of the truck caught my attention.  All of their entrees have a base of jasmine rice, which I love, so I was in.  I ordered the jasmine rice with heavenly beef and the bean sprout salad.  For dessert, I ordered the coconut candy.  All together, it came out to $12.  Very reasonable - and they take credit cards.  For me, this is huge.  I only carry cash about once a month, which typically prevents me from checking out new food trucks.  Also, when people accept credit cards, I always order more.  \n\nThe food was great.  I'm a pretty small girl, but I just wolfed down the entire box of food plus half of the dessert.  The beef was great - not fatty and very flavorful.  The serving size was ideal - I was able to get a big chunk of beef with every forkful of rice.  The salad was also awesome.  I typically hate bean sprouts - I will actively remove them from Thai dishes - but the salad totally changed my views.  Mixing some of the beef in with it proved to be an excellent choice.  The dessert was crazy good - like sticky, sugary crack.  My co-workers are currently standing at my desk picking at the remaining half like vultures.\n\nMy only complaints are (a) a lack of spiciness and (b) the stickiness of the jasmine rice.  For the meat, I would prefer more of a seasoning rub rather than having to rely on sriracha for some heat.  Also, they could use chili garlic sauce instead of or in addition to the sriracha for a saltier, bolder kick, which would be nice.  For the rice, I would personally prefer something fluffier. \n\nI really hope they keep coming back to my neighborhood - I could see this being a weekly thing for me!", "author": "Tay H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-22", "description": "Amazing food!  How they pull this off from a truck is beyond me!!  I've seen this truck for over a year and was hesitant to try because I've never seen a Thai/Viet fast food truck before.  I finally bit the bullet and tried and was impressed with what was served to me for 10 bux.  I had the beef and papaya salad with a fried egg on top.  \n\nThe meat was flavorful and had a nice portion of meat to rice ratio.  The only reason I can only give 4 stars is due to the portion of  the overall food.  I wish it was a tad bigger and the papaya salad in a separate container.  However, this will def cater more towards the working crowd along Broadway and its tourists nearby.  I highly recommend you try it if you're in the area.", "author": "James K."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-09-27", "description": "Chicken was dried out and tough, the word 'leftover\" comes to mind, the papaya salad had the whiff and taste of the refrigerator.  Service was lukewarm and too cool for school. The portions are small, so to make up for the $10 this truck needs to try harder.", "author": "David C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-02-18", "description": "Redeemed the Paypal offer at Broadway near Bleecker \u0026 Houston for their popup Chinese New Year celebration (which entitled me to a free rice cake bite, which was...uhm...unintentionally crunchy). Went with the Shrimp radish cake $4 which I really enjoyed, and the lackluster pickled bean sprouts $2. Opted against the pricier Miso Glazed Silken Tofu w/ Green Papaya Salad, jasmine rice (would've been $4 after PayPal subsidy) and instead opted to drop $1 for these for two specials:\nRadish cake  1 $4.00 $4.00\nPickled Sprouts   1 $2.00 $2.00", "author": "George C."}], "servesCuisine": "Thai", "priceRange": "Under $10", "name": "Sweet Chili", "address": {"addressLocality": "New York", "addressRegion": "NY", "streetAddress": "", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/jrLVsouUDy266d6FI8BM1w/ls.jpg", "@type": "Restaurant", "telephone": "+13476697385"}