{"aggregateRating": {"reviewCount": 390, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-04", "description": "Solid neighborhood spot. Get the potato pancakes with poached egg, bacon, and avocado...yum.", "author": "Mary E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-01", "description": "I can't believe I haven't reviewed this place before!  I've lived a few blocks down from Clark's for 7 years and they are consistently great.  The Clark's poached eggs are served on very crispy potato pancakes that are to die for!  This is always my go to when I order from this place, but their coffee is great and so is their french toast.  The only thing that I've ever had from here that was just OK is the BLT as it doesn't automatically come with mayo - that's a critical component!  Overall I think it is slightly pricier than your average diner but this place is very clean, excellent service, and I've never had a bad meal.", "author": "Rachelle R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-23", "description": "I first discovered Clark's when I was walking around the neighborhood while apartment hunting, trying to get acquainted with the area. Though I didn't end up moving there, Clark's would absolutely become a major go-to for me if I lived around there. It's a diner, but super classy and well-kept. They had lovely relaxing classical music playing, and the service was so top-notch you may as well have been in a white tablecloth restaurant. \n\nIt seems to be a popular spot for breakfast, but I highly enjoyed my dinner there as well. They have a huge menu of dishes ranging from a pizza burger to a steak dinner. My turkey burger was fresh and tasty, and the fries were perfectly prepared - not one mealy fry in sight! \n\nThe thing I keep going back to is how quick, professional, and friendly the service was. It warms my heart to know that in an age where everyone seems to be rushing you in and out of businesses, Clark's makes it a point to create an environment that makes you want to linger!", "author": "Christina P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-24", "description": "Great place for brunch! Everyone is so nice. Saturday's and Sunday's are packed, but host gets you seated as soon as possible. The longest I've waited is about 10 minutes. Once you're seated the waiter will bring you coffee and juice and take your order if you're ready. They bring the food out quick! I recommend the avocado Benedict or the bacon, egg and cheese sandwich with home fries.", "author": "Shelby A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-11", "description": "I am SO glad that I ate at Clark's this morning. Classy atmosphere - they're playing Beethoven, it sounds like. Really nice decor. \n\nBut what deserves a huge round of applause is their NEW YORKER - Salmon Benedict. Wow. \n\nI practically live for breakfast. This Benedict was hands down the best I've had in a year. \n\nNo doubt I'll be back here many times. Probably before the week is out. \n\nGreat job, Clark's! You're killing it!", "author": "Chicken H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-21", "description": "Great breakfast spot, classical music, short walk from Subway, great people watching, service, food!", "author": "Susie N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-03", "description": "Yum yum yum!  Finally found my favorite breakfast spot in BK.  This place is super cute for an early weekend breakfast.  Great music, cozy Xmas decorations, friendly staff, and delicious food offering huge portions!  Reminds me a bit of the diner (Tom's) from Seinfeld : )", "author": "Jen D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-03", "description": "Got seated for 3 on Saturday morning brunch on NYE with no wait! Host was pleasant, service was quick and polite, and the food was killer. Order the Clark's Poached Eggs with avocado on potato pancakes. Super filling so don't expect to have any extra room. Very average prices at an above average brunch spot. Keep it up Clark's!", "author": "Dwight S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-30", "description": "Ordered a Pastrami on Rye with lettuce and tomato and side of fries. Got a dry pastrami sandwich with very little meat. No lettuce tomato or fries. Waiter was rushed.", "author": "Dewayne B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-12-04", "description": "This place is total rubbish.    I keep going back again and again because a close friend of ours lives nearby and Brooklyn Heights has so few choices.\n\nIt's habitually overcrowded, the service is rude (except for the manager, he's very friendly) and the food is \"meh\" at best.\n\nOn Saturday morning my group of 5 was seated in a corner booth (which seats 4) and the first thing to go wrong is that they had no coffee.     NO COFFEE????     You are a diner, you need two things:   coffee along with air for your customers to breathe.   Just TWO things.\n\nRather than being asked when our order was being taken \"how do you guys want to split this up?\"   or \"separate checks\" the waiter just took our order in a rush.\n\nMy order had whole grain toast, instead I got whole wheat (yes, there's a difference, and in fact their menu even offers the two choices).\n\nThe final strike was the worst... our waiter was incredibly rude (even raised his voice at us) when we indicated we needed to split the check.  The answer was simple, write a line down the center of the check as the top three orders were on one check, and the bottom two orders were on the next.   He made a huge ordeal out of it and embarrassed all of us in front of our two out-of-town guests.\n\nI've never had a single experience at Clark's that was enjoyable, but this probably was the last time as our dear friend e-mailed us a menu of another place nearby.\n\nGoodbye Clark's ... won't miss you.", "author": "J M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-06", "description": "I have been going to this wonderful diner for years.  The service is great with Caeser always making sure you have your meal the way you want it     Mark is always planning new menus selections, and the store is always run well and clean as a whistle.  I must say that you will enjoy the best oatmeal in new York.  Just go", "author": "Stan C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-05", "description": "Love it here. Very comforting ambiance. It is a small space and gets packed on the weekends. I've never actually had to wait for a table. Eggs Benedict is my favorite. My boyfriend has the Nutella French toast and we've never been disappointed!", "author": "Silver S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-08-25", "description": "This place has great food but is run by total assholes.  They didn't have the Yankee bean soup that they just decided not to make today after advertising they make it every day.\n\nI was disappointed but still wanted soup, so I asked for just a little sample of the other 2 (a very common practice at diners) and they refused.\n\nWhen I told him I was going to leave over this he said good just get the fuck out of here!  And that was the manager!!\n\nI used to come here a couple times a month but never again.", "author": "James W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-16", "description": "Clark's is straight up as good as it gets - no frills, just a great american breakfast or lunch.", "author": "B K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-13", "description": "It's been a year since we discovered Clarks and while we hoped to return to enjoy this superb breakfast option sooner than this, it was well worth the wait.\nMy husband and I made the trek to Brooklyn after an overnight in Manhattan hopping the A train for a less than 30 min/ no changes trip early on a December Sunday. It was a short walk through Cadman park from the subway stop. There were 2 couples ahead of us but we were quickly seated at a delightful window seat.\nWe each ordered the \"big breakfast\", mine with Brioche French Toast while my husband chose the pancake combo. Each entree is accompanied by coffee, a small fresh squeezed OJ, bacon, sausage AND ham. My \"over medium\" eggs were cooked perfectly as was everything else on my plate.  We enjoyed the sausage in particular.\nWe added a large OJ as we remembered it was that good...it was excellent! Service was prompt and efficient.Now that we've discovered how easy it was to reach , we will return!", "author": "Karen P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-17", "description": "We grabbed a mid-morning breakfast from here after a run across the Brooklyn bridge. The location is easy access from the bridge and is exceptionally close to the train. \n\nOverall what keeps this place from five stars is the service. While he was quick and efficient, our waiter was unpleasant despite our best efforts to be friendly and accommodating customers.\n\nFood was great! Order a large orange juice... It is fresh squeezed and amazing. My eggs florentine was very well prepared and I imagine was representative of the rest of the food quality! Top notch! \n\nPrices were reasonable.", "author": "David M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-03", "description": "Clark's is my favorite diner this side of Chicago. Some things better than others but basics - eggs, bacon, home fries with side of avocado really great. Plus, the staff is usually very attentive (even when you have a toddler) and they play classical music.", "author": "Anne O."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-04-28", "description": "Bad experience. Place was empty but we were waiting for 2 breakfasts and orange juice about 30 min. Also my husband found egg shell in his breakfast.", "author": "Maria V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-29", "description": "This is a restaurant others can learn from as an example of how a great business should be run - excellent, homemade food in portions suitable to fill you up, arrives promptly, the friendliest, most down to Earth staff, options for everyone, reasonable prices and very clean! They know how you take your coffee (as a regular) and make you feel like family. \n\nThere's a reason they're frequently packed (and you still get a table quickly, and with elbow room)!  They have breakfast all day and there's so much on the menu that I've actually gone there for breakfast AND dinner without feeling like I'm eating the same thing twice in one day. I've never had a bad meal here. And their fresh squeezed real orange juice is a treat! Their pastas \u0026 burgers are delicious, their yankee bean and split pea soup are also homemade and are so good that I get some to take home. If you're a grilled cheese or a pancakes person (try the Mocha pancakes), they never disappoint!\n\nYou can tell the staff care about getting it all right, and they do. Clark's easily becomes a staple of living in Bklyn Heights, where there are fewer restaurants than there used to be, but it holds its own, regardless.  I literally can't find anything negative to say about this place. Go!", "author": "s b."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-04", "description": "Came here for bite before heading into the city. Read the reviews and thought I'd give it a shot. \n\nIn the late afternoon on weekday the place is very bare and you can just walk in and sit down wherever you like. The waiter was very attentive and knew when I was ready to order. It's a pleasure when you don't have to call anyone over to do that. I ordered the California burger deluxe and it arrived fairly quickly. When I requested mayo for the table, not only did the waiter bring that, but also brought a bottle of mustard. Thinking ahead - a good sign.\n\nThe burger was enjoyable. I wouldn't say it is over the top though. It seemed a bit under-spiced though. The half-avocado that came with it was great. The fries were basic stick fries, but they were very well done and crispy, so very fun to eat. \n\nI'd actually want to come back and try the pasta dishes, they looked quite enticing. \n\nEnjoy!", "author": "Zack M."}], "servesCuisine": "Diners", "priceRange": "$11-30", "name": "Clark’s Restaurant", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "80 Clark St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/_1T55JW7JQ-s8XZ_tOtNfg/ls.jpg", "@type": "Restaurant", "telephone": "+17188555484"}