{"aggregateRating": {"reviewCount": 390, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-30", "description": "Clark's is a Surprisingly good diner/cafe.It does not appear to be anything special- but just give it a try. \n We came on a busy Sunday at brunch time, but we did not have a long wait. The menu is not very veggie friendly but there is always a bagel and home fries and  many different pancakes if sweets are your thing. The grilled cheese sandwiches are delicious too. \nMy reason for coming back is the Fresh Squeezed Orange Juice! It is amazing, the best OJ I think I have ever had. The service is friendly and efficient; while the ambience of Clark's is small town local diner- which  fits perfectly with its cozy Brooklyn Heights location. Props for being open the day after Hurricane Sandy.", "author": "Tara K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-07-26", "description": "Clark's restaurant is a more upscale diner with diner quality food but higher prices. They have vegan and vegetarian options: veggie burger, pasta, salad, soup, etc but overall the food and experience was just average.", "author": "M P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-11", "description": "Been here for breakfast a bunch. The eggs benedict is spot on. Quick to refill your coffee and the food is always good.", "author": "Andy S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-16", "description": "The food is solid, if slightly more expensive than a typical diner. Freshly squeezed oj is a plus. Very small coffee cups, though, which would be fine if the servers were on top of refilling them... Sadly, I had an empty cup quite frequently.", "author": "Kayley I."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-10", "description": "Fast service.  Great selection.  Perfect breakfast.  I had an egg sandwich on brioche.  Simple, but actually hard to find.  I'll be back!", "author": "Bob S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-28", "description": "Great find for just looking for something nearby for party of 9.   Service was great - food was great and prices were reasonable.   Everyone was happy with their dinner and the meatloaf was the best I have ever had!   Definitely worth the wait!", "author": "Amy B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-29", "description": "Great spot for breakfast! We stumbled upon this place on the way to the Brooklyn Promenade. The food was excellent and the service was top notch.", "author": "Olivia H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-09-10", "description": "The service was pretty bad. Staff was completely inattentive to us. We had breakfast and the food was so so. Overlooked omelet. Would not recommend this restaurant", "author": "Terri H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-08-17", "description": "The second star is because we have had good experiences here in the past.\nClark's restaurant had been a standby for a weekend morning breakfast for close to 3 years now. Until this morning.\n\nWe were greeted, as always, very nicely by the host. A promise that we would not wait long for two was quickly kept as we were sat at a table by the window looking out on to Henry Street. \n\nWater was delivered promptly, as always. The menu was perused briefly and decisions were made. There were a couple large parties in the room, which could have accounted for the next 8-10 minutes, but I am not in the business of making excuses in my place of work, so I will not afford that privilege to Clark's Restaurant here. \n\nTwo solid minutes past and no black vested waiter approached (black vest = server, maroon vest = busboy). Two minutes in diner time is an eternity. We asked a passing maroon vested man if we could place an order, he grunted what appeared to be an acknowledgment.\n\nTwo more minutes, nothing. We asked another maroon vested gentleman, same response.\n\nTwo more minutes. At last, a waiter in a black vest approached to deliver food to a table right next to us. The delivery was made and his back promptly turned and headed in the other direction. We flagged down an approaching maroon vested fellow and he said he would find our waiter.\n\nAbout two minutes later our waiter finally approached. My fiance began to order, and was interrupted by the waiter saying he could hear her (she was speaking perfectly audibly). She asked if she could have fruit instead of the prescribed soup or potato, the answer was a flat out no. It was at this moment that we decided Clark's Restaurant was not deserving of any more of our time or money.\n\nWe headed across the street and a block away to the Park Plaza Restaurant. We were greeted promptly, attended to quickly, and allowed to enjoy our meal with the intermittent 'check' from our waiter.\n\nA diner does not have a hard job - the food has to be good, not bad, and the service has to be swift and polite. A side of gruff is expected, but tolerable. What is not tolerable is direct rude-ness.\n\nWe will no longer be visiting Clark's Restaurant - I suggest those who read this stop by the Park Plaza Restaurant. You will be happy you did.", "author": "Lee K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-12", "description": "Clark's is an excellent place for breakfast if you're in the Brooklyn Heights area during a hot summer morning. The seats by the windows are the most desirable. It seems like you're eating outdoors, but you're actually still indoors with the A/C and at the same time soaking in some sun. \n\nThis is the best American Diner I've walked into with a touch of Greek inspired décor. For what you're getting, great surroundings, grande size breakfast, the price is reasonable, plenty of options for under $10.\n\nI skipped the coffee and ordered a freshly squeezed orange juice and had:\n\n1. Big Breakfast - Comes with bacon, ham, sausages, two eggs, and choice of pancakes, french toast or waffle. We had the pancakes and these are some huge pancakes topped with fresh strawberries.\n\n2. Garden Omelet - This omelet had a lot of broccoli, mushrooms, and other ingredients. Served with potatoes and toast.", "author": "Jin Y."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-03-13", "description": "If you like diner food, Clark's is pretty decent. I've had the breakfast(probably a 4 star) which is good value with a lot of food.(I've had the pancakes, which were solid) However, the dinner really isn't worth it. I had the grilled chicken for dinner and it was average at best. Imagine some grilled chicken along with some rice and a smattering of vegetables(also dinner isn't the cheapest here, you'll probably pay around $25ish bucks).\n\nThe staff is pretty nice and the place itself isn't too beat up, however, with the wealth of dining options in Brooklyn Heights I would hesitate to come here again besides for breakfast.", "author": "Dawei L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-22", "description": "What happens when eggs benedict and potato latkas have a child?  The dish of beauty that is Clark's Poached Eggs.  Maybe for some that wasn't enough, so I'll continue.  Clark's is a great \"high end\" diner with a very welcoming and friendly atmosphere.  I say \"high end\" because it's very much a classic diner but it's got a little bit of class to it (and the only slightly higher prices to go with).  So far haven't been disappointed with anything on the menu.", "author": "Jonathan C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-02", "description": "I highly recommend their breakfast. I had a very tasty dish with eggs and salmon. The food is fresh and tasty, the service is good, and the tables are far enough apart to make conversation easy.", "author": "Andy O."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-05", "description": "Finally! A good diner within walking distance for me. Located on the corner of beautiful Henry Street on Clark Street, you can't miss it. There's floor to ceiling windows and it's well lit making it alluring. I used to work nearby and would have breakfast but what prompted this review was their grilled chicken sandwich. It tasted fresh, not frozen, and the turkey burger was also good. It looks a little fancy for a diner, but the prices are far from expensive. I don't know if it was because it was during the holidays, but the only thing I would change was the classical music that played nonstop while I was there.", "author": "Adriane C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-06-12", "description": "No matter how I feel when I wake up in the morning, I know I can always make it to Clark's for some breakfast. Thankfully, it is a stone's throw away from my building and so is always there to conveniently serve. Today I was able to walk right in and get seated right away but I know I have seen long waits in the past.\n\nThe choices are endless and just about everything sounds amazing. We opted to split the chocolate chip and banana pancakes and a side of homefries. The prices are not steep and everything was delicious. \n\nThe service was quick and attentive and it basically has all the qualities a good neighborhood diner should! I'll definitely be back here in the near future because it just made my day start that much better!", "author": "Cassie P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-07", "description": "One of my favorite places to go for breakfast in the Heights. I get the grilled chicken and eggs every time (gluten free). The cappuccino is nice too. Definitely hangover cure central! The service is also good...", "author": "Jillian W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-06-22", "description": "Solid diner on the expensive side. They have a huge menu and you can order pretty much any food you might have desire for, and they have a large space, so they can usually sit you for brunch without a wait.\n\nIt's not the most delicious place in the Heights, but it serves his purpose when you want to eat some diner food and you don't want to wait in line during busy meal times.", "author": "Antonella P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-28", "description": "Nice diner for breakfast. German omelet was huge and my dad had the Clark omelet which he liked alot. Good spot if you are in the area and want a quick bite to eat without going to a deli or something.", "author": "Mike F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-01", "description": "I had a fantastic breakfast here. I got the Belgian waffle with bananas and chocolate chips. The waffle was perfectly fluffy and crisp on the outside. The bananas were nice and sweet. I never ran out of coffee, because the server was very attentive. The sausage and fresh squeezed orange juice was delicious!. I definitely recommend this place if you're in the area!", "author": "Jalise B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-09", "description": "Love this place.\nGreat food and great service.\nI wish they would stay open later.\nIt's hard to believe in that in the Brooklyn Heights this is the only true diner.", "author": "John D."}], "servesCuisine": "Diners", "priceRange": "$11-30", "name": "Clark’s Restaurant", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "80 Clark St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/_1T55JW7JQ-s8XZ_tOtNfg/ls.jpg", "@type": "Restaurant", "telephone": "+17188555484"}