{"aggregateRating": {"reviewCount": 390, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-11-02", "description": "A 5 star NYC neighborhood diner. They serve it up fast \u0026 fresh, smiling all the while, and run an extremely tight ship. They are so efficient and speedy as to ensure everyone's satisfaction. They also have great diner grub, with a slight bit of Greek influence - you can get gyros or chicken souvlaki with genuine tzatziki here (I believe the owners are Greek). They  have tons of salads and sandwiches, a full menu of pasta dishes, and all the breakfast options you could want; this is a place for corned beef hash over eggs benedict though, which is how it should be in a diner. They also have beer \u0026 wine. Bonus.", "author": "Justin C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-07", "description": "i got the eggs benedict with smoked salmon.  so yum!  all my friends seemed to enjoy their breakfast too, and we all left pretty satisfied.", "author": "Angie L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2006-08-19", "description": "I met a college pal of mine here for a lunch date.  It was super good and tasty.  The menu was simple and boasted decent prices.  An $8 lunch deal got me a yummy chicken wrap, cup of soup, an ice tea, and rich chocolate pudding to round it all off!  A nice price for a filling meal.  The sauce on the wrap was super good but very garlicky, so be warned if you're concerned about that kind of thing.", "author": "Sarah L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2009-01-16", "description": "I went here a few months ago with my mom for breakfast while she was visiting new york and I was pretty disappointed. I ordered the eggs benedict and my mom got the french toast. When my eggs benny arrived the eggs were under-poached. One of the eggs was even a little bit raw on the edges, GROSS! I broke open the other one and it was runny all over the place. A poached egg like that should be soft boiled with just a bit of run at the center. I asked that the eggs be poached longer and when they arrived the second time they were still runny. UGH!!! F this place. Never going back again. My mom liked her french toast so I'm giving it two stars.", "author": "Shmalex D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2007-02-21", "description": "The prices are totally affordable. I love eating there and getting a window seat to gawk and make faces at the Heights Brooklynites.", "author": "Adam D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-06", "description": "My husband and I stumbled upon this cafe and we were starving! We both ordered wrap sandwiches which were cooked and arrived warm. I had a chicken with avocado wrap and my husband had the egg and bacon wrap. Good quality fresh ingredients were used and the service was excellent. We loved it!", "author": "Teri W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-05", "description": "Clark's Restaurant should have been the first restaurant review I did, because I eat here more than any restaurant!!! I've been coming here since at least 1991. The ambiance is attractive and well maintained. You can sit near the clear glass area for good street and sidewalk views, in the regular seating area or at a counter with classic diner stools. I regularly order their breakfast to be delivered for a group of 10 or more. The owners and restaurant staff (hail Caesar) are the BEST! Mark and the managers handle special orders very well. Everyone treats you special and I've always felt authentically welcomed. You've got to try their fresh squeezed OJ, split pea soup (home made recipe), Belgian waffle, pesto chicken wrap and other wrap specials, hamburgers, grilled chicken BLT, scrambled eggs, breakfast sausages and coffee. What else can I say, Clark's is the standard for what a diner should be.", "author": "Derek B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-16", "description": "When you need a serious breakfast (anytime during the day) this is the place to go. Very good service, never too long for a seat and great food. They definitely know how to cook up an omelette and their side of homefries are the best. Only complaint is that I always end up with a $10-15 bill for breakfast, a bit expensive, but worth with.", "author": "Richard A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-18", "description": "Great neighborhood diner. Good breakfast. Good split pea soup. Great staff! There can be a wait for a table when it's busy, but never more than five or ten minutes. We moved out of the neighborhood and still come back here to eat.", "author": "M M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-07-03", "description": "Came here for brunch after doing an early morning run across the brooklyn bridge and the park.  Clark's restaurant is pretty small and they really pack in the seats tightly, I actually moved my seat to the side just so I wasn't back to back with the guy behind me so I could actually breathe while eating.  Besides that, it's your standard diner.  I ended up ordering the hungry man that came with two slices of french toast, two eggs, two sausage links, two slices of bacon, and a slice of sandwich ham for $10.95.  For New York, I think that's a pretty good deal for that amount of food and did leave quite satisfied.  The scrambled eggs were done well leaving that creamy consistency that one would expect.  There was nothing special about the ham although I was a bit disappointed since I was expecting a thick cut piece rather than the thinly sliced deli ham I received.  The bacon, was obviously something cheap since it didn't really have any flavor that I could detect.  For a diner, there's not much to really complain about.  The food was good enough, the prices were fair, and the service was decent.  Downside however is the space issue but I guess they gotta cram as many patrons in there as possible to ensure a good profits.", "author": "Phil L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-09", "description": "It's not everyday that you go to a diner where they have stuffed baked potatoes... it was delish, filling, and fresh. Went here unexpectedly but  was pleasantly surprised. Def will come back for some more yummy goodness.", "author": "Julia S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-02-17", "description": "we overshot chelsea on the MTA and ended up in brooklyn hts, but we found Clark's by accident, and we got the last small table before it packed up (it was sunday for lunch).  Despite the crowd, the service was fine; the challah french toast was very cinsmmon (wish they had a better syrup), and I liked the meatloaf grilled cheese sandwich, although I thought I would get a thicker slice of meatloaf..  The crowd was so intense, I felt a little rushed, but it made it feel just like New York.", "author": "Gary Y."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-19", "description": "brunch is awesome!!! :) pancake is delicious.. The eggs are good but I don't really enjoy the vegetable that they served... Haven't get a chance to try the fresh squeeze orange juice.. I will totally go back for brunch again!!!", "author": "Shing Yiing O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-12", "description": "A trip to NYC is never complete without breakfast at Clark's. The food is great. Prices are average. Service is wonderful. Try the greek yogurt. It's a favorite. The owner makes you feel right at home when you walk in the door. Awesome neighborhood breakfast spot.", "author": "Michelle A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-06-23", "description": "After five days in NY (first time!) I was tired and ready to settle for anything for breakfast before my flight home. It was my luck that my bf insisted we \"Yelp\" for somewhere good and after much debate we decided to give Clark's a try. Best. Decision. Ever. It was spacious inside, big windows kept it feeling open and was great for people watching. Service was wonderful and not too busy...in face it seemed like it was composed of mostly regulars grabbing their morning coffee and breakfast. The fresh lemonade came out in shaved ice which was weird..but as soon as I tasted it I found it wasn't weird at all, but genius! SOOO good and fresh! Everything was reasonably priced, and meals come with a tiny cup of the best fresh orange juice you'll ever had. Quite appropriately my last meal in NY was Clark's \"The New Yorker\"....Egg's benedict with smoked salmon. SO GOOD! This place is definitely a must try, I can't wait to go back!", "author": "Christine L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-05-02", "description": "Very good place for breakfast! Very friendly staff and delicious food.", "author": "Josh M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-04-23", "description": "Excellent weekend breakfast at Clark's Restaurant in Brooklyn Heights. I ordered Clark's poached eggs. The basic idea is eggs benedict with potato pancakes and bacon substituting out canadian bacon and english muffin. The dish itself was a delicious textural delight. The eggs were perfectly cooked. Breaking into the egg the yoke poured beautifully on the bacon and pancakes. The bacon and pancakes were also perfect. The bacon was nice and crispy but not oily. The pancakes similarly were not soggy but added a strong crunchy base to handle the yokey goodness of the eggs. Not all was perfect however. My companion had the waffle all the way dish which was mixed bag. This dish consisted of a Belgium waffle with a side of bacon, eggs (in this case scrambed but you cna choose how you want them prepared), sausage and canadian bacon. The wafel was ok. It was pretty basic and begged the use of maple syrup. The meats were unfortunately very oily. The bacon was soggy and did not match the delightful texture of the crispy bacon in the poached egg dish. Nevertheless, this is a nice neighborhood place to grab a quick and good breakfast/brunch.", "author": "Jonathan H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2008-12-31", "description": "If you're in the area and in the mood for diner food, this is probably your best pick. I usually come here for breakfast but I've gotten dinner here before too, and it's also good. Very true about there being long lines on the weekend...but if it's mid-day and you're lucky, you can get a window seat and people watch. The pea soup is really good. The food is light, not terribly greasy and it sure beats the Park Plaza diner...", "author": "Jenna P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-04-13", "description": "Warren's brother lives just across the street from the diner and he considered this his haunt.  I am always hearing rave reviews from him, so when we were over in the Heights the other night trying to decide where to eat for dinner, Andrew suggested Clarks.  I could not have been any more pleased with the suggestion.\nWhile Andrew said Clarks is really happening on the weekends for brunch, I thought the laid back, quiet atmosphere of Clarks on a Saturday night was welcoming (seeing as I had to work that day and was completely exhausted from the other night out on the town....).\nThe diner is small and the large windows are great to people watch.\nWhile I would have had a more attentive and happy server, he remembered Andrew by name and opined if he was going to get the same thing as usual - a nice touch.\nI am a total tuna slut, and the triple decker tuna sandwich with frenched fries was what I was craving.  The tuna was good - I think I tasted a hint of dill in the tuna with mustard seed - and while the sandwich was a little too high to eat in one bite, I always pick my sandwiches apart and eat them in sections, so it really did not bother me.  The frenched fires were light, airy, and not too greasy.\nI would suggest not getting a side salad - just looking at Warren's made me feel sad for the poor, wilted lettuce, and the uninspired arrandgement of veggies.\nThe vegetable soup on the other hand was good - just your normal, diner fare.\nThe prices are cheap and the food was good - will definetely have to come back from brunch before Andrew leaves the Heights for bigger and better things.", "author": "Stephen N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-11", "description": "My family and I disagree about this place.  I'd give it a 4 but my H says it is a 5.  I get my way :) The breakfast is tops.  Fluffly yellow eggs, crispy bacon, non-oily potatoes and unstoppable coffee.  One problem is that Clark's can get expensive for a neighborhood joint because they charge for every little thing.  For example, a plain hamburger is not served with L\u0026 T - that is extra.  Forget about dinner time.  Not only do they close early, but something like a chicken gyro runs you $10 with not-so-much chicken.  Also, the tables are way too close and the backs of chairs tend to squeak against one another.  Don't dare to come here on a day where the kids are off from school or - shudder - mother's day.  People are lined up out the door.  I have been going to Clark's for the past 25 years.  It evolved froom a sleepy little coffee shop to this current \"restaurant\" incarnation - all in the same tiny space.  The owners are great, the waiters are patient and smile the whole time.  Come here off hours for breakfast, and you'll fall in love like I did.  Come here at 9 a.m. on a Sunday morning . . . hey, I told you so.", "author": "Undercova A."}], "servesCuisine": "Diners", "priceRange": "$11-30", "name": "Clark’s Restaurant", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "80 Clark St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/_1T55JW7JQ-s8XZ_tOtNfg/ls.jpg", "@type": "Restaurant", "telephone": "+17188555484"}