{"aggregateRating": {"reviewCount": 390, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-17", "description": "The manager is always available and friendly being a great host. Staff is efficient and nice. Food portions are big and tasty. I don't like volume i prefer quality. This place has both. Any time i come to NYC i will always stop by. I have come here for a couple years now and hope to come for many more. Keep up the great work and awesome music selection. Love you guys!!", "author": "Josue E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-12", "description": "Great service and food, first time in Brooklyn and loved  it!  I ordered the small breakfast and it was the perfect size for me.  Orange juice was freshly squeezed and delicious.", "author": "Alma D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-05", "description": "Great for breakfast! I've been coming here for years, whenever I'm here for a visit I need to stop here. I always get the Greek omelette with potatoes and toast, perfection. Solid service and they keep refilling your coffee. Also try the fresh squeezed juice, it usually comes with the meal.", "author": "Daniel C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-08", "description": "PERFECTION. I go with my girlfriend every week. Everything we get is perfect. Any wait is worth it. I have gotten everything from choc chip pancakes to eggs benny on potato pancake. Everything is great. Juice tastes like manna from heaven. Classical music. The best.", "author": "Jonathan R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-08-08", "description": "Service is quick and friendly and the OJ definitely hits the spot. I ordered the Clarks Poached Eggs with Avocado and the dish was so heavy an greasy. Way too much fried hash browns and definitely needed a balance of something else. I would stay away from this dish or try the eggs Benny with the potato if I ever came back.", "author": "Jessica C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-08-31", "description": "The food was really, really good. I had brioche french toast with strawberries and walnuts on top. However, I took out my laptop to do a little work before my meal arrived. The waiter came over and told me that this wasn't allowed and I had to put it away. That was a complete turn-off. I will not go back again. I wasn't planning on staying after my meal and working.", "author": "Beth G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-02-06", "description": "I don't know how many times I've eaten at Clarks and ordered delivery from Clarks.  But today they tried to charge me $4.75 for a side of blue cheese dressing.  I asked, politely, because I thought I misheard them... $4.75 for a side of blue cheese dressing.  It's a diner, a good diner, but this makes no sense.  I canceled my order.", "author": "Pablo D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-28", "description": "Yelp fail... came here because of the strong rating and ordered the Big Breakfast and it was so disappointing. Everything tasted like it'd been made a couple hours ago and reheated. The French toast (and even the syrup) were bland. Disappointing.", "author": "Tracy F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-19", "description": "Simple got to love clark's Restaurant.  The food is delicious, prices are fair, and service is outstanding. Especially their brunch menu is amazing. Plus, it's right at the 2/3 subway stop and close to the beautiful Brooklyn Heights Promenade.", "author": "Liane N."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-01-18", "description": "Not from New York and was in the Brooklyn area and I wanted to try something new so I ended up here. The food was alright, needed flavor! The waitress was some RUDE lady who had a complete SOUR PUSS face the whole time...at the end after paying she came at me completely wrong and was upset about what we tipped her...last time I checked tipping was optional!", "author": "Bryant P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-25", "description": "I had been passing by Clark's Restaurant for a long time, a far too long time. This diner is located literally down the block from me, so why it took me so long to try it? I do not know. \n\nNow, I am addicted!!!! It is my favorite brunch spot. I find myself craving it every Saturday morning after sleeping in. That is not only said for me, but my friends as well! \n\nWhen we first tried it, it was a little early, maybe 9 am, and the place was empty. They brought us freshly squeezed orange juice right after we sat down. Let me tell you, this was the BEST orange juice I have ever tasted in my life. It was so fresh and the pulp was so subtle, I could have inhaled a gallon right there. \n\nI have gone to Clark's Restaurant at later times and they do get a bit crowded, but they seat you pretty quickly. The customer service is great. The owners are very lovely and hospitable. \n\nThe restaurant offers a lot on the menu. So you have many options to satisfy whatever you are craving. As for me, lately I have been obsessed with avocado. So when I spotted the Clark's Poached Eggs with Avocado, I knew it was what I wanted. It comes with two poached eggs on potato pancakes with hollandaise sauce, avocado and bacon *mouth waters*. My bacon was overcooked when I got my meal, but I told the guy and he replaced it. Although the meal was a little pricy (about $12) it is filling and worth it!\n\nLove this place and can't wait to try more of their breakfast options!", "author": "Christina M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-15", "description": "For a clean atmosphere. For simple, made-you-smile fare. For a really good grilled chicken sandwich with fried onions and peppers. For a sunny afternoon in Brooklyn Heights with people you love. Clark's is the way to go. \n\nEven though I couldn't see a large group coming here--I only saw groups of three or four at most--I felt like Clark's was truly a family environment. Maybe it was the homestyle cooking, or the fact that our food came to us picture perfect or the surprisingly good reviews from the staunchest critic I know, my mom, somehow I felt surrounded by family. You know, the calm that comes over you after you've just eaten your first round of turkey dinner on Thanksgiving. \n\nI, personally, take a breath before my second round, and release the angst from my job, my life assignments, my eagerness to please, etc etc. Clark's was that warm moment of simple pleasure to just be. Stuffing my face with shoestring fries, almost picking at mom's dish of very tempting shrimp scampi over rice, and reveling in an okay ice cream sundae were the moments I'll remember most, and the reasons I won't hesitate to return.", "author": "Michelle W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-21", "description": "I really enjoyed Clark's. Went here for brunch with my brother and paid less than $25 for two people. Had some mimosas and don't really remember much after that. \nI love brunch. Love everything about it. I love drinking too much, blowing off afternoon plans, sleeping, waking up disoriented...\nClark's lets me do this in a fancy way without the fancy price. I will definitely be coming back!", "author": "Eduardo G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-07", "description": "I spent a few days in Brooklyn and I was looking for a 'mom \u0026 pop' restaurant to get breakfast at.  I stumbled upon 'Clark's' and immediately fell in love. \n\nFirst of all -  This is a really cozy little spot.  There isn't much room inside,  and it's pretty much constantly packed with customers.  As it turns out , there's a very good reason for that.  The food is delicious.  I tried both the Eggs Benedict and the Clark's Breakfast wrap.  The wrap was a light and flavorful blend of eggs , avocado, and bacon.  What's more, it arrived on my table less than a minute after placing my order.  Wow.   \n\nThe servers are attentive and warm,  and an older man who I can only assume was the owner even made sure I didn't forget my jacket on the way out.  This is exactly the kind of spot that gives 'hole in the wall' restaurants a great reputation.   \n\nIf you are looking for a great breakfast in Brooklyn, this is your spot.  Oh, and it's right next to the Clark st. subway (literally across the road)  so it's convenient to reach as well!", "author": "Alex Q."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-25", "description": "A nice haven for breakfast. Service is prompt and efficient. Classical music playing sets a tranquil tone. The standard diner food is unfussy and generally arrives promptly. Real sausages served for breakfast, not sausage patties. Very busy at the weekends: be prepared to line up after about 10 am. A sign announces \"No laptops\": not a place for spending the morning working with a coffee.", "author": "James L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-05-29", "description": "Had lunch today.  Great soups, worst sandwich ever.  Dry bread, turkey, bacon.  Bacon was back of the grill old and almost cold.  Waiter let our water go dry, had to ask three times.  Don't have a sandwich, they have no idea how to make a tasty one.", "author": "G. B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-05-11", "description": "foods ok, the potato pancake taste like old oil that has not been changed. the service was good and workers were very nice. one thing you should try are there drinks they taste very fresh.", "author": "Taffy L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-05", "description": "I really liked this restaurant! I went on a Sunday about noon and it was packed but the owner found a spot for me and the service was very good. After reading some of the reviews I was ready for poor service but my waiter was excellent. \n\nI had the eggs and potato pancakes which is something we don't really have back in south Florida and at first I was like, \"this is ok but I'm not sure if I really like it\" but I found myself eating every bit of it even though half the portion filled me up.\n\nTypical American!\n\nSo yes I whole heartily recommend this spot. Plenty of food. Good food quality. Very clean. Fast. Good service. Not very expensive.", "author": "Brian M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-29", "description": "What I've Had: Lentil Soup, Grilled Cheese Sandwich with Avocado, Bacon, and Tomato \n\nThis place is definitely old school NYC diner. It has a mom and pop feel and the patrons looked like regulars.   \n\nIt's clean and relaxed.  \n\nThe menu is HUGE!  \n\nConveniently located right across the street from the Clark Street Station (2/3). \n\nThe food is solid. Nothing fancy about this place but if you are looking for a no fuss, quick bite in the Brooklyn Heights/DUMBO area, check it out!", "author": "Danielle J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-07", "description": "Had a wrap packed with avocado, chicken, bacon, and romaine. Delicious. The waiters were kind and the service was fast. Unfortunately, I do have to say that I chose this item because the other menu items seemed overpriced...", "author": "Jackquelynn H."}], "servesCuisine": "Diners", "priceRange": "$11-30", "name": "Clark’s Restaurant", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "80 Clark St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/_1T55JW7JQ-s8XZ_tOtNfg/ls.jpg", "@type": "Restaurant", "telephone": "+17188555484"}