{"aggregateRating": {"reviewCount": 390, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-30", "description": "Great place, we had the Cobb Salad / side of sweet potato fries...it was all delicious...we definitely recommend this place to eat!", "author": "Angie C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-15", "description": "Tasty food, great coffee, inexpensive.  There were lots of healthy options on the menu as well as cheese burgers and fries, soups, sandwiches, etc.   We went the healthy route, Greek salad w chicken and a chicken Caesar wrap.  Both were delicious, the ingredients all fresh.  The coffee was very good, nice and strong and they were sure to come through to offer refills.  The service was quick and efficient .  I would definitely go back.", "author": "Susan K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-08-08", "description": "I was disrespected by one of the manager of this restaurant, his name was Miguel Ramirez. I went to this restaurant to order a sandwich to go but before I ordered I had to use the bathroom. Mr.Ramirez had stopped me and asked me where I was going, when I told him that I was going to use the bathroom before I order, he told me to get out. I couldn't believe what just happened so I had to step out of the restaurant to calm myself down because he embarrassed me in front of other customers. I went back inside and told him that I was going to order food to go. I asked Mr.Ramirez who was the manager on duty and he said it was him, and he also said he's the owner of Clark's restaurant. The way he spoke to me was unacceptable and i'll make sure that everyone I know that works and live in Brooklyn Heights know this manager's terrible customer service.", "author": "Jared B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-24", "description": "It's got a restroom for customers, which sets it above some of the other restaurants on the block, but that's where the superiority ends. Had a very mediocre sandwich here. The waiter was nice. It was convenient. ‍", "author": "Hannah H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-27", "description": "Very generous dishes. A bit crowded on a Saturday morning. Good greek omlete. The drinks that come with it are pretty small.", "author": "Eti H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-08-27", "description": "I want to give this place 4 stars, but the service was so poor that I had to dock them a full star (and I round up all the time, so that says something about the service).  There is not that much space and the waiters dont seem to really care.  I pointed out that it looked like someone had already taken a few sips of my water glass and they said it probably just wasnt filled to the top.  Maybe they are right, but it took a long time to get anything we asked for, even simple things like a coffee or a new glass of water, and we would have to flag down any waiter because they didnt seem to be organized, I saw other tables having similar problems.  The food was actually good and reasonably priced, so I would go back because there are just not many decent brunch options in the neighborhood.  They also have a very large menu, so there are many different things to get.", "author": "Rakesh M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-22", "description": "Best diner- owners make you feel like family. Excellent french toast on challah bread. Huge homemade sausage and great coffee.", "author": "Lexie R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-07-02", "description": "I've been to Clarks many times for breakfast. The first few times I was lucky enough to go when they weren't busy. That is when my experience was good.\n\nThe next time, I went to breakfast with my boyfriend. He accidentally tipped over my full glass of orange juice (which is delicious- but costs a fortune). It took forever to get someone to help us clean it up. Then we asked if we could have another. It took forever just to get the second glass AND they made us pay for the spilt glass and the new one. \n\nThis was just one of many terrible experiences with the service here. Nothing against their food- that is always great. But it seems that every time someone comes to my table, it's a different waiter. I suppose they don't just stick to their zone, they wander the entire restaurant or just stand around and wait to be called over to a table. \n\nAs I am writing this review, I am currently sitting in Clark's. I've just looked at the menu noticing that any add-ons practically cost an arm and a leg. Not worth it. Also they have brought my food out almost 10 minutes before my boyfriend received his food. \n\nSo to sum it up: food costs a lot, yet is good. But the good food is overshadowed by the terrible service.", "author": "Austen M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-16", "description": "I'm not sure if this place was once called Clark Street Diner, or if I made that up. \n\nAnyway, we went for breakfast on Sunday morning. Very little wait, but the place was hopping! We were seated and helped by the same people who have been there for years. I like that kind of longevity! \n\nOrdered two breakfast special omelets, which I believe were $8.25 each. Includes coffee, OJ, and a side of toast. Not too shabby! Both omelets were great. Coffee stayed full. Little OJ was freshly squeezed. \n\nSolid place! \n\nPS- I'm told their yankee bean soup is phenomenal.", "author": "Benjamin C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-11-03", "description": "Very unattentive service. Food looked great but flavors were underwhelming.", "author": "Char H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-24", "description": "Super fast service great food, the bacon was super crispy  (too crispy for me but I'd you like it crunchy then you'll love it)", "author": "Margaret M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-26", "description": "Don't expect a super nice, personalized service, but be ready for delicious pancakes. The shape is traditional American, but the taste is much more European for me :)", "author": "Konstantin R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-19", "description": "Good place.  Clean and good space.   Diner food is above average.  Had the eggs Benedict which way good", "author": "Khalid B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-05-04", "description": "Meh.  That pretty much sums it up.  You can have breakfast all day long.  I guess thats the best part of it.  The food is just meh.  nothing sticks out.  had the blueberry sundae pancakes.  blueberries were infused in the pancakes and there were two scoops of vanilla ice cream on top of three pancakes.  plenty food for 10.50.  The syrup they served was individual kraft brand syrup in sealed containers.  Also tried the french toast and canadian bacon.  THe sides were a little on the hard side but the middle was soft.  overall for a diner like place, ive had better.  the dinner menu seemed a bit pricey for the food.  dont think id ever go back.", "author": "Matthew G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-27", "description": "Great experience the French toast was my favorite the staff is awesome he made sure we was okay every chance he got", "author": "Brittanie M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-24", "description": "Food is delicious. Especially breakfast. Friendly staff and it's always busy in there. You know it has to be good!", "author": "Jorge G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-26", "description": "Good food. Subtle flavour. I had the avocado poached eggs breakfast which was nice albeit a bit bland.", "author": "Anurag R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-19", "description": "Solid, reasonably-priced brunch spot. Came here with two friends on a Sunday afternoon (probably around 1pm?) and although the place was pretty packed, we were seated fairly quickly. I'm not sure what it's called, but I basically ordered a more complicated version of eggs Benedict, with avocado and served on a potato pancake. It was tasty and very filling! The people I was with got French toast and an omelette and said they were good as well. Service was a little slow and it took us forever to get water (forget about refills) but overall, I enjoyed brunch here!", "author": "Elizabeth F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-13", "description": "Had~Great Grill Chess Meatloaf Deluxe w/ Fries for delivery and they were fast with delivering and food was still warm~ Enjoyed", "author": "DW W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-28", "description": "Damn good for a diner!\n\nGood service, really delicious food, good prices, comfortable atmosphere...what else can you ask for?\n\nI got the omelette which was loaded with fresh turkey, avocado, and cheese and my bf got the pot roast, which came in this amazing sauce. I wish this place was closer to me so I could come all the time but this is definitely the best diner I have ever been to.", "author": "Cat C."}], "servesCuisine": "Diners", "priceRange": "$11-30", "name": "Clark’s Restaurant", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "80 Clark St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/_1T55JW7JQ-s8XZ_tOtNfg/ls.jpg", "@type": "Restaurant", "telephone": "+17188555484"}