{"aggregateRating": {"reviewCount": 390, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-08-10", "description": "I've been going to this place for many years and I think the waitstaff and food is excellent. The reason for my 3 stars instead of 4 or 5 is due to the high price and slight stinginess of the owners.\nI think 2 breakfast orders, no coffee or oj, for $16 is a lot , for a diner, even a nice one.\nThey give refills for coffee though which is great, especially since the cups are standard tiny diner cups from the 50's. No refills for to go cups which I think is stingy. I was waiting for a to go order and started drinking my small coffee while I waited. I paid, tipped a normal amount you would tip while having table service and asked them to just refil it a bit to the top. The owner, the wife, said no. So that's kind of petty.\nStill will continue to go there because it has great food and waitstaff, but also because it's the closest to me.", "author": "Cecilia R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-06-17", "description": "This place is OK.  I think it could be awesome, but it's not, it's just fine.  And from the looks of it it looks fancier than the food presents itself to be and tastes like.  I had the typical egg breakfast and my dining companion had a Belgian waffle.  Neither of us was blown away, but we didn't hate it.  The potatoes that came with my eggs were dry and slightly undercooked, but the eggs were very good.  I would go back if someone I was with really wanted to go but it's not on my \"must do again\" list.", "author": "Fran T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-07-19", "description": "I come here every time i am in town ... my sister and her husband live nearby. \n\nGreat diner food. \n\nFast service.", "author": "Katie G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-17", "description": "Had a great omelette here. Wasn't crazy about my side of sausage which was of the thick, mushy type (versus thin, well done variety I prefer). A little more pricey than a typical diner but worth it. Total tab after tax/before tip was $24.45", "author": "Will S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-29", "description": "A great diner spot in Brooklyn Heights.\n\nthe split pea soup accompanied by crunchy croutons are great, though maybe slightly on the salty side and in need of a little bit more black pepper. but nevertheless, i always order it and eat the whole cup/bowl.\ni usually get the egg salad wrap lunch special - if you like egg salad, try it here -  they do it right. very soft and flavorful, combined with bacon, lettuce and cheese in the wrap. and with the wrap, you get a soup and drink and dessert for $12ish.\nthe grilled cheese sandwiches are good too. they seem like they are fried whole, pretty greasy, but definitely very tasty.\n\nand the service is always friendly and pleasant.", "author": "emily ahn l."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-11-15", "description": "This local diner is the BEST in the neighborhood. It has great service, good food, and nice workers. The breakfast is great! but if you get too \"exotic\" with the food it's not the best, keep it simple. overall it's the BOMB!", "author": "Ben D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-08-21", "description": "I started eating at Clark's ten years ago when I was single and needed a \"greasy spoon\" treat after late nights out on the town. More recently, after my daughter was born, she and I have made a tradition of visiting Clark's very early on Saturday mornings, allowing mommy to catch up on sleep back at home.\n\nThe food is decent (better than your average diner food) and the waiters and busboys couldn't be nicer. It reminds me of New York diners from the 70s and 80s without being at all seedy or dirty.\n\nThat said, there are some issues...\n\n1) The coffee is bland and watery\n\n-and-\n\n2) When it gets busy, the manager/host guy can be quite rude\n\nTo illustrate my second point: \n\nOn a recent Sunday morning my daughter (now 17 months) and I visited around 9a and were seated by the manager/host at a two-top table rather than one of our usual booths, which can fit up to four. This was presumably because he was trying to save the larger tables for larger parties, which I can understand completely.\n\nAs she's only 17 months, I asked if he wouldn't mind me squeezing in next to her so that I could entertain her and help feed her when the food came. He insisted that, as it's a two-person table, we had to sit ACROSS from one another. I said I'd sit next to her initially and, if he needed the extra space (there were currently at least a half dozen other tables open), I'd move across the table as he'd requested. He walked off in a huff.\n\nTHEN, after all of this, a two-person couple walked in behind us and were immediately seated in one of the open four-person booths.\n\nTHEN, as we waited for the food to arrive, I entertained my daughter by playing with a iPad coloring book app. The same huffy manager/host guy came over and told us we needed to stop using the iPad, citing the \"No computers\" policy advertised on the door. I explained I was simply trying to keep the baby entertained until the food arrived so she didn't bother any of his customers. He did not care. \"No computers, that's our policy\", he said.\n\nClearly, the guy has issues, which is odd for a place that bills itself as family-friendly. Bottom line, I think, is they've had good success building a following over many years and most of the waiters and busboys are extremely nice. However this older boss guy (who would not give me his name) is not afraid of being very rude to a patron and even shouting in front of a young child. He should realize that even the most loyal customers have other options in the neighborhood and people will not stay loyal forever if they are treated this way.", "author": "Sam J."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-10-11", "description": "I usually have to head to downtown Brooklyn for something relatively unpleasant, like jury duty, so I look forward to visiting a place like Clark's that welcomes its customers with open arms.\n\nClark's is a warm, friendly diner with a pleasant lunchtime buzz, a waitstaff that doesn't hurry you along, huge portions, and food that actually seems lovingly home-cooked.\n\nI wouldn't come to this area just for Clark's, but I sure am glad it's there when I do.", "author": "Liz N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-12-25", "description": "All I'm gonna say is: Banana \u0026 Chocolate Chip Pancakes!! YUM", "author": "Stephanie M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2007-10-29", "description": "A longtime neighborhood gem where you can get coffee, OJ, eggs, and toast for $4.35 and in about two minutes. The food is fresh, the servers efficient and friendly. On my second visit, the guy behind the bar already asked if I wanted the same as last time.\n\nSkip that stale bagel from the cart and stop in here for breakfast instead when you know it's gonna be *that* kind of day.", "author": "Michelle L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2007-11-17", "description": "A diner, but a little more \"upscale\" (if that is at all possible) than your regular diner.\n\nNot crowded at all for dinner, but I haven't been here for breakfast, when I imagine the major crowds are.\n\nThis isn't a bad place to go to before St. Ann's if you are looking to save a little money and don't want to shell it out for one of the nicer places on Henry.\n\nIt's typical diner fare, but they do have a wider selection of pasta and some decent lunch specials.", "author": "Karen M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-19", "description": "It's great to go into a family owned operation and to be treated as one of their own. Thanks Mark.", "author": "Sara D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-05", "description": "Good service and food. Great from breakfast to dinner, and the service is good. The Mexican waiter Miguel will find you a table and make sure everything is ok. The meals are generous for the price. Burgers look wonderful and taste really nice.", "author": "Rafael M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-07-02", "description": "Just had the worst pancakes of my life here - nasty.  Must be from a frozen mix.  How hard is it to make batter?  Fail.", "author": "Optimist O."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-10-02", "description": "Key word was breakfast.  So I get there sit down nice looking place to sit on a Sunday morning and eat.   Food comes and was run of the mill but the service for almost being empty....CAN I GET ANOTHER CUP OF LOUSY COFFEE... not even good coffee.  Such a shame being in such a nice locale.", "author": "Stephen K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-25", "description": "Lovely people, very friendly \u0026 sweet with kids, which helped with our young daughter. They brought out a booster seat \u0026 a mini glass of water for her \u0026 a small plate so she could share my (delicious) blueberry pancakes  without any prompting.\nGood, fresh tasting breakfast food for a good price, they keep the service swift but friendly \u0026 without rushing you through. Perhaps I wouldn't cross town for it, but if this is your neighbourhood diner, you are very well served.", "author": "sarah d."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-09-10", "description": "Worst dining experience I've had in New  York. Don't go here after breakfast.\n\nIt started with the waiter not even asking what we wanted to drink. The busser just shoved waters at us and the waiter asked if we were ready to order. Having worked at a restaurant,its pretty standard that you ask the table if they want anything to drink.\n\nThen my friend asked for Italian dressing with her salad and they didn't have any. I order a chicken salad pita and asked if i could have fries with it instead of soup and the waiter said no... my only option was $4 sides, really??\n\nSo the potato salad was horrible, it had no taste, and the chicken salad pita was average. My friend's fries were COLD. Not just room temperature, but cold. The waiter didn't come back once during our meal to check on us or refill our water.", "author": "Kylen M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-12", "description": "This is the breakfast go-to place in Brooklyn Heights.  Very cute place - comfortable and not too chic at the same time.  There's usually a wait on the weekends, but it goes quickly.  The staff is very nice and helpful.\n\nWARNING:  If you get the Hungry Man special, that may be your only meal of the day.  Though that may not be a bad thing.\n\nP.S.  Stick to this place for breakfast/brunch - the actual food is not the greatest.", "author": "Michelle N."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-05-22", "description": "A friend took me here for brunch, the negatives are NOT the restaurant or it's staff, it's the fact it is across the street from a college dorm and the place is full of nasty spoiled kids. So my food was good, but I was surrounded by loud annoying kids yelling at eachother and one even threw something that hit me and never said a word (like SORRY!)....\n\nAgain, too bad, place was pretty good", "author": "Karla J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-16", "description": "Possibly one of the better diner places I've been to in Brooklyn. Whenever I hit up around this area for a run, my buddies and I would come here to enjoy a satisfying brunch meal. The restaurant itself is quite small and really busy but the turnaround is pretty quick. I came here on a Saturday with two other friends and I guess our eyes were bigger than our stomach so we each ordered the pancakes/ Belgian waffles that came along with sides of  eggs, bacon, sausage, and ham. I believe it was called the Lumberjack and Hungry Man. Keep in mind that we were all females so the chances of us finishing all of that protein and carbs is pretty slim. They really overloaded on the pancakes as it came in three huge slices. Sadly, I was only able to finish one slice since I was getting full from the eggs and sausages. Overall, I thought everything tasted pretty delish. They also serve pretty quick and waiters constantly come around to check on you and give free coffee refills. It's nice to hit up this place on a weekend.", "author": "Rowena Y."}], "servesCuisine": "Diners", "priceRange": "$11-30", "name": "Clark’s Restaurant", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "80 Clark St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/_1T55JW7JQ-s8XZ_tOtNfg/ls.jpg", "@type": "Restaurant", "telephone": "+17188555484"}