{"aggregateRating": {"reviewCount": 390, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-01-05", "description": "I feel daft giving a diner 5 stars but on a recent-ish weekend trip to New York this was the only place I went to twice. Funnily enough I got the same table; perfect for watching the world go by.\n\nAs a tourist visiting from the UK this is what we imagine a diner to be. No theme...just good food and service.\n\nI had eggs benedict and coffee and then eggs and sausage and pancakes. All were superb. And all were pretty reasonably priced.\n\nWandering around Brooklyn Heights afterwards I found the place I would like to live in New York. Lack of visa, employment and money means I have no chance but it's nice to dream!", "author": "Neil M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-30", "description": "Great gem! Been a customer for yrs, its great place to unwind with fam, gets packed on the weekends \u0026 a bit tight, but the food \u0026 service is always grade A.", "author": "Jason Twigg M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-11-06", "description": "Clark's is a class act.  \n\nDuring the weekends, there's a long line out the door for brunch and jam-packed inside.  Yet the owner stands at the front of the line and makes sure to warmly greet every single person as if he's known you for years.  Most of the waitstaff are also just as gracious, and genuinely look happy when they recognize you as a repeat customer.\n\nTheir corned beef hash is the best in the city.  Even when you order for delivery, the eggs arrive perfect (not overcooked), and the corned beef isn't smushy.\n\nMy favorite dinner entree is the spaghetti carbonara.  I always ask for the bacon extra crispy.  The pink lemonade is actually frozen slush!  Yum!", "author": "Jo C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-03-16", "description": "So good!  You know, I usually expect a pretty generic meal and atmosphere when i hit up diners, but Clark's proved to be a quality, intimate brunch experience despite the weekend crowds.  I was intimidated when i saw the line of people waiting for a table at 1pm on a Sunday and almost walked out.  However, the owner came right up to us \u0026 assured us the wait would be short.  He was right.  Tables turn quickly, so we only waited abot 5 minutes.  Furthermore, the owner/host came by multiple times to check in on us, which made us feel right at home.\n\nThe window tables are great \u0026 provided a great view for people watching down Henry St.  Service was good, and there was an all-around friendly, cozy vibe.\n\nPancakes are a must and a good value - I could only eat half of my plate.  i had them with walnuts mixed in - added a delicious crunch!  I was also very impressed with the sausage.  A little crispy on the outside and perfectly cooked.", "author": "Rachel W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-19", "description": "if you are looking for a big, american, diner kind of breakfast then head over to Clark's alright.   I live closer to Tom's in Prospect Heights but there's to much drama there for a cup of coffee and some eggs.  Clark's is easy -- good prices, more space than Tom's, the service is OK - but hey aren't you going for pancakes -- if you want service go somewhere in the city and pay $40 for breakfast w/fresh squeezed juice.  Clarks is fast in - fast out == you can pay $10 - 15 for a good breakfast and a cup of coffee.  \n\nAnother note:  do you have folks visiting - this is a good spot to go have a cheap/big breakfast -- then walk down the street and see some great sites.......walk along the waterfront and to the brooklyn bridge its great.", "author": "Ib B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-03-28", "description": "Ordered a grilled cheese and got cussed out by the waiter!\n\nI ordered a grilled cheese with tomato. It arrived. Bit into it. No cheese. Opened it and looked. The amount of cheese was sort of the amount of butter you'd put on toast. I tried to gently point this out to the waiter and got an \"F- You!\" \n\nSeriously.\n\nNever coming back. Awful. \nLeft insulted and humiliated.\nI have never said this about any restaurant I've eaten at, but I hope they go out of business and soon!", "author": "David G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-25", "description": "I just had lunch at Clark's for the first time and I truly enjoyed it. I was able to get a window table and was served my food very quickly. The chicken souvlaki was delicious even if it was more than $10. I definitely want to try out breakfast or brunch asap.", "author": "Bay P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-04-27", "description": "It's a diner. With quick service and fair prices. Good hungover grease breakfast and the best of it's class in the 'hood. If you want higher quality, tastier food and better ambiance well it exists within a few blocks. if you don't? Well this is your place.", "author": "Thadeus P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-05-24", "description": "Not a 4 star yelper by no means. Overrated. Poor service. Hash browns were old, dark brown as in bad, and clearly not tasty.", "author": "J P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-23", "description": "The grilled cheese, avocado, tomato sandwich is absolute perfection! \n\nService is very good.  The fries are shoestring and the portion is a little smaller than what I'm used to for a diner but all around great!", "author": "Collen M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-10", "description": "I love this place...it's a little more expensive than run of the mill diners, but happily they can deliver breakfast to my apartment for those \"oh God why did I smoke all those cigarettes last night\" Saturday mornings.  Poached eggs with avocado are especially delish.", "author": "Erin C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-02-09", "description": "I love this place, I ate there almost everyday when I was living at the Hotel St. George.\n\nThe food is really, really good. I would get giant breakfasts on almost every visit.\n\nThe prices are great, not the cheapest but definitely affordable, the menu is expansive, the staff is very friendly and soon they knew my orders by heart.", "author": "Calvin S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2009-11-25", "description": "You cannot open a laptop anywhere on the premises. Regardless of whether you are ordering a five-course meal. Bunk.", "author": "Jeff M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2007-09-18", "description": "A diner is a diner is a diner, right?  Well, not always.  Clarke's really is a higher level diner.  You can get great omelletes, pancakes, and waffles for breakfast.  They also have an amazing turkey burger.   It really is packed on Saturday and Sunday morning for brunch so be warned that you'll have to wait.  And they deliver....early.  It is my first choice in Brooklyn Heights for breakfast but I'm unsure if I'd go for dinner.  There are better places in the Heights for this.", "author": "Valerie D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2007-02-21", "description": "Clark's gets packed on the weekends, but it slows down for dinner. I recommend it because the prices are pretty decent and I love the diner menu with the restaurant atmosphere. The waiters are all really nice and the service is excellent. I'm a big fan of the breakfast and they have awesome grilled cheese- mozz, pesto and tomato on sourdough is the best, but I'd say try an Italian restaurant if pasta's what you're in the mood for.", "author": "Haley C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-01-19", "description": "The food was good but no better than average and was more on the expensive side. My biggest qualm with the Restaurant, one shared with many other goers, was that substitutes are not allowed in a meal-- unless you're willing to pay much more. For example, they wouldn't allow me to substitute the broccoli in my omelet for spinach though spinach was an option. They also only serve large portions for breakfast options (no half stack pancakes allowed!). So come with a giant appetite and take the menu at face value.", "author": "Sarah H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-12-17", "description": "I live in the area and eat out a lot like most New Yorkers.  The food is terrible and the staff is even worse.  I vowed to never go here again after eating a horrendous greek salad in the past, but today the restaurant reaches a new low for me.  My mother took two of my sons in for burgers at lunch and was actually thrown out of the restaurant because my 5-month old started crying.  Definitely not family-friendly at all, so whatever you do, don't bring children there.  Unless, of course, you can guarantee they will never cry, yell, throw food, make a mess, run, jump, etc.", "author": "Juliana G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-17", "description": "Had breakfast on a Saturday morning...very busy but service was perfect. We both had the poached eggs with avocado over potato pancakes. Yum! Definitely headed back to try something else.", "author": "Tawn N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-03-09", "description": "really though, it's a 3.5... \nthe waiter was horrible. maybe we caught him on a bad day; perhaps he missed the subway to work this morning and got yelled at by the boss; perhaps his wife didn't put out last nite; or perhaps he's distraught that obama didn't take texas and ohio....who knows. whatever it is buddy, don't take that out on us. scrambled eggs sounds nothing like strawberries- well not really. but if you bring out the wrong item, don't say, \"well it sounded like you said strawberries.\" no where in the book of good customer service would it say that that is an appropriate comment to make. \n\nanyways...the belgium waffle was good. the french toast looked good. i didn't care for my home fries- they cooked it with onions. i don't eat onions. the orange juice was cool. \n\nthe older gentleman who assisted us at the register was nice. he pushed the rating up to 4 stars.", "author": "Sherilyn T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-02-21", "description": "Listen. I usually wake up at my fam's place in Cadman Tower on Clark and I am not cooking for those ppl. Sorry (not). So I head to the \"restaurant in back of da house\". Breakfast is always good. I get the turkey bacon meal with tea. Awesomeness to start your day. For dinner I decided to try my luck one night. Fagettit! How in Hades do u sell semi processed deli sliced turkey with gravy on it for $16?! Blandest thing eva. Anyway, Im still a fan of breakfast...but after the sun sets, steer clear.", "author": "Shanora S."}], "servesCuisine": "Diners", "priceRange": "$11-30", "name": "Clark’s Restaurant", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "80 Clark St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/_1T55JW7JQ-s8XZ_tOtNfg/ls.jpg", "@type": "Restaurant", "telephone": "+17188555484"}