{"aggregateRating": {"reviewCount": 390, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-11-06", "description": "Everything was good until .... The waiter handed us our check before we asked for it or made any gesture of being ready to leave. My meal was still 1/3 unfinished. There were tables seated with food way before I even got to the restaurant and they didnt get their checks handed to them.. ..\n\nThe meal was mediocre, this is a pretty standard inexpensive diner.", "author": "Malinda L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-02-13", "description": "Decent coffee and the food is ok. But I've had some racist experiences with the staff so I think I'm going to avoid this place in the future.", "author": "Howard R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-26", "description": "Very nice diner. Lots of food choices. Clean \u0026 a good spot for yummy desserts. We enjoyed sitting by window \u0026 watching people stroll by.", "author": "Lisa G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-28", "description": "We went for a late breakfast to Clark's, obviously during peek time as five parties were already queuing up. The staff friendly and efficiently accommodated everyone and we had a nice table at the window. \nThe staff is very quick - so was I when making my order without realizing that my baked potato was supposed to have 'American' cheese on it. When being served I was confused but realized that it was my mistake as I just missed the cheese mention in the menu. Regardless, the team took my food back, in a short amount of time served me a new plate w/o cheese or any extra charge. This service truly made my day!!", "author": "Miriam P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-19", "description": "I had a greek chicken with the pita I don't remember what it's called but it's SO GOOD. I'm craving it now lol. But the service was eh- the water was legit disgusting. I would definitely be coming again!", "author": "Jasmine R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-21", "description": "Clark's is one of the best diners I've been to. It's not your typical halla greasy acne infested diner on the side of the highway, but a little more upscale and sophisticated. The higher quality shows a little bit in the prices, but that's completely fine by me. Clark's has all the menu items of a typical diner, and a couple more. It's really busy, and was pretty full when I came on a little past lunchtime on a weekday.\n\nThe interior is neat and clean, and the service  is polite and efficient. The crowd here isn't a typical diner crowd and has more orderly people. This isn't too surprising considering its located in an affluent neighborhood. \n\nI would say to definitely give Clark's a try. The food is good and the environment is quite nice, plus it's not too pricey.", "author": "John W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-06", "description": "It was my first time visiting NY and decided to come here for some breakfast since we were in the area. After looking at yelp there wasn't really any highly rated restaurants. The place gets pretty packed but not much of a wait. The diner is cute but a little cramped. \n\nDecided to order the eggs benedict but one of my eggs was overcooked completely, and the side of potatoes was only average. I wanted to like this place, but unfortunately that just didn't happen. \n\nThe food came out fast, but in general everything just lacked flavor and felt very fast food like.", "author": "Scott K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-08", "description": "I walk by this place all the time on my way home from the subway but had never stopped in for a meal. Finally decided to give it a shot and I was not disappointed.\n\nI had a very satisfying cheeseburger and french fries. The staff are very friendly, the restaurant is clean, comfy and nicely appointed, and the food came out very promptly. \n\nThe restaurant closes a bit on the early side but it was well worth the visit. Hoping to stop in again for breakfast sometime soon!", "author": "Ramesh D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-19", "description": "Really cute diner-cafe-restaurant. We were looking for coffee and dessert at around lunch time and got a table at Clark's by the window. So cosy and nice. Ordered 2 lattes, a pie and a cheesecake. New York cheesecake only fyi. We also got the blueberry pie served warm. Both desserts were delicious and each like $5 for a place like that at Brooklyn Heights is so reasonable.\n\nI enjoyed the latte. They even give you a piece of chocolate. I would like to go again to try their food sometime.", "author": "Ceren A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-20", "description": "In for a family brunch, three adults plus fractious one-year old in stroller. Being peak time Sunday, the joint was leaping and, after only a short wait, we were duly seated complete with high chair for junior. Eggs in various configuration were secured, all deemed excellent, except for junior who brought his own cordon bleu meal, most of which he ate and much of which he decorated the rest of us with. Props to the wait staff who took all in their stride despite the mob of hungry punters in a tight space. Reservations not available, we were told, so go in hope rather than expectation but do go.", "author": "David F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-17", "description": "The food here was really good!! I had the big breakfast with a waffle. My two sons had the big breakfast with pancakes (3). There pancakes were good also. Wife had the Farmers omelette ( sausage, ham, and bacon). Came with potatoes. That also was good. \n   Got here around 10:45 am on a Saturday and there was no wait. After eating here, I wouldn't have minded if there was a wait.", "author": "Mike H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-16", "description": "Pretty solid breakfast. I'd give it 3.7/5 stars. I've been twice and the french toast is good and so are the \"Clark's Eggs\"", "author": "Kyle R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-24", "description": "We came here for brunch, and didn't regret it. The portion sizes are generous, the food delicious and the ambiance was great. The backdrop music is Mozart or similar, and the waiting staff was quick to serve us. I recommend this place to anyone looking for a great meal and good service.", "author": "Ali D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-25", "description": "This place is fantastic, the music is absolutely relaxing. It's generally classical music, perfect for a Saturday/Sunday brunch. I usually come here for the omelettes or waffles. Their breakfast selection is extensive. The waiters are courteous and highly professional, the view is great facing Henry Street and Clark Street. \n\nThey close quite early on Sundays so if you're in the mood for Brunch it's best to get there early!", "author": "Kelly B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-16", "description": "This is the best diner in the neighborhood. Service is fast and professional and the food is the best you can get from a diner in Brooklyn Heights. There's a reason it's been in business for so long.", "author": "D K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-15", "description": "Came there for Saturday brunch - as we were early there was no waiting list, we got a nice table by the window. We both had eggs benny and coffees, all was good although then the place got really busy and servers were super overwhelmed - we saw customers around not really happy, but overall experience was nice :)!", "author": "Eglė K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-03", "description": "Growing up in Brooklyn, Greek diners were a staple. Sadly, they're becoming a dying breed, but Clark's is still going strong. And judging from my meal, I can see why.\n\nTheir menu is super extensive. They serve breakfast all day, as well as a ton of salads, wraps, melts, grilled cheeses, burgers, pasta, and more.\n\nI went with their Grecian chicken pita, who our waiter informed me was a great choice. And you know what? He was right. It was also a crap ton of food. Not only was the pita stuffed with tons of grilled chicken, but it also came with a side salad and a ton of fries. A bit thicker than shoestring fries, and super crispy. The grilled chicken was the same kind you'd expect with salad - charred and a tiny bit dry, but nothing the tzatziki sauce couldn't fix.\n\nThey also have milkshakes!", "author": "Kenny C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-08-29", "description": "If I could give this restaurant a ZERO or a\nMINUS-5 star review I would!\n\nI went there to get breakfast and I ordered less than their big breakfast. I ordered a bagel instead of their usual toast. And asked if they could add green peppers n tomatoes in my scrambled eggs. \n\nAnd when I got my bill I saw that I was charged a total of $22 for my order, so I told the waiter that I had a problem with it and to go get the manager. The manager took more than 15 minutes to come to my table so, I had to get someone else to get him because my waiter never showed up again.  And when the manager was coming over to my table he was very rude and asked his waiter, \"what do you mean they're in a rush, what are they in the rush for?\" And when he got to my table, he looked angry and annoyed. I asked him why I was charged $22 for what otherwise should have only been $13.50 on their menu for their big breakfast. I told him that no breakfast even cost near that much on the menu. I said I didn't mind paying a few dollars more for the bagel and the green peppers and tomatoes but $22 was ridiculous!!! But he refused to change the price and said that it was more labor. \n\nIn the pictures below, take a look at what I ordered, all I did different from the big breakfast was add green peppers and tomatoes and a bagel. I was charged $22 and he wouldn't budge on the price. \n\nI will never eat there again and I discourage people from eating there. There are so many other restaurants around there that are way better, friendly, respectful and offer a great degree of professionalism in treating their  customers. \n\nThe three pictures I'm showing here are what I actually ordered (scrambled eggs were dry, too!), what they offer for their big breakfast and what they charged me for each item.\n\n (**The $11.90 was the breakfast that the person who was with me ordered. So, ignore that price.)\n\nNo one ever returned to my table to process my credit card. I sat there for another 15 minutes. I finally had to get up and hand it to them. This was the most horrible treatment I've ever received in all the years I've eaten in restaurants. They retaliated by being even more rude in the end. AWFUL AND EXTREMELY RUDE MANAGER.", "author": "Liza A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-06", "description": "Clark's - how I love your food.  From your eggs Benny to your Banana nut pancakes to your coffee, you do it all so well, and you have a great atmosphere for making memories.  I love your window seating and the staff here.  This is one of my happy places.", "author": "A W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-03", "description": "I have no idea how anyone could give this place less than 4 stars.  The food is great, significantly above the usual diner fare, the service is excellent, the prices are fair.  I've been coming here for yrs and never been disappointed.  PS the chocolate chip pancakes are amazing!", "author": "Lisa T."}], "servesCuisine": "Diners", "priceRange": "$11-30", "name": "Clark’s Restaurant", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "80 Clark St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/_1T55JW7JQ-s8XZ_tOtNfg/ls.jpg", "@type": "Restaurant", "telephone": "+17188555484"}