{"aggregateRating": {"reviewCount": 390, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-17", "description": "A great small but tasty restaurant that is a hit during breakfast time. They offer very reasonably priced food and get a friendly atmosphere by the Greek family owners. I definitely recommend trying this place if you're in Brooklyn heights looking for a great breakfast.", "author": "David S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-01-19", "description": "Clark's has been a place I go to on weekends for many year now.  The service and food are great.  This place is almost always crowded during the breakfast and lunch times on the weekends.", "author": "Steven T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-02-13", "description": "Fair food, ok service, has a no laptop policy which totally sucked considering the amount of work that I had to get done.  Even if they allowed laptops, this would only be average in my book.", "author": "Mimi H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-06-10", "description": "A great family owned diner, my husband and I have been going to this place for about 10 years now, it's becoming our weekend routine.  I love the extensive breakfast menu they have and the best is the service.  They know us by name and before we even sat down the coffees are on the table waiting.  You can beat that!  Food is great, quality is very consistent, I love their Belgium waffles for breakfast, split pea soup and gyro for lunch.", "author": "Iris G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-27", "description": "I was born and raised in the diners of Long Island, and trust me when I say Clark's is tops. It's not even a stretch to call it the best diner in the Heights. The staff is friendly, the service fast, and the food delicious. A vegetarian like myself has a ton of meat-free options, from salads to veggie burgers to eggplant dishes. some important things to highlight (at least in my book): fresh avocados, tasty coffee, fluffy eggs, water re-fills before you can even think \"damn, i'm parched.\" there is one busboy in particular who is especially attentive and friendly.  the only downfall: they are closed on sunday nights, which seems to me like prime time for a cozy, diner-cooked meal. go here!", "author": "Julie K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-03-03", "description": "As one of the only lunch options on Henry Street, I frequent Clark's often. Unfortunately, so do my co-workers. The clientele are civil servants, soccer moms, and typically a lonely, middle aged women staring out of the window. Their lunch specials are reasonably priced, and the food is good relative to the other diner nearby. The service is friendly, except for the frizzy haired, female cashier who is always on edge.", "author": "Flemming S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2010-11-27", "description": "service was bad. the waiter was staring us down, so it was uncomfortable. the food was gross. my pasta had some smelly or burnt taste. i can't even describe it. it just SUCKED.", "author": "E K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2009-12-15", "description": "I ordered a large avocado salad, soup, and coffee. I simultaneously ate and edited a script. Before I finished, they dropped the check. I was going to order desert... There was no one waiting. It was half full. I wasn't at a big table. I didn't get it. Why are they trying to get rid of me? I've been there for 40 minutes. Then I noticed that an old lady behind the bar is eying me. My waiter comes over and tells me that I'm not allowed to do any work at the restaurant. WTF? I still haven't finished my meal, or paid the check. I ask who the manager is and confront her, the nasty woman behind the bar who tells me that I can't do my homework in the restaurant. I couldn't tell if she was joking. I'm a teacher. This woman was soo out of touch and just nasty and ragged. She flatly apologizes, saying, \"It's the rule.\" This is the worst, most ahuman response for the owner to give, as if it's not in her control. This place really is a not at all. It poses as a friendly neighborhood diner but treats people like cattle. I felt more at ease at the post office, or DMV. Additionally she forced the waiter, who I could tell was anxious about the situation (his tip) to drop my check early, and tell me to stop doing my work, which is sooo rude not only to the customer but to the staff because they are the ones who suffer monetarily. The owners are old time brooklyn, crooks. Really vile, depressing, people.", "author": "Catherine D."}], "servesCuisine": "Diners", "priceRange": "$11-30", "name": "Clark’s Restaurant", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "80 Clark St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/_1T55JW7JQ-s8XZ_tOtNfg/ls.jpg", "@type": "Restaurant", "telephone": "+17188555484"}