{"aggregateRating": {"reviewCount": 390, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-15", "description": "Great place. Great service. I was in the mood for a hearty breakfast in Brooklyn and I'm so glad we came across this place. I would just advise to get here early on a weekend because this joint gets packed quickly. I had scrambled eggs, four stripes of bacon, and their amazing version of hash potatoes (at least I think it was, but tastier) as well as two slices of buttered toast. They served us complimentary water and fresh orange juice with my our coffee. And the price was reasonable for the Brooklyn Heights area.", "author": "Grace S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-12-28", "description": "Ok food, slow service. Perhaps you are a local and are a known person, otherwise it was slow service for average food.", "author": "Ashesh P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-03-04", "description": "The food here is tasty, BUT they way too often get delivery orders wrong. The whole point of using an app to order is that the order is CLEARLY printed out. So the fact that 40% of the time they get something wrong is why the two star rating.", "author": "George S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-03-07", "description": "My friend and I ordered before the man next to us but his food came first since he is a local. He also got better service. The waiter barely refilled our drinks or stopped by our table. The Philly cheese steak was very disappointing. It had no flavor. It was on a bun instead of a roll. The beef was hard. It barely had cheese and onions. That was a terrible introduction for my friend who never had one before. The Grecian chicken was more flavorful but there weren't many ingredients in the pita. I added salad. The salad dressing was gross. It was glob-like and didn't look normal. Fries were okay.", "author": "Jennifer L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-01-30", "description": "Great food. But have unfortunately have started to charge so much that not even hot water or lemon is free when you are ordering entrees and sides. Too bad this family run spot has to charge for everything extra. I understand it's 2018 but hot water is a bit excessive. Oh and watch out, they don't tell you they charge for it and you'll see another $4.00 on your bill.", "author": "Heidi S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-27", "description": "Great coffee shop! Fresh food, mostly homemade, friendly service. The burger is fabulous.", "author": "Paul G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-28", "description": "We've been eating here forever. Don't know why, but the food keeps getting better. Terrific neighborhood place.", "author": "Barry C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-20", "description": "I often get un-voted out of going here by the sweetie mainly because she prefers the fancy coffee at a nearby restaurant, but Clark's Restaurant, which I often mistakenly call the Clark St. Diner (sorry guys!), is the best of the diner-style restaurants in the Downtown Brooklyn corridor. Hands down!\n\nWhat makes it so good is not only the food - tasty, plentiful, and served quickly - but the customer service. From the managers on duty to the wait staff to the busboys EVERYONE is so kind and helpful.  Even when the place is packed, as it often is, you are well attended to.  In all fairness I've only ever had breakfast or brunch here, but I need to go more often to check out their lunch and dinner options, which appear to be very good.\n\nThe only negative about Clark's is they lead me to a thinner wallet!  We always order a lot (the food is presented well and I'm often peering at other tables ordering what they have) and leave a big tip because all these folks easily deserve it.  What a great spot.", "author": "Curtis J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-23", "description": "Great diner!\nThe low key vibe and diner feel is relaxing- it's clean and not your typical greasy spoon!  The ingredients taste fresh and the bottomless cups of coffee aren't too burnt.  \n\nI definitely recommend stoping in here for brunch and taking a walk across the Brooklyn bridge.", "author": "Rachel B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-04-04", "description": "Service is very bad and rude. The restaurant was empty and we got there ordered something to drink and when we were deciding what to order they kept telling us to hurry, when not even a minute had passed. Talked to us in a nasty way and they even asked for tip when they did not deserve anything. Will not be going back.", "author": "Criiso M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-01-03", "description": "I just paid $4.50 plus tax for a side order of Bacon.  It came with  4 slices of Bacon, outrageous,", "author": "Lisa W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-12", "description": "My companion and I stumbled upon this diner when we were meandering around Brooklyn the other day. We needed breakfast, and this seemed like a decent option so we decided to check it out.\n\nIt has a huge menu, which is normally a red flag for me, but this one turned out to be okay. I ordered the Clark's Poached Eggs, which came on top of potato pancakes that were very well done, as well as crispy bacon. \n\nThe service is a little slow, but the guys working here are very friendly. It feels like a very friendly neighborhood diner, as I observed other patrons chatting with the servers and talking about their lives, which makes it obvious that people keep coming back here over and over again. \n\nI probably won't be back here, simply because I don't live in New York, but if I find myself taking another trans-Atlantic flight and visiting New York City in the future, I might drop by again.", "author": "Jeruen D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-03", "description": "Another place that I can't believe I haven't reviewed yet. Clark's Restaurant is like the Cheers of family-owned diners.  It builds relationships and works for the returning customers. I can't believe how busy this place always gets on weekends, but you'll frequently see some B-actors come by and enjoy a few eggs and bacon with good friends.\n\nI personally come here to cure my hangover after a night of bad decisions I don't remember. The corn beef hash with extra gravy and potatoes will cure all my ails. I usually drown it with tobasco sauce and drink a few pots of coffee while chatting away with whomever happens to be sitting across from me.  The owner usually comes by and says hello with a genuine smile and warm handshake.\n\nAlso, seating is more apt for 2-4 people. There are only 3 tables that can seat 6-8, so I would recommend this place for smaller groups or you'll be waiting a while.\n\nService can be a little slow at times, but it's Saturday morning and you don't have to be anywhere, so just be patient and you'll be happy with your food.  Have a dessert. Read a paper. Stay for a while.", "author": "Clemens W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-03-16", "description": "This place looks adorable and very promising from the outside -- it's in a beautiful part of Brooklyn. Walking by you can see plants and classic café tables inside through a wall of windows that resembles the sun rooms on old New England houses. I was not expecting diner food when I walked in, but was happy to try this place nonetheless.\n\nAs I settled in, I noticed that the plants were fake, that the faux \"European\" decor was a bit of a miss, and there was classical music playing in the background. Of course, none of these things, alone or in combination, is a deal breaker or even necessarily a negative. But there did seem to be a disconnect between the decor and the final result, and between the atmosphere and the food. Ultimately it was still a pleasant place to have a casual lunch; it was not too loud and the classical music was a welcome change of pace from most other restaurants and stores. \n\nThe food was not expensive but was not great tasting, either. I got a grilled cheese with tomato and pesto and a chocolate milkshake, and my partner got a burger and fries. I forgot to ask for the sandwich to be made with mozzarella cheese and so it came with cheddar. The two didn't clash terribly like I thought they would, but that is because the sandwich was bland. The consistency of the milkshake was closer to milk than ice cream, and was overpriced at $5.25. The burger was reportedly good, but not great. It's possible to eat cheaply here -- my sandwich was $7.25 -- but the more expensive entrees were still reasonably priced at around $13. (Of course, I'm not a New Yorker, so perhaps that is still considered cheap to some!)\n\nI had to ask for the check 3 times, but all of the waiters I talked to (all three of them -- there seemed to be some switching off) were very nice.", "author": "Jenna J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-10", "description": "Clark's is so, so good. We've probably been ordering from Clark's every week since we discovered it. The food is always delicious, portions huge, and service is good (take out/delivery is pretty fast too).  \n\nI've tried a lot of the items on their menu at this point. Some of my favorite dishes are the omelets, egg wraps, and specialty sandwiches (especially the tuna melt). I think these are some of the best omelets and egg wraps I've ever had. The disco fries are also amazing.", "author": "Pearl W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-11", "description": "Finally found a Brooklyn diner that serves traditional and simple breakfast food that actually tastes good. This spot is comfortable and cozy and has all the classics on the menu. I ordered the eggs and sausage breakfast and was pleasantly surprised. While it seems to always be busy and packed, the wait is usually not too bad. Definitely a great breakfast spot.", "author": "Sintiea S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-09-17", "description": "An upscale diner with air of promise, but which ultimately failed to deliver. \n\nJudging by the other reviews, this place is a total hit-or-miss as far as the poached egg dishes go. My own experience validates this.  Unfortunately for me, it was a \"miss\". The Clark's special eggs Benedict (poached eggs over a latka) were not good. The thing I remember the most was how much of a disappointment the latkas (potato pancake) were. They were overcooked  and threw off the rest of the dish. My date's French toast was very good, as was the orange juice. That is the only thing saving this review.\n\nI suggest that if you come here, don't order eggs Benedict in any way, shape or form. I probably won't return.", "author": "Tejal K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-27", "description": "Clark's was delicious and super accommodating when we brought in our huge luggage bags. Service was fast and friendly. Definitely stopping here the next time I'm in Brooklyn!", "author": "Alyssa L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-09", "description": "Nobody really knows who Clark is. It could be a first name, or a last name, but the important thing to consider is the glorious egg-laden Hollaindaisical plate o' butter that is the Clark's poached egg with avocado. Served on Jewish potato platforms, accompanied by crispy bacon, and delivered by kind hearted gentlemen. In my travels, I've eaten at a lot of breakfast joints. In NYC, this usually takes the form of hipster brunch spots or places that get by on name recognition while serving substandard fare. Clark's is neither. In fact, I would consider it the gold standard of NYC diners, but I can really only comment on their poached egg dishes because I find it humanly impossible to order anything else here. May this diner live forever and may it never change.", "author": "Ben C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-14", "description": "Really a fun place. with all the fru-fru places in Brooklyn, this is the real deal. A full menu with all the breakfast classics. the service is prompt and efficient. The food was well prepared and served hot.", "author": "Philip S."}], "servesCuisine": "Diners", "priceRange": "$11-30", "name": "Clark’s Restaurant", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "80 Clark St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/_1T55JW7JQ-s8XZ_tOtNfg/ls.jpg", "@type": "Restaurant", "telephone": "+17188555484"}