{"aggregateRating": {"reviewCount": 390, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-26", "description": "Great neighborhood place to stop in and grab a bite to eat. Where this place really shines is their tasty brunch - my favorite is Clark's Poached Eggs and Avocado - and they have delicious freshly squeezed orange juice. Stop in here on a Saturday late morning on your way to a day in Brooklyn Bridge Park :) \n\nIf there is a wait it moves fairly quickly - they do a good job of serving people quickly, but also not making you feel rushed so if there is a wait people move pretty quickly.\n\nWould give it 5 stars but they charge a lot for extras, even more tea, such that it kind of feels like they are trying to squeeze money out of you at every angle. That being said, don't let it turn you away - this place has good food.", "author": "Kale And Jen G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-02-13", "description": "I was at this restaurant today when I overheard a waiter be unbelievable rude and antisemitic to a table of Hasidic Jews. In this day and age, it is unbelievably disheartening to see something like that, I refuse to be a patron at this establishment anymore. The food was also just ok to begin with, but I absolutely cannot tolerate that kind of behavior. The owners and management should be ashamed.", "author": "Jeff I."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-02-15", "description": "Just your typical diner with an expected menu and just okay quality of food. Service was friendly and  speedy. Coffee was fine, eggs were cooked just as I wanted them, nice portion of bacon, the potatoes could have been tastier. Would go back, would certainly not go out of the way to dine here though.", "author": "Len N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-15", "description": "Y'all this was the perfect spot to conclude our nyc trip. Family owned diner with impeccable service. From beginning to end they made sure we were taken care of. The food was good, albeit not the most boutique brunch spot ever, but the unpretentiousness of it all adds to the experience. Highly recommend for good service, good food and a nice place to be. Also, a ton of food for the price. Especially for New York. Worth the visit.", "author": "Theresa G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-01", "description": "I was in the area looking for a place to have breakfast, and came across Clark's. If there is one thing and one thing only you should get here, it's the potato pancakes. They were to die for! I haven't had them like this anywhere else. They were battered and fried to perfection, and along with the hollandaise sauce, they made the perfect breakfast! The other dishes we ordered - chicken \u0026 eggs and eggs benedict - were delicious, too, but did not top the potato pancakes. The service was prompt and efficient, and I love the cozy atmosphere of their cafe. Not to mention, the view outside of the window was quite lovely. I will definitely be coming back when I'm in the NY area again!", "author": "Monica M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-12", "description": "The food was good. The place is extremely cold. The only reason for the three star is they talk about the customers when they leave in Spanish and not realize we understand everything they said..Why I would not go back.", "author": "Helen T."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-10", "description": "Used to love this place up until today. I placed an order on seamless for the eggs and salmon. Thank god I was looking at my food while eating it because a fly was cooked into my eggs. I am so disgusted. You can't really tell in the pictures but the wings are completely in the omelette so I know for a fact this bug flew in while the eggs were being cooked.", "author": "Rachel K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-01-21", "description": "Service is what is most lacking, food was terrible my pancakes were a burnt, coffee seems to be instant. I had to ask several times for the check and even beg for getting charged. Make yourself a favor and skip this place.", "author": "Víctor S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-06", "description": "My boyfriend and I came here for brunch on Saturday before going to a nearby cafe to study. We got here around 1:00pm and it was crowded. The restaurant already has Christmas decorations up making it feel super cozy and festive. We had to wait a few minutes before getting seated.\nMy boyfriend ordered the big breakfast which included a choice of pancakes, french toast, or Belgium waffles. He went with the French Toast. It came with eggs, bacon, ham and sausage. I ordered the avocado and egg sandwich on brioche bun. \nI think the star of this brunch was the sausage. It was so savory and delicious. I definitely suggest getting that. The breakfast sandwich was good but nothing special. It wasn't super flavorful like the big breakfast. I recommend coming here for breakfast or brunch. One star off though because like what other people mentioned we did feel rush near the end. The waiter came around dropping off checks before people were finished. I hope they stop doing that. I understand it gets crowded and they want to rush people but by the time we were eating it was getting empty so there was no real reason to rush us. Aside from that food is good!", "author": "Siyun Z."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-01-09", "description": "This place feels homey, I like the neighborhood feel. Unfortunately we came here for breakfast last Saturday morning, and I had the worst BEC sandwich I've ever had. \n\nService here was fast, efficient. Menu was standard as this is a diner. I got becon egg cheese sandwich on brioche, and the husband got eggs over and easy. Our waiter took our order, then came back 2min later to confirm. Then when the BEC sandwich showed up in front of me, there's not one trace of cheese. How do you come back to double check the order and still got it wrong?! Then I took one bite at the brioche and had to spit out, it was BONE DRY. Like to the point how dare you call it brioche. The egg inside was completely overcooked and not seasoned at all. This whole thing was the worst BEC sandwich I've had at any restaurants/diner/food stand. \n\nIn addition to the bad food, the whole breakfast felt really rushed. It's not somewhere you go to sit and relax and spend 2 hours. They probably will never allow that to happen. So try at your own risk.", "author": "Lu H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-12", "description": "My wife and I stumbled upon Clark's recently after visiting a friend who lives nearby in Brooklyn, and we had a great time. It was packed during the day though we got a seat right away in a cute corner window booth. It was loud and lively inside, and service a wee on the slow side. My wife got chicken and waffles, and I had a patty melt with fries. Great portion size and my wife loved her dish. The patty melt was hearty and tasty, the slaw on the side was forgettable, but the pickle was a perfect added touch. BUT. I was pretty disappointed they did not use rye bread, which is disconcerting as a patty melt purist. Though, I still had to order it because it was my first New York patty melt. But really, why don't you use rye bread on your patty melt, Clark's?", "author": "Alan D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-20", "description": "This place is underrated. We had a great breakfast here. The specials come with coffee and the cutest little fresh squeezed oj for a very reasonable price. Looking for a great breakfast place? Look no further!", "author": "Yvette R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-23", "description": "The more accurate rating would be 3.5 stars.  I have been here frequently and it's my go to Diner in Brooklyn Heights. The eggs Benedict is good, even the BLT hits the spot!   They have no laptop policy which can be inconvenient but food wise you shouldn't be disappointed.", "author": "Gilbert P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-09", "description": "Clark's\nNY BK \n1pm Saturday 6th November 2016\nFour Stars\n\nAfter a long rock climbing session at Dumbo Boulders, we opted to avoid the DUMBO pizza/shake shack crowd and walked up to Clark Street for some diner food.  It had 10 minute wait but it was worth it.  I couldn't decide on what to eat: Benedict, French Toast, or Yankee Pot Roast. I went w/ Coffee \u0026 the Fully Loaded Belgian Waffle: Two Over Easy Eggs, Ham, Sausage, and Bacon. I ordered a side of potatoes but it never came.  The waffle was decent but dry.  You can purchase real maple syrup for an extra $1. The eggs were done right. The Sausages were fat and delicious. The Bacon was crispy.  I couldn't ask for anything more.", "author": "Leonard L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-15", "description": "The absolute best restaurant in Brooklyn Heights!\n\nLove their French toast for brunch it is fantastic and so filling! Keeps me full for hours. I love the sugar free syrup option!\n\nTheir sandwiches for lunch are also great, very fresh and the fries are great as well.\nSome dishes are a little pricey but definitely worth it! \nI keep coming back with friends.", "author": "Alex O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-30", "description": "A great go-to diner for the area for breakfast, lunch or dinner. They do close earlier than you'd expect (9pm I think) but that may be on par with the neighborhood. Service is always super fast and professional. They're also great for delivery, especially for the weekends you don't feel like doing anything but sit on your couch. I love the Clarks wrap! And the orange juice is so worth it- super fresh!", "author": "Kathleen W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-10", "description": "Best food, service and price!  Food was amazing and delicious.! The 5 of us got seated within 5 minutes on a Sunday morning.  We all ordered different food and it was all delicious!  Service was top notch.  Definitely are going back this morning!  We are visiting the area but it is a must go to place.", "author": "Amy P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-03", "description": "Came here on a busy holiday Monday around 12pm and there was a long line almost out the door but luckily it went by pretty quickly. Probably waited only 10-15 min. for a table for 2. \n\nI ordered the Clark's poached egg with avocado on potato hash. It was delicious. I love egg, avocados and potatoes by themselves so having them all in 1 dish is fantastic. Totally prefer the potato hash as a base rather than a standard English muffin. It also comes with a stack of bacon which is awesome cuz I love bacon. It was a very filling plate.\n\nBf had the big breakfast with waffle. It comes with sausage, bacon, 2 eggs, and ham. He said the ham was one of the best breakfast hams he's ever eaten at a restaurant because it wasn't overly salty and it tasted just right.", "author": "Ada W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-07", "description": "They have the best orange juice seriously !  Plus the food is delicious too. A cozy little place", "author": "Amanda B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-28", "description": "After a late night following a concert, my sister and I were looking for a satisfying breakfast at 10 am on a rainy Sunday in January and found this little spot in Brooklyn Heights about a 5-10 minute walk from our hotel near the Brooklyn Bridge. We immediately fell in love with the brick building itself in a beautiful neighborhood that fit right in with its classic interior that was as sweet as the attentive staff who were just awesome. Quick service, ample portions and a warm, comfortable environment great for viewing the surrounding neighborhood and people watching. Love this place!", "author": "Emily H."}], "servesCuisine": "Diners", "priceRange": "$11-30", "name": "Clark’s Restaurant", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "80 Clark St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/_1T55JW7JQ-s8XZ_tOtNfg/ls.jpg", "@type": "Restaurant", "telephone": "+17188555484"}