{"aggregateRating": {"reviewCount": 390, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-07", "description": "I live in NYC.  However my dentist is near Clark's.  I always go to Clark's  and it makes going to the dentist more pleasurable. Without a doubt Clark's is the best diner I have gone to and is heads above the wide selection in NYC. The staff is professional, pleasant and very attentive. The decor is a step above most diners.  The food is plentiful, well presented and quite tasty.  I had a steak sandwich tonight that was the best I've ever had. Their ice coffee is very good and not diluted by too much ice. Obviously I am quite a fan.  Give it a try if you're in the neighborhood.", "author": "Pat R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-02-14", "description": "This is your typical run of the mill diner.  Probably only diner you are going to find in the area.  I was craving some breakfast for dinner and they certainly delivered, albeit the waiter didn't write down any orders for a table of 8.  I ordered waffles with strawberries and pancakes and only got the waffles.  The waffles were delicious. I usually don't go for whipped cream, but they were excellent paired with the strawberries.  When I let the waiter know he forgot the pancakes, he was very apologetic, which was very nice.  Otherwise I had a good time.  I was able to get a table as soon as I walked in, so that was nice.", "author": "Thomas F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-12", "description": "One of my go-to restaurants in Downtown Brooklyn. The staff is friendly and the food is what you expect. It's a classic diner with a tastier flare. I really love their breakfast items, like the omelets and eggs Benedict. It's not ridiculously priced either.", "author": "Eric L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-17", "description": "I've been going to Clark's for 14 years and it's still the best diner in Brooklyn Heights.  The place isn't very big so if you want breakfast on Saturday and Sunday - expect a wait and to be seated real close to the next party.  But the food is fresh and the service is fast and courteous.  I recommend the french toast - sweet cinnamon tasting goodness.", "author": "Clarissa H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-03-09", "description": "Best Diner in the Heights without question.\n\nIm here at least a couple times a month. Great for breakfast, brunch, lunch. Typical diner menu, but above average quality.\n\nIf you're in the mood for a diner the only downsides are that it is not 24 hrs, and I think they're closed Sundays.", "author": "Geoff C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-15", "description": "I love this restaurant ! The waiters are very nice! We all had pancakes and they were delicious! If you plan on having the banana and chocolate chips pancakes, don't eat before because they're enormous!", "author": "Lucie C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-28", "description": "Looking for that hometown diner food that every 5 star restaurant wishes they could compete with? This is the place that you need to try. I have tried several different types of omelets, burgers, and the sausage egg and cheese breakfast sandwich. They are all delicious, but the breakfast food is the best. They give you a mini shot of freshly squeezed orange juice with your breakfast...let's just say you'll be ordering a large one later. This place is amazing, affordable, and family owned. What is there not to like?", "author": "Robyn S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2008-10-09", "description": "This is an odd little restaurant. I'd love to point out that for my table we had two menus, one saying it started in 1987 and the other said 1897. It created a hilarious conversation.\n\nAnyway, food variety is incredible, everything you can imagine that falls within the realm of american, italian and contemporary food. Price was reasonable and food was good, nothing spectacular though.\n\nThe atmosphere is so-so, a lot of college students go there in big groups which can be obnoxious. Certainly not a first date location. But it is a great place to sit and people watch, love the big windows.", "author": "Darren G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-09-07", "description": "Stopped by to get some breakfast to go. Didn't notice any prices on the breakfast menu, but ordered a wrap and a large coffee. $12.95. Ouch. Wrap was good, but had a slice of tomato, a slice of cheese, maybe two pieces of bacon, and I guess there were some egg whites in there. It was very tasty, but again, $9.95? Coffee was fine. People working there seemed nice, but I'll never come back here for breakfast, at that price, again.", "author": "Samantha G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-04-28", "description": "Let me start off by saying the lentil soup was like molten lava and burned all of the taste buds from my mouth and tongue.  With that being said, the prices are decent and I had the chicken picata.  I think it needed a bit of salt but I couldnt tell because of the missing taste buds.  Overall not too bad, just your average place for a good meail.", "author": "Jeramy P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-27", "description": "Love this restaurant.  I don't mind that it's a tad bit pricey because the food is great.  Very friendly staff!", "author": "Precious J."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-08-22", "description": "Pretty standard diner fare. Nothing wrong with Clark's.\n\nThey have a Grilled Cheese section of the menu, but they are not particularly crisp, delicious grilled cheese sandwiches. \n\nIt's kind of like Domino's having lots of toppings options.", "author": "Steve M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-08-29", "description": "ordered oatmeal at 10:10am. they called an hour later to tell me they didnt have oatmeal. last time ill order from them. foods not that good anyway.", "author": "Ripov V."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-08-01", "description": "I like a lot about this place. Service was very slow but friendly. The food was delicious and so was the wine. The salad was a nice size but for some reason I was still really hungry after my entrée. I ended up ordering another appetizer. I will definitely come again but I will eat a little first :)", "author": "Philip E."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-01-12", "description": "Review is for Brunch only. Nothing amazing to report - the french toast was decent. Best thing about this place is the service. I swear they are telepathic, my food was on a rocket out of the kitchen. It was almost as if they knew what I was going to order.\n\nIf you are close - check it out. \nI'm not knocking it - this diner just wasn't my thing.", "author": "Erik C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-26", "description": "Without a doubt, the best delivery diner in the Brooklyn Heights / Downtown Brooklyn area. I love the poached eggs that everyone is talking about, but the patty melt is truly EXCEPTIONAL. I'm originally from Chicago and I've been dying for a decent patty melt ever since I moved here over ten years ago. I've tried all the overhyped ones in town, and this one's my favorite.", "author": "Daniella S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-11-17", "description": "Is a nice All American joint nothing WOW!! But i'll give it a 3.5 out of 5.. Had brfkast omelette. Cappuccino portion was too little..  You can try it but dont get high expectations", "author": "Luis E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-24", "description": "Great place for a Sunday Brunch! The food is great and the portions are big! The environment is cozy and welcoming! There is a small line if you are in a bigger group but it's worth it. It's only few blocks from Bertollini bridge park and very close to the train station. I have been there twice and I am definitely coming back!", "author": "Sara R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-17", "description": "Great family-owned NY-style diner. Always a solid for any meal of the day. I live blocks away and go there at least 2-3 times per week. Won't break the bank, but will fill you up! \nAlso, lovely and bright in the morning as sun pours through the wall of windows.", "author": "Caroline Q."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-08-10", "description": "We got a seat immediately for Sunday brunch, which was nice. My banana walnut pancakes weren't very tasty. My friends had waffles, but they'd already run out of strawberries by 11:15 am! Unacceptable. Service was quick at first but he never checked on us. I've heard it's worth a second try but there are so many other places in BK I'd try first", "author": "Camara W."}], "servesCuisine": "Diners", "priceRange": "$11-30", "name": "Clark’s Restaurant", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "80 Clark St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/_1T55JW7JQ-s8XZ_tOtNfg/ls.jpg", "@type": "Restaurant", "telephone": "+17188555484"}