{"aggregateRating": {"reviewCount": 390, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-10", "description": "I read the reviews, but still wanted to see for myself.\nI came in for a late breakfast after my doctor's appointment in the area.\nStaff were all friendly, efficient and dedicated. Owner was front and present.\nI ordered the potato pancake/benedict with avocado, perfectly-poached eggs and bacon.\nCoffee was good and fresh as was the OJ.\nPros-\nClean, quiet, quick, delicious, friendly, attentive, not rushed, hot food, good prices, good portions. basic, but also interesting menu.\nCons- Nothing at all! I'll definitely return and update my review.", "author": "Edward K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-20", "description": "Service is impeccable and the waiters are so friendly. Dinner prices are a little high, but breakfast is reasonable. They also have the BEST fresh squeezed orange juice. Coming from South FL, I haven't enjoyed a glass of OJ in NYC until I found Clark's and boy is it delicious!!", "author": "Jasmine B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-20", "description": "Wonderful service! They accommodated our large group of 19 and were super friendly. My iced coffee was delicious.", "author": "Nataly C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-10", "description": "Dining in at Clark's was an absolute dream! We were greeted by Miguel who took my husband and I's order. He was so kind and friendly. It was pretty cold outside so we both ordered hot chocolate, which was delicious! I ordered a Big Breakfast and my husband ordered two egg sandwiches. The food was delicious and the service was out of this world. My husband and I have dined out to many restaurants but this was the best service we've ever experienced. We enjoyed it so much that we even talked about making it a location we went to 1-2 times a week. Thank you Miguel for your extraordinary service and your genuine character! We truly appreciate all that you did during our first visit!", "author": "Christina S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-02", "description": "Always a pleasure. These folks know how to make customers feel at home. The food is just good old American diner food but well made.", "author": "James O."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-06-13", "description": "So the food here is pretty basic. I'm trying to figure out why it receives such high ratings *insert thinking face*\n\nPros: \nfood came out fast\nReminds me of Seinfeld \nYou can seat yourself\n\nCons:\nThat bathroom is about as wide as my hips...\nFood lacked flavor \n\nIt's really nothing to right home about. Honestly truly, I only stopped here because it was open early and I was in need of a restroom.", "author": "Marie H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-08-09", "description": "The food is 'ok'. I had the avocado, turkey bacon, cheese omelette. Best part of my meal was the mimosa. No real issues with the place, it's good. Nice atmosphere. Good place to people watch, the windows are big \u0026 there's lots of foot traffic outside​. I guess I just expected more than diner style food.", "author": "Tanisha F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-28", "description": "While visiting Brooklyn last week my wife and I chose Clark's because it was close to our hotel (Marriott B.B.). We loved everything about this place. The belgian waffle was crisp on the outside, and soft and fluffy on the inside. The sausage links had a plumb meaty texture with the right amount of spiciness. We will definitely be back. Thanks for a great breakfast.", "author": "James W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-06", "description": "I love this place. There's never a wait, the food is decent and the overall vibe is just chill. In truth the food here is fairly typical/classic 3-star diner fare. Nothing to write home about, just dependable solid fare. But when combined with the friendly Staff, spacious comfort, and overall ease of all my visits, it becomes a 4-star establishment. \n\nBreakfast all day is the way to go. Coffee is good. Fries are good. Fresh OJ is good. Omelettes are good. Life is good.", "author": "Susan D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-11", "description": "This restaurant was amazing/fantastic! My parents and I were walking the Brooklyn Bridge, realized we hadn't had breakfast and decided to look on Yelp for a nearby restaurant. What a find!\n\nThe service was amazing, staff were friendly and efficient. We got in within 15 minutes despite a long lineup. \n\nWill definitely come back.", "author": "Dallas H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-21", "description": "This our favorite place to eat breakfast in the Heights...although it's always packed it seems we are seated automatically. Come to Clark's Dinner and you'll thank me later:", "author": "Marcus V."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-21", "description": "Absolutely the worst service I've EVER had! Up until desert things were fine. Then, as we were getting it we discover a piece of hair. When I requested the meal to be taken away our\"sever\" simply said can I get you another. No apology to my claim of hair in my meal. Shortly after I decided that approach the desk as his response was unsatisfactory. Even then there was no apology. I asked could I speak with a manger, apparently our server was the manager that evening. He's stated \"that wasn't human hair\" as disgusted as anyone could be we left in that very moment. Stay far from here please!", "author": "Sean P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-13", "description": "Satisfied my protein habit; fast and delicious #defendingyourlife #dinerlife #ineedmyprotein Bustling atmosphere, love the sounds of clattering plates and chattering diners... Breakfast is a must, so glad we found this amazing diner...try to get a window seat.  I'll be back!", "author": "Maria T."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-02-17", "description": "I really disliked my order. The fried cod was over fried and bone dry. Not even the lemon wedges served enough justice to reintroduce any moisture into the fish. The \"chips\" were simple french fries. The presentation was boring. Nothing could ever convince me again to go there. The price was the scariest thing of all and an additional source of anguish. I regret eating there and won't recommend this place. However, the service was ok.", "author": "Juan Z."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-11-06", "description": "Place is a good last minute breakfast and sandwich joint. It's better if you live in the area and want something calm to eat. Service was okay, food was pretty good. Inside is cute. Wasn't my favorite place but I think I'll come back", "author": "Nancy K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-04", "description": "We chose Clarke's restaurant for its amazing reviews and we were not disappointed. Our server gave us great recommendations on what he favored and what combinations to make on our breakfast items, all of which were on point. I have to say they also served a great cup of coffee which can be hard to find.  \n\nOur server mentioned he's been with Clarke's for 21 years and how he really enjoys working there. To me that is a great reflection on the business which in turn shows in the great food they present.  \n\nWe try to frequent New York yearly and Clark's in Brooklyn is now on our list of \"must go back\" stops. Clarks is also really close to a subway stop and maybe a 10 min walk to the Brooklyn bridge which is a plus.", "author": "Maribel D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-26", "description": "It's a local favourite and landmark for a reason...\n\nGreat food with big menu, super fast and friendly service, and always busy - so come before 11 on weekends to get seated quickly. After 12pm the wait can be an hour or more. \n\nHaven't been here for dinner or during the week but I'm sure it's just as good. \n\nBrunch portions are big, and they have turkey bacon which is nice. I usually get the clark's poached eggs with hass avocado - and I end up confusing the waiters when I ask for florentine (spinach and feta) on top of that, but it's too damn good to not ask for. Hollandaise sauce isn't too lemony. Highly recommend it. \n\nCoffee is hot, fresh and tasty - and they keep it coming! \n\nTheir big breakfast will definitely fill you up too, and comes with a small sipping glass freshly squeezed OJ - refreshing. \n\nPrices are great too - about $40 for two including tax and tip, and that's with the pricier entrees and additions.", "author": "Fareed K."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-01-13", "description": "Ordered clark's wrap (aka breakfast wrap) and salmon eggs benedict. In overall, this place isn't like omg this is great breakfast. Mediocre. Country potatoes seemed like they used yesterday's batch. With the price, the amount of food seems small. Avocado in the wrap tasted very old too. I could clearly see an old avocado inside that was exposed in the oxygen for a long time. Dont eat here if you expect an awesome fancy breakfast.", "author": "Naomi C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-03", "description": "The pancakes and eggs Benedict are both phenomenal. The service is a little slow but friendly. Prices are what you'd expect in Brooklyn. All in all a very fun neighborhood restaurant and enjoyable experience.", "author": "Barnabas P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-10-25", "description": "Food was decent for lunch, waiters were reasonably accommodating for NY, but they charged $3.00 for a small glass of Ice tea and then wanted to charge the same for a refill. The tea probably cost them about 2 cents, yet they are willing to lose customers rather than provide a refill. Won't go back.", "author": "Michael W."}], "servesCuisine": "Diners", "priceRange": "$11-30", "name": "Clark’s Restaurant", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "80 Clark St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/_1T55JW7JQ-s8XZ_tOtNfg/ls.jpg", "@type": "Restaurant", "telephone": "+17188555484"}