{"aggregateRating": {"reviewCount": 390, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-10-07", "description": "We stopped in here for brunch at 9:30am on a Sunday. This place has great reviews and we were excited to check it out. The restaurant was pretty busy and there were a fair number of people waiting for a table... We were told that there wasn't a list but people were seated ad hoc as tables became available... I don't mind waiting for a table but the whole seating process looked like a complete cluster ####.\n\nWe immediately left.. I'd consider trying them again if they are less busy or if they more organized about seating.", "author": "Ann L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-15", "description": "We love this place. The service is great -- they called us senoritas, too cute! \n\nI had the Western Egg Sandwich with Cheese and my friend had the Turkey Avocado and Tomato Omelette with Rye Toast and Hash Browns. The Egg Sandwich was a bargain and very filling for the price, assuming you aren't incredibly hungry and dying for a buffet. My friend couldn't finish her omelette but the avocado twist was creamy and a nice twist to a classic omelette. \n\nAfter a month here, this place really isn't so pricey as long as you know how to order. ;)", "author": "Judy S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-09-18", "description": "For there delivery service. \n\nThe girl who answers the phone will not give you a total. Instead she says she will call you back and give it to you. Which she never does. Also they do not get the orders correct. Often delivering incomplete meals. So although I like eating in the restaurant I am VERY DISAPPOINTED with there delivery service.", "author": "Cecilia C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-14", "description": "Convenient location near the subway. Went there for breakfast. The service was friendly and attentive. The food was alright and the prices were good.", "author": "Ross K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-22", "description": "Service here is A+ and so is their freshly squeezed orange juice. Seriously.. their orange juice is the bees knees. We walked in on a busy Saturday morning, and we were quickly ushered in.. this place is run like a well oiled machine. We sat down, ordered and first got presented 2 free small glasses of orange juice... that got me going because it was soo good I had to get another full glass. We got our food in 5 minutes and it was piping hot fresh! Portions were large and in charge... and delicious. I really enjoyed their bacon and french toast (yum). While we ate I noticed the owner, an older gentleman pacing down the booths talking to all his patrons (how awesome is that??) He asked me how I was doing and that was an A+ in my book... I almost felt like the owner was building a community within his diner, this type of feeling is disappearing throughout America... so please come in if you are wanting a great breakfast and great service! \nI'm not gonna lie at first I was apprehensive about even coming in at first, just because the reviews weren't so great, but I'm glad my hungry stomach told the food snob within otherwise.", "author": "Eleana H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-27", "description": "Good price and good food. Breakfast or brunch  Big dishes with a lot of food. Love that! They are fast and efficient! Love the french toast and waffles!", "author": "Alexis R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-20", "description": "One of my favorite diners! The staff is friendly and quite speedy! The food is always on point and excellent. \n\nThere is a $10 minimum when paying with cards, just a heads up. But usually isn't a problem. \n\nI personally recommend the Clark's breakfast wrap! It's always great and filling believe it or not!", "author": "Michael G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-06-23", "description": "Cute place with average food and terrible service on the day we visited.  Server ignored us as we came in--as in we asked her a question, she looked at us, and she turned around and looked at her phone.  I'm not sure if it was a one-off and she was just having a bad day, or she hated her job.  She brought our table another table's food and wouldn't clear it (after we asked) until she went figure out what went wrong.  Even then, I didn't get what I ordered because she wasn't listening.  Seriously, I have no idea what was up with that but it was unnecessary.  \n\nFood was okay, not great--a bit low on value for the price.  Turkey club was way, way too much turkey balled up in there.  Mozzarella sticks were good.  Ham, avocado, and cheddar omelet (not what I ordered) had the most unnaturally green avocado I've ever seen and a ton of it.  Chicken noodle soup had been sitting long enough the noodles were mush by lunch.  About what I would expect for a roadside diner, except this place doesn't seem to want to be a roadside diner.", "author": "Patrick C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-06-01", "description": "I'm giving this restaurant three stars because of the incredible first experience I had. The service was great and food was amazing. However, by the third time I came here, service slacked and the food was minimized in a smaller portion. Their new menu deleted a side choice of soup or salad and that was rather upsetting because the prices were already high. The waiter also gotta friend's order wrong and instead of apologizing, he said \"no, this is what you said..\" before beginning to whip out his notepad as proof. *sigh* I still want to come back.. I just hope things change around here", "author": "Ayumi K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-04-28", "description": "Awful service. Didn't get to try the food because we left after many attempts to get someone to address us.", "author": "Jenn G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-01", "description": "This place is a gem. All you new to Brooklyn hipsters that bag on this place have no idea. This is the last of the real diners, when places like this go away you will be stuck with Panera bread and Le Pain Quotidian.\n\nIt is the 3.5 rating for clarks that causes me to sometimes not trust yelp. Victor is an institution plain and simple. Im not even going to address anything to do with food because I'm done defending this place to a bunch of ungrateful fake Brooklyn residents.", "author": "James J."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-04-23", "description": "Rice pudding is good again.  The prices are high for a diner but the food taste fine.", "author": "Corey B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-05-19", "description": "The food wasn't great but it wasn't that bad either. I don't know if its cause I went at 3 but service was slow. I had to call the waiter in order to get service but it's fine. A little too pricey for my liking.", "author": "Diana T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-15", "description": "Any place that offers fresh squeeze OJ gets my vote !\nGreat eggs benedict \u0026 awesome French Toast.\n\nToo bad the crow noise drown out the classical music.", "author": "David W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-13", "description": "Great coffee, service, and food. I got the avocado poached eggs and my date got the avocado, eggs, \u0026 cheese on the brioche roll. Fairly priced and good sized portions. Will come back soon", "author": "Courtney M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-07-31", "description": "Wow - Haven't had service this bad in a while. Once you're seated, they forget you exist. I asked for more water three times. When I stood up, the server then came over and refilled. At that point I asked for the check. No reply, and he brought it over a few moments later, slammed it down on the table and walked away, with zero words. (An apology maybe? Or thank you?) The food wasn't bad, but nothing rising above decent diner food. People seem to like the potato pancakes, but mine were overly greasy on the inside and rock-hard on the outside. But the poached eggs, bacon, and avocado were quite good.\nIf the food had been lousy to mediocre but with good service, I would have still left happy. There is something about getting treated lousy when you're out to eat that leaves a bad taste (pardon a bad pun.) I will never go back, which is too bad, since I live in the neighborhood and the options are slim.", "author": "John M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-11", "description": "Great breakfast spot. start it off with coffee that has some real flavor, and treat yourself to the brioche french toast which was amazing. Nice little restaurant in a great little part of town. will definitely be back.", "author": "Grant S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-29", "description": "This place was recommended by friends and it sure didn't disappoint!! Fabulous food, reasonably priced. They have a nice selection of foods to choose from, something for everyone. I started off with the Yankee bean soup which had a nice flavor, thick broth with white beans and veggies, made from scratch. I then moved on to the salad, mixed greens with homemade vinaigrette dressing. For my main course I had baked meatloaf, mashed potatoes, and carrots. The meatloaf came on its own plate topped with brown gravy with mushrooms. Everything about it was good!! The portions are very generous, everything is fresh and made right there on site. I went home with enough food for another meal which I am already looking forward to eating! Great coffee. The staff there is phenomenal, very friendly and personable.", "author": "Tabitha P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-26", "description": "Great staff, great food, great service. I stop by here any time of the day. I've ordered the corn beef hash, french toast, and wings and they're all delicious. \n\nThis has turned into a favorite brunch spot. On the weekdays, it isn't very crowded. I can't speak for the weekends though.", "author": "Kurt D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-13", "description": "The place was packed, but we got here right on time because we got a seat as soon as we walked in. The service was great, our food probably came in 10 minutes. The food was pretty good. I wasn't blown away, but at the same time I wasn't disappointed. I got the Big Breakfast which included a Belgian waffle, two eggs, ham, bacon, and sausage. I really appreciated the portion sizes. I felt like I got my money's worth.", "author": "Bashard B."}], "servesCuisine": "Diners", "priceRange": "$11-30", "name": "Clark’s Restaurant", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "80 Clark St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/_1T55JW7JQ-s8XZ_tOtNfg/ls.jpg", "@type": "Restaurant", "telephone": "+17188555484"}