{"aggregateRating": {"reviewCount": 390, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-02-27", "description": "Don't know what the hype over this place is. Food is mediocre at best. Everything was kind of bland. Waitress was the worst.  Terrible attitude. Girlfriend wasn't hungry but they made her order something off the menu or be charged $6 eventhough I ate $25 worth of food myself. Don't waste your time here.", "author": "Robin W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-17", "description": "Very good brunch spot.\n\nHoney fried chicken and waffles are delicious. Orange juice is delicious. \n\nTable seating can be odd from big groups.", "author": "Mr. S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-07", "description": "Pretty extensive menu and the food was great. $7 for two mimosas, perfect. Also the food came out like 5min after I ordered it, impressive!", "author": "Mekela M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-20", "description": "So amazing, brunch/breakfast is so amazing here. Everything you could ever want in every dish. Always get the poached eggs with avocados. The avocados are always amazingly fresh. The potato pancakes make everything special!! The menu is so big anyone can enjoy something at Clarks. There is usually a wait but it is worth it, they turn around the tables quickly.", "author": "Alisa L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-02-02", "description": "Customer service was sub par. The staff was unhelpful, rude, and on their cell phone. We ordered two mochas as an evening coffee and they were quite watered down.", "author": "Kaitlin S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-11", "description": "Great food.  My Monte Cristo sandwich was very hot and fresh turkey and ham.  Service was slow and sitting was cramp, but food was good.", "author": "mi T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-29", "description": "Stopped there on a Saturday for brunch and of all the dinners I've been to in NYC, this one has to be the best. I don't often write reviews, but this place stood out so I feel like I gotta let other yelpers know.\n\nThe pancakes were extremely light and fluffy, the french toast was just perfection:  lightly browned yet melted in my mouth, and the waffle was crispy and easily the best I've had in a long while. Scrambled eggs were delightful and the sausage was cooked just right. \nAnd of course, it was cheap.\n\nService was good, waiter was friendly and food came out quickly.\n\nWould recommend if you feel like dinner food!", "author": "Alex C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-07", "description": "Best diner in the Heights! There is a reason it is so crowded at brunch! Food rises above dinner level and the longstanding staff add to the neighborhood vibe. Never a bad meal. Happily eating here regularly for 15± years.", "author": "Lisa S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-17", "description": "Simple yet tasty food with great service and at a good price. Would definitely go back when in the neighborhood.", "author": "Rob T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-27", "description": "Been here twice. The first time I was lucky and made the good choice of getting the famous eggs with avocados, potato pancakes, and  Hollandaise sauce. It was a meal to remember. They also have amazing orange juice. The second time I went, I made the mistake of ordering something else, and it was blah. It is a very quaint place with great people watching, so I'll be going back.", "author": "Lizzy G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-21", "description": "After walking across the Brooklyn Bridge in true tourist style, we all were in dire need of water and lunch.  I looked up on yelp where to go and it did not let me down.  Our lunches were delicious.  It is kind of weird that you can't order a wrap before 3pm on weekends.  I really don't get that.  But so I got the eggplant triple decker sandwich.  I also got a Diet Coke and it's a little foreign to me to be handed a can.  My sandwich was delightful.  My boyfriend ordered french toast which he also enjoyed.   And then he enjoyed my french fries.  Our friends got sweet potato fries and they were a little too brown for my taste.  Looked almost burnt.  \n\nAll of us really enjoyed this place.  It wasn't too crowded at 2:30pm but it was busy enough that I can tell it's a local favorite.  Glad yelp shared it with me!", "author": "Jess K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-18", "description": "Swift service and a myriad of options, I've been coming here for over a year and will continue to do so. \n\nI've devoured their waffles, drooled over the Monte Cristo, skiaffed the apple pie and every burger they've had to offer. \n\nYou can't go wrong at Clark's.", "author": "Emily G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-11-08", "description": "Wtf. I have no idea why anyone would give this place a good review. It's bad diner food. For the love of pete, don't come here unless you have to.", "author": "Travis M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-16", "description": "It is what it is...This place is a nice diner, and they do breakfast the best. Then lunch. I wouldn't recommend ordering dinner items. It's hard to mess up breakfast foods. The beligian waffle with strawberries and cream is HUGE! They do an okay caffe latte and serve a small square of chocolate with it. I love the omelets and various eggs benedict dishes. Their salads are HUGE and I especially like the Steak Salad. Their fries are perfect for me, straight thin, crispy, hot, and flavorful! Their sandwiches are ok, especially grilled cheese with ago and tomato. The service is great and the owners are awesome! My grandpa is a weekly regular and has been for the past 20 or so years - and they treat him so well and bring his drink and appetizer to the table before he orders! This place is ALWAYS busy! But never have to wait too long to get a seat or food!\n\nAlways see all ages, especially kiddies, during lunch. The front entrance seating is called 'kindergarten' affectionately by the waiters. They are very accommodating of large groups as well, even in heavy traffic times!\n\nFood-wise, it's not bad, and it's not OMG amazing!\nService - excellent, stable waiters and ALL men! Never seen a woman waitress! The only woman is the owner's wife who works the til! Fast service to table and food!\nAmbience--a very clean, slightly upscale diner.\nPrices--I think they are a bit pricey for a diner, but it is Brooklyn Heights, they are clean, reliable, fast, always busy, and they've been on that corner for years says something!!! \n\nPS-Oh, you can pay with a CARD! That says it all for all these new restaurants! I LOVE paying with card!", "author": "Jaclyn M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-05", "description": "Breakfast was a bit of a wait, but a fantastic place.\n\nHad the \"Big Breakfast\" with waffles, which was all delicious.\n\nThe waitstaff were fairly miserable, but the host was very pleasant.", "author": "Christopher B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-02", "description": "Oh Clarks! I travel from the Bronx for you! I lived across the street and once in a while, I make the trip for brunch. Their eggs Benedict are heavenly and manager super friendly. Very crowded place but food makes up for any negative.", "author": "D S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-09-01", "description": "Good diner and always open but get here early on weekends !\nMark is the owner ad very nice guy.", "author": "Bella B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-08-23", "description": "Went for the first time yesterday with my mom and boyfriend. Had high hopes based on the reviews but was seriously disappointed. I ordered the avocado Benedict, boyfriend ordered the omelette \u0026 waffle, mom ordered the open faced pastrami sandwich. The pastrami tasted like fake pastrami and disgusting. The only thing good was the waffle. Even the waitress noticed my mom's pastrami wasn't eaten and after she told her it wasn't good, we still had to pay for it. Will not go back.", "author": "Leslie W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-27", "description": "This place is a step above diner food. I mean that as a compliment since it's a diner. I have had many breakfasts here either at clark's or delivery. Solid food and good portions.  I suggest any egg platter with home fries and their club sandwiches are great as well.", "author": "Daniela L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-17", "description": "Honest to goodness the best diner in Brooklyn. Coffee is amazing and the food is fresh. Staff is great. Ambience is classic New York.", "author": "Annette C."}], "servesCuisine": "Diners", "priceRange": "$11-30", "name": "Clark’s Restaurant", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "80 Clark St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/_1T55JW7JQ-s8XZ_tOtNfg/ls.jpg", "@type": "Restaurant", "telephone": "+17188555484"}