{"aggregateRating": {"reviewCount": 390, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-19", "description": "As far as diners (or as we used to say \"luncheonettes\" or \"coffee shops\") are concerned Clark's is at or near the top in NYC.  To encapsulate:\n\n* Fresh, tasty breakfast and sandwiches\n* Quick, friendly service\n* Classical music in the background (not too loud)\n* Very clean\n*Nice street views, and...\n* It's a tradition in the Heights!", "author": "perry w."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-02-13", "description": "This \"blast from the past\" comes with a side of prejudice, and downright viciousness.  This is the first negative review I've ever felt I needed to write -- but Clark's is (quite deliberately) responsible for one of the sadder moments I can remember in New York:\n\nI've come to Clark's most weeks for years, sometimes three times per week.  Yesterday, I came in about 10:45, ordered a coffee and a bagel, waited for a friend.   When he came -- a Hasidic guy, in traditional Jewish clothing -- he ordered a coffee.  They brought the check without bringing his coffee, though we hadn't said we were leaving.  It was under the $10 minimum -- something like $7. I left $13 (and we asked again for the second coffee).\n\nIt was about 12:30.  The owner/manager comes back (immediately enraged, no diplomacy, no attempt to speak to us as people), shouting \"you've been here since nine in the morning.\"  He ignored me every time I asked him why he would say that, so deliberately, so confidently, when he saw me come in just before 11.  He tells us my friend needs to order more.  I say that he keeps kosher, and that's all he can eat. The man says: \"Then this isn't the place for you.\"\n\nHe said: \"you are an embarrassment.\" (Because I left a 100% tip on a small bill? Or because of our ethnicities -- mine far more \"passing\", my friend's far more obvious?) \n\nI should say: the place was 2/3 empty the entire time we were there, perhaps half-full at the max. \n\nThis place is an embarrassment.  A place that hides old fashioned racism under the more fashionable prejudice, that a person is only \"worth\" what they spend on a given day.  Sure, they forgot how much I really have given them, how often I've eaten their stale toast and cold potatoes and cardboard eggs just to be in blast-from-the-past New York.  Seems like they're stuck farther in the past than I ever knew -- and I'll never be back.", "author": "Adam V."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-01-19", "description": "These folks have a lot to work on... aside from the waiter that was completely rude when asked simple questions like 'what's in this?': \"vegetables\" or 'what kind of toast does it come with?': \"toast.\", the fries came out cold with my friends veggie burger. When she let the staff know they were cold and if it were possible to get fresh ones the staff took her plate, and put the entire plate in the microwave -- fries, veggie burger, tomatoes, lettuce, and all...\n\nUhhh okay. Great. Thanks. \n\nIt's hard enough for a place of business to deal with a yelp review where the reviewer didn't even give the business a chance to resolve the situation and make it right. Here, the opportunity to rise up was presented and instead fell flat on the floor. \n\nP.s.. just got the check back. The busser was actually the most pleasant and efficient of the staff.", "author": "Leo I."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-12-11", "description": "What a blast-from-the-past Brooklyn Heights staple! You have your old school look and feel diner, a giant menu where it's hard to even make a food choice, and speedy waiters dancing around trying to serve you up quickly so they can turn the tables and bring in more dining guests. After all, the place is small, and they gotta make a buck or two.\n\nThis diner is a bit on the pricey side, but that is to be expected since it is located on prime historic real estate in Brooklyn Heights. But, thankfully, the food makes up for the price sting. \n\nRecommendations: If you are in for brekky,  try the beef sausage, egg, and cheese on a bagel. Spot on when you douse it with a bit of deli mustard. As for lunch, I'm a fan of their gyro! It hits the spot. \n\nI've actually never been to Clark's for dinner, but I hear it pretty good (and portioned well).\n\nStop in this place if you are nearby. You will surely leave with a smile.", "author": "Scott B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-05-13", "description": "This might be the worst diner in Brooklyn set up to look the best. The food was rancid, the service was so so, and they forced an old lady nearby to leave after she pulled out her iPad because of their no computer policy.", "author": "Joe P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-22", "description": "Came for breakfast on a saturday and was very happy with our choice. There was no wait and the service was very quick. We both ordered omelettes which were huge! They came with hashbrowns and toast and we got coffee which was endless. We also decided to order orange juice. For some reason it was by far the best oj I've ever had. It definitely tasted freshly squeezed. \nMost importantly, the prices were reasonable and the menu is huge. There are so many choices to please everyone.", "author": "Krystin P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-06", "description": "Really solid, diner style bunch place. There is a nice vibe to it, with a bright airy interior and a really clean feel. They have a corner location on the block so there's a great, brightly lit corner space with double glass that is great for morning brunch. The menu is massive with extensive options, and weekend brunch also has regular lunch options. Very busy for brunch.\n\nService is not exceptionally friendly but it is quick and efficient. Waters are constantly filled and the wait isn't very long for seats even though it' is very busy. Coffee refills were a little slow and required some flagging. Although service was great we were not sure who our server actually was since there was so many different people running around. Not really a family diner vibe but gets the job done.\n\nThey are listed as having \"Mediterranean\" inspiration although all we saw outside of some tzatziki as a side. Most of the options are very American fare, with some interesting takes. They have a huge omelette menu.  \n\nThey have latke as an option for eggs benedict which was really unique. The latkes weren't really potato pancakes as much as deep fry fritters - very very crispy and a little greasy. The eggs were poached with a congealed (not runny) yolks. Very delicious and filling for a comfort food brunch.\n\nVery solid location to get the brunch fix, and the large menu definitely has an option for everyone.", "author": "Pam C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-05-19", "description": "The soups and salads are good.  And they have a wide selection of BLTs.    The waiters can be a little abrupt but are friendly if you come around more than once.", "author": "J M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-20", "description": "This place has yummy food. What else can I say? As you can see from my photos there really aren't any bells and whistles at this place- no fancy garnish on your plate lol. You order a sandwich wrap- here's your sandwich wrap , no frills here. But what you do get is so really damn good food! And lots of it. Service is quick and prices are reasonable. This is a great little diner. I highly recommend it.", "author": "Rebecca A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-01-13", "description": "It's a diner. What else can I say? It gets crowded at brunch, but they move the line fast.\n\nAnd the fries are good. Ok, it's a good diner. \n\nSorry, not my most \"elite\" review (see what I did there?), but it's a diner. Go, enjoy and have fun!", "author": "Nick M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-03", "description": "Breakfast is great, service is great and coffee served hot! Eggs always taste fresh and there are many omelette combos (even with avocado )!!", "author": "Melanie O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-20", "description": "Love, love, loves this place. I was at a conference and another attendee suggested. I am so glad I got a chance to make it. The hostess seemed to know a lot of the guests which seemed like a good sign to me. He remembered people from the last time and asked where the rest of their party was and etc. His memory really surprised me.\n\nThe restaurant serves food all day and of course I ordered breakfast. The food was delicious. I got something quick because I was in a hurry. I ordered chocolate chip pancakes, turkey bacon md hot chocolate. The hot chocolate was delicious especially the whipped creme.\n\nThe service was quick and friendly. It is a tight squeeze so I wouldn't suggest larger parties then ten but I did see a large party and they made it work.", "author": "RaSheba J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-12-17", "description": "Good solid diner in BK Heights. They have a pretty extensive menu with some more interesting choices than typical diner fare for lunch. The food is good, portions are ample, and service is very friendly, although sometimes inattentive if they are very busy. On the plus side, even when it's crowded, no one is rushing you along. If you are a carboholic like me, the potato salad and onion rings are both excellent.", "author": "Denise P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-12-16", "description": "This is a very cute diner in the beautiful Brooklyn Heights. I love the location, and it was decorated nicely inside as well. It's a typical diner for the most part - the service was fast and the prices were cheap. But it seemed a bit chaotic. For $10.50, they have a breakfast special of an omelet, coffee, juice, potatoes, and toast - it seems like a good deal! But the juice comes in the smallest glass I've ever seen, no one came around the refill my coffee, and the cheese in my omelet was definitely Kraft singles. \n\nOverall, it's not the worst place for a quick, cheap breakfast, but I've definitely had better, higher quality food.", "author": "Michael V."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-02-13", "description": "This diner is the lowest of the low.\nWhat's worse--bad food or racism?\nRacism!  But this diner gives you a choice.\nYou can have lousy eggs with a side of racism.  Or you can have racism for the main course.", "author": "nanine v."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-03-09", "description": "Love Clark's. It's a wonderful neighborhood diner. Visited more often when friends lived around the corner on Pineapple Street. Since they moved a couple years ago my visits have been less frequent. But this place is amazing. A wonderful variety of delicious menu items to choice from, good size portions, and fast friendly service. I highly recommend this place.", "author": "LJ M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-22", "description": "I was absolutely famished and this little place was across the street from me, so I decided to head in. Because of the location and the time I went( 2 pm) there was barely anyone there as everyone was at work, but there was a pleasant hum as people were talking. I prefer restaurants close to empty anyway, so it was a plus.\nI had the penne pesto with Chardonnay wine and everything was delicious. Service was great, and it was a rainy day but they have ceiling to floor windows so the outdoors is to your amusement. Check it out if you're ever in the area and need a bite to eat!\n\nEdit: I'm taking one star off because despite me waiting for a long while to pay \nAnd even motioning that I was done, the waiter did not come by me. If I was that type of person I could have walked out of the restaurant and not cared. I got the attention of another waiter who was friendly and flagged down the attention of my waiter. Otherwise. Lovely experience.", "author": "Jessica S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-03", "description": "What great service!\n\nPancakes were crumpet texture-yum! \nEgg sandwich was good.\n\nCappuccino came with a Hershey's kiss.\n\nSuper helpful and kind staff! \n\nCan't wait to come back someday!", "author": "Jordan U."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-17", "description": "This is a great diner!\nThe menu has pretty much anything you could be craving and everything I've tried from salads and hamburgers to smoothies and milkshakes has been delicious and satisfying.  Let's face it-for this new yorker, diner food is a craving that's supposed to make sick days and hung over saturdays all better and these guys deliver...literally. (sorry for the corny joke, but they do : )\nService here is always friendly when I actually decide to come in and the place is always clean.  Definitely recommend if you're wandering around brooklyn heights/dumbo area and want something inexpensive and tasty.", "author": "Allana D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-02-22", "description": "First thing to say is: know what to expect. If you want something fancy or trendy, this is not your joint. If you're looking for no frills, solid portions, neighborhood old school feel, this is your place.\n\nHaven't done dinner there but am a regular breakfast/brunch eater. Huge menu with a ton of choice and have literally never had a bad meal there. Pancakes, breakfast sandwiches, and a wide range of omelettes really, really good. Also HIGHLY recommend the fresh squeezed O.J., some of the best I've ever had.\n\nWait staff and management super friendly and down to earth.\n\nJust a warm, welcoming place with equally warm and welcoming food. If you want that down home, neighborhood no frills solid diner, this is your place!", "author": "Josh G."}], "servesCuisine": "Diners", "priceRange": "$11-30", "name": "Clark’s Restaurant", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "80 Clark St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/_1T55JW7JQ-s8XZ_tOtNfg/ls.jpg", "@type": "Restaurant", "telephone": "+17188555484"}