{"aggregateRating": {"reviewCount": 390, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-09", "description": "4.5 stars. Great diner- best quality (for basic diner food) option in the area. It's not the Tic Toc Diner in a Jersey - but a solid option for the neighborhood.", "author": "E B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-06", "description": "Serving up satisfying traditional breakfast food with a twist. They integrate most egg-based breakfast options with avocado which is always delicious. Everything always tastes fresh. Home-y atmosphere. All in all, great neighborhood place with excellent service. A++++.", "author": "Amanda C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-14", "description": "Friendly and efficient service! Plus they served awesome food! I will come here again!", "author": "Sofia M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-08-13", "description": "Probably just not a great dinner place. Some of the food around me looked pretty decent but ours was very average. Do NOT get the Pot-roast. One of the worst presented meals I've ever seen. Wife had to get up to get water refilled. Service was brisk although the their were only several patrons. Seriously, don't get the Pot-roast.", "author": "David M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-21", "description": "If you are looking for a good typical place  for brunch in Brooklyn then you should come here! You have a lot of options to choose and the service is excellent!!", "author": "Rodrigo M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-02-02", "description": "We came here craving waffles for brinner and got exactly what we wanted. Their chocolate chip waffles with whipped cream were delicious, and everyone at my table was satisfied with their food. I was amazed that our waiter remembered all orders for a party of 7 without writing anything down. \n\nMy only gripe is that substitutions are so ridiculously priced. For example, when you get French toast, waffles, or pancakes, you get a choice of ONE side out of sausages, bacon, ham, strawberries, bananas, and chocolate chips. Getting more than one means a $5 charge (the equivalent of getting it as a side, I guess). Every other establishment I've been to has given a choice of two sides, one savory and one sweet, so that was a bummer.", "author": "Trisha D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-13", "description": "It can be hard to find great, (relatively) cheap diner food in this area, and Clark's Restaurant fits the bill! Busy busy, but they won't keep you waiting too long. A+ breakfast sandwiches, sides, and platters. My only small complaint would be that you may feel a little rushed when they bring you the bill, but that's a small price to pay for a) a shorter wait for a table than you'd expect and b) getting your food five minutes after you order. All in all, a more than solid diner option.", "author": "Jana M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-25", "description": "Our favorite local restaurant. A real Brooklyn diner, good for breakfast, lunch or dinner. Don't miss the fresh OJ and enjoy the classical music while there. Great for groups and kids too.", "author": "Clare O."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-28", "description": "Since it's right across the street from the dorm I'm living in this summer, I sometimes trek over for a meal. So far, I've tried the spaghetti carbonara and the German omelet (although how bacon and mushrooms is German is beyond me). \n\nFood's solid- well prepared and presented, flavorful, and filling. The service is pretty friendly. Unfortunately, the price tag's pretty hefty.\n\nOverall, a solid neighborhood diner that I'd visit more often if I wasn't so damn poor.", "author": "James C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-05-03", "description": "It is a good diner. Good food and ok service. Place is very busy with a lot of people, fast service and good food.", "author": "Rkd K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-20", "description": "Delicious. Even on weekday it's busy, and for a good reason, it's delicious! I had some kind of eggs Benedict on potato pancakes - very original and very filling. Cappuccino was excellent too. Will definitely return.", "author": "Carrie M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-30", "description": "The \"New Yorker\" (eggs Benedict with salmon) was awesome. Very hot sitting by the window though.", "author": "Sara T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-06-17", "description": "Their food is perfectly fine diner food although a bit overpriced even for NYC. They'll be happy to keep refilling your coffee if you're reading a newspaper, magazine, book, phone or tablet, but if you pull out a laptop, they'll ask you to close it or leave. I was actually just trying to read something and wasn't planning on staying any longer than while I ate, but that didn't matter. Oh well. Good to know.", "author": "Aaron D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-09-21", "description": "Wow. First time ever getting thrown out of a restaurant. \n\nWent here for breakfast and a meeting with a friend, and I guess we sat there too long because after we finished breakfast and had paid, and as we were reviewing our papers, the old guy comes up to our table and tells us point blank to get out, to take our \"homework\" elsewhere (this line was delivered with a very disturbing shooing motion). \n\nOf course we were shocked, but got up immediately to leave. On our way out we stopped to have a further word with him about how he could have at least asked politely and were met by even more rudeness - he couldn't care less about losing our future business, etc, etc -- and more shoo-ing gestures that came too close to actually touching me and nearly caused me to lose it. \n\nDefinitely understand the need for turnover in a restaurant (even though the place was still 50% empty at the time) and would have left if asked nicely.\n\nSeriously disturbed as I am moving to this neighborhood and guess one of the few (if only) diners is now off limits as I am NEVER, EVER going here again. \n\nPS the servers were very nice. Beware the old guy.", "author": "Theresa S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-19", "description": "Had the farmer's omelet. I don't know who the farmer is, but I can tell you he must love meat. The omelet had more bacon and sausage than eggs. Food and service was good. \n\nNote, the orange juice that's included with breakfast can't be more than a 3oz shot. If you're thirsty for fresh squeezed OJ, you'll have to order it separately.", "author": "Lee T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-19", "description": "Probably the best breakfast place in Brooklyn heights. They provide traditional and typical American breakfast, my kids favourite spot", "author": "C K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-23", "description": "i like this place. \n\ni'm usually scared of places with such a large menu but i was satisfied with everything we ordered. \n\n-lumberjack breakfast (sausage, bacon, ham, eggs, pancakes). their breakfast sausage is amazing!\n\n-americano. good. for some reason, they couldn't make it iced for me. that's odd.\n\n-i had a roast beef sandwich. simple. but the roast beef was solid. \n\nthe interior looks like a typical diner. comfortable and not pretentious and clean. i like.\n\nthe service was.. okay, but the decent food made up for it. will be back!", "author": "Tiffany L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-09", "description": "Best breakfast I've had in awhile! I got French toast with scrambled eggs and cheese, bacon, ham and sausage. The French toast and sausage was delicious.", "author": "Jared B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-07", "description": "Friendly staff, great diner food, perfect egg wraps, classical music.  These guys know what they're doing.", "author": "lex a."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-08-15", "description": "I went to Clark's restaurant looking for a good brunch place.  SInce I arrived in New York City, I hadn't had real breakfast food.  So I excitedly went to Clark's--pancakes, omelets, eggs, good ratings, good company--what could go wrong?  But I was sorely disappointed.  I didn't mind the wait as much the quality of food.  Perhaps, I was so used to eating at Henrietta's Table in Cambridge for breakfast, which serves only farm-fresh goodness, that I have refined my tongue for good breakfast food, a skill that I hope to develop even further for all kinds of foods.  \n\nI ordered the blueberry pancakes.  The batter was dense, and the pancakes were not fully cooked.  It tasted like store bought pancakes made of powder.  I also asked for two poached eggs, and not only were the eggs of awful quality, the egg was so undercooked that the egg whites were foamy.  Instead of a side of fries, I asked for a side of steamed spinach ($1 extra).  These tasted like they had been in the steamer for too long--tasteless and wilted. Plus the service was awful.  First, they promised that they would seat us right away, yet it was a 15 minute wait before we finally got a table.  Then, a friend came in to chat with us (she had already eaten), and the waitress got angry that she did not order anything.  And the prices were too expensive to justify the food they served--$13 for some flour dough and wilted spinach?  Looks like I won't be coming back here anytime soon.", "author": "Buggy Z."}], "servesCuisine": "Diners", "priceRange": "$11-30", "name": "Clark’s Restaurant", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "80 Clark St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/_1T55JW7JQ-s8XZ_tOtNfg/ls.jpg", "@type": "Restaurant", "telephone": "+17188555484"}