{"aggregateRating": {"reviewCount": 390, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-30", "description": "Nice lil place for brunch with my daughters. We had chicken and waffles and it was so delicious. The chicken tasted like honey and it was moist and cooked all the way, which is always a gamble when u order in the bone chicken. My daughter loved her grilled cheese and we had a good time. Although it is a tight squeeze and at times can be a bit crowded but still not too bad.", "author": "Millie C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-07", "description": "Party of two for a late afternoon Saturday lunch.  We were immediately seated by the window.  A nice American diner with quaint rich gold ambience without the typical diner cushion booths.  I like the European décor as it appears of a luxury European home. Clark's Restaurant is walking distance from the Promenade and Brooklyn Bridge close to Pineapple Walk. Background music is classic piano as a healing touch to fit my current physical state recovery from recent open surgery.  Our waitress was hustling busy serving as many tables possible without any assistance.  She was either nervous or unfocused dropping utensils during every table clean-up or grabbing too much plates in her hands.  By the power of observation, the entire time under our waitress's reign she wore a very dirty white blouse with a gargantuan dark brown coffee/ tea stain visibly noted.  Ick, not good physical presentation skills.  Can the manager or co-worker lend her another white blouse for her work shift? No one did obviously and sadly. We ordered:\n\nGrilled cheddar Cheese with Hamburger \u0026 Fried Onions $8.25\nGrilled cheddar Cheese with a ham\nBaked potato\nSoda\n\nReasonable priced. Good quality food.  My grilled cheese sandwich was served piping hot and plentiful to eat my fill and the burger meat was juicy.  Cold slaw and pickles are accompanied with our meal.  Service is attentive, aside from our waitress's gargantuan dark brown coffee/ tea stain on her white blouse.  I was scanning the menu and their pasta entrées appears very enticing as well as their deluxe burgers.  Hmm, juicy! Online ordering is available.", "author": "Tina C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-03-05", "description": "The food was great! The service was slow and server didn't really pay any attention to us. I had to wait 20 minutes for a drink because she kept forgetting about it.", "author": "Erica H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-06-11", "description": "Clark's Restaurant looks like a diner, feels like a diner, smells like a diner, has a menu like a diner, has a counter like a diner, is a diner. It seems to be a bit cheaper than the diner on Cadman Plaza West. But that's not why I visited Clark's Restaurant. I was on jury duty and Clark's Restaurant is mightly close to the courthouse and needed a quick lunch. \n\nClark's Restaurant has their own version of an Eggs Benedict dish that I've been eyeing. They named it after themselves, Clark's Poached Eggs with Avocado, $13.35 including tax. It's two poached eggs, avocado, bacon, on two crispy potato pancakes, and topped with hollandaise sauce. The crispy potato pancakes were not greasy, thank goodness, but were a little overly crisp for me. The poached eggs were slightly overcooked and didn't ooze enough which would have helped the overly crispy potato pancakes. I could have used more hollandaise sauce too. Their sauce was a bit too thick for me. I rather it be saucier but it was okay. Would I try this dish again...I love eggs and potato pancakes together so yes, if I was in the neighborhood again for jury duty. \n\n...my jury duty lunch adventures continue....", "author": "Sally W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-01", "description": "I do not approve. The vibe was blah, the fries were white and undercooked, I asked for a wrap but instead got a stupid roll 3 minutes after i ordered. It felt as if he just put it in the microwave and heated it up. Overall very dissatisfied with this place.", "author": "Aga N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-09", "description": "I've been to this diner so many times with my wife, with friends, family and every time the food is great.  Classy joint with a friendly staff. Also helps that I live down the block from them. Can't wait to go again soon.", "author": "Greg L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-17", "description": "Went for lunch. Super comfortable booth table. And I love my strong coffee. They have everything and with great prices. The lunch included a soup, I had the split pea love love love. Yes would recommend this place. \nGet there a little bit early for lunch, after 12 it was crowded.", "author": "Michelle F."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-05-09", "description": "Came here on a weekday morning to catch up with an old friend. We expected to chat for a while, and this seemed like a good spot because it wasn't busy.\n\nI arrived first, and I noticed a sign by the front door saying, NO LAPTOPS. That should've been the hint that this was a place that wanted you to get in and out as soon as possible. My friend was late, and even though there were plenty of seats in the restaurant, I noticed the staff was antsy. They hovered around me, asking me if I wanted to order yet even though I had already told them I was waiting for someone.\n\nAfter my friend arrived, we got coffee, juice, pancakes, and Belguim waffles. The food was good, but standard diner stuff. Once we were finished, our plates were taken away and the check arrived, but my friend and I continued to chat and I kept drinking my coffee. \n\nWhile still chatting and drinking my coffee, a busboy came and took away our waters and my coffee cup, which still had coffee in it. The clear message was GET THE F- OUT, even though there were still plenty of open seating. The encounter was laughably rude and because they weren't busy, it seemed weird to place a time limit; but that seems to be important to Clark's.", "author": "Teresa L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-24", "description": "Great breakfast. We had the lox omelette and the Clark's wrap, both very good. Nice atmosphere, sat by the windows and people watched while planning our day. Think it would also be a great place for lunch or dinner. Will be back.", "author": "Greg S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-07", "description": "Such a beautiful restaurant in a beautiful part of Brooklyn! I came here with a friend on a Tuesday afternoon, looking for brunch spots and Clark's has all day breakfast.\n\nI ordered the French toast with strawberries, whipped cream and a side of bacon. The French toast was fluffy and really soaked in the syrup. Definitely recommend. Bacon was crispy and delicious.\n\nMy friend ordered the eggs avocado breakfast. A nice twist on eggs Benedict! Really enjoyed it. Both portions were big and filling.\n\nService is on point. The waiters are attentive and nice. Feel like this place is a hidden gem because it was so empty, but will come back and bring other friends here if I'm ever in the area!", "author": "Arielle Lana L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-21", "description": "Horrible experience. The food was great but the service was AWFUL. We found a hair in our food and the manager said \"well it's not a human hair\" and didn't even apologize.", "author": "Melanie R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-08", "description": "Very solid diner food. Can always rely on them in terms of quality and quantity. Staff is also very nice. The only real issue is that their food is more expensive compared to typical diners, so it's not necessarily a place you can constantly go to eat at unless you can spend that kind of money.", "author": "L F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-04", "description": "This place was great! I was in Dumbo and found this as a nice brunch spot. The five of us got seated in no less than five minutes.\n\nI had the eggs florentine. While I thought this was all that I was getting, it also came with home fries, toast, coffee/tea, and orange juice! \n\nThe florentine was one of the greatest I've ever had. The eggs perfectly yokey and sprinkled with cheese. Spinach was not overcooked and was a nice complement.\n\nThe highlight of the meal was definitely the orange juice! It came in a tiny 4 oz glass and was freshly squeezed. SO GOOD, just the right amount of sweetness and did I mention is was FREE!\n\nVery satisfied with the place and the price wasn't bad either - only $12 for everything! Will definitely return if I'm in town again.", "author": "Marty R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-02", "description": "Great diner in a nice area of Brooklyn. The line can be insane at times but it does move very fast. Even more surprising was how quickly we ordered and had our meal arrive even while the entire restaurant was packed. They got everything right too...the poached eggs were perfectly cooked, the omelette was made with egg whites (which we had asked for)...turkey bacon instead of regular...\n\nI've eaten at other diners who never were able to get everything correct in our order so Clark's was a very pleasant surprise.\n\nThe food was great, too. The menu is enormous with some interesting options. Our favorites were the eggs Benedict with lox and eggs Benedict with avocado over potato latkes! Really tasty and so filling. Portions are large.\n\nWe will absolutely return to Clark's. We also loved the Christmas decorations. Very fun and festive.", "author": "Sol C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-31", "description": "Food is ok, great location, staff is friendly. The reason I'm giving the lowest possible rating is because I wanted an avocado, ham, cheese omelette. But since I find cooked avocado pretty disgusting I just wanted them to put the avocado on the side instead of actually cooking it. I was politely informed by the waiter that I couldn't do that and that if I wanted to order that specific omelette I had to have the avocado cooked and if I wanted it outside he would have to charge me almost $5 for a side of avocados. Basically they charge you 5 extra dollars to not cook the avocado in your omelette which is pretty dumb. This silly rule speaks of a management pretty estranged to its customers. Won't be coming back.", "author": "Avinash R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-06", "description": "First time here and I've already found a favorite! The walnut strawberry and cream (hold the cream please) Belgium waffle is amazing! Served golden brown with finely chopped waffles cooked inside and topped with beautifully ripe strawberries...mmm, mmmm good! \n\nService was pleasant and prompt and the coffee was piping hot! Will definitely be back whenever in the area again.", "author": "Chantay B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-14", "description": "Super fast delivery to the downtown BK area. It took less than 20 minutes after submitting my online order before they showed up with our cheese fries and philly cheesesteak (sans onions and peppers, THANKS for getting it right!). \n\nI'd order from them again. I also need to visit the restaurant proper for some diner food.", "author": "Shu Jin S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-07", "description": "My friends and I stayed in Brooklyn for a vacation recently. On our last day we wanted to find a good brunch spot near the Brooklyn Bridge. This place was amazing! The food was good American breakfast food. The prices were great and it was a 10 minute walk away from the Bridge! The staff couldn't do enough for us and we got seated fairly fast for a Sunday brunch around noon. Highly recommended!", "author": "Reina M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-04", "description": "Our favorite. We live a few doors down from here, but even if we had to come from across town it would be worth it. The staff can be a bit grumpy but the cheap, tasty brunch food makes up for it, and the old-school diner feel is just great.", "author": "Stephanie T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-23", "description": "Super friendly staff, adorable interior, huge menu with awesome food, and in a great location. My family insists on going for breakfast every time they visit me in the city and the owners always remember us and go out of their way to accommodate for regulars. Would definitely recommend!", "author": "Andreana B."}], "servesCuisine": "Diners", "priceRange": "$11-30", "name": "Clark’s Restaurant", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "80 Clark St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/_1T55JW7JQ-s8XZ_tOtNfg/ls.jpg", "@type": "Restaurant", "telephone": "+17188555484"}