{"aggregateRating": {"reviewCount": 390, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-11-14", "description": "When I first moved to the neighborhood I went here a lot, but being from Long Island, the land of diners I lost interest pretty quick.  \n\nOn the weekends the place is jammed in the mornings so if you are solo, just head over to the bar and grab yourself a seat.  I must give credit where its due and they really deserve it for their breakfasts as its awesome. Good coffee, and the service is usually very good.  For the wine drinkers out there, they seem to have a helluva lot of wine on the shelves, at if my memory services correct, it was about 30 bottles of Yellow Tail.  Go figure.\n\nPrices are about average for a typical diner, but if you want the real diner feel, walk two blocks to the Park Plaza Diner.", "author": "Jared B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-19", "description": "While not one for the gourmets - this is one of my favorite Eggs Benedicts in New York, even when delivered the eggs are just perfect. Plus they don't make fun of me for Seamless-ing an order despite living two doors away...", "author": "Joanne F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-09-07", "description": "I love Clark's!\n\nIt's a tad on the pricey side, but the atmosphere is awesome; it has become my standard. The place is small, but not too small, well decorated with the classical station playing low for ambiance. The wait staff is friendly and consistent (and while we're not on a first name basis, many of the waiters recognize me when I walk in, which is a nice touch), and the food never takes \"too\" long to come out. \n\nFood wise, I've yet to be \"really\" disappointed with a meal I've had there. I usually stick to breakfast items, specifically the Western with Cheese, wheat toast, banana pancakes, french toast and the like. The lunch and dinner items are not bad either though. My only complaints in that department is a little over pricing. A grilled cheese of any substance (ham, avocado, tomato, etc.) was around $8, and the grilled caesar warp didn't feel like it justified the $7 or $8 price tag. Although, this could be remedied by soup or fried or some such (not free sides mind you). \n\nI have only two real complaints:\n\n1) If you got on weekends, or during lunch rush, there are often many, many, MANY kids in the place, and if your just trying to get a bite before you go off on your day this can be bothersome, as most of the kids are under the age of 7. I think this is because of the many churches and \"learning centers\" nearby. Whatever, not much I can do about it.\n\n2) They're not open long enough! It's a diner, but it's a step above, and isn't open 24 hours. I can't tell you how many times I've wanted a good meal at 3am and had to resort to \"Crappy Days\" or that other place. \n\nIf you're in the heights, GO! There is something for everyone, and despite not being open 24 hrs, you can get breakfast as long as they're open.", "author": "Matthew K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-08-30", "description": "Mediocre. Omelette was bland but French toast was delicious. Fast efficient service.", "author": "Kenna C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-11-19", "description": "I'm giving this 5 stars for breakfast only, so if you're looking for something else, read another review.\n\nFirstly, before I even start with the food..\nThe service here is fantastic, and friendly, even at the busiest of hours.\nYou can have the best food in the world, but if I have to sit your place for 30+ minutes and feel neglected/unwanted, you just killed my dining experience. :p\n5 Star service.\n\nOkay, now the food:\nI ordered French toast, pancakes, and bacon.\nAll for 13-14 dollars, wha? Yup.\n\nI'm not even going to go into details.\nFrench toast 5 Stars.\nPancakes 4 Stars, they weren't very thick/fluffy, but they were good.\nThe bacon was.. good bacon, they didn't mess it up like many other places manage to do.\n\nThey gave me fresh squeezed orange juice with my french toast/bacon meal and it was a very small quantity, but very good.\n\nI love everything about this place, and will be returning often.\nLuckily it's only 2-3 blocks away. :]", "author": "Michael C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-09-08", "description": "This is a quintessential New York City diner with one exception: you won't feel like a bloated pig when you leave!\n\nAnything fried comes out light and fresh -- they apparently change their frying oil regularly. Anything grilled is also light and fresh. \n\nThe place is clean and bright, WQXR (NY classical station) plays lightly in the background, and like any good diner, the menu is incredibly vast. \n\nBONUS: super cheap beer!! $3.25 for an ice cold bottle and a tall glass. \n\nSome here say they think it's pricey, but I totally disagree -- for the portion size (very shareable if you're not into giant meals) and the fact that it's New York, I think the prices are great.", "author": "amy s."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-08-12", "description": "TERRIBLE, TERRIBLE, TERRIBLE service!!!  The waiter was RUDE, and when it happened the second time I asked for a manager and he was WORSE! He didn't even ask what was wrong he told us to leave!!!  If you can't handle a brunch crowd then get out of the food business. How is it possible to have encountered four employees and have all of them be worse then the previous?!!!!\n\nWould give NO stars if allowed by computer!!!!", "author": "Victoria D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-05-08", "description": "I like this place mostly because it became our local while we were living in Brooklyn Heights, and because it's on my way to work. I'll frequently make an order for pick-up while I'm walking to work. The Clark's Wrap is especially good for a mobile breakfast (although I think it needs ketchup and pepper).\n\nThe potatoes can be a little bland, but otherwise this is a great choice for brunch. Always inexpensive.", "author": "Matthew A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-22", "description": "Clark's is one of my favorite places to get breakfast. They make a great eggs benedict and french toast. The only problem if you order bacon unless you tell them not to they will over cook the bacon but I usually get the sausage which is also really good. The lunch and dinner is good as well which is your typical diner food.", "author": "Jonathan M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-08-03", "description": "We are from out of town and got into NYC very early in the morning. We were hungry for some breakfast, walked by this restaurant and decided to try it out. We were seated quickly but did not have the quickest service. My gyro and eggs breakfast with potatoes was good but not hot. My wife's and kids' wraps were good and hot. I had to ask twice for a second cup of coffee. The pricing was average for NYC fare. Overall, it was just ok for me. Nothing to really write home about.", "author": "Jeremy T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-07", "description": "I love Mark. The food has not been as consistent lately, but if you like Greek Diner food it is a great spot. Really good people-watching too.", "author": "Datan B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-24", "description": "I come to Clarke's at least twice a month during lunch. They have an excellent variety of food on their lunch menu. The pea soup here is the best I have EVER had. The croutons in them don't ever seem to get soggy. The wait staff is excellent, the food is always fast and tasty, and the price is just right!", "author": "Janice P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-07", "description": "Terrific diner/restaurant.  Good for lunch and dinner with traditional American cuisine  with several Mediterranean dishes too.  GREAT for breakfast.  Plan on waiting a bit for seating for Sunday brunch.  This is THE place to go at that time.  Staff is uniformly friendly and efficient.  Nice atmosphere. One wall of seating with street views for people watching.  Fairly priced too.", "author": "Robert W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-04-26", "description": "Clark's Restaurant is a good local breakfast spot (i have not tried the lunch/dinner offerings).  It is my go to place for breakfast in the heights.  The service is quick and there are plenty of options to choose from and heir O.J. Is awesome.", "author": "Felicia M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-04", "description": "Not bad! Not bad at all.\n\nA little better than your typical diner. A friend and I came here well into the afternoon and ordered some breakfast. We slept in late so we hadn't eaten anything. He got the pancakes, eggs, and bacon. I got French Toast. He's really cheap and didn't want to pay the $3 for real syrup, but I can't stand the fake stuff. So I got the Maple and poured it over my Fruit and Nut French Toast and I must say that my meal was absolutely amazing. I haven't had French Toast in YEARS and now I wish I had it everyday. My friend enjoyed his bacon and eggs but wasn't enjoying the pancakes. When he ran out of syrup he dipped his pancake into some syrup that was pooled on my plate and it blew his mind! It was hilarious! All of a sudden he was obsessed with the pancakes when they had real syrup on them. I always tell him, \"You get what you pay for. Now he wants to plan another trip here. He's a funny guy. Good food, service could have been slightly more prompt, but nothing to cry about.", "author": "David M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-06", "description": "(3.5 stars) Nice and very clean diner in a very beautiful area of Brooklyn Heights a couple blocks from the Promenade and a short walk to the Brooklyn Bridge. Prices are reasonable (expect to pay $9-15 for a good breakfast) and the portions are good. The french toast, though they put way too much cinnamon on it was still very good and this was the first time in a diner that I got perfect crispy bacon without making a special request for it. I was a little dissapointed to see baskets of pre-packaged goods like cookies  and pound cake but the delicious looking menu makes up for it.", "author": "Matt E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-04-10", "description": "Five star diner.  Lots of good Greek food on the menu, but we were there for breakfast.  The eggs, muffin, french toast, ham, sausage, and coffee were all delicious.  Looking forward to checking out the Gyro's.", "author": "Matthew L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-29", "description": "I go there 2-3 times per week for breakfast or lunch and have never had anything that was awesome for what it is.  Clark's is exactly what it looks like from the outside.  The food is perfectly wholesome and service is outstanding.", "author": "Thomas J."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-02-21", "description": "This place has a nice look and feel. The greeter is great but the rest of the staff barely made me feel welcome. Had a simple breakfast which was \"Ok\", it was comparable to a Denny's or an IHOP.", "author": "Jesus C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2008-09-13", "description": "Went here with co-workers for lunch. It was alright...\n\nTurkey burgers and fries, and pink lemonade.\n\nThe pink lemonade was a surprise because I ordered a lemonade\nand got this lovely pink fountain with shaved ice!! It was refreshing and\nnice to look at.\n\nFood was good - you get what you expect, it's decent and tastes good.\nThe turkey patty had nice grill marks on them which made me want to \nbite into that burger....\n\nWe went around 1pm and waited 5 minutes to be seated. It was crowded\nbut the servers and host were really good.\n\nOverall I would come here again, but try their wrap sandwiches or \nbreakfast items.", "author": "Andrea C."}], "servesCuisine": "Diners", "priceRange": "$11-30", "name": "Clark’s Restaurant", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "80 Clark St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/_1T55JW7JQ-s8XZ_tOtNfg/ls.jpg", "@type": "Restaurant", "telephone": "+17188555484"}