{"aggregateRating": {"reviewCount": 339, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-22", "description": "This is great food and all, but one of the things on the menu involves 'hand-torn bread,\" and come on now.", "author": "Alex R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-10-22", "description": "Some dishes , such as the Alcachofa ( fried artichokes with anchovy aioli) and the Fideua (noodle paella) were fantastic. The paella was absolutely beautifully presented. It's such a shame that other dishes were so disappointing! \n\nDrinks: Cocktails were weak for my taste, but that's just my preference. It's a shame that the sparkling wine (a type of Cava) I ordered wasn't really fizzy (maybe the bottle was open for too long?)\n\nThe baked fish of the day for example (a Dorade) was not fresh and some bites were fishy enough to make me cringe. Dorade is not a fishy fish, and this should never be the case. I eat a wide variety of seafood pretty regularly so this was definitely not subjective! For $29 I expect at the very least, fresh quality! \n\nThe green tahini deviled eggs were okay, but nothing special (I guess they were out of quail eggs, and subbed in regular eggs). For dessert, I ordered the olive oil ice cream which was unique and delicious. \n\nIt was very quiet as it was a  Monday evening. No complaints on the service; dishes also came out very fast. The one sort of strange thing though was that our tapas came out before our drinks. Kind of strange timing. \n\nI was super excited to try this place, and unfortunately do not think I will be back (anytime soon at least.)  And not on a Monday for sure!", "author": "Sarah G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-28", "description": "This was the best meal I had during a week in New York, and probably the best so far this year.\n\nA group of four, we arrived after a gruelling hour wait drinking possibly the best cocktails I've ever had at Red Gravy nearby and crumpled into our table at half nine on a Wednesday. The size of the portions and the size of the group meant we could sample a fairly good selection of the menu. We had about 2-3 tapas each, all shared, which was absolutely more than enough (I've seen other Yelpers complaining that the portions meant you needed to order about 8 each, I find this slightly terrifying). Some portions were larger than others, but most were of the traditional saucer sized variety.\n\nThere were a healthy amount of specials available, all explained and recommended by our friendly Spanish waitress and we tried a few of these. Steamed ramps appeared in a brown paper bag we had to cut open, accompanied by a rich romesco sauce, the American take on the traditional Catalan calçot dish. Migas (of the Spanish, not tex mex variety) were a deliciously moreish and large plate of crispy fried Chorizo, breadcrumbs and caramelized onions. I decided against ordering the berenjenas con miel, fried aubergines with cheese and honey, after an underwhelming experience with the same in other tapas places. When my Dad ordered them, I demolished them. The aubergine had been peeled and sliced into batons, the sauce, a mix of manchego and a creamy Mozzarella like cheese whose name escapes me, was the perfect blend of sweet, tangy and creamy.\n\nEach dish that came out seemed better than the last. Alcachofa, fried artichokes with anchovy aioli were just the right mix of crispy and melting, the aioli having enough anchovy to give it a bite without being so much as to put off someone like me who doesn't really like them. The cordero, cumin roasted lamb, tasted like a confit, with an addictive zingy preserved lemon and date condiment. Pan amb tomaca, the traditional tomato bread had a twist of mojama (air cured tuna) and nori. Escalavida, a traditional vegetable stew was paired with a light tahini sauce, an unusual take that combined richness with the fresh, lush taste of the vegetables. The croquettas were the only unremarkable dish of the night, being absolutely fine, but not the best I've ever had\n\nWe finished off, although by now thoroughly full, with two desserts. Olive oil ice-cream with sea salt tasted exactly like its ingredients, in the best possible way, though was not to my taste to be honest. The other dessert, a special, involved an elegant and light black sesame macaron and many other things I can't remember.\n\nWhile the prices range from low to high, the bill for all the food with wine and sherry for four people came to a pretty reasonable (by New York standards) $230 which is worth noting as many reviews said you'd need to spend at least 100 a head to manage here. We spent the rest of our time in New York deliberating whether to return but never did. There is a danger of attempting to recreate the amazing experience of the first time trying something wonderful on holiday which can never really be repeated. But if I lived in Brooklyn, I would come here as often as my paycheck allowed.", "author": "Jess L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-10", "description": "Stopped by this charming little place after a cycling class for their brunch offerings. I was aiming for a spot to treat myself to a bite and sit and relax, and this place definitely did the trick. I sat at the bar, and the bartenders were great.\n\nThe sangria isn't the best I've had, but I will say their ensemaidas were excellent. Sorry New Orleans beignets, this is my new doughy, powdered sugar-covered pastry to covet. I definitely want to come back and explore more of their menu because the atmosphere and all the food I ate and spotted around me were so good.", "author": "Monique L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-04-07", "description": "I wanted to share a quick cautious moment about eating at this establishment -- and maybe it's me. \nBut after reviewing other reader comments and having visited the restaurant here are my humble thoughts. \n\n1. The plates are delicious. 2. They are small. Sort of like having - Spanish sushi and or Chinese Dimsum. \n2. If you happen to have a large appetite, prepare to spend or go else where. \n\nI was also wondering about the reviewers, I felt the honesty was a little canned. \nBut to each his own. \n\nOne reviewer, my comments:\nGARBANZOS FRITOS: La Vara spiced fried chickpeas * 3 - really small plate, I would order two, if your company is more than two.\nPATATAS BRAVAS: EQP's rough cut crispy potatoes with spicy alioli * 6 - again, food as a teaser, order two. \nMOJE: layered salad of imported tuna, olives, endive, Marcona almonds * 14 - and I can go on. \nCUCHIFRITO: crispy lamb hash with poached eggs, ajo cabiñil sauce * 11\nEL QUIM: local squid and crispy morcilla with broken eggs, Boqueria style * 11 -  and on. \nALCACHOFAS Y FAVAS: olive oil braised artichoke and fava bean stew, poached eggs * 12 and on. \n\nI will admit very sexy drinks. \nAgain, this is a $65 - $75 dollar per person night - if you have the dollars, prepare to spend. \n\nAnd, you may still be hungry at the end of the night!\n\nThis comment gets to me: \"Take note, Buttermilk Channel, Frankie's, Talde, and the rest of you overhyped restaurants  - this place is the real deal, and you should all be taking notes. - Wow, this is rich!\n\nAnother ebullent quote: \"I love small plates. With a few adventurous people, you can try such an array of flavors. La Vara is a very small restaurant. We got in just under the wire; we waited about 20-30 minutes, with later arrives quoted times of 1 hr or more.\" - Again, does this person get out much, it should be small and pricey. \n\nHere's another gushing one:\n\n\"If I lived in Brooklyn, I'd come here all the time. I'm from the New York area and this is one \nof the best restaurants I've ever been to. I also spent some time in Spain and La Vara's tapas \nwere way better than any I've tasted there. - I too went to Spain, Barcelona, Costa Brava, etc.,\nI am not sure, that this reviewers comments are true.\"  \n\n- Darling, there is great cuisine in Spain too, regardless of the exchange rate, these places are \nexpensive and over-hyped, I too travel, Love Brooklyn and eat in the city. \n\nBut then again, I've been around! Word to the wize!", "author": "Gif A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-18", "description": "Oh La Vara, how I wish you were just a smidge better because you are two blocks away from home and the would-be perfect place to lure unsuspecting Manhattan stalwarts into the BK! \n\nAs it stands, this is a solid four-star spot with definite five-star potential and I've been a couple of times in the past few months (including a last minute Monday-night visit where the place was near-empty). \n\nNegative points for having so many unwritten \"specials\" (quotes because some of the specials seem to just be regular dishes that for some reason haven't been printed on the menu--i.e., the suckling pig) that your waitress' recall ability becomes an inside joke with the table. Just WRITE THEM DOWN. You have those cute little cocktail menus that are the PERFECT size for a nightly specials menu! Not all of us can remember eight to ten additional dishes after downing that delicious/dangerous tequila-based cocktail during the initial menu perusal... just sayin'. \n\nGet: suckling pig, goat pasta, fried artichokes, eggplant, rabbit, white gazpacho soup special (if available--and be sure to eat the shrimp in your soup bites as the broth alone tastes a bit like tahini sauce). \n\nSkip: Sardines (literally just canned sardines on a plate), bread/chorizo special salad (unless you like your charred bread to be black and inedible), stuffed pepper special, paella. \n\nOverall, there is room for improvement, but the restaurant provides an enjoyable experience and a variety of yummy tapas to please all palates.", "author": "Erica I."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-14", "description": "Little Spanish restaurant tucked away... With big surprises.\nThe food is amazing and authentic and delivered with smiles and enthusiasm.\nHad a great Gin cocktail with quinine syrup and lemon.\nI just wish I lived nearby !!!", "author": "Annette C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-20", "description": "Enjoyable dining experience at La Vara. The place is pretty tiny and very loud. We sat at a table that they did not call communal but it was. OK with me but don't try to have a private conversation there! The hostess was very nice and accommodating even with the throng of people in the tiny waiting area.\nThe food was interesting and tasty. They served a large variety of Spanish tapas with a mediterranean flair. The food comes out incredibly fast. Limited cocktails with a good mix of wines.\n\nFried chickpeas- kinda like popcorn or bar nuts. Finger food to munch while your food is being prepared. They were pretty good.\nSuckling pig- I have had better suckling pig. Could use a bit more flavor or sauce. It was tender but nothing to write home about.\nRabbit- I love rabbit.... however I wasn't impressed with this one. Just kinda blah.\nTuna empanadita special-  Very plain to me, but the other diner with me enjoyed them. Could use a dipping sauce.\n\nFavorite items-\nChicken hearts- Skewered yakitori style with a scrumptious salad. I think that salad was the highlight of the meal. It consisted of mint, arugula and a delicious lime-date dressing. The meat was succulent and perfect.\nGreen pepper and baby shrimp salad- delightful small pieces with an avocado sauce. Very refreshing.\n\nOverall- I would go back and try more items on the menu. There is a such a variety that I feel I would find more favorite items. I leaned towards liking the smaller plates and the salad based items better than the meat and fried items on the menu.", "author": "Saba F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-14", "description": "The space is tiny and a bit too loud for me. You walk right into it so waiting for the hostess to seat you can be a bit awkward as you are breathing down the seated patrons neck's. \n\nThe hostess seemed as overwhelmed as I was by the creeping line of other diners coming in.  I almost got an anxiety attack as I was clearly violating the NYC rules regarding personal space; pushing me onto that couple at the bar.  Hey hey it ain't that kind of  party!!!\n\n45 minute wait! Boo! No way.  But wait, the food Gods intervened and they had a cancellation. Seated!  Unfortunately it's at those darn communal tables I hate so much!\n\nHowever, the excellent service and speed which our food came more than made up for any space issues. \n\nThe lamb empanadas were ok. The vegetable turrine was delicious and the cochinillo which is their signature dish amazing! \n\nDessert was pretty amazing as well a torta with figs and marscapone! Lovely just lovely!", "author": "Wanda N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-27", "description": "The food here is better than it was at almost every restaurant we visited in Spain, and we went to some pretty fancy restaurants. Don't expect to find another paella bar: the cuisine is more Moorish than Valencian, and it is outstanding. Here's what to get:\n\nCroquettas: perhaps the best we've ever, ever had. A must.\nSuckling Pig: if they have it, it would be criminal NOT to order it. Don't even think about ordering anything else unless you get the pig.\nCordero Al Ajo Cabañil: imagine duck confit, but with lamb. This was the tastiest, most succulent lamb meat I've ever had. Crunchy on the outside, tender and moist on the inside.\nAnything with langostinos (as a side, they don't give you many).\n\nYou can probably skip dessert - it was the only part of the meal we weren't thrilled about. The homemade ice-cream was lacking in flavor (and sugar); it was also icy rather than creamy, probably due to the low sugar and/or fat content.\n\nThe best seats are at the bar, which is wide enough and comfortable that you don't need a table. You also get the added benefit of observing pure magic, courtesy of Pablo (your bartender/waiter).\n\nThere is a significant obstacle you need to overcome before enjoying any of this deliciousness, and it is... well, you aren't the only one who is hoping to enjoy it. Their reservation policy is logical but annoying (only for parties of 4+, and if you're hoping to score one on Fri/Sat, book 2-3 weeks in advance). And really, if you decide to check this place out on a weekend, expect 45 min to 1:30 hr wait. Then, if/when you do end up at a table, ask for earplugs. You're way better off coming in on a week night instead and sitting at the bar.", "author": "Nicolay S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-03", "description": "What a delicious brunch.  Everything we ate was well prepared, and I very much enjoyed the atmosphere of this casual spot.  \n\nFour of us ate together--we had (cut and pasted from the menu): \n\nGARBANZOS FRITOS: La Vara spiced fried chickpeas * 3 \nPATATAS BRAVAS: EQP's rough cut crispy potatoes with spicy alioli * 6\nMOJE: layered salad of imported tuna, olives, endive, Marcona almonds * 14 \nCUCHIFRITO: crispy lamb hash with poached eggs, ajo cabiñil sauce * 11\nEL QUIM: local squid and crispy morcilla with broken eggs, Boqueria style * 11\nALCACHOFAS Y FAVAS: olive oil braised artichoke and fava bean stew, poached eggs * 12 \n\nAll of these dishes were great.  I especially like the cuchifrto and the el quim--both were stand outs. \n\nI am generally not impressed by brunch.  I love brunch, don't get me wrong, but the food doesn't often outshine the much desired Bloody Mary.  I think La Vara though offers really great food at reasonable prices.  I will definitely be back.", "author": "Ian A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-12", "description": "This is probably one of the best meals I have had in a long while. EXCELLENT food, great for vegetarians and very accommodating and the staff was professional, quick and also very nice. \n\nI asked about the vermouth they serve and he actually brought me a glass of it to taste which was the size of a full drink. Very generous! Definitely will be back and have recommended to a ton of people already.", "author": "Elizabeth E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-25", "description": "EERRRRRMMMAAAAGGGAAAAAWWWDDDDDDD I WANT TO PUT THIS ENTIRE RESTAURANT IN MY MOUTH!!!!\nFrom the second you walk in and smell the aromas, great service, and in the end your super yummy full belly! This place lives up to its rep and does not disapoint.", "author": "Trevor A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-09", "description": "LOVE this place! By far one of my favorite restaurants the world over. They've earned Michelin stars yet it's still a casual vibe so that whether you are passing by for a casual bite or planning a special dinner, it always feels right.\nall of their waitstaff treats you like family yet they have the knowledge and expertise of true professionals, the delicious menu is absolutely singular.", "author": "E L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-25", "description": "Yum yum yum!  We just moved into Brooklyn Heights and have been on a mission to try all of the restaurants in our area.  We've only made it to La Vara for brunch but can't wait to go for dinner.  \n\nThe brunch was incredible - right up there with any Manhattan establishment.  It was bursting with flavor so good that I regularly have cravings.  Sadly we pledged not to revisit a restaurant until we've tried every one in our area.  \n\nI had the Huevos Con Migas which was AMAZING.  The toasted bread crumbs gave the dish the perfect crunch while the seared grapes was a clever way of making the dish less greasy.  R had the Cuchifrito which was also very good but we both agreed that the Migas was better.  We shared the Patatas Bravas - don't miss this because the spicy aioli is addictive.\n\nWe can't wait to return for brunch AND dinner! This will certainly become one of our favorite neighborhood restaurants.", "author": "Kathy L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-06", "description": "Found this place on Yelp \u0026 we're really glad we did. Great that you can make a reservation, unlike many Brooklyn restaurants. However, it's small, happening, and inventive like the best Brooklyn restaurants. It's not exactly tapas, but features many small plates. The wine list is small but very well composed. Service was excellent. Server was friendly \u0026 well informed. We actually sat right across from the expediting window, which could have been annoying, but the kitchen was so well organized and quiet, and the expeditor so efficient, that it was actually kind of fun to watch. Dinner for two with a bottle of wine \u0026 a split dessert came to $140, so not too bad by NYC standards. I'd definitely come here again for date night with my wife, and absolutely recommend.", "author": "Ken C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-09-20", "description": "Came here for brunch - portions are on the smaller side, food was fairly good but the service just made it a bad experience. There were 2 other filled tables when we got there early on the weekend, a waitress took 20 min to take our order, food took another 25 min to be served and hardly came to check in on us. Hopefully the service gets better \u0026 we'd be tempted to come back \u0026 try the dinner.", "author": "Tasteful O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-27", "description": "Like their sister restaurant Txikito, this is a restaurant which honors the history and personal connections that food can create. Everything that comes out of the kitchen is the product of thoughtful intention and a love for good food. \n\nGiven the historical origins of the restaurant's concept, the food is quite rich and very satisfying. I find that my eyes tend to be bigger than my stomach here.\n\nAlso, the wine list is wonderful.", "author": "Mark K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-09", "description": "This is an amazing dinner place! Been here a bunch and never disappointed.\n\nIt can get a little expensive because the plates are meant for sharing and very very yummy so you end up ordering half the menu but its well worth it!\n\nI expected the brunch to be just as good as dinner but it wasn't, stick to trying this place for dinner first.\n\ntip: they don't usually take reservations for 2 on weekends so walk over, put your name down and walk to a bar on court to wait..", "author": "Sam M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-29", "description": "This place was awesome.  The wait for a table for three on a Saturday night at 10 pm was an hour, but we killed the time with awesome cocktails at the Henry Public and were definitely ready for dinner by the time our table was ready.\n\nWe had:\n* Pitcher of sangria\n* Special of zucchini cakes\n* Special dish of squid, pork, and shrimp in white bean gazpacho\n* Eggplant with melted cheese and honey\n* Flatbread with onions and blue cheese\n* Layered salad of tuna, olives, endive, and marcona almonds\n* Braised tongue with peas and carrots \n* Almond cake\n* Walnut tart with lemon curd\n\nI wasn't enamored of the special in the gazpacho, but it was still really good.  Everything was pretty much awesome, but, if I had to play favorites (and I think I do, as this is Yelp), my favorites were the eggplant, the tuna salad (the mixture of tuna, olives, and marcona almonds was unexpected and amazing), and the walnut tart.  I really liked the flatbread also, but it's less inventive than some of the other things we had.\n\nAll in all, I would wait for this place again - but, as it takes reservations on OpenTable, you shouldn't have to!", "author": "Kathleen B."}], "servesCuisine": "Spanish", "priceRange": "$31-60", "name": "La Vara", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "268 Clinton St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/YnPJLj7vWlk4BsQhN7nuDA/ls.jpg", "@type": "Restaurant", "telephone": "+17184220065"}