{"aggregateRating": {"reviewCount": 339, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-03", "description": "Just a great evening of food! Terrific, well informed staff.  Very helpful with the extensive menu. Helped us create  an incredible meal. Plenty of food in  with all the different plates. Small, medium and large. Highlights: fired chick peas, salted cod salad, Paella (with noodles, not rice. Valencia style) suckling pig special (awesome with crispy skin) . The Egypt style dessert with dates and lemon curd, stunning. I really loved this place.", "author": "Peter G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-05-27", "description": "Great service...and exceptional food. I'm not much for tapas because I lean veggie and am not a huge fan of cured meats. And the veggie options here were just glorious. Ate here last night and already itching to return for the spice fried chick peas (a new trend I'm totally digging), the eggplant w/honey, cheese \u0026 nigella seed, and the crispy bundles with black kale, swiss chard, pine nuts and currants...Writing those here so I do not forget!", "author": "Marci A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-06", "description": "Not only is this now one of my favorite restaurants in the neighborhood, but is a new favorite in the city. We just returned from a meal was delicious from beginning to end. We had a raw scallop special that was divine. The chicken hearts were wonderfully delicious, as was the beef tongue, rabbit, red shrimp a la plancha with preserved lemon, and Fideúa (noodle paella). The service is also exceptional - these folks clearly love food. \n\nThere is nothing like this in the neighborhood, and I hope it is here to stay for years to come. We will be back regularly, and will be recommending highly to friends. Love, love, love La Vara!", "author": "M J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-25", "description": "Wonderful food and flavours.  Portions are, in my opinion, perfectly sized to share or to have a few on your own.  Each dish we had for my husband's birthday was very good, and reminded us of our honeymoon in Barcelona.  \n\nStand outs for me were the noodle paella, lamb breast dish, and fried artichokes. \nGreat cocktails, service was attentive and her suggestions were much appreciated.\n\nLa Vara is a wonderful addition to the neighbourhood!", "author": "Carla G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-29", "description": "One of the more spectacular meals I've had in a long time.  From a small plate of fried chickpeas to the final spoonful of olive oil ice cream, every dish on the menu was richly flavorful and uniquely memorable.\n\nHowever, I think are there some keys to fully enjoying the experience:\n\n- wait for a seat at the bar and avoid the communal table.  It looked a bit too packed, and quite frankly I hate sitting closer to strangers than to my own date.\n\n- this is not an \"order an app to share, then a main for yourself\" type of place.  Try a ton of different small plates in waves along with the surprisingly good tap wine, and expect to spend about 25 bucks per person on the food, and you will definitely leave a happy and sated diner", "author": "Joram S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-07", "description": "Came here for dinner with some girlfriends. At first I was nervous about the communal tables (so many babies in brooklyn) but all was fine. The waitress was a bit slow/hard to find, but generally friendly, knowledgable and allowed us to taste wines (by the glass) before ordering them. The plates are SMALL but overall very delicious. Favorites were the fried greens, meatballs, \"paella\", pan con tomate, and date tart for dessert. At a little over $30 per person before tip (one drink per person), I was pleasantly surprised at the value and full (but definitely not stuffed). The annoying part was that it was very hard to get the waitress's attention to get our bill at the end of the meal. The place was almost empty and she couldn't see us waving to get her attention? Otherwise a positive experience.", "author": "Sarah W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-03", "description": "Unf.  Up front, my friend manages this location, so I'm obviously a biased source, but dang!  Squid ink!  Flash fried sardines!  Those little seared peppers!  I'm nuts about this place, \u0026 I have only been here for brunch.  I'll be returning for dinner ASAP.", "author": "Mordicai C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-25", "description": "I love Spanish food. I've been to. Barcelona among other areas and especially loved Catalon cuisine. I've been to the sister restos to la Vara and liked them a lot, but I think this place tops them, a not just because we were desperate for a place like this in Cobble Hill. Briefly, the place is lovely, the service very good and the food.  Imaginative and phenomenally delicious. I felt like I was in Barcelona. We had everything from tongue to chicken hearts to braised beef cheek, but there's plenty there for less adventurous eaters. The wine list is good as well. It gets crowded on weekends, so arrive early or plan on sitting at the lively bar, my preference. I'm so happy to have this place close!", "author": "Gabrielle R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-05-24", "description": "oh god, delicioso!\n\nwe went last night as a sort of celebratory dinner. after a slight 10 minute wait, we were seated and ordered within 5 minutes. we got fried chickpeas ($3), the citrus-soaked olives ($3), miel coated eggplant with melted cheese ($8), asparagus with aioli \u0026 poached egg (special), a pitcher of sangria ($28 and enough for 2.5 glasses for 2 people), and the suckling pig (special, $30). the first three plates came out quickly, we were only in the restaurant for about an hour including the initial wait.\n\nthe highlights for us were 1-the eggplant, 2- the suckling pig. i cannot recommend the honey crispy eggplant enough, because honestly i can't remember the last time something has tasted SO GOOD-- the sweetness of the honey, the little crunch of the eggplant, the cheese... last night the suckling pig was on special and the sweet crackly skin in combination with the rose petal quince sauce... oh my god! makes me want to slow roast some pork butt big time. \n\neverything we ordered was perfectly seasoned, except for the asparagus special, which seemed, in comparison, a bit bland.\n\nwould love to go back as we experienced wonderful service and a delicious meal in a beautiful neighborhood, but it was a bit pricy, and as others have mentioned the plates are not terribly large. otherwise, great. mmmmmmm", "author": "Maeve O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-05-25", "description": "Holy sh*t this place is so good. Ordered everything, and ate it.", "author": "Shar K."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-07-30", "description": "Despite living close to this restaurant I have avoided it because of the look of the lighting from the outside.  It has a cafeteria yellowish glow that doesn't appeal to my ambiance sensibilities.  When I finally decided to give it a try I was immediately impressed by our waitresses extensive knowledge of the menu and the wine list.  However, despite her ability to recite details I didn't feel that she was actually that excited by the food.  We ordered a number of little dishes and I wasn't impressed with any of them.  I found all the tapas to be over salted, and over cooked.  Towards the end of the meal our waitress pretty much forgot about us.", "author": "Pepper P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-20", "description": "Went there on a Friday afternoon, right before dinner time. The staff was very friendly. The food is to die for. No complains.", "author": "Cristal V."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-06-25", "description": "The service is fantastic. People are incredibly nice. Like nice enough that I would return just for the warm vibes. The cocktails are quite good. The decor, and the location are great. The food, is, well, just ok. We all left and thought, well, ok. Nothing remarkable but nothing offensive about it. And the friendly staff and nice decor and delicious cocktails will make it somewhere we might return to, as it's a neighborhood restaurant. Maybe it was an off night for food? Would give it another shot.", "author": "Sir M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-11", "description": "I love this place!  I went here last night with my husband and had a wonderful dinner! We sat at the bar and had plenty of room to eat and was not rushed despite a line of people waiting to be seated.   I LOVED the artichokes and he was a big fan of the flat-bread with onions and blue cheese. The bartender was very knowledgeable about the food and friendly as well. I will go back again and can't wait.  It reminded me of many tapas/pintxos bars I have enjoyed while traveling through Spain in the past. \n\nMany people below complain about the cost, but I thought it was on par with other local restaurants. You couldn't get out of Watty and Meg, Frankies, or Buttermillk Channel for any less. AND its a tapas bar...name one decent tapas bar in NYC that does run cheap?!?!?!\n\nI can't wait to go here again!", "author": "Shannon M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-08", "description": "Dinner last night with a cousin I'd never met in person, three of her cousins, and a former student of hers, now a sous chef here (so admittedly I'm biased).  Everything was amazing - we tried many different items, but for me the highlights were the eggplant with honey, brick de Acelga (little kale and chard bundles, with feuilles de brick), the remojon, the albondigas, and, of course, the suckling pig.  We even made room for dessert - which were extraordinary too, especially the olive oil ice cream.  There are so many other things I want to try, so I'll definitely be back - I'm even working up the courage to try the grilled chicken hearts...", "author": "Barbara Ann R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-11", "description": "Great food and atmosphere. The rabbit was so yummy. The suckling pig was amazing. We will be back for brunch soon.", "author": "Eboni-Starr F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-25", "description": "We went for our 5 year anniversary dinner. It was great. Intimate and good service. The flavors are unique and super delish.", "author": "liz T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-10-10", "description": "The experience of eating at La Vara - open just six months, the waitress told me - \nwas confusing. The idea was enchanting: culinary conviviencia, the peaceful encounter, for several generations, of Jews, Catholics and Muslims in medieval Spain. Service was gracious and charming. On the plate, the enchanting idea of fusion succeeded sometimes, sometimes not. \n\nWe went early, without reservation: no trouble being seated. Delightful, attentive service. I probably know more about the waitress than I should!\n\nIt was the food that was confusing. Appetizers worked fine: marinated sardines and fresh kale rolled in small tacos were  fresh and authentic. My rabbit entree was puzzling: bright,  pungent saucing with tasteless meat: American rabbit just doesn't have the taste of rabbit in Spain or France (like poultry in general). The dish would have been wonderful with Spanish rabbit, but didn't work with local material. My son's entree was an insult to the idea of lamb: the basic content (really? meat? lamb???) was tasteless, treated with an interesting crust of Moroccan spice. A Mallorcan flat bread and its topping were delicious. Desserts were quite good. \n\nDishes are small and unsatisfying. Price per plate is unexceptionable, but it certainly adds up: food and tip for two -without drinks - was over $100...and quite insufficient!\n\nI'll go back once...maybe more often, depending.", "author": "Peter H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-27", "description": "Walked in on a Friday night around 7;45. We called in advance and they weren't taking any more reservations, and the reservations on open table were booked. However, they still took walk ins and we ended up sitting at the bar right away. This place is small but really cute. All of the food was excellent. We had the deviled eggs, the kale rolls, the lamb meatballs and the chicken. Very cute ambiance and good food. Great for a date or a low key girls night.", "author": "Phoebe C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-03", "description": "I came here during a two week stay in New York with some local pals. Though we did have to wait (we read that they didn't accept reservations, but it seems they've changed their policy and actually do now - so call to be sure and maybe avoid a wait), the atmosphere and food were both terrific.\n\nHighlights were: the eggplant, croquettes, artichokes. The desserts were not overwhelmingly great, but overall, the flavours and textures were pretty exceptional, and the small, lovely space and hospitable service made for a very nice night out.", "author": "H. W."}], "servesCuisine": "Spanish", "priceRange": "$31-60", "name": "La Vara", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "268 Clinton St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/YnPJLj7vWlk4BsQhN7nuDA/ls.jpg", "@type": "Restaurant", "telephone": "+17184220065"}