{"aggregateRating": {"reviewCount": 339, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-01", "description": "Our favorite neighborhood place! From the scrumptious sangria to the spicy chickpeas to the remojon to the olive oil ice cream - not a bad thing on the menu!", "author": "Alexa S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-02", "description": "Excellent contemporary gourmet tapas, innovative, hip, great service, fitting wine pairings and great reinventions of flavors with an elegant, delicate but not shy Spanish character. Foie gras, scallops, suckling pig, eggplant and honey.. . This is a magical place, a restaurant that presents you food that draws you in. The service speed was perfect, relaxed and professional.", "author": "Lars H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-20", "description": "Came to this place on a weekday, recommend making reservations.\n\nWe had the red sangria which was absolutely delightful! Definitely recommend, they give you a heaping glass (but lots of ice so I guess it is pretty normal). \n\nThis place does tapas so you share pretty much everything. The shishito peppers were incredible, and like candy, very addicting with the crisp charred and salt. We had gotten the Escalvida which was an onion dish, pretty yummy as well. They brought out a complimentary tasting of a carrot which was soft sweet and unlike anything I had?! I found myself asking what this was and what I was enjoying!? I wasn't crazy about the blue fish special which you can get one or two fillets (we split one). I don't think I enjoyed the sauce or the fish, buuuut my friend did enjoy it, so you be the judge. Last but not least the chicken was a must, end of story, definitely try, you can't go wrong!  Dessert we got a rhubarb sauce with ice cream which didn't disappoint.\n\nThe restaurant recommends splitting 5-6 plates between 2 people and I think this is perfect, they also give you bread. Mmmm mmmm good!", "author": "Lauren H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-16", "description": "Very creative, well prepared dishes in a beautiful setting. The patio is particularly nice, with a few tables right next to a big tree trunk. \n\nThere are many vegetarian options. I recommend the eggplant and honey dish and the Persian salad. The pasta is pretty good too.", "author": "Benjamin J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-03", "description": "Loved this place! Went here with my fiancé a few weeks ago for dinner, we got the scallops, lamb meatballs, lamb breast, fried chickpeas and a couple other things which I can't remember. Anyway, relatively inexpensive for a Michelin starred spot and great service and low key/relaxed atmosphere. Strongly recommend!", "author": "Arunabha C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-04-27", "description": "A long time customer walks in to an empty restaurant and is told by someone who has been able to drive for less time then they have been a patron that they only have room at the bar. Okay no problem. Then five minutes later we are asked to move to the end of the bar where their iPad is set up by the same unsmiling, dour, \"I'm too cool for this job\" sourpuss. I guess they wanted more room?  But that is also the stand where they tabulate checks and give orders to the bartender, and it has no privacy, and has an iPad on the place setting. The bar is also open. At what point do you give up on a place because their staff is arrogant or doesn't like the way you look or dress or has some other bias?  I'd say you give up at that point. The service is obviously terrible now. My advice spend money elsewhere. We left and went to a place that was glad to have us. Thank god for colonie.", "author": "m h."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-01", "description": "I don't know if it was La Vara's fault or mine that I didn't enjoy my first experience with them two years ago, right when they opened. But life is about second chances. I believe it was the poet laureate Two Chainz who said that: \"My whole story is just about me having a second chance.\"*\n\nThis whole story is about La Vara having a second chance. And in my past few visits, they've killed it. Since their inception, the space itself has become more inviting (I love their garden immensely), and the service more welcoming. Most importantly, the consistency of the food has improved considerably.\n\nThe menu changes often, and it's entirely likely that you could make a meal out of the intriguing specials available. Some of my favorite items have been seasonally available, such as the summer squash fritters or the torn bread served with chorizo oil and grapes. I've never seen more gorgeous deviled eggs than the ones La Vara served with green sauce, and the daily croquetas are never a bad decision.\n\nOne item that tends to be a staple is the fried artichokes. I'm never sad about dipping into this salty, fatty bomb of flavor, and the bacon paprika stew is a similarly solid choice.\n\nRegardless of what you order, however, you are virtually guaranteed a meal of intensely flavorful, beautifully presented small plates. And although you may want more of any given dish, it's just as well that they are tiny portions. Not merely because almost everything is quite rich, but also because this affords you the opportunity to taste more items coming out of this kitchen, and that's a good thing. \n______________\n\n*He also said, \"My wrist deserve a shout out, I'm like, 'What up wrist?' My stove deserve a shout out, I'm like, 'What up stove?'\" Less relevant to this review, although now that I think about it, La Vara's stove deserves a shout out. I'm like, 'What up La Vara's stove?'", "author": "Peter D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-09", "description": "Excellent from service to the most delicious and unique plates I've had in a long time.", "author": "Elaine G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-08-28", "description": "Another massive disappointment from an overhyped restaurant. We ordered five dinner plates ranging from average to inedible. The chickpeas were the highlight of the dinner, whereas the cocktails and the mains were the low point. The duck was impossible to chew and half of the portion was pure fat (clearly the intention, but really??) and the pig was so burnt we had to semis it back to the kitchen.", "author": "Maha N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-31", "description": "Pleasant surprise! Limited menu (not a traditional tapas menu) but the dishes are all excellent!", "author": "Taek-Geun K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-14", "description": "Amazing food. We have been several times (brunch and dinner) and always have a great meal. Menu is diverse and creative.", "author": "Dudley W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-10", "description": "I went to La Vara for brunch (hold your groans) because they didn't have any other reservations available for a Saturday (call/reserve early and often!).\n\nThe space is cute, and very nondescript (especially for a Michelin starred restaurant), but that's part of the charm. There's exposed brick, tiled ceilings and a cute bar.\n\nAnyway, since it was brunch time, had to start out with Bloody Mary's (not on the menu, but basically half the patrons were sipping on them). They were delicious (and SPICY).\n\nFor food, started out with the patatas bravas. They were fried well but too heavy. Maybe skip this one if you're not ravenous.\n\nFor mains, they have a lot of egg dishes and variations. Shared two of them. The Tortellita de Gambas (Andalucian shrimp and a chickpea wafer with a fried egg on top) was definitely Spanish-inspired and unique. If you don't get freaked out by crispy tiny shrimp, then this is a great dish. It was over a chickpea wafer, which added a lot of texture and was a nice detour from standard toast or crostini.\n\nAlso had the Huevos con Migas Aragonesas (poached eggs with chorizo and bread crumbs). Eggs were poached well, and the salty chorizo chunks and sweet roasted grapes were a good contrast.\n\nService was great, and I would definitely come back to try their dinner menu (which everyone tells me I should've done originally). Oh well, a guy's gotta eat.", "author": "Kenny C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-02-26", "description": "We came here for an evening meal on a Sunday night. We had made a reservation but were told to take a seat an order a drink while are table was being readied. We ordered the sangria's which were actually really delicious. \n\nWhen we got seated, the waitress recommended 4-7 dishes for two people. We originally were going to go with 3 so we extended it to 4. SO glad we did as the portions are TINY.\n\nWe ordered the eggplant (good, tiny), 'flatbread' (average, more like baked pita chips!), fried artichokes (best thing of the bunch) and the noodle paella (small, not a traditional style paella, bland tomato flavor). \n\nMost of the food was OK but we finished each plate (they serve as its ready) so quickly as the portions were shockingly small, especially for the price. Not worth it.  \n\nWhen you can head to Frankie's down the street for a quality italian meal and better atmosphere, all for the same price, what's the point?", "author": "Natalie R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-30", "description": "This place does not need any further review. It is an excellent restaurant. All the dishes we tried were amazing. Perfect execution, beautiful presentation and really creative. It is a small restaurant, nothing fancy but amazing experience and, not even so expensive at all!!!!\nHighly recommended! :)", "author": "Luca R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-19", "description": "Came here for brunch with some diehard foodies who claimed this is one of their favorite restaurants in all of NYC for dinner - one was getting ready to move and thus was on her must list to go to again before moving.  Although after our meal everyone agreed that this is really a better place for dinner than brunch, it was still great, hence the four stars.  \n\nService - we reserved a booth in the front, which I highly recommend if you are more than two people and not planning to sit at the bar.  After a short wait, we were sat and service was great the rest of the meal.\n\nAppetizers- we started with the Croquetas Dia, which were ham and cheese that day and were excellent and a little on the creamy side; the Patatas Bravos and the Pimientos De Gernika.  All were great!\n\nEntree - I had the Alcachofas Y Favas and absolutely loved it.  Felt like I was on the healthy side of brunch but was still so savory and a great combo of flavors.  Another favorite at the table was the Huevos Con Migas Aragonesas.\n\nDessert - we couldn't resist the churros and they didn't disappoint!\n\nDrinks - they don't have their regular drink menu during brunch, but my friends who had been there for dinner raved about it.\n\nI would come back here for brunch, but I definitely plan to come back for dinner.", "author": "Tiffany H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-11-18", "description": "We live in Williamsburg and have had our eye on visiting La Vara in Cobble Hill for quite some time. Given the Michelin star rating, we had high hopes for this place. We made the reservation over a month prior and when we arrived we were seated at the communal table. This was a date night for my husband and I so I was annoyed that they couldn't give us one of the open 2-seater tables. I got over it and was looking forward to the meal. We ordered the following: olives, fried artichokes, Shisito peppers, grilled octopus, noodle paella and lamb meatballs. The fried artichokes were delicious so if you go I highly recommend them. The noodle paella was also very good but the portion was small. I know this place is considered tapas but the prices are still high for the portions. The grilled octopus and lamb meatballs were both inedibley bad. The lamb meatballs looked and tasted like dog food (I haven't tasted dog food but I would imagine this is what our dog tastes when he eats his bowl of Natural Balance). All in all I can't understand the high rating and reviews for this place and certainly wouldn't return or recommend.", "author": "Stefanie R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-17", "description": "As many people probably already mentioned, La Vara was definitely not some place where you get high end delicate food with marvelous decoration; however this special cute place did offer me a feeling of relaxation on a sunny Saturday morning, the exact feeling I was looking for after a long tired week.\n\nMy friend and I were sharing many small dishes. Carajillo, the donut bathed in coffee was for sure my favorite. For entrees, I went with others' selection and chose the local squid and scrambled cod (so tender!!). All courses were fantastic and fed me well!\n\nService was also adding extra credit. As a Michelin-starred restaurant, I think La Vara did a very good job in terms of presenting decent local food, rather than focusing on presentation.", "author": "Elaine H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-07", "description": "La Vara has been in my to-try list for more than a year before I finally got to check it out last night. And it did not disappoint!\n\nThe restaurant is located on a quiet, tree lined street in Cobble Hill BK. I already felt welcome the moment I stepped inside. This is my fav neighborhood in BK in terms of food - you got Battersby, Dover, Bergen Hill and many others around court street and smith! And unlike popular restaurants in Manhattan, the acclaimed restaurants in this hood are less hustle bustle, more tranquil and neighborly charm. \n\nOnce I seated at the bar, the friendly bar tender promptly passed me the wine and food menu. Too bad I forgot to ask her name :/ she's so lovely and gave good recommendations for food - can't ask for better services! \n\nOnto the food. I am especially liking that there are quite a few daily specials to choose from , in addition to the many options on the stable menu. I opted for the house salted cod salad and the beef tongue stew that was special of the day. Both are excellent!\n\nThe cod salad was light yet pack of flavors! I adore the nutty smokey flavors from the pistachio oil drizzle over the salad - it goes hand in hand with the fresh citrus and sweet pomegranate that accompany the cod, it's magical! I can't describe it but I can def taste and enjoy it immensely :)\n\nNow the beef tongue. It brings me back all the good memories of Barcelona! The soft beef tongue are chopped in small chunks, dotted in a hearty caper tomato sauce decorated with carrots and sweet pea. It reminds me of the beef stew in Dublin which is considered peasant food but it delivers such a heart-warming effect especially in a chill autumn night. I paired it with a Spanish Grenache and they work quite well together.\n\nThe only regret I had was that I went by myself and I could only tried two dishes while every item on the menu looked amazing! I shall come back soon!", "author": "Nomad M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-17", "description": "The food at La Vara is very good, and the service has always been very friendly, but unfortunately it is also expensive for what you get - for an adult male, figure 3-4 dishes (even for tapas, they are all small), at a price of about $15-25 each.  I ordered only two, the remojon (a cod and citrus salad) and the fideua (a noodle paella), and walked out hungry after dropping $50 (including a glass of wine) before tax and tip.", "author": "P. J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-23", "description": "I came here on a Friday night around 10pm and even though the place was small, we didn't have to wait too long to get a seat at the bar. However, I can imagine a reservation being necessary during peak hours. \nThey serve small portioned plates, so I would advise getting multiple things - which takes its toll on your bank account if you are also buying drinks - which you definitely should, but so worth it!\nI was there with one other person so we ordered four things and shared them all:\n\nAlcachofas (fried artichokes with anchovy aoili) $9 : So delicious, the artichokes were fried perfectly and not burnt and the aoili complemented them without being overpowering. We were tempted to order a second round, but this was the first dish to come out so we decided to wait and see if we would still be hungy. \n\nBerenjena con miel  (Crispy eggplant with honey, melted cheese, and nigella seeds) $9: Also very tasty, the eggplant was exactly as described - crispy, but not overbreaded nor did it feel oily. The honey was a nice sweet bite and the cheese gave the dish a slight tanginess (the leftover cheese was great on top of the bread they serve) I just wish it was a little  more melted. \n\nHuevos Rellenos (devlied eggs, green tahini) $5: Not my favorite part of the night, I wasn't the biggest fan of the green tahini sauce on top and it was just a deviled egg which I don't find to be something very special\n\nFideua (Valencian style noodle paella, shrimp, squid, clams, aoili) $18: One of the best dishes we had that night. Since we were sitting at the bar right next to all the waitresses, one of them told us to mix everything together rather than how it was served. I've never had paella with aoili before, but it was so good, I wish the serving was larger. But let's be honest what doesn't aoili taste good with?\n\nThe drinks were also well made and the staff was very friendly and had good tips for us throughout the meal and also what their favorite dishes are so we can try it when we come back. \n\nOverall a very good experience that I would bring a small group to where you can share food and drinks and chat!", "author": "Tiffany R."}], "servesCuisine": "Spanish", "priceRange": "$31-60", "name": "La Vara", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "268 Clinton St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/YnPJLj7vWlk4BsQhN7nuDA/ls.jpg", "@type": "Restaurant", "telephone": "+17184220065"}