{"aggregateRating": {"reviewCount": 339, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-16", "description": "Finally came around to trying La Vara as it popped up in \"places suggested for you\" ... love the area so the place definitely has been on my \"to try\" list.\n\nPros - excellent coffee, delicious croquetas, overall great Spanish flavors and nice ambiance, and I do love the area (I think I may have mentioned that already haha), oh and the churro! So fluffy and tasty!\nCons - coffee does not get refilled so two cups it is, (perhaps because it was drip but may be not) that's some pricy croquetas you're getting at $3 a pop; overall, I'd say this place is on the pricier side and while I'm all for portion control, I think I wouldn't mind so much if the protein to vegetable (or otherwise) ration was more equal but as such ...\n\nI still would like to point out that the food was delicious, well flavored, and filling. Would certainly like to return and try dinner next time.", "author": "Tatyana R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-19", "description": "My favorite restaurant in Brooklyn. The ambience is amazing, the food is unparalleled, and the wine is delicious! Must try's: chorizo bread bowl; salt baked fish; croqueta del dia. You can't go wrong here!", "author": "Laila R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-12-30", "description": "A giant roach in my son's water glass. We left immediately! (Actually the second water glass because the first one had stuff floating in it).", "author": "Debbie H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-22", "description": "I wasn't too impressed with the food but the service was very good. Nice, cozy and friendly environment. The server was knowledgeable, and Food came very quickly. We had deviled eggs, anchovy salad, fried artichoke, pig, noodle paella, rabbit, and 2 kinds of cakes. While I was not impressed, complementary appetizer, artichoke, and the cakes were very good. Other dishes where OK. Anchovy salad weren't good at all. I would have gives 3.5 stars because of food but since the service and the deserts were good, rounded up and 4 stars.", "author": "Miku T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-17", "description": "Wow what a fantastic restaurant.\nThis place is small but we got lucky and walked right in without a reservation.  In spite of the small size, it wasn't at all cramped-the environment was cozy and intimate.  We asked our warm and friendly waiter what his favorites are and ordered 6 tapas for a table of two.  (FYI this was a really good portion-we ended up full without being stuffed or uncomfortable.). Everything we ordered was complex and delicious and all the flavors shone through without competing.  It was all so good I can't even pick a favorite, although if you twist my arm : ) I'd have to say either the croqueta or the cochinilla (pork).  \nWe chose this place because of its proximity to the cocktail bar we were at and it was such a pleasant surprise-honestly one of the reasons I just love New York City.  It wasn't until I got home and googled it that I found out La Vara has a Michelin star...when I told my husband, his response was \"Cool! They deserve it!\"  Yup!", "author": "Allana D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-24", "description": "Excellent tapas. Everything was tasty. Pork and artichokes were the best. Good wine too. Cute little place. Liked it a lot!", "author": "Andrew K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-27", "description": "La Vara had been on my list for ages so when I finally found the opportunity to go, expectations were high. Thankfully, La Vara was just delicious as I'd hoped!\n\nMy family is from Spain, so I was eager to try La Vara, which draws inspiration from Moorish cuisine (The Moors have a complex history and influenced a lot of we consider Spanish cuisine). Went with my mom and sat in the outdoor courtyard, which I definitely recommend. \n\nWe ordered a bunch of tapas including the jumbo head-on prawns in a garlic lemon sauce, paella with noodles, lamb meatballs and a dish of torn bread, chorizo, egg and other tasty ingredients I can't quite recall. \n\nAll of it was tasty but I think my favorite dish was the paella. It was totally different from the Spanish paella I grew up with, which is made with rice. The clams and squid were super flavorful and the sauce was light and delicious. My least favorite dish was the shrimp. Normally I love head-on shrimp but these were just overly salty. The lemon also overpowered the shrimp. \n\nIn all, I'd love to return to La Vara to try more of the menu. So happy to have this spot in the neighborhood!", "author": "Shannon G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-12-29", "description": "My family and went to La Vara tonight. It was a birthday celebration for my daughter. We were a party of 4 and they seated us by the front door next to the bar. The place is small and cozy. We had been looking forward to having a good meal, but more importantly we were looking forward to the time together. They brought us our menus and filled our water glasses.\n   My wife noticed that there was something floating in one of the glasses and discreetly asked for a clean glass. The server returned and poured water into the new glass. Except this time there was a huge dead orange colored spider at the bottom of the glass and a black colored bug floating on top. Both my son and I noticed it and initially thought it was some kind of joke. \n   It was at that moment that our waitress was approaching our table to take our order. She noticed it and recoiled in fear. She then quickly grabbed the glass off the table and disappeared in to the back of the restaurant with it. She reappeared and started apologizing and offering to comp us something. I told her that I wasn't looking for anything for free. In retrospect I should have taken a picture of it. But we were in such disbelief that this was even happening that it didn't occur to me at the time.\n   We tried to get past it but couldn't. I can't shake the feeling that this was some sort of mean joke on the part of the server. Because how could the waitress see this huge bug form several feet away as she approached the table yet the server didn't see it as she was pouring water over it? We drove 2 hrs to get there only to be subjected to this nonsense. Another person who posted, mentioned seeing a cockroach during their visit. This place must have an issue with bugs. When a server just casually pours water over a huge orange spider and doesn't think anything of it, they've obviously become desensitized to seeing all sorts of bugs. \n   The kids went to bed hungry. My wife and I grabbed drive thru. Definitely not the evening we had planned. I'll never be back. I'll never recommend this place.", "author": "Rahul H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-14", "description": "Great food, friendly service. Beautiful neighborhood. We loved everything we had there. I usually don't like lamb but their Albondigas was so good!! We will be back soon again.", "author": "Futaba H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-20", "description": "La Vara is one of the most elevated restaurants in the area, very worthy of its 2018 Michelin star. Octopus, anchovies, sardines and artichoke hearts are just a few highlights. Outdoor seating makes it perfect for a summer dinner. Don't miss the olive oil ice cream.", "author": "Alex A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-16", "description": "You wouldn't know that La Vara is a Michelin-starred restaurant because it comes across as a cozy and down-to-earth neighborhood restaurant. A friend and I came here for brunch, which was a more affordable way to experience such quality dining here. The Tortillita de Gambas and Cuchifrito were expertly made and were rich and flavorful. The quality of the food, including the churros we shared, was fantastic- therein lies the reason for this restaurant's critical acclaim. Furthermore, the service was very accommodating to us!\n\nThat said, the portions do run a bit on the small side. If you're looking for fanciful indoor decor or warmth, this place might disappoint.\n\nIn such a large city with so many culinary options, I can't say that I'd necessarily become a regular here, but I would consider returning sometime down the road to experience dinner or to try the Huevos a la Flamenca for brunch. \n\nIf you're looking for an unassuming Michelin experience that masterfully celebrates the Jewish and Moorish legacies in regional Spanish cuisine, La Vara is worth a reservation!", "author": "George S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-04", "description": "A 1 Star Michelin Restruant. Innovative Spanish dishes. We totally ordered 5 dishes which were all with small amount except the roast half chicken. It tasted so salty but I am okay with it because personally I prefer something taste strong. Generally speaking, the price is reasonable for a 1 star michelin restaurant with the lovely crowed atmosphere. I will come back again.", "author": "GingToe H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-25", "description": "La Vara might just be one of my new favorite spots. It's a lovely little restaurant on a charming street in Cobble Hill...cozy and warm inside and not a table was open on a Saturday night. Bad timing brought the health inspector right during our meal, which meant the kitchen was temporarily shut for a little bit but the staff was friendly and gracious and brought out delicious crispy spiced chickpeas for all the tables to nibble on while we waited.\n\nWe opted to share a bunch of plates between three people. Highlights included the fried artichokes with anchovy aioli (so perfectly lightly fried), the cumin lamb, and the house made Catalan sausage (don't miss this dish!). Oh, and the shrimp! Quite pricey at $10.50 per shrimp but these are the jumbo kind, head and shell on, cooked in preserved lemon, and dripping with juices when you pull the head off. Totally messy and delicious. The dessert, too, was sublime and I highly recommend the almond cake and the olive oil sea salt ice cream - they went perfectly together! Looking forward to returning and trying more dinner items and their famous brunch.", "author": "Sol C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-11-27", "description": "Was expecting a lot more. Dishes sounded interesting but ended up as strange combinations of flavors and textures, mostly disappointing. Great service and nice atmosphere though.", "author": "Thomas R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-16", "description": "I don't like small plates-style meals--I usually end up leaving hungry or poor (or both).  I don't particularly like southern Spanish food either (I despise olives, and anchovies rarely appeal).  But man do I like La Vara.  \n\nEvery dish we tried was a hit, from the fried olive and yogurt amuse bouche (which, on paper, I should have hated), to the gurullos (handmade pasta with yogurt and sumac, so fresh it falls apart in your mouth), to the berenjenas con miel (fried eggplant with honey and cheese, salty and crispy and soft at the same time), to the cochinillos (a portion of crispy roasted pig--definitely on the larger side of the dishes here--with two sauces), to the albondigas (soft but rich lamb meatballs).  The table next to us had the chicken, which looked enormous.  If you are not looking to share entrees, that and the cochinillos are the way to go.  The dessert special of ricotta fritters (so creamy in the middle we thought there were undercooked) was unbelievably good.\n\nThe service was outstanding--friendly, speedy but well-paced between dishes, not overwhelming us considering the amount we ordered.  There are a couple larger group tables at the front, but for me, the place is more geared toward two people who want an intimate dinner.  The cocktails are great (the Morada was the perfect winter drink), and the wine list looked good.  And after all we ordered, the price was unusually reasonable.  Top notch Brooklyn spot.", "author": "David M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-06-10", "description": "We enjoyed the brunch. However, it seems like a few of the dishes lacked salt. It's a quaint place in Brooklyn but next time we might venture for dinner in the hopes the food would be tastier.", "author": "Elba D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-23", "description": "Informal restaurant in a lovely spot serving (mostly) small plates. I love the flavor palate here - Mediterranean/spanish where vegetables play star roles. Our party of three ate  dinner here and couldn't find an off note in the many dishes we shared. We agreed afterward that the greatest standouts were the fried artichokes, the cucumber and grain salad, and the duck breast. However, how can I not call out the fried eggplant in cheese sauce, the sobrasada and the pig? Suffice it to say we were stuffed but still managed to savor three desserts, which were excellent.\n\nThe restaurant itself is informal and small. The service was excellent - not cloying but responsive and always there when you needed something. It is not cheap but we have certainly spent much more for less satisfying food and we felt this was a good value. Will absolutely come here again.", "author": "Marcia V."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-02-03", "description": "My experience here was possibly the worst I have had at a restaurant. We made a reservation for 5 in advance. We arrived and they told us that a reservation 'does not always guarantee a table' and that we could sit at the bar. Apparently a reservation does not mean anything at this restaurant so don't bother making one. We couldn't all sit together at the bar so we had to sit 3 and 2. The staff had absolutely no remorse and the hostess was extremely rude about it. I would never recommend this restaurant to anyone.", "author": "Julia D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-09", "description": "Nice place, nice environment, we went their for brunch, ordered 4 eggs in tomato frit, scramble eggs with chives, French toast, churro, el quim, and Mimosa for drinks. Highly recommend the French toast and scramble with chives.", "author": "Xinrui Z."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-24", "description": "Off the beaten path in Brooklyn Heights / Cobble Hill. Small place, that could do better with the atmosphere / decor for a one-michelin-star restaurant I think. Service, though, was great. Now the food. Good cuisine ? Yes, and the suckling pig was incredible. One Michelin star ? Not sure, this is still spanish tapas at an expensive price.\n\nOur choices:\nSangria \n\nSardines\nSuckling pig\nCatalan sausage\nDevil eggs\nCroquetas\n\nAlmond cake\nEgypto\n\nThese portions were good in terms of size, but definitely get the suckling pig as it is the most exceptional item on the menu and well sized.\n\nUltimately the food is very good and there is talented cuisine action happening. I feel conflicted but my wife told me to be nice and let the four stars fly ... :)", "author": "Benjamin K."}], "servesCuisine": "Spanish", "priceRange": "$31-60", "name": "La Vara", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "268 Clinton St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/YnPJLj7vWlk4BsQhN7nuDA/ls.jpg", "@type": "Restaurant", "telephone": "+17184220065"}