{"aggregateRating": {"reviewCount": 339, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-07-18", "description": "I came here last night after seeing all the good reviews, craving tapas, and wanting to find a place nearby in Brooklyn. Well, it must have been a bad night because I was sadly disappointed. We had a table by the kitchen opening and could see the food being spooned out of plastic takeout containers by less than enthusiastic kitchen staff. Maybe because it was a monday night and was slow? But thats not much of an excuse... \n\nNo complaints on the service which was fast and attentive. \n\nThe food however: \n- We started with the sardines, deviled eggs, olives, and sausage spread. Sardines were way too salty but not bad. Deviled eggs (or rather 1 egg) were nothing special. Olives are olives and hard to screw up. The spread was kinda gross with an overly gooey texture. \n\n- We thought to try to special of suckling pig. We heard good things about crispy skins etc. At $30 for 1 plate, we were expecting something great but eeekk! The skin was rubbery and overly salty is some places, the meat was overcooked and hard in others, and there was a fowl aftertaste that lingered for a long time after I finished. For $30 a plate (and a portion enough for 1 person)? Really?\n\n- Ended the night with olive oil ice cream (which I was very much looking forward too because I've had it elsewhere and loved it).  But even that was obviously kept in the freezer for too long and a little too liberally doused in sea salt. The taste was more vanilla than olive oil. \n\nWell that was our night. Had the prices been a bit lower, I might have gone a bit easier on it. But the prices they charge command better quality. Again, maybe it was a bad night but I think I'd rather just venture out into the city for a better tapas place next time.", "author": "Anastasiya T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-06", "description": "I came here with my boyfriend on a Friday night, around 6:30pm. They told us the wait would be about 15-30 minutes, it ended up to be about 35 minutes. However, the hosts and servers were extremely nice, constantly asking us if we were ok and giving us updates on our table. \n\nAs for the food - everything was absolutely delicious. Between the two of us, we ordered six dishes and were surprisingly full by the end of the meal. \n\n- Fried artichokes\n- Crispy eggplant\n- Lamb meatballs\n- Croquetas\n- Sardine\n- Suckling pig\n\nMy only complaint would be that the suckling pig was a bit on the salty side, but otherwise it was good. That was actually my least favorite dish only because it wasn't as original as all the other ones. Highly recommend that everyone try this place!", "author": "Caroline W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-05-14", "description": "Struggle of the evening: Suckling pig or Fideua? Torn, I ultimately chose the suckling pig, which was one of the specials. And lesson learned: specials don't typically wind up being as special as advertised. Also, I'm unfortunately a sucker for specials (One more time: specials!).\n\nWhile the pig was good, it was a tad dry and it wasn't an outstanding, knock-your-socks-off dish. It was OK enough to make me deeply regret not ordering the fideua so I may have to come back for it. I was thiiiiis close to throwing my hands in the air and just ordering it after I finished my pig, but we had already ordered 3 apps prior to our main courses, and I didn't feel like pigging out any more (pun always intended).\n\nOf the appetizers offered, we went with the Croqueta del Dia, which was smoked ham and cheese for that day, Sardina a la Antigua, and Migas. They were all good, although we could've done without the croquetas. They were disappointingly tiny, only came with 2, and were more cheesy than anything else. To be honest, none of the appetizers really jumped out at me so we kind of rolled the dice and went with it. The Migas was probably the best of the 3 and apparently it's not always on the menu (?) so go for it if you see it.\n\nI left feeling as though I was supposed to love the place much more than I did. Maybe I just ordered all the wrong things but dinner was good. Not great. Would like to come back for that fideua though.", "author": "Christina F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-10-17", "description": "I wish everything we ate at La Vara had been as good as the best things we ate there.\n\nWe had two amazing dishes: the mini eggplants with honey and melted cheese; and the lamb breast with cumin, date, and preserved lemon. These were memorable and tasty...well worth the price of admission.\n\nWe had gurullos, an odd but interesting dish of very soft homemade pasta with goat butter and sumac. I'm glad we tried it but wouldn't order it again. \n\nWe had several forgettable dishes: flash-fried shishito peppers, fried chickpeas, and olives (which tasted like they came from the bulk display at a supermarket). Nothing bad, but all much more boring than they had to be.\n\nAnd then we had a dish I can only call inexplicable: the remojon. Tons of high quality ingredients that didn't seem to have any connection to one another, dumped on one plate. Confusing and disappointing.\n\nThe server was nice enough, but seemed like she was trying hard to be in an episode of Girls. And she let our wine glasses go completely dry (our bottle was not kept on the table), which really sucked at a restaurant at this price point. \n\nI don't understand the Michelin star. I loved two of the dishes, but I don't think I'll be back.", "author": "Sarah A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-23", "description": "Very nice restaurant! I never been to a Spanish restaurant before, but I would recommend this one to my friends. The portion of the food doesn't really match the price, but it is good for a fancy dinner out. Plus, the waitress lady was really nice! She was very patient and explained everything I didn't understand. I would totally go back just because of the service!", "author": "Yibing Z."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-22", "description": "I had the best meal I've had in the last few years at La Vara.  The themed restaurant serving dishes from the 14th century was a refreshing change,  The Crispy eggplant was delicious.  A well balanced dish of eggplant in a honey cheese sauce.  The suckling pig was probably one of the best pork skins I've eaten in my life.  Crispiest skin along with juicy pork.  The accompanying sauces added the perfect sense of balance to the fatty pork.  We also had the cucumber, spreadable pork, and a poached egg special were all excellent.  I would definitely recommend trying La Vara out and I will be back and checking out their two other restaurants.", "author": "Piti I."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-10-14", "description": "Damn, all this time we been trying to get here, they only had a phone only reservation, any every time, the wait was over an hour. Forget about it. But happy that they have opentable now. Woot woot.\n\nbut today, we were huungry by 6 and so, we went. and got a table........\n\nAn empty restaurant with maybe five tables taken and the waiter said \"We only have a two top on the back available\". Well, perfect! Seat us.  When we were done, all those other tables were still empty. I sure don't understand restaurant policies sometimes. I need someone to explain this.\n\nWe were genuinely  amped  to attack the menu and go to work\n\n Alachofa:Fried Artichokes over anchovy alioli  very crunchy and amazing..... never had artichokes quite like this.  this first dish started to hype us up\n\nMolletes-Sevillan pita filled with bacon paprika stew. - this is like a min fatty porkbelly slider. delicious but not quite a rave......cleaned house though....this dish calmed down our hyphyness. \n\nFideua-valencian noodle paella......my man described it as \"good but too \"fishy\". nothing paella about really except the ocassional tidbits of clams, shrimp and squid minced up. we were now just eating but no longer hyphy\n\nsuckling pig special with a description of CRUNCH ASS SKIN.....Mmmmmmmmmmm...If you ever had pernil as a WHOLE and roast pig from Chinatown, it makes any grown up feel like a kid again. CRISPY SKINNNNNNNNNNNNNNNN\nThis plate was good but after a few bites, i wish i had somehing to balance this out like tostones or VEGETABLES......a plate of MEAT. sigh.\n\nthe SANGRIA though, oh mercy, that was refreshingly good.\n\nNice tapa joint but after settling down the long anticipated hype, we ate and we goneeeeeeeeeeeeeeeee....ZOOOOOOOOOOOOOOM", "author": "Davina L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-11-28", "description": "Above average food that's rather unique.  Somewhat Spanish, but more Mediterranean and some surprises thrown in -- including desserts that are quite good.  However, the dining experience packed like sardines, the three figure decibel level, and the high prices for small plates distract from what could be a 4 star rating.\n\nFor me, the negatives outweigh the positives, so I'll likely not be back.  Glad I tried it though.", "author": "Matthew P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-04", "description": "The dishes did remind me of Spain, especially the anchovies with fresh bread. It brought me back to  the markets in Madrid. The portions are small but very flavorful. The suckling pig was the best! Even the dessert was good. We tried the custard with grapefruit which provided a nice contrast to the sweetness. \nOverall we enjoyed dining here and would come back to try something new on their menu.", "author": "Z N."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-01-21", "description": "Lovely service. Good, not great food. If I wasn't with my best friend it would have been a three star experience. The lamb was moist and crispy, the rabbit was forgettable. The cauliflower fabulous!", "author": "Benjamin R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-12", "description": "I celebrated my birthday at La Vara with about 14 friends.  The place is small but they were able to set several tables together for our party.   The service was accommodating and the food so delicious especially the noodle paella.  Their gin and tonic's were really good too.  We had a great time!!  My friends all loved the food.  \n\nThe one disappointment was that they had booked a second large party right after us and they insisted they had a two hour table turnover.  It was so disappointing as my friends had traveled far to make dinner.   I wish they would have told us in advance.  But I guess that's life in Brooklyn these days.", "author": "Maya A."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-09-03", "description": "Overpriced and everything was over seasoned and very salty. Just ok food at best. Sat in the back, service was ok but less friendly when we didn't order drinks.", "author": "Emily A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-02", "description": "Love this little place!\nGreat service, great food, reasonably priced wine.\nEverything we ordered was great.\nRoasted peppers with sea salt, Chicken hearts, Anchovies, some kinda deviled egg thing, Suckling pig, and noodle paella - all excellent!", "author": "Karen S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-02-27", "description": "I'm not a frequent Yelper but I feel compelled to share my experience from Friday night. My family booked a table at La Vara for my father's 70th birthday dinner. Our table was not ready for about 15 minutes, and when we finally got our table, we were hungry! The appetizers were very good but small, and the sangria was good too. However - the portion to price ratio is so bad that we actually thought we were all getting our own entrees. When we realized that we barely had enough to feed 2-3 people, we asked our waiter if they were meant to be entree portions (because they are certainly priced like it). $400 dollars later we left, went to a bar next door and ordered pizza. What a shameful way to spend a birthday! Not only that, they knew it was my dad's birthday and did absolutely nothing to recognize it. Be warned - this place is a rip off and the food is not nearly worth the price. The service doesn't redeem the experience either.", "author": "Katherine H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-21", "description": "That suckling pig will have you sucking your fingers! The \"paella\" was delicious, but had fideos (tiny, thin spaghetti) instead of rice, none the less it was still damn delicious. The sangria wasn't as sweet as I'm use to, but the date and I drank the whole pitcher. Also had the fish with a chipotle sauce and pasta and that was great too. Seriously can't go wrong with anything here!!! \nEat in the patio if you can, so nice and romantic out there.", "author": "cindy s."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-27", "description": "Good food but really \"brooklyn style\" amazing service!!\n\nWe ordered a couple appetizers - all of which were very good - the blue cheese flat bread, and the fried chick peas were especially good.\n\nWas a tad bit unhappy with the suckling pig- too salty in my opinion.\n\nThe highlight  of the meal was the dessert however which was amazing. A shout-out  to the wait staff who noticed that we weren't to happy with the rosemary and grapefruit custard and brought us the churros with dulce de la leche - on the house ; and it was spectacular!!\n\nWould def come back- want to try the lamb w cumin sauce next!...", "author": "Angelina A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-08", "description": "Went last night with my girl. Excellent experience. \n\nThe food is flavorful and fresh. Everything we ordered was excellent but the paella and lengua were stand-outs. Ambience was sexy.\n\nService was also superb. An overall great experience. We will definitely go back.", "author": "Al T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-16", "description": "So Good. Every. Single. Time. I'll stop there, since it's become so hard to get a table at a decent hour.", "author": "D s."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-13", "description": "Just had an excellent dinner at La Vara. They also have a menu for people with food allergies, so you can see what has dairy, gluten, nuts, etc. Super helpful for our party!Everything we ordered was delicious: olives, fried artichoke, roasted vegetables with romesco, spreadable sausage with honey foam on flatbread, white gazpacho with seafood, dorade with harissa, and lamb breast. It's honestly hard to pick my favorite dish because they were all so good. The service was very friendly and attentive and the atmosphere was nice and relaxed. I will definitely be going back.", "author": "Elizabeth J."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-03-18", "description": "I want to say first that the food here is amazing and our rating is only low because of our server. We went last night and our waiter Ramon was very rude, he didn't acknowledge my boyfriend, and completely ignored him throughout the evening. On a positive note the lamb meatballs were incredible!!!!", "author": "Veronika J."}], "servesCuisine": "Spanish", "priceRange": "$31-60", "name": "La Vara", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "268 Clinton St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/YnPJLj7vWlk4BsQhN7nuDA/ls.jpg", "@type": "Restaurant", "telephone": "+17184220065"}