{"aggregateRating": {"reviewCount": 339, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-02-16", "description": "We had a great experience with our waiter. He was kind and attentive without being intrusive.\n\nWe thought that the food was way too expensive for what we received. $32 dollars for half a fillet of fish or $18 for a few bites of fideuá, a noodle paella which was a great tasting dish but served in such a small portion that it made sharing awkward.\n\nOf the dishes we had the fideuá was the standout.  A number of the other dishes were just okay. There was even a salt baked fish for which, ironically enough, we had to request salt because it was underseasoned.\n\nI like the fun ideas of the restaurant's menu . It's just that the portions, instead of making you focus on the meal you've had, just make you feel cheated. Not the best feeling to have after a meal.\n\nJust made us long for Curate.", "author": "Alex C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-09-26", "description": "Nice to have some Spanish here in Brooklyn, but nothing blew us away.", "author": "seth l."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-10", "description": "We came here for dinner a couple of weeks ago... and then came back the very next night! BEST MEAL(S) I'VE HAD IN A LONG TIME. Yes on the suckling pig (of course) but everything was great. The descriptions on the menu don't do the food justice.", "author": "Minh-Ha P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-26", "description": "This place is definitely expensive for the amount of food you get.  I a few small plates and 2 entrees, with 4-5 beers and it came out to $105 not including tip.  The atmosphere was a little weird at first, but this was my first time in this neighborhood.  When my date arrived, the lights dimmed, and the place got more crowded and loud, but not overwhelmingly so.  \n\nThe wait staff was very nice and very knowledgeable... The bar tender and was also social, which was nice.  They all waved goodbye to me as i left. \n\nI love meatballs, and the lamb ones were awesome. \n\nI would recommend for a couple who wants to walk in a cute area of Brooklyn, and try a few snacks.", "author": "Walter K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-09-17", "description": "Went for dinner tonight in honor of the Jewish New Year. Have really been looking forward to visiting the restaurant as the menu sounded good and the chef has a good reputation.\n\nShared the Sardina  a la antigua, crispy eggplant with honey and melted cheese, croquette of the day, the stuffed rabbit loin and the gurullos. All the food is tasty. The crispy eggplant is orgasmic, the rabbit loin tasty in its simplicity, the pasta comforting.\n\nThe space is nicely designed. white tables and chairs, brick wall, vaguely spanish cut out sheet metal design on the wall. \n\nMy critique: Service was too stiff. There wasn't a warm feeling and the waiter served all food too quickly. He also forgot that our pasta hadn't arrived and had already cleared away our utensils. It was not a welcoming atmosphere; as though the restaurant takes itself too seriously. The tab, including two glasses of wine was $100 before tip. The warm course, the rabbit and pasta dishes, are meant for sharing, and not entree size. So this is a lot of money for grazing food. \n\nI really want to like this place, but it needs to be more for the neighborhood. They haven't cultivated the right service and feel and the prices need to be a more reasonable if they want a regular clientele.", "author": "Serena B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-01", "description": "This is the best Spanish restaurant in NY, in the guise of a neighborhood gem.\n\nSo, beware: it gets crowded and there can be a wait--most good things aren't issued on demand.\n\nFor seating, you want to be at the bar or in the backyard. For a drink, you want sangria or wine by the glass.\n\nFor food, you want to go for the bold flavors--fried chickpeas doused in a smokey paprika, artichokes with an amazing aioli, escalivada with romesco. For entrees, I'm partial to a torn up lamb dish heavy with cumin, preserved lemon, and scallions. Or the suckling pig if it's on the menu.\n\nFor dessert, get the shortbread cake with dates--and ask for an extra helping of lemon curd. A dry sherry doesn't hurt either.", "author": "Chris M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-10", "description": "It was a surprise to find that they serve carabinero shrimp - a deep sea deep red shrimp full of juicy goodness - priced around $22! it was definitely worth it. It came in 2s, but knowing how much this costs in Spain, it is definitely a worthwhile delicacy. We also tried the lamb, which was a disappointment. It was smaller than a Mars bar, and wasn't really anything special. The eggplant with cheese was nice but not outstanding. The price they charged for those plates was way too high. I would say, eat here if you have a seafood craving, then finish your meal somewhere else because you won't be full even though your bill will be. Friendly service though! Tasty cocktails.", "author": "Greta S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-25", "description": "I love it here. La Vara is the best small plate restaurant that I've ever been to. Here you get what you pay for, every ingredient is top of the line. The service is amazing and the staff knows perfectly well what they have on the menu. The ambiance is perfect for a nice date or a small group gathering. Amazing wine list!", "author": "Miguel H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-13", "description": "We first came to La Vara to try the cows tongue, yes, tongue! Which by the way I always loved, growing up Ecuadorian, last time I ate it was about 20 years ago! You have to really know how to prepare this meat, so I wasn't sure what to expect. But the result was amazing! If I could describe this meat is close to a brisket type meat, deelish! Then we tried the chicken hearts which again has been a long time since and that was good, the seasoning was more the taste then again chicken hearts don't have much of a flavor. Followed by the fried artichoke w/anchovy aoli dish, very good.\nNoodle Paella was my dish, I enjoyed it but wished I had a bit more fish.  The dishes are small portions.\nPlace is cozy, clean, \u0026 welcoming with hostesses that are friendly and accommodating. Our Waitress Anna was super friendly and knowledgeable on the menu, she guided us well, we would come back just to say hello to her!  \nOh, by the way, the Sangria is probably one of my Favorites I have had at any restaurant, not too sugary, nor too light on the alcohol, just perfect! \n2nd visit:  this time all the tables were full so after saying hello to our friendly Anna we decided to stay and eat at the bar with Diana the bartender mixologist that makes those fabulous sangrias.  She was great too and suggested we try the suckling pig and so we did! \nSuckling Pig dish is out of this planet!! Juicy and tender and please, please, do eat the crunchy top part of the meat or your will miss out on the whole experience.   This has become one of our favorite spots in Brooklyn. We will return soon again and can't wait to try their other amazing dishes!", "author": "Sharon S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-26", "description": "Good food with top ingredients and well executed. The hostess couldn't be any nicer. Went there with my wife for a special occasion and was told that the wait would be 45min. She offered us to sit in the backyard, which is now closed for the winter, if we liked. We sat in candle light and had a glass of wine. \nAgain, good food and excellent service!!", "author": "Tonino S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-23", "description": "How do they all have such amazing Spanish pronunciations?! Is that the interview? reading the menu aloud? If it is, it's working.\n\nI came for brunch a few weeks ago with friends and was definitely a fan. I was surprised at how empty the place was, and had my pick of the tables, while the generic-looking cafe next door was overflowing with people. Huh? The menu is interesting in that there is a wide variety of sizes of dishes. Too often, brunch is giant and if you want a smaller, lighter meal, you're stuck with yogurt. I had the poached eggs with artichokes \u0026 lima beans, which were really lovely and a perfect light start to the day. Everyone else's meals were also very tasty \u0026 on the smaller side, so if you're super hungry, be aware. \n\nThe bloody marys were excellent. I would have liked a second, but I guess I didn't ask for it in a Spanish accent. My bad. We also got a pastry that came with quince jam and finished with the churros. I highly recommend those as well - the caramel sauce that came with the churros was to die for. We ate it with our spoons when we were done. Between the pretty atmosphere, charming servers and tasty food, I'd say La Vara is a winner.", "author": "Colleen L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-23", "description": "Best Spanish food I've had in New York.  High quality ingredients, creative preparations, but never lost an authentic Spanish feel.  Friendly, helpful service.  Our favorite dishes were the remojon salad, the octopus special and the dourade special.  Good wine too.   People have complained about the noise level, but my wife and I didn't have a problem.   Great place.", "author": "A Z."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-21", "description": "Came here Tuesday night for dinner with the lady.\n\nGetting in:\n- Walked in, asked for a table for 2 - there was a small wait which we passed with a glass of wine out front on the bench\n\nAtmosphere:\n- Resto meets wine bar with an out door back deck\n- Not too dark; a spirited place\n- Resto is set in the middle of a residential block near Cobble Hill Park\n- Relaxing and fun\n\nService:\n- Very good, friendly\n\nFood:\n- Fantastic and authentic.  They have an abundance of seasonal specials\n- Get the small peppers - exactly like you will eat in Spain\n- Get the pork - it is braised for 12 hours and then crisped up upon order.  It was fantastic.  The skin was perfect\n- The croquetas were very good\n- I can't wait to try brunch here\n\nOther:\n- Overall great, neighborhood place\n- Staff is friendly \n- Can't wait to come back here soon", "author": "Matt B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-04-20", "description": "I'm not one to jump on the \"new restaurant\" bandwagon, but when I took a look at La Vara's menu, I couldn't help but get excited. In print, each dish looked vibrant and exotic and refreshingly different from the classic farm-to-table, Southern American inspired restaurants here in Brooklyn.\n\nBoyfriend and I ordered 7 dishes in total, including dessert, so I'd say we gave the menu a fair chance. The dishes arrived in rapid succession--so rapidly in fact that we were done with all 7 dishes in under 30 minutes. \n\nTiny plate after tiny plate hit the table and each one was only OK and nothing more. The huevos de codorniz were difficult to eat and not worth the payoff after all. The aceitunas hit the table strangely late in the procession of dishes, and were disappointing at best (there was no citrus, no herb, just a lot of oil).\n\nThe berenjena con miel had a lot going for it texturally (crispy eggplant, soft cheese) but it lacked salt and the honey was nonexistent. \n\nDish after dish fell flat, notably the fideúa, which my boyfriend (formerly a resident of Spain) was extremely excited to have. The flavor of the noodles was muddled--kind of like what happens when you're trying make a meal from what's left in your pantry and you end up with something that tastes sort of generally savory (hello soy sauce), but has no distinctive flavor.\n\nThe one redemptive dish was a special that night, a cuttlefish stuffed with sobrasada. Finally! A little spice! A little contrast between the tender sweetness of the cuttlefish and the oily crumble of sausage!\n\nIt should be noted that the dishes are sorrowfully small, so much so that my boyfriend suggested that we take photos of each dish with a penny on the plate for scale. \n\nI don't mind small servings, but I was tremendously unsatisfied--and not just because I was still hungry. I couldn't reconcile my menu-induced expectations and my 30-minute-meal experience.\n\nAs we walked out of the restaurant, less than an hour after we walked in, my boyfriend said, \"Let's go get a loaf of bread.\" And we did.", "author": "Hollynn H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-07-11", "description": "As many have mentioned, the service at La Vara really shines. Everyone working in that restaurant was attentive, friendly, and warm, but not to the point where we felt suffocated. Also, the decor is great.\n\nThe food was pretty good too. We tried a bunch of stuff. \n- Fried artichokes were a (predictable) greasebomb, but the accompanying aioli was delicious. \n- Salt cod salad had a nice texture thing going on, but the flavors were too restrained for my liking. \n- Corn soup (on special) was aggressively sweet and could've used some smoke, spice, or acid to cut through it. \n- Chicken hearts were awesome, but too few on the plate. (6 chicken hearts and a pile of herbs for ~$15? Really guys??) \n- Albondigas were a standout. Aggressive lamb flavor, excellent yogurt sauce. Better savor it though, as you get 5 marble sized meatballs.\n- Sausage stuffed cuttlefish, which was probably our favorite dish of the night, is the only one that I would say is a can't miss dish. \n- Fideua was just okay, a little oversalted. \n- A fig dessert on special was tasty, but it was really just yogurt and figs, which are in season now.\n\nWe also had a couple of glasses of sherry each and a tasty, if unremarkable, bottle of Albariño. \n\nI left feeling underwhelmed, particularly after taking the hefty pricetag into account. Small plates should have a comparably small/reasonable price point and these didn't, so I won't be back.", "author": "Julie K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-16", "description": "ALMOST gave this a 5, but i'm not entirely sure if my happy feelings are a result of the company I was with or of the restaurant. I'll re-review again.\n\nCame for dinner on a Wed night around 8:30. Zero wait, score! \n\nSidenote, I wish life was a series of small plates. For instance, you could be a zookeeper for two mos and bounce off to being a pro wrestler another month. Just, small plates. Lots of them. \n\nAnyway, WE ordered a series of small plates: \n\nAlcachofa fried artichokes, anchovy alioli: The alioli made this dish, which is saying a lot for me bc i dislike white creamy sauces. Fried artichokes were exceptionally tasty,\nCordero Al Ajo Cabañil: my favorite dish of the entire menu. lamb was incredibly tender and flavorful. \nBrick De Acelgas: Interesting take on a veggie spring roll. Prob healthier. Would've preferred it to be not fried. \nAnd, two specials - raw scallop dish in a sauce and a pane with chorizo. \nThe raw scallop was really interesting. It was tartare-esque with bursts of citrus. The pane w chorizo was good in concept, but we had to request a 3 min egg on top and some fresh ground pepper. The staff was great in accommodating this and all of our requests, which makes this place a winner in my eyes.", "author": "Joanie K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-08-05", "description": "The food is super yummy, the drinks are very good (except they wouldn't give my fiance a single pour of bourbon.....very confusing.  also they don't have much in their bar department.  if it's not used for one of their cocktails currently they probably don't have it), but why why why are your lights so bright!?! Its almost a romantic restaurant but they need to turn the lights down and get some candles for crying out loud!!!", "author": "Natalie C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-04-06", "description": "In the restaurant industry service service is king.  \n\nWe were excited to try the new restaurant by the owners of Txikito but almost walked out the door part way through.\n\nArrived at 7:30 and put my name down for a 4-top. The host said that it would be about a 25 minute wait due to a table taking a while to finish up their meal.  We waited patiently by the bar having a drink while the minutes ticked by.  Enticing appetizers were being shuttled by us and the smell  of the kitchen was fantastic.  after 45 minutes I approached the host, who calmly apologized and said it wont be much longer. 20 minutes later i cornered him and said WTF.  His response was \"Oh...these people were ahead of you\".  I looked behind us and a brand new group of 4 were standing around \"our\" table.  I said to him we've been here for over an hour how can they be ahead of us?  He proceeded to call them by name saying that they have been here forever (obviously friends of his). \n\nAt this point I was ready to curse this guy out and walk out, but Molly the bartender saved the night.   We ended up grabbing seats at the bar and had an amazing experience with the food and wine.  The anchovy appetizer fantastic and the Pork entree was cooked perfectly.  \n\nOverall a good meal that would have gotten 4 stars, but the 90 minute wait and preferential treatment to this jagoff's friends made it get knocked down.   I understand it's opening week and everyone wants to have their friends or whomever join, but service is king and at the end of the day, everyone is a customer.\n\nThank you Molly for saving our dinner experience!", "author": "Anju R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-09", "description": "My wife and I are huge fans of the proprietors' Manhattan basque tapas restaurant, Txikito: we have probably been over 30 times, including having our wedding reception dinner there back in 2010 because we so wanted our friends and family to sample our favorite restaurant. So since we have moved from Chelsea to Clinton Hill in 2011 we haven't gone back to Txikito so often. When I read Chef/owners Alex and Eder were opening a place in Brooklyn I was really looking forward to trying it out.\n\nI took my wife there for a recent birthday weekend dinner. We were not disappointed: different aesthetic vibe to Txikito, but the food was very similar with exquisite tastes and lots of kitchen TLC. I had both a superb cold cod salad (Remojón) and a skate special (what can I say I like fish) and my wife had the delicious daily Croquetas and Garbanzos Fritos to start. We both chose the half chicken (Pollo Asado) which with its cumin was really good. The staff were impressed we polished off two servings. Like at  Txikito the deserts are exquisite in flavor and we had the orange blossom scented date walnut tart, lemon curd, sweet cream (Egipcio) which might have been a dish to many, but it was a birthday dinner after all.\n\nLike Txikito another superb restaurant, where every dish is delicious and served with care. When I read less than 5 star reviews of either establishment I can only presume the authors favor sheer volume over flavor and good cooking. Their loss.", "author": "Luge P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-13", "description": "Delicious! And super vegan friendly!! Many of the dishes are already vegan and a few can be slightly modified to accommodate those who avoid eating animals. The staff are great. If you're looking for a special meal out, then look no further.", "author": "Noella S."}], "servesCuisine": "Spanish", "priceRange": "$31-60", "name": "La Vara", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "268 Clinton St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/YnPJLj7vWlk4BsQhN7nuDA/ls.jpg", "@type": "Restaurant", "telephone": "+17184220065"}