{"aggregateRating": {"reviewCount": 339, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-11-11", "description": "Let's get one thing out of the way upfront: The chef here is talented and capable of creating wonderful dishes. That's the good part. The ONLY good part. There's zero love here. Everything conspires against the potential of the food. This restaurant seems to be run by people who really don't like people, and wish they would stay away. So while  the food's quality ranges from decently good to excellent, it's served in absurdly, insanely (even for NY) tiny portions. Example: A $14 salad at brunch consistent of a very small plate of chopped vegetables and maybe half an ounce of minced (canned) tuna. It would've been an adequate amount to make one bruschetta, no more. Yet the waitress steered my wife towards it claiming it was more of an entree size than the shrimp salad she initially wanted. Bread with your meal? Not unless you ask for it, and even then, it will be stale (on two occasions) and served with no butter or oil. \n\nOver three visits, we discovered that not a single thing here is entree sized. It may be called an entree, it will certainly be priced like an entree, but they are, at best, moderate appetizers. Imagine a tapas restaurant at quadruple the normal price - which in NY is already high- and you'll get the idea. So the value is abysmal. You can easily spend $50-$75 per person on food alone here and leave hungry. This isn't the upper east side, where you can get away with that kind of nonsense. We have many restaurants in this range that serve excellent food in reasonable portions: Hibino, Petit Crevette, Char 54, Frankies, Prime Meats and many more. La Varra is way below par.\n\nThe service ranges from haughty and condescending to non-existant. Even when you do have one of the ladies' attention, it is dour, cold and dismissive. One evening we stood at the front and waited for 15 minutes to get the attention of the staff, despite the restaurant being half empty. We finally left, unserved. They behave as if they are some sort of gift to the neighborhood, and we should be grateful that they arrived. We're not. It's right in my neighborhood so I really do wish a decent restaurant would occupy this wonderful space, but this is just another of a long series of failures at this location.", "author": "Zando E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-21", "description": "This place is spectacular!  There were so many veggie options and they were all so good.  Great service and wonderful for a group.  Can't wait to go back.", "author": "Veggie P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-20", "description": "cute little place. Sangria was great, beef tongue good as well.", "author": "LT B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-04-06", "description": "Way overpriced for the neighborhood.  After all, this is Brooklyn.  You could easily spend $75 a head here to get a full meal if you're relying on tapas.  Examples:\nthree tiny empanadillas, not even a mouthful each, $9\nfour \"imported\" anchovy strips, straight from the can, $11 !!!\n\nWhat's all the fuss about?  New places always attract a crowd.  This one will fizzle if they don't\nA. get real with their pricing\nB.  improve the customer experience in both comfort and service.\n\nWe were very disappointed.", "author": "Philo V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-28", "description": "We went on Valentine's Day and had a great time. The restaurant was small and had a warm, cosy feeling. There was a bit of a crowd in the doorway, but we had a reservation and were quickly seated. Valentine's Day was a fixed menu (as I had expected), but I would have liked to try more items off of the menu. Everything we had was amazing and a bit unique, but the portions were a little small, except, to my surprise, the dessert.  If we had not had a full four-course meal, I would have left hungry. The service was excellent. I am planning to go back on a non-holiday weekend to get the full experience. The prices were in line with Brooklyn/Manhattan prices. With the full dinner, a bottle of wine, cocktails and coffee, I think our bill was around $250.", "author": "M S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-12-09", "description": "Lived in Spain; eat here often\n\nIt makes me happy that nearly all the prior reviews had very positive things to say about the food.  My wife and I lived in Spain and I can tell you the food here is authentic, creative and utterly delicious.   It makes me sad that the few negative reviews La Vara received all consistently commented on the ratio of portion size to price.   That's precisely why said wife and I moved to Spain: we wanted to experience things that were fundamentally good and not just colossally big.  The obesity and diabetes epidemics in our country might remind you there's more to life than just quantity.  Anyway, we went to La Vara w/a moderate hunger level and filled up on the pan amb tomaca, pistachio salad, croquetas, bricks of kale, and a squash/black-eyed-pea/goat cheese special.  Then we had the torta Santiago and a cafe for dessert with lots of Garnacha along the way.  It was a maravilla and we'll be back soon.", "author": "Jacob S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-22", "description": "One of my favorite neighborhood spots! Great wine list. Get the chicken- it's the best!!", "author": "Ali F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-12", "description": "I rarely want to return to a restaurant.  This was a delightful unexpected surprise.", "author": "C. L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-04-15", "description": "We are collectors of Spanish wine and frequent many tapas style restaurants here and in Spain including the other establishments of this chef/owner.  This restaurant is new and deserves the best service to stand behind the imaginative and creative food;  unfortunately this is not the case.  In addition to cocktails, we\nordered a recommended Rioja which was served too warm and was very hard to assess.  We ask that it be chilled down, and then tasted again.  It was not \"off\"  or spoiled in any way-it was just not good and we knew would be a chore to enjoy.  We said we understood that this was our choice and replaced this with a bottle $25 more expensive which miraculously was wine cellar temperature and very good.  After $250. of food, coffee, and a good time, we were very surprised  that the fist $52.  wine was charged in full with no apologies and declared to be \"policy\".  A good manager seeing the growth potential in knowledgeable clients would have taken the leap, ESPECIALLY in a new establishment, and shown some grace.  The off-hand and disinterested service assures that we will not return.", "author": "Leslie R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-14", "description": "Great service.Very good food. The salt cod salad with pistachio oil is one of the most beautiful plates I have ever seen and its a delicious contrast in sweet and salt. Paella is a bit small, but tasty nonetheless. The crispy kale packages were delicious as were the fried artichoke, albeit with a bit too much aioli.  Service enthusiastic and helpful. Its a great addition to the neighborhood.", "author": "kim h."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-14", "description": "Excellent flavors, a little expensive (if you order enough food-the portions are small-ish), lovely service, nice room next to the sweetest little park in Cobble Hill, worth walking around the block to see the beautiful mews houses and the park. Recommend the fried artichokes and the noodle paella. Great Rioja by the glass. Almost a 4 and a half.", "author": "Claire M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-09-12", "description": "The seafood noodle \"paella\" was basically 10 pieces of spaghetti chopped into small pieces. The seafood part of it was THREE clams, TWO shrimp and what seemed to be one small slice of squid cut into matchstick sized pieces. It was not exactly bursting with flavor either. The sangria { which I might go back for } was very tasty and the staff that I encountered was lovely but, I felt cheated by my dish.", "author": "Anastasia M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-04-02", "description": "Awesome!  The food is amazing and pretty unique, great space and beautifully designed.  So inviting from the street and I can't wait to go back and sit at the bar.", "author": "Barney B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-05-24", "description": "The food, quite simply was rockin' .  My Wife and I get few nights out together these days, so after hearing about La Vara from a few friends for weeks and weeks, we finally stopped in and sat at the bar for dinner.  Firstly, the bartender was very helpful.  He guided my wife into the right glass of wine, and was not at all judgmental when I ordered Vodka, as bartenders these days often are.  We ordered the fried chickpeas which were holy crap awesome...Followed up by sardines.  I never met me a sardine I didn't love and these did not disappoint,  We then shared the salt cod and citrus salad... It was perfect.  We finished with 2 Entrees... The tongue and the cumin lamb.  Both were outstanding.  We went to the Chocolate Room for dessert because we were craving a brownie sundae, but the dessert menu looked amazing.... We can't wait to go back to eat more of the menu.  It's one of those menus that makes it impossible to decide because you wish you could order it all.", "author": "Peter S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-05-03", "description": "Inventive and delightful from start to finish. The goat butter pasta a must. The salt cod salad amazing. The chicken hearts very impressive. Great service too.", "author": "Leviathan P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-09-08", "description": "In particular, I recommend the seafood paella and the chicken dish. The shortbread date dessert with lemon curd was very, very good. Most dishes were good, but some were just okay and seemed overpriced.", "author": "Tep B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-10", "description": "I've been to Spain twice and I always come back to New York in search of anything that can come close to the authenticity I've experienced on my trips.  Yes, that's a high standard, but this is New York.  That said, I like the atmosphere in La Vara, and the space is very nice and simple (thank God something good opened here).  The Spanish style shrimp was the closest to what I tried in Barcelona. It was excellent - and the heads were still on the shrimp (very authentic and tasty).  The lamb meatballs were a little dry, and the empanadas and the croquettes were both a disappointment.  The special that night was a stuffed zuchini over a fresh tomatoe sauce - wow - that was something special.  Perfect combination and very creative.  The sangria was superb - perfectly light and not too sweet.  Service was great - very friendly and inviting.  I'll be heading back....but warning:  nothing at La Vara blew me away, except the sangria.  Reason enough to go back, but over the long-term a signature dish will be needed.", "author": "Macy W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-06-20", "description": "one of the worst places I've ever been in bk if you like to over pay for fake spanish cuisine this is your spot. this place does not only not even look or sound spanish but if you have any actual knowledge of spanish cuisine you'll hate this place as much as i did. i payed a wooing 120$ of LITERALLY 2 prawns and an unimpressive piece of veal. don't get me wrong i know gourmet and this is NOT it. sangria was 30 bucks for pitcher not a bad prices exept that they give u a pitcher of the size of a glass with barely any fruit i truly cannot understand why this place has 4 stars. service was fine. decor not spanish and very poor, food EXTREMELY LACKING in every aspect. I have never written a review before ever but this place is such a ripoff i had to IF YOU'RE FROM SPAIN OR KNOW GOOD SPANISH FOOD DO NOT GO TO THIS PLACE", "author": "Pablo C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-06-21", "description": "to me, the food was oily and over priced. my friend really enjoyed his $30 pig leg though.", "author": "Chris B."}], "servesCuisine": "Spanish", "priceRange": "$31-60", "name": "La Vara", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "268 Clinton St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/YnPJLj7vWlk4BsQhN7nuDA/ls.jpg", "@type": "Restaurant", "telephone": "+17184220065"}