{"aggregateRating": {"reviewCount": 339, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-08-02", "description": "Very good food, very tiny portions and very expensive. I don't like spending $50+ dollars at a place (food alone) and leaving hungry.", "author": "Kunal S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-24", "description": "Yes.  Delicious tapas in a perfectly charming setting (inclusive of a backyard), and the only restaurant on a leafy, tree-lined residential street in Cobble hill.  You feel like you are getting away when you go to La Vara...\n\nTons of specials-which the waitress like to read from memory? Not sure if that is the best way to execute as it gets loud in there and you can't hear the lengthy, non-intuitive names  (ie mar Y montanas stands for a seafood dish).  Anyhow, the waitress actually commended herself on her ability to not need to take down the order, and her uncanny ability to recite all 40 specials off the top of her head.  Sadly, she got one of our dishes wrong...not a big deal, but we ended up paying for a dish we never ordered...\n\nMoving onto the food...Really delicious flavors...Listing top ten.\n\nShrimp: Head on shrimp - cooked perfectly, head edible\nSquid and pork ribbons- Call back to Txikito menu-also sitting in some type of delicious broth, not quire sure what it was- but this dish was killer\nFideua- Paella with seafood and sausage.  Got two orders it was so damn good.\nLamb Meatballs- Perfection.\nBraised beef tongue- nicely braised and doused in a delectable tomato sauce.\n\nOther standards:\nJamon and Pan con tomate- heads up, if you're a big cured meats fan, not a ton of that here, but included in some dishes\nHeirloom tomato salad with manchego- solid\nBacalalo stuffed peppers- Solid\n\ngreat cocktails, great cocktail glasses...nothing felt forced upon you (ie only spanish wines in short glasses, etc). pretty much everything you could want, including speedy service and a plethora of menu options.\n\nhighly recommend. Great for a date or groups. My new favorite place.", "author": "Moo K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-13", "description": "So glad we finally tried this place. The food was all amazing and plenty of dishes for my vegan wife. The staff were great and the chef is charming and is almost poetic in his description of dishes as he delivered them to our table.This may be the best place in this part of Bklyn. I don't remember what we had (don't remember what I had for breakfast) but it was all great.", "author": "Dean B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-06-05", "description": "Another failed attempt to replace the Cafe on Clinton with a pretentious substitute meant to cater to the ethically-challenged money boys pushing out the few humans left in the neighborhood. \nBad service, bad decor, bad food, bad attitude. Bad everything.\nLike Breucklein, it too will soon go under. Now if only it could drag down the Williamsburg outpost Ted \u0026 Honey (so cute that name!) next door, that would be a twofer.", "author": "C Q."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-11-27", "description": "This must be the place. Well, being still relatively new to Brooklyn and knowing there is still many more restaurants to try, I'll say, this must be the place...for now. Damn. Definitely the best restaurant so far. The food is all so good. Small plates. Awesome. Awesome small plates. Try the acorn squash dish and chick pea stew for sure. But you can't go wrong with anything, apparently. I can't wait to go back.", "author": "Nick G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-19", "description": "Great!  Loved the clean, white look of the place.  We had the best seat in the house, a nice booth right in the front window - ask for that if you are a group of 4.  We had the sardines, fried artichokes, the jamon croquetas, the rabbit, the lamb meatballs and a couple of specials - one was a fish filet in a harissa sauce and the other was a take on a deviled egg.  Delicious food, only wish we could come back and try everything else.  Perfect pacing.  Very nice, friendly service.", "author": "Sally S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-07-23", "description": "Lovely styled place, with nice service and a few tables that don't make you feel like you are on a train during rush hour. However it is overpriced for what they give you. The staff made a suggestion as to how many dishes for us to order and although I agree with others that the eggplant is great, it just wasn't enough food at all to call it dinner. If you leave an establishment thinking about the possibility of pizza later or wondering if you have a snack at home, its not worth it. I'd looked forward to the possibility of returning, but the food is not consistently good enough nor sized correctly to make that possible whether or not I have a wage raise. Makes me a little sad as its in my new neighborhood.", "author": "Vivian M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-17", "description": "Take note, Buttermilk Channel, Frankie's, Talde, and the rest of you overhyped restaurants - this place is the real deal, and you should all be taking notes.\n\nMy husband has been wanting to try this place because he is a Spanish Jew. We walked in for dinner this evening, and were greeted by the nicest people. We were seated immediately, which was fabulous. This place is not overdone. It's actually quite lovely. Our waitress was just awesome. She was friendly, knowledgable, and ever present, without being overbearing. She even asked us from the beginning if there was anything at all that we couldn't eat. That was really cool as my husband has recently been diagnosed with a disorder that prevents him from having anything with seeds.To start, my husband had the quail egg appetizer, and I had the fried eggplant. Wow! I didn't have any quail egg, but my husband seemed to really like it. The eggplant was amazing. It was very lightly fried eggplant sticks, over honey and a soft cheese. I've never had anything like it. Even after I finished the eggplant, I dipped the bread in the cheese just to finish it. We shared a glass of sangria. It was wonderful. Authentic, and not at all saccharine. \n\nFor our main course, my husband had the noodle paella, and I had the half chicken. My husband loved his paella, only he wished it had been a bit bigger. The chicken was delicious. Cooked perfectly, tender, and the skin was just amazing. It was sitting in a juice/broth, with caramelized onions. It was savory, and flavorful. I was surprised it didn't have anything on the side, but I'm not going to complain. It was a big dish. I had to take some of it home. Once we finished, our waitress kindly wrapped my chicken up in the cutest aluminum package that she fashioned herself (sometimes, it's the little oohs, and ahhs that can be exciting). We didn't think we were going to have dessert, but we decided to look at the menu. Our waitress told us of a special dessert they were serving- a french toast-type dessert with a syrup that I cannot remember. We decided on that. Holy g-d!!!!! It was like a little french toast custard of sexiness. I honestly didn't think it was going to be so good. One of the few times we actually savored dessert. We didn't want it to end. \n\nMy only real gripe is that they allow very young children after sundown. As the mother of an 8 year old, sometimes I want to go somewhere nice without kids. And when i'm paying good money, I don't feel like hearing screaming toddlers, throwing utensils on the floor. It's completely disrespectful, and we all know that Cobble Hill, and Park Slope parents cannot be trusted to mind their own little heathens. The restaurant should put in a policy about this. As far as price goes- they are a bit on the expensive side. However, this is one of those times when it was actually worth it. It's one of those restaurants you go to when you want to treat out-of-towners, or a romantic partner to something really different, and amazing. This place will win you points, regardless.", "author": "R A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-06-23", "description": "Expensive as all get out. As in, impossible to get full without mortgaging your house unless you do what we did and just fill up on bread. I'm pretty sure we tore through at least 4 plates of bread and it's not even like the bread is anything special. It's just a vehicle for sopping up all the delicious sauces/juices from the various dishes. I mean, don't get me wrong, the food is pretty great, albeit nothing mindblowing. I just don't think you can justify it given the tiny portion sizes and high cost. Believe me, I have no qualms about dropping large amounts of cash if it's justified (which in some cases it is), but I can't find it in myself to do it at La Vara. \n\nWe ended up getting the eggplant w/ honey and cheese which was pretty stellar and followed that up with the lamb meatballs and mint yogurt. Again, another great dish and both had me licking the plate clean. It didn't help that the servers kept trying to clear dishes off before we had finished and yes, we had 3 or 4 different waiters attending us. It probably had something to do with us arriving shortly after opening for dinner so the place was pretty empty. We also got the stuffed rabbit loin (pretty decent) and the suckling pig which was fantastic (nice and tender inside with crispy crackling skin) but quite pricey at $30. \n\nThe pacing was also pretty off as well as we often felt rushed to finish a dish so that the following dish wouldn't get cold (which ended up happening with our lamb). I can't really fault the food. I just wish prices were more reasonable for what you get... and we still had to get a second dinner a couple hours later to sate our hunger.", "author": "Andrew L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-01-06", "description": "Nice but overpriced. Also, some of the tapas have too much flavor, pleasant initially but hard to finish. The wine we tried was nothing special.. Only the surroundings, walking in Cobble Hill at night, are worth coming back.", "author": "Margarita I."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-13", "description": "Awesome food, but we had to wait two hours(!) for a table. Our friend was insistent on waiting, and it was great food! The staff was great and the food arrived quickly once we sat down. And they did warn us it would be two hours. I would probably eat here again but only with a reservation. (they don't take same day reservations)", "author": "Dj E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-21", "description": "I love small plates. With a few adventurous people, you can try such an array of flavors. La Vara is a very small restaurant. We got in just under the wire; we waited about 20-30 minutes, with later arrives quoted times of 1 hr or more.\n\nThey have a nice cocktail menu, with a surprisingly large number of gin based drinks. The menu is extensive with good selections in various categories of fried, bread, salad, warm and other categories. Vegetarians rejoice! There are many good selectins for you. The list of specials was long and they all sounded great. In fact our order went something like this \"we'll take them all\". We excluded two of about 8 specials and picked 4 items from the menu. Lots of stuff I had never had: sea anemone (sorry Nemo, your house is delicious and tastes like oysters) andsea cucumber (bit firm of texture but delicious). The only dish that missed was a special salt cod relleno (stuffed pepper); not because it wasn't delicious, just because it wasn't as great as all of the others. The winners were the regular menu lamb breast and eggplant \u0026 honey, the special suckling pig, a special squash and black-eyed pea dish, and the sea cucumber. \n\nEverything was awesome, and the server was genuinely appreciative of our wait and very helpful with the menu. The wine list was reasonably priced with great picks. This place rules.", "author": "Rob B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-30", "description": "Opened yesterday and already quite the crowd on its first Friday night. Not a long wait though. Got there at 8 and they said 30 minutes, but spots opened up at the bar within 15 minutes. Every dish was delectable (most notably the roasted chicken) and the Sangria was super tasty as well. But above that was the good-natured staff. Excited to serve and answer questions -- they even clapped with excitement when we were able to get seated at the bar before a table opened up. Can't wait to go back! And excited to see what the brunch menu looks like when they start serving it. Definite recommend.", "author": "Todd W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-15", "description": "Found this place through a yelp search and was very satisfied with my choice. We went during the week and did not have a reservation, however only waited about 10 mins for two seats at the bar. A table was going to be available soon, but we were hungry and not picky about where we were sitting. I would give the food here a 4 but the service was a clear 5 were we were. The bartender was attentive and soooo friendly and knowledgable. The restaurant was featuring a list of specials that all sounded delicious, so we ordered 3 of them: tomato cucumber salad with fried baby shrimp on top, green peppers stuffed with cod, and cauliflower fritters. All were delicious. The salad was particularly tasty and the texture was interesting because of the small crunchy shrimp. After that we ordered the tomato bread with cured tuna and nori and the seafood paella. My other half loved the tomato bread and it might have been his favorite. I, on the other hand, wasn't a huge fan since I am not really into intense fishy flavor. Last, but not least, the seafood paella was amazing. Oh my, so good. It was perfectly seasoned and packed wi seafood. Definitely the favorite for me. \n\nThe wine selection was good, and the cocktails looked interesting. Dessert would have been amazing but we were stuffed. Overall, you won't be sorry for checking this place out. The food is great, the restaurant is very cute and the staff was pleasant and attentive. It's not very big though so if you plan on a weekend, a walk up might not work out for you.", "author": "Jamie U."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-10-11", "description": "Check your local event calendar to be sure the staff of La Vara doesn't have a better place to be, because the Spanish tradition of late dining doesn't extend this far south in Brooklyn if they do.  \n\n(Body paragraphs redacted by yelp censors.)  \n\nNow I have a belly ache because I had to bolt my food and wine, which, as far as I know, is not in keeping with Spanish tradition at all.", "author": "Gavin A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-17", "description": "Yum.  Love a good Tapas place and this hit the spot.  Lots of different things to try on the menu.  The taste and presentation were spot on.  Really impressed with the level of service and how quick the orders came out.  There were a number of specials, each sounding better than the last.  Recommended. You might need a reservation.", "author": "Jeff L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-26", "description": "A terrific place to order a bottle of wine and some tapas. Located where Café Clinton used to be, Lauren Vara has undergone a complete renovation. Gone is the dilapidated bar interior. The interior is now white and silver. The patio remains but it too has been renovated. The wine menu is a winner. Plenty of range. I'm surprised they don't offer flights. It would be a great way to enjoy their tapas. Some tapas are what you would expect at a Spanish restaurant but many are unique. I was impressed with the very long list of daily specials and pleased that the waiter told us the price of each one. No sticker shock here but it does get very busy. Tables for two aren't very big but then again, this is not a huge place. There are communal tables close to the front.", "author": "Undercova A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-15", "description": "Went here last night, had a wonderful experience. A small space on Clinton, but tastefully done. Atmosphere is airy and playful, with decor that doesn't try too hard to be cool. Tight, and hard to walk around really, but overall bearable (although this was a Thursday, not sure how cramped it gets on weekends).\n\nDespite a few slip ups (hostess not paying attention, bartender forgot our glasses of wine while we waited for a table, but apologized and was pleasant), my initial impression was overall good. You could bring your wine glasses outside and enjoy the weather while you wait, and the wait was not long (for 2).\n\nThe service at the table was impeccable. Small plates were brought, as usual, when they are ready. Dirty/empty plates were taken away as needed, water refilled, etc. The server was fantastic. Accommodating, understood the intricacies of the menu and the food, and was a delight to interact with. Very profession, and she knew her shit.\n\nNow, the food: We had the lamb meatballs with mint yogurt, which were very good but not great, the meat quality didn't astound me. The roasted beet salad with sunflower seeds and oil was fantastic, the beets were perfectly done. Tomato rubbed bread with cured meats was amazing, I haven't tasted something that good in a while. Eggplant with honey and cheese was the best part. It tasted like \"french toast sticks with eggplant\" as my friend described. We also had a zucchini special appetizer stuffed with cheese in a tomato sauce. Really good. For dessert we had the olive oil ice cream (better than I expected), and the date walnut tart with sweet cream and lemon preserves. That was my favorite part of the meal. To die for.\n\nSo, for a bunch of small plates (not that small) and a bottle of wine and another glass later, the pricetag wasn't too bad either (about 80 a person). I'll be back!", "author": "M F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-03", "description": "If I lived in Brooklyn, I'd come here all the time. I'm from the New York area and this is one of the best restaurants I've ever been to. I also spent some time in Spain and La Vara's tapas were way better than any I've tasted there. \n\nMy boyfriend and I came on a Saturday evening. We only had to wait 30 minutes which wasn't so bad. At first I was a little hesitant to sit at the bar, but the bartender was great company and served us some delicious Sangria. I don't remember everything I got, but all the dishes were orgasmic. I savored each and everyone. \n\nWhen I left the restaurant I felt so full and happy. And that's the beauty of a good restaurant. 5 stars all the way, you can't go wrong here.", "author": "Lana B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-28", "description": "Awesome restaurant that is the perfect size. It's not so large that you couldn't meet someone there but not so small that if there's an annoying party around that you hear their every word. It is cobble hill after all :)\n\nAnyways, back to what matters, the food. I've been there for dinner and for brunch. The chickpeas are great, the suckling pig is delicious but I would try to get that before you order 6 small plates for two people like we did. Bouquerones were delicious as they ought to be, service was friendly and efficient.\n\nBrunch is such a relief because it offers something different from what is often the most boring meal period of the day. Squid ink in your breakfast? Check. If you want to try something adventurous this is a good place to go. Don't go if you're trying to pinch pennies, come here when you aren't worried about how many pieces come on each plate. Dining should be enjoyed not balanced between cost and food quantities. Every plate had just enough for me :)", "author": "Etan B."}], "servesCuisine": "Spanish", "priceRange": "$31-60", "name": "La Vara", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "268 Clinton St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/YnPJLj7vWlk4BsQhN7nuDA/ls.jpg", "@type": "Restaurant", "telephone": "+17184220065"}