{"aggregateRating": {"reviewCount": 339, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-12", "description": "Underwhelmed. Definitely did not live up to the glowing press or Michelin rating.  The space and atmosphere are great but, the food was mediocre and the service was spotty. A couple of forgotten courses met by attitude when we reminded the server. No need to seek it out in a borough of great options.", "author": "Vince G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-17", "description": "KenScale: 8.5/10\n\nLa Vara has long been on my hit list of Brooklyn restaurants. Helmed by chef Alex Raij and her husband Eder Montero (whose other restaurant El Quinto Pino I visited last year and enjoyed my meal), it has been gaining acclaim for its reinterpretation of Spanish cuisine with Moorish and Jewish touch. On my recent dinner, I couldn't quite pinpoint how different influences were all coming together, but didn't really care because the food at La Vara is generally outstanding.\n\nThe dinner menu consists of mostly shareable tapas plates. Spiced fried chickpeas would be a great snack anywhere at a Spanish restaurant, and the crispy eggplant with honey and melted cheese was also wonderful with its rich complexity of flavor within a single bite. Migas aragonesas, a dish of hand torn bread and chorizo, grapes, rosemary and pastured egg, was another winner. I was deeply impressed with how the different ingredients were coming together yet the dish itself wasn't that heavy but rather delightful and fun. Fideua, a noodle style paella that came with shrimp, squid and clams, also had a nice touch, although I wish the portion were slightly larger. Spanish red shrimp a la plancha was rather small compared to the somewhat hefty price ($21 per two on my last visit), but the crunchy texture of the shrimp was still memorable and I probably could've had at least 5 more of those. On the other hand, pollo asado, a giant half chicken roasted over spiced onions and cumin, was more satisfying in portion and I did like the spicy kick of the otherwise nicely cooked chicken. The winner of the meal on my visit, however, cumin roasted lamb breast. I was absolutely in love with the juicy texture of the meat with great balance of flavor thanks to simple preserved lemon-date condiment. All of the dessert dishes that my dining party tried were great as well. None of them were overly sweet; from homemade olive oil ice cream to Galician almond cake. The best of the bunch was this dish called Egipcio that consisted of orange blossom scented date walnut tart, lemon curd and sweet cream. It was absolutely delicious and I couldn't stop digging it!\n\nThe restaurant, located on a quiet corner of Carroll Gardens, has that cozy neighborhood vibe of a typical restaurant in Brooklyn that I love so much about. Getting a reservation wasn't that difficult, although the restaurant became quickly packed by the start of my meal. There is extensive Spanish wine selection (unfortunately I don't know much about Spanish wine, but the bottle of white that we was crisp and worked well with various dishes). La Vara is one of those places that I would love to come back either for full dinner or even quick wine and snack time. The cooking here is serious and elegant, especially in easily shareable format where you can get a taste of a large number of dishes to explore the culinary beauty of Spain.", "author": "Ken S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-19", "description": "Came here to celebrate a friend's birthday. I made the reservations and we had a few changes, but they were very accommodating. \n\nBetween the 4 of us, we ordered 12 plates to share. Our waitress was incredibly cool and approved our choices; she even adjusted some of the serving sizes to fit what she thought would be sufficient for our group. We started off with a pitcher of red sangria... pretty standard and tasty. It was enough for 5 full glasses.\n\nHere's the line up of what we ordered on the menu... plus a few specials they had that night:\n\nAlcachofas (fried artichokes) - I enjoyed these, but it was probably our least favorite dish\nBerenjena con miel (crispy eggplant) - SO GOOD. Everyone throughly enjoyed it.\nHuevos Rellenos (deviled eggs) - If you love deviled eggs, you will love theirs! If you don't care for DE's then you'll likely find these to be meh?\nPincho de Cueta (chicken hearts w/ fresh herb salad) - the combination of the chicken heart and salad was good, but on their own the hearts were.... different/interesting. My group couldn't decide whether or not they liked it, but I thought it was a good dish for the more adventurous eater.\nCordero al ajo Cabañil (roasted lamb breast) - This was really awesome... it was more like pulled lamb meat put together into a log and seared a second time. Def get this dish!\nAlbóndigas (lamb meatballs) - these were yummy and a perfect dish to share... not mind blowing, but the meatballs were cooked perfectly and flavor was good with great sauce\nFideuà (paella) - VERY small portion, BUT very good... they use short thin pasta noodles in lieu of rice, plus a white sauce that oddly made the dish reminiscent of chicken and rice... except in seafood form if that makes any sense. Came with clams, octopus, and shrimp.\nButifarra con Mongetes (Catalan sausage) - meh... the sausage was decent on it's own, but we agreed that the greens it came with took away from it's flavor\nCochinillo (suckling pig) - WINNER WINNER PORK DINNER! You have to get this dish. SO delicious. Our table's favorite of the night.... and I saw a bunch of suckling pig orders coming out of the kitchen. Nice portion size too.\n\nThe specials... I can't remember any of the names, but will describe:\n\nPoached egg over asparagus and mushrooms - unfortunately the poached egg was overcooked and was a disservice to the dish. The yolk was over medium and the rest was forgettable.\nDuck breast - very thinly sliced duck breast with what kind of tasted like a chimichurri sauce... cooked perfectly, but forgettable and disappointing as well\nSalted Doran (I think that's the name? It was fish) - this was great and very enjoyable\n\nI feel conflicted, because most of the dishes were well done and better than average... but it was so expensive and I don't feel that it was worth the price. Our bill came out to about $243 for 4 people, but I think we could've gotten our monies worth elsewhere with the same caliber. So while it was a good experience overall, it is too pricey to justify a return visit.", "author": "Tran T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-08", "description": "Really some out of this world food. The rabbit and duck dishes were great. The migo bread as well. Price for two with dessert (but no drinks) was $140 before tip. We were satiated but not full- so a bit expensive for the size of dishes.", "author": "Kate D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-10", "description": "La Vara is a small neighborhood one Michelin starred restaurant in Cobble Hill, NY. The focus here is Spanish/Moorish small plates which was a cuisine that was excited to try given I have never had experience with it before. Our night started with a seating at a small table in the main dining room. Eating inside feels very much like siting in someone's home and is welcoming as surrounding tables could easily, and often do, carry on conversations. The kitchen and bar are easily visible and their compactness is almost baffling with the creations that are pumped out.  Our meal started with a glass of the white and red sangria which were perfectly boozy and sweet to get our palates prepared. Regrettably we chose a few plates that were fried (chickpeas) and although they were delicious they also filled our bellies quickly. As a result, I was only able to sample the suckling pig which was a tad fattier that I would have preferred but was overall one of the richest dish I have had. Our server was great at explaining dishes and gave us enough personal time to enjoy the meal together. La Vara was a fun dinner with great new flavors. They did everything with class and excellence that evening and it was a treat to dine with them.", "author": "Ben T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-03", "description": "Wonderful place in Brooklyn. Small,plates are the best, but they also have dinner-size portions. For two of us, we had 4-5 small plates (some are just a bite of two) plus dessert and it was perfect. Nice wine list. Spanish style and delicious!", "author": "A T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-13", "description": "Fancy lil neighborhood haunt. \n\nFOOD: The suckling pig and cucumber salad were the favorites. You should get these if it's your first time here. Forego the fried chickpeas and seafood gazpacho for one of the many other tasty apps. \n\nDRINK: The tempranillo rosé was moderately priced, dry and delicious. \n\nDESSERT:  nothing on the dessert menu enticed us to stay. And with so many good local ice cream and dessert spots you might as well walk around the neighborhood.", "author": "Jason F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-19", "description": "Been wanting to try this place out for a long time. Finally, I get my chance, and what do I do? Eat brunch here. Ugh, I'm still shaking my head over that one.\n\nGo to a tapas place, eat tapas. Not the same brunch eggs that every other restaurant in Brooklyn will be serving on a Saturday afternoon. Although to be fair, their egg dishes are way more interesting.\n\nOh well. So we started off Bloody Mary's which were great. We ordered a few dishes to share: patatas bravas,  Huevos con Migas Aragonesa, and Tortellita de Gambas. The patatas bravas were solid, but a little overcooked and overall kind of unmemorable. The Huevos con Migas Aragonesa was a dish of fried eggs, chorizo, bread crumbs, seared grapes, and sweet onion, which to me sounds like the best stuffing ever, topped with eggs. It was quite delicious despite that the chorizo made the dish a tad salty. The Tortellita was also pretty yummy, with eggs, a chickpea \"wafer\" and dried shrimp. \n\nService was great and the experience was enjoyable despite the presence of screaming babies, but the true experience will be when I come back for dinner!", "author": "Steph C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-04-26", "description": "Yeah... This place is cute as hell and concur with my fellow Yelpers. \nThis is not the mission I'm on, My mission, if you will is to drink a cocktail after the Yankees lost with my buds. (Go Yankees!)\n\nI pass this place and there's a bar. Bar=Beer right? Also, I like a front of the house hipster hostess. With hipster hostesses, anything goes and no one is judgmental. The older uptight folks are being replaced with this younger mind set.\n\nThis is not the case with La Vara. We walk in and everyone is eating and enjoying the food. We slide to the back of the bar and this old, frog face manager tells us we need to move to the front of the bar. He's all eyes on us. I can sense his Sith Hatred. We're not tattoos bikers and we're not loud. What gives dummy? \n\nThe bartender is ignoring us and this dude is watching us like a hawk. Now I wanna grab the guy and take a picture with him. (Singing - Why ya gotta be so rude..)\n\nWe had three cocktail, left a tip and split. If I was a 15 years younger, I would have grabbed this guy and kissed him on his stupid bald head while my buddies laughed and snapped a picture. They didn't have cell phone cameras back then.. \n\nLa Vara, Nice place to not grab a drink with your buddies, especially the one wearing a Mets Jersey.", "author": "Bill S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-22", "description": "Delicious food on offer here that starts La Vara with five stars, but the service is lacking. My friend asked if something could be substituted, and the response was a terse, almost nasty, \"We don't do any substitutions here.\" A second waiter said the person providing that information was wrong--good to hear--but that initial interaction set the wrong tone. The service after that was inconsistent, with one part of our order forgotten and no apology when pointed out. There were many waiters and very few customers, which made the mediocre service much less excusable. Anyway, I'll go back, but with average expectations.", "author": "Jeff H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-11", "description": "I'm in love with their food and their attentive service!\nThe portions are pretty small but I was aware of that because they serve tapas.\nMy absolute favorites are the lamb breast, the lamb meatballs, the croqueta del dia (went there twice and got the ham croqueta first and the blue cheese the second time), the crispy eggplant with honey.\nI always tried their specials of the day and they were always very good.\nThe restaurant has 1 Michelin star but the atmosphere is very casual!\nLove love love it!!!", "author": "Edvige C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-03", "description": "It's no surprise that this is a Michelin rated restaurant. The food was incredible and the service was excellent. The fried chickpeas are a must!", "author": "Brooke H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-06-11", "description": "I had high expectations for la vara after recommendations from friends and they hype. The flatbread was a laughably small portion. Most of the portions were on the small side which made it difficult to share some of the dishes. I really liked the paella but wasn't wowed by anything.", "author": "J. Karim A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-01", "description": "A tapas restaurant with the pedigree of Txikito, but approaching it by way of Moorish and Jewish influences.  Tucked discreetly in a quiet, residential Cobble Hill block, La Vara is a cozy place of exposed brick contrasting with white.  Suited for small groups and quiet dinners, although there are two banquette tables by the windows for larger groups as well as some bar seats.  This low-key restaurant quickly garnered attention after opening, and seemed deserving of it at my visit.\n\nLengthy menu divided into snacks (pica pica), fried (fritos), breads (panes), cold (frios y ensalata), hot (calientes), and desserts (postres), with full ingredient lists of each.  Be ready for the list of specials.  As your server describes each, it may sound nearly as long as the print menu.  As typical of NYC tapas, portions vary, but few are likely to approach standard entree sizes.  Most are sized for sharing among small groups of 2 - 4, and this is the best course to take.\n\nThe food was lovely to lay eyes on, colors and textures arranged or mounded to create a beautiful palette in every dish.  Flavors were no disappointment, with great use of textures.  Among the refreshing, there were tender artichokes and fava beans bound by a silky poached egg and showered in bits of crisped crumbs.  A tower of fried mini shrimp cluster atop a smooth cubed cucumber and tomato salad, contrasting perfectly.  Quail eggs served with green tahini touched with olive oil make a good snack; a plus that the diner peels them, in my opinion.  Croquetas, varying each day, came in a pair, well-fried and tasty.\n\nRich, lingering flavors can be found in a simple dish of earthy anchovies soaked in good olive oil, doused with sesame and crushed hazelnuts, great with charred toast.  The migas, a dish of chunks of chorizo, bread crumbs, grapes, onions, and capers was a wondrous riot of flavors savory, sweet, and sour, and very fragrant.\n\nPerhaps the most memorable dish was a special, the Perol de Verduras.  This layered vegetable dish highlights the best of La Vara: well-cooked, fresh ingredients, combinations that both contrast and complement in flavor and textures, with a delicious sauce.  And a sight to behold.  It deserves a permanent place on the menu.\n\nLa Vara is a wonderful tapas place, and the best in Brooklyn, although arguably competition is lacking.  The food is inventive and fantastically made.  As expected with tapas, the cost will add up with multiple plates so plan accordingly, but hardly unexpected for the quality of execution.  At its tiny size and limited reservation policy, come early and with no more than a party of four.", "author": "Valery C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-15", "description": "Great little find in Cobble Hill. We ordered a variety of dishes from fried chick peas which were addictive, and a somewhat deconstructed flat bread served in a bowl that we could not stop eating, to a delicious crispy pork. All dishes were well prepared - we ended with the olive oil ice cream that was very distinctive. Service was on par with the food. Overall good+ experience- great value.", "author": "Patty T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-03", "description": "So delicioso...Brunchtime- one person at a table- no problem. The waitresses were so nice here.....Arrived about 11:50 and even though it became full, it wasn't \"Chaos with Carriages\", and lines the way some popular borough spots are.\n\nWent with bottle of Grisberger beer- $8\nSkate sandwich- $11\nHam croquettas-$5\n\nThe wheaty beer was quite pleasing to the palatte and a good compliment to the skate with aoili and slaw. Ham croquettas were a full of velvety potato and ham with a crunchy exterior. Mega Spanish flavors here made magically in a small kitchen and served with a laid back attitude and in such a pretty part of Cobble Hill-homerun!", "author": "Franny A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-12", "description": "A very fun, inviting restaurant! The restaurants vibe was both energetic and intimate. The food was delicious and unique, and the white sangria was amazing. Seriously, I don't usually like white sangria, but theirs will definitely have me coming back for more.", "author": "Melissa S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-11-09", "description": "Ehhhh 2.5 stars\n\nFood was probably more like a 2, but the service was really good so I'll round up.\n\nOur server was helpful and attentive. The restaurant is pretty small, and it seems like they only have 1.5 servers for the whole place, a bartender, a host, and a runner. The food comes out fast, maybe even a little two fast.\n\nThere's no dish that I really liked. And the portions are pretty small.\n\nDefinitely don't get the fried artichokes and anchoas. The fried artichokes could be good but the tips are too papery to be edible. The anchoas are sickeningly salty.\n\nThe croquettes are very creamy and has a glue-like texture, not great. The flavor of the carabieros ($21 for two) were ok, but the shrimp texture of the meat wasn't good. The cochinillo ($30) was pretty small for the price and while the skin was crispy, the meat was a bit dry and stringy. The fideua ($18) was a weird paella noodle dish. The seafood in the dish was good and the flavors were ok, but overall a bit funky. The olives were mostly the tiny ones and the red Ines were oddly grainy.\n\nLastly, the egipcios dessert was described as a tart but is more like a piece of shortbread with some  cream and lemon curd. A bit on the dry side.\n\nOverall, the food is ok to poor. Service is good though.", "author": "Diane Z."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-16", "description": "I must say that I had good good food at La Vara. The place is unique, cozy and welcoming. Everything we had was delicious (Maybe just a little greasy in one or two dishes, but not enough to damage the experience of dinning here). With good wine, you will enjoy here.\nMany interesting dishes to select from, and the starters are as good as the place.  We took the waiter recommendation (Excellent service), and everything went smooth, delicious and enjoyable. I could tell that they do a lot so each person who visit here will leave happy, and I can say that IO left happy, and I will return happy.", "author": "Nissan B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-04", "description": "All I can say is \"wow.\" Delightful service and a truly original, meltingly delicious menu. Go. Go now.", "author": "Grant J."}], "servesCuisine": "Spanish", "priceRange": "$31-60", "name": "La Vara", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "268 Clinton St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/YnPJLj7vWlk4BsQhN7nuDA/ls.jpg", "@type": "Restaurant", "telephone": "+17184220065"}