{"aggregateRating": {"reviewCount": 339, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-20", "description": "As to be expected, the results of searching for Sephardic cuisine on Yelp are far from appetizing. Along with dozens of synagogues and nursing homes, a gastroenterologist pops up, as does as a religious bathhouse. Among the handful of restaurants listed, most are Israeli and/or Mizrahi, and one is La Vara.\n\nDeparting from the average tapas offerings of most NYC establishments, La Vara attempts to capture the cultural melding, and often clashing, at the heart of Spanish culinary history...and it does a damn good job of it.\n\nWith my host of food allergies, I expect to eat a done-up salad and simple piece of meat when stepping into foodie heaven. Our waitress welcomed me to a noisy, yet half-empty La Vara with a detailed menu, conveniently coded for those with restrictions. So instead of eating like a rabbit, I ate one. The Conejo en Escabeche reminded me of an elegantly plated Moorish tagine, yet the bitterness of cooked olives perfectly balanced the sweetness of this dish. \n\nMy dining companion initially dismissed rabbit as 'flavorless' and olives as 'briny'. He devoured most of it, leaving me to the Cordero Al Ajo Cabañil which was almost as perfect. Overwhelmingly doused with cumin, the lamb paired brilliantly with the tart lemon-date preserves and acidic barbecue-style hot sauce dabbed across the plate. The condiments really hit home on the Sephardic front, the sweetness of dates and zest of lemon masked the lamb's gaminess similar to the lard/garlic treatment used by non-Muslim/Jewish Spanish chefs. The portion was generous and a tad bit overcooked, but I didn't let a bit of char get in the way of cleaning the plate. They'll offer you pieces of hard-crusted bread to sop up the sauces. Take them up on it, if you're able.\n\nI was thrilled to see traditional Migas on the menu, and forced my partner to indulge on an order... which he gobbled up in a fit of bliss.  Our waitress recommended the an egg-covered stew of fava beans and artichokes, which was more like a hot salad and lacked any distinctive flavor. \n\nAs per usual, I appetizered for dessert and went with the Escalivada, also a server recommendation. By far the richest dish of the evening. If I could take a bath in a vat of that romesco sauce, I would. A bold, spicy, and nutty base for the leeks atop it. Gold. My partner went for the Churros and licked away the bowl of dulce de leche that came with them. \n\nThe pitcher of sangria we ordered lasted 'til the very end, and so did our waitress, who stuck around after her shift was through to make sure we were satisfied. One of the best meals of my month... if I only could have heard myself think while eating it.", "author": "Danya D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-03-21", "description": "Food was good and the wine was great. \nThe servings were way too small for the price. 7 of us ordered 16 dishes and we are all still hungry. Not the place if you want to eat hardy. Great for a date. \nPaella dish was very good. Definitely the best one we ordered.", "author": "William W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-08-02", "description": "Went there with the intent of having the Sepia, since I never see it on menus in New York. I ate sepia (cuttlefish) a la plancha, almost every week while visiting my sister in Spain. Sad to say, it was not available. Had to settle on other edibles.\nThe restaurant itself is a no-nonsense, plain, white, hard chair, small table kind of place. Waiters are friendly and attentive. Not a cuddly kind of place, not even ethnic, yet, there were menu items that piqued my interest since I had not seen them here in NY. Other Spanish restaurants seem to stick to the Paella/Lobster regime, while this one dug a bit deeper.\nThe \"amuse\" was not even amusing, since it came to my partner and I on two Chinese spoons, one tiny fried olive in each. We didn't want to offend anyone, but it was such a tiny amount of anything, it was hard not to laugh, and flavor certainly not enough to describe. I know these portions are supposed to be tiny, but this was ridiculous! I am surprised the server wasn't hysterical bring them to us.\nNext we had their croqueta del dîa. It was supposed to taste like Serrano Ham, but strangely, the only taste that came through was a shadow of truffle, and something cheesy. I do not recommend these particular croquettes, they may have others which may be more pronounced, but these were not. They were also small, and at $5, they were not worth $2.50 each. We ordered the fried artichoke, with a alioli/anchovy sauce. The artichoke was very good, the sauce... eh? Didn't taste the anchovies... they were cleverly hidden ($9). In Spain, the artichokes are fried in olive oil, tinged with salt and garlic. Did not taste either flavor. We than went on to the Salt baked fish of the day with harissa ajada. For $31!! two fillets, that were perfectly cooked, and their harissa ajada was very intense, had a ton of flavor, with cumin, turmeric, other middle eastern spices, but caraway was the surprise. The harissa gave the sauce it's umpth. Loved it. Next course was the lamb meatballs in a yogurt with mint surround. This was pleasant, though must say, the meatballs were not tender, in fact, they were on the hard side, though tasty with the mint.. Not sure how much they were, but there were 6 small meatballs, and just enough yogurt to eat them with. Dessert!!! The best part of the meal, and the servings were decent. If you eat there, you must have the olive oil ice cream. It is a dream. What a mouth feel! creamy, rich, olive-y, outstanding. In each bit, you could really taste the olive oil, and it was dusted with salt, which made it oh so much more interesting. We had the almond cake, too, with what tasted like a dried cranberry coulis. This was also great, if you love almond. They were both $8 each. I would say in all, it was an extremely interesting menu, whether I agreed with it or not. If you go to La Vara (the road), have the ice cream! It's a must for your taste buds! Also a well layered wallet with lots of green paper.\nBy the way, they have a nice outside garden area, but it was too damned hot and sticky to sit outside. Luckily, people came in with kids, and they all seemed to sit outside. It was loud enough at 6:00 pm on a weekday for screaming children, too.", "author": "Laurie S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-16", "description": "Don't come here if you're some weirdo who likes to make substitutions or who avoids food with ingredients they can't pronounce. If you're one of them, just leave...go away. No one likes you.\n\nLove the artichoke, the paella, and the bread and chorizo dish. OLIVE OIL ICE CREAM. Just. Get. Everything.\n\nMinus a star for the weird cocktail list and the prices that are just a biiiiiit too much for the portions.", "author": "Amber S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-05", "description": "This is a great place to have a pretty affordable Michelin star experience in NYC.\n\nI've been to La Vara twice now. The first time with a couple friends, the bartender was exemplary and shared so much with us about the sherry that they have. A couple weeks later took my mom there when she was visiting the city because I knew the experience I would be getting. Made a note to get the fried artichokes and the suckling pig again the second time, but didn't have a plate either time I wouldn't get again. \n\nThe space is great on a quaint street in Brooklyn and the service is remarkable. Make a reservation and get out to Cobble Hill.", "author": "Daniel R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-30", "description": "My fiancé and I just came to eat here... we didn't want large amounts of food so we searched for a place that offers small plates and came across this gem. We ordered the crispy artichoke, the crispy eggplant, the zucchini pancakes, the deviled eggs (all 10/10's), the ground goat with pasta, the swiss chard wraps and the date tart for dessert (7/10's). \n\nIf you're looking to be stuffed this place isn't for you because all of the portions are really small... even having ordered all of that between the two of us, we could still go for another meal or two!\n\nOverall we loved the ambiance as well at the service and would highly recommend! \n\nI would suggest making a reservation because the place is a cozy size and they can get pretty busy making the wait long.", "author": "Mrs. S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-26", "description": "Service ok, food AMAZE, wine AMAZE, ambiance good, desserts awful. My husband and I ordered 3 desserts- all bad. Ha. But I still give this place 4 stars. Will be going back. Just not getting desserts.", "author": "Julie L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-27", "description": "Exquisite food and terrific service...that's what I took away from my experience at La Vara. The rabbit, suckling pig, and fried artichokes stick out in my mind as really exceptional. The menu will likely be completely different when you visit, but I think the pig and chokes should generally be available. Definitely check those two out if you can!\n\nA note on service...the bartender was ridiculously knowledgeable and friendly, and when we asked about their very unusual sherry she launched into a mini lesson on the history of their particular offering. She was FANTASTIC!\n\nThere is a reason a place gets a Michelin Star, and La Vara proves they are definitely worthy.", "author": "Curtis H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-10", "description": "I stopped in last night to celebrate my belated birthday dinner with my date.  I was torn between a 4-5 stars but the overall experience and service was great! \n\nDecor: very clean and elegant, hardwood floors and white walls, ample bar space to sit down and several tables outside. We sat outside on the back patio there were only 3-4 tables. Granted it was 86 degrees the whole day the back was shaded by a huge tree and the temperature by 6pm dropped. \n\nBeverages: SANGRIA, mind blown I had one glass and was wobbling out of there. Date had two glasses and had to drive to Beantown. I couldn't imagine how I felt so loopy.. They put gin in their sangria along with sugar and apples and lemon. Well I knew from that point on I was going to like this place. \n\nFood: We had one Fritos and two calientes. Mind you I'm not a big fish eater and majority of this menu was fish or had some in it. We started with the alachofa ($9) fried artichoke with anchovy alioli. So fingerlicking good. Perfectly crispy, not oily. The alioli was smooth, not fishy, didn't have an after taste and a little zesty. \n\nSo last time my date and I got together he had goat tacos so we were still on the kick and went with the Gurullos. Loved the handmade murcian pasta. Yes the texture might be acquired for some because it's slimey. But there was a lot of flavor in the ground goat. I wouldn't call this a summer dish because of the smokey flavor of the meat. Would love to make this on a nice fall night, with a glass of red wine by a fire. ($15)\n\nThe last dish of this epic meal was the suckling pig ($30), slow roasted pig with crispy skin. Pretty sure my eyes and I perked up when I heard pig on the menu. They meat didn't dry it was still juicy. Anthony Bourdain would've loved to be part of this meal. Clearly I'm not Kosher.\n\nService: Nick was awesome and personable, he shared his own experiences growing up also not liking fish, spicy food and only shellfish. Service was attentive and our water cup was constantly filled. He knew the menu and he told me what was in the sangria. \n\nTop contenders: for next time..Conejo en escabeche - stuffed rabbit ($18), Albndigs- lamb meatballs ($12) and Fideau- paella with shrimp, squid, clams alioli ($16)", "author": "Debra E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-11", "description": "I came here with co-workers last night for a staff dinner. Our table of six was seated relatively comfortably in a round table by the window. We ordered around ten dishes to share, and the restaurant gave us two small plates on the house while we were waiting. I won't even pretend to remember exactly what every dish was. However, I can say that they all tasted amazing. A special shout-out to the tomato in sizzling cheese, served with charred bread. The best thing I had, though, was definitely the chicken - what WAS that sauce? It was subtle but added so perfectly to the meat, which was slow roasted and tender.\n\nI don't really drink, but my coworkers had two gin and tonics, a vodka martini, and some wine. They all said the alcohol was wonderful.\n\nDesserts were varied and interesting: the tart with rich hints of sweetness, the almond cake almost overpowering with its tart, sugary, chewy consistency, and the custard - such a light but interesting flavor. I also had a cappuccino which was delicious and comforting at the end of a meal.\n\nThe staff was pleasant and on-point, perfectly describing each dish, always keeping water glasses filled and taking away empty plates. The lights were dimmed soon after we got there, everything was very clean, and the atmosphere as a whole was perfect.\n\nMy boss picked up the check, so I can't speak about prices.\n\n5/5.", "author": "Alla P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-29", "description": "Delightful cozy restaurant. Everything we tried was just delicious. The service is spot on, the wine excellent, great date spot.", "author": "Tara C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-10", "description": "This is the kind of place you come to, take a bit of the food and sit there with your mouth frozen, your taste buds tingling and your eyes closed... For a good, solid minute. This pretty much happens with every bite you take and every dish you order, so you should probably warn anyone you come with that you may not be very talkative. \n\nDishes I recommend because you shouldn't live without:\n1) Berenjena con Miel (crispy eggplant w/honey, melted cheese \u0026 nigella seed)... did you hear the part about the eggplant ...that's CRISPY? with honey? and melted cheese? ok good. i google image this dish sometimes, that's how good it is.\n2) Albondigas (lamb meatballs over mint yogurt). \n3) Alcachofa (fried artichokes with anchovy aliol). I don't even like anchovies! but I'll eat this. For breakfast lunch and dinner.\n\nAlso the salt baked fish, the half Murray's chicken, the paella, and pretty much every single thing on the menu. You seriously can't go wrong.\n\nThe decor and ambiance should also be commended because it's pretty darn cute. I've had great service and as you can tell, a stellar experience every time I've come. There can be a bit of a wait, but you should be willing to wait for the food you're about to devour, because it's some of the best, most authentic and freshest. TTYS La Vara.", "author": "Zoe T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-19", "description": "Wow La Vara seems to have lived up it its hype, a rare thing these days. I only had very few small plates and yet I was nonetheless impressed by nearly every aspect. I passed on the \"fried\" section (!) section, but, luckily my friend ordered the fried eggplant, and they were little pieces of happiness. Only lightly fried, barely coated rectangular shaped eggplant, with sweet honey, melted in a soft white cheese. After that amazing, yet tiny dish...my 'noodle' paella was arrived. It barely resembled paella but that wasn't a bad thing. Thin, short noodles were tossed with shrimp, clams and calamari, with a huge swipe of  Aioli  to dip in.\n\nThe waitstaff is very communicative but not in your face. Sometimes, they sound like they are in a play, ultra-emphasizing every word especially the Spanish ones, but, I would rather understand what they are saying and they tell you the prices of specials which I appreciate.\n\nThe only downfall is the seating. I would prefer to  have a little more personal space so that I can hold a private conversation with my dinner guest and not edit my conversation, feeling on display. The communal tables are made up of smaller tables that could easily be separated per party but instead are put together.\n\nThe food came out rapidly-well paced and  we were given the option of whether we preferred they arrived together, or as they came out of the kitchen. The staff seemed to really want to cater to you and customize your experience. \n\nDessert!\nI had the grapefruit custard, which includes a splash of booze-try it ! Due to a misunderstanding we were comped a dessert and we also got to taste the olive oil ice cream sprinkled with sea salt. Also delicious.\n\n I can't wait to try as much more as I can the menu.", "author": "Marisa L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-10", "description": "Love this place!\n\nThe pork belly in particular is outstanding!  I could best describe the dishes as upmarket tapas.  Very unique dishes!  It is great value, great ambiance and amazing food!", "author": "Tash R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-11-23", "description": "I've been to la vara many times, and really liked this place. I went back again looking forward to it, knowing that it will probably be a good experience. It wasn't. To be fair, the drinks were good and the staff nice, yet not engaging.\nI am writing this review for the owner/chef who I know is amazing and probably isn't there as much to pay attention for small details in the kitchen which have made the food go downhill.\n\nAfter ordering, we were presented with a small amuse bouche of carrot juice and cumin in a sherry glass. This alone started the meal off poorly, the opposite of the amuse point. It was flavorless and cold. We wish it just didn't come out at all. We started with the fried eggplant with honey and cheese which was one of my favorites previously. There was too much cheese, the eggplant was not crispy and not sweet enough. The chicken hearts were good but it was a very small bite more of a snack than an appetizer and not worth $13. The migas (also one we raved about in past visits) had too much paprika and not enough grapes; it was not exciting. The croquettes of the day which were described as Serrano ham were actually some bland potato/cheese fried mush.. Not distinguishable and definitely no ham involved. The last dish, Lingua special was the worst of all. Arrived after 45 min sitting and wasn't sure it was even the right cut. It tasted like regular beef and was very chewy. The carrots were undercooked as well. Also small for the price, $18 for a tiny stew. \n\nWe really like this place in the neighborhood and this review is not to put la vara down but as a push to make it better and like how it was before.", "author": "Tomer B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-07-09", "description": "If a review was based on just \"how good is the food\", it would get 5 stars. But, since I also consider \"how good was the dining experience\" to be just as important, it only gets 3 stars. Below are some highlights based on my three visits (feel free to skip to \"Summary\" for an expedited read:\n\nFood: First of all, yes, the food is awesome, a bit rich, but awesome. Recommendations include: garbanzos fritos (fried chickpeas),fideua (seafood paella), albondigas (lamb meatballs, and pollo asado (half a chicken). \n\nValue: I am not 100% sure, but I think the prices listed on their website are not up to date, and reflect a less expensive dining experience. I also would love to recommend the crispy eggplant, and deviled eggs but I just think they are too expensive (I feel like I am eating $5 every time I take a small bite). \n\nRestaurant environment: The restaurant is small but surprisingly comfortable. There is a large booth that can accommodate a 6-7 size party. One gripe was how LOUD it was. With less than half the restaurant full on a Tuesday evening, we had to shout to hear each other over the other parties' chatter. \n\nService: They always ask you if you have been there so they can recommend you get the right amount of dishes to share per group which is nice. They also are quite helpful at suggesting menu items. But when they tell you of the specials..get ready for some serious speed talking and in my case, complete zoning out after the 100th special is read. This most recent visit, I asked for a written list of the specials, which they had, but seemed hesitant to fork over (pun intended). Lastly, there is always a frustrating amount of time that passes when you are done eating, and when you can actually leave the restaurant (a common theme with NYC dining that annoys me). \n\nSummary: Amazing food, pretty good service, small portion sizes/too expensive for what it is.\n\nFinal thoughts: Either the portion sizes should be bigger OR the prices should be cheaper. I don't need or want some endless pasta and breadsticks deal, but since this place doesn't strike me as \"fine dining\", it is simply not acceptable to charge $8 for four little pieces of crispy eggplant (which to their credit, does taste amazing).", "author": "Alison B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-19", "description": "Second time around went for brunch so I can finally get my hands on those churros. Had the fried chickpeas, poached eggs with grapes and ham and finally the churros. Chickpeas were well seasoned and great when mixed with the ham and grapes and egg dish which was a delicious example of a savory and sweet combo. Finally the churros came three a piece with a side of dulce de leche sauce. OMG, they were awesome. Light and crispy and sweet enough that I didn't need to use too much of the sauce which was a bummer because I wanted to finish the sauce. They don't have the olive oil ice cream until dinner; maybe next time I'll see if they have any ice cream just so I can have with the sauce. Service was excellent again and I love the atmosphere here. Definitely coming back.", "author": "Alex A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-06-04", "description": "Service is excellent but they take forever to refill your water glass.\nPortions were really small and salty.", "author": "Michelle R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-01-11", "description": "Food was good, but in a city with lots of great good, not worth the price at all. I will never go back. My daughter and I shared 4 tiny dishes (portions are miniscule) and a slice of almond cake. I loved the eggplant but there were a few tiny pieces for $9. The other dishes were fine, but not spectacular and not worth upwards of $18 a plate. We did love the almond cake with cherries; it was special. The meal came to $93 and I felt ripped off. ( 4 very small plates and a slice of cake, no drinks) I wouldn't come back, even to take a client using my company credit card. If the plates were double the size, perhaps.", "author": "Wendy S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-11-23", "description": "Unlike some of the other reviewers, I WILDLY enjoyed my first experience at La Vara, about a month after they opened.  It was a birthday dinner there (for myself) and the meal was delicious and memorable in all the best ways.  Exquisite execution of unique dishes and ingredients.  A quality meal and great service.  I very much looked forward to returning.\n\nFast-forward to NYE 2014.  I tried to book La Vara for a NYE dinner, about two months in advance of the date.  They accepted my reservation.  I sat smug and looked forward to the meal.  About a week later, they left me a voicemail saying they decided not to be open that night, and, oh well...sorry!  Admittedly, I landed on my feet with a reservation at Brooklyn Fare for NYE, but still, why take orders for a special dining night and then decide to close?  That was a head scratcher.\n\nFast-forward to last week.  My fiancé and I are moving out of the neighborhood and I had been telling him about my amazing La Vara meal for so long I thought I should treat him to a dinner there before we upped sticks entirely.  The meal was 'meh' for both of us.  The portions have become ridiculously small for the price.  We ordered three smaller plates and two larger, and then ordered a third larger dish to try and achieve that happy-full feeling.  Of the smaller plates, the fried artichokes stood out, but mainly because nothing else did.  The biggest offender was the anchovy dish that arrived with 4 slivers of anchovy and 3 pieces of bread to eat them with.  For a table of 2.  I mean, come on La Vara.  You couldn't have sprung for that 4th disc of baguette?  Pitiful.  Our third smaller plate was the anchovy dish which looked like a puddle of watery tomato and a few headless fish drowning in it's lifeless waters. \n\nAt this point I was hoping for a miracle with the other dishes, but it never happened.\n\nFor larger plates, we ordered the rabbit loin (which was tender, but the accompanying compote/salad was overly sweet).  The Red Spanish prawns (TWO PRAWNS.  TWO.  ONE - TWO.  THAT'S IT.) were delicious, but there were TWO.   And, the pasta paella.  They use a matchstick shape of pasta that looked (and tasted) a bit like Lipton Cup O'Soup.  Not that I think they use this there, but you could basically get the same mouth feel and flavor sensation buying a packet of the soup and added a couple of chewy clams and the teeniest sliver of calamari.\n\nWe did not stay for dessert as most of the options were dull and predictable.  We saw one of the fig cakes being brought out to a neighboring table, but it looked like little more than a big Fig Newton with a splodge of cream on it.  \n\nFive stars for our server, who was exceedingly friendly and pleasant.  2 stars for the food.", "author": "Tracy S."}], "servesCuisine": "Spanish", "priceRange": "$31-60", "name": "La Vara", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "268 Clinton St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/YnPJLj7vWlk4BsQhN7nuDA/ls.jpg", "@type": "Restaurant", "telephone": "+17184220065"}