{"aggregateRating": {"reviewCount": 339, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-09-11", "description": "My last time at La Vara was disappointing. Everyone in my group had a hard time hearing/understanding the server.  She also did not volunteer a description of the dishes.  The salad with shrimp had zero greens.  The $30 suckling pig was only the meat.  Had I been informed, I would have ordered something else. The custard and almond cake were tiny and forgettable.", "author": "Patale M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-12-18", "description": "They're coasting on that Michelin star at this point.  Food is still decent but service is perfunctory and the tables are in close quarters even by NYC standards.", "author": "Bklyn L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-07-19", "description": "So I had a craving for paella and was on the search for an authentic quality meal in Brooklyn.  I found this restaurant. Based on the reviews I thought it would be a good choice. The menu looked eccentric. Saw pictures of the restaurant and thought what do we have to lose. Now I'm a quality over quantity girl any day of the week but the portions here with the exception of the pollo asado are really small. You've been warned.\n\nThe food wasn't that great.My friend and I ordered the Alcachfa( artichokes with anchovy aiolli, Carabineros(red shrimp), pollo asado, and fideua(paella). The Alcachfa was interesting in a good way crispy and salty.The Carabineros were a joke. Two shrimp marinated in sauce for $20. After tearing off the head and breaking down the shell the shrimp were very small My friends piece was especially small. The pollo asado was tasty and juicy and the paella left more to be desired. The four shrimp in the paella looked dehydrated. The four small clams were good and the three pieces of squid were fresh and cooked well. Sigh! in retrospect I should have complained about the portions....but I felt like a fool for suggesting this place. The sangria tasted watered down and the fruits were not good. I had a slight buzz though. My friend and I ate in silence paid and left. I would not come back here. I can tell the food is cooked with quality ingredients but the portions and entrees are not equal to the prices. The only thing that helped the meal were the continuous portions of bread another waiter kept bringing us giving us a humble sympathetic smile each time as if he intuitively sensed our disappointment.", "author": "Dasha H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-07", "description": "The food, wine and service were excellent.  Our party of four ordered tapas over a four hour meal, and the service was consistently friendly and attentive.", "author": "Michael A."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-05-31", "description": "Another Brooklyn restaurant with fabulous media attention, La Vara was a major let down.  The storefront room, on a lovely Cobble Hill Street, is Brooklyn shabby meek.  There's nothing to it.  The rickety tables sit on top of each other, and there are no soft touches to absorb sound.  Yet, the cacophony of sound is actually interesting due to the internationalism of the languages spoken. This was an encouraging sign.  However, that is the only whiff of foreign authenticity at La Vara.  The tapas all sounded interesting, but what appeared at first as a culinary history of the cuisine of Sephardic Jewry, emerged as a contrived attempt to place significance on bland and tasteless tapas.  The food simply did not taste good.  it's too bad since the staff was attentive and caring.  I will admit, many of the young folks around us seemed to be enjoying themselves, but I think that was due to the wine and I didn't notice much exclamations of deliciousness.  There is something about a Brooklyn location that gives restaurants a certain panache in the minds of restaurant reviewers.  However, shabby, lousy, and tasteless doesn't become cool because it's happening in Williamsburg, Dumbo, Brooklyn Heights, or Cobble Hill.  Me thinks Brooklyn needs some accurate critical analysis of its restaurant scene.  Perceived trendiness does not translate into culinary pleasure.", "author": "Phil G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-19", "description": "I really love this place. In a city with many fine restaurants cropping up every day I rarely return to one more than once. So when I do, it's a really good sign. Everything I've had is always very well seasoned, the flavors always surprise me in a good way. They have excellent wine choices. But the one thing I love about it is that it's even kid friendly. I've taken my daughter with me and all the staff were so kind and playful with her. I'm very charmed by that cheery disposition. They always seem to have new specials. I always end up ordering up a bunch from their specials. The suckling pig is amazing. I dream about that crackling skin. Dessert is fantastic too and excellent coffee that actually gets to the table piping hot.", "author": "Yvette W."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-07-30", "description": "Good quality food and good service, but this is not the place to go if you have less money than brains. Other NYC tapas places will offer the same or better quality for a much better price. Unfortunately, La Vara does not live up to the hype, and I would not return or recommend to a friend.", "author": "Liam J."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-10-15", "description": "Came with very high expectations and was hoping to get a similar experience as Tio Pol in Chelsea. The food is good and there a good variety of original dishes but the place leaves you wanting for something a little more special. Considering the fact that it's almost impossible to get a table here on the weekends, it's hard to see myself coming back here frequently.", "author": "Wesley H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-31", "description": "Easily the best restaurant in the neighborhood, and one of my top 5 for Brooklyn.  Yes the portions are small but do you really need more food on your plate?  No, you don't.  Sure it's not inexpensive but you get what you pay for.  And what you get is super delicious flavorful food.  I've never had a dish there I wasn't completely enthusiastic about.\n\nI'm never able to get a reservation when I want one but have had an easy time walking in.  \n\nService is good but that doesn't even factor into my rating because the food is so good.\n\nI don't post yelp reviews often.  So if you want to know what other Brooklyn places are in my top 5 so you can see if you'll maybe like this place, they are:\nPok Pok\nAl di la\nFette sau\nSaul\n\nAnd chances are if you've been to all those places you probably don't need my yelp review to gauge if you'll like La Vara because you've probably already been there.", "author": "Amy R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-12", "description": "I heard of La Vara through friends of mine on the Upper East Side who never travel across the river to Brooklyn so naturally I had to venture there myself. I have so far been four times and I am always impressed. The menu is very well executed and the food is delicious. The staff is friendly and tend to go above and beyond to accommodate you. Reservations seem to be a must if you want to go during prime time. The only thing keeping me from giving a perfect review is the wine list and the pricing. The food is exceptional but not extraordinary. It is priced a bit too high for what it actually is.", "author": "Steven G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-30", "description": "I love this place!! \n\nThe food was so delicious. We had the red shrimp, the paella (recommend this), the lamb meatballs (highly recommend this), and the special of the day. We also had numerous appetizers (the crispy eggplant with honey was very good) and they had a special dessert of churros that night. \n\nEverything was great, the drinks were amazing, and the service and ambience were lovely (very small place so you can actually talk to each other and be heard). Near the end of the night, they randomly started blasting Feist and everyone had to start talking very loud - that was a bit odd but ultimately, didn't detract from the great food.\n \nI'm dying to try the brunch here.", "author": "Loveleen B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-05-30", "description": "The service was fine. The food was nothing special. Really weird. I love spanish food but this was nothing like I had in spain. Its over priced and the portions are small. \nI want Cafe on Clinton Back!!!!", "author": "Hilary B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-10-07", "description": "Two weeks ago I left this restaurant extremely disappointed and I'm still thinking about how my experience here was a complete and utter let down. \n\nSo the night started with my boyfriend, my parents, and I arriving for our 9:30 reservation 10 minutes early to be told that the party before us had just ordered another entree so it'd be a bit of a wait. That's fine, we understood that those sort of things happen and the staff has no control over it. To bide our time, we decided to have a couple drinks at the bar. Here it was that the service started plummeting downhill. First of all, it took the bartender about 15 minutes to acknowledge us. When we were able to order, my mother and I got a bottle of sparkling rose, from which the bartender poured over half a glass, noticed the glass was dirty, dumped out what she poured, and didn't even do anything to make up for what she wasted of our bottle. So basically, we lost half a glass that could have easily been made up for with the open bottle I noticed behind the bar. We both kept waiting for her to correct her mistake but nothing happened. \n\nThen 10:15 rolls around and we're still waiting for our table. We are asked again what time we made our reservation for because apparently the staff couldn't be bothered to keep tabs on the people they've left hanging. After realizing we'd been there for close to an hour, they sent us out some tiny snacks. It was a nice gesture and all but a little disappointing, after all we were famished at this point and a bowl of fried chickpeas between 4 people was not doing the trick. \n\nFinally, we were seated at a little past 10:45. The rest of the meal was okay but had been thoroughly tainted by the 1.5 hour wait. Food was decent but the plates were so tiny. Even smaller than tapas. Plus it seemed like we were being rushed. We left at around midnight, our wallets $400 lighter and feeling like we got gypped.", "author": "Anna C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-09-20", "description": "we went as a group excited to try a new restaurant.  a friend who lives in the neighborhood found it and i read the time review.  i have to agree with others that the artichoke dish and eggplant were fabulous.  the rest of the dishes we shared, including the sangria, were....OK.  yes, just OK.\n\nthe reason why i am not giving it more stars is because it was so expensive for just OK food.  i dont have a single issue paying for quality food but yes, again along with the other posters, the value is a bit off here.  and to boot, we all left joking that we needed to go get a slice of pizza.\n\nmmmm, pizza....", "author": "Elizabeth R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-07-22", "description": "More and more I'm becoming convinced that the small plates concept is just another phrase for throwing a bunch of bar food at the wall and seeing what sticks.  I'm not saying the food I had a La Vara was bad.  It's not.  Things like the olive oil flatbread topped with caramelized onions and blue cheese would be an amazing snack, teetering on top of a Madrid bar stool drinking Spanish beer.  But as part of a dinner that cost $100 in Brooklyn?  Nah.  So too the $14(!) salad of 5 overcooked shrimps, melon balls and avocado.  A fantastic, refreshing nibble if it costs 2 euros with drinks.  Not so attractive as an appetizer.  The ubiquitous beet and greens salad was too restrained here, though the flavor of the beets was outstanding.  And, while I'm a total sucker for almond cakes, the one we got was almost laughably simple for an $8 restaurant dessert - just a white slice of cake topped with a few poached cherries. \n\nHaving said that, the crispy fried baby eggplants with ricotta like cheese and honey were fantastic, little exploding packages of crisp.   And we enjoyed the tender, flavorful, stewed tongue with peas and carrots, though wondered why there wasn't any accompanying rice or bread or couscous.  \n\nAll in all, too expensive for too little.  It's such an attractive restaurant on such an attractive street that I wished for more, but I didn't get it.", "author": "Raffi M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-11-02", "description": "Fantastic food! We randomly walked in on a Saturday and were very positively surprised. It`s not cheap but every single dish we tried was fantastic from the salads to the suckling pig. The hostess was very nice , knowledgeable and her wine recommendation was great.", "author": "Gabor C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-05", "description": "God Almighty . . reeeeeally good tapas in brownstone Brooklyn.  And it is reeeeally good.  \n\nI'll get this out of the way: it's kind of a hassle.  It's too small, the tables are weird, even the servers seem to struggle getting around, and it's cool that it's located slightly off the beaten track, but that's also confusing.\n\nBut, whatever.  Love it.  \n\nFried artichokes with anchovy aioli.  Bundles of swiss chard, kale, pine nuts.  Salad of chicken hearts.  Albondigas.  Salt cod salad.  Great fideua.  Every bite, start-to-finish . . . excellent.\n\nI absolutely adore every single server I've ever had here.  Worth the hassle.", "author": "E L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-07", "description": "A great Spanish tapas place in the neighborhood!! Love all of their dishes. Drinks are so great, too! Staff is friendly. Decor and lighting all goes well with the food! Neighborhood favorite!", "author": "Liz H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-27", "description": "Incredible. Absolutely unique and delicious take on Spanish food, served in a casual, home-like environment. The fried artichoke, cumin lamb, and deviled eggs were all a highlight. Service was excellent and friendly. Small plates have a way of sneaking up on you price-wise and all of the sudden you realize you've dropped $180 on dinner for two even though everything you ordered was $15 or so, but wow, well worth it for a special occasion.", "author": "Marcel P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-18", "description": "Great service, great staff and the food came out quickly. Everything was absolutely delicious. We had to wait about fifteen minutes past our reservation time, and I would have preferred a few more drink options from the bar but neither were a big deal.The sangria was delicious,  the artichokes were amazing. Everything is just excellent! The staff was very helpful, friendly and knowledgeable. I would definitely go back again.", "author": "Evelyn R."}], "servesCuisine": "Spanish", "priceRange": "$31-60", "name": "La Vara", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "268 Clinton St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/YnPJLj7vWlk4BsQhN7nuDA/ls.jpg", "@type": "Restaurant", "telephone": "+17184220065"}