{"aggregateRating": {"reviewCount": 339, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-09", "description": "Wow. Just wow. I think this is the best tapas restaurant I've ever been. Everything was just so authentic, fresh, yet creative. If I had to, my only gripe would be the ambiance. A bit bland, but that's super petty. This is the best meal I've had in a while.\n\nBerenjena con Miel: Weakest meal for sure. I could hardly tell they were eggplant. And I know it's eggplant, but it just felt so soft. Didn't get much of the seed really, either.\n\nAlcachofas: Delicious, salty aioli. And the anchovies were cooked super well, very crispy.\n\nSalmorejo: I had no idea what to expect, and loved this. Plenty of fish, one of the larger dishes. All the ingredients came together so well and just made sense somehow. Loved the egg.\n\nMigas Aragonesas: The chorizo was cooked so well - tiny, little crisby bits. Delicious.\n\nAlbondigas: Pretty standard, but you can tell the meat was such high quality. And cooked so well. And loved the mint yogurt.", "author": "Fred A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-07", "description": "Great seafood options -- paella was decadent.\n\nTorn bread stuff was a little salty. They tried to balance it with grapes but the ratio was still off.\n\nWe went on a rainy Sunday night and there was not need for a reservation, exec though we had one. Reservations available via Open Table but you probably need to reserve a couple days in advance (unless it is rainy like previously mentioned). It has easy subway access via the Bergen St station and the G or F. Very quiet neighborhood and there's a park across the street where you can wait if there's a line.\n\nOlive oil ice cream is the best. Don't knock it until you try it!", "author": "Albert C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-05-05", "description": "Came here around 5:30 on a Saturday and was lucky enough to grab the last two seats at the bar without a reservation (the hostess informed us there were no tables for the entire evening). The bar seating was very comfortable and the restaurant had a nice atmosphere and good service. \n\nMy husband and I shared 4 dishes and were plenty full by the end of the meal. The food was all very good, except for the last dish. We ordered the following: \n\n1) Berenjena con Miel (crispy eggplant with melted cheese and honey)- by far my favorite dish of the evening. The dish had the perfect combo of savory and sweet- extraordinary flavors and perfect eggplant texture.  \n\n2) Fideuá (seafood paella): very unique dish, I've never had \"Valencia-style noodles\" before in my paella. The noodles reminded me slightly of Asian lo mein- was a really unique take on paella.\n\n3) Conejo en Escabeche (stuffed rabbit loin): never had a dish like this before, the rabbit paired perfectly with the sweet onion, prunes, and olives.  \n\n4) Arroz Bomba (Rice with Jonah crab and white asparagus): a special for the evening, while the crab and asparagus were very good, the overall dish was overwhelming salty and a little mushy. Not a terrible dish but definitely the worst out of the 4. \n\nOverall, La Vara was a great dinner experience with a very unique menu that's definitely worth a try- make sure you make a reservation.", "author": "Rebecca L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-04-08", "description": "La Vara was high on my list of restaurants to try for many months. Snagging up a seemingly hot reservation, I finally had the opportunity to dine there on a recent Thursday night.\n\nThe atmosphere was very welcoming, space not too tight, and service friendly and helpful throughout, even after I spilled about a half liter of water all over the floor only minutes after our arrival (nothing broke, miraculously).\n\nThe food at La Vara was only ok. We ordered the fried artichokes, salt cod carpaccio, and house-cured duck breast. The artichokes were my favorite item, although there were some untrimmed pieces that could not be chewed. The salted cod was a bit of a misnomer, as it was rather bland and actually needed salt added. The duck breast was flavorful, but the exterior was quite fatty and I wish it had been cooked down a bit more. \n\nAdditionally, I found La Vara a bit overpriced given the average level of satisfaction the food left us with. For example, the duck was $26 and gave us only a few bites each. The drinks, as with many trendy NY spots, were around $12, but not anything unique or special.\n\nI'm happy I tried La Vara, but I wasn't mind-blown by any aspect of this experience.", "author": "Rich B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-02-15", "description": "Had really good experience there. \nWe ordered :\nAceitunas\nhouse citrus \u0026 herb marinated olives \nGarbanzos Fritos\nspiced fried chickpeas \nAlcachofas\nfried artichokes, anchovy aioli\nPimientos de Gernika\nblistered shishito peppers, sea salt \nPulpo con Carrueco\nMarinated octopus, kabocha squash, black eyed peas, fresh herbs\nPincho de Ceuta\nGibraltar-style grilled chicken hearts, fresh herb salad, lime-date vinaigrette\nFideuá\nValencia-style noddle paella, shrimp, squid, clams, aioli \nPechuga de Pato\nhouse-cured duck breast, choricero chocolate sauce, almond picada, pickled vegetables \nCochinillo\nslow-cooked crispy suckling pig, rose petal quince sauce, chimichurri \n\nEverything was good, artichokes and sucking pig - exceptionally good.\nOur waitress were extremely nice but waiting for 10 minutes for my beer is not what I would expect in a Michelin star restaurant.\n\nMost probably we'll be back.", "author": "Vitaly L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-27", "description": "On our 3rd visit here, I'm glad to report that the menu has changed slightly as it does with many tapas places but that the quality has remained high and the service has remained excellent. On our most recent visit we ordered the Anchovy bread, the cucumber salad, the paella, the suckling pig, and the croquette special. \n\nThe anchovy bread wasn't too fishy and it had a wonderful balance between the hazelnut and sesame oil. Just a word of warning though, it's a tapas place so it comes out with just a few pieces of nicely charred bread and a plate of three seasoned anchovies. For some reason we forgot this fact and expected a flatbread, haha.\n\nThe cucumber salad with farrow and herbs was one of my favorites of the night because it was light, felt healthy, and was nicely savory given the earthy flavors that the farrow provided. \n\nThe paella, as you would expect, was done perfectly and had a great balance of seafood and saffron but it was done with a thin chopped noodles which they list as a valencia style noodle. I've never been to valencia but it tasted closer to a whole grain noodle to me but with a pleasant texture given it's size and thinness. \n\nLastly the suckling pig dish was delicious. The meat was soft and supple, the skin was nice and crackling. The flavors and warmth of the dish were balanced nicely with the chimichurri. Good mouthfeel overall and we ended up using some extra bread to soak up the sauce.\n\n5 stars for and overall great meal with excellent service.", "author": "Caroline L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-07", "description": "Modest sized restaurant with seating around the bar and a humble outdoor patio.  Easy finding street parking around dinner time during the week.  Was surprised to have difficulty making a reservation on a Thursday - so book ahead - they fill up fast.  Our waiter Daniel (I told you I was going to yelp about you!) was incredibly knowledgeable about the menu.  Like - could tell you the history of ingredients \"knowledgeable.\"\n\nThey'll recommend 4-6 plates to share, but really you should order more.  Not to satisfy your hunger, but to satisfy your curiosity.  You can pretend you're a pro and plan out your meal ahead of time, but you'll just be left bewildered when the waiter begins to list off the many delicious daily specials.  Even though the sardines were disappointing, the spreadable sausage, croquets, and fried artichokes made up for it.  I hate to comment on specials because it'll just break your heart when you go and it's not available, but the foie gras and the scallop special were quite memorable.", "author": "Renee L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-24", "description": "Excellent customer service. I called on Friday for a reservation for Saturday night. Not surprisingly, it was totally booked. I asked if I could leave my name and number and if anything opened up to please call me. They did! Got a perfect reservation. \nThe food was delicious! Interesting and different without being intimidating. It was my boyfriend's birthday so we ordered a bunch of stuff, the anchovies was the surprise hit!!!! And the suckling pig! Olive oil ice cream was super banging too, a little savory, so nice! We will for sure go again. Waitress was great", "author": "Lindsay A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-14", "description": "One of my favorite places for local brunch recently became one of my favorites for dinner in the neighborhood.  I took bf for his (second) birthday dinner of the year recently, chosen precisely because of its close proximity to our apartment, its reputation, and for the low-key casual vibe we were seeking.  Yes, I know, he's lucky to have me. In case you're wondering, it does indeed, have a michelin star, which probably explains why the dining room was packed on a Monday night.\n\nWe ordered various plates to share: a special of the day - slivered sugar snap pea salad with a tangy yogurt based sauce, the salted cod with boiled egg crumbles, the luxurious deviled eggs, the seafood fideua paella, and the tender suckling pig.  Five dishes were more than plenty for us.  Each dish was well thought out and perfectly executed and every single bite we tasted was packed full of flavor.   The sangria of the day that day, a white version with passion fruit puree was perfect for a hot summer evening. \n\nService was more than adequate, and the bill was more than reasonable. Most importantly,bf was very happy with his birthday meal.", "author": "Kayo N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-02-12", "description": "Delicious New Experience!\nThe entire reason I chose this spot for date night was that the food has Moorish and Jewish influences and I was very intrigued by this mix. \n\nI also didn't realize they had a Michelin star till after, but I am not surprised. \n\nThe location itself is nice, classic Brooklyn, small but well put together. Our waitress was very helpful, strong understanding of the flavors of the dishes and drinks that would pair well. She told us that the dishes are brought out as they are prepared, I am not a fan of this style, so we asked to have the dishes brought out in a traditional fashion, starters as they are ready and then the main course together. \n\nNow the reason we are here, the food!\n\nWe started with the Garbanzos Fritos. This simple dish would bring me back here again by itself. The beans were toasted to a delicious crisp bite and the flavor was amazing. Something of a grill with char. Both my wife and I have spent substantial time in the Middle East and this dish made us feel like we were wandering through a shook with the smells of charred meat and nargilia. \n\nWe also has the Berenjena con Miel. The small eggplants were roasted to perfection and the honey and cheese gave them a beautiful sweet and salty punch. I highly recommend spreading a bit of sauce on a piece of bread and adding an eggplant piece on top for a great bite. \n\nAs the main came we shared Pincho de Ceuta. The salad was basic fresh greens. The lime-date vinaigrette was zesty and complimented the chicken hearts well. They were grilled perfectly, meaty with a undertone of salt. \n\nFor the main I had the Conejo en Escabeche. The rabbit was great. The dish had a nice undertone of saffron and the mix of sweet and salty elements to the dish paired well. \n\nMy wife ordered the Cordero Al Ajo Cabañil. Now this is a dish to write home about. The lamb breast is shredded, then shaped into a cube and grilled. With each bite you get a mix of tender interior and grilled exterior, absolute heaven. The lemon and date components add touches of bitter and sweet that bring it all together to the perfect bite.", "author": "Nathaniel Ħ."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-23", "description": "This wonderful Brooklyn restaurant is a neighborhood gem. My friend and I had such an amazing dinner the other day. \n\nBased on our server's recommendation, we opted for 4-5 dishes as they are all shared and come out to the table as they are prepared in the kitchen. We opted for a Microshrimp Special salad which was delicious, as well as the Octopus appetizer. For our entrée, we went with the Fideua seafood noodle paella which was amazing! We also had some sides, including some white asparagus. And we of course had to try the Churros for dessert. \n\nService was outstanding, the vibe of the restaurant was so laid back, and all the food was perfectly unique.", "author": "Krista J."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-09-07", "description": "Shared a meal here with friends. Good but not impressive food for a single Michelin star restaurant. I wouldn't feel compelled to come for dinner here again if I were visiting Brooklyn. The server was knowledgeable about the menu selections and made good recommendations. Attentive service, I was drinking a lot of waters since I felt dehydrated that hot day, and the bussers constantly refilled my glass. Ambiance is casual, cute, well lit, and not too loud. Portion size is perfect and in line with expectations for tapas (~6 dishes for 3 people seemed just right). The food is very super with heavy, creamy sauces so a little goes a long way.\n\nFried olives amuse bouche (3/5) - Crispy and fried breading, mild olive flavor, odd to start with an oily dish and yogurt was meant to cut through that.\nCod salad (2/5) - This dish didn't really work for us. The cod itself is bland and mild, while none of the flavors stood out or complimented each other. The strongest flavors were the fruit - mandarin and pomegranate while the pistachios and olive didn't really do anything to bring the flavors together. Seasoned with dill, but not enough. It didn't taste bad or inedible, but it struck us as a hodge podge of ingredients with little cohesion.\nFried eggplant (3/5) - A decent texture, not too mushy or oily. Flavor wise, the eggplant was not remarkable but I enjoyed the cheese and honey sauce it was in. The bread given to eat with the dishes was mediocre, chewy texture - and I look forward to fancy restaurant bread.\nSugar snappeas with micro shrimp (3/5) - Fresh crispy peas, garnished with a garlic white sauce reminiscent of toum, with a light texture and lemony tang\nLamb meatballs (4/5) - My favorite dish, tender, non-gamey tasting.\nGurullos (pasta) (3.5/5) - A delicate and soft gnocchi like texture with eggy base, very oily, paprika seasoned, heavy on the oregano\nPollo asado (4/5) - A delicious, fragrant spice rub, caramelized onions. They got the skin was crispy while the meat was still tender. It was still good at leftovers.", "author": "Truc N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-03", "description": "TWENTY STARS. I don't know what these other folks are fussing about.\n\nEvery dish and cocktail was finely considered and perfectly prepared. Feels like a neighborhood haunt, eats like the Michelin star \u0026 Eater 38 it earned. Service was impeccable. The women running this ship are absolute pros, and the place is positively buzzing with their strength and energy.\n\nThe marinated olives were surprisingly nuanced, with individually seasoned varieties. Fried artichokes are a must! Eggplant was brilliant with the addition of nigella seeds. THE. MIGAS. WAS. INCREDIBLE. Pincho de ceuta was perfectly balanced in flavor and texture. Who knew chicken hearts could make such a spectacular salad? \n\nAnd--you guys--don't skip the pig. It's the finest cochinillo I've had (and this southern girl has had plenty, promise). In terms of technique, it blew us away.\n\nThese aren't easy dishes to execute with nuance, and La Vara makes it look SO easy. \n\nPlus, the bartender (also our server) is an absolute alchemist. Be sure and try a drink with their homemade quinine syrup. Think you can't do bitter? She'll show you otherwise.\n\nTheir playlist doesn't suck, either ;) \n\nCan't wait to go back!", "author": "Ashley H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-01-27", "description": "I love La Vara. The staff, the neighborhood upscale modern ambiance, and the food. I wont say this is the best meal Ive ever had or any of the dishes were to die for, but nothing Ive ever ordered has been subpar or I didnt like. La Vara is a consistent in its no-fuss, simple but excellent offerings using only high-quality, fresh ingredients. A neighborhood gem. Recently, I had the eggplant, artichokes and roasted chick peas-all small plates. And a half portion of the house fish mainstay. Chick peas-nothing special, wont order again. Other three dishes-epic.", "author": "Ashley P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-15", "description": "Right around 4 stars. Came here on a Sunday night with a group of 4 and had a lovely time sampling different menu items. I don't venture out into Brooklyn too often to try restaurants, but we have friends in Brooklyn and this has a Michelin star so if you're going to get me out there, this was as good a reason as any.  \n\nWe shared them following items:\nFried Chickpeas - there were very unique and had a lovely crunch, though the spice didn't work for me.\nBlistered Shishito Peppers - I love shishito peppers and these did not disappoint\nAnchovies - I'm not an anchovy person, but found myself enjoying these a lot.\nRemojon - this was strange given the various components, but the flavors seemed to work.  I liked the pomegranate and the citrus flavors, but found the olives and egg to be weird.\nA foie gras dish which was pretty good\nBerenjena con Miel - this was one of my favorite things, the crispy eggplant was delicious as was the melted cheese \nOctopus - I didn't love this at all, it was slimy and gross.\n2 meat dishes, I think one was the suckling pig and the second was duck.  The duck was very thinly sliced and cooked very well though there was way too much fat on the skin and it wasn't rendered properly.\n\nOverall, I thought the food and service were both good, though for some of the reasons the dishes still came out with bread on the plate even though we said that someone had a gluten allergy (it should be easy to put the bread on the side, so that was a little frustrating). \n\nI don't know if I'd go out of my way to go back, but if you're in the area, it's worth stopping by.", "author": "Elyka A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-30", "description": "Ok so definitely get the torn bread with egg yolk. The spreadable sausage with honey foam bread is also good but very spicy which I didn't realize before ordering -- a little past my spice threshold. They're very good at frying. The croqueta would be perfect if the roux like filling was slightly less tacky but I would still get it again. The fried artichoke is awesome. Lots of garlicky flavor though the side of white bread is completely unnecessary. We also got the cod salad which was our least favorite -- lots of flavors that I'm not sure went well together (orange, pistachio, pomegranate, fish).  Other standouts include the chickpeas, deviled eggs with green tahini and blistered shishito peppers that were cooked perfectly. Pricing is pretty reasonable given the quality.", "author": "Jennifer M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-04-21", "description": "I cannot believe that I am not writing a better review of this restaurant. B took me here for a romantic night, and while the restaurant was cozy and comfortable the food was not at all what I expected. I purposely didn't look at the menu or ask where we were going because I was craving some full immersion. My poor, unsuspecting husband didn't realise this was a tapas place. This resulted in some shock once we had taken time at the bar to pick out meals. I got a crab rice special and B got the lamb that he'd been looking forward to for weeks. His opinion was that it was very gamey. I did think the taste was good, but not quite his style. The rice was good, but I have to admit that it wasn't anything to write home about. The best part of this meal was the honey eggplant appetizer. I will also say that I could eat a plate of the amuse-bouche olives! After reading other reviews of this restaurant, I'm almost embarrassed to not give a better review! I think maybe we just picked some wrong items. We didn't come to dinner ravenous and only sampled a few items. I wish we had tried a bit more as some of the dishes looked superb.", "author": "Christy B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-24", "description": "Excellent Spanish restaurant in picturesque residential location. The service was great while the food was outstanding. We were concerned about the prices and rightfully so given almost everything is tapas style, small and pricey, but the quality was exceptional. We would come back much more if the prices were about 30% less (where they probably should be) though we expect to return occasionally nonetheless. Highly recommend for an intimate evening and unique off-the-beaten-path experience.\n\nHere's what we had and recommend...\nFoie gras: delicious and different from usual prep\nScallop-gazpacho special: incredible\nSuckling pig: very good-just like we had in Madrid\nCroquetas: light, airy and delicious \nDeviled eggs: very good, finished with herb oil \u0026 vinegar", "author": "Jimmy Z."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-12", "description": "Really excellent and interesting. Totally new spin on tapas and Spanish food. My new go-to neighborhood restaurant that I can't wait to go back to all the time. Food, service, atmosphere it was really great.\n\nHighlights: eggplant + cheese, raw scallop, bread+chorizo salad.\n\nLowlights: a little pricey but good food costs money ya dig?", "author": "David G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-24", "description": "Michelin star? Yes please! Sounds like my super secret spies...ok, I googled forbes leaked list, that La Vara will be a Michelin star receiving restaurant again for 2017. And that really comes as no surprise to me. The food is just so damn exquisitely delicious. Nothing will ever be \"bad\", but many dishes will be exceptionally flavored and unique. The mood is cozy, and reservations are strongly recommended. I've scored brunch without a reservation, but always played it save and got one for dinner. The menu is very seasonal so one minute your favorite dish may be available today, and tomorrow you get to discover your NEXT favorite dish. Let me just go over what I've had the sweet pleasures of trying, barely scratching the surface.\n\nThe very good: Chickpeas, olives, blistered soshito peppers\nThe amazing: The fried artichoke, Shredded lamb dish. Brunch: Cuchifrito-crispy lamb and potato hash, very nice change of pace from typical brunch dish\nThe Chronicles of Re-diculously good: Sobrasadacon Miel-spreadable sausage on toast-small dish but oh so good. Cochinillo-slwo cooked crispy suckling pig. \n\nCheers to another GEM in the great little Brooklyn nook that is Cobble Hill. Oh how I love thee so.", "author": "Mike S."}], "servesCuisine": "Spanish", "priceRange": "$31-60", "name": "La Vara", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "268 Clinton St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/YnPJLj7vWlk4BsQhN7nuDA/ls.jpg", "@type": "Restaurant", "telephone": "+17184220065"}