{"aggregateRating": {"reviewCount": 339, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-10", "description": "We had two wonderful dinners at La Vara with our 6 months baby girl. The staff is incredibly welcoming and they provide great service from recommendations to watching out for your dietary preferences. The food is very flavorful, satisfying and intelligently prepared for diners to enjoy every bite.  In order to taste more items, it will be better to have a bigger party in your group. The bartender can spoil you with delicious non-alcoholic cocktails to pair with your food (which is not a common talent in many restaurants with a full bar).  The place is nicely crowded even on a weekday which creates a great ambience for a weekday dinner. One disadvantage is their place is a bit tighter if you want to go in with a baby stroller. Although we have a tiny stroller,  we still put the staff in trouble to place it out of people's way. Even with that, they were extremely welcoming and went extra mile to make us and our baby comfortable.", "author": "Pinar G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-08-18", "description": "An great date place in a great neighborhood, but please don't go to La Vara if you're tight on funds and/or extremely hungry.\n\nI asked my husband to take me there based on a positive review in a magazine, and while we really liked the ambiance, service and food, we knew we were in for a rude tapas awakening when we saw just how small the plates were.  We left there much lighter of pocket but still starving and went for ice cream afterward.", "author": "Chi M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-24", "description": "Really outstanding restaurant, one of my favorites in the neighborhood.  I eat here on a regular basis and the food is excellent.  It is a small plate restaurant so you need to enjoy that format.  There is the occasional clunker dish but since the are small dishes I don't mind as much and it allows the kitchen to experiment with new things which I find fun.  They also have an excellent wine list wish the staff is knowledgeable of.  The only negative it it is expensive.  Dinner for tow with 5 small plates, no desert and a $50ish bottle of wine will set you back $150+.", "author": "John S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-13", "description": "(4.5 Stars)\n\nWe walked out of La Vara thinking, \"That was one of the best meals we have had in recent memory.\" Surprisingly, La Vara did not arrive on our radars from one of our usual sources - the countless food blogs we frequent - but simply from strolling through the delightful Cobble Hill neighborhood, dreaming about being able to afford one of the gorgeous brownstones, and then - oh so fortuitously - stumbling upon this gem one summer's eve. We took one look at the menu and booked for the following weekend.\n\nSeated on the small patio outside, we were transported to an idyllic, quiet oasis on a tiny deck in Brooklyn. (Note: It can get rather loud inside, though, once the masses arrive.) We took to the extensive menu and began deliberating. Of course, the staff were an absolute delight and - not only guided us through the treats on offer - but also suggested that we order a few plates, get through those and then reevaluate our hunger/desires from there. Unlike former greats (read: Traif, which has now become rather disappointing), we were given the freedom to make ad hoc decisions as to where we saw our palates moving through the course of the meal. And they moved, baby! As George Constanza would say. But this is not Seinfeld.\n\nFood (First Round): \n\nWe started with the Alcachofa (fried artichokes, anchovy aioli) which were sublime. I would have been completely content with seven plates of this constituting our meal. You must order these.\n\nThe garbanzos fritos (La Vara spiced chickpeas) were very tasty, though - considering how spectacular everything else is on the menu - this is one of those cheap thrills on which I wouldn't necessarily waste my appetite. If you need something to nibble on during your leisurely meal, grab some for the table, but this would not be on my \"Best of La Vara List\".\n\nThe Berenjena con Miel (crispy eggplant with honey, melted cheese, nigella seed) was great. While it did not represent eggplant in its typical form, it was a combination of crispy-on-the-exterior-­silky-on-the-interior and bathed in a tub of honey-cheesy heavenly curds. Praise the lord!\n\n(Second Round):\n\nThe salt-baked fish of the day with harrisa ajada was delicious. We ordered a single piece of the white fish and the delicateness of the fish, paired with the fragrant bite of the harrisa proved to be the perfect balance to the other rich items on our table.\n\nThe Cordero Al Ajo Cabanil (cumin roasted lamb breast, scallion, preserved lemon-date condiment) was as exquisite as it sounds. Like all the dishes at La Vara, the flavor combinations are flawlessly executed, with the sweetness of the preserve cutting the richness of the perfectly prepared lamb. \"Oh my!\" as George Takei would say. This should certainly be on your eating itinerary.\n\n(Dessert):\n\nThe Egipcio (orange blossom scented date walnut tart, lemon curd, sweet cream) was delicious -- it is everything you wish a fig newton could be... but thicker and richer. When balanced with the tart richness of the lemon curd and the fluffiness of the cream, there was much in the way of moaning with pleasure.\n\nNatillas de Arroz con Leche (cinnamon-rose and rich scented custard with grapefruit and rosemary) was also a delight - delicate and floral, it was a perfectly refreshing way to end an incredible meal.\n\nConclusion:\n\nAs with all tapas places, you run into the problem of finding a delicious dish and wanting to eat all of it, lamenting the fact that you ever agreed to share these delectable items. For two, the portions were perfect, providing us with a chance to slowly make our way through the lovely menu. Of course, we are already strategizing our next meal. At around $120 for two people (including a glass of wine), it is well within the realm of reason when compared to the likes of The Grocery, which is a little more dear. With flavors that are perfectly balanced and wonderfully executed, this is the type of neighborhood establishment one comes to treasure. We will certainly be back to dabble in more of their creative and delicious fare on offer.", "author": "Daniel K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-12", "description": "Dinner at La Vara was a very rewarding experience - the food, the ambiance and the service were top notch. We ordered a few tapas that included vegetables, rabbit, and fish and all were delicious complemented by exquisite sauces. It was certainly a feast in the mouth.", "author": "Ilya K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-08-31", "description": "Oversold on tapas..as it was way more than we could eat...and cost us $50/person.  Food was only ok...while items sound good on paper..it just didnt live up to the hype.  Too many flavors are combined that dont mesh well...I like the concept...but just not executed well.", "author": "Chad R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-18", "description": "Awesome!\n\nSo many excellent small plates, order as many as you can muster. Great for getting a taste of everything.\n\nEach dish was better than the last, only slight points taken off for the addition of mint to the otherwise delicious chicken heart salad.", "author": "Riot D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-13", "description": "I love what they're doing here. Highly Recommended. \n\nWell curated wine list. \n\nLoved the rabbit dish and the salt-baked fish. \n\nExcellent, friendly service.", "author": "Caitlin M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-07-02", "description": "Great spot for High end Tapas.  Tried a bunch of items on the menu and everything was delicious and extremely fresh.\nThey don't take reservations reservations  and  the place is very small.   Get a beer or wine at the bar and expect to wait 45 min for a table.  \nThis restaurant would get at least 4 stars if the table we sat at wasn't so close to another table that you feel like the person on another table is so close you'll think they are part of your party.", "author": "Michael B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-05", "description": "This was one of the best meals I've had out in a while, and this restaurant is definitely among the best in the BoCoCa neighborhood, an area with more than its own share of good eats.\n\nGreat service and great food.  So what if it isn't 100% authentic Spanish?  What it IS is something special that you haven't tried before.  Every dish was elegant and delicious in its own unique way and most of the items on the menu were combinations of ingredients that I have never had or even thought of before.  I think if it were possible to try every dish, I gladly would.  Our party of 7 must have tried between 15-20 and every plate left the table spotless.\n\nIt is tapas style, and the dishes are definitely small, so this is not the place for you if you are starving and on a budget.  But if you're like me- you really appreciate good food and don't mind occasionally spending a lot of money in order to fill your belly with the right experience, then you will appreciate La Vara for what it is. \n\nI hope they keep up the great work, and if they do, I wouldn't be surprised at all if they get a 2nd Michelin star.", "author": "Bleecker W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-08-08", "description": "Food was absolutely delicious. But...Entree prices for the world's smallest tapas.  Kinda shameful.  Delicious but leaving for a slice at a nearby spot.", "author": "Nichole J."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-04-14", "description": "Came here with a group of a Friday night and was especially excited about it after it showed up on Serious Eat's recent guide of vegetarian options in NYC. It was a nice selection for a group with its focus on small plates and encouragement to share. Many great dishes stood out although surprisingly the ones I was the most excited about (blue cheese flatbread, skate special) were somewhat disappointing and ones I ordered just to fill out a full meal (pasta with goat butter, swiss chard) turned out to be amazing. I was a little baffled by what they decided to fry (like the skate) and disappointed that I wasn't given more warning about when these preparations would come up. Why anyone would take a delicious, delicate fish like skate, deep fry it is beyond me. The space was really cute, but it got really loud in there which made it difficult to talk among out party of 6. I'd say I'd come back for a date, but when wouldn't be able to share as many options. All in all, I'm glad I tried La Vara but left a little let down. I really wouldn't say it lived up to the billing of being good for vegetarians that Serious Eats placed on it.", "author": "Stephen S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-22", "description": "The lamb was dish of the year 2013 for me. I have never been disappointed. This place is fantastic. The wait can be a bummer, so be prepared.", "author": "Chris Z."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-02", "description": "I am indeed a huge fun! So good! Food, wine, service, menus...I always prefer to sit at the bar and talk to the sweet lady at the bar who always has really good wine to recommend. I like tapas places but I find this one even better that Estela's since it is never so loud!", "author": "Calliope C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-01-23", "description": "Good food but completely overpriced. The quantities and the place do not justify such prices. Also, I did not feel any 'spanish' experience.\nThe lamb was excellent but the tuna pies and the croqetas were very disappointing. Service is good.", "author": "Peter J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-26", "description": "The flavors were amazing! Especially to our famished selves after waiting 45 mins for our table. But no worries, that's about what I expected. The staff was amazingly friendly ad accommodating. While the food was flavorful and complex, its fattiness was a bit overwhelming. We ordered fairly fat-conscious, meaning my dining companion and I had both the suckling pig but also the salad, chorizo in equal parts to raw veg. And yet. The heftiness was more animal-fatty meaning I left feeling a little gross. Even though it was all so delicious I convinced myself to overeat. So, it's a rough row to hoe, te Spanish food.", "author": "E S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-16", "description": "When I think Spanish I think bold and vibrant but how can that be with tapas?  La Vara can be!  A small place in Brooklyn that has one of the fastest service I have ever seen.  It might have been faster than dim sum but without carts. 7:30 was a great time and a kind of in between time.  Rebecca who was our server was great at suggestions.  To start we had the fried artichokes, Alcachofas they were creamy and the next dish was sweet and savory sausage spread with honey, Sobrasada con Miel.  And a Bread salad???  Yes the Migas Aragonesas many flavors that popped in your mouth and a treat were the grapes.  Finally we had the lamb, Cordero al ajo Cabañil a rectangular shredded breast of lamb, a true earthy flavor.  We were going to try the suckling pig but we had to keep our girlish figures but it would be a must next time.  I always think how restaurants will be before I go and most of the time I am surprised but La Vara was no surprise it was what I expected in bold and vibrant ways!", "author": "Toby N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-17", "description": "Tasty tapas! Came here with high hopes since I had heard good things from friends in the neighborhood and the place did not disappoint.  \n\nAll of the dishes sound, look, and, most importantly, taste amazing.  In particular, highlights were: (1) a scrapple-like dish of burnt chorizo bits and grape slices, (2) a fried eggplant dish, and (3) a sardine in oil with toast.  \n\nThe food isn't cheap but it's great quality and a fun atmosphere.  It's small and doesn't take reservations for small parties, so plan on arriving and waiting for a table.  Worth it. \n\nMy only regret? Not ordering the suckling pig appetizer - a regret I can and will remedy at my next trip.", "author": "Andrew T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-05-07", "description": "Food is good but the place is too loud. It's very hard to have a conversion or hear the many specials. There are too many waiters working but none around when your wine glass is empty", "author": "James C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-01-18", "description": "Tapas place. They range from small to medium sized tapas and recommend 2-3 tapas per person for the table. The food was good but I wasn't so impressed that I'll need to go again any time soon. Had the lamb breast and the friend eggplant with honey and cheese( forget which kind ). Also tried the fried chickpeas and the fish of the day dish. Customer service was excellent. The waiter was very attentive and helpful in covering the menu. You likely can't go wrong with any dish but I'm not sure if you'll be blown away either.", "author": "Rajeeyah S."}], "servesCuisine": "Spanish", "priceRange": "$31-60", "name": "La Vara", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "268 Clinton St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/YnPJLj7vWlk4BsQhN7nuDA/ls.jpg", "@type": "Restaurant", "telephone": "+17184220065"}