{"aggregateRating": {"reviewCount": 339, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-08-27", "description": "don't get it\nreally don't get the hype\nplace is cute indeed\nbut i fell for the \"Michelin 1-star cheap list\" thing\n(not sure why as I normally hate Michelin)\nmost of the food was kinda ok\nuntil i got to the Fideua (sp?) (the Paella made with noodles)\nthis is one of the saltiest dishes i've ever had\ncouldnt eat it...", "author": "Abul R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-06", "description": "Good food and great service at a great price, especially for the hood. Nothing bad to say except that the prices outweigh the quality of the food. Worth going once.", "author": "B C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-16", "description": "Fantastic food, drinks and service. I made a reservation for brunch on a Sunday for 10 people. I emailed back and forth with Kelly and Kim, the super helpful managers they have and made a set menu for us. The food was delicious, the peppers, the huevos a la flamenca and the sangria were super yummy. And then the churros with the dulce de leche!!! Thank you to the cook that prepared our meals, Jorge and to our extremely attentive and charismatic argentinian waiter Guillermo! He even gave us some recommendations on what to see in Brooklyn since we are not from the area. Overall it was a great experience!", "author": "Aurora V."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-11-22", "description": "I wanted to love this place, but just didn't.\n\nThe chickpeas were salty and I just felt like the food was meh. It was good but nothing super special.\n\nMost dishes have egg in them (which I don't eat) and made it difficult for me.\n\nThe staff was soooo sooo sooo nice though and accomodating.\n\nIt was a really pleasant experience though.", "author": "Alli H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-08-06", "description": "I do not understand how this place has 4 stars. I went with my husband last week and was very disappointed in the food. The fish special was $31 and tasted like a bottom feeder fish with barbecue sauce slapped on it, very little flavor. We also do not eat meat so maybe this is why we didn't enjoy it. We order 5 things it was around $100 and the portion sizes were very small. I would not recommend this place for people who don't eat meat. Hopefully the meat is amazing there, otherwise I don't see a point in trying it out.", "author": "Sarah M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-05-18", "description": "I rarely make a bad review. Perhaps if we got to taste the menu this may change. \n\nSunday evening I had been planning to take my fiancee to this newly michelin starred restaurant, so much so I thought i would book a month in advance in order to make sure we had a good evening. I also mentioned to the hostess i called that it was her Birthday. \n\nThe second we walked in the door I knew something was off when there was nobody to greet us, staff too consumed with the half full restaurant to take notice of a happy couple arriving. I walk up to the servers chatting to each other and I let them know i had a reservation for 2 for 8pm. Without even looking at a reservation book one of them just said \" take one of the two tables at the back\" and points in that direction, and instead of taking us to the table, returns to the conversation with the other staff member. \n\nAs we walk over to the table at the back we realize that there is no air conditioning, and the restaurant is a solid 85 degrees inside. My fiancee turns to me and says she can't bear the heat and perhaps we eat outside, since we can see some tables out the back door. \"We don't serve outside\" was the response... \n\n\"Well how about the tables nearer the door at the front which are empty and seems cooler\" I reply\n\n\" Those tables are already reserved... perhaps the bar?\" says the server\n\nMy fiancee and I look at each other in disbelief. We both know they haven't even looked up our reservation and would have no idea if those tables are reserved or not! \n\nBefore I even mention that it's her birthday and we've had a reservation for a month, I take a look down at a guests meal of bland looking vegetables and a dry rack of not so sucking pig's back ... we walk out... \n\nNo one should be treated like that especially at an institution which should pride itself on service, \n\nAn apology will be wasted ..\n\nWe had a fantastic night at a Brooklyn favourite Chez Moi on Atlantic. Fois Gras, Duck, Branzino, Carpaccio, Cocktails and a great bottle of wine with a smile and Air-Conditioning. \n\nLA Vara you missed out, we did not.", "author": "anthony r."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-23", "description": "La Vara is truly destination dining and perhaps an ideal first date restaurant. It features an exotic menu, is located on one of the prettiest streets in the city (a quiet, residential block no less), and generally hits both dimensions of food quality and (relative) value.\n\n Actually, let me walk away from that last assertion to simply state that menu prices appear low, but the sum total at the end might end up being greater than what you had expected... still, isn't that true for all meals featuring Tapas / Small Plates?\n\nLately, there appears to be a Spanish restaurant revival in the city. What's intrigued me about La Vara are the Sephardic and Moorish influences in the cuisine - appealing to the romantic in me who likes to embellish the imagination of what life in Andalusia must have been like prior to 1492 with followers of three great religions co-existing harmoniously. So, it's somewhat annoying when servers completely ignore the cumin, saffron, and eggplant influences in the cuisine (introduced by Muslims) while crediting the entire differentiation from the norm as Sephardic.\n\nI don't believe that I've appreciated a similar sensory onslaught in a meal lately. The ubiquitous meatballs (lamb) are incredibly juicy and go well with the mint yogurt, while the crispy eggplant (Berenjina) with honey, nigella seeds and melted cheese is superlative and absolutely best-in-class. I've enjoyed the Gurullos for the fluffiness of the pasta (thought that the spiciness of the Sumac was overpowered by the butter), the Fideua for the casual introduction to noodle based paella, the Cordero (cumin roasted lamb breast with lemon-date condiment) for the interior/exterior meat texture contrast, and the Pollo Asado (half chicken roasted over spiced onions, cumin, coriander) for spices and gravy - though it would probably wow others not intimately familiar with Indian cuisine. \n\nThere have been a few misses as well. Among them Ortiguillas Po'Boy (special) as one of the many fried dishes on the menu, but one where the oil dominates the flavor, the Garbanzos (spiced chick peas - one of the laggards amongst more popular recent versions such as at Pig and Khao), and Remojon (citrus and salt cod salad with pistachios) which had a mélange of flavors and textures - perhaps too many for any to stand out or for salad to serve the function of an appetizer.\n\nMy favorite desserts have been the Torta Santiago (flourless almond cake) with its effortless charm and the Egipcio which is much like a Pop-Tart filled with date and walnut paste brought to magical heights courtesy the lemon curd and the tender shortbread. Top notch! But, not what it would appear on first glance - much like most of the meal. Tapas have truly grown up beyond the typical Patatas Brava. So, it no longer pinches one to shell out $ 70-80 (pp) to leave with a full stomach and with the taste buds given a complete workout. And, you will have lots to talk about...", "author": "Atif I."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-16", "description": "Love the food here, it was nothing like anything I have ever tasted. The flavors really complimented each other. The service was great.\n\nThe eggplant dish was my favorite. The suckling pig was okay. I don't usually come back to the same resturant since NYC has so many places to try out but I will definitely come back to this place.", "author": "Elina K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-28", "description": "I'm in town from Chicago for one night... I decided to take a little walk and ended up finding this gem! \n\nI ordered a gin and tonic. The cocktails all looked beautiful and full of fresh garnishes. I chose one of the specials, it was artichokes and fava beans poached in olive oil and topped with a perfect poached egg. I have to admit, I wanted to order everything off of the menu. This was the most satisfying vegetable dish I have ever had! \n\nThis place is definitely on my list of recommendations!", "author": "Shelley H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-03", "description": "It was my birthday and E asked where we'd like to go. My response, same as years before, was tapas with byob. Although he didn't deliver on the byob at La Vara, the tasty tapas made up for that minor hiccup. \n\nWine bottle are a little on the high side so we started out with Sangria which is sweet and boozely. I would just suggest to ask the to add less ice. \n\nDefinitely order the hot tapas plates and the specials. What was memorable were the fried artichokes, suckling pig, and the cumin roasted lamb.", "author": "Hong L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-14", "description": "I've been in search of excellent tapas in the NYC area.  I've finally found a worthy competitor.  La Vara is a gem.  We went for dinner on a Friday night, during prime time.  The kitchen and service were totally on point, despite the substantial crowd.  \n\nThe food is truly special.  Though there are a couple of \"standard\" tapas staples on the table (e.g. lamb meatballs), much of the menu is much more esoteric and interesting.  Everything we tried was delicious.  The noteworthy items included: the anchovies--salty, oily deliciousness on charred bread, the squash pancake special (!!!), the spreadable sausage is great (I don't even generally go for this type of thing but it was quite good), and the paella was quite different (noodles instead of rice and a variety of tasty seafood).  We ordered 5 courses for 2 people and were definitely still hungry afterward, so order accordingly.  \n\nThe service was top-notch.  Our waitress was very helpful and efficient.  \n\nEven though the restaurant was crowded and small, it didn't feel claustrophobic.  \n\nCertainly it's a haul for me to get to Cobble hill, but if I lived closer, this would definitely be a go-to on a regular basis.", "author": "Julie M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-08", "description": "Loved everything about this place. Cozy, warm ambiance, chill vibe, delicious food, small plates for sharing, nice wine selection. The crispy pork was amazing - fabulous cucumber salad - loved the eggplant, too. Another standout was the olive oil ice cream desert. Make reservations well in advance or be prepared to wait. We got lucky and scored seats at the bar within 30 mins.", "author": "Angela P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-22", "description": "This is the first \"holy sh--\" meal my wife and I have had in NYC in quite some time. For that matter, the Andalusian food was better than in Seville. \n\nThe service, the food, the ambiance and the value are all tremendous. I will definitely come back and bring others.", "author": "Mark K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-07-13", "description": "Very good restaurant. I was aiming for a more developed and complex dishes since it was highly recommended and I think the chef/owner is the same one as Txikito.\nAfter dining in more than a hundred restaurants I think I'm becoming more exigent. It's a 3.5 star restaurant.\nWe came here for brunch. The menu has nice dishes and many different options. We ordered the croquetas del dia which were codfish. Super moist and with a lot of flavor. Wish they served more, only two small croquettes. Then the shrimp tortilla which was good but I was expecting a tortilla, this was more of a fried layer of smash shrimp (never really tasted the shrimp). It was like a paper sheet of fried potato-shrimp infused with a nice fried egg on top. It was ok. \nThe huevos a la flamenca, which it resembles a shakshouka, has a different taste from the usual Spanish dishes so it was a good call to try something different. 4 poached eggs in a lightly Sofrito tomate sauce. \nWouldn't recommend it. Still far from the real Spanish cuisine.", "author": "Sebastian K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-03", "description": "This place was awesome. We were seated with a random table of 10 so we got to talk to them a little bit. \n\nFood:\nWhite almond gazpacho (whhaaaat?!?) with squid and shrimp - so delicious \nValencian noodle paella - pretty good\nMurican pasta - blah\nLamb - good\nDessert was a bit weak for me - the custard with grapefruit was ok although I hate grapefruit near anything sweet (the bitterness just ruins everything) and the tart was very underwhelming.", "author": "Bo B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-01-20", "description": "Mediocre. \n\nNo pickles on sardines \n\nCrappy atmosphere - ugly, half assed, unappealing decor, with temp partitions \n\nService mixed - some half assed, some adequate \n\nSuckling pig Okay, but too expensive \n\nDeviled eggs good", "author": "John D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-11-16", "description": "La Vara, serving \"cocina casera,\" is a small Spanish restaurant in Cobble Hill, Brooklyn. The food is delicious and authentic, with dishes from various regions in Spain. However, we will not be returning to La Vara due to the ridiculous pricing and portions.\n\nHere are the dishes that we had:\n\nCroquetas del día (jamón serano) $5\n\n     These croquetas were okay. However, they were clearly not homemade or at least frozen and reheated.\n\n\nGurullos (pasta murciana) $15\n\n     This thick, handmade pasta was like gnocchi. The ground goat and butter made it a very succulent dish.\n\n\nCordero al ajo cabañil $18\n\nThis joke can explain our experience with the lamb:\n     \"¿Cómo ha encontrado usted el cordero?¨\n     ¨¡De milagro!¨\n\n   Waiter: \"How did you find the lamb?\"\n   Customer: \"It was a miracle that I even found it at all!\"\n\n\nVino tinto: Quinta ribera del duera $9\ndry, complemented the meal well\n\n\nBeer on tap: Radeberger Pilsner $6\nvery refreshing\n\n____________________________________\nI would never write this review if this were the first Spanish restaurant that I had tried in New York. We are a mixed Spanish-American family and have tried many dishes all over Spain, as well as many other types of restaurants in New York We also enjoy cooking Spanish dishes and dishes from many places.We are fans of Karlos Arguiñano, a cook from Bilbao with a cooking TV show, whose son recommended this restaurant. We have Spanish-American friends who work for various Spanish wine and food companies. We have tried many Spanish restaurants and food stores in New York and have just lost hope. This restaurant experience was the straw that broke the camel's back. We were hoping that it would prove otherwise.\n\nIn Spain, a tapa is a small plate that comes free or for between 3 and 10 euros. Ten euros implies a larger portion that can be shared. While eating and drinking, Spaniards usually order or are served for free several tapas to share and may move from bar to bar while doing so.\n\n\"Cocina casera\" means homemade food and also implies traditional dishes, of the kind that you imagine your grandmother making.\n\nHowever, La Vara is yet another example of the many New York Spanish restaurants taking advantage of the \"tapa\" fad. \"Tapas\" in New York has come to mean something else. A \"New York tapa\"  a very expensive and small plate that you cannot share with anyone, but most order many in order to eat properly. Most of the dishes served at La Vara should be full plates, but they just made them smaller, kept the same price, and then called them \"tapas.\"\n\nAt upwards of $40 per person, you do not expect to leave a restaurant hungry. I realize that prices in New York will never match those in Spain, but I do not expect a restaurant to try to con me into believing that these are the \"traditional tapas\" that cosmopolitan Madrileños or Bilbainos are eating. Tapas and Spanish cuisine in New York are simply a scam.", "author": "A D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-07-20", "description": "Good place, but not great. Portions are small so it adds up pretty quickly. Overall, we had about $100 worth of food, but didn't leave satisfied. Sat in the little patio at the back, which was fine, except my friend got 4 ant bites on her leg afterwards. \n\nThe waiter was friendly and helpful.  The suckling pig was tasty and the crackling was the highlight of the dish. The other dishes were decent but not memorable/a standout.", "author": "Al L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-04", "description": "I've come here as a party of two: $60/each (a pitcher of sangria to share), a party of three: $70/each (a bottle of wine), a party of four: $90/each (two bottles of wine). So, either know what you're getting into - those little plates add up! - or have your second and very much smaller dinner here. Or maybe I need to run with a less drink-y crowd. \n\nThe dinner menu has changed a little since my first visit a year and half ago, but they have nightly specials. I liked the fried eggplant, the remojon salad, the lamb meatballs, and the roasted pig. As someone mentioned below, the egipcio is a cookie-biscuit thing versus a tart that most people think of (sweet filling with a pastry crust). I'm not a big fan of this as it could be dry. I would skip dessert here, but that's just me. \n\nService is friendly and knowledgeable.", "author": "Audrey W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-08-10", "description": "Raffi M. has the best review. Read his as he nails a lot of my frustrations with this place. Skip mine.\n\nI'd avoid the fried dishes. The evening we were there, the specials were monumentally better than the menu items but nothing was really stand out. Oh, and they need a front of house person. We stood there for way too long - no one said a word, so we went up and chatted with the bartender and ended up sitting at the bar. \nI know it's a different restaurant, but I was really hoping they'd have the uni and wasabi sandwich like they have at their Manhattan location. Also no gin and basil slushie (probably a good thing, actually).\n\nFinally, I'll echo Raffi M's comments. It cost way too much money for what it was. Listen, I love to spend money on food. I spend way too much, but when the check arrived little bells went off in my head (I have bells in my head) to signal that something was amiss from a value point-of-view.", "author": "Rich B."}], "servesCuisine": "Spanish", "priceRange": "$31-60", "name": "La Vara", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "268 Clinton St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/YnPJLj7vWlk4BsQhN7nuDA/ls.jpg", "@type": "Restaurant", "telephone": "+17184220065"}