{"aggregateRating": {"reviewCount": 339, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-23", "description": "This place was really good. \n\nI had food combinations I've never thought of before. \n\nI'll start by saying they need another extra toilet and service was just fine, I wasn't overly wowed.\n\nEggplant with cheese was sweet and comforting. Fried artichokes tasted almost like meat it was so complex in flavours. The stand out for me, although the rest at my table didn't like it, was this cod, orange, olives, cheese and pomegranate salad. It is rare in life that you have something you've never had anything like it before. I am still thinking about this whacky dish from days ago. \n\nChicken was boring. Dessert was too. Stick to apps and fish.", "author": "Amelia J."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-02-17", "description": "Overall: overpriced small portions that are unimpressive\n\nCucumber salad - Just a simple salad with feta cheese.\n\nLamb meatballs - Packed with spices.\n\nStuffed Rabbit - Tender and chewy, but comes in only 3 small pieces.\n\nPork - The best thing I've eaten here that is also decently sized. Super crispy outside and full of flavor.\n\nDessert Special - Dough donut with ice cream with espresso poured over it. Dough donut and ice cream by itself would've been awesome, but they went and ruined it. The espresso made the donut super soggy and bitter. Who likes a soggy, bitter donut?? This was the worst dessert I've ever had.", "author": "Katrina L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-17", "description": "I don't really know how to describe how much I love La Vara. I'm more than a little partial because this is where we went to celebrate our engagement after a long walk through Prospect Park, Park Slope, a couple Hill neighborhoods, but that partiality speaks more to my fiancé and my love of the place from before that thrilling moment.\n\nYou probably want to try for a reservation because it's teeny, and if you're lucky, it'll be a nice day and you will get the honor of a back patio seat.\n\nThe portions are small, and it's a little expensive. That said, it's a place I know I can count on for an amaaaaaaaazing special treat of a meal.\n\nAfter you order (do get a cocktail, even the simple gin Kas is refreshingly delightful), they bring a tiny amuse bouche. A nice start.\n\nThe fried artichoke, daily croqueta, and sobresada con miel are our staple \"first course\" tapas. Now, they don't always come out in that order, but they're on the ever so slightly less rich side of the menu, so that's how my brain maps them. The honey with the sobresada is foamed and oh sooooo good.\n\nThe suckling pig shouldn't be missed out on. It's a pretty simple preparation and the herby green sauce cuts through the fat nicely. We usually get one or two more of the smaller dinner plates, none of which have been disappointing.\n\nAnd olive oil ice cream. OHHH that olive oil ice cream. I have tried on a couple occasions to make it at home since it is my favorite ice cream (and I love, love, love ice cream), but I keep having to come back here. Do make sure to save room for this dessert, or don't because it's more likely there will be some left if I come on the same night. :P", "author": "Liz D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-03-21", "description": "La Vara is a cute, tapas style restaurant nestled in Cobble Hill.  Adorable looking place. Great service. I really want to love the food, but was sorely disappointed.  \n\nOkay, I mean, I didn't hate everything - the alcachofas were delicious.  I loved the croqueta - they were so flavorful and texture was perfect. \n\nI was not impressed with migas aragonesas - it was very oily, and I felt like I was eating a medley of onions.  The lamb meatballs were okay - a little dry, gamey.    \n\nThe biggest disappointment was grilled octopus that we ordered - it was obviously not fresh and was slimy.  It was a real turnoff for the meal.", "author": "Kimberly Q."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-11", "description": "Amazing restaurant with fantastic food. The dishes are small so appetizers and entrees are good for one person. Fried artichoke, deviled eggs, duck, and octopus are amazing here. Definitely worth trying.", "author": "Stephany S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-17", "description": "In a quiet area of Cobble Hill, La Vara is understated but quite a find even in an area known for its restaurants, walkable streets, and beautiful architecture. Since we went on Valentines Day the menu was prix fixe but I'll make the assumption that the quality and service are similar otherwise. This is one of the best dining experiences I've had in New York and elsewhere, and I will absolutely be back for a less formal occasion.\n\nThe food was complex, richly Spanish, and remarkably delicious, presented nicely without trying too hard. Over 6 shared courses we tried a huge variety of meat, seafood, and vegetable plates, including (my favorite) seared duck, seafood stew, octopus, eggplant, pâté, clam, leeks, and olives, all paired (almost) perfectly with 8 different glasses of wine and sherry, ending with a simple but satisfying dessert of chocolate mousse and fruity sorbet.\n\nThe service was great, timely, and comforting, though slightly unorganized for the event-oriented dinner, but attentive, happy, and more than willing to answer any questions. Everything was knowledgeably explained which led to us enjoying the meal that extra amount to make this easily a 5-star experience. The setting is simple but refined, lit well for the occasion, and situated in the perfect location to leave an unforgettable dinner and take a long walk through beautiful Cobble Hill (even in sub-zero temperatures).", "author": "Marshall F."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-11-23", "description": "DISAPPOINTING BEYOND BELIEF! I can't believe this place got a Michelin Star.\n\nNot enough sauce or too much sauce.  Too fried.  Uninteresting.  Weird cocktail list. \n\nitems we ordered (and we ordered a LOT) were at best \"good\" and otherwise, we were left either nonplussed or grossed out.\n\nWhen the food wasn't up to snuff, we mentioned it to our waiter but instead of engaging -- he recoiled.  Yes, they took they gross bloody shrimp off our bill, but there was no dialogue, just dismissal.", "author": "Shana B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-26", "description": "Cute place! We sat at the bar and I enjoyed my glass of sangria while waiting for A. For some reason, I found myself enjoying it a lot more in the beginning, while it somehow got stronger towards the end. Anyway, a huge + for this place because A actually enjoyed our meal here very much. We shared the fried artichokes with the suckling pig and the suckling pig was delicious! It's definitely a small portion for the price ($30) but it was definitely worth trying. Super nice bartender too. :)", "author": "Brietta Y."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-30", "description": "Love La Vara!  Great culinary creativity for tapas from Chef Alex Raij and Eder Montero. The Chelsea places are a bit more traditional (El Quinto Pinto, Txikito), but come to La Vara to be wowed.  Plus, this place is actually very vegetarian friendly!  You'll find plenty of veg dishes - perhaps even more than tapas.  Like the other places, La Vara is small  (decor is very lively and bright though) so be sure to make a rez.  I made a 2 person rez to celebrate bf's birthday for 9:15pm on a Sat.. but we arrived an hour early as we were in the area and they kindly seated us. Service was great all night- informative, helpful and prompt.  We had: \n\n- the fried chickpeas, fun as a fiery fried snack.. but not too much heat or greasiness (this was a theme across the board- even though things were fried, I never felt sick) \n\n- the crispy eggplant with cheese and honey and some kind of special black sesame seed- surprisingly light, with a hit of sweetness, very yummy\n\n- the special salad of the night- very clean summery cucumber, tomato, watercress, a special Spanish ricotta like cheese... delicious with house made croutons but I will say, had a tad bit too much dressing \n\n-the migas- house made fried pieces of bread (yum!) soaked with grapes, capers, and super cured chorizo- not the plump kind, more like the thinly dried out kind \n\n-the fideua or traditional Catalan paella made with short noodles, creamy aioli, and seafood- perfectly cooked baby octo, shrimp and clams.  I love this type of authentic paella, which is not tomato based or rice based as others are.  The noodles had a strong seafood flavor and almost tasted a little Asian\n\n-the vegetable terrine, a special. Light tomato sauce with fried cauliflower on a bed of potato and zucchini... really hearty but light at the same time \n\n-for dessert, we were debating between the sea salt and olive oil and date cake. Our server highly recommended the date cake, and it was definitely really nice.  It was like a softer biscotti on the outside- hard, but chewy and gooey on the inside with a dark molasses type of feel.  Atop was cream and a really yummy lemon curd- I love tart desserts!\n\n-of course, we had a pitcher of Sangria, which gives you about 5 glasses. It's not overtly sweet and disgusting like many other places; very fresh and tart with fresh fruit. \n\nHighly recommend. $150 after tip.", "author": "Stephanie Y."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-25", "description": "I had dinner here with my parents and my boyfriend when my parents were visiting NYC. It's not cheap, so it's a great place to go when your parents are treating you! :) I made us a reservation about a week in advance, which I would recommend since the place is small. There are two booths by the windows in the front-perfect for larger groups. There is also seating at the bar, and then one table that seats probably 10 people, and then a small number of 2 person tables behind that. We sat at the 10 person table (be prepared to sit close to other parties!) The hostess and our waiter were both very welcoming and patient. The food came out at a good pace and our waiter even offered to chill our bottle of wine to my dad's liking. \n\nThe space felt clean and simple in the best way. The exposed brick, the lighting, the minimalist decor, and the white furniture were all perfect. \n\nNow for the food! We had: \n\n-spiced fried chickpeas -- We loved these!! They had a lot of flavor--cumin, I think? They were so simple but super flavorful and addicting.\n-cucumber and grain salad -- Also really yummy! Again, super simple but flavorful and refreshing. A nice contrast to the salty and fried dishes. \n-noodle paella -- Not my favorite. Didn't have much flavor. \n-Catalan sausage -- This was good except that I was expecting one large sausage. This was a skinny sausage wound around a few times. \n-Spanish red shrimp -- Really good! Each plate comes with 2 large shrimp-lots of flavor. Expensive though. \n-duck special -- Delicious! This was done perfectly. \n\nI only wish we'd ordered the suckling pig! We meant to but forgot by the end of the meal. \n\nFor dessert we had tres leches flavored custard. This is was okay but I would probably get the ice cream or almond cake next time. \n\nTapas style places are nice because they draw out the meal and allow people to just sit, relax, and talk. No one is in a rush or busy scarfing down their meal because each plate comes out as it's ready, and everyone just eats a little of each one. We had a really wonderful dinner here! My only complaint is that it does get loud, so don't go with anyone who is hard of hearing!", "author": "Elizabeth C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-27", "description": "Literally one of the best meals I've had for years! I came here for dinner with my boyfriend as a special occasion (it is pricy)-- but their dishes are some of the most flavorful and inventive I've had. Would definitely recommend. They also have a great small outdoor patio!", "author": "Laila R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-18", "description": "Wow. Wow. Wow. Can't believe I lived near here for 7 years and never came. We made a reservation for our 3rd wedding anniversary and it did not disappoint. One dish was better than the next. The white sangria was the perfect refresher on a 90 degree day. When we told them we were having such an amazing meal and we were so happy to be celebrating our anniversary there, one of the lovely waitresses (we had 3; all incredibly attentive) brought us a complimentary glass of cava. It's also a beautiful space. Truly, a fabulous meal. We will absolutely be back. This is the kind of neighborhood gem that makes me grateful to live in Brooklyn.", "author": "Rachel G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-03", "description": "La Vara is Michelin Starred? Damn! \n\nAnd I thought I was cool, checking out this Jewish/Spanish fusion in Cobble Hill...but apparently I'm way behind.\n\nWent to La Vara mid-week with a group of friends, and had no problem getting seated right away at a beautiful round table by the window.  The place is tiny, but bright, and I spotted a back garden for brunching outside.  \n\nOur waitress was tremendously helpful and very attentive - excellent service.  We tried everything on the menu - the fried chickpeas, artichokes, sobrasada con miel (pork with honey bruschetta,) the fiduea (noodle paella,) eggplant, deviled eggs, foie gras, some kind of caramelized onion flatbread, and octopus.  Like any self-respecting blogger, I tried everything.\n\nMy favorite was actually the pork with honey bruschetta - the foamed honey was really surprising and sweet.  Artichokes with anchovy butter were a surprising winner too.  We ordered duplicates of some dishes, wine, sangria, and I started sweating - \"Guys, this bill is going to be, like, $600!\"  Not the case.  It was even affordable (by NYC standards.)  \n\nCheck it out with a small group or a date.  The townhouses around that area are enviable as well.", "author": "Emily R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-27", "description": "Really interesting and delicious food, strong service, and a nice atmosphere.  I have been to Txkito, and thought it was overpriced given the portion sizes, but didn't feel that way last night at La Vara (I believe it is the same owners).\n\nWe tried two of their specials, which were both really good and interesting.  In particular, there was a vegetable dish they called a terrine, which was ridiculously good.  What they do with skate, frying it like calamari, was really interesting and that was a very good dish.  The only thing that wasn't up to par was the roasted chicken.  It was overcooked, and seemed as though it had probably been par cooked previously or something like that.  It was kind of squishy, which led me to question the freshness.  The seasoning and portion was good though.\n\nI actually wasn't very excited about their desserts, which surprised me because I had some good sweets at brunch their once.  They should totally do torajias, or however it is spelled, the spanish french toast, as a standing dessert.", "author": "Craig Z."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-05-14", "description": "Food was tasty, but portions were very small. The fideua/fidua - a noodles casserole with seafood (similar preparation to paella) - was delicious, but there was just a few modest spoonfuls of food on the plate. The rabbit came in three pieces, each of the size of a scallop. \n\nIf you aren't too concerned about budget, give it a try for the quality of food, services and ambience. Otherwise, look elsewhere.", "author": "Giorgio O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-18", "description": "La Vara is a small Spanish restaurant in Cobble Hill and it's a great discovery! When you pass by the windows it looks so warm and inviting you just want to try it. We went in a small group for dinner and were able to share more tapas, salads and entrees. La Vara has a pretty eclectic menu with something for all tastes. It also has a slew of specials of the day, so many that our heads spun as the waitress rattled them off. Every item we ordered was delicious, but here are the ones I am coming back for:\n\n*Anchoas an Aceite - These are not anchovies you get on your Domino's Pizza slice. They're imported and flavored with sesame and hazelnuts. \n\n*Alcachofa - Fried artichokes like I've never tasted before. How can I go back to plain old steamed ones at home?\n\n*Cordero al ajo Cabanil - Cumin roasted lamb breast. Hearty and flavorful.\n\n*Lechon - Not on their regular menu, but the absolute best suckling pig I've had in Brooklyn or Manhattan! We should've ordered more of this and were politely fighting over the pieces. Tasty, tender pork with absolutely fantastic crispy skin.\n\nThe bartender mixes good specialty cocktails and the wine list is almost exclusively Spanish. Service is pleasant and accommodating. The atmosphere is relaxing as if you're in someone's home. We are all coming back here but next time I'm ordering my own lechon. Some things just aren't meant to be shared.", "author": "Jerry C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-05", "description": "We came here for a private event where there was passed plates and a set bar drink menu.  Very impressive.  To me, the fried skate was the best.  Fried perfectly, seasoned well, and quality fish.  the fideua was good, not the best I've had, but still had a good flavor.  I had some mimosas which were heavy on the champagne in a good way.  \n\nThe best thing about the place was the service.  Very pleasant and kept our large group very full with food and drink.  \n\nI would definitely go back for dinner.", "author": "Wesley T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-02", "description": "Going to a well reviewed Tapas restaurant is like going to a unfamiliar family's Thanksgiving dinner. \n\nYou know you should be in for a treat, there are going to be a lot of different things to try and there will be one dish which is a different version of something, which you'll love. \n\nStarted off with what everyone hyped up about this place. The alcachofa, fried artichokes! I have to say, they were great. However I think they were over hyped. I don't see how this was one of GQ's top 50 dishes in the United States. \n\nContinuing, I had the croquettes of the day. Tasty but small, splitting them is something you'll unfortunately do. The lamb meatballs with mint yogurt were good and the chorizo with breadcrumbs was alright but nothing blew me away yet. Until out final dish.\n\nThe fideua, valencian style noodle paella, shrimp, squid, clams and alioli, was so damn good. That is something which should have been on GQ's top 50 dishes in the country. Unbelievable. \n\nI'd recommend La Vara but keep expectations in check. It's a very good establishment. The service is amazing. The place is beautiful. The food is great, but I didn't find all of it to be amazing.", "author": "Mitch E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-16", "description": "My roommate and I suffered constant grief from a friend because we live so close to La Vara and never went before. He, on the other hand, has gone at least 4 times and lives in comparatively \"far away\" dumbo-ish. Granted, when we had tried to go in the past, we always were told there was some obscene wait of 3 hrs+. So after getting denied at Lucali for a 4 hr wait, we thought maybe we should at least try get have a look see at La Vara and...lo and behold, A TABLE!!!*\n\nWE DID IT WE DID IT! It was meant to be, obviously :)\n\nStandouts for me were the cumin lamb, stuffed rabbit, and the suckling pig (maybe not original per se...but very very tasty). The fried eggplant was also good, though I could maybe do with more honey and less cheese. Sangria could have been better if I were to nitpick, but hey, booze! \n\n*there was a real reservation due in about an hour's time so as long as we nommed fast and skiddaddled before then, the table was OURS. of course that wasn't a problem!", "author": "Ellen L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-09-25", "description": "Service was friendly, nice atmosphere and environment, and highly creative and interesting items, but, having been there multiple times already (as a relative local), I rarely yearn to go back. \n\nThe portions can be erratic and some of the dishes don't work as they should (here's looking at you gurullos). I like it, but not enough to put in the rotation.", "author": "Joe S."}], "servesCuisine": "Spanish", "priceRange": "$31-60", "name": "La Vara", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "268 Clinton St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/YnPJLj7vWlk4BsQhN7nuDA/ls.jpg", "@type": "Restaurant", "telephone": "+17184220065"}