{"aggregateRating": {"reviewCount": 339, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-14", "description": "Cozy place! Great, unusual, tasty food..  You won't get an over sized meal here so don't plan on coming hungry.  This is a tapas place, a chance to share some food with your friends and have a drink while you're at it.  They take pride in what they do here and I am a big fan.  We came Wednesday evening and the place was full.  Make a reservation as this place is quite small and fills up quick.", "author": "Christina K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-09", "description": "La Vara is tightly tucked into a very cute corner of Clinton Street, by the park. The location is perfect, and the space is a cute one, conducive to smaller groups overall, but it also has a few 5 and 6 tops, I believe. Service has been good so far, sometimes slow but usually just fine.\n\nThe food is really wonderful. I have heard it's Jewish inspired Spanish, and that does not really show through to me, except perhaps in the chicken dish, but either way, the food is overall quite delicious. The eggplant fritters with honey, as many people have commented, are a must try. The flatbreads are all great. The chicken, well, I could make it at home, but my friend loved it. I have also had a special, this white bean soup with cod, which literally was the best soup I have ever had. It was one of those lick-the-bowl clean, except it must be done in a civilized way so I used bread, types of soups. They always seem to have many specials, which is  nice.\nWine by the glass (and I'm sure by the bottle) is great, and at a good price point.\n\nThe downside? I feel that it is too expensive for the portion sizes. The eggplant is a perfect example - a few small pieces of fried eggplant for like $9. Most of the portions are quite small. Oddly enough, in TONY, they were features as a \"cheap eats\" location. They are not. I easily spend at least $50 here without getting very full.", "author": "Rebecca A."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-05-30", "description": "Rather uneventful yet expensive meal. We tried 6 things:\n1) The foie gras came with a brioche that remarkably resembled a stale airplane roll and was also accompanied by some cheap green olives. \n2) The market vegetables baked in a paper bag were $16, and the bag barely had anything in it. \n3) The suckling pig was fine\n4) The bread with chorizo \u0026 quail egg was nice\n5) The special seafood stew was swimming in the pool of cream with very little flavor.\n6) The desert \"Egipcio\" that was named an almond tart was in reality a really dry and boring cookie with a tiny bit of date filling.\nAll in all - very boring and overpriced.\nThere are better options in the neighborhood.", "author": "T S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-25", "description": "Excellent spanish tapas place. Went there for brunch and eager to go back for dinner.\nRecommended: patatas bravas, churros, la vara burger, el quim (squid with eggs), tortillas gambas (shrimp)\nFriendly staff. Small spaces so perhaps not great for large groups. Supposedly has garden seating but not sure.", "author": "D Z."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-18", "description": "My hubby \u0026 I were lucky enough to get a table at 8:30pm on a Friday night without having to wait. On the recommendation of our waitress, we started with a bottle of the Vina Sastre which was as amazing as she described-full-bodied with a hint of sweetness. \n\nWe shared 7 different plates- each was unique and bursting with flavor. We started with the croqueta because really, who could resist? Sticking with the fried theme, next we had the berenjena con miel--  mm that eggplant paired with sweet honey and salty cheese, so good! We also had the mallorcan flatbread which was good, but nothing out of this world and another chorizo dish which had the perfect amount of kick. We had the suckling pig which was a special of the night- honestly, it wasn't as great as I'd hoped and didn't have quite as much flavor as the other dishes. The chicken asado was moist and bursting with flavor. The standout dish, was the Remojon which we ordered on recommendation from our waitress(the wine was delicious, so we knew she wouldn't steer us wrong). The ingredients in the Remojon were unique and at first, sound kind of odd together- but were so insanely delicious, I could eat this every day-- the citrusy salt cod paired so well with the pistachios/pistachio oil, egg and pomegranate. Mmm it was so delicious!!\n\nI can't wait to come back \u0026 try the rest of the menu!", "author": "Kayla C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-11", "description": "Great octopus \u0026 warm salads. Nice ambience. Friendly staff.", "author": "Sofiya T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-06", "description": "I've read a lot of good things about La Vara, and when I finally got around to eating there, it did not disappoint!\n\nThe food was amazing. Very creative flavor combinations -it all sounded so interesting that I couldn't decide what to order. \n\nEven the dishes that were not my favorite were still very tasty, like the chicken heart salad. The Quail eggs presentation is really nice and they were good, just not super interesting. Now for the mouth watering stuff: Asparagus with manchego cheese was fantastic; lamb meatballs were moist and flavorful; the Remolacha was simple yet delicious. The two stand ot dishes for me, however, were the Suckling Pig and a vegetable terrine that was a daily special that night. The vegetable terrine was so flavorful it blew my mind, and the suckling pig was unbelievably tender but the skin was crispy like a cracklin' -wow.  Finally, I had Olive Oil icecream for dessert and it was a revelation. That probably sounds a little crazy, but it was perfect. I'm going to get an icecream maker so I can try to replicate it.\n\nAs for the complaints about the small serving sizes that other reviewers have noted....it's TAPAS, the plates are supposed to be small!\n\nLa Vara is definitely one of my new favorite restaurants!", "author": "Allison H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-28", "description": "I ended up writing a Yelp review a mere 2 hours after my meal ended, not because I'm such a huge fan of Yelp, but because I enjoyed my experience so much I had wanted to write a letter to the restaurant....unfortunately it turns out they don't have a website. \n\nSo here I am. I can't remember the last time I had such an enjoyable experience at a NYC restaurant. The food was good. Like, REALLY, good. But we ate so many different things, I can't even begin to remember, much less review it all. Except for the Almond Cake. Save room for dessert. And don't plan on sharing. \n\nBut what really sets La Vara apart is the service. Every single person we encountered - from the hostess, to the bartender, to the server, to the food runners - was so welcoming and so kind. From when I walked in to when we all left, I felt more like I was visiting a friend (who can really cook!) rather than sitting in a restaurant.\n\nI should mention that we were a group of women, old friends (some of us have been friends for 20+ years), that do our best to get together every other month. We all come from the restaurant business, but we're not all still in it. There seems to be something about a group of women dining out that make most servers cringe. We saw it when we worked in the business and we experience it when we dine out. And sure, after a few rounds of drinks we might get a little loud. But there's no dressing on the side, light butter, split the check 7 ways, with this group. We are out to enjoy each others company, some good food and some good wine. And La Vara was the perfect place to do just that. Thanks La Vara, now just get a website and an email address!", "author": "Gabrielle G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-17", "description": "While there are a million and one delicious dining options on NYC, it is rarer to come across a place that does something unusual in the truest sense. La Vara is one of those places. Focusing on Spanish tapas with a Sepharic Jewish influence, La Vara's menu is constantly changing seasonally. The dishes are meant to be shared; I usually find that five or six are the perfect fit for two. Cocktails are adventurous and the sangria (red or white) is great, as well. Front of house staff are some of the most attentive and well-versed in what they're serving that I've seen in Brooklyn.", "author": "Molly O."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-28", "description": "Great food, but small portions and pricey.  Nice staff. Red sangria is great, during HH $5!", "author": "John B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-10", "description": "It's hard for me to enjoy a meal more than this. Can't wait to go back.\n\nI shared a sizable meal with a girlfriend at the bar. We had probably a dozen small plates, capped at the end by the suckling pig (that's not what it's called, but it's the dish they're really known for. Crispy skin you have to crack with a fork; tender, gorgeous, moist shank...yum.) By far one of the best dishes was the salt cod salad with pomegranate seeds, olives, and a whole bunch of other fun stuff including citrus. It was a gorgeous plate, and so unique. The empanadas were sorta sweet, but nothing special. The chicken heart salad was really fantastically delicious for being so simple - the hearts come on a skewer on the side...\n\nThe whole Ashkenazi/Moorish blend is pretty clever. The menu and the decor are refreshing. It's bright and airy. La Vara's menu is super creative, and the flavors live up to the promise. I hope they're appreciated, and don't lose their neighborhood comfortable feeling as they become more popular.", "author": "Lauren L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-20", "description": "I really enjoyed this place. Met a friend for an early supper at 6:15, on a Monday evening. The staff is very, very welcoming. Had a really delicious gin and tonic. Large and well made with a beautiful, large spiral made from half of a lemon rind. We ordered charred peppers, lamb meatballs, sardines with a gel, sauce and a quail egg, fried artichokes. The amuse bouche was carrots cooked with garlic. The best dishes were the fried artichokes, peppers and carrots. A couple different kinds of bread came with the dishes. My friend had date cake and I had ice cream with poached rhubarb, for dessert. Very delicious desserts. Plating was beautiful. We ate on the patio which was quiet and nice. It's a small place, tables are not crazy close together though, which I appreciated. You feel like you've eaten at a place where people care about the customer experience and the food.", "author": "Jane R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-18", "description": "Wonderful neighborhood place for small plates (mostly) and nice wines/sherries. Many more hits than misses on a menu that is varied in terms of flavors, textures and ability to satisfy vegetarians and carnivores alike (I'm in a mixed marriage). The cumin roasted lamb with several sauces and roasted leeks is an all time favorite of mine (correct! I'm the carnivore). Salads are bright, flavorful. Blistered Shishito peppers are a true taste of Spain. \nService is always friendly and attentive. After only a few visits they came to know us by name or at least sight. Décor is a bit generic/nondescript and things -- as in many Brooklyn restaurants -- can feel a bit tight when the place gets crowded.", "author": "Barry P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-04-27", "description": "**DISCLAIMER - I'm a vegetarian so can't speak to what the meat/fish is like here, which is a large portion of the menu\n\nI kind of feel like this is an \"Emperor's New Clothes\" spot - people all just keep hearing it's AMAZING and don't question it. It's really just meh-to-ok. I came on a Saturday night and was really happy/lucky to get a table. Our waitperson was friendly friendly and  food came out quick. The problem was the portions were psychotically small (even for tapas) and mostly not very good. We had the famous artichokes that tasted like street fair food - greasy and not much flavor. And a chick pea spinach \"stew\" that really truly tasted like hospital food - limp and swampy and generally very unappealing.  The eggplant was very good, however, as was the flat bread. \n\nI just think given the hype and prices, I was expecting a lot better and that chickpea stew isn't up to par for most home chefs, let alone such an acclaimed restaurant. I was really surprised.", "author": "Emilie S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-02-07", "description": "Been here twice for brunch.  This time for dinner.  Meal with 4 tapas and pitcher of sangria was over $100 before tips.  Suckling pig special ($30 small appetizer sized for 2 person) was best dish.  $29 pitcher of Sangria had too much soda and not enough wine/liquor.  The $8 sangria glass at 1st brunch was delicious, while the sangria at 2nd brunch had the same problem as the sangria at dinner.  A Michelin star restaurant should not put customers in a situation where they have to consider sending the drinks back.  Won't be back for dinner.  Regarding the brunch, the migas was pricey and small but delicious.  Consider other restaurants within the mile: Fragole on Court St. and Colonie on Atlantic Ave.", "author": "Corey B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-08-12", "description": "The food is undeniably good but it's a tapas place and everything on the menu is meant to be shared, meaning the portions are tiny and you in no way fill up. So you keep ordering more and more until you realize it's pointless, you will never fill up and ask for the bill which by then comes up to an astronomical figure. Good business model.", "author": "Lana V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-15", "description": "Come late, at a strange time, or be prepared to wait. La Vara is pretty tiny, although the bright lights keep it from feeling too cramped. We sat at the bar, and found the bartender/server incredibly engaging and attentive. Due to some allergy issues, we (ok, I) had a lot of questions, and she was really great about getting answers and not making a big fuss. \n\nI think La Vara really is a great addition to the neighborhood, but I'm with some other reviewers on the price. Their food/fullness/price ratio is just a bit off. The husband and I thoroughly enjoyed our very late dinner last weekend, but we walked away with a not unsubstantial bill...sans drinks. \n\nI could happily eat their eggplant dish every darn day. It was that good. And I really enjoyed the empanada-style cornmeal pockets with seafood. I was hoping to try the \ncuttlefish dish, but they were out by the time we arrived (well past 10pm).  The husband liked but didn't love their homemade pasta with goat. I couldn't try the pasta, but the tiny nibble of goat was good if a bit bland. \n\nWe both really enjoyed dessert. His \"slice\" of date cake w/ lemon curd and cream was huge, and I found my rice pudding-ish/grapefruit dish a little strange but refreshing and delicious. \n\nIf not for the memory of that eggplant dish, I'd probably give them 3 stars (just too expensive). But I think they earned that extra star. And if I'm being honest, I want them to stay in business so that I can go back any time I want (well, any time that not's prime dinner time) and eat that eggplant dish.", "author": "Saskia S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-18", "description": "Super romantic atmosphere. All plates are made to be shared which is awesome. Highly recommend the gazpacho, probably my favorite dish of the night. Service is really good, food doesn't take too long to come out. They also gave us a free sample of an item that they wanted to add to their menu, so yummy. I would love to go back and try other dishes.", "author": "Jennifer O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-06", "description": "This was an amazing place to dine at. We were visiting NY and wanted that night to stay put in Brooklyn, so a relative suggested L Vara knowing how much we enjoy spanish cuisine. We were very pleasantly surprised. Since I waited too long to  write the review , of course I forgot what we ate. All I remember is that there was not a single tapas on the menu that we ordered that we did not enjoy. We have already recommended it to many of our friends there.", "author": "Fatina B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-03", "description": "La Vara is our go to 'nice' place.\n\nIt's small, so go early or get an RVSP.\n\nFavorites: Migas, chick peas, crispy eggplant, sprouts. The little sandwiches were a bit underwhelming.\n\nAnd there is the rub...this place is expensive, and the plates for 'sharing' are really good for 2 people...and there's not a lot of food. And it adds up quick. Also...it's small...and on a busy night, people might be 2 deep at the bar, and you're trying to eat.\n\nBut if you know what you're getting into...it great, and interesting.", "author": "Allen P."}], "servesCuisine": "Spanish", "priceRange": "$31-60", "name": "La Vara", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "268 Clinton St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/YnPJLj7vWlk4BsQhN7nuDA/ls.jpg", "@type": "Restaurant", "telephone": "+17184220065"}