{"aggregateRating": {"reviewCount": 339, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-11-02", "description": "Was hoping for so much more. Highly disappointing. Flavors were\nBland and prices were high for what you get. First and last for us. F us one time\nAnd that's enough. Service and atmosphere is nice enough.", "author": "Amy T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-11-11", "description": "So yummy! And really interesting, different dishes too. We stopped in for brunch and sat at the bar on a Sunday. We got the nuestras bravas to share and one croqueta each. Croquetas are unreal, I could eat a thousand. We shared the Huevos a la flamenca and the tortillita de gambas which was delicious if you don't mind fish. They're both so good!! Service was awesome and ended with the churros :) definitely go!", "author": "Allie G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-24", "description": "This place is SO good. I call it my \"special occasion\" place cause it's a little too expensive for me to go there regularly but every time I do go it's amazing. TRUST the servers as they make great recommendations on the best plates/how many to order. When the weather is nice I love to sit in the backyard garden area. Be sure to make a reservation in advance!", "author": "Carrie A."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-12-27", "description": "I'm sad to give this place a 2 because we had high expectations going in for our reservation. We were a reservation of five people at 8:15. Our experience went from good to pretty bad by the end of the night.\n\nOur first waitress was really good and was knowledgeable about the menu and experience. But we definitely over ordered even though it's tapas style dining. Dishes like the artichoke (alcachofas) and garbanzo fritos can definitely be shared by 5 people. We got two of each and it was too much.\n\nHere were the highlights:\nGarbanzo Fritos (one is enough though)\nMigas Aragonesas (this was delicious)\nFideua (noodle paella - also delicious)\nEscalivada (market vegetables - probably the best) \nBerenjena con meil (eggplant - very good)\nFoie gras (special on the menu)\nGood wine list and sangria was good.\n\n\nHere were the average:\nStewed beef in stuffed peppers was ok \nOctopus with mushrooms was ok \n\nHere were the terrible:\nPollo Asada (super dry and tasted of raw spices) \nArtichokes (really bland)\nGurullos (this had to be the worst, it was sooooo flavorless and had all the wrong textures but it was highly recommended by our waitress and so we got two)\nBread pudding (it was just terrible I can't even begin to describe it) \n\nWe told our second waitress that the Gurullos (homemade pasta) was bland and really not good. She didn't comp it for us.\n\nThe bread pudding was so bad that we didn't even get through half of it. 5 people taking one bite of a small dessert. We noticed a cockroach crawling right behind us on the wall. Other customers noticed it too. \n\nThe waitress tired to pass it off as a \"New York thing\" which was very inappropriate. In all our years of living here and paying 70+ dollars per person for a meal, we've never been joined by cockroaches. It was not pleasant or reassuring.\n\nWe reluctantly paid our bill and left so we didn't have to be there anymore. \n\nYou can't see the roach clearly but it's there.", "author": "Maya V."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-11", "description": "My brunch experience here was underwhelming overall, especially for a 1-star Michelin place.\n\nThe place isn't big, and all seats were taken around 12 noon. Came as a party of 4, with a reservation so that wasn't a problem. Fortunately, we were seated at one of the round tables near the entrance which had more space.\n\nService wasn't good, but not bad. The waitress was quite slow to take our orders and she weren't very capable in recommending items on their menu. When asked, \"What's popular here?\". She said, \"Everything, depending on your preference.\". Well, that wasn't helpful..\n\nAnyways, moving on to the food. We shared:\n\nGarbanzos Fritos (fried chickpeas)\n\nPan Amb Tomaca (tomato bread)\n\nTortilla de Calabacin (omelette)\n\nTortillita de Gamas (shrimp chickpea wafer with avocado-cumin vinaigrette topped with fried eggs and crispy silver fish)\n\nAlcachofas y Favas (artichoke, fava bean stew with poached eggs)\n\nCuchifrito (lamb with potato hash in ajo cabinil sauce, topped with poached egg)\n\nChurros with salted caramel dipping\n\nTorrijas (spanish french toast with a grapefruit that was drenched in liquor that made ruined the taste) \n\nAs you may have noticed, there's a lot of eggs on their brunch menu that we ordered, which felt a little weird especially when we were sharing. Also, I had someone who couldn't take shellfish and pork, so there weren't much options for us to share. Perhaps, I could have had a better dining experience if I was with a different group of people who didn't have any dietary restrictions. Out of all the food that we had, only the Tortillita de Gamas and Cuchifrito were decent. The rest weren't really worth trying.\n\nI can't speak for dinner, but I'd say go somewhere for brunch.", "author": "Lily L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-11", "description": "Gourmet Spanish food. Mostly small plates. Great quality. Causal ambience. I loved the lamb and the special Gazpacho Blanco. Very good the stuffed rabbit as well. Not impressed by fried artichoke I was under the impression was similar to the Roman Jews style Fried artichokes. The Paella noddles a mixed feeling, good flavor but the noodles too mushy for my palate. A no the fried eggplant: too small too salty. \nWines are only from Spain, If I'm not wrong. A pleasant selection.", "author": "Andy C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-12", "description": "Love this place.  The giant prawns are delicious.  The deviled eggs always need to be reordered.  Cocktails good.", "author": "Maria C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-12-07", "description": "A nice clean tapas restaurant, in a great neighborhood in Brooklyn, with super friendly and helpful staff.  I like it!  I can knock it only for their failure in making their own tonic waters to highlight Spain's national drink more: the Gin and Tonic.  These guys would be VERY good at that if they tried.  You can tell they take care in their food preperation and everything was fantastic.  I had about 5 or 6 dishes to sample, and each one was top notch.  I would happily come back again.  Nice job!", "author": "A. B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-01-30", "description": "It's likely necessary for me to caveat this review with the fact that we visited La Vara for their weekend brunch, so I can't say for certain how representative that experience is for the restaurant as a whole. What I can note, however, is that La Vara was one of the newer additions to the list of Michelin-starred restaurants in NYC in 2016, and they've continued to hold their accolade for a second year. The restaurant specializes in Spanish dishes that are more notably influenced by Jewish and Moorish cuisine, so ingredients such as cumin, saffron, and even orange blossom are more prominently featured in the cooking.\n\nThe restaurant is quaintly located in a tree-lined street in Cobble Hill; the well-windowed front and white-themed interior give the venue a bright and welcoming initial appearance, and was especially welcome on the sunny afternoon that we visited. The inside was quite busy as well, so reservations are very much recommended (and easily made via OpenTable), but the majority of guests seemed to be locals and families. It's a fairly laid-back and casual atmosphere, so there's no need to dress up or go out of your way to feel at ease here.\n\nWe started off with a order of the Spiced Chickpeas, which were delightfully crispy and generously spiced with cumin, paprika, and cayenne with just the right amount of salt. They're ideal for keeping your tastebuds occupied without filling up your stomach, and can be shared with a small group. \n\nAs for the mains, I went with the Lamb Cuchifrito, which was a dish comprised of braised lamb over a potato and pepper hash and topped with two poached eggs. In retrospect, the dish was better portioned as an appetizer versus an entrée, but the lamb was tender and flavorful, and the bed of potatoes and peppers were well-seasoned complemented well with the runny yolk from the eggs. As a whole though, there wasn't anything particularly noteworthy or outstanding about the dish that would entail an immediate return visit.\n\nPerhaps I'll return for a second visit during their evening hours, but until then La Vara...", "author": "Lori L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-12-31", "description": "The service was great... the food  so so . .  except for the tuna  which was great... the prices a bit much for such small portions... the wine pour stingy... very stingy\nOverall on a scale of 1 to 10 I would give it a 6.... not worth it", "author": "Marsha R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-10", "description": "I am spanish and this is my favourite place to eat spanish food in the city.  Bit far from manhattan but if you're in brooklyn its worth visiting. Cochinillo is amazing and the surprising olive oil ice cream amazing too", "author": "Nicolas A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-04", "description": "Can Michelin Star restaurant be hearty and down-to-earth? Yes, comes to La Vara (see note about the name). It might offer the most delicate and artful presentation, but I felt relaxed, satisfied and happy during my two visits--one dinner and the other brunch.\n\nMy last visit was around 1pm when most people just woke up in Brooklyn and started to form lines at coffee shops or bakeries. The little cute restaurant sits next to the Cobble Hill Park is nice and inviting. Big windows bring enough lights into the space; the decorations in white and gold are modern and simple; the tiny garden in back is a perfect spot for summer brunch.\n\nHighly recommend fired chickpeas for both dinner and brunch; cumin lamb, and duck for dinner; huevos a la flamenca for brunch! Wines are solid and priced seasonable (many options under $50).\n\nOverall, quality is consistent from my last visit. All the dishes I tried there are flavorful and delicious. Although portion is on the smaller size it's justified by the price. Plus, I could try more dishes!\n\nNote: La Vara was also the name of a Jewish newspaper published in New York until it ceased in 1948. It was written in Ladino, a Castilian-Hebrew hybrid that was to Spain what Yiddish was to Eastern Europe. The language has all but vanished from the city, but it remains on the headstones of Sephardic graveyards in Queens and the Bronx, out in plain sight for those who know where to look.", "author": "Cristina X."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-19", "description": "Exceptional.\nA few minor things.\nFried chick peas were adequate.\nOnion flatbread typical.\nEggplant and pork, sensational.\nDessert exceptional as well.\nTetilla is cow's milk, not sheep.\nServer needs to know that.\nRan out of beer choices.\nAll in all, a rare and wonderful meal.\nThis is a very special place.\n\n4.5 stars.", "author": "Food E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-25", "description": "I've been coming to La Vara for years and it's never failed me as the perfect spot to bring friends and family to enjoy a great meal. The atmosphere strikes a good balance between an upscale restaurant and a neighborhood hangout. You know you're in for a Michelin-worthy dinner but can enjoy a fun, casual vibe at the same time--hence why it's my go-to for friends and family. \n\nThey serve Spanish-style tapas which are fairly sized and appeal to both casual and adventurous appetites. While my dad will go for the half chicken or roasted lamb, I'll go for the chicken hearts or the noodle paella with shrimp, squid, and clams. But since it's all family-style, I get to enjoy everything anyway. If you're looking for guaranteed hits right off the bat, opt for the eggplant or the artichokes. You'll thank me later.\n\nAs for drinks, they've introduced me to a host of really fantastic Spanish wines but I'd be remiss if I didn't mention their take on a classic gin and tonic: La Cinchona. It's my favorite cocktail hands down and pairs really well with pretty much everything.\n\nIt can get pretty busy, but service is always attentive and happy to help guide the next order. If you can't make a reservation, sitting at the bar still offers a really good experience and sometimes I prefer that. Next time you're in the Cobble Hill area--and even if you aren't--do yourself a favor and check out La Vara. And remember, La Cinchona and chicken hearts!", "author": "Jesse M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-23", "description": "This restaurant is situated in a residential neighborhood and I am grateful for our Uber driver who delivered us to the front door and on time.  We booked La Vara a month in advance and for sure don't want to miss out on the opportunity.  I think it is a one-star Michelin rated restaurant for the last three years.\n\nService was prompt and our server was very sweet and professional.  She knows her food and drinks very well.  They are famous for their small plates and we ordered probably at least one round each and some we doubled or reordered again.  Here are a few memorable dishes:  Fideua is different since this paella uses noodle instead of rice.  The Cochinillo or suckling pig is crispy on the skin but soft and moist with the meat portion.  Pescado or the seasonal fish dish was done just right, tender and moist.\n\nIt was a great evening with family and friends.  We were the last customer to leave.  Highly recommended and reservation is advised.", "author": "Kin N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-05", "description": "Everything we tried was delicious: croquetas, chorizo, lamb meatballs and suckling pig. The dessert was very delicate and beautiful finish to a great meal. I can't wait to go back!", "author": "Sylwia K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-17", "description": "Exquisite. Food 4/5. Service 5/5. Decoration 4/5. Drinks 4/5.\n\nThe food was artfully crafted, delicious and fulfilling. \n\nI ordered the lamb.The balance of flavors were elegant.  The food was not too tender or tough, nor too sweet or salty and had a touch of spiciness-- taking my meal to another level. \n\nOne experience everyone should have.", "author": "Joe T."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-07-16", "description": "I came here for my birthday early on Friday evening after looking forward to it for a very long time. Unfortunately, I was completely underwhelmed. \n\nThe atmosphere is quaint and lovely. The waitstaff were friendly, if not overly so. We ordered about six plates and a pitcher of sangria. \nFood pros: \n-pig was crispy and generally very good\n-cumin lamb was quite rich and seasoned well\nFood cons:\n-The sangria truly had zero alcohol in it. \n-Received 4 small, cold pieces of baguette on the side?\n-One of the specials, the asparagus, was on top of a broken aioli and just wasn't really palatable.\n-Deviled eggs were completely overwhelmed by mustard. I looked forward to the unique addition of tahini, but couldn't even detect it. \n\nI knew to expect relatively small portions and higher prices, but it was truly just much too overpriced for what we got and I really wish I didn't feel that way! We got pizza an hour later because we were still hungry. :/", "author": "Claire F."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-05-31", "description": "Now I'vee been coming here since it opened and I can tell you that food wise this place gets 5 stars. Their selecion of Spanish dishes is one of the best in nyc, if not the best. Eder, the owner is amazing and super sweet. I have never hesitated to recommend this place to anybody until today. I walked in at 5:30pm on a Thursday night and the place completely empty and I was turned away by a young kid because I did not have a reservation . obviously things have changed since opening and unfortunately not for the better. PS. I walked by 45 minutes later and the restaurant was still half empty", "author": "ignacio a."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-15", "description": "Really lovely spot with inventive, small plates to share.  I came here to celebrate a birthday and it was a great \"treat\" type of meal.  Lots of options, great service, and really delicious bites.\n\nOur favorite was probably the crispy eggplant, served in a bed of melted, gooey cheese.  And the fandua - the paella style pasta dish filled with fresh seafood.\n\nHighly recommend for a special meal, or for some great tapas in a cute little neighborhood.", "author": "Katie G."}], "servesCuisine": "Spanish", "priceRange": "$31-60", "name": "La Vara", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "268 Clinton St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/YnPJLj7vWlk4BsQhN7nuDA/ls.jpg", "@type": "Restaurant", "telephone": "+17184220065"}