{"aggregateRating": {"reviewCount": 572, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-01-15", "description": "Note- this is specifically for a special order, my wedding cake. In general I'm a big fan of the bakery they have delicious cake. Unfortunately they were disorganized, It rooms 4 emails for them to even respond to my initial request for a tasting. I should have taken this as a sign...\n\nWe received a very messy version of the wedding cake i envisioned. The middle layer design is completely unevenly applied. The cake layers were lopsided. We discussed that they would get someone to create a large sugar flower (sample picture attached) in a light blush. They threw on generic pink roses and completely disregarded my request. The cake did taste good, so adding a star for that.", "author": "Caitlin M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-22", "description": "I always like to give places a second try - especially if it's two blocks from my apartment.\n\nSince my first time going (and my first review), I've come to realize that their cakes are DELICIOUS and always moist (especially the cupcakes - which apparently.. is tough to do since I've tried many dry cupcakes from \"good\" bakeries). Bumping up their rating for cakes and cupcakes!", "author": "Carol H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-17", "description": "Good desserts with a wide variety of them. The owner is a really nice and friemdly guy came to our table and had a very pleasent conversation. Will recommend", "author": "Muhammad A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-03-29", "description": "First experience was okay. My mom took me there and I ordered red velvet cheese cake within all the other choices but i guess was not the best pick. Top coating was a bit dry. Their check in offer for a cup of coffee with any order is a nice touch. Coffee was good.\n\nSince it's my brother birthday today, we also wanted to get a to go cake, asked for a 8 inch blueberry cheesecake but they had a 10 inch. We still got it, was about $45, left our name to pick it up within couple of hours and they were totally cool with that. When mom picked it up and left the place, she checked the receipt on it by chance on her way home and saw that it belonged some other person so she had to walk all the way back to bakery. The girl who assisted us in the morning had left so she had to bother to explain what happened and apparently, the blueberry cake was gone too. They were kind enough to give the next available size so everyone is happy now :) I will definitely go again to try other cakes and desserts they offer. Prices are so reasonable.", "author": "Ceren A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-21", "description": "I had an amazing time here . It's so relaxing and the vibe at this bakery is great; nice seating area  . They played great music ; loud enough for you to here but quiet enough to enjoy the person that you're with conversation . I had a carrot cake which was inexpensive ; taste was very rich and not to sweet . I will most certainly be coming back !!! I'm smiling just thinking about it", "author": "Ayers A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-05", "description": "We ordered a two-tier strawberry shortcake from Mia's for my friend's bridal shower with a chinoiserie theme! The cake was a huge hit! Delicious and decorated perfectly!\n\nClaudia was so easy to work with and always very responsive! It was also delivered on time to the bridal shower, so I'm eternally thankful!", "author": "Natalia K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-19", "description": "Great place and ambiance for that cafe feel.\n\nThis place is huge with plenty of seat and lots and lots of pie, cake and every more baked goods. \n\nPie is a bit too heavy however it's delicious.", "author": "Kevin Z."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-12", "description": "I can't explain to everyone how good this place is. One night my boyfriend and I were craving a lobster tail. We only knew that we could get them in little Italy and we were not going there on a Sunday night at 8pm. I decided to look on yelp if anyone had lobster tails and Mia's Bakery showed up. I was nervous I would go all the way there (1 mile walk) and there be none, but I wanted to walk anyway so went. I got there and I was amazed that not only did they have an abundant of lobster tails, but they had soooo many things! Every dessert I could think of was here. We of course got a lobster tail, cheesecake, and crepe brûlée. Everything was out of this world good. We have gone back many times since, it's starting to become a weekly thing, which is not helping my weight any. Right now my favorite favorite thing is the croissant donuts. Omg unreal. The maple bacon one is my favorite thing in the world. Cannot wait to go back there and try something new!", "author": "Rebecca F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-09", "description": "The tres leches cup cake is amazing. I am addicted to it and I can't stop going back for more.", "author": "Anna C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-23", "description": "The cake slices are fantastic. Lots of options - all moist and delicious. And unlike other places in the neighborhood, they're open late.", "author": "Nick S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-30", "description": "Great service. The desserts and beverages are over the top sugary, so I wouldn't recommend it you're not into grossly sweet snacks. But it's a wonderful cafe to catch up with a friend, take a break, or read solo. Patio included!", "author": "Angela K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-03", "description": "AWESOME! \n\nOMG...the selection here is incredible and everything always tastes fresh.  If you have a sweet tooth, this will be your paradise/diet downfall. \n\nThe service is super attentive and the employees are very helpful and sweet (no pun intended).  \n\nThey have a beautiful backyard that's perfect for an afternoon snack or after dinner dessert.  \n\nAbsolutely adore this place and hate that I don't live closer.  Can't recommend it enough.", "author": "Stephanie Y."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-25", "description": "So far I've only tried the tarts. They are very tasty (above average), but also very expensive: more than $6 for a single (large serving) tart.  \nOnce nice thing about this place, which will probably insure that I come back, is that they are one of the very few cafes which are open quite late.", "author": "Aliz C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-19", "description": "I love Mia's bakery because they have a huge variety of sweets and drinks. It's a great place to meet up with friends to catch up.", "author": "Rachel S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-16", "description": "Love Love Love!! I came in here for a last minute custom cake and they were able to make me one within 4 hours with my own adjustments. Staff is really polite and there's yummy cupcakes and macaroons as well. My go-to bakery!", "author": "Zar K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-12", "description": "First time here and the variety was amazing . I originally went in for a sea salt cAramel cake but bought the vanilla strawberry instead absolutely DELICIOUS. I am buying cupcakes for my team and definitely recommend", "author": "Olga A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-14", "description": "Passed by this place on my way to lunch. Decided to back for dessert. I was not disappointed. Had a slice of cheesecake and free coffee. Both were very good. They have so many options and a garden. Will definetly be back!", "author": "Arline B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-30", "description": "If you walk into this place, I'm telling you, you're going to be like a kid in a candy shop. The various selections that they have on display is unreal! This will definitely keep me coming back to try everything that they have to offer.\nI started out with a slice called the Blackout which seems to be a double or triple chocolate cake. With one bite I was already a fan of this place, savoring every last bite. I absolutely can't wait to be back here, it's simply just that good!", "author": "Jacky C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-19", "description": "Ordered the carrot cake, but it tasted stale. I told my server who told me what else I would like to try off of the menu, I decided on the German chocolate cake which was delish! The server was too kind, she didn't charge for either", "author": "Fozia A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-03-26", "description": "Terrible table service. Waited 25 minutes to be served coffee - simple, black coffee. Basic. I didn't even want milk. To my surprise, everyone around me who was sat AFTER me was served their coffee and food. No acknowledgement either about the fact that it arrived nearly half an hour after I had ordered. \n\nSomeone at a table right next to me even asked for a refill on their coffee about 15 minutes after I ordered mine and to my surprise a minute later her new coffee arrived. Wow. \n\nThis isn't the first time I've been here and had been left waiting forever to be served or even to have someone ask if we wanted anything.\n\nIt's not that their busy either. At all. One time I was waiting for an order for about 10-15 minutes (black coffee and cake) - saw the server who was helping just standing there...staring out of the window...at a cat.", "author": "Sarah .."}], "servesCuisine": "Cafes", "priceRange": "Under $10", "name": "Mia’s Bakery", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "139 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/SM4ZOzR354iQi9Xvf1b68g/ls.jpg", "@type": "Restaurant", "telephone": "+13479873194"}