{"aggregateRating": {"reviewCount": 572, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-16", "description": "Walking towards Atlantic Terminal I saw this place and had to walk in. They have almost an overwhelming amount of options. I got the salted caramel slice for myself and red velvet for my brother. Both were amazing! The salted caramel was one of the best desserts I have ever had. They also have a nice seating area. Would 100% recommend if you're looking to satisfy your sweet tooth or a place to chat with a friend!", "author": "Mary C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-25", "description": "This place was excellent! So happy they have late hours so perfect place to catch dessert after dinner or a show. The bakery had a very extensive variety of pastries, cakes, macaroons, and more! Very tall layered cakes and decadent cheesecakes. Beautifully and artfully presented gives these desserts added flair. My dad decided to try the Nutella layered cake, which was absolutely delicious. It wasn't too sweet which was a plus and the crunchy layer added yummy texture to the cake. We also tried the apple cheesecake. True to it's name was a beautiful blend of cheesecake, apples, and cinnamon crumble. Last but not least, we took home a slice of Flan. THAT was so lovely. Like creme brûlée but without the crusted sugar top. The custard cake practically melts in your mouth and the syrup topping was again not too sweet and overpowering. Mia's Bakery has gained 3 new loyal customers!", "author": "Régine T."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-07-13", "description": "Bakery goods are terrific but expensive.  I am only giving them 2 stars because I felt  customer service was crappy.  Someone needs to put on a smile and act as if the customer isn't a pain in the butt!", "author": "Barbara P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-09", "description": "Picked up a tres leches cake on a Friday around 11:45. Staff was readily available \u0026 friendly. The bakery was a nice cozy place with a back yard patio it appears. The cake was super moist \u0026 yummy! Will come back and try other desserts!", "author": "Eileen M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-09-28", "description": "Went to Mia's bakery in search of a sad-day cure and it did a decent job. \n\nI was craving coconut cream pie but unfortunately the nice lady behind the counter told me they were all out. I settled for the coconut cake and an Oreo cupcake to wash it all down (because I'm a winner.)\n\nThe coconut cream pie was tasty but nothing to write home about, though that could just be because I was in that coconut cream pie mood. The Oreo cupcake was also yummy but the frosting was cold and firm. \n\nAll and all, Mia's was just what I needed that day though I'd love to see them take their desserts to the next level.", "author": "Shannon G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-03", "description": "My wife and I live near Mia's, and since it opened it has become a go-to for us. The pastries, baked goods, and staff are all excellent. When my parents were in town I brought them there after dinner one night; they loved it and wanted to go back the next night. (It probably didn't hurt that the owner gave them a free cookie.) And when we ordered cupcakes from them for our wedding, the owner delivered them himself, even helping get them--and another dessert from another place!--set up. They also seem like they pride themselves on being part of the community.\n\nI don't write many Yelp reviews, but wanted to do so for this place. They're well worth the time.", "author": "Jeremy K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-05", "description": "Amazing amazing amazing . It has like every dessert possible ! So yummy ! I had the vanilla bean cake and it was just so good . It was very moist and it wasn't sweet . I brought some home to my mum and she ate it . She doesn't like cake so that says a lot lol . My best friend had the fudge brownie which was so Fudgy and yummy . Every girls dream this place lol . I can tell this business is family owned and the owner I think was walking around seeing how we were enjoying our dessert which was really nice . You will enjoy this place . Go now lol", "author": "Chelsea P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-13", "description": "If you despair at the thought of big, fluffy, tasteless cakes that often make appearances at parties and events, Mia's is your salvation. The cakes are truly delicious, big enough to share but not so big that they'll colonize part of your fridge. They are dense and toothsome, flavorful and sweet-but-not-too-sweet. My girlfriend immediately fell in love after trying one for the first time, and now I even get one to bring to Seattle when I fly out to visit her. It's a hassle to take care of a cake through the ordeal of flying, but it's worth it to see her smile when she takes a bite of Mia's. She knows she won't find a replacement anywhere else.\n\nBuy your next cake here. It'll be just the thing.", "author": "Bernard S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-26", "description": "This is the best bakery I have ever been too! On vacation from CA and ate at 4 different bakeries so far in NYC and this is the best place ever to go to for desserts! Between our group of 10 we tried 17 different desserts and all was amazing!!!!", "author": "Sam M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-18", "description": "They make a pretty nice cup of regular coffee. They have gingerbread cookies that are soft and just the right amount to tease your palate without giving you that crack sugar rush.", "author": "Dominik D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-25", "description": "Canoookies!!! They were so awesome. My family really enjoyed the pumpkin pie and the cheesecake; the crust was soft and flaky; the pumpkin was hands down the best one I have ever tried. The decor was 5/5, the presentation 5/5, hospitality 5/5. I am definitely going back.", "author": "Alex M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-06", "description": "Updated: After receiving a message from one of the   proactive owners at Mia's, I feel more optimist about returning and making a purchase for our daughters birthday cake this year. (Coming soon)\nIt's important to have the dialogue to help each other service needs of patron and owners.\nGreat move on their behalf for reaching out. Much appreciated. Looking forward. \n\nPast review: Here we go again. Left a better review before but after repeatedly not having brown sugar and messy bathroom. done. No changes. Today asked for small gesture from employee, she seemed to be manager) was rude. When I pointed out how to keep a regular customer happy, she stood her ground and told me I am fortunate that she doesn't charge me for staying when I ask for a to go cup. \n\nAlso cleaning mirrors spraying chemicals near my head and small boy eating near by. Time to move on. I was hopeful. Too bad we bought our last three birthday cakes here.", "author": "Mark D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-06", "description": "The pastries are beautiful designed and delicious, however the staff isn't very attentive which was very disappointing. The coffee is amazing and the patio seating is breath taking", "author": "Tasha C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-20", "description": "I love this place, from the aesthetic of the store to the pastries, its amazing. I got the tres leches and although it was really small it was extremely filling, it was easily the best tres leches I have ever had before. The service was good and the store was very clean", "author": "Rana M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-11", "description": "The creme brulee cupcake was just as good as last time, though I wish the top was crispier. Please note: you have to ask them too warm it up, as they I'll not automatically do so. Got two chocolate covered strawberries in addition, which were OK, but not worth the ridiculous price.", "author": "Celia N."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-09-05", "description": "This review is just for the rainbow cookies. They had a weird taste and were just not good at all. Those rainbow cookies deserve one star. But I'm gonna think positively and just assume that it was just a bad batch.\n\nI will probably return and try their other desserts, since there is such a large selection. But until then this place is remaining in the purgatory of 3 stars.", "author": "Marina F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-08", "description": "Bomb.com, this is a really good bakery in a nook in the middle of Brooklyn. We stumbled upon this gem and was not disappointed. The chocolate layer cake was delicious and sooooooooooooooo good. Great bakery!!!!!", "author": "Anthony A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-31", "description": "Delicious Food! I loved this place. Great to come to after dinner and select from a large variety of cheesecakes, cupcakes, coffee, creme brulee, fruit tarts etc. \n\nCute ambiance, perfect for a small friend/family gathering or a casual date.", "author": "Danae K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-04", "description": "My husband and I wandered in for a sweet treat on Sunday. After studying the overwhelming cases of sweets, we still couldn't decide. The owner saw us and insisted that we enjoy a cookie on the house so we could taste the quality! Absolutely amazing!! Everything is delicious and they have a coffee bar with cold brew on tap! We will definitely be back! Updating this as we just came back tonight and their cheesecake is amazing!!", "author": "Ashley D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-01", "description": "They are right. The cupcakes were amazing. Each and every one. I also had the fruit tart to balance off the cupcakes and it was delicious. I can see why people comes here. So many varieties you don't know where to start. And they open for long periods of time. It's a must go to in Brooklyn!", "author": "Joy C."}], "servesCuisine": "Cafes", "priceRange": "Under $10", "name": "Mia’s Bakery", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "139 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/SM4ZOzR354iQi9Xvf1b68g/ls.jpg", "@type": "Restaurant", "telephone": "+13479873194"}