{"aggregateRating": {"reviewCount": 572, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-15", "description": "Went there for dessert after hanco's with my sister and mom, they loved the desserts treats and it was very delicious and yummy.", "author": "Shamah J."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-11-15", "description": "This is a industrial bakery I will never go back and I leave next door.again some of the display on the windows look like the industrial cake in the display of the Greek coffee chop down the block!!!!!! I know is a great neighborhood I leave next block to your store for 28 years . For the world industrial go ask the Greek dinner where they get theirs cake .", "author": "Marc S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-10", "description": "I had a long day at work today and to cure that, it was either alcohol or cake. Obviously I chose the latter and I couldn't be happier with my decision!\n\nI had their strawberry shortcake and my friend had the Oreo cheesecake. Both were really good! The server told me that one of their best sellers is the shortcake and I'm not surprised why. It's very light, cream not too sweet, and strawberries not too tart. It was perfect! \n\nThey have outdoor seating at the back which is perfect for a warmer day. Next time!\n\nQuick tip: If you check in on yelp you get free coffee.", "author": "Yna B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-26", "description": "Found this hidden gym while hanging one day on Smith Street doing some shopping. If there is a cheat meal you could ever have, this is the place for it! The bakery is down to earth, very friendly staff and will assist you with selecting the best dessert. This has become the go to place for my girlfriend and I and oh, not to mention, they are open till 1am on Fridays and Saturdays. Our favorites have been the key lime pie (tart and pie), cream brulee cupcake, cheesecake and of course their iced cappuccino. Highly recommend.", "author": "Alex B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-19", "description": "Everything here is excellent and made in-house. Breakfast sandwiches are top notch. Croissant donuts off the chart. Support this local business!", "author": "Max A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-02", "description": "My cupcakes came melted which were a bummer but they were good. Not as sweet as I thought", "author": "Stephanie C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-02-11", "description": "Good cheesecake but not spectacular for the $.", "author": "Juan J."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-01-07", "description": "Ridiculous. If anyone is considering placing a delivery order please look elsewhere. It's almost 2 hours and I haven't got my food. Called the bakery and the person is blaming it on the driver. No one knows where my food is.", "author": "Jay J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-11", "description": "I LOVE MIA'S. I've lived in Astoria for years, where Greek bakeries like this abound. I moved to Brooklyn a few months before Mia's opened and mourned the loss of access to the bakeries. \n\nI've met the owner who is very friendly, asks for honest feedback and then acts on it - e.g. my request for more gluten free items as I have celiac disease.\n\nMy only negative feedback is that recently the size of items seems to be shrinking e.g. the creme brulee is getting smaller and smaller!", "author": "Craig N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-13", "description": "Awesome selection of cakes. Cheesecakes are amazing especially the Oreo and Chocolate favorites. Highly recommended!", "author": "Max W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-22", "description": "This place is absolutely fantastic... a friend and I wanted to stop late at night for something sweet, and not only did we get amazing dessert, but the service was absolutely phenomenal... the owner personally came over to chat with us and was so friendly and personable.  I highly recommend the 7 layer bar... can't wait to go back and try something else!", "author": "Lindsay M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-22", "description": "Mia's Bakery gave me the the best experience I've ever had at a Bakery thus far. A friend and I went there for desert after having dinner for a late night snack and not only was the service amazing, the Strawberry Short Cake was incredible and inexpensive, also the owner was the kindest most personable guy ever! I work near the area and never knew about Mia's and after my visit, I will definitely come back again. You have to go to this bakery. It is nice, with a great ambiance. You would love it just as much as I do now!", "author": "Wyane M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-11", "description": "Awesome service and I'm always satisfied. I always order they're cakes and everyone asks where I got it from and I tell them from the best bakery in Brooklyn Mia's bakery.", "author": "Josette W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-03-05", "description": "Poor customer skills...extremely rude!!  I ended up ordering the fruit tart bc they looked very appetizing only to b dissapointed once again:/", "author": "Blanca V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-09", "description": "Came here because I was at a dumpling spot around the neighborhood and saw it was open. Completely did not expect there to be so many varieties and it was all so great! In a group we got a slice of German chocolate cake, \"blackout\" cake (chocolate cake), Napoleon berry slice, and the BEST banana cream pie! It was amazing highly recommend and the staff was so friendly as well.", "author": "Joselyne P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-24", "description": "The service was amazing! I ordered at the front to stay and they told me to take a seat and hey would come over with my order. It's set up like a bakery but the back of the restaurant has a nice seating arrangement. There was no line on a Friday afternoon and everything was fresh! I ordered a carrot cake cheesecake and an iced coffee. They also gave me water as I waited at a table. They play Italian music in the background which is very calming  ps the cake was delicious~", "author": "Kite R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-04", "description": "Perfection! I haven't tried anything here that I didn't like. I actually hate his place due to my horrible addiction. But with hate follows so much love. I've gotten all my friends hooked on this place. And a great girls date spot as well. \n\nBlueberry pie, lobster claws, creme brûlée cupcakes, blackout cake you name it, it's perfectly made. Thanks Mia!! For f******* up my diet.  Haha all love", "author": "Ashley J."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-01-13", "description": "ordered a cake here for a co worker so on the day of pick up I went in and gave them my name told them Im picking up a cake. The woman behind the counter was so confused she didn't know what I was talking about then asked my name again , i told them what it was with specific writing she yelled ok was it seamless or uber eats, i said no i called it in yesterday. she looked at me like a deer in headlights utterly confused. After telling her again she said ohh the Good Luck cake. I think told them I wanted to order other stuff ( I was also the only person on the line as well but they seemed annoyed i wanted other stuff)They were super confused with this request. Ordered Two of the bacon , egg and cheese biscuits and coffee. The coffee set up was confusing as its on the other side and has a register too I thought you had to make a separate order so it was just confusing, Maybe it was just me it could of been. \nNow on to the flavor- The cake was really good just soooo insanely sweet, now yes i know its a cake its supposed to me im not faulting it , but i could only have 3 bites out of the cake and i could feel the sugar spike and got a stomach ache.\nThe breakfast sandwich is cheese, fluffy baked seasoned eggs and bacon on a homemade biscuit, it tasted more like a cornbread than a biscuit. Flavor the eggs were yummy and the bacon was crisp. Personally I felt the biscuit was over cooked and dry or maybe it dried when they toasted it. Note a good quality biscuit does not need to be toasted, also like i said it was more of a corn muffin biscuit texture. While yummy i just hate biting into something and it crumble into 100 pieces, overall the sandwich was great and i would get it again just ask for it not to be toasted. My co worker who got the same sandwich he loved it he wanted 5 more. The coffee was good not amazing but good no complaints.", "author": "Diana M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-16", "description": "A nice little surprise strolling down the street. I was in the mood for a coconut macaroon.. though it looked a little light in color, it was pretty moist and delicious.", "author": "Karina V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-29", "description": "I would rate this place 10 stars if I could! Their eclairs are amazing! The people were nice and they have tables outside!! Their croissant donuts are pretty good. The best bakery ever!(at least in my opinion) p.s. I am nine years old.", "author": "Annick G."}], "servesCuisine": "Cafes", "priceRange": "Under $10", "name": "Mia’s Bakery", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "139 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/SM4ZOzR354iQi9Xvf1b68g/ls.jpg", "@type": "Restaurant", "telephone": "+13479873194"}