{"aggregateRating": {"reviewCount": 572, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-27", "description": "Can we leave NYC?  Added pounds are sure to come.  No amount of walking will cover for Mia's bakery.  Not sure they make all their own stuff as I saw identical cheesecakes in multiple deli across NYC.  Nevertheless the cheesecake was good; rich and not too sweet.  My husband had the triple berry pie.  Excellent, but not better than grandma's.", "author": "Susan K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-28", "description": "The best chocolate cake from Manhattan to Brooklyn!  \n\nNot only did the cake look exactly as I visioned  - it tasted absolutely delicious!  It was the perfect combo of moist chocolate cake, with thick chocolate fudge filling and fluffy vanilla icing!  Everyone at my sons bday loved it!\n\nI recommend Mia's to anyone looking for the perfect cake!", "author": "Lori B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-08", "description": "This is the best bakery. Plus they deliver. It's a no brainer ‍\n\nMy favorite is the brooklyn blackout cake. I order it whenever I want to celebrate anything. A close second is their salted caramel cheesecake, which is super decadent. Portion sizes get you thinking you could save half for later, but the supreme deliciousness keeps you eating forkfuls until you're licking the plate.", "author": "Olivia B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-05", "description": "Oh yes, baby! Authentic multicultural bakery is in town! They pastries are amazing! I tried just about everything. My favorites are chocolate porcupine, heavenly brownie, banana cream pie (yum!), croissant donuts (yes!), various cakes. They portobello swiss croissants are very scrumptious. Everything is always fresh. At all times! This is a high end bakery so don't expect low prices. But it's totally worth it because the quality is unbeatable.", "author": "Rachel V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-10", "description": "Pretty legit bakery, with TONS of options (which is probably not so great if you're indecisive like me!)\n\nI just came by to pick up a few slices to-go; because I had such a hard time deciding, the woman at the counter told me some customer favorites. Ultimately, I got the Salted Caramel, Raspberry Chocolate, and Oreo Cheesecake. Each slice is $5.95, a bit pricey considering it's just a slice of cake, but these slices are pretty huge. If you don't have much of a sweet tooth, I'd reckon that one slice is good to share between 2 people.\n\nAll 3 slices were bomb dot com, but my favorite was the salted caramel...yummm.", "author": "Tashnuva E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-07", "description": "An excellent bakery.  The best strawberry shortcake  in nyc.   I'm in love with their strawberry shortcake.  They have the best tasting whip cream on their strawberry shortcake.   A winner.", "author": "Manual W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-26", "description": "Wow wow wow we came all the way from California and we tried four different bakery's and then came to Mia's in Brooklyn and it was hands down the best pies, cakes and gelato we have ever had here or at home!!!! I recommend anyone visiting New York or Brooklyn to come to this bakery first and never mind all the rest!!!!! FYI we ordered 17 different deserts and not one was disappointing no joke!!", "author": "Lisa M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-24", "description": "This is hands down my favorite bakery in NYC!!! Everything is incredible and it's not too sugary or to dry...it's PERFECT. The peanut butter cake, chocolate mousse, donut croissant. I would never stand in line for hours to get the cronut...come here for your mind to be blown away.", "author": "Lauren M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-29", "description": "Me and my husband love this bakery especially their fruit napoleon cake so delicious!!! We already been there few time and defiantly going to visit soon! I love the  cafe place so comfortable and yet warm! Great customer serves!  each time they make cake plate more colorful! last time when we went they draw hearts in  cake plates  isn't so cute I really appreciate it was super cute!!!", "author": "Madina M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-28", "description": "Found this place online as I was looking for a cake for a Bridal Shower,seem to have good reviews so I gave it a try. The cakes that I received was absolutely amazing however when I got there they claimed not to have receive the order that I placed online while an associate was on the phone. Instead of waiting for the cakes I originally ordered I ended up getting some from he displays. I will give this place another chance only because the cakes was beyond delicious. If you do order online I advice you to call the bakery to make sure they received the order.", "author": "Jerica B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-28", "description": "Simply amazing! Always curves my sweet tooth. Any time I am in Brooklyn or I have a guest visiting me, this is the hot spot for deserts. The owners are really nice and accommodating. I recommend the red velvet cheesecake!!", "author": "Onah N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-18", "description": "These kinds of bakeries are the worst! Absolute worst...in the BEST WAY POSSIBLE! Everything here looks absolutely amazing, if only I could physically fit more cake inside me. \n\nThe entire inside of the bakery looks and feels like Park Slope Brooklyn. Couple that with the most sexy looking pastries, it's a winner winner cake for dinner!\n\nI had the coconut cake and tres leche cupcake. Moist doesn't even describe how juicy these cakes were. Both were my favorite and I'm sure if I ordered anything else, it would all be my favorite. I know where I'm getting my next birthday cake.", "author": "John T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-28", "description": "We had salted caramel cake, delicious....., latte is super!!! Plus the place is super cute!!! they have backyard seatings with lightings, super relax and perfect ambience . Will definitely come back to try more cake ... A little gem in Downtown Brooklyn", "author": "Phuong N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-28", "description": "Oh! This place is dangerously good! We ordered through seamless because my husband was was craving dessert and it was amazing, we were almost fight over the chocolate fudge cake! \nThe brownies are out of this world! \n5+ starts all the way!", "author": "Pilar A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-04", "description": "Mía is always on point when it comes to desserts. I always get compliments when I bring Mia baked goods to friends homes.", "author": "Sara P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-30", "description": "Ive been coming here for dessert for my once a month meet-up with a very close friend. This place opens late so it's really perfect to catch up with a friend after dinner. I love the atmosphere. I always order the apple pie and a cup of decaf tea. I never felt pressure to leave. There is an outdoor seating area for the winter too. I will definitely come here again!", "author": "Tracy C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-22", "description": "My Birthday cake for the last three years . It's a pity i had to share it with Colleagues. Lol. \nI will probably  buy one for the Ex. \nTill next time, \nD \u0026 G", "author": "Lin C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-18", "description": "Delicious pastry, the cheesecakes they have is something else!!! And of course they have excellent service, they are all so positive.", "author": "Giorgi P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-15", "description": "Yummy!  Love this spot in the neighborhood, best sweets and such nice and friendly service here.  Love a cozy sweet gem like this", "author": "Polly A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-12", "description": "I went to Mia's Bakery for the first time last week and the cakes were excellent. Their vast selection is actually what attracted me in the first place. I ordered an Oreo cake online as well as a few bakery items in the store. I tried the creme brulee cupcake, tres leches cupcake, and a slice of strawberry shortcake.\n\nThe cupcakes were delicious and sweet, but not too sweet or dense. The creme brulee cupcake was soft and moist. It also has custard inside, underneath the caramelized sugar. The berries on top were a nice addition, as well. I had no idea you could ask them to warm it up, and it was still great despite being cold.\n\nThe tres leches cupcake was sweet, cinnamony, and had milk at the bottom of the tin. It was tasty and very creamy. I've never had tres leches cake before, so it left a really good impression on me. \n\nAs for the shortcake, my favorite, it was light and sweet, with fresh strawberries inside! The sponge cake was perfect. I'll probably go back for more shortcake next time I visit.\n\nFinally, the Oreo cake was so good. I expected it to be too sweet and too dense, but it was light and airy for being an Oreo cake. Inside, it's Oreo mousse layered between chocolate sponge cake. It was a hit with my group.", "author": "Amber L."}], "servesCuisine": "Cafes", "priceRange": "Under $10", "name": "Mia’s Bakery", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "139 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/SM4ZOzR354iQi9Xvf1b68g/ls.jpg", "@type": "Restaurant", "telephone": "+13479873194"}