{"aggregateRating": {"reviewCount": 572, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-15", "description": "I went here to get a large cake for an occasion-- the day of the occasion. The guy behind the counter said: when do you need it? ...now? YES was the answer. I walked out twenty minutes later with a large cake with specialized writing on it. The best part was the cake itself TASTED SO GOOD. EVERYONE commented on how amazing the cake was- texture, flavor, everything. (It was the strawberry cake.)\nAmazing service and food. Thank you so much!", "author": "Ellen C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-16", "description": "I recently visited Mia's bakery for the most fantastic Dulce de Leche and Salted Caramel!! They recently opened their doors in Times Square and it's exactly what this area needed. Very impressed with the quality of the baked goods and the delicious almond croissants. Love it!", "author": "Jennifer P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-02", "description": "Lovely bakery! I have a very sweet tooth, and I find myself visiting this place multiple times a week. The cakes are great and the prices are very reasonable. Highly recommend.", "author": "Anna L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-26", "description": "Okay, so I never thought this was possible but... Cheesecake is my absolute favorite. I've been to the two supposedly but truely best cheesecake spots in NYC (Juniors, Eileen's) and I never thought I'd find one that gave it a run for it's money. Its not too thick, not too smooth, not too sweet it's literally a masterpiece. Topped off with a perfect amount of strawberries. I'm mad at myself for not taking a pic. Go visit for a treat. We bought so much stuff but that's what I had and I want it again and again now. \n\nAlso... A Cannoki? Something like that it's Cannoli filling sandwiched between soft Chocolate Chip cookies..... Yupp. Just go.", "author": "Sergio P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-03-17", "description": "Good place. Glad it has lasted. Great for last minute things. Prefer Court Bakery Shop though. Mia's has so much which is good and bad. Things are either amazing or eh. Trial and error.  Sit down and to-go are a winner.  Coffee is very good as well.", "author": "J D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-23", "description": "Such a cute spot! Came here with my friend Camilla after visiting the Transit Museum. There is so much choice! Classic American desserts like cake, pie, and cheesecake, but also international delights like cannoli, baklava, creme Brulee and flan cake. We got blueberry pie, flan (see picture), coffee and tea. All for 16$! The best thing is that they have a beautiful backyard with trees, plants, and lights. Such a relaxing afternoon!", "author": "Elena A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-02", "description": "Excellent service !! So many treats to choose from so hard omg !! \n\nWe decided to go with the red velvet cake, blackout cake \u0026\u0026 the Oreo cake. Very rich \u0026\u0026 sweet. After one bite I took the rest to go !! \n\nWorkers were very personable \u0026\u0026 attentive !!  good job", "author": "Linda C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-27", "description": "Absolutely love their cheesecake! Probably the best in terms of texture and flavor. Great black out cake too. Can't wait to be back", "author": "Amrita A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-01-11", "description": "The cupcakes I bought were great. It kind of took a while for them to service me though. I don't mind waiting in a line but I can't stand wandering around looking for someone to help me not knowing when my turn will come.", "author": "Anthony N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-17", "description": "I ate here a few days back with a friend and it was a lovely experience. I was on my phone and walked right into the glass door. The guy behind the counter laughed saying \"that's good. The glass is clean.\" There is so many different types of pastries you can get. Cupcakes, cake slices, whole cakes, lots of different types of coffee and drinks. Think of it as a full service café. The staff is very sweet and accommodating. My waiter was nice to make small talk and even come by to check up on us to see if we're alright. \n\nThe people at the restaurant are very friendly and willing to talk to you if you sit by next to them. Prices are very reasonable. A person could eat comfortably for under $10. \n\nIt's a nice, quiet cozy place to come and unwind.", "author": "Waheda I."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-29", "description": "Excellent cakes. Friendly staff\nTried the Carrot cake, Black forest cake and strawberry cheesecake. All were excellent. The place is open late night so that's a plus. I wish I had more time in my visit to Brooklyn so I can have other cakes. They all look great. Bookmarked the place for my next visit.", "author": "Ranny H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-06", "description": "5/5 - The sweetest place in Boerum Hill\n\nI remember the first time I walked by Mia's -- it was around midnight and the place had its backlights on and the desserts by the windows were glowing. You could say my jaw dropped to the flour (see what I did there hoho). It's so dangerous that this bakery is on the way to my gym because on the weekends, somehow I always end up walking in \"just to look\" and walking out with a slice of banana cream pie?? That's my go-to, the banana cream pie.. ughh so good. Other stand outs include the pumpkin pie, chocolate cream pie, cupcakes and those small butter cookies with jam in the center dipped in chocolate with sprinkles. You can also dine in in the back but I'd rather shove pie into my face in peace so I usually take mine to go. This is a great place to grab a few things for special occasions and for not so special alone occasions. No one will judge you. \n\nHowever, I will say though that their rugelach is not my favorite. Mia's adds a lot of almond paste in their desserts which I'm not a huge fan of. I know some people love it but I don't and that almond paste is in their rugelach so skip it if you're like me. \n\nService is average - nothing bad to say and nothing that shines either!", "author": "Maria J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-29", "description": "The cupcakes at this bakery are amazing!! I ordered for a group: nutella, tres leches, and dulce de leche. All were incredible but I highly recommend the \"tres leches.\" Incredibly soft, moist and filled with cream. SO GOOD. They are $3.25 each which is not terrible I suppose (on par for NYC).  They are all filled in the middle and they are not too sweet. I will definitely go back.\n\nThey also have great vegan and gluten free options. I ordered a vegan chocolate pastry and it was to die for. So soft and moist. It was a *tad* too sweet though.", "author": "Akhila K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-25", "description": "A bakery that knows it's surroundings - open till 1am on a Saturday night. Big interior with helpful staff and an array of baked goods lining up the brightly lit counter.\n\nCouldn't help myself; ordered the Peanut Butter Mousse cake ($6), Oatmeal Cookie ($3), and a Hot Chocolate ($4). Mousse cake is wonderfully creamy, with just the right amount of peanut butter and chocolate flavors. Oatmeal cookie is soft and large, pairing well with the hot chocolate. A bit of overkill with the drink, though I left satisfied.\n\nA solid choice to wind down after a night of drinking. Can easily spend a lot if you're not careful.", "author": "Shaji K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-22", "description": "I got the carrot cake from Mia's bakery a few weeks ago! It was so delicious; I have had carrot cakes before but none as good as the one at this bakery. \n\nIt was not as expensive as I expected, a big carrot cake (which took a whole family several days to eat) went for around $20. \n\nWould go back again and again.", "author": "Eugene F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-19", "description": "This place has been on my radar for a while. I finally got a chance to visit while in the area and let me tell you, the desserts did not disappoint at first glance. I decided to begin small and get the tres leche and Nutella cupcakes. The tres leches cupcake was divine! It didn't take me more than one bite to fall in cupcake heaven. On to the next one... chocolate joy!!! If you love chocolate, then you'll love this Nutella treat.", "author": "Natasha L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-27", "description": "Where do I begin? My sons birthday party was coming up in 3 days. I have no cake and I'm yelping and yelping for a great bakery with ok pricing good taste and most importantly, great customer service. I called this place to order my cake not knowing what it would look like and not knowing for sure if it was good. Long story short, the cake was amazing!!!!!!!!! The service was IMPECCABLE and I was more than satisfied. The cake was beautiful the girls who took my orders (because I bought him 2 cakes) were super sweet and super patient with me. I recommend this bakery 100% i will absolutely buy future cakes from here. Thank you Nicole and, I want to say her name was heather, for being super sweet. Customer service is insanely important to me. Absolutely recommend them, no negatives about it.", "author": "Mely T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-12-22", "description": "A very cute place. We are staying in a hotel near by and it was a great stop to just chill and get some dessert. Would recommend.", "author": "Madison M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-10", "description": "Really cute establishment, and SUPER friendly staff members. As soon as you walk in, someone does ask if you need help, whether behind the display counter of treats or at their coffee nook. Everything looked so good that even my husband couldn't resist treats-- and I'm the dessert lover of the two of us! There were tarts, pies, cupcakes, Italian cookies, breads, croissants, layer cakes....too many to count! They also had gluten free treats. \n\nLemon meringue tart  -- had a hearty crust that held up well to the filling. And meringue topping is always fun to eat! \n\nLemon Bar - my husband liked it but thought the bar had a slightly mushy consistency and texture compared to the tart. \n\nVanilla/Choc cupcake - Lightly and fluffy cake, with subtle frosting. Felt like a whipped cream/butter cream blend, because it wasn't overly sweet or rich. Perfect. \n\nChoc/Choc cupcake - their cupcakes are not uniform in size. This was significantly smaller than the other one I got, but equally good in texture and frosting. \n\nClean space, narrow in size. Longer than it is wide. Towards the back, there is a seating area, so you can linger with your treats and a beverage. Decor was modern and elegant, and cafe like. If we had more time, I would have liked to sit there. It was a holiday weekend and therefore seemed quiet and pleasant.", "author": "Tiff C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-08", "description": "Found this place by walking down the street and just stopping in, and I'm super glad I did. First, the environment is very cozy and comfortable. I sat down to do some reading and it was incredibly cute and lively. They also have a comfortable outdoor seating area as well.\n\nI ordered some tea and an oreo cupcake. It was yummy and somewhat reasonably priced, and they have a huge selection of desserts to choose from as well. \n\nThis is a great place to waste a Sunday afternoon by yourself or meet friends!", "author": "Vaannila A."}], "servesCuisine": "Cafes", "priceRange": "Under $10", "name": "Mia’s Bakery", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "139 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/SM4ZOzR354iQi9Xvf1b68g/ls.jpg", "@type": "Restaurant", "telephone": "+13479873194"}