{"aggregateRating": {"reviewCount": 572, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-20", "description": "This place is bustling and bursting with a sweet treat for everyone.\n\nFulfill your cravings here for things such as:\n- cupcakes $3.25\n- cookies $3\n- cheesecake slices $6.45\n- macarons $2.75\n- muffins, croissants, etc!\n\nThere's a fair amount of seating inside, and also a backyard too!", "author": "Connie H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-04-01", "description": "One cake -- 5 superheroes.  I would have bought this cake but I didn't have 20 people to help me eat it at the time.", "author": "Corey B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-04", "description": "I've passed by this bakery countless times while roaming Smith street for a spot to grab lunch.  With very little coercion from my colleague, we headed here for an afternoon treat.  I was surprised at how spacious it is once inside and they have a roomy garden area.  The vast selection of cakes and baked goods is amazing...and they have a small section near the entrance as a coffee bar.  \n\nSince we had some time to kill, we decided to take a seat and glanced through the menu, which was a bit overwhelming to look through.  I finally decided upon a banana nut bread pudding, it was warm with a whooping of whip cream (i personally don't like whip cream) my colleague enjoyed that on top of her slice of peanut butter chocolate cake, which by the way was very good.\n\nThe space is clean and the baked goods taste fresh, which surprised me with the huge selection available.  \n\nI will visit soon to try out other items  I scoped out before deciding on my choice.", "author": "Esmeralda C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-11-03", "description": "Received a text from my brother asking if I'd like something from Mia's. Pro tip: never say no to cake and never turn down free stuff. So of course I asked for a slice of strawberry shortcake. And what do you know? He threw in three slices of cheesecakes too! My dog, Cheesecake, was just as excited as me. I was not a fan of the strawberry cheesecake as the strawberry sauce tasted like medicine. The other cheesecakes were decent! The texture was perfect: soft and melts in your mouth. The strawberry shortcake was great - however I've never came across a bad strawberry shortcake before", "author": "Melody C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-07", "description": "Really great way to extend the night.  Head over to Mia's Bakery for some delicious baked goods and a fun beverage bar.  The seating is great - spacious and there's an adorable outdoor patio.  Very comfortable and clean with friendly service.  \n\nWe shared the peach tart and the lemon blueberry cake.  Both delicious and reasonably priced.  LOVED my iced chai tea.", "author": "Renee L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-04-07", "description": "Pretty decent bakery! The cupcakes were quite fantastic. The coffee could have been a smidge better. Will be returning for the sweets. It can get crowded though so come at off peak hours to avoid the rush. \n\nWill probably try the blueberry cheesecake next!", "author": "Darren K."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-05-11", "description": "Unfortunately, this was probably one of the worst key lime pies I have ever had. It was probably my mistake to try it here. The flavor was so artificial and beyond sweet. It tasted as if it was made with icing. I could not bare more than two bites. The graham cracker crust was not too bad but thin and also way too much of what tasted like a syrup but was butter was used in it. The other two people I was with enjoyed theirs however (cherry pie and chocolate cake).", "author": "K H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-12-13", "description": "Went into the Times Square location yesterday after walking around Times Square trying to locate it. It's quite small (maybe 4 or 5 people could fit comfortably at a time). They have some desserts displayed in the window and some at the small counter and in baskets against the wall. I expected the place to be larger and with seating. The item that I was planning on trying (croissant donut) was sold out already which I was surprised by since it was still so early. I ended up settling for the tres leches cupcake and a hot chocolate. The cupcake was good and very milky and the hot chocolate had great flavour. It just wasn't what I would consider as hot. More like warm, going on room temp. \n\nI would give the Times Square location a 3 and a half star but I also feel like I should pop by the Brooklyn location one of these days maybe for an original experience and for better selection and inventory. They seem to have a lot of delicious items.", "author": "Melissa H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-09", "description": "Okay so if you read nothing else in this review just read this: go here!! That's right this was a great bakery! You can get your desserts to go or you can order at a table. I'm picky about my water but even their tap water was good- served in a mason jar which was cute (all their beverages are served in jars). We got the oreo cheesecake which was dense and smooth but not overly heavy. The crust is oreo which was fine but the filling which also included oreo was perfectly cooked! Also they were out of a few things we wanted (we did not arrive until around 10pm so understandable) but slightly disappointing but for the menu size you will find something else you want! We also purchased the creme brulee cupcake which was very tasty but did not taste like creme brulee to me... It did have a creme brulee look and the fruit was carmalized (it does not have icing just as a heads up) but I did truly love the texture and taste so I got over my disappointment of it not being more creme brulee like lol. Wide variety here of desserts good for any. It is a bit noisey if you sit in the dining area but it was fine- a good vibe. Definitely worth trying if you have a sweet tooth! Next time I would like to try the coffee!", "author": "Jennifer T."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-04-29", "description": "I was not pleased with this place. I entered this place the only smile and greeting i got was from the host and when I was inside everyone had a R.B.F on them; yea I get if one person has it then they having a off day that is normal, but the whole staff come on now. The service was horrible and mind you it was not packed when I came here; furthermore during my time at this place my waitress didn't bother to come by my table to ask if everything was fine and if I needed anything else.  The 2 star I'm giving this place is for the atmosphere being calm and the backyard patio.", "author": "Nick .."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-18", "description": "I love sweets, especially chocolate but I am not a big fan of cupcakes.... Until I stumbled onto Mia's..... wow, just wow.\n\nCupcakes are just cake and icing, right. Two basic parts. One slapped on top of the other.  And most of the time people like one or the other. I usually scrape the icing off because of it's artificial, overly sweet, sometimes medicinal taste. \n\nNOT MIA'S!!! \n\nNow I'm sure I gained 5 lbs per cupcake but I've had... Black forest, Creme Brulee, Salted Caramel, Strawberry Banana, Oreo, Cookie Dough, Nutella, Dulce de Leche and they were ALL delicious. I also had the Tres Leches and OMG it's insane. I would drink the leches from the container if I wasn't in public!\n\nThese cupcakes are perfect, little, mini cakes. Like a slice of a whole cake where the cake and icing belong together/cohesive. Each part, individually, is wonderful but there is a surprise... there is a filling! For each one! And the filling isn't a glob of icing, it's a real filling. Like the Black Forest had a jelly like, creamy filling with a cherry. \n\nSo the cakes are moist, spongy, fresh and taste just like the description. The icing is unique for each cake deliberately matching the specific cake. (Sometimes cream cheese, marshmallow, chocolate etc). And the there is a unique filling. Genius. \n\nAnd..... they sell all kinds of deserts, coffee and a few savory pastries (like the chicken pie - scrumptious).\n\nJust Go To Mia's. You will not regret it.", "author": "Kiki K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-23", "description": "This is a tentative 3 star rating because I only liked one of the three things I tried . Mia's excels in presentation . Every single item looks like a photoshopped picture out of a magazine or cookbook . Reality wise though when you get to the nitty gritty , in my opinion ,their cakes are way sweet . The swirl cheesecake was barely edible after a couple bites .My least favorite was the strawberry banana cupcake . Cake it self had no moisture and the icing on the top you can guess was way too sweet . I would say it was very ambitious in terms of what they were trying to accomplish in terms of its complexities. The chocolate cake was good I'd admit probably tamed somewhat by the lack of sweetness of dark chocolate. It's still in my refrigerator slowly being eaten to avoid a potensugar shock .  \n\nThe service here was very good and this bakery is rather big with ample seating so I'd recommend it if you're in the area and have an extra sweet ,tooth . My tooth is just regular sweet so I'll go elsewhere for my cakes and pastries .", "author": "Kern C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-06", "description": "Man I want to HATE this place but unfortunately cannot and I blame the orange cake...and the salted caramel cake....and chocolate cake....and rainbow cookies.....and on and on and on.....This place is soooooo damn good and I'm happy I'm not working there or they would go out of business. Just think of me sampling everything in the bakery. If you haven't discovered this place I insist you do , you cannot go wrong with anything. If your lucky sit down, relax and grab a table. Btw for your next birthday consider ordering a cake, promise your people are going to love it, everyone that I introduced the flavors of Mia fell instantly in love. Until the next time Mia!!!", "author": "N And N K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-06", "description": "I am a big fan of bakeries!! I was just passing by and could not hold me back from coming and having a look at what they have. The choice is quite big and everything look delicious. Definitely will come back and try it!", "author": "Anna K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-02-11", "description": "This is my favorite dessert place in Brooklyn. Their desserts are amazing. They have plenty of Gluten friendly options as well. A lot more than I've ever seen in a bakery. You have so many options, you can come in and eat there(they have a backyard I believe) or you can order to go. They serve yummy coffee and cappuccinos. My favorite dessert here is the flourless almond half chocolate cookies. So yummy I can never get enough of them. They are the BEST EVER!! They have different cakes and cookies. You cant go wrong ordering here. The staff is very helpful and friendly and are always willing to help with any questions or suggestions.  After having dinner on Smith street from the many options of restaurants here, make sure you save some room and pass by Mia's Bakery. It's definitely worth it.", "author": "Veronica R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-27", "description": "This place is amazing. I've been here maybe 6 times in the last month and I can't get enough. The hot chocolate is yummy, better that your average hot chocolate. The strawberry shortcake is delightful, light and airy yet flavorful. The rainbow cookies are the best here. The tiramisu cake is also extremely satisfying. The coffee is also incredible, especially the caramel latte. Basically I haven't had something I didn't like yet. Will keep you updated. Strongly recommend, especially for a date, it's really cute!", "author": "Julie M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-08", "description": "Went on my lunch break last night and I have to say worth the money and the trip!!!!!!! I ordered 4 cupcakes(tres leche, salted caramel, Oreo, and cookie dough). I got back to work and enjoyed the tees leche and I also sampled the Oreo overall both were good. The staff was good and I look forward to returning to make future purchases", "author": "Fly K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-11-21", "description": "I've been here twice and wasn't too excited over the goods I got. I got the Napoleon, which wasn't flakey at all. Recently, I got the Black Forest cupcake and the whipped cream frosting was good but the cherry filling did not have that juicy, cherry goodness flavor to it, and the cupcake was a little dry. I've heard their Oreo cheesecake is good so perhaps I will give that a try next time", "author": "Spurthi A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-02-25", "description": "Their cronuts are to die for! The strawberry one is my personal favorite but you really can't go wrong w any of their cronuts!", "author": "Jane N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-03", "description": "I came here to meet a close girlfriend for brunch but unfortunately they ran out of eggs to complete. :-( but no biggie. We just decided to get sweets and coffee. OMG. When I tell you, do not attempt to come here if you're on a diet! You will cheat lol .It was so amazing. For drinks I ordered the White Caffe Mocha which was delicious and I ordered a toasted coconut cake slice while my friend ordered the salted caramel. Yum! I use to be a big fan of salted caramel until I had a bad experience with too much salt. I gave my friend's cake slice a try and it was just right. I would definitely come back and I would come back earlier to try eggs lol", "author": "Alana D."}], "servesCuisine": "Cafes", "priceRange": "Under $10", "name": "Mia’s Bakery", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "139 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/SM4ZOzR354iQi9Xvf1b68g/ls.jpg", "@type": "Restaurant", "telephone": "+13479873194"}