{"aggregateRating": {"reviewCount": 572, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-01-04", "description": "The mediocre $5 banana chocolate bread pudding became $5.25 a second later. Pretty underwhelming selection and not a product that'll bring me back despite glowing reviews.", "author": "George C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-20", "description": "The desserts here are wonderful, the service is warm and friendly, and the space is well-kept. Great to have a classic dessert place (and apparently a good cafe as well) close by. \n\nThe hours are also a huge plus - open for those late night pie and cheesecake cravings!\n\nPrices are also more than fair.\n\nIn short, not sure there's anything negative to say, all positives - hence the 5 stars.", "author": "Joe S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-14", "description": "Really wonderful service. I popped in to get a cake for a xmas party my friend was throwing around the corner. Amazing selection. Unfortunately they had ran of the strawberry shortbread cake which I'd heard is so delicious got the triple chocolate instead and was so happy with my choice. It was moist, rich but not too heavy. Everyone loved it at the party too. The sales girls favorite cake is vanilla maybe I'll get that one next", "author": "pamela b."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-30", "description": "Totally addictive!  The cakes are soft \u0026 moist, without being too sugary.  Everyone is very nice \u0026 the cappuccino's are very good too!", "author": "Kay E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-08", "description": "Love their cakes especially the strawberry cheesecake and strawberry shortcake. Their cake pops aren't great though.", "author": "Jenn B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-27", "description": "I ran across this shop in smith St on a weekend. Their croissants are great, tasty and huge! Yesterday i was thinking to bring a cake to a friend's thanksgiving dinner. And Mia came to mine mind. I got a 7' 7 layers cake, I simply picked this one by its gorgeous look. It didn't fail us by its soft, sweet but not too heavy flavor. The mousse is fine and smooth, the chocolate outer layer is perfect. Will definitely come here more often and recommend it to more friends!", "author": "Yingwen L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-08", "description": "This is literally the best cheesecake I have ever had. I have been on the hunt for good cheesecake in NYC and I have tried most of the places that are supposed to be \"the best\" but have always been a bit let down. Not here. Creamy, rich, hint of vanilla, hint of sweetness, a tiny bit of tartness, the graham cracker crust is magnificent. Seriously, go get this cheesecake. I have gotten other things too here and they are all good. I can't wait to try more cupcakes and breakfast pastries and coffee. This place is amazing. Been waiting for something like this to open in the neighborhood! Wish one would open in Park Slope too!", "author": "Joanna V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-14", "description": "Ordered Mia's Bakery through Uber eats. Easy to order and a quick delivery. We got the Oreo cheesecake and coconut cake. Both equally delicious. The coconut cake was super soft and melted right in your mouth. Oreo cheesecake was great with Oreo pieces inside big enough to feel that crunch. Wish we had remembered to take pictures before devouring both.", "author": "Hanisha P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-09-27", "description": "so far i've only tried the little tea cookies (sold by the pound) and the vegan spinach/kale pastry (savoury). the cookies were pretty standard (nothing special to write home about) but the savoury pastry was quite delicious. it's more substantial than a typical spanakopita, but not super oily or greasy. i also love that it's vegan!\n\nthey've got a huge variety of tempting pastries and cakes as well which i'll have to swing by again to try, as well as a full service coffee bar. overall, a nice addition to the area and it's especially nice that it's open late!", "author": "Vicki L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-28", "description": "Agapios, Claudia, Nicole and Melissa are the best staff. You're made to feel warm and welcome. Service is always quick, with great attention to detail.  You know you've found a home when after not seeing a \"customer\" for two weeks, that \"you\" walk into  an establishment and you're told that you've been missed and it feels genuine. Stop by, the atmosphere is light, the coffee, lattes, and hot chocolate is great. The pastries are to DIE for.", "author": "Yvette J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-02", "description": "AHHH-MAZING place. Service was bomb. Will be returning when i can. For what it's worth, the place is fairy cheap. There is a beautiful out door seating arrangement towards the back which is perfect for warmer weather. Great place for a date or for some serious alone time with a book.", "author": "Jane N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-21", "description": "Im OBSESSED with this bakery. I have bought birthday cakes here...cup cakes...cookies pie omg THE BANANA PUDDING IS JUST AMAZING. I bought one and shared it with a friend who is now going out of her way to buy from this bakery lol. The staff is incredibly friendly and as sweet as the products they sell. I deff recommend you pay a visit here. Keep in mind it can be a bit pricey ($3 for a single cookie) but it is sooooo worth the price.", "author": "Jason V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-01", "description": "I have gone to Mias a few times to pick up some cake/cupcakes.  Food has always been delicious.  Favorites so far are the carrot cake and strawberry shortcake.  Just sat down inside for the first time and service was also great.  Had coffee and a slice of cheesecake with friends. Friends got muffins which they said were giant and delicious.  Plan to go here more often.", "author": "Kat K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-01-10", "description": "A little overate in my opinion. I was on the mission searching for the best tiramisu there is in the city.  So stop by here at night.  Super easy to find a parking in the area which is a huge plus.  I bought a hot latte, tres leches, and ofcourse the tiramisu to go.  Tres Leches was alright.  Latte was spot on, might actually go there for the latte again.  The tiramisu, where do i start.  In short, it was bad.  That was my main reason there and it turned out to be the biggest disappointment of the night.  I'm not a fans of having lady fingers on tiramisu.  Usually its the first sign of showing they're arent good at making it.   The tiramisu wasn't fresh at all, I'm not sure how long they been sitting there and it was unnecessarily sweet.  Overall, it was an okay experience.", "author": "Feng C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-29", "description": "At the time of writing this review it is a three month old bakery in the neighborhood. They have a diverse selection of cakes and other pastries. Presentation is also very intricate, all of the deserts look delicious! I tried a piece of salted caramel cake. You could taste how fresh and fluffy it was. I also ordered a coffee cake and a coffee. Coffee cake was huge! It was very tasty and fresh as well. The coffee was pretty good too. The only downside, they mix the milk and sugar for the coffee for you which I didn't quite like. I like to add the milk to my coffee myself as I know how diluted I'd like it to be. \n\nThey also have lots of tables and chairs inside and a good size patio outside. I would definitely come back again and also thinking about ordering a birthday cake from here. They can make any cake from their selection at a reasonable price, 7 inch cake for $29. The best part is that if you aren't sure which cake you want, you could just buy a few slices to try and order the entire cake for the one you like.", "author": "Nara A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-23", "description": "I love this place! My sister and I are in here at least three times a month and we can't wait for our friends birthdays, we always purchase a birthday cake from here. Whichever flavor you're craving, Mias Bakery never disappoints!! My favorite is the salted caramel, this is always my Go-To slice if I can't decide !", "author": "Julie W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-02", "description": "We bought a 10\" red velvet cheesecake for a birthday. Not only was the cake very pretty, it was delicious. The owner and the sales people were so helpful, we actually ended up buying 6 more cupcakes. I noticed there was a backyard, which I would definitely like to sit and relax in next time we go back.", "author": "Cee S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-13", "description": "Ok so I'm a sucker for sweets and baked goods and my enthusiasm for this new cafe might be exaggerated but my three visits to this cafe so far have been fantastic. There's a huge variety of sweets, amazing service that endulges my 3 year old in every way, and a really nice outdoor space in the back. Most importantly it's one of the few establishments on Smith st that opens really early (6am!) and I can finally have a coffee destination as I stroll aimlessly down the streets with my kids (who don't let me sleep) at the crack of dawn.", "author": "Lana V."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-03-14", "description": "Let me start by saying Mia's bakery is delicious. But I also have had better from what I tasted from them. Cherry cheesecake, apple pie, chocolate chocolate cake pop and some cookies from behind the register forgot the name of it. The staff was nice and the service was fast but this bakery is overrated. Everything was just okay I was expecting to taste the worlds best desserts ever!", "author": "Darlene H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-24", "description": "Apple pie was great fresh fruits and no too sweet just perfect,you can tell is fresh. Keep it up.", "author": "Jeancarlo G."}], "servesCuisine": "Cafes", "priceRange": "Under $10", "name": "Mia’s Bakery", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "139 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/SM4ZOzR354iQi9Xvf1b68g/ls.jpg", "@type": "Restaurant", "telephone": "+13479873194"}