{"aggregateRating": {"reviewCount": 572, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-07", "description": "Mia's desserts are phenomenal. I ordered a custom birthday cake from Mia's and was very pleased! Their coffee and tea drinks are also amazing!", "author": "Rachel S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-09", "description": "This bakery was great! Service was fantastic, clean, and all the cakes delicious. As a tourist stopping in, I really appreciated their kindness and friendly pace. I even took several slices ho'e.", "author": "Holly M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-20", "description": "Lovely spot for desserts to go or to stay. The Vanilla cake is delicious! The apple pie has the perfect crust \u0026 pairs well with ice cream. The flan was also a HUGE piece. All super affordable as well. There is an outside area in the back as well to enjoy treats outside. It is right off the F/G train on Bergen street which smells like trouble for me because I seriously cannot resist stopping by when it is so close to everything in Downtown Brooklyn. The waitresses are also super friendly which is always a plus. Can't wait to see what the holiday season brings around!! :D", "author": "Kiara N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-23", "description": "Great place! Really satisfied with the service and the cakes, they were great (chocolate cheesecake and napoleon cake are on the photo). There is small seating area with approximately 10 tables for 2 or 4 people. Apple cider is the must, really liked it.", "author": "Nelli P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-11", "description": "Excellent bakery and so many options definitely try the cronuts...to die for!!!! I have not tried their cakes but the bread pudding and cupcakes was excellent, i still have to try their babka and cookies. Will definitely be back for more.", "author": "Kelly M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-25", "description": "I love this place! One of my favorite bakeries so far \n\nCupcakes all day!  \n- Red velvet\n- Chocolate\n- Nutella \n- Cannoli\n- Vanilla\n\nLove them all.  Moist cake and flavorful filling\n\nSlices of cake for more!\nLove the red velvet and red velvet cheesecake\n\nBack of store has a seated restaurant where you can sit and enjoy the deliciousness and coffee.  They also have the cutest outside seating area.", "author": "Kimberly W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-25", "description": "I was in the neighborhood and found this place on yelp. It is very similar to Marthas bakery ambiance. \n\nMy friend and I shared a slice of tiramisu. It was one of the freshest and perfect slice of tiramisu! Perfect balance of sweet and moist with a burst of coffee! Why have I been away from this place for so long!!\n\nI will definitely go back to try their other goodies. Their service is great too! I bet they are packed in the summer.", "author": "Metro G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-03", "description": "The best strawberry shortcake, hands down!", "author": "Ann L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-22", "description": "Was walking around and looking for a spot for dessert with my teenage daughter and stumbled upon this amazing place. There is a huge display of cakes, pies, macaroons, cupcakes, cookies, you name it. My daughter is sixteen years old and pretty much sticks to the basic vanilla cupcake but decided to take a leap and tried the rose lychee macaroons. She loved it! The macaroons were well made, very fluffy and a nice size. She also had a white hot chocolate which she raved about. I had the coconut cake and the cake was moist with custard layers. I am in love with this place and will be back soon. Everyone was very helpful and pleasant. There is indoor seating if you want to sit and indulge. They also deliver. Check it out if you are in the downtown Brooklyn area.", "author": "Melissa R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-25", "description": "Mia's Bakery is a super cute and cozy spot. It reminded me a bit of Martha's Country Bakery. They have a huge selection of desserts and drinks and food I believe as well. We didn't look at the food menu, since my friends and I had just eaten some delicious Ethiopian food at Awash a few blocks away. It was the perfect was to end our Galentines day weekend. \n\nMy friend and I decided to share the banana cream pie and the chocolate cream pie. We also got the matcha iced latter and the cafe au lait. I have to say that the banana cream pie definitely stole my heart! It was just so airy and light and delicious. I would definitely go back for more of that pie! Our lattes were also very good. \n\nThe reason I'm giving this a 4 star review instead of 5 is cause of our service. Service definitely wasn't the best. Our server seemed like she was in a bad mood or something. \n\nOverall, we had a good time, and I will definitely come back to try some of their other desserts.", "author": "Tahini R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-11", "description": "Cobble Hill is an area of Brooklyn I rarely go to, though I find it to be charming whenever I do visit. After a stop at Mia's Bakery, I might be swinging down there more! \n\nThis bakery has virtually everything your sugar-loving heart could desire: cakes, pies, French maracons, cannoils, croissant donuts, cupcakes, cake pops, hot drinks, cold drinks...*phew* I think I covered all of their bases! Not only are cakes and pies sold in individual slices, but they also sell whole pies and cakes...that COULD be dangerous for someone like me, a woman that has unabashedly finished an entire apple pie to herself on MORE than one occasion. Ha! \n\nOf note, I find the bets treats in there - if you're having a hard time deciding - are Salted Caramel Cake, the Burnt Almond Cake, the Red Velvet Cupcake, the Strawberry Banana Cupcake, the Orange Pie (which is more cake-like), and their croissant donuts. Also, the beau's mother works at a veterinary clinic around the corner, and she has occasionally brought home cheesecake from Mia's, which is also quite delectable. \n\nIt's always good to know where a neighborhood's best bakeries are, and Mia's firmly cements its place at one of Cobble Hill's best.", "author": "Allison C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-13", "description": "This bakery has RUINED my attempts at dieting. The gelato is delicious, but uh don't eat the chocolate fudge cake... because, uh, you probably wouldn't like it. Also, there will be less chocolate fudge cake for me. The hubs loves the Brooklyn Blackout cake. The croissants are worth taking home and heating up for breakfast the next day. \n\nThe delivery is excellent--quick and reliable. The eat-in service is also excellent, and the backyard is just charming. I would basically live here if I could, but sadly, I cannot. I'm totally going to get a unicorn cake for my next birthday. I don't even care that I'm thirty-mumble. And you know what? It's gonna be CHOCOLATE FUDGE CAKE.", "author": "Laura T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-22", "description": "This is a cute little bakery with nice outdoor patio seating in the back!! If you checkin, you can unlock the cupcakes offer of buy 6 get 2 free. The 8 cupcakes that I selected are: creme brulee, oreo, tres leches, red velvet, black forest, strawberry banana, salted caramel and cookie dough. The winner is definitely strawberry banana!!! Such unique flavor. The cupcakes were overall soft, moist and rich in flavors.", "author": "Jessie B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-03-02", "description": "NIce place for informal meetings. \n\nI attended a few poetry workshops here​ \nand the staff was courteous and kind every visit.  \n\nNever more than 5 people \n\u0026 we all ordered drinks and desserts. \n\nAll good.", "author": "Meagan W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-18", "description": "Got a fruit tart last night and I was not disappointed! It had the perfect amount of sweetness all around from the custard filling to the fruits. This sweet delight was placed on top of this delectable crust. The crust had a hint of lemon flavor and enhanced the tart overall. I will be back for more!", "author": "Kim D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-13", "description": "I love love this bakery!!! Their pies are delicious I bought the cherry pie and the pecan pie over the holidays and everyone loved it . I normally get their banana cream pie  Definitely recommend this place if you're in the neighborhood and they also deliver !!", "author": "Correna P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-13", "description": "This is a wonderful bakery. So many treats to choose from. Comfortable, cozy and nice sitting area. I wanted to try so many things but it is impossible to choose.  I settled on creme brûlée cupcake and a canookie. I was not disappointed. Delicious. Full of flavor. Decadent. Fresh. My husband had the berry Napoleon and he was impressed. He felt it beat out Martha's version hands down. We will be going back and my sweet tooth says often.", "author": "Sarah H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-17", "description": "my god this place is amazing.\nThe interior is beautiful, they have a wonderful outdoor patio type of place (which I think would make a great place for a party/gathering if they allow). \nBesides the aesthetics, their baked items are all amazing. I haven't tried all but after having 2 of their treats, I think I can safely say that everything else will be just as good.\n\nMy bf had their Coconut cake and I had their Tres Leches Cupcake.\nThe Coconut cake was delicious, scrumptious, yummy, flavorful, moist, all the great adjectives you can put on a perfect cake. It was moist and the coconut strips on the frosting was perfect, not overly sweet. \nTheir tres leches cupcake tasted just like a tres leeches cake. All of their cupcakes have a filling in it. The tres leches was oozing with the \"filling\" of the moist combination of milk.\n\nWe also ordered some coffee drinks. I had the greek frappe. Honestly speaking, their drinks didn't stand out so much.", "author": "Gloria K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-16", "description": "The first time I had Mia's Bakery cakes was when I was injured and couldn't walk. I was craving sweets and I saw good reviews for this place so I ordered online. I think I ordered 4 cakes and 2 cupcakes and they made me feel so good. I couldn't decide which cake I liked the best because they all tasted good. I was so depressed when I was injured and these cakes made my day. Flashback to the present, I took my parents who were visiting to this place. We wanted to be seated at their backyard which is small and cozy and perfect when the weather is nice. It is also a great place to have a birthday party. We ordered the fruit Napoleon cake slice, chocolate blackout cake, cappuccino, pistachio gelato and the chocolate almond croissant. Again, everything was D-E-L-I-C-I-O-U-S. I couldn't decide which ones I liked the most because they were all so good. My folks loved it too, they ate it all didn't even leave crumbs. Also, I find it really rare to find good pistachio gelato because they all taste artificial but this one tasted like actual pistachios. I have a friend who keeps looking for the perfect pistachio ice cream and I'm definitely bringing her here. I plan to come here more often and get all birthday cakes and if any of my friends are reading this, please make sure to get my birthday cake from here.", "author": "Aishwarya S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-01", "description": "Cozy back patio with amber lighting, fine lounge music. Only trouble is... choosing a single dessert for yourself when there are plenty to try! If you bring the whole family you can try a bit of it all.", "author": "Miv S."}], "servesCuisine": "Cafes", "priceRange": "Under $10", "name": "Mia’s Bakery", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "139 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/SM4ZOzR354iQi9Xvf1b68g/ls.jpg", "@type": "Restaurant", "telephone": "+13479873194"}