{"aggregateRating": {"reviewCount": 572, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-16", "description": "B+. Great ambiance in the backyard garden. Love that desert can be an experience. Nice Service. Had the Coconut Cake and Peach Iced Tea. Cake pretty good. Iced refreshing, not a balanced sweet but sweet enough to pass. My Aunt had the red velvet cheese cake and loved it. No fault of Mia's I guess I'm on the hunt for cake that tastes home made with depth and flavor to the cake, but either way would definitely go back, It's worth the visit.", "author": "Medina C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-25", "description": "Dessert heaven! Oreo cookie cake, cupcakes, coffee and tea.  Beautiful spacious space to enjoy hot beverages and work on your laptop.  I really enjoyed the Oreo cupcakes and German chocolate cake.  Cannot wait to return in the spring for the outside space.", "author": "Cherrelle D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-13", "description": "Went here to end our birthday festivities on the town.  Service was slow--only one waitress. Food was terrific. Pecan Pié was rich with nuts. Lemon merengue tart was sweet and tart.  Cheesecake was thick and creamy.  Our birthday boy's plate was decorated and came with a lit candle. \n\nHighly recommended.", "author": "Philip J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-07", "description": "I've been coming here since it opened and everything is delicious. I come in specifically for the Greek Walnut Cookies which i've been addicted to from day one when someone there offered me one to try. The sad part is- they're not always there. You just have to hope you're lucky that day. The rainbow cookies are also really fantastic there. Nice almond flavor and consistency. (but they're a little pricey) The cakes are always on point, and we've bought them many times for people's birthdays etc. All in all, our go to bakery in the area. -1 star for the line. It's completely unorganized and when it's crowded no one knows who's being helped. Plus, you can't really see over the counter either to see the people working there (and i'm 6 feet tall) They should implement a ticket system for the line.", "author": "Ray C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-22", "description": "Love this bakery on Smith st. I can see why it is so highly rated. The counter will draw you in with a beautiful, decedant display of pies, cakes, cookies, petite fours, and pastries...yumm\n\nEverything is good. I've tired cupcakes and an apple pie and have taken canolis to go and haven't been disappointed with anything. I gobbled everything up with a cup of coffee and satisfied my sugar craving!", "author": "Maria A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-16", "description": "I love this bakery. The hours are GREAT! They're open until 1am. Every single thing I've tried from here has been absolutely delicious. I love the Black Forrest cake and the creme brulee cupcake. The coffee is okay, there is enough seating indoors, outside seating available as well. Only took off one star because the customer service is consistently lacking (slow, inattentive).", "author": "Sara S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-01-08", "description": "On Jan 3, I purchased a cake for a special occasion to be made on Jan 4. The bakery promised a cake to be ready on Jan 4 at 3PM. The bakery was closed on Jan 4 due to unknown reasons. I stopped by on Jan 5 just to realize they completely forgot about my order. They promised that the owner would call me back, and they promised to refund my credit card. They have not kept any of these promises. Bad business!", "author": "Yuri M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-24", "description": "This place was hopping on a Saturday afternoon - big line of customers but they handled it very efficiently! Selection of desserts, cakes, pies, pastries, and cookies was truly impressive - if you have a sweet tooth you are sure to find something that will please your palette here! We went with three different cupcakes (because who can choose just one??) and they were all moist and delicious.  The red velvet one specifically had luscious cream cheese frosting that was not too sweet and complemented the rich red velvet cake perfectly. Special mention goes to the \"canookie\" - a cookie sandwich with cannoli cream in between - absolutely glorious cookie concoction! Overall a wonderful bakery that we would be happy to return to when we're in the area! Oh and they do have an excellent selection of coffees, my husband enjoyed his iced mocha and my cortadito was just right as well. You can't go wrong with Mia's when craving a delicious dessert, whether it's dining in or grabbing it to go!", "author": "Anna M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-12", "description": "I didnt sit down here but UI came to get my wife some cannolis. They got rave reviews. They dont have them ready made, but they fill the shell to order, which is awesome. They also have a huge cafe in the back, which I would love to come back and try some time. It also looked jammed. Looks like a must try, the cannolis were enough to draw us back!", "author": "Israel H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-04-15", "description": "I've been to Mia's after having dinner with a friend in the neighborhood and I can't say I hated it but I wasn't wooed   either. Dessert was alright. I can't remember anything too outstanding. I order cheesecake once and it was alright. What I do vividly remember is our server took forever to come to us for our order. This person had a table of either friends (almost certain) or regulars. The place was pretty empty, it was a weeknight so it looked like staff were there without a manager or supervisor. They carried on forever. Hey I'm all for chatting it up with your friends but it got really annoying. We literally waited just too long for our order and for basically anything we needed. Now I don't want to sound like a Scrooge or anything. I am pretty fair in my reviews. So yeah not so great customer service especially if you're not friends of staff.", "author": "Karla A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-04", "description": "It was my boyfriend's sister's birthday so we wanted to buy a cake for her. Luckily, Mia's Bakery was only a few blocks away from the restaurant that we ate at! \n\nBefore you enter, there's a quirky sign outside with \"Salt Bae\" on one side and \"Skinny people are easy to kidnap, stay safe! Eat more cake\" on the other side-- SUPER CUTE! I would probably be attracted to this bakery with that sign alone (I'm easy to please).\n\nNow, for the most important part-- the desserts! Because we knew that we couldn't finish an entire cake, we opted for sliced portions. The bakery has a wide variety of desserts, such as cakes, cupcakes, gelato, and pies. I believe there is also a barista parallel to the dessert bar. We finally decided on a chocolate layered cake, a blueberry cheese cake, and a coconut cake. All of them were delicious and were not too overly sweet. However, none of the slices cakes were \"the best cake I've ever had\" kind of cake. But, if you're looking to a quick sweet treat, I would recommend this place if you're in the neighborhood.", "author": "Sharon H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-12-19", "description": "NEVER cater from here - ordered a cake with a week advance notice and it was not ready for pick up. Was made to wait while they finished the cake when they set the pick up time. Also ordered a dozen cookies for pick up at same time and it was not ordered or put together. Staff was unprofessional and had no regard for making others late.", "author": "Juliette C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-24", "description": "BEST BAKERY!!!!!! To eat or to bring a great somewhere.....Mias is the best.\nEvery single thing I have had there has been amazing and I think I've tried almost everything they have in their huge selection.\nYou can get anything here: cookies, pies and cakes by the slice or whole cakes, cupcakes, cronuts, babka, and tons tons more.\nEvery time I go anywhere now I bring Mias and everyone is excited when they see the bag now :)\nLove it all and the staff is so wonderful too.\nSo happy to have this in the neighborhood :)", "author": "Monica R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-31", "description": "First of all, don't forget to check into this place as there would be free coffee accompanied by anything purchased here. Apparently lots of cakes/cupcakes/cookies were worth trying. Wanted to try out their banana pudding and fruit Napoleon cake and I went with the latter as the cake looked so fluffy. \n\nReally enjoyed the decoration, with spiders hanging on the web and a skeleton next to them. They even had cupcakes with spider on top! However coffee was a bit mediocre...", "author": "Elaine H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-02", "description": "Update - after my flan incident yesterday , the Owner himself told to come in and he will make things right... he was really sweet and apologized to me , that meant a lot! He went out his way to make sure I was beyond satisfied! You definitely will see me more often :-) thank you \n\n\nOld review \n\nI had to write another review...\nI bought a flan here because the first time I had bought it , it was awesome and yummy..\n\nI bought another flan today and it was very rubbery and hard.. it's supposed to be somewhat like a smooth custard... I'm not pleased! \n\nFor $5.25 for a small thin slice , it's not worth it..im disappointed :(", "author": "Shade C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-12", "description": "Popped in a few days ago and was kindly greeted by a dude with an infectious smile (and attitude). He was at the coffee making section, or whatever you call it, so I assume he was the barista. Anyway, he helped me figure out my wifi and what to get. This place has 3 vegan options (2 vegan cupcakes and some pastry that I forgot). There were a couple more vegan options that I don't remember. If you're vegan, just ask for Arvin. He's an Asian dude with great hair and tattoos on his right bicep. \n\nWill visit again because it's a nice spot to get work done. Plus, they play the jams. Not too distracting though. Down for \"Baby, One More Time\" any time of day.", "author": "Kymberlie E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-16", "description": "I've had the privilege visit this place twice in the past two days. That's how great it is! \n\nI was impressed at the vast array of desserts that they offered and I enjoyed the atmosphere. I wish they had a couch in there somewhere though, but I can't have it all. \n\nThe first time I visited I got the strawberry cheesecake. It was soft and the strawberries on top were fresh. It just have that homemade feeling about it. It was the same thing with the pumpkin pie that I got the second time. It was soft and fresh. \n\nRight now, this place is definitely my favorite bakery in Cobble Hill, probably even Brooklyn for that matter.", "author": "Bashard B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-11", "description": "Stumbled upon this gem before dinner nearby and it has been the best incidental find. I spotted the strawberry cheesecake in the window and had to come back for it. Let me say, the strawberry cheesecake did not disappoint. The buttery graham crust is perfect with the cheesecake, oh and just when I thought it couldn't get better, they add fresh strawberries on top! I came back again for a slice of strawberry cheesecake and decided to try the strawberry shortcake - that was delicious as well. Can't wait for my next visit to Mia's!", "author": "Sunny H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-18", "description": "OMG the red velvet cheesecake is to die for.................", "author": "Tracey L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-11-14", "description": "TERRIBLE. Placed an order via Seamless for a Heavenly brownie, bread pudding and banana pudding. Got a call 10 minutes later saying they were out of Heavenly brownie and would a regular brownie be ok - no problem we say, stock gets eaten, we get that. Food arrives and my boyfriend looks in the bag and notices that the order is ENTIRELY wrong. As in we get a chocolate milkshake, some sort of chorizo pastry and a spinach pie. You can imagine our heartache when we were looking for our Sunday sweet fix!! My boyfriend runs out of the apartment and tries to flag down the driver - he keeps driving.\n\nWe immediately call the bakery and she gives us the runaround for 10 minutes until she finally calls the driver and says she'll call us right back. Nothing...we call her back 5 minutes later and she says the driver insists he gave us the right order. We finally get the driver's number and we call him personally. He says its not his fault that they don't put people's names on the bags and he isn't going to drive another 4 miles to retrieve our order. We call the bakery back and they said if we want our order we'll have to wait until 4pm...we're calling them at 2:45pm at this point. \n\nSo long story long - we get the completely wrong order, a bunch of food goes to waste, we end up eating out of date vanilla bean ice-cream and we have to call Seamless and get a refund. NOT COOL.", "author": "Emily B."}], "servesCuisine": "Cafes", "priceRange": "Under $10", "name": "Mia’s Bakery", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "139 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/SM4ZOzR354iQi9Xvf1b68g/ls.jpg", "@type": "Restaurant", "telephone": "+13479873194"}