{"aggregateRating": {"reviewCount": 572, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-22", "description": "Omg the best donut croissants in the entire world. I haven't had a dessert here that I didn't love. This is a neighborhood gem!", "author": "Kellee K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-23", "description": "Mia's  - dessert heaven! I always try to leave room and get something here when I'm eating out in the area! Everything is always super fresh and delicious, even at 10pm. I highly recommend the strawberry shortcake, coconut cake, red velvet, cheesecake and my favorite - the fruit napoleon. I'm pretty sure all of their cakes are amazing! \nThe only thing I don't like is that the AC is always blasting, even in the winter so it's uncomfortable to sit there. \nGreat service too!", "author": "Ilona P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-16", "description": "I'm not really a bakery or sweets kind of guy, but this place was great! Check out some of their stuff below:\n\nChocolate frosted cronut:\n\nStrawberry cheesecake:\n\nBlackout chocolate cake:\n\nCoconut cream cake:\n\nBanane cream pie:\n\nEclairs:\n\nRainbow cookies (and The Cake Dealer):\n\nLobster tail \"Sfogliatella\":\n\nAnd special cupcakes for Mother's Day:\n\nIt was really tough to pick favorites. The pistachio eclair, the lobster tail, the cronut, the rainbow cookies, the tres leches (not pictured) and the creme brûlée cupcake (not pictured) were all incredibly good. If I had to pick just one, it would probably be the tres leches. It tasted like a wet Cinnamon Toast Crunch cake. That may not sound like much to you, but I swear it was awesome.", "author": "JohnnyPrimeC. C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-21", "description": "Every single cake is absolutely delicious! Every single one. I love the Oreo cake and blueberry cheesecake .Missing star is the wait time when picking up a pre ordered cake. It's takes 10-15 minutes and this is when It's empty to pick up your cake . Makes it seem as if they're making it right then.", "author": "Angela M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-13", "description": "A really lovely neighborhood bakery, and a cozy spot to sit for a dessert. I came here after making dinner with a friend bc I was drawn by the 2 free cupcakes check-in, which is misleading bc once you click on it, you see it's 2 free cupcakes with the purchase of a dozen. Since we were already there, we decided to try some of the desserts. Their selection is massive; there's something here to please everyone (except those on low carb diets), from cake to pie to breads to cookies.\n\nMy friend and I took advantage of their cake pop and cupcake deal and bought a Oreo cake pop and tres lèches cupcake to share. We ordered, sat down, and within minutes, someone brought out our dessert on plates with mason jars of iced water. I was blown away that they had taken the time to add little droplets of caramel and chocolate to our otherwise normal and nondescript dessert plates; it was a nice touch, as were the were nicely decorated tables featuring cute gourds. \n\nTrès lèches cupcake was delicious and super moist, with lots of milk at the bottom. Oreo cake pop was a little too sweet because of the outside frosting coat; I'd avoid this since there are so many good other options. I'll be coming back to try other cupcakes and baked goods!", "author": "Hui C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-12", "description": "Me \u0026 my family have been ordering from here since they opened \u0026 have not been disappointed!! My favorite is their chocolate cake I ordered for my sons birthday but most recently we tried the coconut cake for our mom \u0026 omg !!! Delicious ! Also ordered the red velvet for my daughters birthday \u0026 it was beautifully done, exactly how I wanted. Have been recommending this bakery to everyone !", "author": "Fantasiesz B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-27", "description": "My favorite neighborhood bakery. The gelato is delicious because it's from il laboratorio del gelato aka best gelato in NYC!! Get the matcha - the best matcha I've had, the flavor is very intense; and the pistachio - also the best pistachio I've had. But every single flavor I tried was great. \n\nThey have pretty much any cake you can think of and they are all made in house. \n\nStrawberry shortcake - yum, simple and good, although a little too much cream for me\n\nNapoleon - good, but not particularly impressed \n\nBlueberry cheesecake - so yummy. I might have liked this better than Junior's cheesecake!!\n\nChocolate raspberry tart - chocolate is great, raspberry ganache not so much (tastes like candy), and the crust is a little too sweet for me\n\n(Will update this as I try more...)", "author": "Lucy L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-15", "description": "Yummy and clean place. Absolutely delicious.\nHighly recommended. However, i think they are more known for their cakes so id get their cakes rather than their cookies or cupcakes.", "author": "S W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-25", "description": "There are no words. I had the tres leches cupcake which was beyond delicious. The word moist doesn't suffice. I ordered a banana cream pie and pumpkin pie. They were both the best I've ever had in my life. I will be back for more! There was so much I wanted to try but I must pace myself!", "author": "Roxanne G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-14", "description": "Love this bakery. Came here late night (they're opened until 1 AM on Fridays and Saturdays) after having dinner in Brooklyn and was looking for dessert and cappuccino and Omg they have the BEST Napolean I have ever tasted. Lots of different cakes, cookies, cupcakes, pies, donuts and ice cream to choose from including vegan and gluten free options. Also have a nice sized seating area. I will definitely be back here. Worth traveling from Long Island for a bite!", "author": "Dominique G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-07", "description": "The creme brulee here is delicious and the portion is amazing. All creme brulees should be so big! I could still eat 10 of them, minimum. \n\nBaklava is great too. Oddly enough, I actually prefer smaller pieces of baklava as I would rather have more flakey pastry than nuts but even though it's a larger cake like piece, it's delicious, for breakfast or dessert!", "author": "Steph W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-13", "description": "I discovered mias as I was walking through the neighborhood and was alarmed the moment I walked in. Only alarmed in the best way!\nI was taken back by the long beautiful display of sweets. From cookies to cake pops to pies. I could spend hours deciding what to choose.\nI've been there multiple times ever since and I'm going to keep going till I try just about everything.\n\nRecommendations you ask? \n\nThe fruit nepolian- it's creamy fruity but not too fruity with a nice touch of crunch on top\nCheesecake- all of them. They have a variety of different kinds but each of them are rich and creamy\nApple pie- one of my favorite items off the menu. It's sugary on top and the apples inside are moist and melt in your mouth\nOatmeal raisin cookie- big and super soft\nStrawberry shortcake slice- extremely light and fluffy with just the right amount of strawberry and cream\nFlourless almond cookies- they have an amazing taste and texture\nHam and cheese croissant- to die for!! Very generous on the filling of ham and cheese.\n\nPutting the pastrys aside. I came here the night before mothers day and they had a very big display of mothers day cakes. I decided to purchase one and boy oh boy was it the best cake I've had in a while. It was buttercream on the outside and was vanilla sponge cake on the inside with a chocolate mousse layer. The cake was beautiful and heart shaped with a hint of pink and had drizzles of chocolate down the sides. The cake was only $32. I couldn't believe how good it was and how right the price was.\n\nMy family and I loved it so much my dad wanted it for father's day, I called the bakery and sent them the photo of the mothers day cake and they happily made a father's day version which was even bigger in size.\n\nIf you're going for a cake definitely try the vanilla sponge with chocolate mousse filling", "author": "AMANDA R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-14", "description": "The slowest service ever. The staff clearly doesn't care and whoever hired them needs to be replaced as well. Hire better staff. They make us customers wait 5-10min on line when we just want one or two simple things. They have their backs turned consolidating fridge product and doing other useless things making us wait longer. Slow uncaring service on top of product already being a bit overpriced.  Come on dude. Y'all can do better", "author": "Dominic M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-05-03", "description": "This is my second time at Mia's bakery. Due to its raving reviews, I stepped foot into Mia's bakery the first time around and ordered a carrot cake and strawberry shortcake. Both were good. So why the 2 stars?\n\nYesterday I came back to Mia's bakery since I liked their cakes the first time around. This time I ordered the red velvet cheesecake and a banana bread pudding. The red velvet cheesecake was sour and spoiled!!! I took one bite and vomitted. I thought maybe it's just me, but it tasted off. I proceeded to put the red velvet cheesecake in my fridge. Bad idea! It stunk up my whole fridge, smelling sour. How can any establishment sell spoiled cake yo a customer? At $5.95 for a piece of cake, that's a shame! I am going to attend to my upset stomach, but had to put this review out there.", "author": "Amy W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-10", "description": "Large selection of reasonably priced desserts. Good quality and large portions. Our group of 4 enjoyed 3 desserts (carrot cake, burnt almond, milk chocolate and honey pastry).\n\nService was a slightlg off as the waitress returned to recheck our order 2x due to not writing it down on.paprt but she was nice and pleasant to interact with.", "author": "Wendy L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-05", "description": "Ever since I moved to this neighborhood, MIA's been my go to spot for coffee \u0026 sweets. Sometimes I come here 3 times a day, coffee and potato stick in the morning, afternoon tea with cupcake and fruit napoleon or chocolate layer in late night! Everything is fresh and delicious!", "author": "Takako K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-07", "description": "My family and I patronize Mia's Bakers 2 or 3 times a week.  The store has an assortment of cakes and pies probably unequaled in New York City.  Mia's in Brooklyn is one more argument for living in our borough, which is steadily proving that we have most of the restaurants and entertainments that had been considered unique to Manhattan.  \n\nIf you like cappuccino extra hot, just ask and you shall receive.  If you want tables that are large enough for two or three or four people, you get that in Mia's (vs. patisseries in the Village which have tables large enough for birds).   So far we have enjoyed banana cream pie, apple pie, nutella almost cookies, and flan.  The assortment is mind-boggling, and fresh baked cakes and cupcakes, all done on premises, seem to come out of the kitchen every 15 minutes, even on weekdays.  A winner in every way.", "author": "Harvey K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-09-01", "description": "Was in the area and popped in based on review.\n\nService was great. The gelato was good..but we had the cannoli and some bread pudding and both were eh.  The cannoli filling and shell both disappointed and the bread pudding just was not the best I've had.", "author": "Emma P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-05", "description": "Thank u guys my order was great\nCafe Mocha, \nHam and Cheddar Croissant \nSalted Caramel Cheesecake\nTres Leches Cupcake the most delicious", "author": "Ginette N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-22", "description": "Looking for that post-dinner dessert joint/cafe that hasn't closed yet? Looking to treat your kids to some cupcakes? Researching that perfect first date spot? In need of a good neighborhood study/reading spot with a sweet snack and some coffee?\n\nMia's Bakery is one of my favorite spots in Brooklyn because of the great service, the great baked products it produces, and its versatility for different occasions.\n\nFirst of all, the service here is always fantastic. The baristas and waitresses have always afforded me friendly and professional service with a smile.\n\nSecond, the pastries and baked goods are delicious and artistically crafted. The mille-feuille (Napoleon) and salted caramel cake are not only aesthetically pleasing, but also very tasty. The wide selection and variety of cakes, cupcakes, pies, and pastries is outstanding.\n\nThird, Mia's serves pretty good coffee. Your baklava will feel less lonely with a good cappuccino! \n\nFinally, Mia's offers table service and very generous business hours. (More NYC dessert spots/cafes should operate as late in the evening as Mia's!)\n\nQuite simply, a 5/5.", "author": "George S."}], "servesCuisine": "Cafes", "priceRange": "Under $10", "name": "Mia’s Bakery", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "139 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/SM4ZOzR354iQi9Xvf1b68g/ls.jpg", "@type": "Restaurant", "telephone": "+13479873194"}