{"aggregateRating": {"reviewCount": 572, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-25", "description": "HOLY CRAP how didn't I know this place existed before???? SO MANY DELISH THINGS! They've got everything - literally every kind of dessert you could imagine, there's no use in listing them. We got the canollis - they've got a big size and smaller size too. Unfortunately they don't have many flavors, but what they do have is mouth watering. My only gripe with this place is that it isn't right underneath where I live. Then again... that may be a bad thing...", "author": "Priti R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-09-08", "description": "Really upset with this bakery! Me and my boyfriend came here, they seated us and brought us water and for 15 minutes no one came up to us to take our order. We finally get up and just order ourselves  another 15 mins pass no one brings us anything, apparently there was no waitress to bring us our dessert. Really disappointed dessert looked great but 0 service   We left no one said anything.", "author": "Victoria G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-30", "description": "Best chocolate fudge cake around. Best thing is... they're open till 11 to satisfy after-dinner sweet cravings", "author": "Love P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-10-21", "description": "OK so their selection is unbelievable. It really is. I also have heard raving reviews about this place. My friend that lives next to it can't stop talking about it so I decided to try it. First time I had the chocolate cake and it was good. She wanted the cannoli (I'm weird and not a fan of cannolis). I then went again with my fiance and we ordered a bunch of stuff. Black and white cookie (too dense), marshmellow bread pudding (not good at all), oreo cake pop (just fine), and tres leches cupcake (ok). So needless to say, I was a bit overwhelmed. Maybe I didn't order the right things. Again, their selection is phenomenal so maybe I\"ll give it another shot.", "author": "Heather S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-07", "description": "Everything was delicious. We had a slice of the coconut cake, the salted caramel cake, and strawberry ice cream. Nice big serving and we finished it all. Service was quick, staff was very friendly. Will be back!", "author": "Kristin G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-28", "description": "Why take quality over quantity when you can have quality AND quantity? At Mia's, you CAN have your cake and eat it!\n\nI don't know what's wrong with me. I walked by for coffee at 11am and ended up indulging on lemon cake. No regrets.", "author": "Michael H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-23", "description": "I have to stay I've had the best tasting coconut cake here. The raspberry lemon tart was good but it was soggy. I would def come back and try out other things.", "author": "Dawla A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-29", "description": "Best Wedding Cake Ever! The amazing team at Mia's Bakery made our wedding cake and did a spectacular job.  I asked for a cake that very few bakeries will make (trust me I've asked dozens of bakeries all over Brooklyn and Manhattan!) 3-tier white cake with buttercream, a layer of mocha, and a layer of apricot jam!  Their cake is light and fluffy and the buttercream is not too dense and salty/buttery and the cake was STUNNING To look at and delicious. Plus they worked with me on 2 trial cakes to make sure it would be perfect.  They also came in under budget!  If you have a special event run don't walk for your tasting now.", "author": "Ariel H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-28", "description": "Really good pastries here and a lot of selections of pastries.  My husband brought home a Nutella cupcake and tasted so good that I had to visit this place myself.  My first time visiting, I ordered the chocolate peanut butter cake it was super moist and tasted so good.   This is a good place to grab some desserts and a good cup of coffee.", "author": "Cynthia M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-19", "description": "On a beautiful sunny day we strolled along Smith St and tried Mia's Bakery. The showcase is like 30 feet long stuffed with various sweet treats like cupcakes, cakes and cookies in at least a half dozen flavors.\nI choose Red Velvet Cheesecake daughter had creme burlee and wife has chocolate layer cake. It was so rich and creamy they should have couches to nap after conquering the cake.\nSpace is quite large and has outdoor garden too. Prices reasonable and will be back for sure.", "author": "Rich M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-27", "description": "Another amazing experience at Mia's.The food was great.Special thanks to waitress Lena,for making our night special!!!", "author": "Yuliya S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-02", "description": "The pastries are really, REALLY good! Cakes and pies are also delicious. So why 4 stars and not 5? Because the service is the slowest EVER: seriously, if you're planning on having breakfast in the morning, you better camp at the table the night before. They're all really nice with customers here but dude wait time is insane for everything, even the check.", "author": "Roberto S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-26", "description": "The red velvet was delicious! Very moist and the cream cheese frosting was very light. The butter croissant was delicious as well; very fresh and flaky. I cant wait to go back!", "author": "Merieme D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-14", "description": "I was in a bind and had to order pies for a office holiday party. I did some research online for some bakeries that sell pies and found that too many required 48 or more hours in advance AND charged 40.00 a pie which is crazy! I found Mia's website while browsing online and was able to order the pies on their website (less than 24 hours ahead of when I needed to pick them up) and wound up getting 2 for the price of what I would have been charged for one elsewhere. I swung by to pick them up and was in and out in less than 10 minutes. Definitely worth it and I will definitely be patronizing Mia's again!", "author": "Monse N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-07", "description": "I've gotten multiple cakes from here and been very satisfied with them each time. The baker did exactly what we asked to be on the cake. Just perfect! Everyone loved it!", "author": "Jarlin N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-20", "description": "I've never been here but I've ordered desserts from here on seamless a few times now and have been very happy with them. The banana cream pie and peach pie were exactly what you'd want from each.", "author": "Spirit D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-30", "description": "I bought a slice of coconut cake. Seriously considered buying an entire cake to take back to California. Crazy fresh coconut.", "author": "Ricardo P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-15", "description": "I have eaten treats from Mia's twice. Once we stopped by on a Saturday and enjoyed desserts in house, and I recently ordered a cake for my fiancés birthday as a surprise. Both times Mia's really delivered!\nThe first time we shared an eclair and Mille-feuille. Both were a delight. Light, airy, and not overly rich. Perfect treats that didn't totally ruin our appetites for the rest of the day. \nThe coconut cake I ordered was a crowd pleaser, amongst people that didn't even like coconut. I ordered an 8 inch for 5 people and we demolished it. I seriously couldn't stop eating it. The leftovers were calling my name all day and literally every time I passed the fridge I snuck a bite. It was perfect. I didn't think I was a fan of whipped cream as frosting, but it was AMAZING. It made it such that the cake was indulgent but not sickeningly so like buttercream can be. This was a blessing and a curse, as it made it easier to just devour. \nWe were so impressed we're looking into ordering a wedding cake from Mia's next spring. Thanks!", "author": "Hayley T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-30", "description": "Mia's is incredible. It is my favorite place for a treat in the neighborhood. You can order at the counter or they have a super cute sit-down area. It is pricey than your average bakery, but you get what you pay for! Everything is delicious, I could not recommend more", "author": "Megan G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-23", "description": "I had a very nice experience there...lovely and cool staff...even the manager he's a very nice person...the environment was nice and warm... modern in style...we ordered Chocolate Blackout...and red velvet which were so fresh and delicious..and prices are very reasonable...i liked it...", "author": "Mohamed A."}], "servesCuisine": "Cafes", "priceRange": "Under $10", "name": "Mia’s Bakery", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "139 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/SM4ZOzR354iQi9Xvf1b68g/ls.jpg", "@type": "Restaurant", "telephone": "+13479873194"}