{"aggregateRating": {"reviewCount": 572, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-27", "description": "So delicious! Everything looks and tastes amazing. I came here with my cousins and we got cheesecake, chocolate mousse cake and peanut butter cake. It was amazing. It was rich and creamy. The service was also great.", "author": "Mel R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-25", "description": "VERY cute spot to stop and sit when you are walking in the area. I came here two Friday nights ago after having dinner with my boyfriend in the area. The dessert was very tasty... Sometimes on the sweeter side but definitely good. We got a pie to go and that was great! The coffee was not good but I do give them an A+ for desserts and service.", "author": "Elina K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-18", "description": "Came here right before they closed on a weeknight, since they have pretty late hours (for a bakery!)...Sun-Weds is 11pm and Thurs - Sat is until 1am.\n\nThe corn muffin was yummy and large enough to be shared, and the biscotti were delicious with coffee the next morning. We got a sweet treat of chocolate-dipped cannoli for the night-of. Would be five stars if they filled the cannoli to order like our favorite place in the West Village does.\n\nWill definitely be returning if I ever need pastries or cakes in the Boerum Hill area.", "author": "Kaitlyn R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-08", "description": "People talk about the croissants at Almondine and Bien Cuit--I would put Mia's in the same league. The laminations unfurl as you pull it apart. Great contrast between crisp outside and soft interior. Wonderful! And their cakes are terrific, too: nicely balanced texture and flavor and they are a great value. Definitely much better than a Whole Foods cake and less expensive, and a local place. The range of things they do well is really remarkable and the service is solid. Mia's is that rare place in Brooklyn that is unpretentious and is way better than you expect it to be.", "author": "Derek S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-15", "description": "This place is great! I've been here about four times and have never been disappointed. I do wonder if a cafe type system would work better though, where you pay for what you want first and then go sit down with it vs. how it is now with a waiter service? It's nice to not have to wait around for a check when you may need to run out suddenly (after losing track of time). But maybe they don't want people hanging out all day on their computers?\nThe place is immaculate and new, and they have a great big outdoor space which is awesome. \nThe people working here are all very sweet and always check in to see if you need anything. \nOne thing I would recommend- some music!", "author": "Anna H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-11-03", "description": "I've been to Mia's three times now. The first time I had a chocolate peanut butter cupcake from their refrigerated case. The second time I ordered a variety of cookies. And the last time I had three slices of cake which I split with my friends: black forest, strawberry shortcake and carrot cake. The carrot cake was the favorite with chunks of carrots and nuts and sweet cream cheese frosting. The cakes definitely take the cake here, and you really can't go wrong with any flavor. It's nice to have a large scale bakery in the area.", "author": "Julia W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-06", "description": "My family's favorite bakery. Every single dessert I've ever had from there is amazing. The cakes are to die for but so is everything else. We especially love the Oreo cake, triple chocolate cake, literally everything", "author": "Samantha M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-19", "description": "I love this place !!! I'm so glad that I found a decent friendly and delicious bakery in Brooklyn .  The desserts are always fresh , tea and coffee are great.  Big seating area , great for dining in.", "author": "Beverly S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-03", "description": "Mia's bakery is just a slice of heaven. This is my go to place for cakes! The cakes are always fresh. \n\nThe customer service is always on point. There is always someone available to help you no matter how crowded the place is. Little to no wait time when placing an order.\n\nI highly recommend the Vanilla Bean cake! It's my favorite.", "author": "Dante L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-28", "description": "Great service, and the treats are amazing!!!! They also have great food and wifi", "author": "Malique S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-02", "description": "Simply Amazing! Everything taste super fresh and it's inexpensive. The pastries are all kept in refrigerated coolers. I cannot wait to go back!", "author": "Britini W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-02", "description": "I'm so glad to see a new cafe in this space!  I visited for the first time today, and tried the chocolate croissant and iced tea.  Both were very good: high quality chocolate in the croissant, and the iced tea was nice and strong.  The staff are super friendly, and I love that they're open early mornings and late nights.  A great addition to the neighborhood.  I hope they succeed!\n\nP.S. Haven't tried their patio yet, but it looks heavenly.  A great spot to chill with a friend, or get a little work done.", "author": "Katie S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-23", "description": "I had the coconut cake and the chocolate *layer* cake (they have multiple chocolate cakes). Both amazing...can't decide which is better. I now want to go back and try other goodies!", "author": "Rachel J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-27", "description": "My husband and I stumbled upon this place while we were in the area, and have been making the 30 min trip out of our way since! Highly recommend the vanilla bean cake with buttercream frosting!", "author": "Ashley C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-29", "description": "Came here last night after dinner with a large and noisy group of friends :) we had a wonderful time sitting outside in the cute yard...felt like I was home in my own backyard.\n\nThe place is brand new, everything is clean, they have a huuuuge selection of desserts, the staff is very friendly, and, the BEST PART....they are open until 1 AM!!!\n\nThe owner kept coming up to us to make sure everything was going well, asked us how we were liking everything and even offered my friend to replace her dessert bc she didn't eat much of it...and without hesitating, he did just that without charging for the other one.\n\nWe will definitely be back! Good luck on your new place!", "author": "Jaine G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-22", "description": "My friend and I were around the neighborhood and we saw this bakery. They had many pastries and cakes on display. Its so hard to choose. They all look so delicious. I told my friend that I'm craving chocolate cake and we chose the chocolate layer cake and one more extra to fix my craving- strawberry shortcake.  Both were good. The strawberry shortcake sponge was a bit too sweet for my taste. I'll go back to try other deserts on display.", "author": "Jen L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-16", "description": "Strawberry cheesecake has the most perfect strawberries one can ever hope for. Sweet, fresh, fragrant and crisp. Real graham cracker bottom. Great backyard to enjoy the beautiful dessert. They got a lot to offer.", "author": "Ruoyi J."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-11-30", "description": "Quality here is average, but their selection is grandiose! They have traditional cookies, brownies, italian cookies, cakes, pastries, bagels, I can't even remember everything! There is also a cafe area for coffees, tea, espressos, etc. We grabbed a couple red velvet treats and a cookie - all were average and satisfied the sweet tooth but I wouldn't go out of my way to make a trip there. Service was very friendly and you could tell they take care of their regulars!", "author": "Raquel T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-24", "description": "If you've had a long day, long week, or long month, if you find yourself abandoned in Brookyln, Mia's is a must. Their cake is epic. The 7 Layer Chocolate is my favorite. And they have this new thing which they call a \"canookie\" and it's two buttery chocolate chip cookies sandwiching cannoli cream. The atmosphere inside is decent and there's plenty of shopping around.", "author": "Isabelle Z."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-30", "description": "Nice bakery, lots of choices and good prices.  There wasn't much we could rate this place on other than their selection and nice staff.  I can't remember what cake we bought from here, so that review will have to be for another time...", "author": "Leila L."}], "servesCuisine": "Cafes", "priceRange": "Under $10", "name": "Mia’s Bakery", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "139 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/SM4ZOzR354iQi9Xvf1b68g/ls.jpg", "@type": "Restaurant", "telephone": "+13479873194"}