{"aggregateRating": {"reviewCount": 572, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-25", "description": "This bakery is straight bomb\nAwesome delicious delights\nSuper cute chicks working counter \nA win win if you ask me\nOne of the best tasting bakeries in town for single cake slices.  Yum", "author": "Michael H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-01-01", "description": "CAKES ARE SOOOO GOOD!!  But I suggest taking it to go .. everytime we eat here it literally is the worst. The service is really slow, coffee for some reason takes forever and is cold. The servers are literally too busy talking or on the phone to care.\nListen I'm a server too . But this is your money. You can have great food but if service isn't good that u lose\nMoney .. we all have our days but I been here multiple\nTimes and always get an attitude. Even for the check like\nPlease a smile\nWon't hurt.", "author": "Brittany D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-08", "description": "All I can say is wowwww. They have everything to satisfy a crave.\n\nThe tres leches is amazing as long as its fresh.", "author": "Yvette M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-01-01", "description": "Everything looks delicious, and such great variety, however I did not end up getting anything because the service was lacking. I asked if there was anything soy free, and the response was \"almost everything is made with soy oil,\" followed by no suggestions. Does this mean actually Everything is made with soy oil?", "author": "Judy Y."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-02-04", "description": "This bakery is really cute, clean and the red velvet cake is amazing. \nI've also had their cronuts, which are different than ones I've had before. I wish that they did regular glazed, however the chocolate does its job as well. \n\nMy only complaint will be the customer service, which isn't always good. The guys are usually the worst, I always feel rushed and my order will come back incorrect.", "author": "Allie M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-12", "description": "Ordered the fruit Napoleon and chocolate cronut. The fruit Napoleon was amazing. The cronut left a little to be desired. Wasn't bad just preferred it to be hot. \nCute spot with option to sit and eat or order to go.", "author": "Sarafina H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-15", "description": "While having a scrumptious dinner at Brasserie Seoul one Saturday evening w/ two lovely Yelp Friends Mei and Wendy, one of them brought up the topic of dessert. It was discussed and decided that we would have dessert in the nearby area.....but where? Well, you know what we did right?-lol. You guessed it, we went on Yelp to get information and chose to walk down to Mia's Bakery.\n\nMia's Bakery is a quaint yet lively establishment that was in full swing when we arrived. We selected seating towards the back of the bakery next to windows and the door that leads to outdoor seating. Viewing various delicious looking baked goods that were all lined up in the glass case area, I was excited to see the full menu. After getting up to notify a staff person around us needing menus and us receiving them, hot beverages were ordered. I had the \"Strictly Strawberry\" Tea which was refreshingly satisfying, especially on that chilly evening. The others had a Mocha Latte and an Americano which were reportedly good. \n\nOrdering overall became a bit of a challenge (which is why I give them a 3.5 out of 5 stars) because our server informed us that the initial dessert items we requested were sold out that evening. Finally, we chose to split a slice of Apple Pie. Such delectable pie crust! The consensus was that the Apple Pie was sweet enough and not overpowering. The added touch was that it was served to us warm and seemed to be the perfect compliment to my Strictly Strawberry Tea. I realized that we ate it and I never got a picture of it!-lol. Well, hopefully that provides some indicator of how good it tasted!-lol. \n\nI hope to come back to Mia's Bakery to try some of the things that were not available that specific evening....and if not for any other reason than to have another cup of Strictly Strawberry Tea!", "author": "Alexis M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-06", "description": "My friend and I visited Mia's Bakery based on the positive Yelp reviews. We ordered 2 hot chocolates and shared a slice of coconut cake. Although dessert was satisfying, it was not as good as expected. Something about the cake was lacking in taste and the hot chocolates were just ok. I normally go to Martha's Bakery in Queens when I'm craving something sweet because they never disappoint. I did however appreciate Mia's good service and nice vibe. The interior is quaint and very cute, beautiful glass display filled with desserts, dim lighting and an overall clean look. If I'm in the area again I'd probably give them another shot and order something different.", "author": "Sarita P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-19", "description": "I was so impressed with the look and flavors of the cakes, everyone enjoyed them. This is my new bakery for everything.", "author": "Jane'a H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-19", "description": "Ordered delivery - strawberry cheesecake and brownie. Instead of the cheesecake, I got a strawberry short cake. I was pretty bummed but didn't throw a tantrum as I ended up eating it . To my surprise, it was a really good short cake! Also I enjoyed unpacking the cake in their cute little boxes. What a treat!", "author": "Blake C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-13", "description": "Discovered Mia's by accident about 2 yrs ago. Such a delicious variety of cake and pastries. Always a must when I'm in the neighborhood!", "author": "Monique J."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-03-29", "description": "This is my first review and its not a positive one. It's unfortunate. I have been here several times and the baked goods are great with no issues with the service. Today, customer service's no good. I have asked for the bill and wanted my daughter's cake wrapped to take home. I waited 20 minutes after I asked for the bill. And yes I checked the time because I was checking on the next G train to LIC. I got up with the cake in hand and asked for the bill and to wrap the cake. I shouldn't be walking around with the cake in hand or wait a long time for the bill. I could've walked out without paying. I will continue buy the baked goods to take out but I will not sit in in this place.", "author": "Ramona G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-03-24", "description": "Came here for the second time but unfortunately they still didn't have every flavor in stock. I stand by my previous comment, Mia's bakery is a bad knock off of Martha's Bakery.", "author": "R J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-11", "description": "This review is long time overdue: everything started when my husband and I wanted a cake for home because we usually have sweet stuff at home. We decided to stop by Bergen street: we had the chocolate mousse and it was delicate and the mousse so light and amazing: not heavily sweet! It literally melts in your mouth. The cake didn't last 2 days (well it does make sense). Since I am responsible to get cake for any birthday at work I had them try once and ever since: our office management has Mia as our designated bakery: all 2018 and we starting again this year. . I also had their meringue based pie, black forest, red velvet, 8 layers, and so on! It only gets better.", "author": "Kimberly B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-25", "description": "Y'all I boarded the gluttony train the instant I went inside Mia's. My friend Kiara introduced me to this place and I AM HOOKED. They have a wide assortment of pastries, cakes, and drinks (you name it, they have it). I really wanted to try everything but my stomach can only hold so much. I ordered a slice of key lime pie ($5.99) and my friend got the chocolate creme pie. Both were heavenly, and sized generously (I couldn't finish mine). The key lime pie was not overwhelming, or too sweet; it had the perfect amount of tang to it! The chocolate creme pie brought me back to my childhood where I would enjoy Swiss Miss hot chocolate in the winter, because thats exactly what it tastes like. The store is quite big, and they have a outdoor seating space where you can enjoy nature while eating dessert! Mia's is an awesome place for dates, studying, or just hanging out. I can't wait for my next visit so I can try the macarons and rainbow cake.", "author": "Michelle S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-11-26", "description": "Sooo disappointed. I paid $50 this thanksgiving on two pies that no one ate. The Pecan pie was a disaster! It was literally a bag of whole pecans thrown on a pie plate. 5% filling which was a sugar glob. We couldn't even cut into it to make slices bc everything crumbled when we tried, chunks of huge whole pecans going everywhere. Stop and Shop has better pecan pie waaaaaay cheaper. I'm so disappointed. The sweet potato pie was uniform but it tasted cheap. I was expecting a thick filling. I don't know if they were just rushing or if this is just the quality of pies Mias has to offer. Either way I will not be buying any sweets from Mias anytime soon, especially not for an important occasion.", "author": "Amani A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-30", "description": "Just WOW!!! All around excellent experience. Mia's bakery is so darling and very pleasant ambiance with nice tables to sit and enjoy your treats. The staff is friendly and sweet. We ordered a Nutella cronut, BOB (build your own biscuit) sandwich, cappuccino, and macchiato. Definitely order the cronut, it is incredible!!! We had the breakfast sandwich on a croissant instead of biscuit and it was phenomenal, flakey and buttery goodness filled with eggs and cheddar. Everything was lovely and would definitely recommend! We went around 1:00 pm on a Friday and no crazy crowd, just wonderful. 10/10 for sure!", "author": "Alex M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-23", "description": "Loved the walnut caramel cheesecake I got... everything looked so good! Would recommend grabbing a sweat there :)", "author": "Kristín M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-03-24", "description": "My son and I used to like this place. Since it was on the way to his elementary school, it was a treat to get some baked goods in the morning when he managed to get out of the door early. They have such extensive selections and we loved everything we had tried. \nLast week we happened to pass by in the Saturday morning and decided to have their table service in the back.\n\nWe ordered one hot chocolate and strawberry shortcake for him and a chai latte with soy for me.\n\nMy son only had two sips of his hot chocolate and then looked super troubled... apparently it was so sweet that he didn't know what to do.\nMy chai latte was totally water down version and super sweet as well.\n\nWe told our waitress the situation. She said both our drinks were made according to the instructions. \n\nFor a little over $21, my son and I managed to have two sips of our drink and few bites of the strawberry shortcake.", "author": "T T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-05", "description": "I've been meaning to try anything made by this place for ages! Therefore, I was so excited when we got a cake from this place for a baby shower. The cake was really delicious and no one had any complaints about it- which is a miracle with all the personalities we deal with at work! The cake was a lemon cake (light lemon flavor) with blueberries in it. The cake was not overly sweet. It was moist and fluffy. The frosting was very creamy and delicious as well. The price point wasn't too bad- but since this is Mia's it was expected to not be too cheap. The cake feed over 30 people and some went for seconds. The cake was dense, so slices could be cut small and it still was a good amount of cake per serving. (see the height of slices in the remnants of what was left after we devoured it) I would definitely try more of Mia's desserts!", "author": "Kia A."}], "servesCuisine": "Cafes", "priceRange": "Under $10", "name": "Mia’s Bakery", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "139 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/SM4ZOzR354iQi9Xvf1b68g/ls.jpg", "@type": "Restaurant", "telephone": "+13479873194"}