{"aggregateRating": {"reviewCount": 572, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-03-04", "description": "Placed an order at 5:45 on GrubHub with an estimated delivery of 6:20. Contacted Grubhub and they informed me my updated delivery time was 7 pm. 7:15 and still no sign of the food; I canceled my order. 1.5 hours is a ridiculous wait time for a piece of cake and an ice coffee from a nearby spot. Can't speak to the quality of the bakery, but definitely don't place an order online.", "author": "Josh K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-11-09", "description": "Good but not as good as your prices would require in order for me not to complain. I had an oreo cupcake (decent), a cup of tea (pretty hard to ruin) and brought home an apple pie, which was just allll riiiiite. A nice place to sit and have pastry, but this is a neighborhood full of nice places to sit and imbibe or eat, and full of specialty food shops. To me not worth wasting New York food calories on this place when there are better offerings so close by.", "author": "Deborah N."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-09-28", "description": "Sis had mentioned this to me but with a penchant for pastries and a sometimes forgetful memory, I always get excited when my Yelp app reminds me of a new bakery. Mia's Bakery, new to Smith Street, apparently aims to be a dessert cavern. The right side of the store is a coffee counter, where you can order all sorts of coffee drinks. The left side contains 6 display cases  highlighting cut slices and Italian style cookies, even baklava, muffins and cupcakes. Mia is ambitious in its endeavors to offer a myriad of cakes, pies and all sorts of desserts. One could probably eat a different type of cake or cookie for a month and still have a new type to choose from next month. The storefront itself holds three display cases of whole cakes, in case you want more than a slice. Unfortunately for Mia's bakery, offering such quantity and variety can mean holding a vast supply of inventory, unless you have the turnover.  A baker myself, I was curious if the quality stood up to the diversity offered.  Sadly, the one thing I tasted did not and it didn't compel me to try anything else. Firstly, I am always suspicious when baked goods such as layer cakes and cupcakes are refrigerated. For the store, it's a way of stretching the freshness, but as a customer, I don't want to eat a cold piece of cake or cupcake, especially one with buttercream and frosting. It would have been smarter for the store to freeze the cupcakes, and defrost them and then frost them. I only had a cold cupcake once in Ottawa, and surprisingly, it was good. Mia's red velvet cupcake, sold cold, sadly was not. As a baker who uses quality ingredients, I was disappointed to taste cake that had a cold clamminess and not a hint of cocoa or butter.  What did peep through was the stale refrigerator taste. The cake itself was flavorless and left me with a greasy feeling, as if I had eaten shortening mashed with flour. I actually drank green tea later, to cut the taste of oil in my gut. The frosting itself was only okay.  I could have been eating a generic cupcake from a supermarket bakery. I was quite surprised by the high Yelp reviews.  Maybe it isn't fair to rate a place based on one cupcake but I have also judged other bakeries by one item and haven't been off. At $2.95 a cupcake and $5.75 a slice of cake, Mia needs to ramp up the quality, especially with so many Court St bakeries only one block away. I don't know if Mia can scale back and sacrifice variety for freshness; perhaps so many offerings are required to pay the rent. The place is clean and huge, with seating in the back and even a garden. Service was friendly and pleasant. It's a pretty place to linger in over dessert and coffee. I'm sorry Mia couldn't deliver in taste. I might come back to try a coffee but seriously doubt I'd try the desserts again, unless I saw the place was packed and desserts were moving.", "author": "Helen Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-26", "description": "Everything and I mean Everything is great in here. My favorites and the banana pudding, red velvet cupcakes and the focaccia bread I mean phenomenal. We are treated well every morning we come in for tea and a latte. Please visit, you won't regret it.", "author": "felicia r."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-10-07", "description": "It's a known fact that a person's sugar tolerance is dependent on age and on nutritional needs. If you're a kid, you just won't appreciate more complex flavor palates. If you're starving, you're looking for as much bang for your caloric buck. If you're used to very sweet flavors, anything less-than will disappoint. I think Mia's fulfills if you fall into any of these camps - and a kid-friendly bakery is not to be scoffed at. But speaking as someone who can't exactly afford to consume refined sugar without it being sublimely worth it, I'd probably pass on Mia's in the future. There's a wide selection, and it all looks appetizing - which is a definite draw! The space itself is also cozy, clean, and large enough to relax in. But when it comes to the treats themselves, it's mostly an onslaught of sugar and not much else. Bien Cuit is across the street - try them!", "author": "Melissa S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-01-18", "description": "The dessert is amazing, the place is clean, and the presentation is great! Why only 3 stars? The service !! I have been coming to Mias since they opened and every time I stay in to eat the service is terrible. 15-20 minute wait to order. Please work on that :)", "author": "Janelly S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-08", "description": "I usually like this place but I was so disheartened by my experience today. As a new vegan, I was trying to satisfy my sweet tooth. I remembered this place having vegan options. I even checked the reviews on yelp to make sure they really did offer them. Unfortunately, I should've called and asked for myself because when I went today, they said they didn't have any vegan options. I don't know if they ran out but the way the employee said it made it appear as if they stopped making vegan treats. \nI also ordered a latte and it was probably the most scorching hot drink I've ever ordered. Borderline boiling. I couldn't stand to hold the drink even through the sleeve and the foam on the latte looked burnt (is that a thing? I didnt know that was evepossible. It could just be the color of the coffee but I've never seen such a thing and it tasted burnt too). \nStaff is friendly though so I can't complain about that. I'm just sad that I had to watch my friend enjoy their dessert while I waited for my latte to cool down (which didn't until we left and walked in the cold since I had it to go), so I pretty much just watched them indulge. \nSad and discouraging day for this vegan \n\nEdit: changing review for the politeness of  management and how well they addressed my concerns! Very impressed and glad that they genuinely cared about my experience. I will definitely return and give it another try!", "author": "Emma R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-08", "description": "Pumpkin and pecan pies were exceptional, and watching the baking crew work through the fish tank-like window was fun. Definitely a great place to have I the neighborhood.", "author": "Robert A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-11-03", "description": "The desserts look delicious in the window but I entered and bought a vanilla eclair and for $4.50 I would have been better off going to Dunkin Donuts across the street.", "author": "William M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-06", "description": "Very good desserts here with a wide variety. I also really like that they had a nice area that you could sit down and enjoy your dessert.", "author": "Perry T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-21", "description": "Mini creme brulee pies.. freakin deliciousssss. The caramelized sugar on top had a nice smokey kick and the custard was so smooth. Coming back for another one and to try the other pastries", "author": "Edith R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-11", "description": "This is one of the most cute and many different pastries cafe that I have ever been to. My favourite dessert over there would be the blueberry cheesecake and the key lime cupcake. The blueberry cheesecake was kinda of a disappointment because there was not enough blueberries so they should add more berries next time. But overall, the desserts are excellent and I will definitely come back here again.", "author": "Polly C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-10-04", "description": "We waited 1/2 for desserts from the showcase and then another 20 minutes for just regular coffee.", "author": "Lovie G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-09-07", "description": "Came to this place cause of the high reviews but was let down. Got the key lime pie, Oreo cake, and two Cannolis. The Key lime pie had some artificial taste. The Oreo cake had no Oreo taste to it.  The Cannolis shell wasn't crunchy but the chocolate was.", "author": "Allen C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-05-04", "description": "Went there because of reviews for a brownie. Have been trying all the local bakeries and Mia's has very high reviews. The nut brownie is misleading as it has a dusting of tiny nut specks on top. It was hard as a rock and more like solid sweet fudge. Not edible. By far the worst brownie I have had in this area. Turned it back for a chocolate cupcake. Not very noticeable chocolate flavor and lots of butter cream. \nThey do have some gluten free cookies for my daughter. I will not return.", "author": "Judith M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-05", "description": "Let's just start of with WOW.  Talk about service and quality.  Went there for a date with the Mrs. And sat in the back yard.  The coffee was phenomenal and I never had a better strawberry shortcake.  Seriously give this place a try next time I go the cookies will be my next victims.", "author": "Chadd T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-25", "description": "Whenever I'm in the area I can never resist stopping in for a piece of the peanut butter chocolate mouse cake. I've also had cupcakes on a few occasions that I found to be really yummy. The staff is very friendly. And they have a nice seating area in the back. I find it reasonably priced especially for the area.", "author": "Chris D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-08", "description": "I love this bakery! The creme brulee cupcake is out of this world, also tried the coconut cake and it was one of the best ive ever had! Yum", "author": "Kath K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-23", "description": "The foods (aka the desserts) is very good I like it but the experience can make me feel awkward. Thank you for taking the time to read my review, but it is how i truly feel. I feel awkward because I'm not sure what to do. I think they should make it more like the coffee shop experience cause they try to kind of wait your table so I'm not sure if this is for just a tip or if im supposed to tip for them to bring over the cake which I can bring over. Again, I thank you for taking the time for reading my review. All the best, Rob G.", "author": "Rob G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-20", "description": "Great addition to the neighborhood - this bakery has a very large selection of cakes, pies, cookies and other items. They also have a seating area with table service, a coffee bar, and a beautiful outside patio. Mia's has become my go-to place to pick up bakery items to bring as hostess gifts, and for parties. Some of my favorite items are the flourless soft almond cookies, the italian fruit filled and chocolate dipped cookies that are sold by the pound, and the cake slices which are great for bringing to a party so everyone can have a bite of different flavors. Service is fast and friendly.", "author": "Jen Y."}], "servesCuisine": "Cafes", "priceRange": "Under $10", "name": "Mia’s Bakery", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "139 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/SM4ZOzR354iQi9Xvf1b68g/ls.jpg", "@type": "Restaurant", "telephone": "+13479873194"}