{"aggregateRating": {"reviewCount": 572, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-14", "description": "Tried to go to Bien Cuit down the street. But there was a long line and one counterperson serving as a barista. So I checked out this place. A long counter with a beautiful assortment of pastries. A separate coffee bar. Why wasn't this place full?\nThe counterperson is at my disposal. I order chocolate croissants, an olive pastry, a pastry with chorizo and cheese and filled to order chocolate cannolis.\nWe try the cannoli first and they are spectacular. Crisp shell, creamy, flavorful filling, chcoclate splendor. The next morning the chocolate croissants are a bit of a letdown. Enrobed and filled with chocolate yes, but they are not very flaky. We finish with the filled pastries at lunch. Oddly they are wonderfully flaky, like proper croissants. The savory olive pastry is filled with slices of olive and a cream that seems to be a mixture of cream cheese and black olive tapenade.\nSo three out of 4 items pleased. Not bad at all. Service was nice too.", "author": "Saul G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-17", "description": "This place has everything to tickle your sweet tooth. Including, pues, cakes, cookies and cronuts. All of it is freshly made and tastes amazing. Usually a place with so many options doesn't master any of them but this place has yet to let me down. Stay tasty my friend.", "author": "Ariel R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-01-03", "description": "Came here for the first time wanting dessert after eating at one of the nearby restaurants. \nOnly tried 3 things. \n\nBanana cream pie: delicious!! Perfectly light, not overly sweet, and a perfect crunch to the crust.\n\nBanana nut pound cake: it was okay, had a strange flavor to it.. Not sure where it came from. \n\nSpicy chai tea latte: it was OK. I feel like it could've used more flavor. The barista asked me if I wanted it to be spicy or neutral, which I wasn't sure what that meant because chai is supposed to be spicy to some extent. Wasn't spicy at all. Very soft, too soft to say the least. And slightly watery. But just okay. \n\nDidn't try too much but I would definitely come back to try more.", "author": "Jael M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-03", "description": "From bread to pastries, from coffee to tea, this place is a great addition to the area! The owners and staff are really nice and the atmosphere is great. There is a lovely seating outside, as well as indoors.  They have a wide variety of sweets and you'll want to try them all.  They have the most adorable expresso to-go cups!  Try something sweet or savory, the Italian pastries are delicious! They also have gelato and cronuts :)", "author": "Diana M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-18", "description": "Now that I have been going to this place for a few weeks, I am a lot more familiar with the menu. This is a place I stop by before I go to the gym and after the gym. I know it's weird to use a bakery like this, but the inside is so relaxing. It's like a coffee shop atmosphere. Great servers, and delicious pastries. Since it's winter time, the hot chocolate is my go to drink. The guy who makes it doesn't know he has a fan in me. Their hot chocolate can make a crappy snowy day turn into sunshine. . I recommend this place to all my dates and friends.", "author": "Robert J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-10", "description": "I enjoying coming here occasionally. They have so many delicious looking cakes and pastries. I will hopefully taste them all one day. They used to sell Pecan pie by the slice which was soooo good. But they don't anymore for some reason. They have small tarts but it's not the same.", "author": "Moses G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-05", "description": "Excellent cannoli...best I've had in 5 days! The staff is wonderful, knowledgeable, generous, and gracious. A must visit!", "author": "Mike D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-30", "description": "The chocolate pistachio mousse and raspberry cake is amazing. The macarons are good, too. Many different kinds of desserts.", "author": "Sam S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-22", "description": "Their strawberry shortcake is so moist and tasteful. It's not overly sweet so it's not overwhelming if you decide to get something late at night. Their strawberry cheesecake is good also. It kind of just melts in your mouth.", "author": "Lisa Z."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-07-29", "description": "Was so excited to happen upon this bakery while visiting Brooklyn. The pastries looked amazing. I ordered a pastry and a cold brew coffee. When checking out, the woman said, \"To go, right?\" I said, \"Ok.\" However, after getting the bag with the very large, cream-filled pastry, and coffee, my husband suggested that maybe we should sit down  to eat it, as it was a bit unwieldy to eat while walking. There were many tables inside and outside. People were only sitting at two or three of the tables. So we went outside and sat at a table while we ate the pastry. About half way through, a woman came out and told us that we had to leave! The tables are only for \"table service\" and I had chosen to get mine \"to go.\" Really?!?!? I was appalled at being treated that way. I could understand if there were people waiting for tables or if we were eating items that were not JUST PURCHASED from their establishment,  but seriously??? While walking out, I saw no signage outside or on the door to the patio that would suggest we were not allowed to eat there. I will definitely not give them any business in the future and will discourage my local friends from visiting as well. That is a terrible way to treat a patron! The only reason I'm giving two stars is because they had a great selection and my pastry and coffee were tasty.", "author": "Suzanne B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-26", "description": "My husband and I are so glad that Mia's bakery opened around the corner from our house. They have the best cheesecake in New York and the service here is awesome. Tony who is the owner makes you feel like part of the family when you're here. You must try the Oreo cheesecake it's Divine. They have an outside terrace that me and my husband are sitting at right now having a coffee and a piece of tiramisu. I'm British and really like rice pudding and the rice pudding here, it's awesome super creamy. They do a pretty great red velvet too. Katie and Tarek", "author": "Katie H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-27", "description": "How have I not written a review for Mia's?! I have been coming here since it first opened and it is always amazing. My boyfriend and I obsessed. Some of my favorites are the German chocolate cake and seven layer cake. The cookies are also really good. It is super clean and spacious inside. They have a really nice patio during the summer. Also the people are so friendly. They answer all of your questions, give great recommendations, and even gave me a rose last Valentine's Day. You are missing out if you haven't been here before.", "author": "Ashley M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-02", "description": "Mia's is my go-to for baked goods in the neighborhood. We always stop in when we're in the mood for a treat. The cupcakes are great and the banana pudding is a favorite. The staff is pretty friendly and helpful. I've definitely seen other good bakeries with a bit cheaper prices, but nothing too crazy. Definitely check them out if you're in the neighborhood!", "author": "Person Of Interest X."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-12", "description": "Great selection!great service! Will definitely be back! I couldn't decide what I wanted the selection was so wide and everything looked amazing!!", "author": "Estefani H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-05", "description": "Mia's Bakery has a wide assortment of desserts.  Everything in the display case looked greet we couldn't decide which dessert to choose from so my family of 5 ordered an assortment of different kinds and we all shared.  My personal favorites so far were the Strawberry Cheese Cake, Oreo Cake and the Salted Caramel.  Their outdoor seating was very nice and pleasant.  Their managers and staff were very welcoming and friendly.  Can't wait to bring the rest of my family this week and try some more.  Oh I ordered a frappe and it was great!!!", "author": "Aleka B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-05", "description": "This place is awesome! Fresh and tasty deserts, friendly and attentive staff, cozy atmosphere. I'm definitely coming back (:", "author": "Julia J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-22", "description": "Toasted almond cake, coconut cake; today I had apple cheesecake.  It's hard not to stop thru on every trip to Traders.  Great coffee and a friendly staff as well.   Only bakery that compares is Old World on Forest ave.", "author": "Michael M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-08", "description": "All their desserts are pretty fantastic. Shared among 6 of us a couple donuts, various cakes and pies and everything was very fresh and not too sweet. The atmosphere on a week night is especially great as it's sparse and not too crowded. The outside back patio is especially great on a cooler night and perfect to bring your rambunctious kids to hang outside without disturbing the patrons inside too much.", "author": "J L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-11", "description": "Their desserts are simply sinful. My go to is the lemon merengue but today I tried the creme brûlée and fell even more in love. I've loved everything I've tried.", "author": "Genenne H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-05-04", "description": "Everything here looked so beautiful in the showcase, but everything I ordered to go was old! Tiramisu wasn't fresh, you could taste that in the cream and stale lady fingers. Creme brulee had a layer of moisture on top of the sugar. Eclair was horrible, chocolate filling was rock hard and pastry was mushy. Was hoping for alot more from this place.", "author": "Lisa H."}], "servesCuisine": "Cafes", "priceRange": "Under $10", "name": "Mia’s Bakery", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "139 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/SM4ZOzR354iQi9Xvf1b68g/ls.jpg", "@type": "Restaurant", "telephone": "+13479873194"}