{"aggregateRating": {"reviewCount": 572, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-01-28", "description": "Food is so-so, but they use a delivery service provided by GrubHub so neither they nor GrubHub will bring you the missing items from your order.", "author": "Jane R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-06", "description": "Food porn. Love this place. Always great treats and the staff and owners are super nice (often throwing in a fee cookie or something towards the end of the evening).", "author": "Joshua L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-26", "description": "got a pecan pie for thanksgiving, conclusively the best pecan pie anyone had ever tasted!!! will be coming back again and again!", "author": "Gabrielle G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-12", "description": "Only tried the Napoleon so far but it was really, really good, on par with Ferraro's!!  Nice, heavy vanilla custard, with light flaky pastry, great balance of both.", "author": "Matt r."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-03", "description": "Amazing.. simply amazing.. just deliscious.. yah!", "author": "Niki B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-25", "description": "Went for my boyfriend birthday , they were very friendly and pleasant cakes was great ...", "author": "Janee L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-11-14", "description": "Terrible, terrible carrot cake frosting. Makes me think looks are more important than taste in this bakery. Locals won't come more than once if that is the case. Too many good choices around here.", "author": "K S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-28", "description": "This is a beautiful gem of a shop with great desserts and charming staff.  My friend and I were walking in the rain when we smelled the most delicious smell wafting about and overwhelming the storm.  We followed our noses into Mia's Bakery.  We were greeted by a friendly worker behind the counter, given great answers to all of our deliberative questions, and ultimately advised by one of the owners to try the salted caramel cake.  It was delightful and perfect, as was the entire experience here.  The owner was kind in conversation with us while also respectfully advising his staff on clean-up and prep work.  The dining area is spacious by New York standards.  We loved and will be returning for more celebratory cronuts and cheesecakes!", "author": "Shevy S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-04-29", "description": "i am quite surprised to see high ratings.  My husband and i visited the bakery twice. The staff was very nice and quick to help.  The first time we went we sat down (they have waiter serve which was nice and different).  What disturbed me was that the waiter was using windex to clean wooden tables.  That is not sanitary!   During our two visits we ordered in total a piece of strawberry shortcake, Red Velvet cheesecake, a salted caramel cupcake, slice of pumpkin pie and pecan pie. For drinks we had coffee, hot strawberry tea, and a latte.  The drinks were good/average, definitely nothing special for the price.  I also noticed this weird smell coming from the expresso machine they have.  It was a very strong smell of feces and it made me feel a little sick about drinking the latte. i enjoyed the strawberry shortcake slice because it wasn't too sweet but over all it was quite soggy and the strawberries in between the layers were turning dark.  I assume the slice wasn't very fresh.  The cupcake was disappointing all together.  It was dry and tasted like freezer.  Not to mention that it was just a vanilla cupcake with grainy vanilla buttercream and a little dollop of caramel on top. The red velvet cheesecake was average definitely more edible then the pies.  It is just red velvet cake with plain cheesecake in between.  i thought $6 for that was way over priced.  I would say the pumpkin pie and the pecan pie was the worst part of the experience.  if i hadn't brought the pie i would of gave this bakery two stars but i did buy the pies and they are gross.  They tasted like an out of a box recipe that had been frozen...defrosted...and kept in the fridge for weeks after.   everything was off.  It tasted bland, grainy, dry, it had weird colors..etc i do not recommend these pies.  If you want good pie near smith street i suggest Betty's Bakery. This place is such a disappointment that i made this account just to express how i feel about this place.", "author": "April A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-11", "description": "After a day of shopping we went in search of a local ice cream shop, and found VanLeeuwen's on Bergen Street, near Smith Street in Brooklyn. Just yum. Simply, just yum. We sampled various flavors with the following results:\n\n- chocolate was smooth and rich, without any hint of chalkiness;\n- earl grey tasted like the creamy frozen equivalent of a cup of its namesake tea;\n- candied ginger was creamy and sweet with candied bits of real ginger and just the right amount of a peppery bite;\n- sea salt caramel had a nice burnt sugar taste;\n- pistachio was flavorful, but without any nuts, which was slightly disappointing. \n\nThey also have a vegan ice cream selection and a small selection of pastries and coffee. \n\nAll in all a great find, and I'm looking forward to returning to Brooklyn with an empty cooler, and returning to PA with it filled with candied ginger ice cream (my surprise favorite, since I have hitherto been a pistachio gal.)", "author": "Susan S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-05", "description": "I had a cake spree here \u0026 I loved every single cake I tried. Very cute, clean, great location and great customer service. I can't wait to go again. Ohh and my cappuccino was perfect.", "author": "Evelyn S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-24", "description": "great food, amazing selection and best coffee anywhere close. then outdoor patio is so cute and cozy... a private oasis! the coconut cake is killer and you can stay to savor the huge slices without fear of being kicked out! they have a wide variety of cakes, pies, cookies, and all sorts of other delights. not friendly for your waist but totally worth it!", "author": "Ms B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-08-06", "description": "The place looks nice and the cashier was attentive but I wish I could say the same for the quality. I was very disappointed with my strawberry short cake. For $6.25 I felt robbed, my piece had one strawberry. The one stawberry they used to decorate with on top which was tiny. Sorry that doesn't make it a stawberry shortcake it was just cream and pound cake.", "author": "Jen J."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-09-16", "description": "Service, first of all, was lack luster. I was waiting in an empty restaurant while employees chatted and then another patron who walked in after me was helped ahead of me. I had the cheesecake here, it was mediocre. Overly dense and had a subtle chemical taste to. I live in this neighborhood and there are much better bakeries a few blocks south on court. The space is nice and the shop and cafe is pretty but overall it's very disappointing.", "author": "Han G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-27", "description": "LOVE this place... I ordered a Tiramisu cupcake and a seven layer cake ... They were both heavenly.  The only thing is they don't serve real food (they do have pastry like crossiant ; but it may be a good idea to have some artisan sandwich for people who does not have a sweet tooth?) Will definitely return.", "author": "Honest R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-29", "description": "I've been looking forward to the opening of Mia's. They opened yesterday, so I went in for a plain croissant this morning and it was fantastic. The staff is exceptionally friendly and there are all sorts of mouth-watering treats on display, including cakes, pastries, cookies, tiramisu... the list goes on and on. There is seating inside as well as a cute garden in the back. This is a wonderful addition to the neighborhood!", "author": "Meghan G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-22", "description": "I stumbled upon this place by accident and loved it. They have a nice selection of sweet and savory items and everything i tried was delicious. They offer coffee and have an area to sit. This will be a nice place to go on a cold wintry day for a hot coffee and dessert.", "author": "Ariel Z."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-18", "description": "We randomly found this store while walking through the neighborhood. The pies in the window looked great so we decided to try a piece. That was one of the best ideas we had so far because the cake is delicious here. I had the oreo cake and it was really tasty and very moist. One of the better pies I've had. My girlfriend took the carot cheese cake and that also was great! Really recommend this place if you're out for a good piece of pie.", "author": "Joran D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-21", "description": "Mia's bakery is like no other!!! They have an unbelievable selection of sweets and the quality is unimaginable. Looking at all their sweet made my mouth water. Everything looked so delicious. I had a slice of the red velvet cake, it was amazing! I ended up buying more to take home to the wife \u0026 kids. Staff was very friendly and accommodating! I have never seen any bakery like this or even close to it. Very spacious \u0026 the back yard is a great place to be for the summer time!! This will be my number one spot! Can't wait to go back there tonight!", "author": "Clark G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-27", "description": "Nice new addition to the neighborhood. Extensive selection of pastries and other sweets. Clean, modern interior and excellent presentation. German chocolate cupcake is excellent; strawberry croissant-donut is quite good.", "author": "Food Jerk X."}], "servesCuisine": "Cafes", "priceRange": "Under $10", "name": "Mia’s Bakery", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "139 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/SM4ZOzR354iQi9Xvf1b68g/ls.jpg", "@type": "Restaurant", "telephone": "+13479873194"}