{"aggregateRating": {"reviewCount": 572, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-27", "description": "This bakery is by far one of the best in Brooklyn! The lattes with a nice slice of cake is literally heaven. All of the cakes are to die for I can't even name which is my favorite!!!!!", "author": "Ashley V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-29", "description": "Mia's seems to be the new \"it\" spot on Smith Street. I came by on a Saturday night around 8, and the place was packed. Luckily, they have a ton of seating in the back, but it was tough to get to the register to pick up a cake I ordered only an hour before.\n\nBut like the movie Memento, let's rewind to see how we got to this point. The night before, we picked up a pecan pie for a friend's birthday. It was delicious. So the next day, for my dad's birthday, I had to find a last minute cake (because I'm a great son) and remembered Mia's. Stopped in around 7, picked out a cake they had on display (the ones inside are for sale; most of the ones in the windows are customer-reserved). Went with strawberry shortcake and they were able to write a message on it within the hour that I went to the gym and back. Easy peasy.\n\nThe cake was $32. But honestly, I enjoyed the pecan pie more. The strawberry shortcake (which they told me was a favorite for birthday parties) just wasn't anything special. A place like Paris Baguette charges the same for their cakes, and they have more interesting flavors and prettier cakes. But hey, Mia's is quick and convenient.", "author": "Kenny C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-27", "description": "Very yummy tres leche in a nice portion size. Whipped cream on top was very fresh. I loved the overall cinnamon flavor and the fact that it wasn't too sweet and didn't taste like condensed milk. My husband had the salted caramel cake and his was good. Not amazing, just a good slice. We ordered the fruit Napoleon to go. Can't wait to try it tomorrow.", "author": "Sanjean M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-12-26", "description": "Great bakery!!! Definitely try their fruit Napoleon! In terms of their delivery, I think it is a little too pricy as the minimum order is $25 and you still have to pay a delivery fee.", "author": "Viola L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-10-13", "description": "LATENight strolls landed me here as I was drawn in by the bright lights and window display of goodies. I initially entered to just look around and take in the smells of the bakery.\nLow and behold I ended up with a pistachio and vanilla macaroon to start which are small and bite size as usual however that pistachio macaroon was packed with huge flavor. The vanilla one was okay, I'll get another pistachio and try another flavor upon my return.\nMy cousin ended up with a cappuccino as this place as an cappuccino and espresso bar to the right, seating straight back and the dessert display which is long and filled on the left. I ended up with Tres Leches and a Strawberry Banana cupcake.\nThe Tres Leches was super moist and tasty to say the least. I tried Tres Leches for the first time early last month home in Chicago at my best friend birthday party as it's her favorite dessert and her husband brought a cake version Tres Leches and it was super delicious. The Strawberry Banana cupcake was OK I was pleasantly surprised to taste the middle which was the only moist part of the cupcake as it was a banana cream cheese type of middle. The cupcake itself was yellow cake and the strawberry aspect was the icing on top. \nI LOVE a good cupcake but I prefer cupcakes that taste as they are named in the cake itself not the topping or filler. I much prefer my cupcakes that way but will say if you are use to this makeshift way of cupcakery then this is a good place to get cupcakes.", "author": "Bianka M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-21", "description": "Mia's is definitely my favorite bakery by far.  We have tried many items on the menu and it all delivers.  The Napoleon cake and fruit tarts are my fav. I've taken a strawberry shortcake from here to a dinner party and it was a hit. The only thing I haven't tried and will probably order for Thanksgiving, is a pie.", "author": "Tania T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-06", "description": "My go to spot when I'm craving something sweet. I've tried a lot of their cupcakes and all are really good but the ones I really recommend are their Tres Leches cupcake and Black Forest cupcake.", "author": "Asia H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-21", "description": "One of the best bakeries I've been to! Desserts tasted fresh and were absolutely amazing...on top of that, everyone was super friendly and the seating area awesome. Great atmosphere! Can't wait to go again.", "author": "Daniela Q."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-07", "description": "For all your cake and pastry need, visit Mia's. Located in the heart of Downtown Brooklyn,  Smith Street. Nice and helpful staff.", "author": "Helo F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-01", "description": "Oh boy. Major dessert sensory overload. My head spins just looking at all the choices.\n\nGot the german chocolate cake and peppermint tea. Both were fine- the cake was the right amount of sweet. \n\nRecommended for after-dinner dessert.", "author": "Bob K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-09-18", "description": "We stopped by to pick up some dessert for our friends who just had a brand new baby -- IMO, nothing says \"Congrats, you never get sleep through the night again\" than a platter of cookies.\n\nThe rainbow cookies we got were great. Super almond-y and moist. We also got canookies which I wanted to be genius; it's cannoli cream sandwiches between two cookies! Unfortunately, the cookies were too overwhelmingly sweet and the cream was weird and waxy. We also got a heavenly brownie to split - chocolate brownie with Oreos and chocolate ganache. Also just too cloyingly sweet.\n\nMinus another star because things were so pricey! We got four rainbow cookies, four canookies and a brownie and we paid $30!", "author": "Angela C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-01", "description": "Came by after a meal that was so-so. We were hoping to enrich our taste-buds. Mia's Bakery has amazing cupcakes and I can happily say we were not let down. My boyfriend got some chocolate cupcakes while I chose red velvet. Their cream cheese icing on the red velvet was to die for, while the chocolate cupcake were very moist. I think it's safe to say that, they were amazing and we can't wait to go back to try other sweets and treats!", "author": "Mimi F."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-05-13", "description": "Great service and was able to buy the items quickly.  Unfortunately the desserts were too sweet.  The slice of Oreo cheesecake was super heavy, tasting of sugar and cream cheese only.  I had such high hopes for the chocolate layer cake (chocolate cake + chocolate mousse), but the sweetness completely masked the taste of chocolate.", "author": "Lisa G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-01", "description": "After an extremely long day,  I decided to head to Park Slope to pick up a wedding card at Paper Source.  On my way back to the train station, I saw all these beautiful cakes in the window.  Drools.  Must walk away.  Then,  I pulled out my phone to see the reviews.  To be honest, I was drawn in by the free coffee.    \n\nAs soon as I walked in,  a friendly cashier greeted me.  I asked how much were the rainbow cookies,  she told me $12 per pound. While I was pondering, she then informed me I don't need to get a whole pound. I asked for 2 small pieces.  In the end,  my check came out to be $1.35 with a free iced macchiato. Both items were delicious. I love the cookies, moist and not too sweet.  The iced coffee was strong and not water down.  \n\nOn my way out,  one of the waitresses told me their best sellers are apple crumble pie and cheesecake.  Also, the place has a backyard where you can sit and enjoy your sweets. \n\nAs the terminator would say \"I'll be back!\"", "author": "Ling C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-01-21", "description": "I had the Nutella cupcake which I found to be kind of dry there wasn't anything special about it,  I could still taste the sugar in the icing so it wasn't mixed very well. My friend had the strawberry cheesecake which she said was good I didn't taste it but I'll take her word for it. I would go back because after all it's a bakery and there's much more to try but I wouldn't try any of their cupcakes again. The service was okay, the bakery is very nice they bring your choices to you on a plate with water.\n\nAnd just a suggestion to the owners I think you guys should ice the cupcake as customers order it ! So that way the icing is nice and soft whether it's buttercream, cream cheese or whatever icing you use.", "author": "Andria A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-14", "description": "Oh mamma mia! This place is not for anyone who intends to go on a diet or wants to have a \"lite\" bite. Expect to indulge and live in the moment of being glutinous. If the endless display of decadent pastries doesn't give you an idea what you're up for, then you're in for a surprise. I must admit, the display was very overwhelming but in a good way. I had to immediately divert my eyes away from it so I could find myself a good spot to sit down and then enjoy what's to come. The bakery itself has quite ample seating. They even have outdoor seating in the back and everything is nicely spaced out.  If you decide to sit, it's table service so expect to tip.  My friend and I really just wanted something to drink but it was kind of hard to resist from ordering any of their desserts. So we decided to split a Nutella Croissant Donut (also known as a Cronut but it's trademarked so other places can't  use that name) and the Nutella spread on top literally melted in my mouth followed by the sugar coated croissant layer. It was heaven in my mouth.  Best part is we didn't have to wait 4 hours for this \"cronut.\"", "author": "Rowena Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-13", "description": "Best pastry in New York City,Found out about this place a month ago started coming here every weekend for coffee and sweets. Backyard seating is amazing and relaxing. Thumbs up", "author": "Victor M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-21", "description": "This bakery has a lot of choices, similar to Martha's Country Bakery, but the quality didn't seem great. I tried a piece of chocolate cake and was not impressed with it. It didn't taste like good, rich chocolate and didn't hit the spot.", "author": "Danielle C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-27", "description": "I know I can count on Mia's bakery for events and special occasions. I order everything for corporate to personal events from Mia's. The cake and pies are delicious every single time. They recently made a custom cake for my husband's birthday and it was one of the best I have ever had. My family enjoyed it very much. See attached photos for the cake we had this weekend. Thank you Mia's for always coming through.", "author": "Raz M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-28", "description": "Pretty solid dessert place. They have a wide selection from cakes to pies to muffins, whatever tickles your fancy. Came in here one weekend with my boyfriend and we shared a dessert and I had a tea while he had a cup of coffee. Not bad. The only thing is that they seem to be understaffed because we sat down and had to wait a bit before someone acknowledged us to take our order. No big deal, we weren't in any rush to go anywhere, but it was surprising because it was empty at the time. They're also on seamless if you're interested in getting a slice or an entire cake delivered to your place.", "author": "A Sofia C."}], "servesCuisine": "Cafes", "priceRange": "Under $10", "name": "Mia’s Bakery", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "139 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/SM4ZOzR354iQi9Xvf1b68g/ls.jpg", "@type": "Restaurant", "telephone": "+13479873194"}