{"aggregateRating": {"reviewCount": 572, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-08", "description": "I'm not big on desserts but Mia's won me over easily. I went in not sure if I was going to get anything and ended up ordering 2. I got the coconut eclair and the tiramisu - both of which I'd highly recommend. My friends all raved about their choices as well (red velvet cupcake, carrot cake, and chocolate chip cheesecake). If you want coffee they have that covered as well. \n\nThey have wifi so it's a great place to study if it isn't too crowded. There's a nice outside area in the back", "author": "Kiefer S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-11-19", "description": "Isn't it a bit unethical for Mia's Bakery to sell you semi-soggy lobster tails at 3 in the afternoon?  They should either keep them fresh by making small batches or not sell you one when it is already stale.  Dislike!", "author": "Luk L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-13", "description": "Best cheesecake I've ever had! Needs good coffee to go with it though. Dine-in section feels a bit Nanna-ish with tunes to suit, but the cake compensates", "author": "Liam R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-08", "description": "Amazing pastries. Red Velvet, black out chocolate cake, and chocolate ganache, not to mention the banana pudding.  All awesome!   Only took", "author": "Roxanne M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-17", "description": "You walk in and are blown away by the display of sweets! SO.MANY.CHOICES!!!\n\nI have been twice and tried their apple pie, blackout cake and 7 layer cakes and all were delish. This is a welcome bakery in the area. They have a nice seating area and everything is fresh.", "author": "CB H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-01", "description": "Vanilla bean was sooo thick and creamy. I will definitely be returning to try other desserts.", "author": "Alyssa C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-05", "description": "This place is AMAZING... \nStrawberry short cake - phenomenal- manager greet u as you are his family every Time i go in.... 5 stars!!!! So glad they are in the neighborhood !!!", "author": "Joe L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-27", "description": "Cool bakery. Best canoly ever!!! The cream is fresh and taste like heaven they prepare the canoly once you order that is good service", "author": "Alexis R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-04", "description": "This review is from a year ago which I forgot to post - Came here to work in the back area of the cafe (which is real spacious and clean) and found a small shard of glass after biting into one of our pastries. When we informed the workers, they immediantly refunded our purchases and gave us a whole pie free of charge! Great service and a misfortunate accident that hopefully won't happen again.", "author": "Jilly K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-04", "description": "Mia's is the best bakery downtown Brooklyn has at the moment. \nLove the strawberry shortcake, cup cakes are delicious and the service is great.  This is my go to bakery for all my family occasions.", "author": "Maggy M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-19", "description": "Have eaten dessert here two nights in a row- Fruit Napoleon is as good as advertised. Staff are fun and eager to help you- thee is all kinds of treats: coffee bar, gelato. You can't go wrong stopping here.", "author": "Bryant P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-28", "description": "We were looking for a place that makes great Napoleon's and we found the best place so far. The fruit Napoleon has a perfect cream and a perfect crust. \n\nThe canolis are a bit dry and have too much chocolate.", "author": "Loucy R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-04-07", "description": "I was extremely disappointed in my cupcake. There are some deserts with more moisture. Unfortunately, this is just another generic bakery.", "author": "Nicole J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-30", "description": "Today was National Cheesecake Day. I was planning on going to Juniors in Brooklyn to get a slice of cheesecake for $3.00. The weather was horrible and I didn't want to get caught in the rain so I decided to give Mia's Bakery on Smith Street a chance. The staff was very welcoming and the bakery is beautiful inside. I mentioned when I walked in that today was NC Day and that cheese cake slices are $3.00. They weren't aware of the holiday however they were kind enough to sell me slices for $3.00. I bought 4 and was given a free one. I bought one of each kind. They were all really good. They aren't as large as Junior's but are very tasty. I'll be back!", "author": "Keisha P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-01", "description": "Definitely my favorite spot in the neighbourhood when its time to indulge in some sweetness. I love their cakes, tried a few but always go back to the Carrot cheesecake. The coffee is really good as well, they brew Brooklyn Roasters Company. Love this place!", "author": "Ma L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-24", "description": "A delightful, family friendly experience.  It was our first visit and  they made us feel right at home.  There  are  no secret codes or insider words. Just friendly service and great selection.", "author": "jim r."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-12-15", "description": "This is for the strawberry shortcake cake...\n\nSadly, it was too airy(?), so it was brittle when you took a bite. There wasn't flavor to the cake itself; the strawberries were nice and sweet, ofcourse.\n\nI was hopeful upon entering the bakery...the place was lovely and clean...the attendant was kind and helpful...but the cake was disappointing. Hopefully their other goods are yummy, but I'm not sure I'd go back...", "author": "Joy S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-09-26", "description": "Ordered a cake from here during the 2017 winter time for my sons birthday which i pre-ordered. When I arrived they told me they had no more bags to hold the cake, after watching customers walk out with bags. The sidewalk was encrusted with slippery ice. I asked if they had anything and expressed my concerns. I didn't want to perform a balancing act while holding a cake box. The manager walks over, whispers something into the ear of the nice woman who helped me with my order from start to finish. If you are going to charge $40 for a cake, dont make your judgement on people who come into your store so obvious and force your employees to comply. I happened to make several stops on smith street and as I passed by MIA's again, there are customers walking out with bags again?!?!?!?, this was 15 minutes after i had left. Sure enough the worst happened , balancing act came to a halt as i succumbed to the ice on the sidewalk around the corner. The cake was beyond repair, but i was more concerned about my ankle. Had family pick me up and take me to a local Urgent Care. Got back to the house. My son looks at me and says, dont worry dad, I love you, lets go hands in on this cake!. It was a unique moment despite the pain in my ankle and anger I felt toward the establishment. Some of these new places do not know who people are in the neighborhood. The cake was pretty good, but neither I or the two dozen others who responded to me when I had the accident will ever order from this place based on the merit of MIA's poor management and customer interaction. I had cake, I ate it too, and you get a 2 for stereotyping 1.", "author": "Sean D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-06", "description": "I'm not a big fan of sweet but I do like this place. Trendy decorations with delicious desserts! The sweetness is not too much which I really like! They have a cute garden at the back i'm sure it will be very nice to come here in the summer time too!", "author": "Akira N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-21", "description": "Love this place. Banana cream pie is delicious. I've ordered from there and have eaten there as well, haven't been let down yet.", "author": "Sultan M."}], "servesCuisine": "Cafes", "priceRange": "Under $10", "name": "Mia’s Bakery", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "139 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/SM4ZOzR354iQi9Xvf1b68g/ls.jpg", "@type": "Restaurant", "telephone": "+13479873194"}