{"aggregateRating": {"reviewCount": 572, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-22", "description": "I am so glad I stumbled upon Mia's a few years ago.  A friend of mine introduced me to their cupcakes and from that moment I was hooked.  They have two locations now and I am partial to the Brooklyn location, where the magic started\n\nThey have all sorts of amazing desserts including their infamous cronut, cheesecake, macaroons, and their chocolate cream pie.  I recently tried their creme brûlée cupcake and OMG it is so delicious.\n\nIf you haven't had the opportunity to go here, you have to go ASAP!  They have a beautiful backyard too, so you can sit and enjoy the weather and savor every bite of that decadent cheesecake, pie, or quiche!  I'm telling you, you won't leave hungry!", "author": "Morgan R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-20", "description": "So many desserts to choose from! I only got one, the Nutella cronut, and it was so good!!! It was $4.25, I think? \n\nLots of seating area, including tables outside. The people working there were nice and friendly, and their bathroom was also clean. \n\nGreat place! Looking forward to going back and trying more.", "author": "Dani F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-05-08", "description": "First time I tried anything from here was from my birthday, I had gotten 6 cupcakes or so.\n\nThe red velvet was pretty good and so was the Oreo I believe.\n\nFast forward to a few days ago.\nI got the carrot cake slice - was very unimpressed- there was too much frosting and barely any cake.\n\nThe tiramisu was okkk, there was just something missing from it that wouldn't let me call it great/ wouldn't make me reorder it\n\nThe pecan pie- I've never had pie before but it was nutty and delicious and I loved it!\n\nI would definitely recommend going back and would go back because there's soo much to try and I'm sure I would find something I like!\n\nI wish I had taken pictures but I inhaled my cake as soon as I got home and plopped myself on the couch! Hopefully next time.", "author": "Mirabel I."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-04-07", "description": "Bakery was full of customers! Very busy, but the service was still really good and attentive! Yay! \n\nBecause the weather was so nice we decided to grab an outside table in their backyard haha. the outdoor area had about 8 tables. The nice hostess brought us to the back, and then a waiter later came with the menu to take our order. The menu had all the sweets listed that were in the display case, and drink menu. \n\nWe had the Oreo sliced cake - and it's not hype, it was very good! I'm impartial to Oreos, but I actually really enjoyed the cake! It was moist, and good ratio of cream to cake. The cake was a little dense but ok, but maybe that's just the style of this bakery. \n\nHad the iced chai latte: and the flavors came through well, and good level of sweetness. Enjoyed it a lot with the cake!", "author": "Heidi C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-03-29", "description": "Very cute and romantic local cafe/bakery. I can imagine that this would be a super nice spot to check out during the summer with their patio in the back which allows for outdoor seating. The seating isn't as compact and tight as Martha's is. At Mia's, you have enough wingspan space (thank god). \n\nThe menu wasn't overwhelming at all. We had an order of the strawberry shortcake slice and a tres leches cupcake. I liked the strawberry shortcake - very light and fresh and very comparable to Martha's slice. On average, 5/5. \n\nThe tres leches disappointed me a bit, I found it to be saturated with a little too much nutmeg and cinnamon, though others might disagree. Their coffee on the other hand, is amazing! Definitely woke up with just a few sips. \n\nWorth a visit if you're in the area!", "author": "Hamala N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-23", "description": "This is such a great bakery for delicious slices of cake. I found the cake to have the perfect balance of cream and cake. The cake was dense and the cream was perfectly sweet. The place has so many options, there's definitely something for everyone.\nThe service here is also fast and friendly.", "author": "Wonjin S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-03-09", "description": "This is probably the best bakery in the NYC area to get layered cakes for birthday parties or other celebrations with a group of loved ones. The cakes are huge, delicious, reasonably priced, and there are so many options to choose from! \n\nAlthough I have not yet bought a full cake, I have tried a slice of chocolate mousse cake with caramel. Although it was huge, I did not feel heavy after eating it. The cake layers were moist, the balance of cream vs. cake was perfect, and neither cream nor cake were too sweet, which really helped bring out the chocolate flavor. \n\nI was not a fan of the caramel cronut, however. It tasted way too sweet and plastic-y for my taste, to the point where I couldn't swallow and had to toss it out. I would definitely come back for the cakes, though, and look forward to trying their other pastries.", "author": "Nataly N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-11", "description": "When I went to Mia's it felt like I walked right into dessert heaven! It was so hard to decide what I wanted!! So as usual I ended up ordering more food than any single person should! (no regrets!) \n\nFirst I had their Nutella Cronut.. which omg was delicious!! I LOVE NUTELLA! \n\nI also had their salted caramel cake which was so good! And their Oreo cheesecake!\n\nI also got to taste their coconut cake (which was probably my favorite of all the cake slices!) and their salted caramel cheesecake (which was good but the regular salted caramel cake was def better!) \n\nWith so many options on their menu, I can't wait for my next visit to try a bunch of different things!", "author": "Ashley M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-05", "description": "Can you say SWEETTTT HEAVEN! \n\nRows upon Rows of sweets! It's like walking into Willy Wonka's Factory if he had a bakery section. Actually it reminds me a lot of Martha's Country Bakery but it's in a different area so hopefully they both play nicely ;). \n\nWe had the tiramisu and the Nutella croissant. I had an iced chai latte. To be honest the chai latte was a little underwhelming. But that was quickly made up by from the Tiramisu. Of the two treats, the Tiramisu..took the cake. Okay, dad joke. I'll stop. But really, the balance of the not too strong coffee flavor and not too sweet mascarpone layers was spot on. \n\nCame on a busy day but did not feel like it was too cramped. Def will stop by again if in the area!", "author": "Helen C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-05-10", "description": "Let me start of by saying the hostess is the sweetest guy ever. He was so smiley and sweet I really think he should be promoted to manager. He asked if it was our first time here and really tried to make sure we were ok! I've been to Mia's as a \"vegan\" and a \"non vegan\" and my experience was at about a 4 not being vegan so I'll leave it at that. I love there Greek frappe especially with almond milk. I hated there Vegan hazelnut cake or tart whatever you call it. There regular cheesecake was one of my favorites. The apple pie is also good. The vegan cake was SO DRY and you could tell it was in the fridge to the point of death as it was so hard and Dry it lost that smooth gooey texture. If your a vegan this wouldn't be my first choice. I like the outdoor seating and the staff is so friendly and patient. I also think 2 people can SHARE ONE SLICE OF ANYTHING AS THEY ARE HUGE. Most things are very sweet so be mindful. Not sweet as in oh sweet desert but super sweet. I would come back.", "author": "Marlena K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-30", "description": "Cute space with outdoor seating for the warmer months.\nStaff is friendly enough and the cakes we ordered were rich and delicious. Highly recommend the coconut cake and the caramel mousse. Oreo cheesecake was also really good but kinda heavy.", "author": "Nadia S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-01-30", "description": "I visited here for the first time looking for the infamous Nutella cronut. Turns out they run out really fast lol! So don't go at 8pm hoping to get one. \n\nInstead I had to \"settle\" for a chocolate cronut, which was DELICIOUS. It was very decadent, shape of a donut, consistency of a thicker croissant. The place had standing room, lots of food options, and also drink options such as coffees.\n\nI went with a few friends and we all ordered different menu items!\n\nPro tip - come early for the infamous Nutella cronut! \n\nService is quick, friendly, accommodating!", "author": "Keval R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-29", "description": "I just moved to Brooklyn about 4 weeks ago and I've come to Mia's bakery more than 10 times; always take out. This is just my opinion so far: \nhighly recommend (8-10/10) \nNutella cronut, Mixed fruit tart, Crême brûlée cupcake, Oreo cupcake, Strawberry short cake,Strawberry banana cupcake, Salted caramel cake, Fruit napoleon, chocolate mousse cake, banana bread pudding, chocolate with marshmallow macaron, rose lychee macaron, creme brûlée macaron, and Tiramisu cake.\n\nI'm not a fan of rainbow cake, strawberry cronut, and green tea macaron.", "author": "Tina T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-03-31", "description": "On our way back home to Queens, we stopped by this place that seem to garner highly decorated reviews on Yelp.  People posting delish pics left and right that we just had to try this place.  Ok first impression, wow they have a ton of variety when it comes to baking goods.  She compared this place to VENIERO'S down in the village just in terms of the options. My wife felt it was too much and they should have kept the options fewer.  She did admit there were a ton of gluten free options which peaked her interest.  My son got the rainbow cake which he felt it was just so so.  Nothing out of this world or anything.  My wife got the chocolate hazelnut gluten free, and some GF single cookies.  She said she had better elsewhere and that the GF cookies were better than their GF cakes.  All in all, they give this place a 3 stars.", "author": "Kevin C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-28", "description": "All I can really say about Mia's Bakery is WOW. We came here during the week around 8pm for a couple of cronuts that we've been seeing all over instagram for weeks. When we walked in, we saw that they only had 1 single cronut left and it was coconut flavored, something that would not have been my first choice but I had to have it. The cronut was amazing. Honestly comparable to Dominique Ansel. I now know that I have to come here first thing in the morning to get my hands on the other flavors of cronuts. Also, $3.25 for a Cronut! Great price, great Cronut, well done\n\n\nGlad I found this place.", "author": "Eli B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-25", "description": "Cute little bakery in BK! The prices were so reasonable I think we got a huge frapp and a burnt almond cake slice and turned out to be only $12. There's so much space and a outside back patio situation that's so cute for the summers. We were there on a Saturday at around 4 and there were a decent amount of people! \n\nService here was fantastic and the servers here were so kind! I'd recommend getting the burnt almond cake because it was nothing like I'd had before! Definitely worth a try and it's different! \n\nI took a peak at the whole cakes and those prices were also very reasonable as well!", "author": "Sandra C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-03-17", "description": "This place's cakes were SO MUCH. I'm almost aggressively typing as I recall how wonderful it was to scrape my fork down from the pecan and caramel cover down the wall of cheesecake and take it in for a bite. WOWW. \n\nThe blackout cake's chocolate is also something ELSE. It's a fluffy, beautiful chocolate pudding thing that can be emotinoally overwhelming.\n\nAnd then you combine the two cakes that you and your friend got and your life is never the same.\n\nCustomer service also gets a bonus star here. When it was a rainy night and we called to see why our order was late, the guy at the store took the time to call me back a few minutes after I had hung up to deliver the happy news that our cakes had finally been picked up by a driver!\n\nA very small gesture, but it totally added a bit of humanity to this place for me.", "author": "Nancy H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-25", "description": "Delish. Everything looks decadent and inviting. From the petit fours to the croissants and bread not on display, you can tell this place turns over their baked goods like no one's business. The hardest thing was deciding which 2 items to get. \n\nAfter much deliberation and 10 minutes of ogling I decided on a slice of the banana and the chocolate pudding. Encased in a 2 inch high whipped cream, you can see the bananas in the egg white vanilla cream and the chocolate just looks like a hunk of solid ganache. They were wonderful and so different. The crust was light and buttery maintaining a bit of crumble- the banana was so good!", "author": "Elisa H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-02-14", "description": "This is one of my fav bakeries even though I live in Queens.  My boyfriend wanted to surprise me for Valentines Day by getting some yummy treats for me.  He introduced me to this bakery ...he has been there plenty of times. \n\nHe did tell me there was an extremely rude young lady...he described her as a young ...maybe Hispanic girl that was rude.   When he walked in....she said ...What to you want.   No good morning...no how can I help you...no smile.   Being that it was Valentines Day he wanted something special and said he wasn't sure and wanted to look at the display.  She huffed at him and rolled her eyes.  Seriously?   She also huffed at him and rolled her eyes when he asked her to put the treats in a small box instead of a clear plastic container.   This is how you treat customers?\n\nManagement  ...if you are reading this please train your staff better.  This soured my boyfriends mood and turned me off too.   I like your cakes a lot but this girl needs an attitude adjustment.", "author": "Carla L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-05", "description": "I got the layer chocolate cake for my dad's birthday. Ordered it over the phone and picked it up same day. The staffs are super friendly and helpful. The 8\" cake fed our party of 12 just right for about $50.", "author": "Florence V."}], "servesCuisine": "Cafes", "priceRange": "Under $10", "name": "Mia’s Bakery", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "139 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/SM4ZOzR354iQi9Xvf1b68g/ls.jpg", "@type": "Restaurant", "telephone": "+13479873194"}