{"aggregateRating": {"reviewCount": 572, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-14", "description": "Wow, can I just try everything? They have a great selection of all things sweet - cake pops, cakes, cupcakes, cookies, macarons, macaroons, cheesecake, and more. Towards the end of the displays, they have the prettiest vegan baked goods I've ever seen. \n\nThe staff was super friendly, and they've got a lot of seating options both inside and in the backyard. As for our desserts - they were pretty good. We got the coconut cream cupcake, salted caramel cupcake and the canookie (cannoli + cookie). While the canookie was good, I think I would've been satisfied with even just the cookies.", "author": "Michelle B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-23", "description": "Really helpful staff! The barista doubled as pastry helper and helped me get my order together. Ordered a bunch of random items, but only got to try  some of the cupcakes. The cake parts are not crazy sweet, light and slightly chewy (which I love) so it's not super crumbly.  The frostings need a little more oomph because they didn't taste *quite * like the intended flavor. All were good, but just not exactly what I expected. \n\nAlso checked in and scored a free coffee. Thank you!", "author": "Doris C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-03-01", "description": "over rated. not worth it. pasties did not taste fresh, coffee not hot and service not good. Actually they were a bit rude", "author": "E H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-03", "description": "Great service and experience. I got the Lemon Bar (only $4.50!) and it was slightly tart and slightly sweet - the perfect balance. The cream on top was lemon-flavored, which was pleasantly surprising, and the caramel drizzled on the side really complimented the tart chewy part of the bar.\n\nI also got the protein egg muffin, which was more like a little fried omelette with pieces of broccoli inside, and the Brew of the Month coffee, which was quite good.\n\nI will definitely be coming back!", "author": "Stephanie M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-15", "description": "The brownie I had here was delicious and moist! Will be coming back to sit outside \u0026 eat tasty treats !", "author": "Eva T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-31", "description": "Got a chocolate chip cookie. It was ok, I wouldn't get it again, but the rest of the deserts look super amazing. I will come back for a more delicious treat next time I'm in the area.", "author": "Jenny B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-27", "description": "The most OVER-RATED bakery in New York and I am serious. I tried about 7 different items from this bakery including cakes and trust me I do not ever want to go back to this bakery again.\n\nNo offense but I do not know what kind of people give this bakery 5 stars, I am sure these people have never tasted real cakes and pastries.\n\nSave your time and money and find another bakery. Stuff tastes average here and their prices are touching the sky, ridiculously high prices for a bakery with such an average taste.", "author": "De U."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-19", "description": "I happened to walk by this place without the intention of getting a desert but because the cakes were appealing I said why not. It was a great decision. I tried the tres leches and the strawberry cronut so delicious. I can't wait to try the other things. This place is also super cute for a date!", "author": "Racquel N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-23", "description": "Best cakes in New York \nEverything is always fresh never too sweet \nAnd you get a bang for your buck \nDefinitely going back", "author": "Melissa S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-14", "description": "Came here after dinner to grab a quick dessert.  They had so many selections that me and my wife didn't know which one to pick.  They had everything gelato, cheesecakes, and cupcakes.  The display made it so attractive and I just wanted to try everything. \n\nWe settled on the toasted coconut gelato on a waffle cone.  It was a little bigger than we expected.  The coconut flavor was not too overwhelming and tasted homemade.  \n\nWill definitely be back to try some of their cakes and cupcakes.", "author": "Jason L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-03", "description": "Best strawberry shortcake in NYC! I drive an hour and a half to get there because its so worth it!!", "author": "Loevy A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-23", "description": "I was craving dessert, but ended up getting SEVERAL desserts (there was a minimum to make for delivery too) and ordered the chocolate chip cookie, banana pudding, coconut macaroon, chocolate fudge cake and brownie. The pudding was super sweet, but good. The cookie? DIVINE. Honestly I was in dessert heaven, and I definitely have to make my way to the store some day.", "author": "Shu Jin S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-11-05", "description": "Came here with a colleague to pick up some cupcake for a birthday. The cupcakes were good, but not worth the price in my opinion.\n\nCall ahead to see what they have in the store because what is advertised on their website might not be at any one particular location.", "author": "Qualiyah A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-31", "description": "Absolutely the BEST bakery! I came from Miami, FL with my mom for her birthday and we were recommended Mia's Bakery by the staff at the Holiday Inn in Downtown Brooklyn. I decided to surprise my mom after a long day of sightseeing to an Oreo cupcake and two cannolis, they were so fresh and delicious. I loved the cannolis texture so creamy and crispy. I had to order through Postmates and added a small request to see if they could include a candle and let me tell you how over the top they went. It was stellar customer service; they wrote out happy birthday and included three candles. It was such a beautiful gesture and cannot thank them enough. My mommy was super happy and loved it. It's small gestures like these that go a long way and I thank Mia's Bakery for going above and beyond! Thank you!!!", "author": "Cynthia C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-17", "description": "So happy to have stumbled upon this joint, great addition to the Smith St. neighborhood. Display is beautiful with tons of cakes and pies. They carry basically every dessert/pastry- babka, rugalech, biscotti, cakes, cupcakes, muffins, ice cream. \n\nI got the blackout chocolate cake and it was moist af. Soso good. Buttery, chocolatey, and delish. I came pretty late at night and so I feared the cake would be dry-this was not the case. Unlike literally any other bakery I've ever been to, this place is open until 11pm!!! Big + for my baked good cravings. Everything baked in house! Cute lil patio outside+nice and helpful staff.", "author": "Pauline M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-01-09", "description": "It was awful accident. We ordered 01/03/18 cake for the wedding day for 01/04/18. Payed 100% for it and Kept our contacts. But 01/04/18 the bakery was closed and no one answer what is happened. When we came to the bakery 01/05/18 no one was sorry for that. They promised to call us back and return our money. No calling, no returns! Think about that when you will visit this place. What they can produce in that bakery with that service.", "author": "Nelly K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-03", "description": "Decisions, decisions! Lots and lots of great yummy deliciousness staring at you calling your name. Cute little spot to sit down and have dessert. Cakes, cookies, gelato, pies, creme bruelee. You name it.  Huge variety.  I ordered a cappuccino with almond milk. Very strong cappucinno but it's good. You actually feel like you're drinking something and not just some hot liquid.  My friend and I ordered and split the burnt almond cake. Delish. Very yummy. Only down side is they should have more help on the floor to wait on their patrons. Otherwise, I would definately return and try more deliciousness.", "author": "Heather L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-19", "description": "Yum yum! Ordered a few pieces of cakes to go! Fruit Napoleons is a killer. And as a bonus they are open late on weekends.", "author": "Shirin P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-15", "description": "Love this bakery and they keep it simple. There's not a lot of ultra-complex, seemingly odd combinations that just work.  They don't stray too far from the classics, but their execution is spot on.  Their wheelhouse is cakes (cheese and regular) and pies.  They do a great job of turning traditional cakes and pies into cheesecake like their apple (pie), red velvet and carrot cake cheesecakes.  All three are great.", "author": "Randy H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-03", "description": "Created a yelp account just so I could say how great this place is. Good dessert, friendly staff. Highly recommend.", "author": "Erol C."}], "servesCuisine": "Cafes", "priceRange": "Under $10", "name": "Mia’s Bakery", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "139 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/SM4ZOzR354iQi9Xvf1b68g/ls.jpg", "@type": "Restaurant", "telephone": "+13479873194"}