{"aggregateRating": {"reviewCount": 572, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2019-03-05", "description": "I was super excited to try Mia's, but I think the desserts that I would love is a case by case scenario since there were a few items that I did not get to have because they ran out, specifically referring to the creme brulee cupcake. \n\nYou're welcomed to the store with refrigerators lined up with desserts, everything you can practically think of. We had a great selection of the many desserts which included the favorites: black forest cake, strawberry cheesecake as well as the mini cannoli, pecan caramel cheesecake, berry pie and iced coffee.\n\nThe cheesecake is definitely not as light as many places so it is a bit dense, which I think is the issue for me because I don't like eating plain cheesecake and would like my slice to have more topping. The black forest cake was chocolate-y looking, but not chocolate-y enough for me because I have a super sweet tooth so it was a little of a let down. The berry pie was definitely the table's favorite item, but it is definitely recommended to have it warmed up! The mini cannoli is piped fresh so it leaves you with a crunchy shell and a lot of mini chocolate chips which was my favorite item. \n\nMia's is a great place to have a conversation with friends, especially when the weather is warmer with outdoor seating. I would definitely give it another go, in hopes to a great cupcake and even try out their cake pops and cookies next time.", "author": "Cindy U."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-05-25", "description": "The service is really great here, cute little bakery with TONS of choices! My husband loved his fruit tart. I got a mini canoli which was excellent, a latte which was excellent and an Oreo cupcake which was kind of meh.", "author": "Christine B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-27", "description": "My friend said we have to try Cro-Nut while we are in NY! She found this gem which has good review. I'm just doing review for Cro-Nuts! We bought 7 flavors-Strawberry, caramel, Nutella, Coconut, Vanilla, Cinnamon, Chocolate! All so yummy! Crunchy and soft inside but not too sweet! Worth our walk from our hotel!", "author": "nette b."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-07", "description": "I don't understand why Mia's bakery continues to make delicious desserts that I can't resist. Next time I'm going to demand to speak to a manager because this is ridiculous! Loll \nThank GOD I live 40 mins away and cant come here everyday because I have NO self control when it comes to this place. Have you ever done the happy food dance while eating because the food tasted so good? And you  start humming while licking off the fork?!? Yup that was just me as I literally INHALED the strawberry shortcake and caramel cronut I bought this afternoon. \nThough the options are a lot I can guarantee you that you won't go wrong with anything you try.", "author": "Liz H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-16", "description": "It really doesn't get better than that!\n\nI went to buy a custom-made birthday cake. I asked and tried two of the flavors (chocolate mousse and another layered one, with peanuts in one of the layers), both were excellent, I didn't know which one to pick!\n\nService was very friendly, and I started chatting with the owner, who is a very nice guy!\nIn the end, I picked one of the two (I had to!), and I was very happy with the quality.\nI later came with friends and tried the savory choices (spinach pie and chicken pie). We were blown out by them too! Excellent taste and quality! (and very reasonable prices)\n\nThere is a very nice outdoors patio at the back too, to sit and relax.\n\nI consider myself strict when it comes to reviewing food places, but I recommend Mia's anyday, anytime!", "author": "Marios G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-09", "description": "The only negative thing I have to say about this place is that I'm upset I hadn't found it sooner!! After getting the rush along out of dinner, we looked for a place with dessert and came upon Mia's. We're so happy it was open till 1 am! \n\nWe got the Oreo cake and a chocolate milkshake. The cake did not disappoint!! It was fluffy and light and the cream was tasty! I was worried the cake might have that have tasted fake and sugary because it was so beautiful, but boy, was I wrong. It was excellent. The milkshake tasted like a frozen hot chocolate. It was blended to perfection. I wanted to get another slice for home!\n\nWe're seriously considering getting Mia's for our rehearsal dinner!", "author": "Nicole M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-23", "description": "5/5 experience. The cronuts are out of this world, incredibly moist and flaky. Exuding coconut \u0026 strawberry flavor through their icing...and look at how BEAUTIFUL that strawberry one is!\n\nThe tiny nutella almond cookies are dreamworthy...deeply flavorful and texturally perfect. \n\nOnly negative, parking is a nightmare...", "author": "Julianne M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-03-23", "description": "This coffee and sweet shop tries to emulate Martha's country bakery. We came here for some dessert after having dinner nearby. My girlfriend ordered a cronut while I had their heavenly brownie. The brownie was sweet and rich. I had some ginger tea alongside the dessert. I wished they had some more varieties of tea. All in all, it was a nice experience but I'd prefer Martha's.", "author": "Joseph T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-13", "description": "Another great find....... just want to say thank you to my fellow Yelpers for this one .....\n\nWe were in the area having an early dinner at my wife's favorite BBQ joint The Dinosaur BBQ ( she wanted BBQ for Valentines Day we celebrate the day before we are in food business \u0026 we know the deal... between the limited menu's the service \u0026 the crowds trust us give it a try.) \n\nWe never have desert at the BBQ joint so we yelped for a cake spot.... 2/13/19, found a parking spot on Bergen Street in less then 5 minutes around 5:30 pm ish the counter was busy but we were sat immediately maybe two or three tables....\n\nGreat spot for two, four even parties of six inside seating as well as an out side garden for when the weather is nice..... \n\nOur waitress Maria was very friendly and made good suggestions based on what we like; the coffee medium roast was delicious and hit the spot; FYI, they do give a refill cup for free ..... \n\nWe had the Red Velvet, Coconut Cake \u0026 the Pecan Carmel Chocolate Cheese Cake ...... everything was so fresh and amazing .....\n\nO, we also shared a Coconut Croissant Donut aka the Cronut  .... we heard of theses but wow if you never tried one it should be on your bucket list ....\n\nVery large selection of cake slices and everything else you could possibly want; huge selection of cupcakes, cookies \u0026 pies \u0026 so much more .........\n\nWhole cakes were flying out the door you know everything is fresh .... by the time we were enjoying our cake the seating area was packed \u0026 the counter was slammed .....  \n\nI will definitely return again and refer my friends \u0026 family to this bakery as well .....\n\nHat's off to the owners, bakers \u0026 the entire staff !!\nKeep up the good work !!!\n\nThanks,\nGreg D \u0026 family .....", "author": "Greg D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-04-21", "description": "I tried this place for the first time today after hearing such amazing comments from friends. There are plenty of tables and an outside area which is nice. The hostess found a table for my large party to sit at amongst the crowded space. The pina colada and my latte was very tasty. All of their non-coffee drinks are not fresh which is unfortunate. The juices come pre-made so be aware when you are ordering because for the price, I assumed they would be fresh not from a box. \n\nThe service was extremely delayed and our server ended up bringing us the wrong cake order. I am not sure if there was more than one server on the floor but there should have been been at least two so that the service was not so slow. \n\nWe ended up keeping the cake anyway and it was extremely delicious. I will be coming back during the warmer months to sit outside and try another dessert item.", "author": "Jae I."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-07", "description": "Mia's is a great bakery in Brooklyn, NY! They have a great variety of treats! I must say the macaroons are to die for!!!! My favorite is the coconut macaroon! But they also have delicious cupcakes and cheesecakes! Then, the best part is you get to eat it right at the restaurant! They also sell coffee which is a plus being that it is near so many great shops and salons!", "author": "Cheyenne R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-07", "description": "I could have totally walked to Mia's as it's a short distance away, however my couch had different plans. I'm from the west coast where ordering dessert isn't so common.... this experience changed everything.\n\nMy mom makes the most amazing banana desserts with our over ripened bananas. I've been craving one of her desserts but being 3,000 miles away made me resort to researching local bakeries.\n\nI was happy to see Mia delivers and ordered the banana pie, however the blueberry cheesecake caught my eye. So I added an order of the cheesecake with the blueberries on the side. At times, people tend to overdress desserts. Yes... I'm a girl who isn't afraid to order than one dessert. \n\nThe order came quickly and I was pleasantly surprised to see a note from the bakery stating the blueberry cheesecake already comes prepared with the blueberries on it. I appreciate that they let me know instead of ignoring my request - I also loved the hand written note from whomever you are- both desserts (I took a bite of each) are delicious. My only qualm is that the crust for the banana pie could've been cooked a bit more, other than that, Mia has me excited.", "author": "Hinda E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-08", "description": "Cakes and coffee and cozy feelings all around!\n\nOrdered a coffee with almond milk and a cronut with cinnamon - it was absolutely amazing. I ate the whole thing. Plus the coffee made me feel amazing. I'm pretty sure they bake everything in house and there are tons of options - even whole cakes!!\n\nIn the back is an outdoor garden area which is closed during the colder months but when it's nice outside it's a great place to hang with a friend, relax or bring a computer and work.", "author": "Naomi Z."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-26", "description": "This bakery is a just try if you are in the area!!!! The salted caramel cake is just amazin I mean it's not too sweet, and it's so fresh. I also got the nutella cupcake but the cupcake wasnt as fresh as I thought it would be, but it is very tasty.", "author": "Duvesh N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-18", "description": "Thank you so much for saving my ass yesterday Mia's Bakery! I was in charge of my cousins wedding and that also included getting a wedding cake for her. After putting in a request for a custom cake through someone who ended up completely just forgetting about me when the day came for me to pick up the cake yesterday, I was in serious panic mode. It was 1PM and our small wedding banquet dinner started at 6. As I was desperately searching on yelp for a bakery that would possibly take a last minute cake request to make it within 4 hours... Mia's Bakery suddenly crossed my mind. I've always loved this bakery especially for their cakes and frequented it a lot when my partner's vape shop was nearby. I called them and they told me to send an email of how I wanted the cake to be like so they could see if they would be able to help me. They answered my email right away, with the same manager I spoke to on the phone... and viola to my rescue they've worked their magic for me! The cake was absolutely beautiful when I picked it up, just how I asked for and the red velvet was tasty! Highly recommend Mia's Bakery, and when you do come here, get their strawberry shortcake and oreo cheesecake.", "author": "Monica P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-20", "description": "Really liked this place a lot. Bakery on one side and coffee station on the other. Extremely customer service oriented. We were seated at our table and handed menus. The kids were very excited about the desserts so they couldn't really choose. No worries, the manager and waitress were very patient. They fawned over their cake pops while I enjoyed a very satisfying Americano. Will be going back.", "author": "Dae D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-11-27", "description": "Mia's is one of my favorite spots to grab dessert in Brooklyn. You can either take something to go or eat in. My favorites are the strawberry shortcake and the bread pudding. I can't wait to try other items like the key lime pie and apple strudel. If you are in the area, and have a sweet tooth I would recommend stopping by Mia's Bakery.", "author": "Albert H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-11", "description": "I came across the famous Instagram page for Mia's Bakery and the photos made my mouth water. Basically, I knew I had to try 1 of everything. So a friend and I finally came in in late August. Walking in and looking at all your options is definitely overwhelming. I mean cupcakes, macarons, cookies, slices of cake, muffins, and croissant donuts, cakes, pies, etc. \n\nAnyways, on my 1st visit I got a slice of pecan pie which was delicious! My 2nd visit I got an assortment of 4 cupcakes for my cousin's birthday. There are plenty cupcake flavors to choose from so it was hard to pick just 4. On my most recent visit, I finally tried a slice of the rainbow cake and 3 French macarons (earl gray, creme brûlée, and pumpkin cinnamon). I also picked up a slice of peanut butter moose cake for my boyfriend. \n\nAll in all, I've never been disappointed with anything I've tried from Mia's. The earl gray macaron and the rainbow cake are by far the most memorable though. I'll definitely be returning because there are so many other things I want to try and since there are so many options it will take forever to try everything. They also have cakes and pies for any occasion. I saw they they had a plethora of options for the upcoming holiday season. \n\nSo needless to say, check out Mia's bakery. You won't be disappointed!", "author": "Candace H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-11-07", "description": "Once in a blue moon, your friend from another state tells you they are in town and would like to grab a bite at a bakery. You go to a bakery that you didn't even know existed and you swoon at all the delectable treats that you just cannot ignore from then on....\n\nThat happened to me this past weekend. I have walked on Smith street 1000 times and never really noticed Mia's Bakery. I am sure I've smelled the delicious sweets but it is not normally the stuff I crave. I walked in early saturday morning wanting it all. Full cases of cakes and pies and tarts! But first, coffee. We grabbed a cup of coffee and perused the small menu of savory items.  They unfortunately did not have any bacon for the egg sandwich which was shocking at 830 on a Saturday morning. It didn't stop my friend from ordering it but she said it would have been that much better with breakfast meat. I landed on the spinach feta pie. After a few minutes spent catching up, our orders arrived. I really loved the spinach feta pie. The flakey crust was hot and crisp and the filing was smooth and savory. It was so large that I barely made it through 3/4ths. We stuck around for a coffee refill and paid our relatively cheap bill of 10$/person with tip. \n\nOn my way out, I couldn't help buying a few treats to bring home to Chuck. A blueberry scone, Nutella cronut and chocolate babka later I walked home with approximately 15$ worth of delicious goodies. Chuck was grateful to get these without even leaving the house. If I ever have a craving for sweets I know where to go.", "author": "Erin P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-24", "description": "heaven on a spoon? the cherry on the cake? the peanut butter to my jelly? \n\nI drove an hour - thats how you know its good. An hour - in traffic, construction, crying baby and all. YES.\n\nThis bakery had a huge array of cakes, whole and by the slice, cookies, gluten free and so much more. The happy surprise here for me was a nice little sitting area with a small backyard garden.\n\nI first discovered Mia's as they sell their slices to another amazing spot, Sugar and Water in Astoria. But being that that spot is inconsistent with what they get and when they get it in regards to cake slices, I had to come to the source. SO WORTH IT.\n\nI tried the fudge slice - YESSSSS, the Mouse Slice, Strawberry short cake (staff recommendation), Burnt Almond,Peanut butter and a nutella cro-nut(?).\n\nI highly recommend the Nutella, and the Burnt Almond and the fudge slice. MY group of friends favorited the Peanut Butter Slice and the Strawberry Short Cake.\n\nListen - with so many options you will not be disappointed. YES YES YES for Mia's Bakery. My friends will be going for their birthdays now =) had a fan in me but now they have 4 plus 2 kids =)", "author": "Kathryn K."}], "servesCuisine": "Cafes", "priceRange": "Under $10", "name": "Mia’s Bakery", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "139 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/SM4ZOzR354iQi9Xvf1b68g/ls.jpg", "@type": "Restaurant", "telephone": "+13479873194"}