{"aggregateRating": {"reviewCount": 572, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-10", "description": "I was desperate for a last minute custom birthday cake. A friend recommended Mia's so I decided to sent a last minute request through the email form.\n\nI was surprised when Stamatis emailed me back immediately knowing that it was past midnight. Not only he answered all my questions but he promised me that the cake will look great and it will be delicious.\n\nWhen my colleague went to pick up the cake she sent me some pictures and the result was absolutely fantastic! And everyone who tried the cake loved it. The salted caramel cake had a perfect balance between the flavors of the vanilla cake, the chocolate cake, the cream and the caramel mousse. \n\nThank you Mia's for making my cake a huge success! Kudos to Stamatis for the excellent customer service and the recommendation!", "author": "Martina C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-29", "description": "Very cute and very tasty desserts. Prices are decent and overall a nice place. Service varies depending on times but it doesn't get too full. Its a small place so don't always expect immediate seating. I go here often and enjoy it.", "author": "Ama E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-01", "description": "The people that work here are very friendly and patient. They have a variety of options to choose from, which can be rather challenging for someone who's as indecisive as me. Your big treats are very good and very pretty. I also really like the decor of this place.  If I didn't live all the way in Queens I would frequent this place much more.", "author": "Cree P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-17", "description": "Folks I think I have a new favorite Bakery in New York. The display is fantastic and the aroma is indescribably good. I had a creme brulee with a caramel latte and both were well beyond my expectations. An absolutely beautiful decorum as well as a warm and friendly staff catapulted this to the top of my list immediately. I will definitely be going back and I can't wait to work my way through the menu because it all looks and smells so delicious.", "author": "Storm T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-24", "description": "Delicious bakery!!! They have every kind of dessert you can imagine. Boyfriend and I indulged on two pieces of cake. He got red velvet cheesecake and I got chocolate with chocolate filling. I was a bit skeptical because sometimes desserts look amazing but taste okay. One thing you can say about New York is food here is always amazing!! The cakes were out of this world! So rich and delectable. Such a great find in the heart of downtown Brooklyn. Nice staff too.", "author": "Kendra H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-24", "description": "Amazing shop and staff. I had the awakard pleasure of watching another patron complain that her desert was in the case next to a strawberry treat, the customer kept explaining she was \"highly allergic to strawberries\". The staff was patient while dealing with her silliness to the point of refunding her money. Now keep in mind this dumb idiot went to the display case picked a desert that she saw was next to a strawberry tart, ordered the desert, then has the audacity to complain that it was next to strawberries after eating half of it. The staff remained calm and even offered to contact EMS when she claimed she was having difficulty breathing. Far more patient than I would have been .I enjoyed the cookie sandwich with canola filling. The cupcakes my wife ordered were the red velvet, salted caramel, and nutella; they were all delicious without being overly sweet . Amazing place and can not wait to go back and sample more amazing treats.", "author": "Casey M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-13", "description": "Excellent pastries and hot chocolate. Some of the best hot chocolate ive ever had, however it was a bit inconsistent. My friends tasted different than mine. \n\nWe sat in the backyard terrace which was serene. Definitely recommend!", "author": "Ibrahim O."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-12-31", "description": "I had the raspberry and lemon tart. The tart shell was delicious, the raspberries were sweet and fresh, the lemon curd was not too tart but also did not seem as if it was curd, just a custard that was overworked and clumpy. I still ate it, cause for $6.25 I'm gonna eat it. My friend had the rainbow cake, last slice of the night it seemed, and she really enjoyed the moistness of the cake. The seven layers of buttercream frosting was a bit much so she scraped it off and ate the cake. Another friend has the carrot cake which was beyond dry. Don't get the carrot cake. The server was nice enough the take it back and gave her red velvet instead, which she seemed happier with. Mia's seems to be the dessert spot on a Friday night. We were lucky to get s table. Within 10 mins of us entering a little after 8 it was full. I wouldn't go out if my way to come here, but if you're nearby and want a sweet treat, this place does the job.", "author": "Nazeema B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-03", "description": "I've been to this place a couple times. It's conveniently located by a bunch of restaurants, so it's perfect to stop by for dessert.\n\nService : The staff is generally quite friendly and willing to answer questions or help you make a choice. \n\nFood : they have a huge choice of baked goods from cakes to cookies to cheese cakes. It is a cake person'a dram come true(or nightmare if you're trying to lose weight). I've previously tried their cheese cake and cookies. I tried a Nutella cupcake today and was quite satisfied with it. The cheesecake is excellent as well. I wasn't a fan of their cookie.\n\nDrinks : They have all sorts of coffees and teas.\n\nAmbience : the place itself is quite cozy. They don't have a lot of seating but I've never found it hard to get seating. They do deliver as well.\n\nI'll definitely go back sometime in the near future.", "author": "Subodh M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-09", "description": "BF and I really wanted sweets and decided to order this through UberEats. I have to say, not a huge sweets person--or a banana person but holy moly! The banana bread pudding (well, more like a custard) is highly addictive. 1) it's not that sweet, 2) it's super creamy without feeling too rich, and 3) it satisfies a savory's person's palate = win. \n\nWe ordered two other brownies as well but I don't remember anything spectacular about them. I think they just weren't as chewy as I'd like my brownies to be.\n\nGET. THE. BANANA. BREAD. PUDDING.", "author": "Sophia S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-19", "description": "Only place to go for any type of dessert you crave. Huge selection. I can't go out w my gf without her asking to stop for a piece of cheesecake. Then hear her say I never should have had that I'm fat.. lol at 121 lbs. girls your funny", "author": "Matthew M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-30", "description": "Great place to sit with friends and relax, cheesecake is to die for here! Absolutely lovely.", "author": "Pranay P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-14", "description": "I stopped in to get a last minute Birthday cake with same day's notice. They had a few on display with a few choices. I chose the Strawberry Shortcake...So glad I did! The attendant was sweet and knowledgeable. I was in and out within 10 minutes and so glad with my purchase. My family loved the design and taste. I will definitely be back ! \n\nThanks!", "author": "Elizabeth M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-17", "description": "5 f*cking stars!!!! This place is awesome and most importantly the cupcakes are so damn delicious! I went there on a Friday right after work, I expected the bakery to be uber packed but it wasn't which was a major plus. When I walked in I was surprisingly greeted by a hostess who asked me if I was staying or going (I didn't realize it was part café). I said no and headed straight for the cupcakes. Now.. I am super particular about cupcakes, there are a lot of people/places that claim to know how to bake them but they don't lol so needless to say I was skeptical. \n\nI ordered a dozen cupcakes - chocolate, vanilla, oreo, and red velvet. The cupcakes were the perfect size with the perfect amount of frosting on top \u0026 some were decorated with cute sugar dots on top. The girl who picked out the cupcakes proceeded to ring me up, as I looked at the cupcakes in the box I noticed that a few of them didn't have the same amount of sugar dots on them as the others did (again I'm particular) so I asked the girl to grab me different ones. Honestly.. I expected some push back from her mostly because there was a line building but she was super nice! She pulled out the entire tray and let me pick what I wanted :) that definitely earned her a tip from me.\n\nNow I had the cupcakes in my fridge for 24hrs before serving them. The night I served them was magical and the cupcakes certainly sealed the deal. I had the Oreo cupcake and my goodness was it good. The Oreo cookie on top was soft, the cupcake itself was moist, and the frosting was not thick but it was rich and creamy!\n\nBig ups to Mia's Bakery! I'll be back again.", "author": "Tabitha C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-24", "description": "Love their cakes. I'm not a fan of sweets but my co-worker gave me excellent reviews. I finally got to try their stawberry shortcake and it was delicious: soft, creamy, moist, not too sweet and fresh. I can't wait to try the others.", "author": "Alicia C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-28", "description": "They have so many options!!!! I have tried the chocolate cheesecake, Oreo cheesecake, and chocolate chip cookies. The Oreo cheesecake was one of the best slices of cheesecake I've ever had. I can say the same for the chocolate chip cookie. The staff is always friendly and make your visit pleasant.", "author": "Bailey A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-11", "description": "I came here on a Saturday afternoon to get a birthday cake to-go. I didn't order a cake ahead of time, but they had a nice selection of cakes to choose from. I bought the chocolate fudge cake. \n\nThe employee who helped me seemed rushed even though there were only a few other customers. That's probably why she spelled my friend's name wrong on the cake even though I wrote it down for her on a piece of paper. I also didn't like that she wrote the birthday message on a piece of inedible plastic, instead of directly on the cake.\n\nBut those are just minor annoyances that don't even matter really. The cake itself was perfect and everything I ever wanted in a birthday cake. It was rich and chocolately and addictive. If you're in the area looking for a chocolate birthday cake for somebody you love, I recommend this one!", "author": "Sarah R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-11-17", "description": "After a long day out running around I decided to relax and order in. After dinner I placed an order through yelp to Mias bakery to satisfy my sweet tooth. After an hour long wait, I called in to check on the ETA of my order, after all, how long should 2 cupcakes and a brownie really take? The woman on the phone was very nonchalant, placed me on hold for a whole 5 minutes which felt like an eternity only to come back on the line and dismissively say that the order never left, wouldn't be leaving due to no driver and I'd have to call grubhub to cancel it. These Aholes never had any thought to call me and inform me that the order couldn't be delivered after it was placed and payed for. Had me sitting around waiting for dessert that was never going to come. Very unprofessional. No courtesy and customer service. I wish I could say that the sweets spoke for themselves but I can't, and now I won't...ever.", "author": "Jen R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-02-08", "description": "I ordered four things from here. It's only saving grace was the blackout cake which was good. The almond cake was bland and filling tasted artificial. The banana pudding was room temperature when it arrived, which, is never a good sign for a creamy dessert. It also had two sad banana slices in it and tasted artifial, almost like caramel...Maybe someone burnt the sugar while prepping the pudding. And the worst offender, the under-baked cigar. See photos. The entire middle of the cigar was under-baked. Sad to see such high ratings for a 1 in 4 hit for this bakery.\n\nFollow up: one of the proactive owners contacted me and thanked me for my feedback. He was also honest about what is and is not artificial, and that he will follow up with his team. He even offered me a refund, which I declined, as his team did do the work to prepare and deliver my order. Feedback can always be useful be it positive or negative, nice to see the owner agrees. Great service is what makes customers return, so nice job.", "author": "C A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-24", "description": "Amazing cakes. We chose this place for our wedding cake and got rave reviews from our guests. Special thanks to Stamatis for his great customer care with me and my fiance (we exchanged plenty of emails, held calls and met face to face), very nice and professional individual. My favorite is the carrot cake and the burnt almond cake.", "author": "Amish G."}], "servesCuisine": "Cafes", "priceRange": "Under $10", "name": "Mia’s Bakery", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "139 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/SM4ZOzR354iQi9Xvf1b68g/ls.jpg", "@type": "Restaurant", "telephone": "+13479873194"}