{"aggregateRating": {"reviewCount": 572, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-26", "description": "Really nice place, they have outdoor seating and the owner is very helpful when selecting what to eat. Great coffee and great service.", "author": "Elina K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-26", "description": "Whether I'm sitting in for a coffee or grabbing a cake for a party this place always pulls through with delicious treats. Highly recommended.", "author": "Matt A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-13", "description": "We had the banana chocolate pudding and strawberry cheesecake. They were both delicious! It is hard to find a bakery where you can sit down and have coffee/desert but this place is great. They have a nice seating area in the back.", "author": "Guliz U."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-28", "description": "I really like the iced coffee here and at $4 for 24 oz it's the best bang-for-the-buck cold brew in the neighborhood (i.e. *comparative* value, not really outright value).\n\nThe almond croissants are also awesome!", "author": "Roger G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-12", "description": "When I say top notch, I mean TOP NOTCH. This bakery is amazing! I had been having a cupcake craving for a long time. And not just any cupcake. A real, well made one. I Googled \"bakeries near Court Street\" and came across Mia's Bakery. After being intrigued by the photos posted on Yelp, I decided to go.\nAm I glad I did! There were SO MANY selections of cakes, cupcakes, cookies, brownies,  etc. They even had cake pops! Though I had come specifically for some sort of cupcake, I found myself having a hard time deciding whether or not that was really what I wanted to get. After much speculation, I got an Oreo cupcake and a Vanilla Vanilla cupcake. The price was $5.80 for both. \nAll I can say is WOW. The cupcakes were PHENOMENAL, most likely the best ones I have ever had. The icing on the Vanilla one was pleasantly light, airy and not too sweet. There were also little crispy balls on the top, like what you would find in a Crunch bar. The cake itself was soft, fluffy and had a perfect amount of sweetness to compliment the icing. The Oreo cupcake...oh my gosh. Being a person that loves Oreo anything, I was extra excited for this one. The icing on this one was definitely sweeter than the Vanilla's, and thicker too, with crushed Oreos mixed in and an Oreo piece stuck in the top. The cake is chocolate, and not as sweet as the vanilla cake, which I found to be perfect considering the sweetness of the icing. After I finished, I wished I had gotten more than two! I will be visiting this bakery very often now, each time to try something different. I have no doubt that they will all be delicious.\nHighly recommended, five stars!!!", "author": "Maylynn M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-03", "description": "I am so happy I went into Mia's. \nMy friend lives in Brooklyn and I wanted to bring something yummy over to her house. The staff was so welcoming.\nI bought the mint chocolate chip gelato and a few slices of cake: strawberry shortcake, salty carmel chocolate cake, and carrot cake. All I have to say is AAHHH-MAZING! \nHighly recommend!", "author": "M B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-17", "description": "i just wanna start off and say that i'm not easily impressed with decadent desserts.\nbut mia's really blew me away with their cakes. i've been there a couple of times; every time i come i order a different slice and every slice blows me away. \nthe baker at mia's bakery deserves an award! \n\nthe place is nice too with their nice courtyard and fierce air conditioning! \nand i like that the waiters and waitresses leave you alone to do your own thing.", "author": "Jane K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-04", "description": "Delicious cookies and cupcakes. Never too crowded and you can always find something new to try. I recommend the peanut butter and chocolate chip cookies and the chocolate cupcakes", "author": "Ashley S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-30", "description": "Super clean and great tasting desserts. What else do you need? I went to Mia's with a few friends. We were greeted by a friendly staff and we sat in the back yard. We decided to order a bunch of different cakes and sample them each. All amazing! I also love that it closes at 1am. Next time I'm in the area I'll be going back.", "author": "Billy A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-27", "description": "Great place for coffee and dessert. Very clean, great staff, great food. They have a nice outdoor seating area out back. Also they are open until 1AM most nights. We had the coffee and cheesecake specials. Cherry and oreo, mmmm.", "author": "Jason T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-23", "description": "Banana ice cream is amazing. Great ambience and staff.. The peach Melba was delicious we are definitely coming back", "author": "Niko A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-27", "description": "Beautiful, spacious, clean pretty space. Good coffee. AND THE SWEETS. OH MY GOD. Flan like my mom makes and I can't wait to try everything. They seriously have everything! A million different cakes, pies, pastries, tarts, cookies, biscotti, cupcakes, rice pudding, bars, croissants... And everything looks killer. I'm still enjoying my flan and I'm trying to decide what to take home for breakfast tomorrow. They're open until 1 am. My new favorite place for everything.", "author": "Kendra L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-05", "description": "Awesome desserts! Amazing pieces of artwork in some cases. Very affordable pricing. A favorite place for sure. Go sit outside in the back if you have time. Very clean, serene and relaxing!!!", "author": "Ana E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-05", "description": "Absolutely love this place. Have a great selection of desserts, and everyone we've tried has been great. I ordered my wife's birthday cake from them and it was absolutely delicious, and not very expensive. So glad have Mia's in the neighborhood.", "author": "Rob S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-09", "description": "Finally a bakery in Boerum Hill! Great stuff, awesome atmosphere, better than Martha's in Queens. Great spot for a date or just hanging with your friends and family. WARNING: You may become addicted to their red velvet cupcakes.", "author": "Travis L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-12", "description": "Excellent desserts!!!!  Has something for everyone.  On a business  trip.  Was visiting Juniors, then found this place.  Mia's is way better.  Wish I had found this place  a week earlier.", "author": "Matt B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-11", "description": "I have been twice to this new and beautifully built place in the neighborhood . The desserts are awesome and tasty . The coffee is great . The help is wonderful . It reminds me of Cafe Dante in greenwich village I used to go to back in the 70's . I am a big fan .", "author": "ABDALLAH A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-04", "description": "I used to love this place but after a terrible experience, I'm still holding a grudge 5 months later. It used to be our go to place in the neighborhood did reliably delicious, decadent desserts and we used to recommend it to everyone looking for a not-too-fancy bakery that has everything. I ordered a birthday cake from here in February a week in advance with a specific inscription. I paid in full over the phone so everything was taken care of. When I arrived to pick it up, it was obvious that they had forgotten about my order, as there was a noticeable scramble to figure out what to do. Instead of apologizing for forgetting, they figured they'd just give me a cake that they had on hand, hastily inscribed behind the counter. As if that wasn't bad enough, when we got home and cut the cake hours later, it was FROZEN SOLID. Do you know how embarrassing it is to serve guests a frozen birthday cake?? All this with zero explanation and zero apology. If they had just told me the truth, I would have been disappointed but I would have understood. Mistakes happen, but you have to own up to them. As a neighborhood business, Mia's revealed a lot about themselves through this one incident: they don't care about their customers, they don't care about their product, and they don't care about their reputation.", "author": "Charlotte H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-19", "description": "Got my son's first birthday Mickey Mouse cake here. Looked and tasted amazing. Thanks Marco!", "author": "Michael C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-07-12", "description": "Honestly everything was pretty rich in a not-so-great way. I can see why people really like the coconut cake because the frosting is excellent but the cake was a bit dry/you could tell it wasn't baked that day.", "author": "Sam S."}], "servesCuisine": "Cafes", "priceRange": "Under $10", "name": "Mia’s Bakery", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "139 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/SM4ZOzR354iQi9Xvf1b68g/ls.jpg", "@type": "Restaurant", "telephone": "+13479873194"}