{"aggregateRating": {"reviewCount": 572, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-06", "description": "My first time visit here and I felt like a five year old in a candy store! \nBe prepared to be overwhelmed by choices. The portions/slices are pretty big. \nI had the Peach Franzipan and it was delicious! I am always on the lookout for peach anything because bakeries rarely make anything peach. We also tried the rainbow cookies, which were okay. \nStaff is friendly and the place is clean.", "author": "Georgia N."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-05-25", "description": "Plastic bags, guys? Really?  Why is it such a big ploblem to offer paper bags when our planet is dying?", "author": "Anastasia K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-19", "description": "So good. I have had various cakes and cup cakes from here. If you have a sweet tooth walk away...lol\n\nBut if there is one thing I should recommend is the tres leches cup cakes... omg.\n\nEither way the service is prompt and kind. The pastries and cookies are awesome. Nothing negative to say.\n\nThere is/was a Yelp deal take advantage!", "author": "Keniel L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-05-05", "description": "The customer service here is seriously lacking. I really only go here because there aren't many bakeries in this area, but when I do go, everyone is sort of cold and unwelcoming. Don't really know what their problem is at this place. The cannoli here are not great - edible, but you can find better. The cake here is okay; I like the chocolate mousse cake and vanilla cupcakes. However, none of them really stand out or wow me. The prices here, however, are pretty good.", "author": "Amiee O."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-12", "description": "We stopped by here for dessert on a Friday night and it was so bustling! Mia's Bakery offers dine-in seating which is pretty neat. The layout of the store is narrow but then it gets wider as you make your way down. We ordered a few things for take-out. \n\nThere were SO many delicious sweets lined up on the clean display. It stretched on for so long!!!! They have everything you can think of- cakes, cheesecakes, cupcakes, cannolis... a sugar lover's dream come true. We ordered one slice of red velvet cake (though cupcake version was equally as tempting), a chocolate dipped cannoli, and a cannoli with a regular shell. The total came out to be around $15. The cannolis were filled on the spot to ensure freshness.\n\nThe red velvet cake slice was a m a z i n g. I LOVED the moistness of the cake, and the frosting!! CREAM CHEESE FROSTING IS ALWAYS YUMMY. I shared it with my sister and we loved it so much. Would 10/10 order it again. :- ) The cannolis weren't very good, though, mainly because the filling was too runny and just didn't have that creamy texture I was hoping for. It tasted a little strange as well. I've definitely had better ones. The shell was just okay- a little dense. \n\nIf I'm ever in the area I'd love to try some other cake slices! The red velvet was amazing and I can only expect the other flavors to be just as wondrous. Just don't get the cannolis!", "author": "Anna X."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-05-24", "description": "5 stars for their banana cream pie, 1 star for counter/take-out service. Not sure if it was just an off day, but I waited for 10 minutes and no one offered to help. Other people who came in after me got service right away. Finally I went up to the register as the girl with glasses asked if she could help someone. I told her I'd like a slice of the banana cream pie, and she asked if I was with the guy standing next me. I said no and she said hold on and then helped someone else. I walked out. Ridiculous.", "author": "Stella C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-30", "description": "They deliver on Seamless and everything we've tried (creme brulee cupcake, burnt almond cake, oreo cake and the brownie) has been fantastic! This place is a must-try!!", "author": "Alison B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-01", "description": "This is my favorite bakery of all time. I must order delivery from here weekly. Their tres leches cupcake is the most amazing thing I have ever tried. I am also a huge fan of their apple pie/apple crumb slices. Their pecan and key lime pies are also amazing. If you go in person, they have this very cute outdoor seating area in the back. It's a great little spot!", "author": "Yolanda B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-15", "description": "This bakery is amazing! There's a good amount of seats indoor and they have a back yard seating too. You can enjoy their yummy pastries especially, the cakes. The cake was so soft, flavorful and delicious! Loved it! Definitely, a great bakery to check out!", "author": "Ka Yi W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-05", "description": "Extremely fresh and delicious baked goods.\nThe server was quick and attentive. They did not have an specific iced tea that I wanted and the server offered to prepare an iced tead from the hot teas they have available.\nI had the lemon blueberry cake.  This is an extraordinary cake. A layered cake with a perfectly firm and most caked with a custard cream filling with fresh, pop in your mouth, blueberries. \nGreat great. Will be back.", "author": "David G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-05", "description": "This is what I imagine all bakeries to be like. Filled with rows and rows of sweets and baked goods and a small sitting area with lovely staff. I want a mini version in my apartment building. Also the cake. The cake slices are so darn good! So good. Delicious. Fan-freaking-tabulous. \n\nI had the chocolate cake with chocolate custard as filling - I forget the name but there's a slight crunch to each bite (I assume from extra sugar later?). Each slice is $5.95 and so worth it. I'd come to Cobble Hill just for this delightful pick up in my life. My friend had strawberry shortcake and she swears by it.", "author": "Joanne K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-30", "description": "Amazing cupcakes and desserts!! Beautiful backyard space for nice weather too. And they made a beautiful frozen-themed birthday cake for my daughter today that came out amazing and that we were thrilled with. And it tasted amazing!! Love this place!", "author": "Elena S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-06-01", "description": "Nice bakery, but I don't think the man behind the counter has much respect for women.  We've been loyal customers of Mia's for years and unfortunately, that relationship looks like it's coming to an end.  I arrived for a pick-up this morning to treat some out of town co-workers and was greeted by a man (claiming to be the owner, but I'm not sure of his name), who was in the midst of berating one of his female employees for some coffee-related issue.  I asked if we could add a few additional items to our pre-paid order (a couple slices of cake) and a warm egg muffin and an ice coffee while I waited for them to get the order together.  15 minutes later and I was still waiting for the order.  Turns out the egg muffin was sitting on the counter, packaged up and getting cold.  I asked for it and placed my bag on the floor which contained my 5LB emotional support dog, who poked his head out.  When the owner noticed my dog, he said I couldn't have him in the bakery.  I told him he was an emotional support dog and he asked to see the license.  I showed him the license and he said it needed to be a service animal.  At this point, I was just waiting to get the rest of our order and leave.  When I asked if he could just add the items to our pre-paid order, he demanded to see the company credit card again, which I didn't have on hand.  We order from them all the time!  He then proceeded to tell me that I have \"an attitude\" and that I should be grateful for all the times they accommodate our special orders.  Is that really any way to speak to a customer who's been giving you business for years?  Would he have spoken to me like that if I was 6\"2 and a man?  I doubt it.  The pastries are nice, but there are plenty of good bakeries in the city with staff who don't speak down to women.", "author": "A R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-02-09", "description": "I've been here twice and I can say that I haven't been dissapointed when it comes to the food. I've had the breakfast sandwich with eggs and cheddar cheese on a crossant and today I've had the oreo cheesecake with peppermint tea. The tea is great as always and the oreo cheesecake was delicious. (Just make sure you have room for it since it is very filling). The service, however, is a different story. There was a lag in seating time, and it took a while before I was given a menu. After I was given my food, the waitress checked in on me to make sure everything was okay. However, she disappeared when it was time for me to pay and I had to call on another waitress.", "author": "Anne B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-09-08", "description": "A solid neighborhood stalwart, where else can you get baked goods at 1 am on a Friday night? \n\nNot everything at Mia's is exemplary, in fact most isn't, but it all hits the spot (the cream pies and cakes in particular). \n\nIt has a nice little space to relax and eat, the kind of place any neighborhood would be glad to have.", "author": "Edward J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-12", "description": "I usually come here when I'm having brunch on smith street. I always have to stop by here and get a couple of cupcakes to take home. They're always delicious and taste fresh. I once actually stopped in and grabbed a table and enjoyed my cupcake and a nice cup of coffee outside on thier patio in the summer time. Definitely check them out!", "author": "Katherine W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-11", "description": "Delicious pastries and great costumer service. I ordered online and on my way to the bakery I got a call telling me they were out of the cannolis and that I could replace the item with something else. At the bakery one of the managers I believe, had the workers see if there was any freshly made filling and had them make fresh cannolis for me. I got a complementary cookie while waiting.", "author": "Vanessa G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-20", "description": "Came here after dinner (love that this place stays opened pretty late) and it was a great experience! This bakery has sooo many different sweet options and a large variety of flavors for everything! They had cupcakes, cakes, pies, cannolis, brownies, muffins, and so much more!! \n\nI ordered a slice of blueberry cake and a tres leches cupcake. I really liked the lightness of the blueberry cake and how it was sweet but not overly sweet. The tres leches was also really good! However, I could not not finish it because it was super sweet and definitely would have made me feel guilty for finishing it. \n\nThe service is nice and they are pretty quick. The indoor seating doesn't seem like much but it's good for groups of 2 or 3! I'm glad I found this place and I would come back if I'm in the neighborhood again.", "author": "Amy V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-04-04", "description": "Love this bakery! Their Triple Berry Pie is to die for! I mean everything I've tried so far has not disappointed . Their Tres Leches Cupcake and Strawberry Shortcake  are awesome too. I mean I could sit here and list everything I've had and how amazing it is, but I've tried too many and you would have to stop by and pay them a visit. A very busy place though, so you might have to come and wait a little to be helped. Also, parking is not the best in that area.", "author": "Erika G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-05-21", "description": "Strawberry shortcake and chocolate cakes are brilliant.  Great service and full ambience.  Cozy and tasteful.", "author": "Kdawg Z."}], "servesCuisine": "Cafes", "priceRange": "Under $10", "name": "Mia’s Bakery", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "139 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/SM4ZOzR354iQi9Xvf1b68g/ls.jpg", "@type": "Restaurant", "telephone": "+13479873194"}