{"aggregateRating": {"reviewCount": 572, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2019-02-17", "description": "I ordered a number of dessert items for delivery - all of which were fine. However, I also ordered biscuits which they must have run out of, as I got a coffee cake and a scone in lieu of said biscuits. They didn't call to ask or let me know. I don't like coffee cake, I don't like sweet biscuits. Had I wanted coffee cake and scones, that's what I would have ordered.\n\nWho does this kind of thing?", "author": "Helen K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-08", "description": "Great strawberry shortcake cake. I love how it's a sit down bakery so you can enjoy your baked goods...yum. They have a lot of good sweet stuff. Wish there was one closer to home for me, but worth the drive. Our waiter was a nice young gentleman. We were given complimentary water right away. I ordered the strawberry shortcake cake and coffee. My friend ordered strawberry cheesecake and a rainbow cookie. Came out right away. Delish!! I loved it. The cake was light and fresh as it stated on the menu. They have outdoor seating I believe which I'll be back to try out. Soo goodddd", "author": "Rhea Z."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-08", "description": "Thanks for MIA's cake, my birthday is great!\nI was bit surprised when Mia is opening on an early morning where usually bakery shop tends to open around 11am.\n\nGot their cake\nstrawberry cake\nso good\nfresh\ncreamy\nLOVE IT", "author": "Tina W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-18", "description": "Delicious baked goods \u0026 wonderful staff! \nYou have to try the strawberry cupcake with the Nila wager on top \nSo yummy!", "author": "Jaclyn W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-08", "description": "Yet again I have found a place that I have no business going into. I've passed this spot possibly 50+ times and was proud that I didn't succumb to the window display of all things guaranteed to put an extra 10lbs on your rear. \n\nHowever, this particular day I stumbled. I had a craving for something sweet. When I saw the selection of cakes, cookies, and cupcakes I was in sweet heaven...lol. I told myself 1 cupcake and it better be the best damn cupcake ever. So, i'm looking and they have some pretty good selections red velvet, salted caramel, and a few others, but what caught my eye was the Tres Leches cupcake. Now I've tried that type of cupcake at other places and it bombed. The best part of Tres leches is the soaked cake...so when I saw that the bottom of this cupcake was a tin like wrapper I thought ohhhhhhhhhh shhhhhhhh..... It was a legitimate Tres leches cake in cupcake form... it was completely soaked at the bottom with the three types of milk that makes it what it is.\n\nNeedless to say that cupcake was destroyed. I will definitely find my way back here when I have an attack of the sweets.", "author": "Ebony C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-02", "description": "This place is the sh!t y'all. Truly I am visiting from Oklahoma and was just wandering the streets alone stumbled into this place and damn am I glad I did. Service was kinda iffy at first so I almost left but holy sh!t I'm glad I didn't. I ordered the Oreo cheesecake and a Nutella donut croissant (I've never had one!) they both are at least 2 people servings although I'm not a quitter and I'm lying I couldn't finish either. I'm hoping they hold up after drunken shenanigans with my friends tonight. If not let's be real I'll still devour them", "author": "DeJa C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-14", "description": "I'm not into dessert. I'm unreasonably suspicious of beautiful display cases. And generally speaking, I don't like places that have too large a selection. \n\nHowever, Mia's has won me over. \n\nNot only do they have downright gorgeous desserts everywhere you look, but they taste good too. They've got something for everyone: cookies, cupcakes, coffee drinks, flans, croissants, puddings, strudels, eclairs, cannolis. \n\nThey've got babka for my father, banana creme pie for my wife, cakes for the silly people that would ever order cake when pie is available, and cheesecakes for the people who know what the only good kind of cake is. They've even got a few savory options, including bacon egg and cheese sandwiches in the morning.\n\nPlus, their sign game is top-notch, with anti-Trump messages mixed in with Salt Bae, showing they know both the neighborhood and the times we live in.", "author": "Peter D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-12-03", "description": "They ran out of all the croissants / donuts when they still had another 12 hours of being opened. They, called so, that was forgivable. But then it was delivered. Fruit tarts a mess, and the drink, well, about 4 oz spilled into the bag, it's taped with scotch tape, the sleeve wet and ripped. Gross. Maybe invest in a different paper goods ? Tart was good but matcha green tea, it literally smells like scotch tape adhesive, and the green thing that plugs the drink broke off so I had to fish it out of the drink. \n\nEdit: fruit tart was good but some strawberries still had some stems on them", "author": "L P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-23", "description": "What you need to know: \n- Endless drool-inducing displays of desserts \n- Open until 11pm, lovely for after dinner sweets \n- Accepts credit cards (without a minimum) \n- Very friendly service \n- Fair amount of seating, there were a number of large groups when we arrived. \n\nWhat we ordered: \n- Apple and blueberry pie $5.50 - It was a hard decision among all the cakes, tarts, creme brulees, flans, lobster tails, but this caught our eye! They warmed it up for us and it was shockingly delicious! The pie crust was pillowy, thick and soft - which is very different from most pie crusts that are thin and crispy. The portion was large and the filling was PACKED with sliced apples and blueberries. I can't wait to come back to try other goodies!!!", "author": "Karen L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-12-07", "description": "The desserts are great but the staff has such a bad attitude especially the take out counter.  They don't listen to your order, try to rush you and then get pissed when they mess up.  It's sad that a good business has bad employees!", "author": "Melissa V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-31", "description": "I've never personally stepped foot in this bakery but my husband told me about this place and just got my daughters birthday cake from here. It was absolutely delicious! The layers of chocolate, the thickness of the frosting, it's goodness from top to bottom of the cake. \n\nI will definitely recommend this bakery because not only did he buy my daughters cake, he also purchased a strawberry slice cake and a moist coconut cake. It's literally heaven in your mouth, trust me. I look forward to visiting this place myself in person. My birthday is in 11 days and this is where I want my cake from, lol.", "author": "Gigi C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-09", "description": "Yum.  I love pie and while the Italian bakeries in the area are good, Mia steps up the game.  There's a good variety of well executed pastries, smoothies bar and seating in the back.  It's a great place to hang out, get dessert or just take a break.  My cherry pie was delicious albeit a little crust heavy and cinnamon flavored.  My bf had a cannoli cream cookie sandwich which he loved.  Bring your sweet tooth and the rest of you to Mia for a treat.", "author": "Wailana W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-24", "description": "Love this spot. I passed this bakery several times on my way to work and I decided to go in today. I feel like u can not go wrong with any pick. I had the black forest cake along with a cappuccino deelishhhhhh. I already know I will be a repeat offender.", "author": "Meryl P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-08", "description": "We stopped here for dessert after shopping around the area and to our delight it was full of goodies. There was too many options for someone like me but I finally choose the chocolate mousse and it wasn't a let down. \nThe coffee could have been hotter and the staff working with a summer vibe but I can see myself coming here again.", "author": "MissMoralesj M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-06", "description": "There are so many options at Mia's Bakery! They have italian, french, gelatos, cupcakes, and even baklava. When a place has this many options, I can't imagine how they can make everything good. And I think I was right. Tried a slice of pie and a cupcake. Pie was decent but the cupcake was dry.", "author": "Elizabeth N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-07", "description": "Desperate for dessert on a snow day, we came here for our fix for sweets. There's a good selection of items to choose from ranging from cheesecakes to pudding. We decided to get rainbow cakes. I'd recommend this place for its convenient location and wide selection.", "author": "Rob C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-25", "description": "Yesterday, I celebrated with a friend for her birthday by going to Mia's for dessert. What a good choice! The staff was very friendly and patient as we pondered what to choose given the oodles of scrumptious looking choices.\n\nWe asked for a recommendation from two waitresses and they both said the same thing - the blackout and strawberry shortcake were their favorites.\n\nMy friend loved the blackout which I of course tasted and it was good. However, the strawberry shortcake was heavenly being light, not too sweet with an air of freshness - hmmmmmm!\n\nOn the way out, I couldn't resist, purchased one Nutella almond cookie which was an added treat.\n\nCan't wait to go back and try the apple pie, banana cream pie, cherry pie, carrot cake, the list is endless. Guess I will be visiting Mia's for many celebrations.", "author": "Howard E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-01-13", "description": "Great bakery, wide selection however it's pretty pricey for a slice of cake it can run about 6$ or more. The slices are huge so it definitely is worth the money", "author": "Maggie F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-24", "description": "For literally ten minutes I paced back and forth browsing all the choices trying to decide which dessert to get, and it doesn't really help that I'm quite indecisive.  It's pretty overwhelming how many choices they have, which isn't a bad thing at all, since I love variety.  After what felt like forever, I decided to order the salted caramel cake and grabbed a seat with my friend.  Not even a minute later, we were approached by our waitress with water in mason jars (so cute), and just a couple minutes later our waitress had brought out our desserts.  Each plate had a small decoration of caramel sauce, which was a cute little touch and I couldn't wait to dive in.  The cake was pretty good.  It was moist and the frosting wasn't overly sweet.  I've come here before and gotten the tres leches cake, which was really good.  \n\nThis place is soo cute and has such a nice vibe and there is a lot of seating indoors as well as outdoors.  After my friend and I finished our desserts, we ended up just sitting and talking for what felt like two hours.  This is definitely the perfect place to catch up with someone or go on a date.  I will 100% be back, and all I know is that each time I come here I will definitely be trying something different each time.", "author": "Liana M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-30", "description": "We had a few slices of different cakes from Mia's bakery, and all were really delicious. Yes, it might not be the cheapest, but firstly, they have an amazing variety of very different desserts, and secondly, the slices are huge and very sweet, so it's almost impossible to eat a whole slice in one sit. I can't wait to get back for more!", "author": "Alexandra D."}], "servesCuisine": "Cafes", "priceRange": "Under $10", "name": "Mia’s Bakery", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "139 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/SM4ZOzR354iQi9Xvf1b68g/ls.jpg", "@type": "Restaurant", "telephone": "+13479873194"}