{"aggregateRating": {"reviewCount": 572, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-08", "description": "I wanted to try out this place for the longest. Finally one day I was in the area. I bought a slide of tiramisu cheesecake and it was so sweet. I would give it 5/10. I'm a cake lover and cheesecake is my fav but this slice was extremely sweet and too much for me. The slice was also tiny considering it was around $6. But they packaged it very nicely and securely so that's a plus. I'll be back to try some other types.", "author": "Doma G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-15", "description": "My mom wandered in here looking for a treat.  They had a large selection of baked goods, we got a red velvet cupcake and a slice of chocolate cake. It was a tad bit hectic ordering, but these places always are.  All in all, it was nothing mind blowing, but a solid bakery.", "author": "Stephanie M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-01", "description": "Always great to find a bakery open late night.  We ordered a few pastries to go; black/white cookie, napoleon, and both were good.  I need to go back and get more.", "author": "Kevin R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-31", "description": "Amazing maple bacon cronut and coffee. The service is super friendly. There are an amazing variety of pastries. One of our neighborhood favorites.", "author": "ted b."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-15", "description": "Amazing place. I'm so over Martha's now. Honestly this place is great. Great coffee, cakes, atmosphere. The seating and such makes it a good hang out place. \n\nThings to try:\nLemon Blueberry cake (I think it's called but you can easily decipher it when you go in)\nFruit Napoleon\nCreme Brulee\n\n1 star less because their check-in is misleading.", "author": "Princess S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-11", "description": "Was super excited to see this place pop up in my hood. I'm always down for easy access to pastries!\n\nHave only tried the cream cheese brownie, which was awesome if not a little pricey ($4.50). The space itself, though, is worth a mention. THEY HAVE A GARDEN, hellooooo brunch. And there's just a ton of seating inside. Perhaps good for a birthday party?\n\nPro tip: The coffee spot opens at 6 a.m. NONE of the coffee joints in the neighb open that early, so this is a welcome addition for us early risers.", "author": "Sarah G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-28", "description": "Really great service! There were two people working this night and both were super friendly and sweet. 5 stars.\n\nWe ordered the almond cake and pistachio ice cream. The cake had the right amount of sweetness and lightness to it. I would definitely order it again. \n\nAs for the ice cream, you can taste the nutty flavor in it, and I really liked that this pistachio did not have any green dye added to it. I just felt that it was missing the pistachio flavor. There is another ingredient in the ice cream (maybe toffee?) that may have been overpowering. It still tasted great, but wished the pistachio was more distinct.", "author": "Grace C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-01", "description": "They did a good job keeping the line going. The croissant-donuts were delicious; they have a fluffy, layered texture. The turkey and cheese croissant was also delicious. This was my first time, and I definitely plan to be back to try more of their pastries.", "author": "Shannon R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-10", "description": "The display is fantastic....and this was just the beginning. I don't like sweets much so coming from someone who isn't a big sweet ester, take my review into account.  My boyfriend and I went in after eating at Kyoto and decided just to look at the selection, it's definitely one of the most diverse selections I've ever seen. They even have a custom tea and cappuccino bar. We decided to partake in the German chocolate slice and chocolate brownie. The chocolate was semi sweet; therefore, it was decadent and I didn't feel nauseous at the end of my slice. Very rich and moist cake that paired well with the dark chocolate. \nBeing that I'm not an avid fan of sweets, I'd have to say that I was so impressed I will definitely come back. Plus, outstanding service as well.", "author": "Monique P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-09", "description": "This place has so many delicious things!! They have got literally everything you could imagine. My fiancé and me tried the Oreo cake pop, marshmallow bread pudding and chocolate cupcake. It's was very yummy and left us both very happy with the desserts.", "author": "Jessica S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-18", "description": "A and I really enjoyed our ham and cheese and turkey and Swiss croissants :) I love savory pastries and I'm so glad they have them here since I have gestational diabetes and shouldn't have sweets. Very spacious too with a nice backyard seating area. After the baby, I'd come back to try some cakes.", "author": "Brietta Y."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-08", "description": "i popped into this place during the Bastille Day festivities on Smith Street to use their bathroom (shhh). but i'm not a bad customer and was resolved to purchase something as well. luckily their display case of pastries made that an easy feat. i only picked up the canookie, but it was DAMN GOOD. 2 small soft and chewy chocolate chip cookies sandwiched a light and flavorful cannoli cream. totally worth the calories and the $3 price.", "author": "Tina M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-03", "description": "Great customer service! Really quite impressed, and the pastries and coffee were excellent. A great place to spend a leisurely afternoon :)", "author": "G. D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-27", "description": "Sweet place (pun intended) with excellent baked goods. Very new, with pleasant workers and reasonably priced items. I love that you get a free beverage with yelp check in and any purchase.", "author": "Tiffany L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-21", "description": "I cannot imagine how great this place is! The boss is so friendly! It was my birthday today and I had asked for recommendations to which cake would be best. He had suggested strawberry cheesecake, but I just couldn't decide! We ended up ordering 6 different type of cakes: strawberry shortcake, tiramisu, chocolate fudge, Napoleon Berry, raspberry peach, and a porcupine! THE BOSS, TONY, WAS SO SWEET AND GAVE ME AN EXTRA STRAWBERRY CHEESECAKE BECAUSE IT WAS MY BIRTHDAY AND A GIANT CHOCOLATE CHIP COOKIE. The porcupine had passion fruit tart inside and it was so dense and amazing . I could honestly say my birthday felt like the best one thanks to the sweet people of Mia's Bakery", "author": "Crystal T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-12", "description": "My former coworkers bought me a Mia's cake for my going away party. Absolutely decadent! Rich, moist and all around amazing... And I don't even like chocolate! I ended up connecting with the bakery on social media and they are total sweethearts. I've been back a few times and they are my new go to bakery. Very, very good!", "author": "Liz L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-20", "description": "Had the most amazing red velvet cheesecake and espresso. Beautiful and cozy inside. Met the owner on the way out...genuine and personable guy. We will definitely be coming back! Friendly staff and excellent desserts.", "author": "Jacque B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-15", "description": "I ordered a birthday cake here over the phone at 9a pick up at 4p. They told me they usually require a 24hr order time but was able to have one ready for me (thank you!) Receive the cake, it was amazing! Spelling of the name was correct - Awesome :) My only complaint is that the young lady on the phone had a hard time taking my credit information but what ever, I bet she will get it right next time. Overall super satisfied and the 10inch Chocolate Mousse Cake was delicious and there was left overs for 4 days and the cake  still tasted fresh! \nThanks so much!!", "author": "Tatiana W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-30", "description": "Ordered a coconut cake for a birthday celebration and it was out of this world! \nThanks Mia's bakery, from Mia:)", "author": "Mia H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-30", "description": "This was my second time at Mia's bakery. The staff are always very nice. \n\nThey don't offer free coffee anymore. \n\nAt our first time there, we had blackout cake, apple pie and something I don't remember now and we enjoyed everything. They were Not too sweet like most American style cakes. \n\nThe second time, I got strawberry cheesecake. The cheesecake tasted sort of artificial and I guess I hated the red gel over the strawberries. \n\nI'll definitely go there again and try their other cakes :)", "author": "Dilek T."}], "servesCuisine": "Cafes", "priceRange": "Under $10", "name": "Mia’s Bakery", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "139 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/SM4ZOzR354iQi9Xvf1b68g/ls.jpg", "@type": "Restaurant", "telephone": "+13479873194"}