{"aggregateRating": {"reviewCount": 572, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-18", "description": "Return? Yes. Maybe I got the wrong dessert the first time but I initially rated Mia's a 2. I've been back 3 times since and its been quite good\nAtmosphere (3) Clean, not too crowded but kind of sterile. Better suited for takeout   \nFood (4) - Pumpkin cheesecake (4+), chocolate chip cookie (4+ - chewy, borderline doughy), Oreo cupcake (4), vanilla cupcake (4), coffee cake (3 - very good cake but needs more topping!), apple strudel cheesecake (1 - this was from a year or two ago; in retrospect, it appears to have been an anomaly).\nService (3-) Ordering from the counter is a little haphazard because there doesn't appear to be a line so people coming after you can end up getting their order filled first. The one time I ate-in, I waited 15 minutes before having to flag down a bus boy to get service. The waiter was friendly but clueless \nCost = Cupcakes and cookies are around $3 and a slice of cake about $6", "author": "Will S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-16", "description": "The cookies were to die for!!! You will also not regret ordering their cannoli! I definitely recommend this bakery.", "author": "Liz C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-06", "description": "Oh, the lobster roll... Flaky pastry just like you'd have on a sfogliatelle, perfect pastry cream filling inside. You can't go wrong. I want one every month for the rest of my life.", "author": "Charity K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-01", "description": "I'm giving this place 5 stars although I only tried 2 items, they were both beyond delicious. Last minute I found out it was a co-workers birthday and we needed a cake. We usually go to Court St. Pastry and get a cannoli cake. Everyone was tired of cannoli so I googled bakeries near me and Mia's bakery popped up. I figured we would try someplace different but was not expecting much. I went in and bought a 7 layer cake and the extremely helpful, very friendly girl behind the counter wrote Happy Birthday on it for me. Upon checkout I purchased 1 honey nut cookie that they had by the register. I told her not to put it in a bag and ate it while I walked to the car. The cookie was moist and delicious and tasted exactly as advertised of sweet honey and crunchy nuts. I had to stop myself from going to buy a few more remembering I was about to have cake shortly. After we sang happy birthday and cut the cake everyone was raving about it and asking where I bought it. This place is clean, cute and delicious. Since my office is only 2 blocks away, looks like we found a new bakery for birthday cakes and to satisfy our sweet tooth. Can't wait to try other items from Mia's bakery. If you are in the area give it a try. You won't be sorry. I guess I should mention it's a little pricey but it is in downtown Brooklyn so everything is pricey.", "author": "Crystal L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-01-01", "description": "Huge variety of cakes, cookies, pastries, cupcakes and desserts which all look amazing in the window but unfortunately aren't particularly good. On the positive side, the place is attractively decorated, staff are very friendly and they have a cute coffee bar. But the cakes are quite bland and the frosting has a very plastic margarine-ey taste. I've tried four of their cakes now and they've all been suffering from the same lack of freshness. I can't judge on the pastries or anything else so maybe I'm just ordering wrong with the cakes?", "author": "Foodie L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-24", "description": "Great selection of yummy baked goods, nice atmosphere, and cute garden. My second favorite bakery in the boroughs. I especially enjoy their cheesecake!", "author": "Alison M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-16", "description": "thrilled to have this Mia's in the neighborhood! although it is a daily struggle to dodge buying everything in the street facing display case. the staff is very friendly, the desserts are wonderful, coffee is great.. I love this place!", "author": "Blake R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-30", "description": "just a note for the vegans out there -- this place offers vegan cupcakes, and not only are they good, they are amazing... very friendly service as well.", "author": "kevin f."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-10-17", "description": "Really friendly staff and a spacious location. A luxury for this neighborhood. The canoli however wasn't good. The filling lacked substance. The cupcakes were much better. I am giving three stars mostly for the space", "author": "DC F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-15", "description": "Delicious pastries, very nice outdoor garden and an incredibly friendly staff.", "author": "Meagan C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-11-09", "description": "When into this bakery today on my way home, the lady at the counter was rude and didn't even crack a smile. I purchased a nutella cupcake which tasted nothing like it and the cupcake tasted so plain and it like it had been sitting there for days. I wasn't happy at all and doubtful to return to this place.", "author": "Amanda R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-09-12", "description": "I visited Mia's bakery this afternoon looking to pick up some pastries for my family's get together. I spent about $120 on 12 or so slices that were the worst desserts I have ever eaten. The tiramisu was very sour, creme brûlée smelled like eggs., the bread pudding was just stale bread., let's not even talk about the cheesecake. The strawberries and the fake whipped cream on the strawberry shortcake was just a complete embarrassment. I gave them one star only to show how badly we need a bakery in this neighborhood.!!", "author": "Brenda Z."}], "servesCuisine": "Cafes", "priceRange": "Under $10", "name": "Mia’s Bakery", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "139 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/SM4ZOzR354iQi9Xvf1b68g/ls.jpg", "@type": "Restaurant", "telephone": "+13479873194"}