{"aggregateRating": {"reviewCount": 572, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-06", "description": "Best croissant I've EVER had. Great cake and pie selection. The fruit Napoleon is blissful. Awesome service. Family friendly", "author": "Kys G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-10", "description": "LOVE all their chocolate cakes. They are so moist and delicious! Their outdoor patio is great on a nice evening, but a little loud due to the generator.", "author": "Chris P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-30", "description": "Found this place while walking around looking for something sweet with the misses. The salted caramel cake was good; the frosting was sweet and of a thick texture and the cake itself was like a delicious pound cake. The Oreo cheesecake was not overly sweet, which is what we liked. We also purchased a maple bacon version of their cronut, which looks pretty good. \n\nThe whole cakes are decently priced. The pies looked great. Didn't spot a pecan pie, though. I'd definitely come back for the recommended strawberry shortcake. Best part is that I got a free coffee with purchase.", "author": "Timmy Z."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-24", "description": "Pretty good \u0026 fresh the stuff are very helpful I got strawberry shortcake very nice and light", "author": "Abdelazim W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-17", "description": "BEAUTIFUL SPACE!\nHad the strawberry shortcake and it was THE BEST SLICE OF SHORTCAKE IVE EVER HAD.  If it wasn't closed I would literally go right back to get another slice. Great selection. Clean.  Spotless actually . With seating in the back for talking and mingling . I found my new spot", "author": "Nurys J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-07", "description": "I stumbled into this bakery and was completely blown away!!! Better then any cheesecake in NYC, and I have tried them all. So far I've had 5 different cakes and pastries and all were superb. The gelato was also off the charts. People were very friendly and the place is beautifull including the outdoor patio. It's worth the trip from anywhere to visit mia's", "author": "Steven C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-07", "description": "Mia's Bakery is probably the closest thing to heaven ! Their Salted Caramel Cake and Chocolate Mousse Cake are not just good, but finger licking good. A must try, you won't be disappointed.", "author": "Lia A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-26", "description": "Huge bakery with a huge variety of baked goods. Everything I tried was very fresh. I LOVED the creme brule cupcake especially. Not everything was a hit- the Nutella cupcake and the salted caramel cupcake were too heavy, without great flavors. I still feel the best bakery in Brooklyn is Montelleone on Court Street.", "author": "Nancy A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-14", "description": "Went here two times and the service is nice. I ordered a strawberry banana cupcake, a fruit tart and a vegan treat. They all were soo gud except i didnt like the that the cupcake had alot of banana pudding but I still enjoyed it . Love the fruit tart the most", "author": "Zara G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-02", "description": "I've been wanting to check out Mia's since they opened and finally got here today. From the cappuccino to the quiche to the cupcake, everything was out of this world. Service was great too! We will definitely be back soon.", "author": "Rose S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-30", "description": "I had a piece of apple pie and coffee. The food is beautiful and delicious, and the atmosphere is pleasant. The only drawback is that the music is a little bit loud.", "author": "Davis C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-02", "description": "Phenomefuckenal ! Wow. Every single item I tried was out of this world. You can taste the freshness. Starting from the cappuccino to the tiramisu to the salted caramel tart to the strawberry cheesecake to the fruit Napoleon to the fruit tart to the cupcakes to music \u0026 ambience. I live in Astoria and I come to Brooklyn just for Mia's !", "author": "Kris Z."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-31", "description": "Went there for a coffee and we discovered an amazing bakery with a huge choice of cup cakes and cheese cakes and friendly service. my cuban friend went for the tres lece, which he said was a great interpretation of their traditional tres lece in cup cake format. I had the same impression of the creme brulée cup cake. Well done!", "author": "Antoine P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-14", "description": "This place is the best. I do not think a bakery can be any better. Everything is fresh and tastes amazing. The only \"bad\" thing I have to say is that sometimes my favorite cupcakes are sold out before I get there! Other than that...this place is the best in Brooklyn and maybe in all of NY itself!", "author": "Sean W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-01-05", "description": "The cakes we tried were good, but pretty average for the price. The vanilla bean was just OK, and the strawberry cake was pretty good, sweet but light. I wish I tried something more unique or just more variety in general, but we were too full from dinner. However, I like the atmosphere and the surrounding area. Their strawberry tea is actually delicious, and not weird or sugary. The customer service was very efficient and the employees were nice! Granted, I didn't try that much from this place yet, but chances are I'd probably keep trying other places for dessert until I return.", "author": "Jennifer J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-09", "description": "Mia's is probably the best bakery I've ever been to, although I am from a small town and the only place I can get pastries and cakes at is my local Dillon's. I went here for the first time on a recent trip to New York, and honestly got hooked the second I walked in. The bakery had a gorgeous, cutesy setting, it was very whimsical and looked like something straight out of a movie, especially with the outdoor seating, the decorations were well placed, the flowers and plants looked healthy and vibrant, and everything overall had a hipster, sort of rustic vibe, which I expected in The Big Apple. The cakes, tarts, pies etc. have gorgeous colors, an unforgettable taste and will leave you wanting more! I came in here once for breakfast and got affogato with quiche, but then ended up buying six slices of cake, which was completely unintentional. If you want to satisfy your sweet tooth, this is the place for you!", "author": "Tanya S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-19", "description": "Very nice selection of cookies, cakes and pastries. The cupcakes are especially good. Staff is always very friendly.", "author": "Anthony P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-11", "description": "The cakes here are really good and inexpensive. My fave is the chocolate fudge. Ive also had the red velvet, salted caramel, and chocolate mousse. All good and perfect for parties.They also have a variety of pastries and cookies so its great for after dinner dessert or a brunch date.", "author": "lillian p."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-10", "description": "Terrific baked goods, friendly and efficient service, along with a nice garden - there's a noisy air conditioner if you sit in the garden but hey, it's Brooklyn!", "author": "jane p."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-14", "description": "I love this place. It has a decadent selection of pastries although it could offer a bit more in the gluten-free department. Mostly it's the ambience here that's wonderful. It's the perfect place to go with a book or on a date or with family - it's a crowdpleaser.", "author": "Roxanne K."}], "servesCuisine": "Cafes", "priceRange": "Under $10", "name": "Mia’s Bakery", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "139 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/SM4ZOzR354iQi9Xvf1b68g/ls.jpg", "@type": "Restaurant", "telephone": "+13479873194"}