{"aggregateRating": {"reviewCount": 572, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-17", "description": "I'm new to NY and I've had my eyes on this bakery for a few months now. Had great coffee with great dessert. I must also mention that the prices for dessert are reasonable! This place has a lot of room and even an outdoor patio (will definitely visit when it warms up). Great find. I recommend it.", "author": "Z. Michelle O."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-18", "description": "Not a big fan of their cakes but chocolate almond croissant was amazing!!! Comparable to bien cuit without the heavy price tag. With coffee comes out to about $5", "author": "Phaedra Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-07", "description": "Came in to get some info. on getting a cake for our wedding. Mike and the staff were excellent to work with! They went out of their way to accommodate us and the cake we tried was fabulous!  We decided on strawberry shortcake and seven layer chocolate. I will add a follow up after the wedding but I'm not concerned one bit, these folks are great!", "author": "Dan S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-27", "description": "Terrific bakery and great staff/service!  Their blueberry crumble and croissant donuts are our favorites - great for when guests are in town!", "author": "Rob L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-05-07", "description": "I've only had cupcakes from Mia's. They weren't good either time. The batter was dry and flavorless. I can't recall the frosting. Mia's looks gorgeous from the outside but that's about it. I would recommend choosing another shop or grabbing a box of Betty Crocker.", "author": "D B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-01", "description": "Everything was delicious, although the cannoli was a little soggy. Rows upon rows of cakes, pies, cupcakes, cookies -- something for everyone with a sweet tooth.", "author": "June G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-06", "description": "Staff was very friendly and you can tell they really care. The store itself has a great vibe to it nice coffee bar, indoor and outdoor seating with a nice garden too, very peaceful. My family and I split several slices of cake while sitting on the patio cheesecake, strawberry shortcake, and carrot cake were all phenomenal. The coffee is also very good and is from a local brewing company which is cool. Glad to see such a nice place in the neighborhood.", "author": "Patrick B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-11-16", "description": "Cake was good\nSlow service not too friendly\nClean space lots of seating", "author": "Vanessa C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-11", "description": "There is such a wide selection of desserts to choose from! It is a sweet tooths dreammm! I had the Fruit Nappolli (spelling?) with light cream filling and whole fruits between layers of hard pastry. I enjoyed it! The take away service was a bit unorganized and it's hard to see/hear the person servicing you because of the amount of treats piled on the counter.", "author": "Samantha H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-22", "description": "My husband's birthday cake was from Mia's. Amazingly tasty, fresh (it lasted less than a week!) and perfectly sweet. The place is well lit and a perfect spot for parties or just walking in to work with coffee and some sweets treats.", "author": "Lakshmi S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-09-16", "description": "I walked by this place after a long and hard shift at work only to be mesmerized by the beautiful pies and pastries displayed in the window. I don't know what sane human wouldn't have gotten the idea to grab a slice of pie from here and then go around the corner and pair it with a couple scoops of Van Leeuwen, because that was my exact intention. I went inside to look at the menu only to be unsurprised by the steep prices. My craving for apple crumb pie didn't care very much, though. I was helped by a woman behind the counter barely taller than the tallest part of the food cases haha. Once I grabbed my pie off of the counter, I noticed that a huge chunk of the tip was missing. Now I don't know about YOU, but if I'm paying $6 for a small slice of pie, I want the whole damn thing. Yes, you not dropping that extra piece that fell off inside of my container is a problem. Although she was friendly, I'm not a fan of that at all. Pie slices aren't advertised with a bite already taken out of it like apples often are. The pie was great, which made me want that missing piece so much more. \n\nAnywho, I would recommend this place (despite the prices) because I do think they make great quality pastries and everyone there (around midnight) was very friendly and welcoming.", "author": "Jessica D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-03", "description": "Wide selection of decisions cakes and pies. Slightly over the average budget but you will understand why when you taste it.", "author": "Mohamed F K."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-05-20", "description": "I am currently sitting here in, writing my review. 2 stars are probAbly for the lobster tail and the coffee. We also ordered the tiramisu cupcake. The cake was moist, but the frosting was meh! It tasted so greasy. \nWell, my biggest complain was with the service. Took about 10 minutes for the order to come, asked for milk and the waiter forgot about it. I had to go to the counter to ask. Then as I was observing, there was only 1 server, 1 server guys! For a crowded Friday night! There was another guy, not sure if he was the server as well or he ws a bus boy. He wasn't taking order, basically he was just cleaning tables and strolling around. This another poor server was pacing herself, trying to bring all the orders! The manager or the owner just walked around, not realizing this was the problem. There was a couple sitting next to us, waiting to be served and noone came to them! They finally left. I like their cake and coffee, but next time, I'll probably just take it to go. Shame on you for doing the business like this.", "author": "Charity T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-27", "description": "Scrumptious and amazing pastries, muffins, cupcakes, cakes. Nice service. One star off for the lousy piss-weak coffee. Giant room for improvement.", "author": "Miklos P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-08", "description": "Mia's is great - really good stuff and a cool outdoor area to sit in the back.  The staff is really friendly too.  They are always so nice to my 2 year old daughter.  I highly recommend their cookies - we are kind of obsessed with them.  A+", "author": "Michael M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-29", "description": "Great selection of cakes, cupcakes etc. had the coconut cake and 7 layer cake -both were divine! very moist and rich.", "author": "Catherine L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-04", "description": "Love their cup cakes, my son had recently brought me a strawberry cheesecake for my birthday. It was amazing.", "author": "Joyce B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-26", "description": "Had a craving for something sweet and I was in the neighborhood so I decided to stop in.  I had a very difficult time deciding what to get because everything looked so delicious and too pretty to eat.  I finally settled on a slice of the Tiramisu.  I took it to go and could not wait to eat it when I got back home.\n\nWell...my patience was rewarded!  The first bite I took out of this cake was breathtaking.  I thought it was going to be heavy but it was lighter than air.  It was just the right amount of sweetness and I could really taste the coffee flavor in a good way.  The outside also had crisp ladyfingers that contrasted well with the soft cake.  I am really impressed.\n\nThis was a perfect way to end my night.  I can't wait to come back and try more.", "author": "Sarah L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-23", "description": "Best Bakery in Brooklyn. The Red velvet cakes are delicious. Not too sweet but just right.  The bakery also is a small restaurant. You can take a table and enjoy coffee and delicious slice of cake. The display is beautiful. There are cup cakes, brownies, cheese cakes , donuts . I love their coconut cakes. They even have Donuts with maple syrup and bacons on top...sound strange? but it's simple delicious . In the middle of busy Smith street, this Bakery also has an outdoor sitting in the back, nice and quiet, just wonderful little place either to enjoy ham  croissant for breakfast or a slice of cake in afternoon. Highly recommended.", "author": "TH B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-06-04", "description": "The coconut slice is very good actually thats the only good dessert you guys have that taste good everything else is horrible and dry . The manager mike is very rude and disgusting coughs on everything and never uses a glove u guys need new management .. Your bakery sucks whoever the owner is", "author": "Danny H."}], "servesCuisine": "Cafes", "priceRange": "Under $10", "name": "Mia’s Bakery", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "139 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/SM4ZOzR354iQi9Xvf1b68g/ls.jpg", "@type": "Restaurant", "telephone": "+13479873194"}