{"aggregateRating": {"reviewCount": 12, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-11-24", "description": "When this place was the 3 in 1 Deli, I hated it because they could only put limp, flavorless bacon on the borough's worst bacon egg and cheese.\n\nWhen this place was Blue Cafe,* I hated it because of the awful service and the disorganized line, and the fact that they couldn't make a proper sandwich.\n\nNow that this place is a Krispy Krunchy Chicken, I hate it for:\n\n1. Having surprisingly good chicken tenders and fried chicken available instantly, at such cheap prices for so much food.\n\n2. Being RIGHT THERE, and serving what I know is not the highest quality chicken...but making it taste good.\n\nLast time I walked in and ordered some chicken tenders, they just gave me fries and a biscuit without asking. Sure, I had to pay for them (they just gave me the meal), but I enjoyed those fries and biscuit. \n\nI live so close. There is so much fried. It's way too easy. \n\nThis is why people get fat. \n_____________\n\n*It still kind of is, seeing as how they just put Krispy Krunchy Chicken over the words \"Blue Cafe\" on the new sign.", "author": "Peter D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-03-27", "description": "Their customer service sucks. The food smells and looks good but taste like total crap. They are tricky so make sure to count your change and make sure u leave with all your items because they will \" pretend \" to put things in your bag even when the business is slow. I wouldn't order from this place again waste of money save your pennies and your nerves.", "author": "E M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-13", "description": "Never again, I should have known the way the chicken had this awful smell that I shouldn't have eaten it and returned it. But I started to eat it and overtime realized that the chicken had a really pungent smell, that got worse as I traveled home. By the time I got home I couldn't even handle the smell. About 30 minutes after arriving home I began to show signs of food poisoning, I have never been this sick after eating fried chicken in my life. But I will also never forget the smell that day, I feel like the chicken was sour long before they fried it.", "author": "Lo N."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-11-30", "description": "Everything is kind of gross the fried chicken is decent but the gyro is not even edible the philly cheese steak sub is $9.99 but is of a $5 subway sub quality if you could even compare it to that.", "author": "Bob D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-01", "description": "Always almost no waiting time. Their fried chicken is just a little above the average but always super crispy and nicely flavoured. What do you ask for quick bite? There is eat in area and next to a subway exit that is super convenient. Best quick bite in the area.", "author": "Kristine S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-26", "description": "I asked for a whole wheat bagel with jelly and cream cheese but apparently that's too hard to understand for these people cause they got me a bagel with cream cheese and bacon instead, disgusting! And I don't even eat meat. Listening to your customers can't be that hard", "author": "Ma N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-06", "description": "The Fried chicken are perfectly fried. And the biscuits with the honey butter glaze are amazing. But be sure to watch the pieces they pick out for out for you. One I ordered an 8pc Chickenand got an old (looked liked it was refried) piece of chicken.  Other than that the chicken is great! But you have to ask for kethup, hot sauce and other sauces. I think they charge for the specialty sauces.", "author": "Rachel R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-05", "description": "Ordered delivery to my hotel. First let's start with the fried chicken. It was sooooo delicious! Well seasoned with a tiny hint of spice. The shrimp order was 6 large crispy panko breaded shrimp that were perfectly fried. The chicken and shrimp both come with a biscuit that is tender and mouth watering. It is drizzled with some type of maple syrup glaze. I had a side of rice that was the perfect companion for the chicken. Finally the peach cobbler was the great ending to a fantastic meal! Most importantly, EVERYTHING WAS HOT!!!\nI highly recommend this place, the chicken alone is fresh juicy and tastier than any of the big franchised chains. I forgot to mention that the prices are great too!!!", "author": "Dehlia S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-16", "description": "This might be the best fried chicken I've had in NYC. I went in just before they closed and still found it crispy, and it was perfectly seasoned.", "author": "Adam B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-11", "description": "This is a good place for meetings. I came here with my partner and had ice coffee. They have a few tables for you to sit if you need a break from the hectic NYC life.", "author": "Jin Y."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-12-17", "description": "Do not try to order delivery or speak to management at this location. The food is too salty and will arrive cold and inedible. How bad can it be? If you really want to know, read on...\nI ordered food on a Saturday afternoon at 4:00 and the food arrived at 6:30 after given an estimated time of 45 minutes. I received a call from the restaurant 5 minutes after I ordered to confirm that I had placed the order. They already took my credit card info, yes- I wanted the food I paid for. I waited an hour before I called back. They said it's on its way. 15 minutes later no food and no manager to speak to. I asked to cancel my order at an hour and a half. Then, the driver arrives later and says our order isn't cancelled and we have to take the food. He seemed quite scared. I now think that I am not getting my money back for the order I cancelled. Still no manager to talk to. Seriously? On a Saturday at 6:30 no one is in charge? Service sucks and food was cold and gross. Save yourself the hassle there are better businesses out there that earn our business. I recommend Wangs or Hill Country for good fried chicken and good service.", "author": "Ipolani H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-07", "description": "The best chicken spot Downtown Bklyn!!!  The chicken is well seasoned, nice and crispy and not overly greasy!!!  Kicks all the other spots in the ass!!!", "author": "Enidm1273 .."}], "servesCuisine": "Chicken Shop", "priceRange": "Under $10", "name": "Krispy Krunchy Chicken", "address": {"addressLocality": "Downtown Brooklyn", "addressRegion": "NY", "streetAddress": "50 Hoyt St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/z58Hm7xjfcgVXP_e2WYEaQ/ls.jpg", "@type": "Restaurant", "telephone": "+17185220888"}